{
    "poll_list": [
        {
            "id": "0x0f3592ac3e437870affacc5fc64ce3c266b5041e24a3a31e490021d00d8dbd7f",
            "title": "Proposal D: Governance Fund Phase 1 - Mean Finance",
            "discussion": "https://gov.optimism.io/t/ready-gf-phase-1-proposal-mean-finance/2537",
            "body": "This Governance Fund Phase 1 proposal has been marked ready and as such is eligible for voting in Cycle 2. This proposal HAS been approved as ready for vote by a delegate. For more info, check out Voting Cycle 2 Roundup: [https://gov.optimism.io/t/voting-cycle-2-roundup/2754](https://gov.optimism.io/t/voting-cycle-2-roundup/2754)\n\nLink to proposal: https://gov.optimism.io/t/ready-gf-phase-1-proposal-mean-finance/2537",
            "choices": [
                "Yes",
                "No",
                "Abstain"
            ],
            "scores": [
                12265035.190995283,
                5795673.998875306,
                141044.70160893584
            ],
            "start": 1656011535,
            "end": 1657134735,
            "snapshot": "12841969",
            "state": "closed",
            "author": "0x47C88bb92B409fF25F6587EA611fac4e55f76007",
            "space": {
                "id": "opcollective.eth",
                "name": "Optimism Collective"
            }
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/ready-gf-phase-1-proposal-mean-finance/2537",
            "title": "[READY][GF: Phase 1 Proposal] Mean Finance ",
            "index": 2537,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Governance Fund: Phase 1"
            ],
            "tags": [
                "cycle-2",
                "passed"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/0xged",
                    "index": "1",
                    "likes": "26",
                    "time": "06/06/2022-22:55:47",
                    "content": "Project Name: Mean Finance Authors Name: @0xged Number of OP tokens requested: 300k L2 Recipient Address: optimism.mean-finance.eth (0x308810881807189cAe91950888b2cB73A1CC5920) Relevant Usage Metrics (as of June 21st):  Latest TVL can be checked on Defi Llama  Unique addresses: 1607 Total positions: 2481 Volume traded: ~900k Total swaps executed for users (Optimism): 24116 Total mean finance executions (Optimism): 271 Total cost of executing user swaps (Optimism): ~$215 Average cost of each user swap (Optimism): $0.0089 Gas costs saved for users (Optimism): $14470  Optimism alignment: Mean Finance and Optimism are aligned on a fundamental level. Our main product enables users to dollar cost average from any ERC20 into any ERC20 with their preferred period frequency without the user having to pay gas costs for each trade, while still being decentralized, open and traceable.Not only our protocol aligns with Optimism’s general philosophy, but our users do too: DCA is considered to be a long term investment strategy, trying to get the best average entry price over time. In other words, being Optimistic about the future. From a technical standpoint as OP we aim to be completely scalable by design: Our costs will be the same if we execute 1 million trades or if we execute just one. Basically creating scalability at the app layer, on top of scalability on the execution layer (L2), on top of scalability on the consensus layer (L1). A little recap about our scalability data: https://twitter.com/mean_fi/status/15020361694288158873. Additionally, we consider our oracle infrastructure a public good since its open source and it builds (and hardens) upon Uniswap’s V3 TWAPs and Chainlink. Equally important, we’ve worked to improve lower the entry barrier for developers to use Uniswap’s V3 TWAPs through their grants program. More info on this: https://twitter.com/mean_fi/status/1537854948398010374 Lastly, we’ve shown our passion and compromise for the Optimism network by deploying our Beta version (December 8th of 2021, well before $OP token hunters show up) while onboarding new cohorts of users (via allow-listing Lobster DAOs’ members, and several LATAM related POAPs) that didn’t have other incentives to join the network at that time. How will the OP tokens be distributed?   Subsidies (45%) The main goal of this part of the distribution will be to incentivize the creation of DCA positions continuously. We aim to provide the possibility of a zero cost deposit by covering the  transaction fee for our users with certain base requirements as to avoid gaming the incentive system. Moreover, we would like to reimburse 25% of the swap fee (this is the percentage of the swap fee the protocol takes) in $OP as a distribution mechanism for real Optimism users.   Builders (30%) We know our trustless and open DCA primitive is just the tip of the iceberg and can be the base for new DeFi initiatives. That is why we want to create grants, bounties and incentives for builders and protocols to create new products, integrations and strategies while having our product be a core part of them.   Growth strategies and community engagement (20%) This is to help in the outreach of new community members (while maintaining and growing engagement of our current community) by creating and incentivizing behavior through trading competition, users quests, and more!   Early adopters (5%) We want to thank all genuine users created positions and used Mean Finance on Optimism in the most early stages.   Percentages may change a bit in the process of iterating and measuring impact. How will this distribution incentivize usage and liquidity on Optimism? If conditions are met, users will be able to create long term DCA trades that will get their gas and fees cost paid (retroactively, since we have no on-chain mechanisms for that), basically getting near-to-zero cost on their trades. This is something we think will bring a lot of new liquidity and users to the platforms. Additionally our default market maker looks for liquidity on decentralized money legos already deployed on Optimism such as Uniswap and 0x, therefore increasing traded volume and liquidity providers’ APY. Last but not least, we are also developing a product for DCA-ing with yield generated by other dapps. Meaning that users of this new product will need to lock their capital (to be lend, liquidity providing, etc.) in other Optimism deployed protocols, increasing TVL on the network. Why will the incentivized users and liquidity remain after incentives dry up? As Optimism we believe in having a long term vision for the ecosystem, and that is why we have focused on growing organically our community. Implemented incentives will continue in the same line of thought, searching for the balance between fair incentives and organic use of both Optimism and Mean Finance. Also, we’ve got some products on our pipeline that will need users to lock capital in the network. Over what period of time will the tokens be distributed? We anticipate that these incentives will be distributed over a 6-18 months time frame. How much will your project match in co-incentives? We currently don’t have a token, so monetary incentives can’t be matched. ",
                    "links": [
                        "https://defillama.com/protocol/mean-finance",
                        "https://twitter.com/mean_fi/status/1502036169428815887",
                        "https://github.com/Mean-Finance/dca-v2-core/tree/main/contracts/oracles",
                        "https://twitter.com/mean_fi/status/1537854948398010374",
                        "https://gov.optimism.io/t/voting-cycle-2-roundup/2754",
                        "https://gov.optimism.io/t/gfx-labs-delegate-communication-thread/2728/3"
                    ],
                    "GPT-summary": "The post is a proposal for Mean Finance, a decentralized protocol that enables users to dollar cost average from any ERC20 into any ERC20 with their preferred period frequency without the user having to pay gas costs for each trade. The proposal explains the project's alignment with Optimism's philosophy and its scalability data. The post also details how the OP tokens will be distributed and how the distribution will incentivize usage and liquidity on Optimism. The proposal is entirely positive, but it also includes constructive criticism and a call for collaboration.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Interoperability and Scaleability",
                        "Community and engagement"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.297682930495431
                },
                {
                    "author_link": "https://gov.optimism.io/u/polblancoo",
                    "index": "2",
                    "likes": "4",
                    "time": "07/06/2022-00:27:02",
                    "content": "You have my support. Great Idea. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Robor2b102",
                    "index": "3",
                    "likes": "2",
                    "time": "07/06/2022-09:16:04",
                    "content": "Love Mean and wholly support this proposal. Excited to see what innovations are built on it over the next few months! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.3125
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "4",
                    "likes": "3",
                    "time": "07/06/2022-12:38:37",
                    "content": "I think, you also need to post on discord under #gov-temp-check ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "5",
                    "likes": "0",
                    "time": "07/06/2022-12:40:34",
                    "content": "for more information, please check here:- Governance Fund Phase 1: How to Create a Proposal ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/0xged",
                    "index": "6",
                    "likes": "2",
                    "time": "07/06/2022-13:15:28",
                    "content": "Hey OPUser, we did  - we were the first to ask for #gov-temp-check to be made public hehe. Thanks for checking tho’! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "7",
                    "likes": "1",
                    "time": "07/06/2022-13:35:42",
                    "content": "got it, just saw that indeed you were the first one. gonna check later tonight. thanks ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/Defi_LATAM_axlvaz",
                    "index": "8",
                    "likes": "4",
                    "time": "07/06/2022-13:36:26",
                    "content": "Ya lo publicaron, es el primer mensaje    Discord   Discord - A New Way to Chat with Friends & Communities Discord is the easiest way to communicate over voice, video, and text.  Chat, hang out, and stay close with your friends and communities.      ",
                    "links": [
                        "https://discord.com/channels/667044843901681675/981971890165911572/982335896458260480"
                    ],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.681818181818182
                },
                {
                    "author_link": "https://gov.optimism.io/u/Justin",
                    "index": "9",
                    "likes": "2",
                    "time": "12/06/2022-22:05:58",
                    "content": "Good proposal.  Not many proposals that i have read propose using OP rewards for marketing and user onboarding - and i think this is a good idea for finding users that are a good fit and will therefore become long term users.  As far as the security section, i don’t see a straight line from these incentives to generating new users.  Curious for others’ thoughts on that as I am still relatively new to the space. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.214876033057851
                },
                {
                    "author_link": "https://gov.optimism.io/u/0xged",
                    "index": "10",
                    "likes": "0",
                    "time": "14/06/2022-17:42:14",
                    "content": "Hey Ja! Thanks for the feedback. Yeah, I don’t think security section is for engagement but for keeping Optimism’s users safe. As said there, I think the best part of that is that $OP tokens would only be paid out if a direct vulnerability that puts OP users funds at risk is found. Thanks for taking the time to read our proposal! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.708333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/Optimus",
                    "index": "11",
                    "likes": "0",
                    "time": "15/06/2022-12:52:39",
                    "content": "I don’t see how these incentives generates new users or improves the OP value. Specifically around Safety (dot point 5). Perhaps I am missing something here. If you could elaborate more on this that would be good. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.636363636363636
                },
                {
                    "author_link": "https://gov.optimism.io/u/Justin",
                    "index": "12",
                    "likes": "0",
                    "time": "18/06/2022-04:17:39",
                    "content": "If there is no direct vulnerability, what will you do with the tokens? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/0xged",
                    "index": "13",
                    "likes": "0",
                    "time": "18/06/2022-23:48:28",
                    "content": "Bug bounties usually don’t have a deadline, they are an ongoing security practice. So those tokens should / will not be used -unless publicly discussed through this forum or our discord- for other stuff. That being said, if Aave or some low-risk-battle-tested platform lists $OP, it would be a good idea to provide liquidity (as my comment above). Did you have other idea here to suggest?  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Constructive criticism of proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.166666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/Justin",
                    "index": "14",
                    "likes": "1",
                    "time": "19/06/2022-04:45:32",
                    "content": "Thanks for the info - The only additional thing I can think of is that if the tokens don’t get used after a certain amount of time, that they roll into one of the other allocation categories since these tokens are probably intended to be spent on incentives rather than held in reserve. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.189285714285714
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "15",
                    "likes": "1",
                    "time": "19/06/2022-11:11:56",
                    "content": "Hi @0xged moving from discord to here as we are closing on the proposal vote date and its better to get idea from other users as well. Two things, first, i would increase the builders rewards and second 30% of safety need more clarification. I assume those 30% will sit on the address unless a bug has been found, right? Do you have any timeline as how long you are planning to keep this bug bounty active? what will happen to those token once this period is over ? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.767113095238096
                },
                {
                    "author_link": "https://gov.optimism.io/u/Cryptoz",
                    "index": "16",
                    "likes": "1",
                    "time": "19/06/2022-11:30:46",
                    "content": "I honestly don’t see the value in this proposal. A project with 825k$ volume traded wanting 350k of OP, how will any of this benefit growth and adoption of Optimism? When I checked the distribution it seems:   Builders (15%) - You basically want to use Optimism funds to grow your project. I would see if this was mutual like you give grants to projects that integrate you and in return you do something for those projects. There is no clear information on this.   Growth strategies and community engagement (11.5%) - This seems to be for you to grow rather then as a airdrop or invective for user that may not already use Optimism to get on board.   Safety (30%) - This looks like you want Optimism to pay for your bug bounty, how does any of that drive adoption or usage?   Overall this proposal seems mainly for you to use funds to grow and develop out your project with little benefit in growing Optimism or providing value to the other projects in it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.336805555555555
                },
                {
                    "author_link": "https://gov.optimism.io/u/allera",
                    "index": "17",
                    "likes": "1",
                    "time": "19/06/2022-20:13:36",
                    "content": "Hi all, Loved the Protocol and the proposal. As per the OP distribution, I agree with OPUser’s questions about the clarifications needed for the 30% Safety allocation. As per cryptouser42’s comment, I’m afraid I have to disagree. Despite their traded volume, Mean Finance aims to allow users to DCA in a simple and seamless way. An L2 like Optimism should be a perfect fit for a Protocol like them. Safety allocation demands more explanations, but for the rest, I find plenty of value that such protocol may add to Optimism. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.993055555555555
                },
                {
                    "author_link": "https://gov.optimism.io/u/0xged",
                    "index": "18",
                    "likes": "3",
                    "time": "20/06/2022-15:16:02",
                    "content": "Okei, Safety allocation seems to be the one of the most heated points. I do see where y’all coming from tho. Just to share how our logic went about this:  Our biggest user base (by far) is Optimism. OP users might get hurt if a vulnerability is found (we still have an ongoing but bounty and audits tho).  Creating apathy on Optimism Maybe it doesn’t increase Optimism value directly, but it aims to avoid any negative impact on the network.   Tokens would not be dumped if a vulnerability is not found, therefore locked capital does not affect directly $OP value.  There a few changes that I can think of: a) Reduce the % dedicated to Security, increase Builders %. b) Reduce the % dedicated to Security, reduce overall $OP tokens asked. c) Remove security completely, reduce overall $OP tokens asked. d) Keep it as is. Of course, personally I’d like a, b or d. What do you guys think? @allera @OPUser @Justin Thanks everyone for taking the time for giving us feedback and helping improve the proposal  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.916666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/0xged",
                    "index": "19",
                    "likes": "0",
                    "time": "20/06/2022-15:28:12",
                    "content": "Hey there! I obviously don’t share the pov of us not adding value or growth to Optimism. We are a team of experienced builders creating novel, and decentralized products while having an Optimism-first approach. With the lack of experienced professional builders in the space I’d urge any project to try to engage and get developers to commit to an Ethereum aligned network. But this is all my personal opinion, and not the team’s. I just think is a good point to raise  Now, in terms of the distribution: - Builders: That is exactly what I meant to propose. Maybe (since I’m not english native speaking) I was not clear enough when drafting the proposal. - Growth strategies and community engagement: Yes, its for us to grow (on Optimism). I don’t see value on your counter-proposal. Airdropping has already been done. This is for growth, keeping community engaged (positive sentiment feedback loop) and user acquisition focused on Optimism. Additionally, our current smart contracts wouldn’t allow us for liquidity mining, which we can also debate on “if it adds real value, or just buys interest”. - Safety: Added comment on the bottom of the post addressing what the logic was. Maybe my train-of-thought wasn’t intuitive or the community simply doesn’t agree, which is ok also. Again, I find a lot of value on your feedback so thanks for taking the time for reading our proposal and writing here anon. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.1592818945760115
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "20",
                    "likes": "3",
                    "time": "20/06/2022-15:37:11",
                    "content": "I agree with you on creating apathy, but risk is always there, defi is inherently risky and as a user we know that and that is why you have “T&C” pop-up/page on all the projects. I would move this 30% to Subsidies and Builders rewards. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Constructive criticism of proposal",
                        "3rd party giving entirely positive feedback on proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/allera",
                    "index": "21",
                    "likes": "1",
                    "time": "20/06/2022-17:20:58",
                    "content": "Hi,     0xged:     Maybe it doesn’t increase Optimism value directly, but it aims to avoid any negative impact on the network.      Totally agree.     0xged:  There a few changes that I can think of: a) Reduce the % dedicated to Security, increase Builders %.   This could be a good approach. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.300000000000001
                },
                {
                    "author_link": "https://gov.optimism.io/u/Justin",
                    "index": "22",
                    "likes": "4",
                    "time": "20/06/2022-22:04:54",
                    "content": "I agree that avoiding negative impacts to the network is good for Optimism, however if we approve token spend on any activity that could potentially avoid a negative impact, then we could conceivably fund all kinds of activities that may not be in the spirit of the governance fund. I have been a purist when reviewing these proposals and have been focused narrowly on incentivizing usage and liquidity.  However, most of the proposals have components that do not incentivize usage and liquidity - so clearly it is acceptable to the community. The question for me is: how much is reasonable?  Safety + Builders + Early users  = 48.5%, too big of a % in my opinion.  My pragmatic advice would be to reduce or, better, eliminate the security % and allocate to subsidies.  Since DCA is really only possible on L2, then marketing activities that promote Mean’s capabilities also promotes Optimism’s capabilities - so i think it could make sense to also spend more on marketing as you proposed with the 11.5% that you already allocated there. As a user and fan of Mean Finance, I think that once you use it once you are going to use it a lot.  That’s why i personally believe that the best use of funds is to spend 100% on incentivizing users to open their first position or first few positions.  I’d encourage you not to do what Ricochet did and offer up n amount of tokens per day per stream - that clearly was used by mercenaries who didn’t stick around.  But if people can learn about DCA and try it with a position or two - you are going to create users for life. This is all my personal opinion and my opinion only.  I appreciate everyone else’s comments as well. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.5975
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "23",
                    "likes": "3",
                    "time": "20/06/2022-22:35:33",
                    "content": "for what it’s worth, I do enjoy reading your thoughts, clear, precise, full of information and input. Thank you for that, Justin. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.550000000000001
                },
                {
                    "author_link": "https://gov.optimism.io/u/Justin",
                    "index": "24",
                    "likes": "2",
                    "time": "20/06/2022-23:29:06",
                    "content": "Thanks @OPUser.  I’m trying to find my lane in blockchain and governance is interesting.  I appreciate your comments as well. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/0xged",
                    "index": "25",
                    "likes": "2",
                    "time": "21/06/2022-00:30:27",
                    "content": "Thanks everyone for the comments - I’ll be looking to editing the proposal before June 22 and set it up as live and not draft. I’m happy that you guys are going through the proposals, thanks for helping us make our proposal more truthful to what the purpose of the Phase #1 is. @Justin I’m really happy you are using our product - as always, more feedback welcome in our discord. ",
                    "links": [
                        "https://gov.optimism.io/t/voting-cycle-2-roundup/2754"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.464646464646465
                },
                {
                    "author_link": "https://gov.optimism.io/u/0xged",
                    "index": "26",
                    "likes": "4",
                    "time": "21/06/2022-19:43:29",
                    "content": "After taking all community comments into consideration, we’ve re-defined token distribution. Since Safety section was taken out due to discrepancies about the value alignment with this phase of the grant we’ve decided to reduce the amount of OP tokens requested. Thanks everyone that helped with their feedback, through this forum or our Discord! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.3125
                },
                {
                    "author_link": "https://gov.optimism.io/u/kryos.eth",
                    "index": "27",
                    "likes": "2",
                    "time": "23/06/2022-20:25:47",
                    "content": "Not a bad plan, I support this. I think it could be BETTER, but there are certainly worse proposals out there too. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/0xged",
                    "index": "28",
                    "likes": "0",
                    "time": "24/06/2022-01:56:04",
                    "content": "Hey kyros! Thanks. Although we’ve already submitted the proposal I’d love to have your feedback, even in our discord so the community can comment too, or wherever. I think most proposals aim to do liquidity mining incentives, which we do not still have, and also we do not have a token (at least yet), so matching incentives (which is something really important to signal commitment) could not be done. Hopefully we can prove this (and us, Mean Finance) add positive value to the Optimism Network, which I think we will through different public goods, infrastructure and tooling deployment. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.674873737373738
                },
                {
                    "author_link": "https://gov.optimism.io/u/tongnk",
                    "index": "29",
                    "likes": "0",
                    "time": "24/06/2022-02:23:45",
                    "content": "Have taken a quick look and I’m unsure about the value of this in the current environment. Would like to see more traction or a lower ask amount given relative TVL ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None"
                    ],
                    "Sentiment": 6.041666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/SEED_LATAM_Joxes",
                    "index": "30",
                    "likes": "3",
                    "time": "26/06/2022-03:53:36",
                    "content": "Hi @0xged and community. As a representative of DeFi LATAM and communities in the region, the majority spanish-speaking, Mean Finance is quite a popular protocol and even a reference when talking about Optimism here. It’s natural because the community follow its progress from its very early stages, as mentioned in the proposal. As DCA protocol is a very genuine and convenient case at this stage. In fact, I shared some ideas with team before the publication of the proposal, such as subsidies, understanding that this would arouse even more interest, knowing the needs of the users. Then, I’m OK with supporting the proposal, I agree with the feedback that others exposed and improvements made to it, optimistic that it will attract another class of user not only interested in DeFi, but ppl also thinking of acquiring long-term exposure in their favorite assets, through this and future (?) other strategies. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.040178571428571
                },
                {
                    "author_link": "https://gov.optimism.io/u/Defi_LATAM_axlvaz",
                    "index": "31",
                    "likes": "4",
                    "time": "26/06/2022-04:04:38",
                    "content": "Mean Finance has a different value proposition compared to other protocols (Dexes, Lending, metaverse, etc). Mean can attract many retail users, just look at the number of positions they have built in OP. This is not necessarily related to TVL.    Optimistic Ethereum L2 Explorer    Mean Finance - DCA Position (MF-DCA-P) Token Tracker | Optimism Mean Finance - DCA Position (MF-DCA-P) Token Tracker on Etherscan shows the price of the Token $0.0000, total supply 974, number of holders 756 and updated information of the token. The token tracker page also shows the analytics and historical data.      And most do not exceed $1K, it is a low risk tool ideal for non degen users, no whales with big bags. Mean Finance users are another target and I include myself, I usually put together monthly (when I get paid) a small position to buy ETH as savings. On the other hand the team is totally aligned with Optimisim’s vision. Look at the contribution they have made to the Optimisim ecosystem, surely many protocols will benefit from it.   twitter.com     @  It’s alive! It’s finally alive!! 🚀  We have just deployed our @Uniswap v3 oracle to @ethereum, @optimismPBC, @0xPolygon and @arbitrum (and their testnets)  Let's dive into what this means for DeFi, but first we want to thank @uniswapgrants for their support on this effort 🙏  🧵             GitHub    GitHub - Mean-Finance/uniswap-v3-oracle Contribute to Mean-Finance/uniswap-v3-oracle development by creating an account on GitHub.      To conclude I think it is a great project that can capture a market that the cryptodegen ecosystem has not been able to do yet. ",
                    "links": [
                        "https://optimistic.etherscan.io/token/0x6f54391fe0386d506b51d69deeb8b04e0544e088",
                        "https://twitter.com/mean_fi/status/1537854948398010374?s=20&t=e82nEa__cesSTCrfP8eI6A",
                        "https://twitter.com/mean_fi/status/1537854948398010374?s=20&t=e82nEa__cesSTCrfP8eI6A",
                        "https://twitter.com/mean_fi/status/1537854948398010374?s=20&t=e82nEa__cesSTCrfP8eI6A",
                        "https://twitter.com/mean_fi/status/1537854948398010374?s=20&t=e82nEa__cesSTCrfP8eI6A",
                        "https://github.com/Mean-Finance/uniswap-v3-oracle",
                        "https://github.com/Mean-Finance/uniswap-v3-oracle"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.383750000000001
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "32",
                    "likes": "4",
                    "time": "26/06/2022-11:38:30",
                    "content": "Voted: Yes Number of token request are reasonable. I do see that giving subsidies to DCAer would help bring liquidity as the asset will be locked in the chain. 45% is little t much but that also distributed between swap fee and DCAers . Rest 70% is well distributed. Will be watching this closely. Now, I am requesting your feedback on these of my ideas. Feedback is two-way approach, you help us and we help you.     Proposal to stop Phase 0 Projects to submit new proposal in Phase 1 💌 Ideas & Feedback       There were 20+ projects in Phase 0, some of them has a good plan to distribute the token while other does not. Here is an excellent summary by @MinimalGravitas .  Phase 0 officially concluded yesterday and soon OP will distribute 36M token between Phase 0 projects. Announcement  With this proposal, I want to share my idea and seeking your feedback on whether to allow Phase 0 projects to submit another funding proposal in phase 1 or not .  In my opinion, as long as previous funds are not exhauste…         Accountability of Phase 0/1 Funds given to projects 💌 Ideas & Feedback       That is a good question, and this is what I was thinking.  For integration fund, one example will be Infinity Wallet proposal where 80% is going for dev and integration - Let’s say project A is giving some incentive to project B for their integration, in this case I think it would not be a problem to share their address as both are public application.  For marketing and content creation (for example 80% Marketing proposal of Kromatika Proposal): - This depends on content creator(s), if they are …     ",
                    "links": [
                        "https://gov.optimism.io/t/voting-cycle-1-roundup/2619/34",
                        "https://twitter.com/OptimismGov/status/1540049300025114624?s=20&t=76-46b_Z3VdB9yBPrLU1UQ",
                        "https://gov.optimism.io/t/accountability-of-phase-0-1-funds-given-to-projects/2762/3",
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-infinity-wallet/2713/8",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-kromatika/2650/13",
                        "https://gov.optimism.io/t/opuser-delegate-communication-thread/2777/5",
                        "https://gov.optimism.io/t/voting-cycle-2-roundup/2754/45"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.09418044077135
                },
                {
                    "author_link": "https://gov.optimism.io/u/ScaleWeb3",
                    "index": "33",
                    "likes": "3",
                    "time": "26/06/2022-12:10:49",
                    "content": "This proposal fits into Gov Fund Phase 1 and adds value to Optimism: Voting Yes Value-add: Good Amount: Reasonable Op distribution: Good Co-incentives: None Mean Finance is well-aligned with Optimism and we see good value in the proposal, generally in DCA in a low-transaction-cost environment, and the specific adoption of it throughout the Optimism ecosystem. There are no monetary co-incentives but the project’s initial steps on Optimism as well as the overall incentive distribution and marketing will be beneficial to Optimism growth. Looking forward to additional projects building(-in) DCA &or on top of Mean Finance. ",
                    "links": [
                        "https://gov.optimism.io/t/stablenode-delegate-thread/2973/3"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.011363636363636
                },
                {
                    "author_link": "https://gov.optimism.io/u/linda",
                    "index": "34",
                    "likes": "2",
                    "time": "27/06/2022-15:41:25",
                    "content": "Thanks for the proposal. I like that you are enabling easy dollar cost averaging for users but I don’t think the metrics (e.g. TVL, trading volume) are at a place where it would be the best use of funds for Optimism at this stage especially relative to the amount requested. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 7.041666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/0xged",
                    "index": "35",
                    "likes": "7",
                    "time": "27/06/2022-19:14:25",
                    "content": "Hey linda! Thanks for taking the time to read our proposal. The only comment I’ll make is (and not directed only at you, but all delegatoorrrrs): Please, try to look a bit further and not only into metrics. Look into novel protocols, dedicated teams that are going to hustle their way and become a key part on Optimism. Having said that, although you are probably going to pass on our proposal I appreciate your work! I’ll keep being Optimistic  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.166666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/fewol",
                    "index": "36",
                    "likes": "1",
                    "time": "27/06/2022-19:35:53",
                    "content": "Mean Finance is a good project for DCA  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.96875
                },
                {
                    "author_link": "https://gov.optimism.io/u/polynya",
                    "index": "37",
                    "likes": "3",
                    "time": "28/06/2022-04:00:35",
                    "content": "Cheap ways to DCA with on-chain security is an interesting usecase. Happy to support the proposal, but I’d suggest that the main challenge here would be to on-board CEX users. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.333333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/0xged",
                    "index": "38",
                    "likes": "2",
                    "time": "28/06/2022-13:57:55",
                    "content": "Yeap. For sure. We do have on our roadmap adding some fiat-on ramp like mtpelerin, but also know that CEX users will “only” join if UX is top notch, since probably they are not savvy DeFi users. We hope that also our new upcoming products help on decentralizing trading tools, improving our capital efficiency (let your assets gain yield while dcaing) and more stuff coming soon. Thank you for your support polynya, and also for your work! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.201704545454546
                },
                {
                    "author_link": "https://gov.optimism.io/u/lazeeeerlin",
                    "index": "39",
                    "likes": "1",
                    "time": "28/06/2022-15:56:27",
                    "content": "Very good project, I have used it a few times, and I feel that it is of great use to many people who invest ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.512499999999999
                },
                {
                    "author_link": "https://gov.optimism.io/u/SEED_LATAM_Joxes",
                    "index": "40",
                    "likes": "2",
                    "time": "30/06/2022-02:49:07",
                    "content": "    ScaleWeb3:  generally in DCA in a low-transaction-cost environment, and the specific adoption of it throughout the Optimism ecosystem. There are no monetary co-incentives but the project’s initial steps on Optimism as well as the overall incentive distribution and marketing will be beneficial to Optimism growth.   I have a similar vision, DCA protocol seems to me a very attractive area (and more so these days), it would be good for Optimism to become the home of this new type of user. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party giving entirely positive feedback on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.325757575757576
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "41",
                    "likes": "2",
                    "time": "03/07/2022-14:36:14",
                    "content": "I feel a lot of responsibility here as my vote seems to probably be defining the end result as one of the big delegates who has not yet voted. I am a bit torn but I am leaning towards and will vote YES. PROS  Very good match for optimism. I have not used mean finance myself but after reading the proposal I would like to give it a try. I believe DCA is one of the most effective strategies and do it myself outside of crypto too and I find it cool to see a crypto project geared towards it. And agree that DCA + L2 like optimism are a match made in heaven. Good distribution The team seems to be open to feedback, judging by what I read in this post, and adjusted the proposal already. This generally gives me a very positive feeling that they will be able to work with us and improve optimism.  CONS  Low usage/metrics Not keen on the early adopters part of the allocation.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.318912337662336
                },
                {
                    "author_link": "https://gov.optimism.io/u/0xged",
                    "index": "42",
                    "likes": "0",
                    "time": "03/07/2022-16:34:35",
                    "content": "Hey @lefterisjp, Thank you for trusting us and the value we might add to the Optimism ecosystem. We will do our best to execute this responsibly, and to the best of our abilities. We also hope to keep bringing public goods, quality and tools for all developers that might want to join. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/linda",
                    "index": "43",
                    "likes": "5",
                    "time": "03/07/2022-18:00:48",
                    "content": "After doing another review of this proposal (in response to CryptoChica’s tweet that Mean Finance “is a very well-known and used protocol in Latam”), I updated my vote from no to yes. While the metrics/usage is early, I want to support Optimism’s ecosystem growth in Latam (it’s not a region for crypto adoption I have expertise on) and I recognize the early set of users might be retail and not necessarily higher volume. As I commented above, I am a fan of enabling easy dollar cost averaging for users so this positive use case plus considering further adoption of Optimism in Latam and a reasonable token amount requested is something I can get comfortable with. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party giving entirely positive feedback on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.555957300275482
                },
                {
                    "author_link": "https://gov.optimism.io/u/0xged",
                    "index": "44",
                    "likes": "2",
                    "time": "03/07/2022-18:23:02",
                    "content": "Linda, We’ve already thank you through twitter - but again: Thank you. We feel double the responsibility on your votes (changing a no for a yes, publicly, it takes courage), plus you are voicing a lot of delegated votes also. We will do our best to make the best of it, and improve the Optimism ecosystem as much as we can. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 7.199999999999999
                },
                {
                    "author_link": "https://gov.optimism.io/u/krzkaczor",
                    "index": "45",
                    "likes": "0",
                    "time": "05/07/2022-19:08:36",
                    "content": " I’ll vote YES  (but I am not 100% convinced) Project quality: Mid - DCA is important primitive but it’s not exactly ground breaking. Low TVL. Can’t wait to see what else team has in store. Team quality: ? - Hard to asses, I think it’s mostly anon but GH is very active Amount requested: Reasonable-High OP distribution: So, so. Most OP spent on LM. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.394444444444444
                },
                {
                    "author_link": "https://gov.optimism.io/u/danelund.eth",
                    "index": "46",
                    "likes": "0",
                    "time": "06/07/2022-15:18:29",
                    "content": "I am voting no on this proposal. The heavy use of $OP for subsidies is likely to create a market distortion that is unsustainable. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/fig",
                    "index": "47",
                    "likes": "0",
                    "time": "07/07/2022-13:37:36",
                    "content": "This is a lot of words and abbreviations.     0xged:  Lastly, we’ve shown our passion and compromise for the Optimism network by deploying our Beta version (December 8th of 2021, well before $OP token hunters show up) while onboarding new cohorts of users (via allow-listing Lobster DAOs’ members, and several LATAM related POAPs) that didn’t have other incentives to join the network at that time.   Seems as if you deployed on Optimism at first in December and have migrated to full deployment with 18 pairs. Am I right in that understanding? Sounds like you were close to hitting the Phase 0 requirements but were a bit below due to TVL. Using this criteria projects with $1,000,000 TVL were entitled to 300,000 OP. Mean’s TVL seems to be around half of this - $590,042 as of 7/7. Would it be fair to use this initial-phase framework to better understand a fair amount of OP? If so, it seems a more appropriate and proportional ask would be 177,000 OP. This is 59% of the 1,000,000 TVL allocation. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.168470418470418
                },
                {
                    "author_link": "https://gov.optimism.io/u/vonnie610",
                    "index": "48",
                    "likes": "1",
                    "time": "07/07/2022-18:50:48",
                    "content": "Snapshot vote - Passed ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/bobby",
                    "index": "49",
                    "likes": "1",
                    "time": "26/07/2022-23:10:28",
                    "content": "@0xged  can you provide a Telegram handle or other contact method so the Optimism team can get in touch about paying out this grant  Feel free to comment on this thread, DM, or email bobby@optimism.io. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.6875
                },
                {
                    "author_link": "https://gov.optimism.io/u/0xged",
                    "index": "50",
                    "likes": "0",
                    "time": "28/07/2022-14:18:58",
                    "content": "Contact me via @oxged on Telegram - shoot me yours via DM if needed  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "51",
                    "likes": "0",
                    "time": "13/09/2022-19:54:42",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "52",
                    "likes": "0",
                    "time": "05/01/2023-19:12:07",
                    "content": "Hi @0xged! It’s been several months since your OP grant was distributed, checking in to see if you have a grant update you can share with the community? Update provided here: Mean Finance Grant Update 1 ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.21875
                }
            ]
        }
    ],
    "group_index": "76"
}