{
    "poll_list": [
        {
            "id": "0x05126c50a6227f339b64d712e6bf070c769f410bcd7cdbe62ba6493ab49b08e6",
            "title": "Season 2: Cycle 8: EthernautDAO",
            "discussion": "https://gov.optimism.io/t/review-gf-phase-1-proposal-cycle-8-ethernautdao/3800/6",
            "body": "This Governance Fund Phase 1 proposal is eligible for voting in Cycle 8. This is the last Voting Cycle of Season 2. \n\nThis proposal was reviewed by the [Tooling Committee](https://gov.optimism.io/t/tooling-committee-season-2-recommendations/3551)[.](https://gov.optimism.io/t/defi-committee-c-season-2-recommendations/3437/12?u=lavande) You can find committee recommendations below:\n[Tooling Committee Recommendations](https://gov.optimism.io/t/tooling-committee-season-2-recommendations/3551)\n    \nBy approving committees, the Token House entered a social contract to entrust and delegate the bulk of decision-making to official committees. However, delegates may vote against the recommendation of official committees but should provide a justification to the community as to why they voted differently.",
            "choices": [
                "For",
                "Against",
                "Abstain"
            ],
            "scores": [
                16181464.71453256,
                76181.39697004716,
                185693.02662236427
            ],
            "start": 1667513623,
            "end": 1668111223,
            "snapshot": "30456637",
            "state": "closed",
            "author": "0x83E54889754e737Fb3CdF07BAaCC0eB9699B6Bdd",
            "space": {
                "id": "opcollective.eth",
                "name": "Optimism Collective"
            }
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/review-gf-phase-1-proposal-cycle-8-ethernautdao/3800",
            "title": "[Review] [GF: Phase 1 Proposal Cycle 8] EthernautDAO ",
            "index": 3800,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Governance Fund: Phase 1"
            ],
            "tags": [
                "season-2",
                "passed",
                "cycle-8"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "1",
                    "likes": "3",
                    "time": "24/10/2022-19:47:50",
                    "content": "Project Name: EthernautDAO For those who read previous proposals Preformatted text are the only changes and new additions are at the end. We don’t like to waste anyone’s time. Author Name: Dhannte, Twitter: https://twitter.com/DhannteG Reliable point of contact: Discord all dms open: #Dhannte1010 Twitter all dms open I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: [Yes/No] Yes I understand L2 Recipient Address: EthernautDAO multisig: 0x2431BFA47bB3d494Bd720FaC71960F27a54b6FE7 Signers:     Alejandro Santander theethernaut.eth     Gonzalo Diez dhannte.eth   Alberto Cuesta Cañada albertocuesta.eth   Ralf platschi.eth   Matias Lescano 0x117A5B25cEBb440C768a8dBFab0B4C0C2790Cb82   Sebas saeta.eth   Will wschwab.eth   Mario m4rio.eth    Grant category: Is this proposal applicable to a specific committee? [y/n, link to the committee] Yes, Tooling Project description (please explain how your project works): What is Ethernaut DAO It is a senior developer’s bridge from web2 to web3. As we see Ethereum’s body grow we need the head to get bigger too and this means people who can program smart contracts.  How does it work  3 types of mentorship  For a team (the project provides the mentor) Public good (someone wants to give free knowledge) Recruiting (a project asks the DAO for a mentor and pays)   We provide a place for mentors to post what they want to teach. Mentees apply for mentorship The mentor picks someone and the mentoring starts   Process We give guidelines on how this should be done, but each team, mentor, and mentees have its learning process and necessities. We believe in a 2-month process  First 2 weeks(4 hs/week): Low time effort, mentor and mentee talk about what the mentee knows, what he built, they set where to start. 3rd and 4th (6hs a week) week build or hack a small solidity project. 5th and 6th week (12 hs/week) start committing PRs for some project and start showing the mentee the value it can be borrowed to the space. (Start talking about salaries and possible positions and leave the web2 job) 7th and 8th week (20 hs/week) fully contributing.   Our difference  We are a public good project and we do not charge developers to learn nor mentors to teach. When mentorship is in progress we enable the mentor or mentee to ask for funds to cover the non-paid time they put in.  Project links:  Web: http://ethernautdao.io/   Mirror: https://ethernautdao.medium.com/  Twitter: https://twitter.com/EthernautDAO   GitHub: https://github.com/ethernautdao/   Gitbook https://docs.ethernautdao.io/  Discourse https://forum.ethernautdao.io/    Additional team member info (please link): Council members: The ethernaut: https://twitter.com/the_ethernaut theethernaut.eth https://github.com/ajsantander  Will Schwab: https://twitter.com/wschwab_ Wschwab.eth https://github.com/Wschwab  Mario https://twitter.com/m4rio_eth M4rio.eth Karmacoma: https://twitter.com/0xkarmacoma Karmacoma.eth https://github.com/karmacoma-eth  Ralf https://twitter.com/platschi Platschi.eth Dhannte (Gonzalo Diez) https://twitter.com/DhannteG Dhannte.eth Please link to any previous projects the team has meaningfully contributed: The Ethernaut: Synthetic core contributor / EthernautDAO founder Will: founding members of the ethereum cat herders, former Solidity team lead @ Linum Labs current: smart contracts team lead @ Polygon. Mario: optimarket, bears deluxe onchain game, security auditor. Karmacoma: showtime.xyz and smol-evm Ralf: Kwenta, OptiMarket Dhannte: EthernautDAO founder, BanklessDAO research guild founder. Relevant usage metrics (TVL, transactions, volume, unique addresses, etc. Optimism metrics preferred; please link to public sources such as Dune Analytics, etc.): 34 successful Solidity mentorships with new devs trained in less than 1 year, of which 80% are smart contract CC developers today for various projects on Optimism, such as Synthetix, Aelin, Kwenta, Yield, and Optimism itself. Competitors, peers, or similar projects (please link): only peers, DevDAO. Is/will this project be open-sourced? Yes Optimism native?: Yes Date of deployment/expected deployment on Optimism: deployed Ecosystem Value Proposition: Our main goal is to rapidly transform senior (web2) developers into senior Solidity developers. We do so by incentivizing experienced Solidity mentors but at the same time compensating those who create and share educational, curated and updated content for developers to follow and learn. Projects like Austin Griffith’s speed run, Ethernaut game from Open Zeppelin, and CryptoZombies are used by hundreds of devs and were never compensated properly. We are starting the distribution of Ethernaut EXP (ERC20 “soulbound” tokens on Optimism: EthernautExperience (EXP) Token Tracker | Optimism) to the community members who make these contributions, mentor new developers and add real value to the space (and a cool on-chain free-to-mint NFT to show off their experience level). We focus on pairing mentors and mentees for tailored mentorships and provide whatever they need. Our community is open and free to join, what we build is open source, and we focus on free educational content forever. We are a public goods DAO for developers adding verifiable value to the space.  Problem to solve:  We need more developers and better trained on how to bring big projects to Optimism.  How does your proposal offer a value proposition for solving the above problem?  By training senior developers actual teams can be expanded not only on the code side but also in coordination. It’s easy to have a 2/5 developer team but once it grows you need experienced developers in project managing to expand and grow. This seniority is only achievable with experience and those are the developers we want to migrate from the big web2 tech industry.  Why will this solution be a source of growth for the Optimism ecosystem?  Seniority will bring a more robust ecosystem, where quality and quantity will improve exponentially. EthernautDAO will become the way to go to expand developer teams that are always aligned with Optimim’s vision and culture. Has your project previously applied for an OP grant? If successful, please link to your previous grant proposal and provide a brief update on milestones achieved with the grant. If unsuccessful, and this is a resubmission, please specify how you have incorporated significant changes in accordance with feedback. We applied only as a Draft to get feedback and re-think how we wanted to apply. We never changed the Draft status: Old Proposal link 1  Old Proposal link 2  Number of OP tokens requested: 120.000 Did the project apply for or receive OP tokens through the Foundation Partner Fund?: No If OP tokens were requested from the Foundation Partner Fund, what was the amount?: How much will your project match in co-incentives? (not required but recommended, when applicable): Our fund will act as a pre-filter. Mentors will be able to ask for funds but those are going to be provided by the DAO’s own treasury. Only if the mentorship is successful and the new developer is hired into a project deploying in optimism OP tokens in the DAO treasury will cover the expenses. Proposal for token distribution: 60.000 OP will be given to future mentors. Each mentor will receive 3000 OP (if requested) for every successfully trained developer with up to 9000 OP until the pool dries up. When a mentor requests funds EthernautDAO will cover with its own treasury and only if successful the OP tokens will compensate the expense. We want to shield OP tokens from bad operators at our own expense. Trained devs will be tracked and reported in the forum when they integrate into any project deploying on Optimism. 60.000 OP will go to a monthly claim like this:   6 months 10.000 OP/monthly  We combine a soulbound token (EXP) given to educational contributors with OP tokens as a liquid and transferable asset. Any developer holding (EXP) will be enabled to proportionally claim OP tokens on a monthly basis. EXP is earned by mentoring (10 EXP), creating developer educational content (3 EXP), hacking smart contracts (3 EXP), and reporting those hacks with educational content (3 EXP). We encourage these community members to provide liquidity and vote for Optimism proposals, but we will not enforce them. Every user is free to use their OP tokens as they see fit. A Cap at 99 EXP is considered for now. Claimable OP will follow this function: F(x) = x5 - 4 Claimable OP = 5 * (EXP balance) - 4 This will result in 1EXP = 1 claimable OP 99 EXP (max lvl) = 491 claimable OP EthernautDAO will keep up to 40 ETH from donations in the treasury, with the surplus going to the Uniswap OP/ETH liquidity pool. This process will be rebalanced every 3 months. (OP tokens are not considered part of Ethernaut DAO 40 ETH treasury). NEW: Self Delegation:  EthernautDAO will not use this tokens for self delegation. OP refund policy: The monthly claim of OP tokens will start on December 1st and run for 6 months. Once this period is done all remaining OP tokens requested for mentors and monthly distribution, left in EthernautDAO treasury will go back to the Optimism Foundation. ",
                    "links": [
                        "http://ethernautdao.io/",
                        "https://ethernautdao.medium.com/",
                        "https://twitter.com/EthernautDAO",
                        "https://github.com/ethernautdao/",
                        "https://docs.ethernautdao.io/",
                        "https://forum.ethernautdao.io/",
                        "https://twitter.com/the_ethernaut",
                        "https://github.com/ajsantander",
                        "https://twitter.com/wschwab_",
                        "https://github.com/Wschwab",
                        "https://twitter.com/m4rio_eth",
                        "https://twitter.com/0xkarmacoma",
                        "https://github.com/karmacoma-eth",
                        "https://twitter.com/platschi",
                        "https://twitter.com/DhannteG",
                        "https://optimistic.etherscan.io/token/0x6354ce7509fb90d38f852f75b7a764eca6957629",
                        "https://gov.optimism.io/t/draft-gf-phase-1-ethernautdao-dev-education/2862",
                        "https://gov.optimism.io/t/review-gf-phase-1-proposal-cycle-7-ethernautdao/3500",
                        "https://gov.optimism.io/t/gfx-labs-delegate-communication-thread/2728/19",
                        "https://gov.optimism.io/t/voting-cycle-8-roundup/3742/7",
                        "https://gov.optimism.io/t/grant-council-reviewer-nominations/4372/6",
                        "https://gov.optimism.io/t/grant-council-reviewer-nominations/4372/3",
                        "https://gov.optimism.io/t/council-reviewer-self-nomination-gonna-eth-dhannte/4104"
                    ],
                    "GPT-summary": "The post is a proposal for EthernautDAO, a public good project that aims to train senior developers to become senior Solidity developers. The proposal explains how the project works, its goals, and how it plans to distribute OP tokens. The post also includes information about the team members, relevant usage metrics, and competitors. The proposal requests 120,000 OP tokens and outlines how they will be distributed. The post may benefit from constructive criticism and may prompt questions from third parties interested in collaborating or learning more about the project.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Smart contract updates",
                        "Interoperability and Scaleability",
                        "Token economics"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.773011500284228
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "2",
                    "likes": "3",
                    "time": "24/10/2022-20:41:46",
                    "content": "Summoning all developers with 0.5% delegation to see if anyone can give their approval: @lefterisjp Delegate Commitments - #9 by lefterisjp @ceresstation Delegate Commitments - #33 by ceresstation @jackanorak Delegate Commitments - #136 by jackanorak @krzkaczor Delegate Commitments - #47 by krzkaczor @david Delegate Commitments - #7 by david @mjs Delegate Commitments - #53 by mjs @jacob Delegate Commitments - #57 by jacob @yoavw Delegate Commitments - #40 by yoavw @pseudotheos Delegate Commitments - #5 by pseudotheos @DanieleSalatti Delegate Commitments - #51 by DanieleSalatti If you like this proposals please reply: ”I am an Optimism delegate [link to your delegate commitment] with sufficient voting power and I believe this proposal is ready to move to a vote.\" I gathered every delegate commitment link so you don’t have to, it is next to your tag. Thank you for your time. ",
                    "links": [
                        "https://gov.optimism.io/t/delegate-commitments/235/33",
                        "https://gov.optimism.io/t/delegate-commitments/235/136",
                        "https://gov.optimism.io/t/delegate-commitments/235/47",
                        "https://gov.optimism.io/t/delegate-commitments/235/7",
                        "https://gov.optimism.io/t/delegate-commitments/235/53",
                        "https://gov.optimism.io/t/delegate-commitments/235/57",
                        "https://gov.optimism.io/t/delegate-commitments/235/40",
                        "https://gov.optimism.io/t/delegate-commitments/235/5",
                        "https://gov.optimism.io/t/delegate-commitments/235/51"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/Defi_LATAM_axlvaz",
                    "index": "3",
                    "likes": "0",
                    "time": "25/10/2022-02:56:52",
                    "content": "Hi @Gonna.eth, it’s good to see EthernautDAO back, I think it’s a very good proposition for the Optimism ecosystem. I have a question, how do you plan to follow up with developers and what is the estimated time for them to be ready? Do you have more documentation on the process?     Gonna.eth:  How much will your project match in co-incentives? (not required but recommended, when applicable): Our fund will act as a pre-filter. Mentors will be able to ask for funds but those are going to be provided by the DAO’s own treasury. Only if the mentorship is successful and the new developer is hired into a project deploying in optimism OP tokens in the DAO treasury will cover the expenses.   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.0438016528925615
                },
                {
                    "author_link": "https://gov.optimism.io/u/runedao",
                    "index": "4",
                    "likes": "1",
                    "time": "25/10/2022-10:06:48",
                    "content": "Hi @Gonna.eth, the proposals looks good. Please provide some brief about other such existing initiatives so that your contribution stands out. Thanks ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.775
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "5",
                    "likes": "0",
                    "time": "25/10/2022-15:58:22",
                    "content": "    Defi_LATAM_axlvaz:  what is the estimated time for them to be ready? Do you have more documentation on the process?   Yes, we have a roadmap for all mentors to be used as a guide here if they want. You need to consider almost every mentorship done covers specific working positions. For example Manuel Araoz made one for full stack here, while Kelvin did on EVM here Our experience and mostly all of the mentorships we have taken 2 months.     Defi_LATAM_axlvaz:  how do you plan to follow up with developers   I would love to tell you there’s an automated process for this. The reality, this is my daily job. Every time a mentor selects their candidates I contact them every 15 days, I also announce on Twitter when the mentorship is over and where the mentee is working if they got hired. I want to trust a code 100% so I’m open to an automated process. We are in an early stage and I believe more awareness of EthernautDAO will bring solutions to this. I can’t scale but a code can for sure. I’m happy if you have any suggestions here. I will make a thread on EthernautDAO forum if a mentor receives OP tokens after a mentorship, providing all relevant information about the Optimism project the mentee is developing which means growth for the ecosystem. ",
                    "links": [
                        "https://forum.ethernautdao.io/t/manuel-araoz-full-stack-dapp-development/364",
                        "https://forum.ethernautdao.io/t/kelvin-from-optimism-is-looking-for-an-evm-expert-in-training/421"
                    ],
                    "GPT-discussion-categories": [],
                    "Sentiment": 6.673076923076923
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "6",
                    "likes": "0",
                    "time": "25/10/2022-16:22:19",
                    "content": "    runedao:  Please provide some brief about other such existing initiatives so that your contribution stands out.   By initiatives, I assume you mean past mentorships. You can see Alberto from yield in this proposal here and he hired: Devtooligan https://twitter.com/devtooligan Owleksiy https://twitter.com/owpckcr Alejandro from Synthetix made this one here and hired: Mati https://twitter.com/_mjlescano Leo who I don’t follow sorry Then he made one for Aelin and brought: Saeta https://twitter.com/saetaeth Alex did one for Badger and hired, Tabish who then worked for AAVE and founded code4arena Tabish https://twitter.com/tabishjshaikh?lang=en Jeremy Chiaramonte did one for Kwenta and hired: Jared https://twitter.com/Jared_Borders The DAO has a donation site here and basically, anyone opening a mentorship knew they could request funds. ",
                    "links": [
                        "https://twitter.com/yield",
                        "https://forum.ethernautdao.io/t/alberto-from-yield-protocol-is-looking-for-two-smart-contract-engineer-trainees/19",
                        "https://twitter.com/devtooligan",
                        "https://twitter.com/owpckcr",
                        "https://twitter.com/the_ethernaut",
                        "https://forum.ethernautdao.io/t/alejandro-from-synthetix-is-looking-for-a-smart-contract-engineer-trainee/22/29",
                        "https://twitter.com/_mjlescano",
                        "https://twitter.com/saetaeth",
                        "https://twitter.com/GalloDaSballo",
                        "https://twitter.com/tabishjshaikh?lang=en",
                        "https://twitter.com/_jchiaramonte",
                        "https://twitter.com/Jared_Borders",
                        "https://mint.ethernautdao.io/"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 4.010416666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "7",
                    "likes": "1",
                    "time": "25/10/2022-17:53:32",
                    "content": "    Gonna.eth:  Delegate Commitments - #136 by jackanorak   I’m a delegate with enough voting power Delegate Commitments - #136 by jackanorak and i think this is ready for a vote ",
                    "links": [
                        "https://gov.optimism.io/t/voting-cycle-8-roundup/3742/7"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/MattL",
                    "index": "8",
                    "likes": "1",
                    "time": "25/10/2022-18:10:17",
                    "content": "I am an Optimism delegate [Delegate Commitments - #65 by mastermojo] with sufficient voting power, and I believe this proposal is ready to move to a vote. The EthernautDAO is one of the best DAOs in all of DeFi, and I want to see it shine on Optimism. Great proposal! ",
                    "links": [
                        "https://gov.optimism.io/t/voting-cycle-8-roundup/3742/7"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 8.666666666666668
                },
                {
                    "author_link": "https://gov.optimism.io/u/yoavw",
                    "index": "9",
                    "likes": "1",
                    "time": "29/10/2022-00:11:08",
                    "content": "I am an Optimism delegate [Delegate Commitments - #40 by yoavw] with sufficient voting power and I believe this proposal is ready to move to a vote. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "10",
                    "likes": "0",
                    "time": "03/11/2022-20:14:36",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "11",
                    "likes": "0",
                    "time": "03/11/2022-20:55:07",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/ceresstation",
                    "index": "12",
                    "likes": "1",
                    "time": "04/11/2022-17:13:28",
                    "content": " 1. Presentation  We are an officially recognized Tooling Governance Committee, responsible for assessing proposals related to tooling and infrastructure (wallets, bridges etc.).  2- About the project  EthernautDAO is an organization aimed at helping developers transition from web2 to web3. While “there are millions of exceptionally skilled and experienced senior developers out there, senior Solidity developers remain scarce.” This project, if successful, would help improve the quality of developers in the Optimism ecosystem. Its mentorship model is one that’s been proven effective in other contexts, and would ensure any developer is vetted carefully before they join a new project. The ‘educational stipend’ component is a nice touch as well. EthernautDAO also works closely with Synthetix, which is an aligned ecosystem partner.  3- About the following  This proposal was updated for cycle-8 and now asks for 120,000, an 80% reduction from their initial request and larger than the reduction we recommended. We believe Ethernaut has also addressed a lot of the core concerns stated in the original proposal that led to it being blocked in cycle-6.  4- About the proposal valuation    Added value (good to bad): good. Education in Web3 and access to tools is currently a recurring problem, and Ethernaut is clearly making strides in this direction. There’s clearly value add by teaching more people solidity and placing them in relevant roles.  Impact or expected usage (high to low): medium. One downside of the mentorship model is simply scale, it’s unclear how many developers can be put through this program and whether it will scale with the needs of the Optimism ecosystem vs. something like the quests approach being undertaken now. It also requires consistent attention from the team cohort over cohort, and while this has been true in the past it needs to be maintained. We believe EthernautDAO is able to put in the effort required to continue scaling their impact over time.  Current Status [Development stage/Open Source?] (early to ready): ready. The project is active now and in use by Synthetix.  Expenditure plan and distribution (appropriate to inappropriate): appropriate We think the current distribution of tokens is good on a per developer basis. Ethernaut has provided solid background on throughput and expected growth. Our previous recommendation mentioned some doubts such as content quality, but we believe with the amount requested the experiment is contained enough to remove such concerns.  Amount requested (high to low): low. The amount and time frame were reduced to 120k in response to our previous recommendation, we believe that it is now manageable to see results for the next six months and impact on the use of funds.   5. KPIs and impact tracking We’d love to see continued updates on how each developer is trained and what measures of quality are being used (when is a developer ‘trained’), and what examples of educational content that have been effective thus far look like. We would recommend that Ethernaut be explicit in how it is prioritizing where to place developers, and that it provides consistent opportunities for the community to give feedback on this prioritization. We encourage the community stay in touch with the team if this proposal passes.  6- FINAL RECOMMENDATION: Yes We are happy with the authors for reducing the amount requested and time period. We appreciate their prompt replies to governance and formally invite them to reapply for more funds should they find success in their stated objectives during this first trial grant period. ",
                    "links": [
                        "https://gov.optimism.io/t/tooling-committee-season-2-recommendations/3551/12",
                        "https://gov.optimism.io/t/stablenode-delegate-communication-thread/2973/15",
                        "https://gov.optimism.io/t/tooling-committee-season-2-recommendations/3551/15",
                        "https://gov.optimism.io/t/gfx-labs-delegate-communication-thread/2728/19"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "3rd party asking questions about proposal",
                        "None"
                    ],
                    "Sentiment": 6.007352210630899
                },
                {
                    "author_link": "https://gov.optimism.io/u/katie",
                    "index": "13",
                    "likes": "1",
                    "time": "07/11/2022-19:22:20",
                    "content": "Voted yes - Following the Tooling Committee recommendation and love to see projects focusing on onboarding developers to Web 3. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/xiaoqie",
                    "index": "14",
                    "likes": "1",
                    "time": "07/11/2022-23:04:25",
                    "content": "very good  this is web3 world ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.549999999999999
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "15",
                    "likes": "0",
                    "time": "09/11/2022-13:08:27",
                    "content": "Following the tooling committee recommendation of which I am a member I am voting for this proposal.     ceresstation:  6- FINAL RECOMMENDATION: Yes We are happy with the authors for reducing the amount requested and time period. We appreciate their prompt replies to governance and formally invite them to reapply for more funds should they find success in their stated objectives during this first trial grant period.   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party auditing and reviewing proposal",
                        "3rd party giving entirely positive feedback on proposal"
                    ],
                    "Sentiment": 6.541666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "16",
                    "likes": "0",
                    "time": "14/11/2022-17:08:07",
                    "content": "Snapshot vote - passed ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "17",
                    "likes": "0",
                    "time": "14/11/2022-17:09:30",
                    "content": "@Gonna.eth can you provide a Telegram handle or other contact method so the Optimism team can get in touch about paying out this grant! Feel free to comment on this thread, DM, or email palash@optimism.io ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.609375
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "18",
                    "likes": "0",
                    "time": "14/11/2022-17:09:33",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "308"
}