{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/draft-gf-phase-1-proposal-paparuda/3677",
            "title": "[Draft][GF: Phase 1 Proposal] Paparuda ",
            "index": 3677,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Governance Fund: Phase 1"
            ],
            "tags": [
                "cycle-8"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/alexczet",
                    "index": "1",
                    "likes": "4",
                    "time": "11/10/2022-09:23:38",
                    "content": "Project name :Paparuda (A cloud, every day, forever) Author name and contact info (please provide a reliable point of contact for the project)**:**Discord : Ouranos#2059 Twitter : @paparudao @alexczet I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: Yes L2 recipient address : 0xf4CAC5BA9099Fd0620E00F1cb1c4ACDa3AF43212 Which Voting Cycle are you applying for?:Phase 1 - Cycle 8 Grant category: Water management, Arts, NFTs, Cryptoeconomics, DAO Is this proposal applicable to a specific committee? Unclear Project description (please explain how your project works)**:**Paparuda is a DAO, an NFT project and a Token (RAIN). Every day, a new Cloud NFT is generated from scientific data used to simulate clouds.  This cloud is put on auction (following the “Nouns” model).  The proceeds from the sale go towards the treasury of the “PaparuDAO”, a DAO that is composed of NFT holders, project leads, and an advisory board made of scientist and legal experts.  Every month, the DAO has to spend a certain percentage of its treasury on a subset of projects : 1.Lobby to give clouds an legal status 2.Producing artworks/exhibitions to raise awareness around the importance of clouds in our hydric future 3.Providing support to people in hydric stress/drought areas. When the cloud NFT was generated from meteorological data, it was assigned a certain amount of water in its composition.  If the owner of the NFT does not want to use the NFT as access to the DAO, they can “make it rain” and redeem RAIN tokens in direct correlation to the amount of water in the cloud.  The cloud is then re-assigned to the DAO to be sold on the secondary market. RAIN token supply will be directly correlated to the total amount of water in the atmosphere (about 130million cubic meters - hence 130 million tokens).  Initial token valuation will be driven by the price of water as a commodity on the day of token genesis. Project links:  Website:https://paparuda.cloud  Twitter:@paparudao  Please include all other relevant links below:White paper   Additional team member info (please link): Nicolas Wierinck (parallel.art) Maxime Berthou Please link to any previous projects the team has meaningfully contributed to: We have contributed to a variety of projects, but few in the crypto space.  Nicolas Wierinck and myself have startedparallel.art, an advisory for artists with no technical backgrounds to engage meaningfully with the web3 space Relevant usage metrics (TVL, transactions, volume, unique addresses, etc. Optimism metrics preferred; please link to public sources such as Dune Analytics, etc.):N/A Competitors, peers, or similar projects (please link)**:**N/A Is/will this project be open sourced? *In the future Optimism native?: Yes Date of deployment/expected deployment on Optimism : TBD, aiming for early 2023 depending on funding Ideal timeline is ->Receive funding late October/Early November ->Development of Cloud art, DAO constitution, Website dev, Smart Contract Dev through January 2023 ->Token launch January 2023 ->DAO launch and advisory board proposal framework early February 2023 ->First NFT auction late February 2023 Ecosystem Value Proposition We believe that people beyond the web3 space need to understand the value of operating in a “cryptoeconomic” fashion when it comes to public goods.  Deploying a similar project outside of the web3 field would require endless weeks of administrative jockeying, red tape, legal fees, accounting fees etc. Once it is stood up, the project will allow a subset of people who are not already engaged in the crypto space to understand how incentives can be deployed to make art and engagement work hand in hand with self and public interest.  Doing this on Optimism makes sense because of the ground level commitment to public goods, the deep connection with Ethereum (and thus ease of transaction).  We hope that this project will raise awareness to OP’s mission as well as to the need for harnessing the power and beauty of clouds for the greater good. What is the problem statement this proposal hopes to solve for the Optimism ecosystem? More users ? How does your proposal offer a value proposition solving the above problem? Engaging with people who are not yet onboarded to crypto and onramping them through Optimism Why will this solution be a source of growth for the Optimism ecosystem? 1/Larger externalities : if we take the concept of “public goods” to mean something beyond the blockchain ecosystem, we can see the idea of doing good as a general positive for humanity, and if this efforts emanates from a project running on Optimism, it directly ties optimism to this effort. Blockchains won’t grow beyond the existing “believers” if we all only focus on the growth of blockchain ecosystems themselves 2/Userbase growth : if we engage with our supporters by running the project on Optimism, we are encouraging people who maybe never used crypto to start with Optimism and lean about the ecosystem, and in consequence about the vision and ideas that fuel it. Has your project previously applied for an OP grant?  N/A Number of OP tokens requested:100,00 Did the project apply for or receive OP tokens through the Foundation Partner Fund?: No If OP tokens were requested from the Foundation Partner Fund, what was the amount? N/A How much will your project match in co-incentives? N/A Proposal for token distribution: Please see the tokenomic section of our white paper as it is quite specific to the project architecture The initial amount we are requesting will be broken down in -Cloud NFT development with our chosen partner (currently hoping to confirm Onformative) : Estimate 100k Euros.  This is the core element we need to get in place to be able to continue our fundraising.  Listed below are the other parts that we can build in the background while we create the core asset that will build the treasury.  -Website Development : Estimate 20k Euros -Smart Contract Development for NFTs, DAO and Tokens : Estimate 60 k Euros -Dapp Development for website : Estimate 20k Euros -Marketing & PR costs : Estimate 10k Euros for 2 months.  We are hoping to engage the folks from Digital Counsel -Travel costs to present the project at conferences/panels : Estimate 15k -Expenses for core team : Estimate 20k between Parallel and Maxime Berthou Please provide any additional information that will facilitate accountability: One idea would be to put the funds in a multisig wallet.  Every transaction would have to be signed by both a member of our team and a member of the OP Foundation. The only issue I foresee is that in some cases the vendors we have to pay would not take tokens and conversion to fiat would have to happen (which will be a taxable event for us, at about 15% since we are based in Belgium).  Not sure what other means of accountability could exist that that stage, but we are thinking of ways to ensure full trust and confidence in our fund distribution. ",
                    "links": [
                        "https://docs.google.com/document/d/1CPKClnVtwWInjlYYQj522DiX2LydxEcbwpAdC-hgKF8/edit",
                        "https://www.linkedin.com/in/nicolaswierinck/?originalSubdomain=be",
                        "https://linktr.ee/maximeberthou",
                        "https://parallel.art",
                        "https://docs.google.com/document/d/1CPKClnVtwWInjlYYQj522DiX2LydxEcbwpAdC-hgKF8/edit",
                        "https://onformative.com/",
                        "https://www.digitalcounsel.xyz/",
                        "https://parallel.art",
                        "https://linktr.ee/maximeberthou"
                    ],
                    "GPT-summary": "The post is a proposal for a project called Paparuda, which is a DAO, NFT project, and token that generates a new cloud NFT every day from scientific data used to simulate clouds. The cloud NFT is put on auction, and the proceeds go towards the treasury of the PaparuDAO, which is composed of NFT holders, project leads, and an advisory board made of scientists and legal experts. The post explains the project's workings, its value proposition, and the funding required for its development. The post also invites feedback, questions, and collaboration.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Token economics",
                        "Community and engagement",
                        "Law and regulations",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal",
                        "None"
                    ],
                    "Sentiment": 5.376328104923996
                },
                {
                    "author_link": "https://gov.optimism.io/u/jrocki.eth",
                    "index": "2",
                    "likes": "0",
                    "time": "11/10/2022-12:07:19",
                    "content": "This is a very unique project, thank you for submitting. I see you have linked the white paper which explains token distribution for the rain token but I am unclear what the 250k in $OP will be used for? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.21875
                },
                {
                    "author_link": "https://gov.optimism.io/u/alexczet",
                    "index": "3",
                    "likes": "2",
                    "time": "11/10/2022-13:40:10",
                    "content": "Hello Thanks, I’m glad you like it! We have two budgets we are working with, the first one that will get us to launch, and the second one to start operating the DAO and all the parts of the project. I’m happy to share those documents if helpful.  In short, the 250k will be used to 1/Pay for the development of the Cloud NFT 2/Pay for contract tooling (custom smart contracts, DAO contracts and tooling, RAIN token contract) 3/Pay for web development 4/Pay for marketing/PR efforts to raise awareness about the project 5/Pay for travel to present the project in conferences, panels, etc. 6/Cover some costs from the core team to be able to fully focus on the project. I hope this makes sense, happy to provide more detail. Thanks ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 6.7038690476190474
                },
                {
                    "author_link": "https://gov.optimism.io/u/Netrim",
                    "index": "4",
                    "likes": "0",
                    "time": "11/10/2022-15:35:09",
                    "content": "Definitely a very distinct project. The breakdown for OP needs to be included in the main post AND a specific timeline ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.927777777777777
                },
                {
                    "author_link": "https://gov.optimism.io/u/alexczet",
                    "index": "5",
                    "likes": "0",
                    "time": "11/10/2022-17:01:53",
                    "content": "Ok, thanks for that, I’ll edit the post. Regarding timeline, we have an ideal timeline, which I’ll add as well, but is subject to funding schedules etc. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.791666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "6",
                    "likes": "3",
                    "time": "11/10/2022-21:39:42",
                    "content": "Looks like a nice idea. Similar to what Optimism is trying to do with public good funding, Paparuda is  dedicated specifically to water. They will use NFT based voting instead of token based. Here is try to summarize their whitepaper, in short Paparuda whitepaper defines three parts (NFT, DAO and RAIN token) Cloud NFT :  Tradable on marketplace, when you buy a cloud NFT - a portion of fund goes to RAIN Token, to DAO and to DAO treasury Based on “Nouns NFT” logic- each day one new NFT Each NFT is unique(share, size, lighthing, and traits) Sold on Paparuda Website via auction, value depends on cloud NDF size ( water it could hold )  PaparuDAO - Manage all funds, they have some short term goal defined. Role:  Gated. NFT voting rather than token, One wallet one NFT water management and art as a force for common good legal status for clouds financial support to hydric stress community  DAO treasury will contains different token (RAIN token along with stablecoin and token) RAIN token - Act as DAO token with distribution plan as below - 20% (team token, might be sold to investors) 10% DAO 10% community 60% Cloud bursting fund (NFTs) Additional information related to fund use could help. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.783216783216783
                },
                {
                    "author_link": "https://gov.optimism.io/u/alexczet",
                    "index": "7",
                    "likes": "2",
                    "time": "12/10/2022-08:35:17",
                    "content": "Hello @OPUser !  Thanks for the summary. If I may, I’ll make a small correction : Cloud Token The NFT that is created daily is assigned a value in RAIN (based on the simulated water amount in the cloud) but that value in RAIN remains latent unless the buyer of the NFT decides to “make it RAIN”.  At that point the mechanics are that  Rain Tokens are taken from the DAO’s “Cloud Bursting” fund 90% of the water value in RAIN is given to the NFT holder The NFT is transferred to the DAO who can now sell it on the secondary market to prospective buyers, but the cloud will be “RAIN-less” at that point.  The idea is that the Cloud Bursting fund should be large enough to avoid a concerted cloud bursting event from all NFT holders (which seems unlikely since we are releasing a single cloud a day and it will take a long time for anyone to gather enough clouds to threaten the fund). The initial value of the Cloud NFT is not tied to the value in Water, but it purely driven by the auction. In other words, if you are lucky, you could buy a Cloud NFT for a value that is lower than its value in RAIN. I hope that helps clarify. Regarding the use of the funds from the grant, I’ve integrated them in the original grant proposal post, but in short they are  NFT asset creation from real world cloud data Smart contract development and DAPP development Web Dev PR/Marketing efforts Expenses for Core team (travel to conferences and other opportunities to present the project).  Thanks ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.126133786848072
                },
                {
                    "author_link": "https://gov.optimism.io/u/alexczet",
                    "index": "8",
                    "likes": "0",
                    "time": "12/10/2022-16:44:13",
                    "content": "It seems like some folks have been accusing us of being dishonest or gaslighting on twitter based on this proposal.  I’ve tried to answer by sharing the research and previous projects we are working from. This is the thread with our replies  twitter.com    Spreek @spreekaway  This has to be satire, right? 250k OP grant asked for a algoponzi DAO with the purpose of \"lobbying to give clouds an legal status\" https://t.co/2cE0GbB54U    3:22 PM - 12 Oct 2022           30                3            Just in case it needs to be clarified, our goal may seem ‘whimsical’ maybe, but it is a true issue, which will only become more acute over the years. Regarding accountability, since it was brought up, I’m not sure what the best approach would be, but I’m wondering if the funds could be put in a multisig wallet, and every expense is then approved by a member of our team and member of the OP Foundation, which means there is no possibility for us to run away with the tokens.  The only issue I can see with this is that in some cases the funds would have to be converted to EUR or USD, but I’m going to keep thinking of ways that we can build accountability into the whole process. ",
                    "links": [
                        "https://twitter.com/spreekaway/status/1580217453422202886",
                        "https://twitter.com/spreekaway/status/1580217453422202886",
                        "https://t.co/2cE0GbB54U",
                        "https://twitter.com/spreekaway/status/1580217453422202886"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.007936507936508
                },
                {
                    "author_link": "https://gov.optimism.io/u/MoneyManDoug",
                    "index": "9",
                    "likes": "4",
                    "time": "12/10/2022-17:00:56",
                    "content": "This looks like a big misuse of grant funds. I wouldn’t support this proposal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/DrChaos.eth",
                    "index": "10",
                    "likes": "0",
                    "time": "12/10/2022-17:30:02",
                    "content": "My summary: we want money to bring peace and love to the world, 10% for us and we can sell it and someone else will save the world. Same thing we’ve seen many times ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.666666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/TheDoctor",
                    "index": "11",
                    "likes": "0",
                    "time": "12/10/2022-18:11:40",
                    "content": "I was thinking the same about the OP parallelism. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/TheDoctor",
                    "index": "12",
                    "likes": "2",
                    "time": "12/10/2022-18:19:18",
                    "content": "I don’t like the usual tokenomics models either, but I have read the WP and it has some interesting ideas. It can’t be compared to other projects like Klima DAO, but I have the same concerns as any other project: the incentives alignments and long-term sustainability. I would support it, but not with that much OP, As always we build a great and expensive hightway when we don’t know if there will be cars using it. Cool ens by the way jaja ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.472222222222223
                },
                {
                    "author_link": "https://gov.optimism.io/u/alexczet",
                    "index": "13",
                    "likes": "1",
                    "time": "12/10/2022-18:51:13",
                    "content": "Thanks @TheDoctor , I think the general feedback I’m hearing is that we are asking for too much, so I will reduce the amount. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/jrocki.eth",
                    "index": "14",
                    "likes": "2",
                    "time": "12/10/2022-21:42:37",
                    "content": "I don’t see how this benefits the Optimism ecosystem? What am I missing? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/alexczet",
                    "index": "15",
                    "likes": "2",
                    "time": "13/10/2022-10:17:34",
                    "content": "In the white paper we state that the tokens allocated to the founding team vest after 3 years. It is a way to both avoid founders running away after 6 months and also incentivizing them to make sure the project is successful. Would you suggest another approach? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 7.083333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/alexczet",
                    "index": "16",
                    "likes": "3",
                    "time": "13/10/2022-10:23:23",
                    "content": "There are two responses to this 1/Larger externalities : if we take the concept of “public goods” to mean something beyond the blockchain ecosystem, we can see the idea of doing good as a general positive for humanity, and if this efforts emanates from a project running on Optimism, it directly ties optimism to this effort.  Blockchains won’t grow beyond the existing “believers” if we all only focus on the growth of blockchain ecosystems themselves 2/Userbase growth : if we engage with our supporters by running the project on Optimism, we are encouraging people who maybe never used crypto to start with Optimism and lean about the ecosystem, and in consequence about the vision and ideas that fuel it. We chose to come to Optimism because we were seduced by the ethos and good will of the creators of the project.  It seems to us that the focus here is not just on creating projects that are lucrative, but projects that are meaningful and that promote the core principles of the field.  Listening to the founders speak on podcasts and reading the blog posts etc has only convinced us further. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.982386363636364
                },
                {
                    "author_link": "https://gov.optimism.io/u/DrChaos.eth",
                    "index": "17",
                    "likes": "0",
                    "time": "13/10/2022-11:00:07",
                    "content": "    alexczet:  months and also incentivizing them to make sure the project is successful. Would you suggest another approach?   I am sorry for my manners. It’s just that I don’t believe in this model. I’m new here and haven’t read much projects, so I think I’ll say quite the same to most of them. I don’t like the tokenomics model in general. Vested or not, stop using a F. token to pay investors or team, put a fair salary or a way that if you liquidate your position don’t destroy the fake economy is created around. It is so obvious, but we keep seeing it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.681818181818182
                },
                {
                    "author_link": "https://gov.optimism.io/u/TheDoctor",
                    "index": "18",
                    "likes": "2",
                    "time": "13/10/2022-12:05:59",
                    "content": "    alexczet:  e to come to Optimism because we were seduced by the ethos and good will of the creators of the project. It seems to us that the focus here is not just on creating projects that are lucrative, but projects that are meaningful and that promote the core principles of the field. Listening to the founders speak on podcasts and reading the blog posts etc has only convinced us further.   I like this music. I am here 100% for social impact. When I said that it reminds me of the OP collective goals I meant that: public funds and bringing some real-life important issues to the ecosystem. We are Optimistic, not naive so if you want to solve a complex problem, you need to convince us that you will try so hard.     DrChaos.eth:  I think I’ll say quite the same to most of them. I don’t like the tokenomics model in general. Vested or not, stop using a F. token to pay investors or team, put a fair salary or a way that if you liquidate your position don’t destroy the fake economy is created around. It is so obvious, but we keep seeing it.   I agree with your analysis and I believe that incentive alignment is necessary for the long term. But I don’t like to judge prematurely based on the bias we all have. A change of paradigm (this is my motto for the motto brainstorming) is not easy and it needs all of us to collaborate and think as an optimistic team. I commit myself to read the WP in detail and I’ll try to give you my best feedback. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.589285714285714
                },
                {
                    "author_link": "https://gov.optimism.io/u/TheDoctor",
                    "index": "19",
                    "likes": "2",
                    "time": "14/10/2022-11:30:27",
                    "content": "As promised I have read the WP in detail and it has been a pleasure to find something so creative and original. I appreciate your work and I see its potential. I deeply value the creativity of the team and I trust that they believe in the project and won’t be exposed to harm their reputation. Unfortunately, we have seen for years how everyone was able to create NFTs and call it art, different projects were selling parcels of the earth’s land, tokenomics expecting to be sustainable going to zero, etc. The team can be a scammer, ignorant, or just have bad luck and be in the wrong moment, but we have seen this crash too many times. So it is impossible for some people reading your WP not to think about this. Strengths  It can be an opportunity to start working on public good funding as we are looking forward to doing in Optimism. As @OPUser noticed. It can be a way to include scholars and researchers from different fields to see beyond the fiat-incentivized academy we all researchers know about (this is something I strongly believe we should work on) As you said: It will bring no coiners to the ecosystem (I won’t stop saying that and I have posted about it recently)  Weaknesses   Tokenomics and its unnecessary complex design: It’s not going to work and at this time, nobody with some knowledge of the ecosystem would believe it either (I think @DrChaos.eth is expressing that thought)  Funds location: As funds are located and taking into account the tokenomics, this project doesn’t benefit the OP ecosystem at all as @jrocki.eth and @MoneyManDoug pointed out. As they say: Don’t trust, verify.  Suggestions Here are some thoughts. This is a very complex matter and we are still learning about it. I think tokenomics can be redesigned without sacrificing the beauty of the idea behind it.  WP describes a pool to give liquidity to the rain token (unnecessary), it speculates with a growing market value (wishful thinking and not very realistic) We really need here the alignment of incentives between the team and OP community so my suggestion is: Rain token it’s a beautiful idea, but if it’s in a liquidity pool it’s exposed to all kinds of problems, if we are not gambling about Elon musk buying some rain, then we need to be realistic and remove that idea. There is a liquid token called OP, and we in the OP community must think about the long-term sustainability of the OP economy. This is something that everyone misses (even bitcoiners with BTC). I suggest Rain token could be minted by using OP token (with the same idea using the market value of water) going to the Paparuda DAO treasure and the DAO could be contributing to OP ecosystem by being an active part of it as OP holder. You also say in WP that the currency to buy NFT Clouds is TBD. Same here: OP, so you also contribute to OP economy. And when DAO needs funds and needs to sell OP at the market, RAIN will be burned. We need devs help here but this smart contract system for minting and burning a token has been done many times. And if OP funds are going to implement some contracts for this project to do that, I suggest it must be open-sourced so other projects on OP could adapt it as well.  I look forward to getting of Pararuda and OP community, and It’d be for me a pleaser keep exploring this ideas with all of you ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.058094056481153
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "20",
                    "likes": "0",
                    "time": "14/10/2022-11:52:45",
                    "content": "Thank you for the summary. One thing they still need to provide information on how this will create value ? What they want to do is clear but why ? If providing legal status is main point here then there are other ways to raise funding such as crowdfunding, gitcoin and other similar platform. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.154761904761904
                },
                {
                    "author_link": "https://gov.optimism.io/u/TheDoctor",
                    "index": "21",
                    "likes": "1",
                    "time": "14/10/2022-12:21:55",
                    "content": "I have more thoughts and questions, but I didn’t want to extend myself without hearing some feedback     OPUser:  One thing they still need to provide information on how this will create value ? What they want to do is clear but why ?   I understand they try to unify art, science, and water and create some tokenized economy around it. As far as I could research there are some public artists and researchers on the team and as advisors (someone else should look into it and verify). I think value can be created by people buying NFT from known artists and knowing there are some real social impact contributions. This sounds like a charity selling art to fund public goods. But, here’s where crypto must do its magic and be more open so it can be a game-changer. How? We need to figure it out. My feeling is by being open to other artists and scientists to participate, and by allowing a community like OP could be the curators who control that all the agents are acting fairly. Not easy at all, that’s why we are here I think.     OPUser:  If providing legal status is main point here then there are other ways to raise funding such as crowdfunding, gitcoin and other similar platform.   I have my doubts about that too and I wanted to ask about it ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.401315789473684
                },
                {
                    "author_link": "https://gov.optimism.io/u/TheDoctor",
                    "index": "22",
                    "likes": "1",
                    "time": "14/10/2022-12:41:06",
                    "content": "@alexczet ask on Discord about my RAIN token Suggestion: I am not a fan of the idea that every token must have liquidity in a pool (I’m sure some people disagree), but especially I wouldn’t do that from the beginning (that creates vulnerabilities). So my suggestion was that the RAIN token doesn’t have to have a liquidity pool to start. Imagine this: RAIN is an ERC-20 token, that is minted when anyone makes rain by “emptying a Cloud” when doing that the calculated value on the OP token goes into the treasure. If someone wants to sell a RAIN token, they won’t do it on the market, but burn it first and receive the OP value and then go and sell the OP if they want to liquid its investment. People are free to create liquidity for RAIN if they want to, and market value would be dependent on the OP value you can get by burning plus the value of belonging to the Paparuda DAO, this would be lost if you burn it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.35
                },
                {
                    "author_link": "https://gov.optimism.io/u/alexczet",
                    "index": "23",
                    "likes": "1",
                    "time": "14/10/2022-12:50:23",
                    "content": "Thanks a lot @TheDoctor and @OPUser for your feedback.  This is extremely valuable. Despite having worked in the field for about two years, we are not as well versed in tokenomics as I’m sure people in this public space are, so excuse some elements of ignorance, but I will try to answer as precisely as possible. 1/Regarding the weakness of the tokenomics, for us the idea is less to create a token that can become purely a store of value, but to create, as much as possible, a sort of circular economy around the PaparuDAO.  Having the RAIN token as an asset that can, with success, expand our ability to fund projects, but also creates a value incentive around the NFTs that has multiple outcomes (access to DAO - resale - conversion to RAIN) 2/Regarding the Funds location, I tried to explain in a different post how we hope to benefit the OP ecosystem.  If the project is 100% built on OP (NFTs are minted on OP, Token is minted on OP, sales are done in OP etc) we are hopefully creating value beyond the short term financial value for the blockchain, but I will skip this as you provide your own suggestions, which are extremely useful. Suggestion 1 : My lack of depth in DeFi knowledge is maybe the problem here, but without liquidity, how does on sell the token?  If you bought an NFT, decided to make it RAIN and then want to swap your RAIN for ETH or USDC, how would you do it without liquidity pools? However, if what you are suggesting is that we can mint on OP and thus OP acts as the liquidity, then that’s problem solved IMHO. (PS : I just saw your answer below about the burning mechanism as I was typing this) And yes, Clouds would be minted on OP, sold in OP. Finally, yes, open sourcing everything is key.  We do mention at the end of the WP that if this works, this model could be applied to many other intangible or tangible public goods.  That is our ultimate end goal. To @OPUser , regarding value, again, if monetary value is what is expected, then the value could be purely in having the entire project function within the OP ecosystem, but we are NOT planning on making “profits” for example.  All the money generated has to go to fund the team, fund proposals and maintain the overall project.  We are open to suggestions here of course. To @TheDoctor , yes, our current core team is made of Maxime Berthou, Nicolas Wierinck and myself.  Advisory board is currently made of Fabienne Quilleré-Majzoub , Christelle Barthe, Mathieu Simonet and we are hoping to add a water management expert, Dirk Halet And to @OPUser and @TheDoctor the problem with platforms like the ones you mention is that they don’t really help us with a fundamental aspect of this project. What we are trying to do is to use the fundamental levers, incentive structures and verticals of Web3 (NFTs, DAOs, Tokens) to build a parallel economy that exists for the simple purpose of advancing a cause.  The only way we can do this is with the support of an ecosystem of experts, thinkers, supporters, and advisors.  For example, we haven’t started writing our governance ideas for the DAO yet, and that will be something that hopefully sets an example as to how other DAOs interested in doing similar things can operate.  If the OP ecosystem supports us, and brings us knowledge, expertise and advice, this process will be of use to more than just us.  We don’t want to just take some grant money and then go hide in a corner to build, we hope to build together. I hope this helps shed some light, I’m standing by to provide any further clarity ",
                    "links": [
                        "https://be.linkedin.com/in/nicolaswierinck",
                        "https://alexczetwertynski.com",
                        "https://iode.univ-rennes1.fr/interlocuteurs/fabienne-majzoub-quillere",
                        "https://www.aero.obs-mip.fr/",
                        "http://mathieusimonet.com/Mathieu_Simonet_-_Site_officiel_de_lecrivain.html",
                        "https://vlakwa.be/nl"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.435863095238095
                },
                {
                    "author_link": "https://gov.optimism.io/u/TheDoctor",
                    "index": "24",
                    "likes": "1",
                    "time": "14/10/2022-15:35:33",
                    "content": "    alexczet:  Despite having worked in the field for about two years, we are not as well versed in tokenomics as I’m sure people in this public space are, so excuse some elements of ignorance   We are in a complex and unexplored world and we all need to be humble and open mining. Tokenomics is a new thing and we need to learn from all mistakes and problems we are aware of and keep exploring ideas and experimenting.     alexczet:  for us the idea is less to create a token that can become purely a store of value, but to create, as much as possible, a sort of circular economy around the PaparuDAO. Having the RAIN token as an asset that can, with success, expand our ability to fund projects, but also creates a value incentive around the NFTs that has multiple outcomes (access to DAO - resale - conversion to RAIN)   I get the idea, but we have learned from previous projects that you can imagine an economy expend money in developing a complex structure, marketing etc. Then reality is: market is down so you sell cheap to pay invoices , besides that you need to spend more money to defend your token price against selling pressure and finally people don’t act as you expected. I would take a different approach. You can mint NFT Clouds, but you don’t need a new platform to start, you can do it on the Quix app. to use open sourced code,  some DAO platform, and so on… If you save money there you can spend it on the important stuff: promoting research, art,  funding water related projects. For instance the DAO finds a place were they’re having water supply problems and techs study and determinate that you can buy a new water pump and install it. You show that this model can work, solve the problems you find and readapt… You can use you’re experience to advice on other projects, etc. There’s no better marketing than that. As I said: we need to change the paradigm. We need to understand that in this model collaborate is better than compite. But we need to stop doing the same we do in old world.     alexczet:  For example, we haven’t started writing our governance ideas for the DAO yet, and that will be something that hopefully sets an example as to how other DAOs interested in doing similar things can operate   That’s what I mean, you don’t need to create all that from scrach: there are some DAOs working on it that can teach us so much about it. So focus in your strengths and listen to the community about the other stuff. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.22256591006591
                },
                {
                    "author_link": "https://gov.optimism.io/u/alexczet",
                    "index": "25",
                    "likes": "2",
                    "time": "15/10/2022-12:44:23",
                    "content": "Thanks @TheDoctor I don’t think working on an existing NFT platform would work for us.  One thing that has maybe gotten lost in this conversation is that this is an art project.  Finding ourselves on a platform with PFPs and Collectibles would not really help us create a clear message.  Having a custom website where all the elements around the cloud NFT can be clearly communicated, and other elements can be added over time is critical for us to be able to distinguish ourselves, and have a clear art direction and voice. Definitely see your point on everything else. Thanks again ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.4875
                },
                {
                    "author_link": "https://gov.optimism.io/u/TheDoctor",
                    "index": "26",
                    "likes": "0",
                    "time": "15/10/2022-17:32:40",
                    "content": "    alexczet:  I don’t think working on an existing NFT platform would work for us   Sure, makes sense… in that matter, you are the expert. It was just a brainstorming of ideas. I’ll work on the OP economics integration, cause I really want to see more projects like yours here. Let’s hope you can get some more feedback and work in reformulate your proposal in a way OP collective feels that alignment with OP values. Best wishes ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 7.7
                },
                {
                    "author_link": "https://gov.optimism.io/u/alexczet",
                    "index": "27",
                    "likes": "2",
                    "time": "16/10/2022-08:50:30",
                    "content": "One things that has been interesting about this process is the amount of feedback we have received, and I’m grateful for all those who took the time to read through the WP and give us comments. There is one thing I’m a bit unclear on : we have received the question multiple times about “How does this create value for the OP ecosystem?” Maybe one thing to clarify is if these grants are for “public goods” or for “The OP ecosystem growth”.  There might be a bit of a contradiction to ask projects such as ours to receive funds in exchange for a commitment to help the OP ecoystem vs help a larger subset of humanity. Maybe it is a vocabulary thing, but in my mind that kind of commitment is more of an investment rather than a grant?  In other words, a grant sounds more like “we think you are doing something valuable and please keep on doing it” and an investment sounds like “we like what you are doing, but we need ROI, so please make sure you integrate that in your mission” This is not a criticism of the grant concept, more of a question around how proposals should be thought of and developed, and I personally walked in here very unschooled, so I’m just sharing what I absorbed from this process as a bit of feedback, hopefully not something to be perceived as a negative. Thanks ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.9421875
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPGovWatch",
                    "index": "28",
                    "likes": "5",
                    "time": "16/10/2022-16:10:42",
                    "content": "Here is the explanation from the docs:  The purpose of the Governance Fund is to incentivize sustainable growth of projects and communities in the Optimism ecosystem. This does not mean that all grants must be incentive programs. The Token House is welcome to consider any and all proposals which would drive growth or address a gap in the Optimism ecosystem, including public goods projects. Governance funds should come with an expectation of growth-related deliverables. It is not the intended purpose of the governance fund to retroactively fund public goods without an expectation of future work. There is a distinct OP allocation dedicated to this, which will be distributed via the Citizens’ House at a later date.     Optimism Docs   Governance Fund Overview To discuss the Governance Fund, head to the Optimism governance forum. Overview 5.4% of the total initial token supply (231,928,234 OP) will be distributed to Optimism projects and      More how how we think about public goods here: Retroactive Public Goods Funding. Note: The Optimism team has long been… | by Optimism | Optimism PBC Blog | Medium ",
                    "links": [
                        "https://community.optimism.io/docs/governance/gov-fund/#",
                        "https://community.optimism.io/docs/governance/gov-fund/#",
                        "https://medium.com/ethereum-optimism/retroactive-public-goods-funding-33c9b7d00f0c"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.65625
                },
                {
                    "author_link": "https://gov.optimism.io/u/theenlightened",
                    "index": "29",
                    "likes": "2",
                    "time": "16/10/2022-17:50:31",
                    "content": "Hello mate, may I advise you wait till when Optimism Citizens’ House is constituted, then you can apply for funding; as I believe your project falls under Public Goods The governance fund is set up for a different purpose thus the reason folks were asking you for the benefit to the ecosystem. Take your time to read through this What is the Optimism Collective? | Optimism Docs ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/TheDoctor",
                    "index": "30",
                    "likes": "1",
                    "time": "21/10/2022-13:06:58",
                    "content": "I don’t know the artist or the scholars on this project, but I think it’s a waste of talent. We need no-coiners in here, not just tech or finance people. In this particular project, some prestigious artists could’ve created value by selling their NFT to pay scholars and techs solving real-life problems. I get the difficulty of participating in governance and how busy everyone is. I’ll make a proposal and wait for your feedback ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.111111111111111
                }
            ]
        }
    ],
    "group_index": "293"
}