{
    "poll_list": [
        {
            "id": "0xc074e43c31ef6416083ef7bdad26e0b74a32063eb382b19ecfd29da397f6279b",
            "title": "Proposal F: Governance Phase 1 - GARD",
            "discussion": "https://gov.optimism.io/t/ready-gf-phase-1-proposal-gard/3024",
            "body": "This Governance Fund Phase 1 proposal has been marked ready and as such is eligible for voting in Cycle 4. This proposal HAS NOT been approved as ready for vote by a delegate, but may still be voted on if desired by delegates. For more info, check out Voting Cycle 4 Roundup: [https://gov.optimism.io/t/voting-cycle-4-roundup/3055](https://gov.optimism.io/t/voting-cycle-4-roundup/3055)\n\nLink to proposal: https://gov.optimism.io/t/ready-gf-phase-1-proposal-gard/3024",
            "choices": [
                "For",
                "Against",
                "Abstain"
            ],
            "scores": [
                441223.361374605,
                17229048.791860946,
                60941.89986128798
            ],
            "start": 1658430428,
            "end": 1659553628,
            "snapshot": "15277728",
            "state": "closed",
            "author": "0x47C88bb92B409fF25F6587EA611fac4e55f76007",
            "space": {
                "id": "opcollective.eth",
                "name": "Optimism Collective"
            }
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/ready-gf-phase-1-proposal-gard/3024",
            "title": "[READY] [GF: Phase 1 Proposal] GARD ",
            "index": 3024,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Governance Fund: Phase 1"
            ],
            "tags": [
                "cycle-4",
                "not-passed"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/rsoscia",
                    "index": "1",
                    "likes": "3",
                    "time": "18/07/2022-19:51:51",
                    "content": "Project Name: The GARD Protocol Author Name(s): Rylie Rueda, Ryan Soscia, and David McCabe Number of OP tokens requested: 1,000,000 OP tokens L2 Recipient Address: 0x9C669a3d5915F6e210Eb453393F4F0D1bBE30EDd Relevant Usage Metrics: (TVL, transactions, volume, unique addresses, etc.)  Currently, GARD has more than 8M ALGOs locked in TVL and has done over $1M in loans of its stablecoin (source: GARD Protocol: TVL and stats - DefiLlama). We have hundreds of active users with a high water mark of 1725 unique addresses that had opened positions at once i.e. collateralized debt positions (CDPs), which are requisite to borrow GARD.  Optimism alignment (up to 200 word explanation):  The GARD Protocol is excited and humbled for the opportunity to build our first cross-chain solution on Optimism. There is a massive appetite for DeFi and stable yields on Optimism, which our protocol would provide. Inspired by MakerDAO, and improved with ideas from Olympus, Liquidity, as well as other protocols, we have the solution Optimism is looking for to ignite DeFi and accelerate decentralization of the network. The GARD Protocol is a battle-tested evolution of Maker that revolutionizes governance, facilitates borrowing and staking, and forms a foundation for other financial markets (e.g. bonds). We will build the necessary infrastructure for OP to increase adoption including our overcollateralized, fully decentralized stablecoin as well as offer both fixed yield products and stable staking opportunities for the ecosystem which will benefit native DEXs, lending platforms, and the like. We will be purchasing liquidity (and locking it) at a premium in perpetuity to be ignited by grant funds, and continued with governance tokens and protocol revenues. We will partner with a native DEX of the community’s choice to ensure ample liquidity, boosted Optimism TVL, and future revenues generated via trading fees. With appropriate support and adoption our protocol will place deflationary pressure on OP token supply by continually locking OP tokens in smart contracts.  Proposal for token distribution (under 1000 words): How will the OP tokens be distributed?  Development/Security: We are a funded team; however, allocating a small portion of the funds received to development and security is essential (10-20%) to ensure we prioritize building on Optimism and get at least one comprehensive audit of our WebApp and smart contracts. LP Token Buying (80-90%): A key feature of our protocol is its ability to buy up its own liquidity and pay a premium for it. We will do so with the protocol’s native governance token and the protocol’s stablecoin as received as revenue generated via protocol operation in perpetuity. In order to jump start this process, we propose dedicating the vast majority of OP tokens received to pay an even higher reward for initial LP token buying at a premium to support the protocol. When the protocol launches it will be the most important time to educate users and reward them for taking the most risk. We will give users the option to get governance tokens at a significant discount for LP tokens, get granted OP and governance tokens at a smaller premium, or straight OP back at an even smaller premium. This kickstart will accomplish several things. First, it will ensure that the protocol has its own liquidity in perpetuity on day one. Second, by buying LP tokens we will be incentivizing users to stake their OP, use the DEX of their choice, and borrow our stablecoin. Once we own the liquidity it will never leave the protocol and create lasting value across the ecosystem. It will also show confidence in the protocol and inspire more users to get in and take advantage of the many facets of the platform that leverage their OP exposure and increase overall ecosystem composability. This method of buying liquidity is unique in that it does not rely on 3,3 or any other “game theory” that is designed to dump on late adopters as previous iterations of DeFi 2.0 have. It’s also creating value for the early adopters because they will govern the protocol and be entitled to a portion of protocol rewards in perpetuity via the governance tokens should they choose to hold them.  How will this distribution incentivize usage and liquidity on Optimism?  By creating a native decentralized stable on Optimism we will enable OP token holders to leverage their OP tokens. This leverage will allow them greater composability on the network to do whatever they please whether it’s buying the dip, buying NFTs, staking their funds, or loaning them out to other users for even more yield.  Why will the incentivized users and liquidity remain after incentives dry up?  By buying LP tokens and having the protocol lock them in/permanently hold them we will guarantee that this liquidity stays on a native DEX of the community’s choice in perpetuity and creates long term value for us, Optimism, and the partner platform native to Optimism. Further, because our system is inherently deflationary, the more people that use our protocol the more OP tokens will get locked up and the less supply there will be on the open market. Finally, even once OP token incentives dry up users will continue to earn governance tokens and as they own the protocol they will be more likely to continue using it.  Over what period of time will the tokens be distributed?  The tokens will be distributed in accordance with community appetite and it will depend on many factors such as how much liquidity the protocol envelops, the price that our governance token trades at, and how much revenue our protocol generates which will, of course, supplement liquidity purchasing. We would imagine that the tokens could be titrated over a period of time between a few months to several years depending on community consensus.  How much will your project match in co-incentives?  Given that our protocol will be using its governance tokens as incentives to buy up liquidity in perpetuity/until they run out we will commit 10-50% of the tokens (dependent on cross-chain/interoperability approach) to the community for these endeavors after setting aside tokens for advisors, team members, and early backers.  ",
                    "links": [
                        "https://gov.optimism.io/t/voting-cycle-4-roundup/3055",
                        "https://gov.optimism.io/t/gfx-labs-delegate-communication-thread/2728/14"
                    ],
                    "GPT-summary": "The post is a proposal for the GARD Protocol, which aims to build a cross-chain solution on Optimism. The proposal explains the protocol's features, such as its ability to buy up its own liquidity and pay a premium for it, and how the OP tokens will be distributed. The post also mentions the protocol's deflationary nature and how it will incentivize usage and liquidity on Optimism. The proposal is open to feedback and collaboration, and it may match co-incentives for liquidity buying.",
                    "GPT-proposal-categories": [
                        "Token economics",
                        "Interoperability and scalability",
                        "Grants, funding and resource allocation",
                        "Smart contract updates",
                        "Law and regulations"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.632471804511278
                },
                {
                    "author_link": "https://gov.optimism.io/u/rsoscia",
                    "index": "2",
                    "likes": "1",
                    "time": "18/07/2022-21:20:31",
                    "content": "Here’s a link to our website: https://www.algogard.com And our web application: https://www.gard.money ",
                    "links": [
                        "https://www.gard.money"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/linda",
                    "index": "3",
                    "likes": "0",
                    "time": "21/07/2022-21:08:11",
                    "content": "Thanks for your proposal. I voted no on it though since the amount requested is very high compared to the current metrics so I don’t think this would be the best use of funds for Optimism. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 6.76
                },
                {
                    "author_link": "https://gov.optimism.io/u/Wagame.eth",
                    "index": "4",
                    "likes": "0",
                    "time": "21/07/2022-21:11:54",
                    "content": "Summary TL;DR (pls correct if wrong) -currently on Algorand exclusively (which isn’t an EVM chain, so you would have to start from scratch? -100k-200k $OP for the team, quote “small portion of the funds received to development and security is essential (10-20%)” -Protocol owned liquidity, quote “LP Token Buying (80-90%): A key feature of our protocol is its ability to buy up its own liquidity” -no distribution schedule, quote “The tokens will be distributed in accordance with community appetite” ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.1
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPenthusiast",
                    "index": "5",
                    "likes": "1",
                    "time": "22/07/2022-02:19:07",
                    "content": "Definite no from me. A massive ask of 1 million OP with 10-20% going directly to the team with no timeframes of any distributions. In addition, the remaining 80-90% will be used to buy up liquidity of their token so the granted OP will be also immediately dumped. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.166666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "6",
                    "likes": "1",
                    "time": "22/07/2022-14:50:43",
                    "content": "Voted: No As other have suggested, amount requested is too high and proposal is not aligned with gov fund. Please proposals from last gov phase, modify your proposal  and submit again. ",
                    "links": [
                        "https://gov.optimism.io/t/opuser-delegate-communication-thread/2777/10"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.058333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/rylie",
                    "index": "7",
                    "likes": "1",
                    "time": "22/07/2022-19:19:43",
                    "content": "Thanks for your feedback! This is a hard comparison to make given that we will be launching a V2 with a much more robust product suite, better UI, and as EVM compatible. Comparing EVM native protocols to one that has not yet made it cross-chain or to a chain with more active users is not analogous. We are attracted to Optimism thanks to the robust community support and technological advancements it brings to EVM. We believe that our protocol would be a good addition and that’s why we propose giving back the tokens we request to the community. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.236111111111111
                },
                {
                    "author_link": "https://gov.optimism.io/u/rylie",
                    "index": "8",
                    "likes": "1",
                    "time": "22/07/2022-19:44:47",
                    "content": "Thanks for bringing up your concerns.   The 10-20% is not going to the team, but rather, to get audits of the web app and smart-contracts to ensure what we are bringing to the OP community is totally safe and secure. Why trust only us and our internal audits/due diligence when you can also have an unbiased third party also ensure we’re being safe and taking the adequate steps to protect our users and our assets.   Until OP finds a more stable price it will be hard to know exactly how long or how fast the supply of OP tokens will last. We pledge to use these tokens to buy up LP tokens for the OP/GARD (stablecoin) trading pair which will effectively be locking up OP tokens as the LP tokens will be locked in our treasury. These locked tokens will encourage trading in perpetuity as well as ensure TVL for our Protocol, the DEX used, and of course all of Optimism. These tokens will not be dumped at all but rather strategically used to grow the protocol and reward the earliest users who will be taking the greatest risk to promote the growth of our protocol and DeFi on Optimism in general.   This is a standard ask given the parameters outlined by the foundation.   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.164351851851853
                },
                {
                    "author_link": "https://gov.optimism.io/u/rylie",
                    "index": "9",
                    "likes": "1",
                    "time": "22/07/2022-19:51:15",
                    "content": "Thanks for your feedback! Your TLDR is a solid start, however, I don’t feel like it’s totally accurate or all encompasing so I’ll respond below:   We won’t be starting from scratch as we already have team members with extensive EVM experience and have smart contracts written/in progress. It’s also worth noting that our protocol is battle tested and that the new features we are bringing for V2 will only be additive. Finally, our new web app is almost complete and will work regardless of chain we are associated with.   The 100-200k $OP will indeed be used by the team to contract out a third party auditor so that we can ensure the product we bring forward is as safe to use as possible and independently verified. These audits aren’t cheap.   We will be dedicating a massive portion of our protocol’s ownership i.e. DAO tokens to buying up LP tokens from a OP/GARD pair to ensure there is ample liquidity behind our stable. In order to build up the very first liquidity on OP we believe there will need to be extra incentives to get active users to take the plunge and try out our protocol.   We will post a longer response about distribution schedule soon to add clarity here.   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.506518103109013
                },
                {
                    "author_link": "https://gov.optimism.io/u/Prometheus",
                    "index": "10",
                    "likes": "0",
                    "time": "22/07/2022-20:26:27",
                    "content": "    rylie:  We will post a longer response about distribution schedule soon to add clarity here.   This is one of the issues I believe future proposals need to avoid at all costs. Adding clarity after tagging the proposal as ready isn’t very useful (for the proposal). I already made my mind no matter what is added. Once it’s ready it’s ready, I’m not waiting for more clarity unless I really care about the project/proposal. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.207142857142856
                },
                {
                    "author_link": "https://gov.optimism.io/u/katie",
                    "index": "11",
                    "likes": "0",
                    "time": "22/07/2022-21:37:24",
                    "content": "Voted no - The amount requested is very high and the proposal is not aligned with the use of the Optimism governance fund.  Thank you for your proposal! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.3
                },
                {
                    "author_link": "https://gov.optimism.io/u/emerald",
                    "index": "12",
                    "likes": "0",
                    "time": "24/07/2022-12:00:28",
                    "content": "This will be a no from me: 1M OP for a protocol that isn’t even EVM-native is totally inappropriate and not aligned. Not to mention the ~150k OP that will be insta-dumped because your team needs funding to port code. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/panukresko",
                    "index": "13",
                    "likes": "1",
                    "time": "25/07/2022-14:09:10",
                    "content": "A lot of words but really vague… maybe a bit too early? If you declare being a funded team wouldn’t allocating funding to auditing the EVM implementation be one of the first things to do?  we will commit 10-50% of the tokens … after setting aside tokens for advisors, team members, and early backers.  Could use more insight on this number - with the range given it is really not saying much ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.892857142857143
                },
                {
                    "author_link": "https://gov.optimism.io/u/Bobbay_StableLab",
                    "index": "14",
                    "likes": "0",
                    "time": "25/07/2022-21:45:02",
                    "content": "Vote: No The amount requested is far too high, and the project is not currently on optimism. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.433333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "15",
                    "likes": "2",
                    "time": "26/07/2022-15:39:38",
                    "content": "Voting no. 1m $OP tokens is an extravagant amount and we have actively tried to not approve proposals of this size. Also the description of how the entire thing works leaves a lot of question marks. It sounds as if you want to get people to buy into your governance tokens and use OP tokens to do it? So you would dump OP to buy your token? Also you are not yet on Optimism?   We will post a longer response about distribution schedule soon to add clarity here.   This should have been done before the proposal goes on a vote. This proposal has been up for a vote for a week already. Please finalize proposals before sending them up for a vote. Talk a bit with delegates, both here and in discord to gather feedback so that you can adjust your proposal before it goes on a vote. You may find that this way it would do a lot better. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.611111111111111
                },
                {
                    "author_link": "https://gov.optimism.io/u/ceresstation",
                    "index": "16",
                    "likes": "1",
                    "time": "26/07/2022-17:11:05",
                    "content": "Unfortunately the reasoning on this one is simple, the amount is far too large for the metrics presented. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.767857142857142
                },
                {
                    "author_link": "https://gov.optimism.io/u/quix",
                    "index": "17",
                    "likes": "0",
                    "time": "27/07/2022-00:47:10",
                    "content": "We voted no on this proposal because the request amount of tokens is too high for a protocol that has yet to be deployed on Optimism. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.8
                },
                {
                    "author_link": "https://gov.optimism.io/u/ScaleWeb3",
                    "index": "18",
                    "likes": "0",
                    "time": "27/07/2022-14:32:23",
                    "content": "Voting No due to high ask, little value for Optimism. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.058333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/SEED_LATAM_Joxes",
                    "index": "19",
                    "likes": "2",
                    "time": "30/07/2022-21:35:53",
                    "content": "[Final] Voting: No Amount requested is considered unreasonable, taking into account that the protocol is not deployed in Optimism yet and track record is not impressive, so it does not fit with the potential benefits to the ecosystem.  Contribution: Standard  OP distribution: Neutral  Co-incentives: Not confirmed  Impact in LATAM: Neutral   Suggestions: a further deployment showing utility with some TVL, community interest and lowering the requested amount can help in a possible next round. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.45
                },
                {
                    "author_link": "https://gov.optimism.io/u/lvlojei",
                    "index": "20",
                    "likes": "0",
                    "time": "03/08/2022-06:38:22",
                    "content": "Hi guys pls modify your proposal and submit again  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/vonnie610",
                    "index": "21",
                    "likes": "0",
                    "time": "04/08/2022-12:51:32",
                    "content": "Snapshot vote - not-passed ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "22",
                    "likes": "0",
                    "time": "13/09/2022-18:33:53",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "169"
}