{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/gf-phase-1-proposal-analysis-on-optimism-incentive-programs-and-framework-construction-for-future-programs/5456",
            "title": "[GF: Phase 1 Proposal] Analysis on Optimism Incentive Programs and Framework Construction for Future Programs ",
            "index": 5456,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Grants Council"
            ],
            "tags": [
                "growth",
                "cycle-11"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/CryptoKachu",
                    "index": "1",
                    "likes": "7",
                    "time": "06/03/2023-14:02:46",
                    "content": "Project name: Analysis on Optimism Incentive Programs and Framework Construction for Future Programs Author name and contact info (please provide a reliable point of contact for the project): Taeheon Lee, lee.t.h.0130@gmail.com Robbie Oh, robbie@philosophiavc.com Mike Kim, kimms213@gmail.com Huisu Jang, yejooooo523@gmail.com L2 recipient address: 0x160F00E48e50ABcE2d9262818B49752314E65857 Which Voting Cycle are you applying for?: Voting Cycle 11, Season 3 I confirm that I have read the landing pages for the Builders 5 and Growth Experiments 7 Sub-Committees and that I have determined my proposal is best suited to be reviewed by the Growth Experiments Sub-Committee: Yes I understand that Growth Experiments grants are subject to a “no sale rule,” as explained in this post 4, and I have read the terms of the rule: Yes Project Details What are you building?: Backgrounds One of the most distinctive characteristics of the Optimism network is that it provides a series of unique user incentive programs in various forms, including Optimism Quests, Optimism airdrops, and Citizen’s house based on decentralized identity. Recent investigations throughout the community revealed that the previous programs from the network succeeded in creating significant impacts on the network (Optimism Quests - App Growth on Optimism After Quests 📺✨, Optimism Quest Retrospect and Future Direction). The dynamic nature of the crypto industry demands a more careful examination on the impact of the Optimism quests, given the significant changes that have occurred in the overall atmosphere. To this end, there is a need for more rigorous investigation to determine the full extent of their impact. Moreover, since the network need to promote long-term engagement within the ecosystem as a result of the incentives, opposed to the short-term usage of speculative users, a longitudinal study is crucial in determining the overall impact of the program. In this regard, we believe more careful inspection on the impact is required. In addition to the investigation on the impact, since Optimism network is planning to have next rounds of incentive programs in the future, more systematic way to assess the previous events and design the next program based on the feedbacks from the previous events is desired to further foster the adoption of Optimism network throughout the industry. Objectives The goal of this project can be described in two-fold. First, we aim to analyze the effect of the previous Optimism incentive programs. The goal of the analysis is to investigate the impact of the events from various perspectives. We believe that rigorous inspection of the previous programs and discussion/retrospect on that is a desired process to design much more powerful incentive programs in the later rounds, which will be a foundation for the further growth of the ecosystem. For this objective, since the effectiveness of incentives could be affected by multiple factors, we are planning to proceed with the investigation in the following aspects.  Analysis based on user segmentation  usage patterns (frequency, volume, activities in other networks) dApps interacted with   Duration of impact  short-term/long-term impact on ecosystem: longitudinal observation based on dApps   Comparison with changes in other L1s or L2s  comparison with other protocols within the same period comparison with other protocols’ incentive programs    Based on the rigorous retrospect on the incentive programs, our second objective is to propose a framework for evaluating and designing an incentive program and to perform explorative experiments via the incentive program. This process will be carried out based on the analysis results we get from the first goal. Furthermore, we are opting to construct our framework via a series of governance forum discussions with the Optimism community. Even though we are planning to share the study design during the first phase of the study, If the detailed explanation on the methodology (statistical framework, quantitative/qualitative study design) is desired for evaluation, we will provide our draft design. Why do you believe what you are building is going to succeed?: As our proposal is more of a research project than product development on Optimism, the success of the proposal depends more on the competitiveness of the researchers and the infrastructure for carrying out the research. With regard to the research ability of the team, we provided our experience in the answer to ‘What makes your team well-suited to carry out the project described in this proposal?’ below. In this response, we will provide our thoughts on why this is the perfect moment for executing the research we are planning. Sufficient data available: Since the Optimism community is carrying out a variety of incentive programs and events with a various number of protocols on Optimism, we believe enough data to derive meaningful insights has already been cumulated throughout the network. Furthermore, recent growths of the layer 2 ecosystems would provide us with impactful benchmarks to set future strategies for ecosystem growth. Demand from the community: Responses to our post (Optimism Quest Retrospect and Future Direction) revealed that a lot of Optimism community members are eager to see the insights from our analysis and our research can generate helpful insights for the community. How many users does your project have currently? Please include how you arrived at this estimate: Since we are not dApp builders on the network, this question of the user numbers of our project do not apply to our grant. However, whenever we happen to conduct experiments with partnership projects, we will fully provide the user metrics of the projects. How will receiving a grant enable you to further the mission of maximizing the number of users interacting with Optimism? Please include a step-by-step flow of how you imagine this grant can lead to a greater number of user interactions with Optimism: Providing incentives to users is one of the most representative narratives that the Web3 ecosystem emphasizes compared to other industry domains. Optimism is one of the pioneering players in this regard since it is executing series of User incentive programs in several directions. Our project would widen and maximize the number of users interacting with Optimism as our research aims to investigate the impacts of Optimism’s previous quests on ecosystem growth. As our investigation will be conducted on multiple aspects, this will provide the Optimism community with valuable insights to design much more successful incentive programs later. The step-by-step flow impact of the project is as follows.  Investigation on previous incentive programs’ impact: figuring out the strengths and weak points of each, their short-term/long-term impact on the ecosystem, and impacts depending on user cohorts Providing relevant parameters and frameworks for designing successful incentive programs which can be used by Optimism community for future programs Providing direction for niche ecosystems that Optimism can embrace and differentiate itself from other competitors (for example, one of the key characteristics of Arbitrum is in its distinguishable ecosystem of perpetual dexes such as GMX and Vela exchange.) Iterate and modify the above steps based on iterations and maximize the impact of Optimism’s unique incentive programs.  Tell us about the users you plan to target with this grant. Include any defining characteristics that will help you identify and target them.: As our proposal is research-centric, the granted OP will not serve as incentives for users. Nevertheless, the analysis/research will primarily focus on analyzing users who actively participated in previous/future Optimism incentive programs. These users will be divided into several cohorts based on factors such as the frequency and duration of their usage of the Optimism network. Specification of the user cohorts will be determined and share to the community throughout the project. How would these users interact with Optimism? For how long?: Not applicable to our project. Rather, our project is to investigate the underlying motivations and usage patterns of the users who participated in the previous events. As this research is also targeting to derive insights into the long-lasting effect, observations on the users will also be conducted on a longitudinal basis. Do you have any metrics on the project currently? (TVL, transactions, volume, unique addresses, etc. Optimism metrics preferred; please link to public sources such as Dune Analytics, etc.): None. However, we will provide relevant metrics for future partnership projects. Who are your competitors, and are they on Optimism?: None. Please link to code audits (if any): Not relevant. Team Who are your founders?: Taeheon Lee, Robbie Oh, Mike Kim, Huisu Jang What makes your team well-suited to carry out the project described in this proposal? Our team consists of five members with extensive experience in Blockchain technology, such as product develpments and researches on various aspects of Web3 ecosystem, which include research for Ethereum foundation academic grants. Two of our members have Ph.D. degrees in engineering and researched the crypto economy and DeFi products, which suits our research-intensive project. We believe such experience will help us make more impactful outcomes for the Optimism ecosystem. In summary, our team possesses the essential skills required to effectively carry out the project, including research skills, quantitative analysis proficiency, expertise in on-chain data analysis, and an in-depth understanding of each product. Is this your first Web3 project?: No. If not, what else have you built? (Share links, Github repository, or any other useful information.): In addition to the projects we have involved in, we are also performing on-chain data analysis on ecosystems/DeFi (dune, dune) and running yield-farming bots on Uniswap V3 (address, address). Grant Request What is the size of the grant request? (250k OP max): ~60,000 OP How do you justify the size of the grant?: Our team is composed of five senior researchers/developers and we plan to work with one or two more developers if there arise a need for development. Considering the milestones and amount of research necessary for the plan, we set the research period to be six months. In addition, we need a such period to monitor the longitudinal impacts of the events and the effects of the next rounds of Quest and airdrops. We calculated the salary for the five researchers for six months as $100,000 (40,000 OP with 1OP = $2.5). In addition to the salary, we hope to carry out preliminary experiments under the proposed incentive schemes generated from our research. For carrying out the experiment that might require user incentives and partnership with builders in the Optimism ecosystem, we set aside 20,000 OP ($50,000) as a cost for the proposal. The breakdown of the OP usage is as follows.  Roadmap and Distribution Plan Describe in discrete steps how you will successfully implement your grant plan: In the first part of the research, we aim to investigate the impact of the previous Optimism incentive program. Followings are key components that will compose the first part of the research.  Analysis framework design: To accurately assess the impact, it is critical to design an appropriate analysis framework in order to correctly wipe out external factors like overall market sentiments. We will set up an analysis framework that can be employed to assess the previous incentive programs. Analysis: To analyze the points settled in the framework, we need to collect on-chain data and make code basis for the analysis. Conduct analysis and comparison: To assess the impact from the data, we will analyze the data from Optimism based on the framework and we will compare the pre/post-event affect with other networks. Benchmark study: In addition to the analysis of the impact, we will conduct comprehensive ecosystem research of layer 2 solutions. Our aim is to discover probable and potential ecosystem that could be niche market and become the characteristic protocols of the Optimism ecosystem.  In the second part of the research, we will conduct a experimentary incentive scheme based on our framework. The incentives will be provided through our partnership protocols. Below will be key components of the program.  Make framework for incentive program design: Based on the findings from the above components, we will propose a framework for designing Optimism incentive programs. The proposal will be based upon feedabcks from Optimism community. Implement and carry out the program: During four weeks, we will iterate through the incentive programs to figure out whether our design scheme works well. From the iterations, we will monitor and assess the incentive scheme and compare the results with that of Optimism network.  The hypothetical scenario of this will be proceeded as follows.  We might target some objectives like ‘increasing the overall TVL of OP dex liquidity in OP-USDC or OP-WETH pools for longer than 1 month by larger than $1M.’ From the framework constructed from Section 1, we will configure the optimal distribution scheme which include target recipients of the incentives, the amount of OP to distribute for each period, and the duration of period the recipients should take part in the incentive program. Conduct an experimental incentive program and analyze whether we get the results as we intended. Based on the previous analysis result, look for whether there should be another optimization process for the parameters and methods in the framework. Iterate over this process again starting from the first process.  Below is the timeline table for the project. Section 1. Analysis on the impacts of previous incentive programs  Section 2. Preliminary experiments on incentive schemes  How will the OP tokens be distributed? (please include % allocated to different initiatives such as user rewards/marketing/liquidity mining. Please also include a justification as to why each of these initiatives align with the problem statement this proposal is solving. Distribution should not include the sale of any tokens by the grantee or the use of tokens for compensation, protocol expenses, etc. See the no sale rule here 5): The distribution of OP tokens in this response only applies for the tokens allocated for experiments.  1st ~ 3rd experiment iteration: 7,500 OP - distributed over one week mid-term retrospect 4th - 6th experiment iteration: 7,500 OP - distributed over one week  With our findings, we will derive the recommendable amount of incentives that individuals receive from incentive programs. From this, we will adjust the number of tokens distributed during the iterations. The remaining OP tokens will be returned to the treasury. Over what period of time will the tokens be distributed for each initiative?: The OP tokens for the researchers will be distributed over 6 months. However, based on the ‘no-sale rule’, we will not sell the distributed OP tokens in any form. With respect to the token distribution during our proposed user experiments, the distribution scheme will be determined as a result of our study. Thus, we will share the information with the community as soon as the distribution scheme is decided. Please provide benchmark milestones for this project. These milestones should guide the Optimism community on the progress of your project throughout your work on the project. Do not use distribution of the grant itself as a milestone: In the below, we provide desired outcome and estimated timeline for each section. The content of each section is explained in the response to ‘Describe in discrete steps how you will successfully implement your grant plan’. Furthermore, the timeline table for each milestone is provided in the response to the above question as well. Section 1: Analysis on the impacts of previous incentive programs  Set up an analysis framework and share with the Optimism community for getting a feedback as a post to the Optimism governance forum (idealistically 2-3 iterations): 2023.04.03 - 2023.04.28. This process will be done via governance forum post which will be labeled as ‘[OP Incentive Retrospect]’ and will link back to this grant plan. In the first iteration, the post will contain the data that will be collected/analyzed and the comparison setting upon which the analysis will be pursued. In the second iteration, the post will contain the modification from the first post and the exact statistical method to exclude impacts from external factors and to extract statistical values from the analysis. The third iteration would be an optional iteration where modification on our framework will be done based on the community’s feedback. This milestone will be completed no later than 4 weeks from the receipt of OP tokens. Develop codes for collecting and analysis: 2023.05.01 - 2023.06.09. In this phase, we will develop necessary codes for proceeding the analysis. The deliverables of this phase would be on-chain data queries for collecting relevant on-chain data both from Optimism and other networks. Furthermore, python scripts and notebook file will be shared to the community. This phase will be completed no later than 6 weeks after the completion of the previous phase. Conduct analysis and share midterm results with Optimism community for feedback (idealistically 4-5 iterations): 2023.06.12 - 2023.07.21. Based on the previous deliverables (codes, scripts), we will perform analysis on the data and share the results to the community on a weekly basis. Even though we have planned this phase as a six-week plan, we are anticipating that this phase would be completed in less than four weeks. During the iterations, we will communicate with the community to look for further analysis points. Deliverables will be forum posts during the iterations and posts will be labeled as ‘[OP Incentive Retrospect: Analysis]’. This phase will be completed no later than six weeks after the completion of the previous phase. Conduct a benchmark study with regard to impact of other protocols’ incentive programs: 2023.07.10 - 2023.07.28. We will also investigate incentive programs’ from other protocols. Similar to that of Optimism, we will collect and analyze data from other protocols. As a deliverables, we will share a reports, dashboards and forum posts to the community. The content of these deliverables will contain the comparison of the impacts between Optimism and other protocols. (if applicable) Make dashboard page for the monitoring: 2023.07.31 - 2023.08.25. Based on the discussion on our results in the community, if the community succeed in making an agreement on which indicators should be monitored for incentive programs, we will develop a dashboard page with regard to monitoring the impact and status of Optimism’s incentive programs. The deliverables will be a dashboard website or Dune dashboards. If there is other incentive programs, we will continuously update the page for the community.  Section 2: Preliminary experiments on incentive schemes  (from the starting of the project) Set a partner protocol to carry out incentive program with. One of the key objective of the proposal is to experiment our framework on a network. To do this, we will search for a partnership project who can collaborate on the experiment. Searching for the partnership protocols will be performed until the end of the milestones in Section 1. If we successfully made a partnership with the protocol, we will share the partnership information as a forum post with label ‘’[OP Incentive Retrospect: Partnership]'. Design a incentive scheme based on our framework and share with the community (idealistically 2-3 iterations): 2023.08.14 - 2023.09.08. Based on the results from Section 1, we will propose a framework for designing various forms of incentive programs in the Optimism ecosystem. The output from this milestones would be documents/diagrams of the incentive programs. Relevant information will be shared to the forum. Implement and carry out the designed incentive program: 2023.09.04 - 2023.09.29. With a partnership protocol, we will implement an incentive program. The resulting outcome from this phase will be an execution of the incentive program. The incentive program will be shared to the community via multiple channels including twitter announcement and the forum posts. Monitor and assess the impact of the incentive program: 2023.09.25 - 2023.10.20. During the incentive program, we will develop a code-base to track and monitor the impact of the incentive program. Analysis results will be shared to the community as a form of governance forum and monitoring page will be made as an outcome.  In addition to governance forum posts, we will share our procedures as medium articles and twitter threads explaining the rationales and outcomes of each milestone. Please define critical milestones for this project. Critical milestones are meant to show good-faith efforts to accomplish the project. Non-completion of these milestones could lead to revocation of remaining grant rewards. Do not use distribution of the grant itself as a milestone: The described milestones in this response will be the key outcomes of the project.   We will share a governance post explaining our research methodology and our analysis framework by 2023.04.28.   We will share on-chain data queries and python scripts needed to proceed the analysis by 2023.06.09.   We will share three or four forum posts and articles about the analysis results by 2023.07.28. These results include the analysis result of other protocols’ incentive programs.   We will share articles, papers, documentations for the incentive program by 2023.09.08.   We will execute our own incentive program with partnership project by 2023.09.29.   We will share the results analyzing the impact of the incentive program by 2023.10.20.   If the OP tokens are for direct distribution to users, why will incentivized users and liquidity on Optimism remain after incentives dry up?: Not relevant to our project. Even though our research might proceed some form of user experiments with incentives distribution, our project is more relevant to discover and exploit reasonable motives to make users remain on Optimism even after the incentives. Please provide any additional information that will facilitate accountability (smart contracts addresses relevant to the proposal, relevant organizational wallet addresses, etc.): We provide google scholar profile of the members to help you evaluate our research competitiveness. If it is beneficial to provide our previous queries or analysis on the other projects, we will be willing to provide additional links on them. Optimism Relationship Does your project solve a problem for the Optimism ecosystem? If so how?: Yes. To our knowledge, the Optimism network is endeavoring to provide unique user experiences through a number of Optimism-centric events like Optimism Quests and a series of airdrops. Based on the responses to our previous posts with respect to the Optimism Quest retrospect and future direction(Optimism Quest Retrospect and Future Direction - #6 by tkooq), analysis of the event from various perspectives is desired for the ecosystem. The goal of the project is to provide such insights and help the Optimism community design more impactful events for the future. Why will this solution be a source of growth for the Optimism ecosystem?: Our belief is that attracting users and dApps on-to an ecosystem on the network is particularly critical for layer 2 networks, as the competition between layer 2 solutions intensifies. Therefore, it is imperative to effectively attract users to onboard the network and nurture ecosystem specific to the network. The insights gained from our project will be invaluable in this regard, enabling us to make future Optimism events even more impactful. Is your project Optimism Native?: Yes. Our project will provide insight fully based on the data from Optimism network. Confirmations I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: Yes I understand that I will be expected to following the public grant reporting requirements outlined here: Yes ",
                    "links": [
                        "https://foul-porch-0eb.notion.site/Growth-Experiments-Sub-Committee-270d2f75ff0f410a869b2ba6a8324006",
                        "https://gov.optimism.io/t/grant-proposal-template/3233",
                        "https://dune.com/oplabspbc/optimism-quests-project-usage-growth",
                        "https://gov.optimism.io/t/optimism-quest-retrospect-and-future-direction/5300",
                        "https://gov.optimism.io/t/optimism-quest-retrospect-and-future-direction/5300",
                        "https://gov.optimism.io/t/optimism-quest-retrospect-and-future-direction/5300/6",
                        "https://gov.optimism.io/t/suggested-public-reporting-requirements-for-grantees/4176",
                        "https://gov.optimism.io/t/optimism-quest-retrospect-and-future-direction/5300/27"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.526567944250871
                },
                {
                    "author_link": "https://gov.optimism.io/u/wasFree",
                    "index": "2",
                    "likes": "4",
                    "time": "07/03/2023-07:55:01",
                    "content": "I think 6 month period is a too long. And i suggest  you can bring out data analysis results to show your impact ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/CryptoKachu",
                    "index": "3",
                    "likes": "3",
                    "time": "07/03/2023-09:07:25",
                    "content": "Preliminary analysis results were shared in my previous post here: Optimism Quest Retrospect and Future Direction. We will continuously share the results of our analysis during the six months. We are opting to do a longitudinal observation on the effects and we think observation period of longer than three-six months would be optimal. With that period, we can also observe results from next iterations of incentive programs. If the Optimism community think six months is too long, we can adjust the period to be three months. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.729166666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/Mark_De.Fi",
                    "index": "4",
                    "likes": "3",
                    "time": "08/03/2023-17:30:22",
                    "content": "Mostly support such a proposal, given that certain ecosystem development goals should definitely be adopted In the quality of obtaining stable ecosystem performance, mechanisms should be formed that will provide more long-term incentives Maybe I’ll add more when I study it in more detail, but the proposal definitely looks good ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.619047619047619
                },
                {
                    "author_link": "https://gov.optimism.io/u/CryptoKachu",
                    "index": "5",
                    "likes": "2",
                    "time": "09/03/2023-01:14:20",
                    "content": "Thank you for the reply! If you are interested, we can collaborate on this research. I am pretty sure that outcome from this project can give positive impact to Optimism. Your inputs would definitely be helpful and valuable to us. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.227272727272727
                },
                {
                    "author_link": "https://gov.optimism.io/u/Mark_De.Fi",
                    "index": "6",
                    "likes": "2",
                    "time": "09/03/2023-15:19:04",
                    "content": "I don’t mind trying, as long as I can bring any impact ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/GFXlabs",
                    "index": "7",
                    "likes": "3",
                    "time": "10/03/2023-11:34:24",
                    "content": "Thank you for submitting this grant application! Throughout the application process, this forum thread will be one of the official means of communication. Please be sure to monitor it for updates over the course of the review period. At this stage, applications are mainly being reviewed for completeness, and nothing at this stage should be construed as support or opposition by any members of the Grants Council.     CryptoKachu:  Over what period of time will the tokens be distributed for each initiative?: The OP tokens for the researchers will be distributed over 6 months. However, based on the ‘no-sale rule’, we will not sell the distributed OP tokens in any form.   Thank you for acknowledging the no sale rule. Just so everything is absolutely crystal clear, your researchers would be paid in OP, and they in turn would simply be long OP for the time being?     CryptoKachu:  In the second part of the research, we will conduct a experimentary incentive scheme based on our framework. The incentives will be provided through our partnership protocols.   Can you elaborate further upon this portion of the grant plan? It might be helpful to walk through a hypothetical example of how this would work.     CryptoKachu:  Section 1: Analysis on the impacts of previous incentive programs   A suggestion to make this part of the grant plan stronger would be to provide specific dates and more specific deliverables. For example,     CryptoKachu:  Set up an analysis framework and share with the Optimism community for getting a feedback as a post to the Optimism governance forum (idealistically 2-3 iterations): 4 Weeks   Could become “Set up an analysis framework and share with the Optimism community. This will be done via forum post, which will be clearly labeled as XYZ and will link back to this grant plan for reference. This report will share the basic concepts and reasoning behind the framework, and will either include or clearly link to methodology. This will be posted on the forum no later than 4 weeks from receipt of OP tokens.” We suggest similar specificity for the critical milestones. Note that critical milestones are needed to unlock each portion of a grant, so it’s important they be unambiguous to avoid disagreements. Further guidance on milestones can be found here: Milestone Assessment Thank you, and GFX Labs or other Grants Council members will follow up here with any further questions throughout the process. Do not hesitate to ask questions here (tagging whichever Council Member a question is for, or @GrantsOps generally, will increase the speed of response). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.360576923076923
                },
                {
                    "author_link": "https://gov.optimism.io/u/SophiaK",
                    "index": "8",
                    "likes": "1",
                    "time": "10/03/2023-15:19:58",
                    "content": "Would this project be better suited to the Builders committee? The intent of the Growth committee is to maximize the number of users interacting with applications on Optimism. This proposal even states that the “question of the user numbers of our project do not apply to our grant.” ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/CryptoKachu",
                    "index": "10",
                    "likes": "1",
                    "time": "10/03/2023-15:52:59",
                    "content": "Thank you for the valuable comments on the proposal! I will give you a reply on the request as soon as possible! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/CryptoKachu",
                    "index": "11",
                    "likes": "1",
                    "time": "10/03/2023-15:54:18",
                    "content": "Thank you for the reply. But please read the proposal carefully and also refer to other proposals too. First of all, the question “How many users does your project have currently? Please include how you arrived at this estimate:” asks about the current number of users the applicant’s protocol has. In that regards, we are not a dApp on Optimism and we do not have current user basis. However, that does not mean that we do not care about maximizing the Optimism users. Rather, maximizing the organic user of the Optimism is our core objective. We even clearly stated our goal as below.     CryptoKachu:  Our project would widen and maximize the number of users interacting with Optimism as our research aims to investigate the impacts of Optimism’s previous quests on ecosystem growth.   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.2793560606060606
                },
                {
                    "author_link": "https://gov.optimism.io/u/SophiaK",
                    "index": "12",
                    "likes": "1",
                    "time": "10/03/2023-16:12:18",
                    "content": "Hi, I did read through this proposal and other proposals. The Growth committee focuses on projects that directly maximize the number of users on Optimism. Analysis of the OP incentives program may be worthwhile to improve future programs, but it seems better suited to the Builders committee or funding from another source in the Optimism Collective. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9750000000000005
                },
                {
                    "author_link": "https://gov.optimism.io/u/0xairboom",
                    "index": "13",
                    "likes": "2",
                    "time": "10/03/2023-23:28:01",
                    "content": "I am wondering if this should be in build section because the OP will be used for Researcher Salaries, isn’t that tricky with the No-Sale rule? Although the project is not paying direct to their employees, but it will be paid to researchers. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/CryptoKachu",
                    "index": "14",
                    "likes": "1",
                    "time": "11/03/2023-01:15:46",
                    "content": "Frankly speaking, I was torn between two options, growth experiments and builders grants, when I was applying for this grant. We chose growth experiments track as the main goal of this project would be to maximizing the number of users. However, we agree with your opinion that this proposal would suit better for builders grants. Based on the feedback and result of cycle 11, we will apply again for the builders grants. With regard to researcher salary, all the participants are long for Optimism so that they agreed not to sell OP in any form. Our team has been in crypto space for long time, thus having a OP token in our wallet would be sufficient to us. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.708333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/CryptoKachu",
                    "index": "15",
                    "likes": "2",
                    "time": "11/03/2023-01:23:31",
                    "content": "Okay I see. I thought that you are stating that our project does not have anything to do with the user number. To clear out our words, ‘this question of the user numbers of our project do not apply to our grant’ means that we are not a dApp and we do not have current user base. With regard to the ‘directly maximize the number of users’, we do not think that maximizing the user can only be done via user incentives. The key problem statement we are proposing is that previous incentives failed in attracting long-term usage. Only via thorough inspection on the incentive programs and their impacts, the community can effectively increase the number of organic users who will be in Optimism network for some period of time. We admit that our proposal is in somewhere between growth experiments and builders grants. If the community think our proposal better suit for the latter and we failed to get grant for this proposal, we will modify our proposal and apply to builders grants for the next cycle. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.944444444444445
                },
                {
                    "author_link": "https://gov.optimism.io/u/SophiaK",
                    "index": "16",
                    "likes": "1",
                    "time": "11/03/2023-16:35:39",
                    "content": "From the FAQ for Cycle 11 Applications:  Growth Experiments grants are designed to be passed on to users rather than used to fund operations, which means that the project’s distribution plan has elevated importance.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/CryptoKachu",
                    "index": "17",
                    "likes": "1",
                    "time": "14/03/2023-04:44:29",
                    "content": "Thank you for the valuable comments. I hope that all the issues are addressed in the modified version of the proposal.     GFXlabs:  Thank you for acknowledging the no sale rule. Just so everything is absolutely crystal clear, your researchers would be paid in OP, and they in turn would simply be long OP for the time being?   Yes. I confirm the statement. All the team members would be long OP. Furthermore, we are planning to participate in the Optimism community continuously (One of our objective is to contribute to the community with regard to further aspects including participation on the future roadmaps of Optimism core development). Thus, granted OP will be hold in our wallet and used as a measure to more actively participate in the community.     GFXlabs:  Can you elaborate further upon this portion of the grant plan? It might be helpful to walk through a hypothetical example of how this would work.   I modified the proposal. Since our hypothesis could change based on the result from the section 1, please consider that the stated hypothesis can change during the project. The modified version can be found under the sentence ‘The hypothetical scenario of this will be proceeded as follows.’.     GFXlabs:  A suggestion to make this part of the grant plan stronger would be to provide specific dates and more specific deliverables. For example,   I updated the benchmark milestones and critical milestones in the proposal based on your suggestion. I assume that the project will start at April 1st. Also, I specify the exact deliverables. The modified version can be found under the sentence: ‘Section 1: Analysis on the impacts of previous incentive programs’. The modification with regard to the critical milestones can be found under: ‘The described milestones in this response will be the key outcomes of the project.’. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.434210526315789
                },
                {
                    "author_link": "https://gov.optimism.io/u/katie",
                    "index": "18",
                    "likes": "1",
                    "time": "19/03/2023-02:19:40",
                    "content": "Hello and thank you for your proposal!  Since your distribution plan does not directly increase users, I feel your proposal would be better suited for the Builders Grants program. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.125
                },
                {
                    "author_link": "https://gov.optimism.io/u/polarpunklabs",
                    "index": "19",
                    "likes": "1",
                    "time": "19/03/2023-15:26:16",
                    "content": "Intriguing, can I get a link to the ’ which include research for Ethereum foundation academic grants’ mentioned? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/CryptoKachu",
                    "index": "20",
                    "likes": "0",
                    "time": "20/03/2023-04:28:09",
                    "content": "Thank you for the interest. You can check the following link with researcher name ‘Huisu Jang’.   Ethereum Foundation Blog    Academic Grants Round grantee announcement | Ethereum Foundation Blog      ",
                    "links": [
                        "https://blog.ethereum.org/2022/07/29/academic-grants-grantee-announce"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.666666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/CryptoKachu",
                    "index": "21",
                    "likes": "1",
                    "time": "20/03/2023-04:28:39",
                    "content": "Thank you for the comment. If so, will it be better to re-apply for the grant in the next cycle (12)? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                }
            ]
        }
    ],
    "group_index": "563"
}