{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/update-of-the-phase-1-protocol-nomination-template/2966",
            "title": "Update of the PHASE 1 protocol nomination template ",
            "index": 2966,
            "category": [],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/Defi_LATAM_axlvaz",
                    "index": "1",
                    "likes": "7",
                    "time": "13/07/2022-16:23:01",
                    "content": "This is a joint collaboration of: @OPUser (delegate),  @Netrim @NicoEsp @SEED_LATAM_Joxes @Defi_LATAM_axlvaz (DeFi Latam & Optimism Español [no oficial]) If I am missing the name of any contributor, please let me know. Summary Noting the number of proposals and consultations made by the delegates to the proponents. We request, along with other delegates and government members, this modification to the application template. So that projects/protocols/proponents can more robustly and strongly articulate the actions they will take with the amount of tokens requested. Also so that the delegate has more information when making a decision. Important: If you think any item is missing or you think we should add another question, leave your proposal in this thread and we will add the changes. Objectives: This proposal is ONLY to modify the postulation template to improve communication between delegates and postulants. 1- Name of the project: 2- Type of project (Dex, loan, bridge, etc). 3-Explain in a short text what your project is about, keep it short (220 words): 4- Project links (include all possible):  Web Twitter Discord Telegram GitHub Youtube Instagram Facebook Others  5- Name of the author of the proposal: 6- Social networks:  Twitter Discord Telegram  7-Team members (optional):  Name Twitter Discord Telegram  8- Number of OP tokens requested: 9- Your project is currently deployed/implemented in Optimism YES/NO: 10- Date of deploy of operations in Optimism: 11- L2 Recipient Address: 12- Address assigned to receive funds if is a multisig/treasure DAO (provide signatory addresses): 13- Relevant on-chain usage metrics (Optimism metrics only):  TVL Transactions Volume Unique addresses  14- Metric Links:  DefiLLama DuneAnalycs Others  15- Optimism alignment (up to 150 word explanation): 16- Proposal for token distribution (under 1000 words): How will the OP tokens be distributed? List of suggestions: If a % is marked for development, please indicate:  Budget proposal - Work outline Number of people who will work on the development of the project Execution time  If a % is for marketing purposes, please indicate this:  Marketing plan KPIs Execution time Dissemination channels  If a % is destined to builders or integrations or subsidies, please indicate:  Selection process Number of projects they will accept: Requirements to be applied for  If a % is allocated to incentives, please indicate: Type of incentive (airdrop, LP, referral, etc.)  Incentive scheme KPIs Execution time  If you allocate a % to increase your participation in the governance of Optimism, please indicate it:  Amount to allocate or % Reasons for allocation Delegation or address to which you will allocate the tokens  17- How will this distribution incentivize usage and liquidity on Optimism? 18- Why will the incentivized users and liquidity remain after incentives dry up? 19- Over what period of time will the tokens be distributed? 20- Has your project previously received an OP token grant? If Yes, link your last proposal and status of the these token used 21- How much will your project match in co-incentives? ",
                    "links": [
                        "https://twitter.com/OptimismESP",
                        "https://gov.optimism.io/t/ready-gf-meta-proposal-to-reserve-a-share-of-gf-distribution-for-liquidity-backstopping-and-stronger-governance/2969/5",
                        "https://gov.optimism.io/t/i-wan-to-discuss-project-boosting-their-delegate-power-with-governance-fund/2961/31",
                        "https://gov.optimism.io/t/i-wan-to-discuss-project-boosting-their-delegate-power-with-governance-fund/2961/61",
                        "https://gov.optimism.io/t/draft-so2-committee-proposal-defi-group-c/3320",
                        "https://gov.optimism.io/t/voting-power-grant-proposal/4197",
                        "https://gov.optimism.io/t/defi-latam-delegate-communication-thread/2950/3"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.519841269841271
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "2",
                    "likes": "3",
                    "time": "13/07/2022-17:31:41",
                    "content": "First of all, thank you for all the effort you are putting into our governance. I support this and would like to see these changes implemented. My reasoning:- on project details:   during last few week I have seen all the proposals and few of them miss to include important details like project metric, I had to check on defilama for that, its project responsibility to provide us the details not other way around.   Few proposals has missing website link to their project, again, they should include this in their proposal. Twitter, git and other social media presence will help us both.   This    9- Your project is currently deployed/implemented in Optimism YES/NO:  is important and missing in 30-40% of proposals, if your project is not live on OP chain, give us a rough estimate date.  (on point 16) Phase 0 was an inauguration phase, Phase 1; cycle 1 and 2 was mostly focused on liquidity and few of us give them benefit of doubt when supporting the proposal, including myself. Going forward, I would like to see more details on their token distribution, KPI based is even better.  I know once these changes are included, proposal will be little big compared to current one but it will also contain all the necessary information to make a judgement call on first glance. Also, dont forget to use the discord temp-check channel. Happy to hear your input. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4356060606060606
                },
                {
                    "author_link": "https://gov.optimism.io/u/SEED_LATAM_Joxes",
                    "index": "3",
                    "likes": "3",
                    "time": "13/07/2022-18:41:24",
                    "content": "Grateful and proud to see these initiatives from our community. Based on the experience gathered from the beginning of Phase 0 and 1, this is a proposal to gain efficiency, clarity and reduce the workload for both proposers, delegates and the community. The objective is not to tighten the requirements but to provide more information and clarity at first hand. We hope that these changes continue to be a good fit for all kinds of proposals and initiatives that the rest of Web3 ecosystem wants to bring to Optimism. It will also be important to receive feedback from others to further optimize the changes requested in this proposal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.805555555555555
                },
                {
                    "author_link": "https://gov.optimism.io/u/GFXlabs",
                    "index": "4",
                    "likes": "4",
                    "time": "13/07/2022-19:12:28",
                    "content": "Two small suggested additions: “Please provide a reliable point of contact for the project” “Will you provide updates at regular intervals and at the conclusion of administering these grant funds?” The latter is ultimately unenforceable, but it’s easy enough to get a commitment to do so before the grant is given. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.152777777777777
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "5",
                    "likes": "2",
                    "time": "16/07/2022-20:22:33",
                    "content": "Hey thanks for this! This is very heavily suited for on-chain protocols. It’s a nice suggestion, but if we do that, we should also include a template for proposals for software development since we have already funded such proposals. Some questions/suggestions:     Defi_LATAM_axlvaz:  12- Address assigned to receive funds if is a multisig/treasure DAO (provide signatory addresses):   Why do you need the signatories? It’s not important as they can change at any time.     Defi_LATAM_axlvaz:  3-Explain in a short text what your project is about, keep it short (20 words):   Perhaps 20 words is not enough. 220, as much a single tweet, would probably be best. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.659285714285715
                },
                {
                    "author_link": "https://gov.optimism.io/u/Defi_LATAM_axlvaz",
                    "index": "6",
                    "likes": "1",
                    "time": "16/07/2022-21:14:00",
                    "content": "    lefterisjp:  ¿Por qué necesita los firmantes? No es importante ya que pueden cambiar en cualquier momento.   We can remove it, considering that it is not important.     lefterisjp:  Quizás 20 palabras no sean suficientes. 220, como mucho un solo tweet, probablemente sería lo mejor.   You are right, now I change it     lefterisjp:  Esto es muy adecuado para los protocolos en cadena. Es una buena sugerencia, pero si hacemos eso, también deberíamos incluir una plantilla para propuestas de desarrollo de software, ya que ya hemos financiado dichas propuestas.   I have been thinking about it, this template is more protocol oriented and does not consider software development, infrastructure or experimental development. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.857142857142858
                },
                {
                    "author_link": "https://gov.optimism.io/u/kravi",
                    "index": "7",
                    "likes": "0",
                    "time": "21/07/2022-07:54:54",
                    "content": "    Defi_LATAM_axlvaz:  If you allocate a % to increase your participation in the governance of Optimism, please indicate it:  Amount to allocate or % Reasons for allocation Delegation or address to which you will allocate the tokens    I wonder how this extra detail prevent Prep kind of situation, if that’s the intention behind it. There are many who’re not showing interest in governance participation, and there may be a few who might be keen. In both cases, the answer for these three question more likely is “it depends”, even if they mention a certain ‘specific’ answer, it can’t be taken seriously. Well, then how does this help? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.44047619047619
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "8",
                    "likes": "1",
                    "time": "21/07/2022-10:18:31",
                    "content": "Hi @kravi     kravi:  certain ‘specific’ answer, it can’t be taken seriously   I agree here with you, once token is in their wallet they can do anything with that but as a collective, we can raise our voice against it, learn from it and work towards improving the gov structure and template. Basically, just because one project did it does not mean we should not trust or give some benefit of doubts to other project. How would you suggest we should handle this ? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.9122023809523805
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "9",
                    "likes": "0",
                    "time": "21/07/2022-16:13:45",
                    "content": "I think if we’re going to take the notion of public goods seriously, we should ask applicants to disclose all of their funding sources to date. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.166666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "10",
                    "likes": "0",
                    "time": "21/07/2022-16:45:04",
                    "content": "Could not agree more, for public funding we need to give some thought while creating the template. Lets wait for OP Citizen to go live. But this template is for gov fund. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0606060606060606
                },
                {
                    "author_link": "https://gov.optimism.io/u/Defi_LATAM_axlvaz",
                    "index": "11",
                    "likes": "1",
                    "time": "21/07/2022-18:43:27",
                    "content": "    Defi_LATAM_axlvaz:  ¿Cómo se distribuirán los tokens OP? Lista de sugerencias:   we clarify that these are suggestions ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/kravi",
                    "index": "12",
                    "likes": "1",
                    "time": "22/07/2022-08:26:18",
                    "content": "I presume, the situation arises only when the number of OP tokens being requested is too high eg., 9 millions in Perp case. Perhaps community may define a threshold for that, for each phase, so that it would not go beyond that. Also, you may define a ‘focus’ period, for new projects (grantees), during which the tokens can only be used ‘as per the respective proposal’. So they can’t delegate, nor take part directly in governance, during that period. Hope these help.     Defi_LATAM_axlvaz:  we clarify that these are suggestions    ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.330303030303031
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "13",
                    "likes": "0",
                    "time": "13/09/2022-20:36:04",
                    "content": "Please see updated Grant Proposal Template ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "155"
}