{
    "poll_list": [
        {
            "id": "0xd469ba187d0232c9626a7e6179c35adfdbdf1df8874375a2e54ff0d0de3c1501",
            "title": "Proposal D: Governance Phase 1 - xToken Terminal and Gamma Strategies",
            "discussion": "https://gov.optimism.io/t/ready-gf-phase-1-xtoken-terminal-and-gamma-strategies/3001",
            "body": "This Governance Fund Phase 1 proposal has been marked ready and as such is eligible for voting in Cycle 4. This proposal HAS been approved as ready for vote by a delegate. For more info, check out Voting Cycle 4 Roundup: [https://gov.optimism.io/t/voting-cycle-4-roundup/3055](https://gov.optimism.io/t/voting-cycle-4-roundup/3055)\n\nLink to proposal: https://gov.optimism.io/t/ready-gf-phase-1-xtoken-terminal-and-gamma-strategies/3001",
            "choices": [
                "For",
                "Against",
                "Abstain"
            ],
            "scores": [
                17054318.73129838,
                2338322.9015104785,
                137163.56093109897
            ],
            "start": 1658430341,
            "end": 1659553541,
            "snapshot": "15277565",
            "state": "closed",
            "author": "0x47C88bb92B409fF25F6587EA611fac4e55f76007",
            "space": {
                "id": "opcollective.eth",
                "name": "Optimism Collective"
            }
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/ready-gf-phase-1-xtoken-terminal-gamma-strategies-and-uniswap-v3-staker/3001",
            "title": "[READY] [GF: Phase 1] xToken Terminal, Gamma Strategies, and Uniswap V3 Staker ",
            "index": 3001,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Governance Fund: Phase 1"
            ],
            "tags": [
                "cycle-4",
                "passed"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/ben_xtoken",
                    "index": "1",
                    "likes": "14",
                    "time": "15/07/2022-17:16:08",
                    "content": "Note: xToken has amended its original proposal to integrate community feedback, such as allocating rewards fully to Optimism, allocating rewards fully to WETH<>OP 0.3% pool, and extending the program from 10 weeks to 6 months (24 weeks). Along with the increase in duration, we increased the amount of incentivizes requested to ensure deep liquidity.  Project Name: xToken Terminal, Gamma Strategies, and Uniswap V3 Staker  Author Name: xToken Terminal and Gamma Strategies  Number of OP tokens requested: 900,000  L2 Recipient Address: 0x38138586AedB29B436eAB16105b09c317F5a79dd  Relevant Usage Metrics: (TVL, transactions, volume, unique addresses, etc.)  xToken: $3.5M USD in TVL (Defi Llama) Gamma: $4.2M USD in TVL (Defi Llama)   Optimism alignment (up to 200-word explanation): The following is a joint proposal by xToken Terminal & Gamma Strategies to outline a path forward for OP liquidity incentives on Uniswap V3. This is an updated version of our June 2nd pre-proposal, which received strong community support. From that version, we’ve reduced the amount of tokens requested – we recommend Optimism start with an initial 10-week program and then reassess continuation of the program. Terminal’s out-of-the-box solution allows projects to deploy a highly configurable Uni V3 liquidity mining (LM) program in a matter of minutes, no dev work or technical expertise required. Terminal is live on Ethereum mainnet, Optimism, Arbitrum and Polygon. Gamma has been actively managing liquidity on Uniswap V3 since March 2021 and prides itself on optimal LP strategies using its machine learning algorithms and automated strategies. Gamma is currently live on Ethereum mainnet, Optimism, and Polygon. The OP token is finally live, ushering in a new era for L2 Ethereum. For now, Optimism is the only leading ETH scaling solution with a liquid token. The OP token – which serves a focal role in the governance of the network – has already generated significant investor interest. As such, bootstrapping a strong, stable foundation of liquidity for the token is essential. While the token is trading on multiple CEXes, most DEX liquidity looks to be bootstrapped by independent actors and perhaps professional market makers. This is an undesirable state of affairs for a token, project and community with a commitment to transparency, decentralization and permissionlessness. We believe an OP liquidity mining program should be considered.  Proposal for token distribution: We propose a total allocation of 900,000 OP tokens for liquidity incentives, distributed evenly across three providers: xToken Terminal, Gamma Strategies, and UniswapV3Staker. After discussion with the Optimism community, we believe that 100% of incentives should be paid out on Optimism via the WETH<>OP 0.3% fee tier pool. Liquidity in this pair is most critical to the success of the Optimism token so we feel a full allocation is the best way to ensure adequate and sustained depth. For a detailed explanation of our analysis and initial design of the LM program, refer to our pre-proposal discussion.  How will the OP tokens be distributed? 900,000 OP tokens distributed to LPs over a period of 24 weeks:  ~33% allocated to each service provider’s program 100% paid out on Optimism 100% to WETH<>OP 0.3% pool   How will this distribution incentivize usage and liquidity on Optimism? With three different service providers, each will be able to approach liquidity incentives and provision in a way that complements the other two, providing a robust incentives offering for all types of LPs.  xToken will provide a user-friendly interface for full range OP liquidity incentives, offering a passive option with lower IL and execution risk for community members who want a simpler LM experience. Gamma will actively manage OP liquidity, concentrating assets right around the spot price and structuring rewards through their platform. UniswapV3Staker will offer a more expressive, dynamic option for more sophisticated LPs looking to rebalance frequently and independently of other LPs.   Why will the incentivized users and liquidity remain after incentives dry up? With a 24 week campaign, we’ll be able to attract long-term users and capital from ETH mainnet and other chains. We believe that the user experience and emerging opportunities on the Optimism network will be enough to retain the majority of users after the incentives program ends. As we mentioned above, Optimism is uniquely positioned to obtain LP capital with its native token being first to market of the major L2s.  Over what period of time will the tokens be distributed? Linearly over a period of 24 weeks.  How much will your project match in co-incentives? Due to their current emission allocations, it’s unlikely xToken and Gamma Strategies would be able to match incentives for this program. ",
                    "links": [
                        "https://gov.optimism.io/t/op-liquidity-mining-incentives-on-uniswap-v3/2365",
                        "https://gov.optimism.io/t/voting-cycle-4-roundup/3055",
                        "https://gov.optimism.io/t/review-gf-phase1-homora-v2-x-ironbank-on-optimism/3425/21",
                        "https://gov.optimism.io/t/ready-gf-phase-3-xtoken-terminal/5665",
                        "https://gov.optimism.io/t/draft-gf-phase-1-revert-finance-compoundor/3242/23",
                        "https://gov.optimism.io/t/gfx-labs-delegate-communication-thread/2728/14"
                    ],
                    "GPT-summary": "The post is a proposal by xToken Terminal and Gamma Strategies for liquidity incentives on Uniswap V3. The proposal outlines the path forward for OP liquidity incentives on Uniswap V3 and proposes a total allocation of 900,000 OP tokens for liquidity incentives, distributed evenly across three providers: xToken Terminal, Gamma Strategies, and UniswapV3Staker. The post also explains how the OP tokens will be distributed and how the distribution will incentivize usage and liquidity on Optimism. The proposal has been amended based on community feedback. The post also mentions the TVL of xToken and Gamma Strategies and their alignment with Optimism.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Token economics",
                        "Interoperability and Scaleability",
                        "Smart contract updates",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.7436774204631345
                },
                {
                    "author_link": "https://gov.optimism.io/u/ben_xtoken",
                    "index": "2",
                    "likes": "1",
                    "time": "15/07/2022-17:17:33",
                    "content": "Apologies, only allowed two links per post.  xToken: https://xtokenterminal.io/  Gamma: https://www.gamma.xyz/   ",
                    "links": [
                        "https://www.gamma.xyz/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/ben_xtoken",
                    "index": "3",
                    "likes": "1",
                    "time": "15/07/2022-17:18:42",
                    "content": " Uniswap V3 Staker: Uniswap V3 Staker Contract | Uniswap  TVL (DefiLlama): xToken: TVL and stats - DefiLlama   ",
                    "links": [
                        "https://defillama.com/protocol/xtoken"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "4",
                    "likes": "3",
                    "time": "15/07/2022-18:01:17",
                    "content": "A point of clarification for readers, because there was some confusion in response to the pre-proposal: These are independent market markers who are requesting OP to help incentivize the funding of their strategies on Uniswap v3. They are not affiliated with Uniswap. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/ben_xtoken",
                    "index": "5",
                    "likes": "5",
                    "time": "15/07/2022-18:21:28",
                    "content": "To be clear, these funds are not going to xToken, Gamma or the UniStaker team. These rewards are going to LPs who deposit OP-WETH or OP-USDC liquidity ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/millie",
                    "index": "6",
                    "likes": "5",
                    "time": "16/07/2022-13:04:10",
                    "content": "I like the proposal, the only thing I don’t agree with is 25% of the allocation being directed to mainnet. IMO directing any rewards to mainnet is a waste since there is no reasonable arbitrage vector given that all CEXs which support OP only support OP deposit/withdrawals on L2. More over, LPs would need to buy OP on L2, wait 7 days to bridge back to L1, and then add liquidity at a ratio which would likely have changed in that 7day period. Lastly, the ETH mainnet market is a much bigger and more whale oriented market, so 25% of 500K OP in rewards, simply will not do much to move the needle in terms of creating “access” to OP since small buyers would prefer to buy OP on L2 (gas costs) and whales are not interested in buying OP from shallow mainnet pools (when the bulk of liquidity is sitting on L2 and CExs). I would support this proposal if 100% of incentives were targeted at L2. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.063888888888889
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "7",
                    "likes": "2",
                    "time": "18/07/2022-14:13:52",
                    "content": "Gamma  xToken  Although less liquidity on OP chain, project does have liquidity on main chain and if could encourage the liquidity migration with OP incentive, that would be great. But spending 500K in just 3 months is quite fast for my taste and no co-incentives. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/MoneyManDoug",
                    "index": "8",
                    "likes": "0",
                    "time": "18/07/2022-14:53:42",
                    "content": "I think there are many benefits to be had by fragmenting liquidity between Velo and uniswap, the competition is great for innovation and user acquisition. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 8.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/mjc716",
                    "index": "9",
                    "likes": "2",
                    "time": "18/07/2022-19:56:26",
                    "content": "We’re open to 1) focusing all incentives on Optimism and 2) including Velo in our proposal, though it would be great to hear more feedback and opinions on this before updating our proposal ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.166666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "10",
                    "likes": "2",
                    "time": "18/07/2022-20:26:18",
                    "content": "(hey i’m velodrome team) we can discuss how deploying or incentivizing liquidity through our platform could be advantageous for you or the ecosystem, but we’d need to learn more about your model first. I can’t say for sure whether it would, but possibly! Even if we together found there was potentially something of value, I’d need to disclose pretty heavy conflicts in reporting this (or avoid commenting altogether). But happy to discuss if you’d like to jump in our server. Velodrome If ppl prefer for the sake of transparency we could have that conversation here as well – just don’t want to crowd out other opinions and voices. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.097222222222223
                },
                {
                    "author_link": "https://gov.optimism.io/u/mjc716",
                    "index": "11",
                    "likes": "0",
                    "time": "18/07/2022-20:38:19",
                    "content": "I’m not totally sure what you mean. I was just saying that we could spread OP liquidity incentives across multiple platforms including non-Uni protocols like Velo ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.0625
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "12",
                    "likes": "0",
                    "time": "18/07/2022-22:10:03",
                    "content": "As I understand it, you primarily run strategies through v3, so it’s not clear to me how you stand to benefit from working with other AMM structures such as ours. Presumably you’d be spreading liq incentives for that purpose. In response to being mentioned by name as a possibility, I was volunteering as part of the Velo team to help you consider what your options might be on our platform to determine how/whether it would help. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.28125
                },
                {
                    "author_link": "https://gov.optimism.io/u/mjc716",
                    "index": "13",
                    "likes": "4",
                    "time": "18/07/2022-22:28:27",
                    "content": "Got it. Yeah, we wouldn’t stand to benefit directly from spreading incentives to other platforms. However, we’re trying to build an LM program that best serves the OP community and therefore we’re soliciting feedback on distribution, including w/r/t Velo. This all said, we still believe Uni V3 best serves the community as it’s the most capital efficient, highest volume and most programmable DEX - not to mention the Schelling point for trading and liquidity provision in the Ethereum ecosystem. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 7.479166666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/cryptokitty",
                    "index": "14",
                    "likes": "0",
                    "time": "19/07/2022-14:35:38",
                    "content": "I agree 100% with Millie that all the rewards should go to Optimism.  I don’t see any point in having a shallow Mainnet pool.  Might as well concentrate everything towards one pool to have the greatest effect. I also think we should allocate everything to the WETH / OP 0.3% pool.  We get the greatest return on the OP incentives if everything is concentrated in one pool.  The WETH / USDC 0.05% pool is already pretty well funded, so if people wanted to trade from USDC to OP and vice versa, it wouldn’t be too big of a deal to route through the WETH / USDC 0.05% pool which has good amount of liquidity anyways. I think the capital efficiency gains from having a really big WETH / OP pool will make up for the extra 0.05% fee by hopping through the WETH / USDC pool. This reasoning is also why I’m against splitting these rewards also with Velodrome because it’s again making it less capital efficient.  We get the most bang for the buck if all the rewards are directed to one pool.  That pool would be the WETH / OP 0.3% pool on Optimism.  But at the same time, I see that having a central point of failure is bad, so splitting among xToken, Gamma Strategies, and the Uni v3 Staker works for me given that all of the incentives given to these parties would contribute to the capital efficiency of one pool. Also 10 weeks is a bit extreme.  It should be more like 4-6 months. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.721354166666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "15",
                    "likes": "1",
                    "time": "19/07/2022-15:11:11",
                    "content": "Yeah if there isn’t an overall benefit here I don’t see much sense in devoting any resources to Velodrome through this proposal, though I appreciate the sentiment of wanting to benefit Optimism-native projects. Can you explain how xToken works and what sorts of returns / IL LPers can expect? I think ppl might want to see that there’s an enduring benefit here over and above OP-juiced returns. @cryptokitty that’s a pretty risky proposal, as you could well see routers going through other means with fees that high on such large pools. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.437053571428572
                },
                {
                    "author_link": "https://gov.optimism.io/u/cryptokitty",
                    "index": "16",
                    "likes": "1",
                    "time": "19/07/2022-15:44:18",
                    "content": "Can you clarify what you mean when you say “you could well see routers going through other means with fees that high on such large pools”? The route that I was suggesting is you go from USDC →  WETH → OP.  The USDC-WETH pool is a low fee tier pool at 0.05%.  So allocating OP rewards to USDC-OP doesn’t make much sense to me when you can just allocate everything to the WETH-OP pool so as to increase liquidity/decrease price impact on the WETH-OP leg of the trade, which may very well be cheaper than having two smaller OP pools. Like you’d rather have one 2-carat diamond as opposed to two 1-carat diamonds because of the capital efficiency gains of having the liquidity all in WETH-OP versus half in WETH-OP and half in USDC-OP ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.001569264069264
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "17",
                    "likes": "1",
                    "time": "19/07/2022-15:51:07",
                    "content": "ah mb didn’t read closely enough, thought you were talking about going to a higher fee tier on the usdc-weth pool. yeah on this piece specifically that’s def reasonable ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/StrategicReserve",
                    "index": "18",
                    "likes": "2",
                    "time": "19/07/2022-16:34:11",
                    "content": "I agree with the suggestions from @millie @OPUser and @cryptokitty 100% Optimism, no Mainnet pool Agree. Regarding mainnet, I think a mainnet pool program should be a separate proposal maybe sometime down the line. It is its own thing, and the Optimism community may feel differently about it in a few months. Longer reward period 26 weeks instead of 10 weeks Agree. After reviewing many, many programs, I think longer-term ones tend to work better and have fewer shock effects with LPs joining or leaving the pools abruptly Allocate everything to the WETH / OP 0.3% pool Also agree with this. Better to have solid liquidity on a critical pair. Great feedback! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.299768518518518
                },
                {
                    "author_link": "https://gov.optimism.io/u/ben_xtoken",
                    "index": "19",
                    "likes": "0",
                    "time": "19/07/2022-17:03:19",
                    "content": "Terminal pools use a Uniswap V3 wrapper, so impermanent loss will function the same as any V3 pool. In addition to the rewards incentives, Terminal LPs will earn swap fees within the Uniswap pool. Although the OP rewards are temporary, LM is a catalyst for users to bridge funds and interact with the network. Some users will move their liquidity once the incentives end, but others will remain in the pool and/or continue to provide OP liquidity elsewhere. For more information on the mechanics of Terminal Mining, please refer to our docs: ((Liquidity) Mining - xToken Docs) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 4.583333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/Flipflop",
                    "index": "20",
                    "likes": "1",
                    "time": "20/07/2022-09:23:01",
                    "content": "I think that we should stick to Optimism only. A mainnet pool should be a separated proposal. I don’t feel anything for a mainnet pool personally. Imo the length of the rewards should be longer than 10 weeks. 10 weeks is absolutely too short. 5 to 6 months would be a much better timeframe. We should allocate everything to one pool, better to have one pool with thick liquidity  than have different pools with less liquidity. The right choice like cryptokitty said would be weth/op 0.3%. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5095238095238095
                },
                {
                    "author_link": "https://gov.optimism.io/u/mjc716",
                    "index": "21",
                    "likes": "5",
                    "time": "20/07/2022-14:37:43",
                    "content": "We’re hearing support for:  allocating rewards fully to Optimism allocating rewards fully to WETH<>OP 0.3% pool extending the program from 10 weeks to 4-6 months (~18 to ~26 weeks)  We think these arguments make sense and would support tweaking the proposal to reflect the new params ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.681818181818182
                },
                {
                    "author_link": "https://gov.optimism.io/u/ben_xtoken",
                    "index": "22",
                    "likes": "3",
                    "time": "20/07/2022-18:31:25",
                    "content": "We sincerely appreciate the community discussion and feedback! We’ve amended our original proposal above to integrate that feedback, such as allocating rewards fully to Optimism, allocating rewards fully to WETH<>OP 0.3% pool, and extending the program from 10 weeks to 6 months (24 weeks). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "23",
                    "likes": "1",
                    "time": "21/07/2022-00:02:36",
                    "content": "i see you’re multichain - can you show evidence of tvl having bridged and remained with with you over a long period of time? I assume there were rewards offered elsewhere as well? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/ben_xtoken",
                    "index": "24",
                    "likes": "1",
                    "time": "21/07/2022-15:10:32",
                    "content": "Thank you all for reviewing the updates. It’s clear that we’ve strengthened the proposal with the Optimism and OP<>WETH focused incentives. With the longer duration (from 10 weeks to 24) it may make sense to increase the requested token allocation as well, to ensure deep liquidity. We’d like to put it to a community discussion: Should we a) keep the requested allocation at the initially scoped 500K OP tokens,  b) increase to 700K, or c) increase to 900K? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.166666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/millie",
                    "index": "25",
                    "likes": "3",
                    "time": "21/07/2022-15:24:48",
                    "content": "I think the 900k requested is reasonable, the distribution of the tokens are very straight forward, they will be split between 3 distinct strategies(xToken Terminal, Gamma and UniV3staker) over 6months, all targeted at OP/ETH pairs on Optimism. This proposal creates an abundance of diversity among OP paired liquidity programs from various other governance fund applicants as well as DEXs and will result in the benefit of the entire Optimism Ecosystem. I support the proposal as is with 900k OP over 6months. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.529166666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/BP_Gamma",
                    "index": "26",
                    "likes": "0",
                    "time": "21/07/2022-15:25:50",
                    "content": "Hey Jack, I’m Brian from Gamma Strategies.  All of our TVL has been sourced organically thus far without incentives.  We do have a few pools that we’re managing on Mainnet that are being incentivized by our partner, H2OData, but for the most part it’s all currently unincentivized.  You can see our TVL on the three chains that we’re on here:  Gamma: TVL and stats - DefiLlama In terms of multichain, our TVL on Polygon has been slowly growing with the number of partnerships and pairs that we have opened up there.  None of that is currently incentivized either. On OP, we’ve recently opened up there, so our TVL has stayed relatively stable thus far, but we have been making a push to actively get more TVL on Optimism.  We just recently passed a proposal on Frax Finance / Convex Finance to manage FPI-FRAX specifically on Optimism. That particular Frax gauge will be the first Frax gauge on Optimism which will incentivize Optimism LPs with FXS rewards.  https://twitter.com/GammaStrategies/status/1546480809275666432?s=20&t=W2W-wsTN_Y1MKb86pvhbUQ So we are optimistic (no pun intended) that our TVL will grow on Optimism even in the absence of OP rewards going forward.  Hope that answers your question.  Thanks! ",
                    "links": [
                        "https://twitter.com/GammaStrategies/status/1546480809275666432?s=20&t=W2W-wsTN_Y1MKb86pvhbUQ"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving information about TVL",
                        "3rd party explaining their approach to incentives",
                        "3rd party mentioning their recent proposal on Frax Finance/Convex Finance",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.417892156862745
                },
                {
                    "author_link": "https://gov.optimism.io/u/cryptokitty",
                    "index": "27",
                    "likes": "1",
                    "time": "21/07/2022-15:32:14",
                    "content": "Yeah I think the increase to 900K makes sense.  I’d rather have a bit more over a longer period of time.  The fact that the rewards are split amongst all three sources also mitigates a lot of risk given no single point of failure.  Additionally OP-WETH liquidity is something that is important to the Optimism ecosystem, so we should dedicate more to this particular trading pair.  Deeper liquidity here will result in a greater distribution of tokens as price impact comes down and we can ensure that there’s more in-range liquidity. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.18342151675485
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "28",
                    "likes": "1",
                    "time": "21/07/2022-15:54:03",
                    "content": "If you’ve been able to show good results with a differentiated service elsewhere, I’m not sure what exactly the need here is to get such a large amount of OP distributed up front. The results ought to show themselves organically anyway, so it seems unclear that, as mentioned in the OP discord, a lower amount of funding would disadvantage you. Distributing across three strategies isn’t risk mitigation by any stretch if one way or another we’re still disposing of 900k - 10% of the entities’ multichain TVL combined - in one clip without continued community oversight. If anything, this lends more cause to shorten the duration of the grant. We could try a 6-8-week time period, scaling the distribution down by time, and see for ourselves how well these offerings are working - and it ought to have a pretty immediate effect. And if some strategies are working better than others, we can collectively tune the grants to increase chances of everyone’s success. There’s absolutely no need to worry about shorter-term disruption of LPs; xToken Terminal and Gamma Strategies can simply reapply a few weeks before the end of rewards. That’s the point of these highly phased distributions. It strikes me as likely that these offerings meet a need but unnecessary for us to deliver such a huge grant package up front. To preempt any claims of conflict: I mentioned here and in the OP discord that I’m on the Velodrome team but value a strong Uni v3 environment as well as community-benefiting market making. I’d also like to point out that in this thread I’ve been supportive and dismissed someone else’s suggestion to redirect incentives onto Velodrome. Following revelations about Perpetual Protocol’s management of the OP grant, I’ve decided that to increase participation I will begin to offer my private opinions about these proposals, always disclosing any potential conflicts. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.750429894179893
                },
                {
                    "author_link": "https://gov.optimism.io/u/StrategicReserve",
                    "index": "29",
                    "likes": "1",
                    "time": "21/07/2022-16:08:38",
                    "content": "The 900K split is appropriate given the timelines and the liquidity levels desired. Right now, that’s about $625k total split over six months to three providers. Or about $35k per month per platform of rewards going out to LPs. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.309523809523809
                },
                {
                    "author_link": "https://gov.optimism.io/u/cryptokitty",
                    "index": "30",
                    "likes": "0",
                    "time": "21/07/2022-17:09:54",
                    "content": "    jackanorak:  Distributing across three strategies isn’t risk mitigation by any stretch if one way or another we’re still disposing of 900k - 10% of the entities’ multichain TVL combined - in one clip without continued community oversight.   On this part, I think it’s just going to be 300K to each of xToken, Gamma Strategies, and the Uni v3 Staker.  That’s around $219K in incentives for each, more or less?  I think xToken has 4M, Gamma has 5M TVL.  So that’s < 5% of the their entire multichain TVL combined.  The other 300K OP is allocated to those using the Uni v3 Staker contract, so that’s pretty much public LP funds.  I think having active management is good to ensure that at least a good portion is in range, as public LP funds may not always be in range, but do provide an additional safety buffer in decentralized liquidity. But there are certainly conflicts of interest here.  More incentivization to the Uniswap v3 pool would lead to higher liquidity in Uniswap v3 and lower price impact.  So when using a DEX aggregator, the trades are more likely to go thru Uniswap v3 as opposed to Velodrome. But from a  trader perspective, a dollar of liquidity goes much further on Uniswap v3 versus a constant product AMM like Velodrome in terms of lowering price impact on trades.  So I guess those are two tradeoffs to be making here. Do we favor having the lower price impact on trades via Uniswap?  OR do we favor having more DEXes service this pair at the expense of higher price impact on trades? I’m more inclined with the former as I am a trader and an OP holder in that I would want incentives going to where they would have the greatest effect. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.117236024844721
                },
                {
                    "author_link": "https://gov.optimism.io/u/cryptokitty",
                    "index": "31",
                    "likes": "0",
                    "time": "21/07/2022-17:20:59",
                    "content": "    jackanorak:  Distributing across three strategies isn’t risk mitigation by any stretch if one way or another we’re still disposing of 900k - 10% of the entities’ multichain TVL combined - in one clip without continued community oversight.   I think the math there isn’t quite right.  With 900K OP incentives, you’ll have 300K going to each xToken, Gamma, and the Uni v3 Staker.  So that’s approximately $219k USD to each xToken and Gamma.  xToken has around $4M TVL, so that would equate to 5.4% of their TVL.  Gamma has around $5M TVL, so that would equate to around 4.3% of their TVL. Additionally, the remaining 300K OP tokens will be going to the LPs using the Uni v3 Staker contract.  So that would be split amongst all LPs who are using that contract.  I think that makes sense given that we do want a decent amount of in-range liquidity so it makes sense to have xToken and Gamma actively manage that.  But we also do want the safety buffer in terms of having the decentralized liquidity providers providing via the Uni v3 Staker contract. There certainly is a conflict of interest here as well because the more incentives that are allocated to Uniswap v3, the deeper the liquidity will be there, and the more trades will be routed to Uniswap v3 versus another AMM like Velodrome when using a DEX aggregator.  However, because Uniswap v3 is a concentrated liquidity AMM versus a constant product AMM, a dollar of liquidity will go much further in terms of lowering price impact on trades on Uniswap v3 than on Velodrome. So I guess the main question is do we value having deeper liquidity on Uniswap v3 as well as more bang for the buck in terms of OP incentives per effective liquidity?  Or do we value having a more OP-WETH trading activity take place on more AMMs? I’m more inclined to say the former because the Uni v3 Staker contract does allow for decentralized liquidity without splitting the OP-WETH liquidity so many ways and causing more price impact than there could be.  Also as an OP holder myself, I would want the biggest bang per OP incentive.  For that reason, I’m supportive of the 900K OP rewards split over 6 months. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.421052631578947
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "32",
                    "likes": "0",
                    "time": "21/07/2022-17:33:01",
                    "content": "My math is just fine; you’re obfuscating the intention of 300k, which goes to Univ3 staker to facilitate the function of their proposal: juice yields on pools. Same as what other protocols are asking for when they want liquidity mining – even though that goes to LPs, or when they’re asking for user incentives. I’m all for proving out the thesis. Over less time, with less OP funds. If they demonstrate effectiveness, then by all means let’s continue it. They’re saying that people will bridge for their product and stay with it as an enduring eco benefit. Have they bridged for their product elsewhere (or here, for that matter)? Seems like not really. Why not demonstrate this conclusively over a shorter amount of time, confirming your thesis that we’d see more liquidity and efficiency systemwide (to the detriment of my own interests, apparently)? There’s no conflict here because, again, I’m not saying they shouldn’t get funds. I’m saying they should get the same amount proportionately over less time. If what you say is true, then I should be arguing that the proposal is bad, that these people aren’t providing value, and so on. This is a lot of money for an unproven thesis. Let’s try to prove it before giving out what’s likely their entire combined market cap in rewards. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.163888888888889
                },
                {
                    "author_link": "https://gov.optimism.io/u/cryptokitty",
                    "index": "33",
                    "likes": "0",
                    "time": "21/07/2022-17:35:19",
                    "content": "    jackanorak:  My math is just fine; you’re obfuscating the intention of 300k, which goes to Univ3 staker to facilitate the function of their proposal; juice yields on pools. Same as what other protocols are asking for when they want liquidity mining – even though that goes to LPs, or when they’re asking for user incentives.   I mean the Uni v3 Staker contract would be a separate contract entirely.  That would be separate from the funds going to xToken and Gamma or at least I would hope?  And only then, would I support this proposal.  If it were the case that all 900K tokens were going to solely xToken and Gamma, I would oppose it as well. Therefore, I think we should definitely make that extra clear in the final proposal that 300K goes to xToken, 300k goes to Gamma Strategies, and 300k goes to a separate account custodied by Optimism that will fund the Uni v3 Staker contract. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.899621212121213
                },
                {
                    "author_link": "https://gov.optimism.io/u/StrategicReserve",
                    "index": "34",
                    "likes": "1",
                    "time": "21/07/2022-17:37:49",
                    "content": "Let me add some some different distribution scenarios All values are the current value of OP ($0.70) as of today July 21, 2022 900,000 OP Distribution - 6 months  image900×183 5.21 KB  600,000 OP Distribution - 6 months  image880×179 5.12 KB  300,000 OP Distribution - 6 months  image879×180 5 KB . 450,000 OP Distribution - 3 months  image878×122 4.22 KB  300,000 OP Distribution - 3 months  image876×123 4.19 KB  150,000 OP Distribution - 3 months  image885×127 4.38 KB  ",
                    "links": [
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/4/45cb206354a446c98c9d2c6d51caf3bb8f5823bb.png",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/1/11a1a5ad1f89cad3ddb5f111e0edad3c0d12c2a1.png",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/4/4c7d2e0d8f775f857ad11354ec00cabf8b5e5c66.png",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/9/9898827ee75eac90f475619752bcd04c79854420.png",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/0/005e5dfac1dd995e800f200183c9173c4c053537.png"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Wagame.eth",
                    "index": "35",
                    "likes": "1",
                    "time": "21/07/2022-20:38:26",
                    "content": "Has now been changed to 100% emissions on Optimism, 100% to LPs on WETH-OP 0.3% pool ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Wagame.eth",
                    "index": "36",
                    "likes": "0",
                    "time": "21/07/2022-20:48:45",
                    "content": "Updated proposal sounds like a nobrainer… but… since xToken and Gamma Strategies are not providing (any?) co-incentives, can we at least expect active encouragement for users to LP on Optimism? Current TVL doesn’t look promising tbh… ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.708333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/MoneyManDoug",
                    "index": "37",
                    "likes": "0",
                    "time": "21/07/2022-22:28:19",
                    "content": "I think the same could be argued for Velo, you guys got 3m OP without having any prior data. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/MoneyManDoug",
                    "index": "41",
                    "likes": "0",
                    "time": "21/07/2022-23:34:39",
                    "content": "I had nothing to do with your post being flagged. Also not sure what you mean by it being a top 2-3 grant? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.895833333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "42",
                    "likes": "0",
                    "time": "21/07/2022-23:40:23",
                    "content": "ah, great – glad you made me go back to my notes. If this passes – and I want every Optimism-native protocol guided to ask for less or rejected outright to think about this – this will be the single largest Phase 1 grant to date, with Biconomy being #2 at 750k. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 6.061904761904762
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPenthusiast",
                    "index": "44",
                    "likes": "0",
                    "time": "22/07/2022-02:14:50",
                    "content": "I think the size of the grant should be reduced. However, I do appreciate and like the distribution and focus of the grant to exclusively reward on Optimism side and this will greatly deepen OP liquidity. Either the duration of distribution should be extended to longer than 24 weeks, or the size of the grant should be reduced. Otherwise the use of the grant is great. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Juanbug",
                    "index": "45",
                    "likes": "1",
                    "time": "22/07/2022-03:30:35",
                    "content": "Just wanted to weigh in with some of our views. First off, the work being done is pretty important in our opinion. However, it comes down to how much extra value this adds, and the opportunity cost of the grant. Penn Blockchain has voted no, here’s our reasoning why:  First concern was how much this proposal has changed over the last few days, and the seemingly “uncertain-ness” about the ask.  Whether it was the size of the $OP, the distribution of the grant (Mainnet included?, Velo or Uni?), just in the last few days it seems a bit all over the place. We have big respect for Jack Anorak and the Velo team. The last few comments and some deleted messages haven’t instilled, once again, the highest confidence in “the ask.” Although proposals have been formed in the past that don’t have much quantitative data backing the ask, using that reasoning as a semi-validation for your proposal isn’t the most confidence inspiring. The ask is pretty big… and if passed, may be the largest grant given to date. As unfortunate as it may be, the current state of DeFi might make this unluckily timed. For this sheer size of grant, and the pure amount of talent and coming through the pipeline, this huge amount might be better allocated elsewhere.  Overall, a lot of our concerns can be solved by just decreasing the ask size, and taking a few days/weeks to finalize the ask, sticking with it, and waiting a few weeks to maybe resubmit. Finally, we really appreciate the team reaching out regarding our no vote, and are continuously trying to express our opinions as much as possible. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.368121693121694
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPerator",
                    "index": "46",
                    "likes": "5",
                    "time": "22/07/2022-06:20:30",
                    "content": "Stopping by as a keen observer of CLMs and Uni V3 platforms Seeing three things here   This proposal’s “size” has come up.  Yet it’s three projects partnering up to do a liquidity rewards program, which are notoriously expensive. These guys are competitors with each other and dropped that to make a proposal for OP that would give Optimism the best value. I think that deserves credit. There is no slush fund or dev development here.   @Juanbug criticizing the proposal for making adjustments on the duration and ask is not fair. Nobody has criticized the commitment, the preparation, the dedication, the tech. The only criticism in this thread has been “change the length” and “change the amount”. It’s impossible to appease everyone realistically. Posts are asking this to be six weeks, and posts are asking it to be 6+ months.   I don’t like what I’m reading from @jackanorak. You made a simple claim that you want the proposal to be a trial period of 6-8 weeks to test and continue. That’s a fair assessment, but it really should just have ended there. As a competitor, with a 3m OP proposal up and who received phase 0 funds, it looks like you’re purposely trying to derail this proposal. Engaging in flame wars in this thread and calling the proposal “dumb” on the OP discord is not appropriate.   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.1856060606060606
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "47",
                    "likes": "1",
                    "time": "22/07/2022-11:37:23",
                    "content": "I didn’t want to come back and derail this thread but supporters of this proposal continue bizarrely to take issue with my tone (rather than the content of my asks) and are now taking my comments in the discord out of context in response. There I also made continued appeals against the kind of zero-sum thinking entering into complaints like the above. I haven’t engaged in flame wars - have only directly responded to others’ questioning of my intentions. I invite readers to go through my posts and ask themselves if I’m being in any way insulting. Whether Velodrome got a grant from the Foundation shouldn’t enter into any conversations on the merits of this proposal. It was not something proposed to governance. It’s not an advantage we enjoy over other protocols here. It was also the only fundraising we’ve ever gotten, being a bootstrapped project, and every protocol and user here has benefited as a result, including Uniswap and the protocols making this ask. I don’t understand how this new anon poster can on the one hand say with a straight face that the literal one thing I’m requesting over and over again for an otherwise good proposal is reasonable and on the other hand say I’m behaving inappropriately due to bias. It’s a 900k OP grant, the largest yet for Phase 1, devoted to juicing a single pool for a year with no opportunity for OP to reassess. The number of projects asking for this is irrelevant, as is the fact that rewards would go to LPs (that’s the case for virtually all liquidity mining projects, and there’s always the question of who’s providing the platform’s LP). I am saying that we could just as easily offer the same package over less time to ensure that it’s accomplishing the intended goals, which would absolutely help Optimism. I’d like to ask xToken and Gamma Strategies, if they feel heavily disadvantaged here — how much money have they fundraised from VCs, and how much of their current TVL do they estimate is from those VCs? This question is highly relevant because the answer tells us whether they have a track record attracting organic TVL, whether they’ve been able to use deposited funds efficiently (ie adding value), and why they won’t match incentives. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.4208217377860235
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "48",
                    "likes": "0",
                    "time": "22/07/2022-11:43:33",
                    "content": "Voted:- No Reason:- This proposal was discussed quite in dept on this forum as well on our discord. Cons:  Very low liquidity compare to number of token asked. No Co-incentives.  Pros:-  A huge plus point for this proposal is that team is focusing on OP paired based liqduity pair 900K does seems a lot for 6 months but its for three projects, 300K each for 6 Months seems very reasonable amount.  From our conversation, team want to jump start project launch on OP chain I would love to support with this suggestion:-  Match the co-incentives in $ value Wait until you have enough liquidity to support your proposal  ",
                    "links": [
                        "https://gov.optimism.io/t/opuser-delegate-communication-thread/2777/10"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.16
                },
                {
                    "author_link": "https://gov.optimism.io/u/BP_Gamma",
                    "index": "49",
                    "likes": "7",
                    "time": "22/07/2022-12:55:56",
                    "content": "Thank you all for your feedback here, and I think certainly valid questions were raised.  One thing to note is that the end recipients of these rewards will all be public liquidity providers who either provide in accordance with the strategies provided by xToken or Gamma or in accordance with their own strategies via the Uni v3 Staker contract. To address @Juanbug 's issue of size, it’s important to note that these rewards are split amongst 3 projects.  None of these rewards will be used to fund any sort of protocol development, pay salaries, or anything else.  For Gamma, all 300K will go into a MasterChef contract which will all get distributed to LPs.  For xToken, they will use their own staking contract to distribute all 300K of OP rewards to public LPs.  The remaining 300k OP tokens will again go strictly to public LPs who provide in accordance with their own ranges. So to address the issue of size, on a per project basis, this request here is quite low. With regards to whether this is too much incentives for one pool, I do agree with @cryptokitty that incentives for Uniswap v3 liquidity has much higher returns per cost of incentive due to the capital efficiency of the AMM.  $1 of incentives towards Uniswap v3 liquidity will lower price impact more than $1 of incentives going towards a constant product AMM, so if the theory is that more incentives go to where they will be put to the highest and best use, I think allocating more rewards over a longer timeframe to an OP Uniswap pool would be the right move in increasing the liquidity for OP, which will result in a wider distribution for governance and further decentralization. Speaking on behalf of Gamma, we have sourced all of our TVL organically without any incentives provided by us thus far mainly due to our strategies.  In terms of our strategies, we utilize automated rebalancing strategies as well as machine learning algorithms on certain pairs to mitigate against impermanent loss and optimize fee revenues. This occurs by setting rebalance triggers that automatically rebalance the price ranges in a new range when certain price targets are hit. Additionally, much of the liquidity that we manage currently is B2B liquidity via our partnerships with key players in the DeFi ecosystem. Our recently passed proposal with Frax Finance and Convex Finance will bring to Optimism, FPI/FRAX liquidity, which will be incentivized with FXS rewards. So we do believe we can bring significant value and TVL to Optimism without any further incentives.  The passed Frax proposal will be the first Frax gauge on Optimism, which is likely to bring in considerable TVL to Optimism as well that doesn’t involve any OP incentives. ",
                    "links": [
                        "https://gammastrategies.medium.com/gamma-partners-with-frax-finance-and-convex-finance-to-manage-the-fpi-frax-uniswap-v3-pool-on-10f1be57d37f"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.057343391902216
                },
                {
                    "author_link": "https://gov.optimism.io/u/katie",
                    "index": "50",
                    "likes": "5",
                    "time": "22/07/2022-21:27:10",
                    "content": "Voted yes - This is a great way to drive ecosystem growth which is the purpose of the governance fund.  Thank you for a well thought out proposal! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/polynya",
                    "index": "51",
                    "likes": "6",
                    "time": "23/07/2022-03:36:50",
                    "content": "This was a difficult one, but ultimately what made me lean towards For is the focus on the ETH/OP pool. Separate thought - if the projects can’t match co-incentives, for whatever reason, then perhaps they should ask lower amounts of OP they can match to begin with. If they succeed, there can be a future proposal expanding. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.166666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/linda",
                    "index": "52",
                    "likes": "4",
                    "time": "25/07/2022-21:07:42",
                    "content": "I’m voting yes on this proposal. Initially I felt the amount requested was very high but it is a lot more reasonable across 3 different service providers. I like that rewards are going to LPs for the WETH<>OP 0.3% pool and 100% paid out on Optimism. I also like that tokens are distributed over a longer period of time and that the team(s) incorporated feedback well from the community. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.9079999999999995
                },
                {
                    "author_link": "https://gov.optimism.io/u/Bobbay_StableLab",
                    "index": "53",
                    "likes": "3",
                    "time": "25/07/2022-21:49:06",
                    "content": "Vote: Yes We will support this. Since it is being split across 3 different projects, it is essentially 300k each. Not too hard to digest. Since they focus mainly on OP pools, it’s a win for optimism. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.675
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "54",
                    "likes": "3",
                    "time": "26/07/2022-15:49:59",
                    "content": "This is a difficult one for me. I read the entire thread and I can see both pros and cons. But ultimately I am leaning towards a NO. PROS  Really cool to see 3 different teams coming together to make a proposal that would push the OP ecosystem 100% Focus on OP pair liquidity  CONS  low liquidity 900k $OP tokens is too big an ask no co-incentives  For suggestions for the future if this does not pass (though it seems it will), I will simply echo @OPUser  as I agree with them.     OPUser:  From our conversation, team want to jump start project launch on OP chain I would love to support with this suggestion:-  Match the co-incentives in $ value Wait until you have enough liquidity to support your proposal    ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.159090909090908
                },
                {
                    "author_link": "https://gov.optimism.io/u/ceresstation",
                    "index": "55",
                    "likes": "3",
                    "time": "26/07/2022-17:05:44",
                    "content": "I’m going to very reluctantly vote yes, I tend to agree with @lefterisjp that the amount is too high, but @linda has some good points about the reward structure and length of distribution. Perhaps most importantly, as noted, feedback was taken into consideration which is always important to see. Still, I think we should be very careful about setting precedent around such large amounts for initial grants moving forward. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.222142857142857
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "56",
                    "likes": "2",
                    "time": "26/07/2022-17:29:29",
                    "content": "I’ve said my piece about this particular proposal though am continuing to want to hear more about the breakdown of these projects’ TVLs and previous funding to date. If it passes, I’m sure liquidity on that pool will increase, which is a good thing. As a general matter I’d like to point out that increasing the token ask along with the duration of the distribution does not make a proposal better – it increases the stakes of the grant and decreases the ability for governance to lend ongoing oversight and course-correct if necessary. This was the original issue I had with this proposal (I had no major objection before, to be clear), and I’d like to encourage delegates to look past the high-level features in making their final determinations. For instance, I commend Byte Masons for lowering their ask along with decreasing the duration. This allows for more thoughtful review and staging of distributions. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.114583333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/BP_Gamma",
                    "index": "57",
                    "likes": "3",
                    "time": "26/07/2022-17:40:44",
                    "content": "Thanks for your feedback Jack!  I really appreciate the ongoing constructive criticism here.  However, I do think it is worth mentioning that risk assessment was a key factor in structuring the proposal the way that we did. We had originally intended on each service provider creating their own separate proposals.  However, we realized that having multiple sources of liquidity was important without any single point of failure.  So we wanted to avoid the outcome where it was just one provider distributing all the rewards according to their own strategy.  I think having two managers and the community via the Uni v3 Staker adds to decentralization and security of the OP liquidity, while also ensuring good active management around the current price. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.036989795918367
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "58",
                    "likes": "0",
                    "time": "26/07/2022-17:55:21",
                    "content": "Proposing a means of splitting up the management of the distribution is fantastic and, frankly, something I’d love to see more of from other proposals. But then give the community the opportunity to review and propose adjustments over time rather than asking for more money and more time without oversight. I’d still love to hear more about funding to date of these protocols and how much organic TVL is coming from venture investors. This would have gone a long way toward enabling the community to do its own risk assessment. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.829545454545455
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "59",
                    "likes": "3",
                    "time": "26/07/2022-18:02:28",
                    "content": "In the future, for instance, I’d love to see how much money xToken raised from these investors, when this fundraising occurred  and how much of xToken’s TVL is coming from them. This would enable us to know how sticky new TVL is likely to be. Similarly, Gamma Strategies have gotten some remarkably high-profile investors, some of whom have a high likelihood of adding value through beefing up TVL metrics. Would love some more information on this.  OP distributions are for the funding of public goods; for some people these refer to benefits that otherwise go unfunded by the private sector. Again, this is not a knock on the current proposal, but I think all those voters who held their nose at the size of the ask - @polynya , @linda , @ceresstation - ought to take these issues into account going forward. I’ll be recommending for Season 2 that protocols be asked to disclose up front their funding and liquidity sources. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.052272727272728
                },
                {
                    "author_link": "https://gov.optimism.io/u/BP_Gamma",
                    "index": "60",
                    "likes": "3",
                    "time": "26/07/2022-18:31:39",
                    "content": "Hi Jack, To my knowledge, our investors have not been contributing to our TVL.  If they have, it’s not coming from any of their official ENS accounts or wallet addresses, and it would have been without our knowledge.  However, I don’t think that’s a likely scenario. More than half of our TVL to date have been sourced via partnerships with DAOs and protocols that we manage liquidity on behalf of.  These include Liquity, Ribbon Finance, Index Coop, Friends with Benefits DAO, etc.  We have made countless announcements on our Twitter page. The other portion has come from public LPs, mostly on Ethereum Mainnet and Polygon thus far; however, we are focused in growing Optimism at the moment, both from a partnership standpoint and public LP standpoint. The TVL that has been incentivized on our end came from partnering protocols such as H2OData.  But that makes up a minor portion of our overall TVL, and we do plan to keep partnering with protocols on Optimism that will incentivize pairs on Optimism.  This should work in favor of the Optimism ecosystem as liquidity incentives not from $OP are driving liquidity to Optimism. Hope that answers your questions. Thanks! Brian ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.387820512820513
                },
                {
                    "author_link": "https://gov.optimism.io/u/linda",
                    "index": "61",
                    "likes": "6",
                    "time": "26/07/2022-18:31:40",
                    "content": "To clarify, this governance fund is not for funding public goods, it is for growing the Optimism ecosystem. @vonnie610 clarified in Discord: \"The governance fund is actually NOT FOR FUNDING PUBLIC GOODS. It is for growing the ecosystem. The Citizen house (which is not live yet) is for public goods funding. The token house is for fostering and growing the ecosystem.\" ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving clarification on proposal"
                    ],
                    "Sentiment": 4.931818181818182
                },
                {
                    "author_link": "https://gov.optimism.io/u/HuntTheFarmers",
                    "index": "62",
                    "likes": "0",
                    "time": "26/07/2022-18:31:45",
                    "content": "    jackanorak:  I’ll be recommending for Season 2 that protocols be asked to disclose up front their funding and liquidity sources.   Why wait? Ask now before we find out about another “Perp” cash grab. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "63",
                    "likes": "0",
                    "time": "26/07/2022-18:33:26",
                    "content": "it absolutely does - thank you! i’d like to see more of this kind of breakdown from protocols going forward ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "64",
                    "likes": "1",
                    "time": "26/07/2022-18:37:24",
                    "content": "I appreciate the clarification and would like to rephrase. We are currently in a bootstrapping stage, and the priority is growth rather than aid – which certainly doesn’t put privately funded protocols out of scope. That doesn’t mean we don’t consider opportunity costs when considering well-resourced projects; we want to make sure OP goes toward proposals that offer outsized growth potential, and my belief is that, all else equal, less funded projects with traction have more to offer from active support, whereas better funded projects have a higher bar to demonstrate additional growth potential from even more funding. That we’re still in growth mode lends all the more reason to ensure that the protocols seeking resourcing have demonstrated some clear ability to add value and grow the ecosystem, particularly if we are offering large sums with little followup. If they haven’t shown traction, even with a lot of funding (which is a reason people cited in voting down Dope Wars), that weakens confidence in their growth potential. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.592781557067271
                },
                {
                    "author_link": "https://gov.optimism.io/u/ScaleWeb3",
                    "index": "65",
                    "likes": "2",
                    "time": "26/07/2022-22:42:34",
                    "content": "Voting Yes as the proposal adds quality projects, professional & passive users to Optimism. Value-add: Good Amount: Okay Op distribution: Okay Co-incentives: None It’s great to see projects collaborate on Optimism ecosystem building proposals. Co-incentives are a nice-to-have but not a must-have in our opinion. If smaller projects add real value, cannot match incentives but distribute the Op funds in a meaningful way (not only internal development, own token liquidity, but for Optimism growth), this is a better use of Op funds than throwing match funding at large projects with their undifferentiated, short-term LM campaigns. That said, we haven’t seen a top top Uni v3 liquidity management protocol and we would rather/also like to see funding for multiple cycles of 4-6 weeks to try different liquidity mining incentives (see early Balancer liquidity experiments); potentially even liquidity mining competitions and accompanying analytics of best user behavior - instead of 1, 2 bulk liquidity mining campaigns. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None"
                    ],
                    "Sentiment": 6.678571428571429
                },
                {
                    "author_link": "https://gov.optimism.io/u/quix",
                    "index": "66",
                    "likes": "2",
                    "time": "27/07/2022-00:32:02",
                    "content": "We voted yes on this proposal. With the total amount being distributed across three providers, we believe that this proposal offers a good range of incentives for increased usage and liquidity on OP. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.333333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/polynya",
                    "index": "67",
                    "likes": "3",
                    "time": "27/07/2022-03:28:55",
                    "content": "This is good feedback and information I generally look for, but ultimately where else they have raised funding for doesn’t really matter - the goal of Gov Fund is to incentivize usage on Optimism. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.1875
                },
                {
                    "author_link": "https://gov.optimism.io/u/SEED_LATAM_Joxes",
                    "index": "68",
                    "likes": "3",
                    "time": "30/07/2022-21:33:08",
                    "content": "[Final] Voting: No In consultation with our community, this proposal the requested amount looks too much.  Contribution: Positive  OP distribution: Neutral  Co-incentives: No  Impact in LATAM: Neutral   Suggestions: proposals seem reasonable if the amount were reduced by 50% for example, although always willing to see other forms of distribution or a greater diversity of proposed pools, focused on the ecosystem. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.89448051948052
                },
                {
                    "author_link": "https://gov.optimism.io/u/lvlojei",
                    "index": "69",
                    "likes": "0",
                    "time": "03/08/2022-06:50:02",
                    "content": "I support this proposal  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/krzkaczor",
                    "index": "70",
                    "likes": "1",
                    "time": "03/08/2022-16:56:22",
                    "content": "Yes. Even though amount is high, it will be distributed to 3 different protocols. Liquidity is important for OP token. Project quality: Mid - 10M in joint TVL Team quality: Mid Amount requested: Mid - 300k per project for 6 months OP distribution: Reasonable - It’s gonna be farmed to the ground but liqudity for OP token is important so I think it’s acceptable. Furthermore, the LM program benefits Uniswap LPs not xToken or Gamma users, so again, I think it’s fine. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.875925925925927
                },
                {
                    "author_link": "https://gov.optimism.io/u/vonnie610",
                    "index": "71",
                    "likes": "1",
                    "time": "04/08/2022-12:47:18",
                    "content": "Snapshot vote - passed ",
                    "links": [
                        "https://gov.optimism.io/t/draft-proposal-protocol-delegation-program/3946/20"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "72",
                    "likes": "1",
                    "time": "04/08/2022-17:09:57",
                    "content": "@ben_xtoken can you provide a Telegram handle or other contact method so the Optimism team can get in touch about paying out this grant! Feel free to comment on this thread, DM, or email justine@optimism.io ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.609375
                },
                {
                    "author_link": "https://gov.optimism.io/u/ben_xtoken",
                    "index": "73",
                    "likes": "0",
                    "time": "04/08/2022-17:55:22",
                    "content": "Hey @lavande, please contact me on TG at Telegram: Contact @Ben_xToken. Thanks! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                }
            ]
        }
    ],
    "group_index": "164"
}