{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/gf-phase-1-proposal-optimism-nigeria/5366",
            "title": "[GF: Phase 1 Proposal] Optimism Nigeria ",
            "index": 5366,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Grants Council"
            ],
            "tags": [
                "growth",
                "cycle-11"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/supercoolkay",
                    "index": "1",
                    "likes": "1",
                    "time": "28/02/2023-17:14:52",
                    "content": "Project name: Optimism Nigeria Optimism Nigeria Pitch deck  Author name and contact info (please provide a reliable point of contact for the project): Abdulkareem Oyeneye Email: kerimoyeneye@gmail.com I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: Yes I understand that I will be expected to following the public grant reporting requirements outlined here: Yes L2 recipient address: 0x4706CB289d673daFD7533E8dBe32C416B6f4a229 Which Voting Cycle are you applying for?: Cycle 11 Which sub-committee should review your proposal? (Builders Grants, Growth Experiment Grants): Growth Experiment Grants Project description (please explain how your project works): Optimism Nigeria is a regional hub in Nigeria. Its mission is to achieve Optimism chain goals in Nigeria and give a wide reach to Optimism network in Nigeria.2% of 115,000 developers in Nigeria build with blockchain infrastructure and less than 1% blockchain innovation is used for public good in Africa. Problems faced by optimism in Nigeria includes:1.Low visibility for Optimism blockchain infrastructure in Nigeria2.No public good project built with Optimism chain in Nigeria.3. Misconception and lack of blockchain education.4. No support for blockchain builders and developers in Nigeria.Optimism Nigeria aims to provide solution to the problems listed above through the following:1. Support public good project initiatives in Nigeria.2. Regular blockchain training and education 3.Support builder and developers in Nigeria4. Integrate & bridge web 2 businesses in Nigeria to web 35.Database & Contact of developers Website: NA Twitter: Near x Art (@NearxArt) / Twitter Discord/Discourse/Community: na Other relevant links (including any demos): (Optimism .pdf - Google Drive) Additional team member info (please link): Team consists of project lead, marketing officer, developer lead, project advisors and commu nity manager. Please link to any previous projects the team has meaningfully contributed to: Organized an NFT Event with Near: [Report] Paint & Chill With Near - Creatives DAO - NEAR ForumBirthed a public good project ( Ghetto photography ) that supports local communities and photographers: How to be young and free - Art - YouTube Facilitated On chain transaction on Near protocol: https://app.astrodao.com/dao/nearxart.sputnik-dao.nearFounded Near x Art Dao: https://twitter.com/NearxArt Relevant usage metrics (TVL, transactions, volume, unique addresses, etc. Optimism metrics preferred; please link to public sources such as Dune Analytics, etc.): Support public good project in Nigeria and educate developers on blockchain infrastructure, Competitors, peers, or similar projects (please link): https://www.bing.com/ck/a?!&&p=dfc1b1f62d4f2e02JmltdHM9MTY3NTkwMDgwMCZpZ3VpZD0wNWEyYmVlMC1lNzlhLTYzNjUtMGUyOC1hYzgwZTY4NzYyZDEmaW5zaWQ9NTIxNA&ptn=3&hsh=3&fclid=05a2bee0-e79a-6365-0e28-ac80e68762d1&psq=binance+africa&u=a1aHR0cHM6Ly90d2l0dGVyLmNvbS9CaW5hbmNlQWZyaWNh&ntb=1 Is/will this project be open sourced?: In the Future Optimism native?: No Date of deployment/expected deployment on Optimism: 3/20/2023 What is the problem statement this proposal hopes to solve for the Optimism ecosystem?: 2% of 115,000 developers in Nigeria build with blockchain infrastructure and less than 1% blockchain innovation is used for public good in Africa. Problems faced by optimism in Nigeria includes:1.Low visibility for Optimism blockchain infrastructure in Nigeria2.No public good project built with Optimism chain in Nigeria.3. Misconception and lack of blockchain education.4. No support for blockchain builders and developers in Nigeria. How does your proposal offer a value proposition solving the above problem?: 1.Integrate web 2 business in Nigeria to web 32. Support public good project in Nigeria3. Blockchain education and training 4. Support & train builders and developers in Nigeria5. Database and contact of developers. Why will this solution be a source of growth for the Optimism ecosystem?: This solution will increase the reach of Optimism network to Nigeria; the largest asdopter of cryptocurrency in the world. Has your project previously applied for an OP grant?: NO Number of OP tokens requested: 9,000 Did the project apply for or receive OP tokens through the Foundation Partner Fund?: No If OP tokens were requested from the Foundation Partner Fund, what was the amount?: na How much will your project match in co-incentives? (not required but recommended, when applicable): NA How will the OP tokens be distributed? (please include % allocated to different initiatives such as user rewards/marketing/liquidity mining. Please also include a justification as to why each of these initiatives align with the problem statement this proposal is solving.): Token will be distributed according to deliverables and milestones.   3 Events & Hackathon in Nigeria - 6,000 OP   10 video contents and 20 published articles in various Nigerian local languages - 2,000 OP   Weekly AMA and podcast about latest OP news - 1,000   Kindly note that the no-sale rule will be strictly adhered to. OP token will be distributed after completion of each milestones. Why will incentivized users and liquidity on Optimism remain after incentives dry up?: Optimism Nigeria will continue to operate as a regional hub with and without incentives. Please provide any additional information that will facilitate accountability (smart contracts addresses relevant to the proposal, relevant organizational wallet addresses, etc.): 0x4706CB289d673daFD7533E8dBe32C416B6f4a229 Confirm you have read and agree to the Eligibility Restrictions (here): I have read the Eligibility Restrictions and agree to abide by their conditions ",
                    "links": [
                        "https://gov.optimism.io/t/suggested-public-reporting-requirements-for-grantees/4176",
                        "https://twitter.com/NearxArt",
                        "https://drive.google.com/file/d/1YgzVtZPiKXjl95-71ZGPeRXDduDvBizI/view?usp=drivesdk",
                        "https://gov.near.org/t/report-paint-chill-with-near/32558?u=supercoolkay",
                        "https://youtu.be/BR_o7Qsaj2M",
                        "https://app.astrodao.com/dao/nearxart.sputnik-dao.near",
                        "https://twitter.com/NearxArt",
                        "https://www.bing.com/ck/a?!&&p=dfc1b1f62d4f2e02JmltdHM9MTY3NTkwMDgwMCZpZ3VpZD0wNWEyYmVlMC1lNzlhLTYzNjUtMGUyOC1hYzgwZTY4NzYyZDEmaW5zaWQ9NTIxNA&ptn=3&hsh=3&fclid=05a2bee0-e79a-6365-0e28-ac80e68762d1&psq=binance+africa&u=a1aHR0cHM6Ly90d2l0dGVyLmNvbS9CaW5hbmNlQWZyaWNh&ntb=1",
                        "https://gov.optimism.io/t/grant-proposal-template/3233"
                    ],
                    "GPT-summary": "The post is a proposal for Optimism Nigeria, a regional hub in Nigeria that aims to achieve Optimism chain goals in Nigeria and give a wide reach to Optimism network in Nigeria. The proposal explains the problems faced by Optimism in Nigeria and how Optimism Nigeria aims to provide solutions to these problems. The post also includes information about the team, previous projects, and usage metrics. The proposal requests 9,000 OP tokens and outlines how they will be distributed. The post may receive constructive criticism and questions from third parties, and the author is advertising the proposal.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Change to proposal pipeline",
                        "None",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal",
                        "None"
                    ],
                    "Sentiment": 5.615079365079366
                },
                {
                    "author_link": "https://gov.optimism.io/u/FractalVisions",
                    "index": "2",
                    "likes": "0",
                    "time": "09/03/2023-15:16:06",
                    "content": "    supercoolkay:  Website: NA Twitter: na Discord/Discourse/Community: na Other relevant links (including any demos): Additional team member info (please link): Team consists of project lead, marketing officer, developer lead, project advisors and commu nity manager.   Are there any links to the team or social media? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.513888888888889
                },
                {
                    "author_link": "https://gov.optimism.io/u/Michael",
                    "index": "3",
                    "likes": "2",
                    "time": "13/03/2023-18:34:46",
                    "content": "Thank you for submitting this grant application! Throughout the application process, this forum thread will be one of the official means of communication. Please be sure to monitor it for updates over the course of the review period. At this stage, applications are mainly being reviewed for completeness, and nothing at this stage should be construed as support or opposition by any members of the Grants Council. The current distribution plan of this grant falls afoul of the no-sale rule as described in this post:    Season 2 Grant Proposal Template 📌 Policies and Templates   Phase 1 Proposal Template v2 All Governance Fund grant proposals will be processed by a Grants Council in Season 3. Please submit your application to the Grants Council here following the process outlined here.   ALL CYCLE 11 GRANT PROPOSALS SHOULD USE THE UPDATED TEMPLATE HERE.   Key information about Governance Fund grants 5.4% of the total initial token supply (231,928,234 OP) will be distributed to Optimism projects and communities via the Governance Fund.  A portion of the Governance Fund …     Please read this post and, if desired, re-structure the grant in a way that follows those guidelines. It may also be worth noting that your grants appears to be more in-line with the “builders subcommittee” category. You can see more information about the builders category here and the growth experiments category here in order to decide which is best. Also, a general comment is that this grant appears to be doing A LOT of different activities. My advice would be to cut down the size of the grant and focus on one of the more specific aspects of it, such as running hackathons. Let me know if you have any questions, Michael ",
                    "links": [
                        "https://foul-porch-0eb.notion.site/Optimism-Grants-Council-090bb648d1854136b9630c608da7a8bc",
                        "https://foul-porch-0eb.notion.site/Grants-Council-Internal-Procedures-504521342ee0402980321c56f1488542",
                        "https://gov.optimism.io/t/grants-proposal-template-cycle-11/5291",
                        "https://foul-porch-0eb.notion.site/Builders-Sub-Committee-02ba9da5b4534fbf955e6e4c8fcf1aa3",
                        "https://foul-porch-0eb.notion.site/Growth-Experiments-Sub-Committee-270d2f75ff0f410a869b2ba6a8324006"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.988562091503268
                },
                {
                    "author_link": "https://gov.optimism.io/u/supercoolkay",
                    "index": "4",
                    "likes": "1",
                    "time": "15/03/2023-08:19:12",
                    "content": "    FractalVisions:  Are there any links to the team or social media?   Good day @FractalVisions . Apologies, below are some of the relevant links attributed to my tractions. Blockchain event hosted in Nigeria   [Report] Paint & Chill With Near - Creatives DAO - NEAR Forum - an NFT focused event to onboard web 2 artists ti web 3.   [REPORT] Web 3 delight event - Creatives - NEAR Forum - Represented Near protocol at a global web 3 conference in Lagos Nigeria.   On-chain transactions: *https://app.astrodao.com/dao/nearxart.sputnik-dao.near - facilitated over 500+ active users transacting with Near token in Nigeria. Social Media:   https://twitter.com/NearxArt - I founded a decentralized autonomy’s organization that focuses on onboarding creatives to web 3, pet & wildlife rescue and charitable contributions.   YouTube link   Stores in Marketplaces:   Near x art store  - for NFTs in its physical form.   Pet & Wildlife store - charitable contribution to endangered species via NFT sales.   Ghetto photography store : Charitable contributions to underdeveloped communities via the use of photo NFTs.   Personal Social: Supercoolkay on Twitter  Kindly let me know if you need any additional information, I am glad to always answer your questions. Thank you. ",
                    "links": [
                        "https://gov.near.org/t/report-web-3-delight-event/26966?u=supercoolkay",
                        "https://app.astrodao.com/dao/nearxart.sputnik-dao.near",
                        "https://twitter.com/NearxArt",
                        "https://youtu.be/fv6WA2uaCtY",
                        "https://www.mintbase.xyz/contract/nearxart.mintbase1.near/nfts/all/0",
                        "https://www.mintbase.xyz/contract/petandwildlife.mintbase1.near/nfts/all/0",
                        "https://www.mintbase.xyz/contract/ghettophotography.mintbase1.near/nfts/all/0",
                        "https://mobile.twitter.com/home"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.141666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/supercoolkay",
                    "index": "5",
                    "likes": "1",
                    "time": "15/03/2023-23:07:13",
                    "content": "Hello @Michael , thank you so much for your reply. I have adjusted the grant as you recommended. Total OP token requested for this cycle as been adjusted to 9,000. Optimism Nigeria will focus on 3 major (events, articles and video publications, weekly AMA and podcast) activities to build Optimism in Nigeira. Please kindly note that OP token will be distributed according to milestone and the No-sale rule will be strictly adhered to. I am available to answer any other questions you may have. Kindly share your calendarly so I may schedule a meeting with you. Thank you, Warm Regards. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.4609375
                }
            ]
        }
    ],
    "group_index": "546"
}