{
    "poll_list": [
        {
            "id": "0x58c408348473856bdd0f8fcdde26936a3f828a33bdb91d5a5e4286237c9ba397",
            "title": "DeFi Committee [Group A]",
            "discussion": "https://gov.optimism.io/t/s02-committee-proposal-decentralized-finance-governance-committee-group-a/3286",
            "body": "This Committee Formation Proposal is eligible for voting in Special Voting Cycle #5. This proposal falls under the DeFi category.\n\nUp to 4 Committees will be approved for Season 2, based on number of votes across all committee categories. To encourage a diversity of committee types, the Optimism Foundation recommends delegates vote \"yes\" for their top 1-2 committees per category.\n\nFor more info, please read Introducing Governance Committees: https://gov.optimism.io/t/introducing-governance-committees/3238/37",
            "choices": [
                "For",
                "Against",
                "Abstain"
            ],
            "scores": [
                9162108.635131964,
                127038.84403916186,
                5157486.110662223
            ],
            "start": 1661454486,
            "end": 1662577686,
            "snapshot": "20558560",
            "state": "closed",
            "author": "0x47C88bb92B409fF25F6587EA611fac4e55f76007",
            "space": {
                "id": "opcollective.eth",
                "name": "Optimism Collective"
            }
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/s02-committee-proposal-decentralized-finance-governance-committee-group-a/3286",
            "title": "S02 Committee Proposal: Decentralized Finance Governance Committee: Group A ",
            "index": 3286,
            "category": [
                "\\xf0\\x9f\\x8f\\x9b Governance",
                "Metagovernance"
            ],
            "tags": [
                "special-cycle-5"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/katie",
                    "index": "1",
                    "likes": "23",
                    "time": "12/08/2022-04:42:31",
                    "content": "Committee category: Decentralized Finance Committee In line with the recent introduction of governance committees, this committee will focus on each DeFi-related proposal, delivering a summary, basic due diligence, a voting recommendation, and justification to Optimism Token House delegates and the community. This will provide relief and full-time expertise to Optimism Token House delegates who would otherwise duplicate some portions of this work or have a specialized background elsewhere. We are a committee of five active delegates, both individuals and organizations, with a shared vision for growth, scalability, and long-term success for Optimism and its community. Our focus is on growing a key part of an ecosystem’s success; decentralized finance. Disclosures: This does not preclude Optimism Token House delegates from performing their own analysis or choosing to vote against the recommendation. This does not preclude other committees from evaluating the same proposal if that proposal falls within multiple committee mandates. Proposed number of committee members: Five Who will be the committee lead? Katie Garcia Katie has been involved in the DeFi space since 2018, having worked at the Maker Foundation until its dissolution in 2021. She currently works for UDHC Finance, and is still involved in the Maker Community and DeFi as a whole. Who will be the committee reviewers? GFX Labs Currently a delegate for Maker, OP, Hop, Uniswap, Interest Protocol, and (formerly) Compound, GFX has extensive experience in governance and the DeFi space. Flipside Crypto Flipside is a data analytics and business intelligence company, with a full-time dedicated Governance team. We partner with major Layer 1s and DeFi protocols to provide analytics, user acquisition, user retention, and marketing. The team currently runs delegations across DeFi protocols and L2 networks, including Maker, Optimism, Hop, Aave, ENS, and SushiSwap. StableNode StableNode is a governance research and product development company. Using research and hands-on experience we aim to advance standards in decentralized governance. StableNode is one of the leading professional delegates across major ecosystems and DeFi protocols, including Maker, Optimism, Balancer, Element Finance, Hop, and Jet Protocol. Linda Xie Linda is the co-founder of a crypto fund Scalar Capital which has invested in many DeFi projects, is a delegate for Gitcoin and Element DAO, is an advisor of 0x, member of the dYdX Grants committee and previously was an early employee at Coinbase from 2014-2017. Please provide the voting history, voting participation rate and % of votable supply held by each committee member: Katie - 100% voting participation, 3.36% supply GFX - 23.86% voting participation, 2.90% supply* Flipside - 53.85% voting participation, 0.76% supply* StableNode - 100% voting participation, 0.28% supply Linda Xie - 97.37% voting participation, 10.10% supply *GFX utilizes Gnosis Safe, which was not compatible with Snapshot’s UI, resulting in missed votes until a solution was found. Vote recommendations and summaries were still provided on the Optimism forum. *This participation rate is unfortunately do to administrative error, missing cycle #2. Please see our rationale and intended votes here: Flipside Weekly Governance Recap - OP Cycle #2 Votes Please disclose any and all conflicts of interest committee members may have: If any delegate has a conflict of interest stated here or otherwise, they will recuse themselves from a committee vote on that proposal. If appropriate, they will also recuse themselves from discussion participation. Please outline the decision making framework the committee plans to use to make recommendations: This committee will provide basic due diligence research, a brief summary, and voting recommendation for each proposal formally submitted related to borrow/lend protocols, decentralized exchanges, yield aggregators, decentralized stablecoins, and any other Optimism proposal primarily related to decentralized finance. The DeFi Committee will consider the following metrics when making a recommendation:  Amount of OP requested Whether or not the project has launched on Optimism (and if OP native) Whether or not the proposal will drive ecosystem growth and is aligned with the purpose of the governance fund Incentive matching TVL, DAU, and total volume traded  Please describe how the committee will operate: The committee will decide its recommendation by a simple majority vote. A committee member will draft the summary, recommendation, and other communication, which will then be reviewed by the committee before publishing.  We will provide our reasons and recommendations for voting under a DeFi committee thread within the forum We will communicate our recommendation within 3 business days of a vote being initiated We will communicate any material findings from our due diligence research We will provide a summary of the proposal for OP voters and delegates  ",
                    "links": [
                        "https://gov.optimism.io/t/delegate-commitments/235/34",
                        "https://gov.optimism.io/t/delegate-commitments/235/69",
                        "https://gov.optimism.io/t/delegate-commitments/235/59",
                        "https://gov.optimism.io/t/delegate-commitments/235/37",
                        "https://boardroom.io/voter/0x75536CF4f01c2bFa528F5c74DdC1232Db3aF3Ee5?isDelegate=true",
                        "https://boardroom.io/voter/0xa6e8772af29b29B9202a073f8E36f447689BEef6?isDelegate=true",
                        "https://boardroom.io/voter/0x62a43123FE71f9764f26554b3F5017627996816a",
                        "https://boardroom.io/voter/0x1D1a13b16667c284b87de62CAEEfF0ce89E342B2",
                        "https://boardroom.io/voter/0x5e349eca2dc61aBCd9dD99Ce94d04136151a09Ee?isDelegate=true",
                        "https://gov.optimism.io/t/gfx-labs-delegate-communication-thread/2728",
                        "https://medium.com/flipside-governance/flipside-governance-recap-01-july-2022-4f42a8a550df",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/5",
                        "https://gov.optimism.io/t/stablenode-delegate-communication-thread/2973/9",
                        "https://gov.optimism.io/t/gfx-labs-delegate-communication-thread/2728/15",
                        "https://gov.optimism.io/t/grant-council-reviewer-nominations/4372/6",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/4",
                        "https://gov.optimism.io/t/grant-council-reviewer-nominations/4372/14",
                        "https://gov.optimism.io/t/draft-so2-committee-proposal-defi-group-c/3320/65",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/2"
                    ],
                    "GPT-summary": "The post is a proposal for the creation of a Decentralized Finance Governance Committee for Optimism Token House. The committee will provide due diligence, voting recommendations, and justification for DeFi-related proposals. The post includes information about the committee members, their voting history, and their decision-making framework. The post also discloses any conflicts of interest and outlines how the committee will operate. The proposal is explained in detail, and there is constructive criticism and auditing of the proposal.",
                    "GPT-proposal-categories": [
                        "Community and engagement",
                        "Grants, Funding and resource allocation",
                        "Board composition",
                        "Change to proposal pipeline",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.194078947368421
                },
                {
                    "author_link": "https://gov.optimism.io/u/fig",
                    "index": "2",
                    "likes": "6",
                    "time": "12/08/2022-14:34:37",
                    "content": "Excited to work with Katie and the team, luminaries in the OP ecosystem. We believe together we bring a unique range of experience and expertise to elevate Optimism to its next stage of maturity. Let’s get this rolling! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/ben-chain",
                    "index": "3",
                    "likes": "3",
                    "time": "15/08/2022-20:40:57",
                    "content": "Very cool to see a committee proposal up!  Can you add [DRAFT] S02 Committee Proposal:  to the title?  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.84375
                },
                {
                    "author_link": "https://gov.optimism.io/u/taojin3",
                    "index": "4",
                    "likes": "1",
                    "time": "17/08/2022-02:41:38",
                    "content": "nice but some question ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/rasmuky",
                    "index": "5",
                    "likes": "2",
                    "time": "17/08/2022-05:11:57",
                    "content": "This makes a lot of sense and is good to see. Great to amplify sector knowledge! One tactical question that wasn’t clear based on my read of the proposal…once a majority vote is cast by the DeFi Gov Committee for a proposal, are all delegates on the committee then required to vote their delegate $OP based on that majority vote (even if they may have a dissenting opinion)? Also, I could see value in requiring / asking the committee to put forth a case for and case against framework to be balanced. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/dai",
                    "index": "6",
                    "likes": "1",
                    "time": "17/08/2022-10:40:42",
                    "content": "Agree   Agree, very good proposal ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.549999999999999
                },
                {
                    "author_link": "https://gov.optimism.io/u/raho",
                    "index": "7",
                    "likes": "5",
                    "time": "17/08/2022-16:55:35",
                    "content": "    rasmuky:  One tactical question that wasn’t clear based on my read of the proposal…once a majority vote is cast by the DeFi Gov Committee for a proposal, are all delegates on the committee then required to vote their delegate $OP based on that majority vote (even if they may have a dissenting opinion)?   This brings up a very interesting point. In my opinion, all of the delegates in this committee are awesome, and would be very well suited to lead their own committees! However, I also think it is important for the community to discuss the overall voting power that would be acting in this committee, and the potential impacts as a result. If all votes are pooled and voting in line with the committee’s recommendation, the ability for delegates to act independently would be blocked. Alternatively, if delegates are voting independently and against the committee’s recommendation, the recommendations could potentially lose credibility in the eyes of some community members. In the latter case, are committees effective if the members in which they are comprised are voting against the committee’s decision? If the idea is to pay delegates for their work, perhaps the community should just do that without forming committees and pooling votes. By compensating delegates, the diligence and recommendations could still be published on an independent basis while also retaining voter diversity. Additionally, to assist with information overload (assuming this continues to exist with fair compensation), there could be delegates committed to focusing on different core areas of governance (i.e. DeFi), as opposed to the full spectrum. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.319444444444445
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "8",
                    "likes": "3",
                    "time": "17/08/2022-19:31:42",
                    "content": "    rasmuky:  are all delegates on the committee then required to vote their delegate $OP based on that majority vote (even if they may have a dissenting opinion)?   Its not mandatory but recommended to go with committee decision. They are expected to follow the recommendation of committees, except in extreme circumstances ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.4375
                },
                {
                    "author_link": "https://gov.optimism.io/u/katie",
                    "index": "9",
                    "likes": "0",
                    "time": "18/08/2022-01:19:18",
                    "content": "Happy to answer any questions you have. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/katie",
                    "index": "10",
                    "likes": "3",
                    "time": "18/08/2022-01:27:08",
                    "content": "Hi Raho, thanks for the question.  Our understanding is that a committee will make a recommendation, but it is ultimately up to each delegate to vote individually how they see fit.  If any delegate votes against a committee recommendation, they would be expected to provide a clear explanation as to their reasoning.  However, a committee recommendation is simply a suggestion and delegates can vote freely.  See below for additional information provided by the Foundation.  Delegates not serving on committees will still be responsible for signing all their own votes. If delegates vote against the recommendation of the committee, they will be expected to post their reasoning in the forum roundup thread. To address concerns about a drop-off in non-committee delegate participation, the Optimism Foundation will track this data and re-evaluate the structure of committees if we see a meaningful decrease.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.916666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/rasmuky",
                    "index": "11",
                    "likes": "2",
                    "time": "18/08/2022-02:56:01",
                    "content": "Thanks for the link, I hadn’t seen that thread. I think the concept that a dissenting committee member must explain their justification is generally a good feature. However, I do think it might be more transparent and easier on the committee members and delegates if the committee recommendation comes with (i) case for, (ii) case against, (iii) committee majority recommendation, and (iv) disclosure of committee members that vote contrary to the majority. If cases for and against are both presented and dissenting committee members disclose their dissent, I don’t personally think that a separate rundown or explanation of that delegates specific reasons for dissent need to be called out as justifications should be adequately represented in the case for and case against framework. It’s nuanced, but to me that still feels like a more united committee communication vs a dissenting voter being required to break from the group and write a separate thread. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.595238095238095
                },
                {
                    "author_link": "https://gov.optimism.io/u/L2Maxi",
                    "index": "12",
                    "likes": "3",
                    "time": "18/08/2022-20:40:39",
                    "content": "I came here in hopes of making my own committee but just found out i cant. so i am here to provide feedback. you guys have a great team set up here with good relevant backgrounds. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal"
                    ],
                    "Sentiment": 8.125
                },
                {
                    "author_link": "https://gov.optimism.io/u/sezar",
                    "index": "13",
                    "likes": "1",
                    "time": "23/08/2022-18:34:11",
                    "content": "i think nice for all time ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/hank",
                    "index": "14",
                    "likes": "0",
                    "time": "23/08/2022-18:51:12",
                    "content": "Check out my tread about the subject.     Proposal for a governance structure Governance Fund: Phase 1       The forum of Optimism need to be the backbone of our governance. The forum will be a place to share proposals, bounce ideas, rank proposals and promote engaged members to suiting roles.  Different roles that are needed are a treasury, voters and proposal promoters.  The goal should be too automate as many tasks as possible to make pay for work efficient.  What do we want? We want to grow OP as much as possible with the least possible resistance. That’s why we should create different groups and t…     ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.574074074074074
                },
                {
                    "author_link": "https://gov.optimism.io/u/hank",
                    "index": "15",
                    "likes": "0",
                    "time": "23/08/2022-18:56:17",
                    "content": "It would be cool if the committee can state plus and minuses, yin and yang about proposals without actually giving a direct recommendation. Let the delegates make their own perceptive with help of the committee’s in depth analysis. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.3125
                },
                {
                    "author_link": "https://gov.optimism.io/u/arabianhorses",
                    "index": "16",
                    "likes": "1",
                    "time": "31/08/2022-08:39:06",
                    "content": "Other DeFi committees are also good but I must choose the best one for the OP ecosystem so I will give a for to this committee, I know Katie Garci and Linda Xie well, read about others they also seen as qualified. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 7.625
                },
                {
                    "author_link": "https://gov.optimism.io/u/katie",
                    "index": "17",
                    "likes": "0",
                    "time": "01/09/2022-00:18:20",
                    "content": "Abstaining from this vote since this is my proposal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/jrocki.eth",
                    "index": "18",
                    "likes": "5",
                    "time": "02/09/2022-02:47:06",
                    "content": "Voted yes In my opinion, this is the Defi committee with the most relevant and wide ranging experience. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.333333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "19",
                    "likes": "2",
                    "time": "03/09/2022-12:01:15",
                    "content": "Abstained as I have a defi committee proposal of my own. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/linda",
                    "index": "20",
                    "likes": "2",
                    "time": "04/09/2022-04:38:50",
                    "content": "Abstained from this vote since I’m part of the committee proposal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Bobbay_StableLab",
                    "index": "21",
                    "likes": "0",
                    "time": "05/09/2022-03:23:02",
                    "content": "Vote: Abstain We are involved in this committee. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "22",
                    "likes": "0",
                    "time": "06/09/2022-21:59:13",
                    "content": "Note really sure how I should vote here. I am favoring abstaining at the moment as I already voted for another DeFi proposal (C). I don’t have anything against this proposal, and the members also seem capable but I guess I should only vote for 1 out of the 3 DeFi committees unless I misunderstood the process. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.166666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/fig",
                    "index": "23",
                    "likes": "1",
                    "time": "06/09/2022-23:21:48",
                    "content": "Hey @lefterisjp - thanks for your transparency. We have been grateful for your contribution to OP thus far and would love to continue a similar commitment via this committee. While I understand it may feel contradictory, the amendment to now include four total committees (vs. previously three), makes voting on multiple teams within different categories welcomed. We have seen this with other large delegates (Olimpio, Polynya, etc.) Hope this helps! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.3880952380952385
                },
                {
                    "author_link": "https://gov.optimism.io/u/Bobbay_StableLab",
                    "index": "24",
                    "likes": "0",
                    "time": "07/09/2022-02:44:33",
                    "content": "Echoing what Fig said, from our understanding, it is acceptable to vote for 2 of the 3 DeFi committees if you wish. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Axel_T",
                    "index": "25",
                    "likes": "0",
                    "time": "07/09/2022-03:02:28",
                    "content": "Voted ‘For’.  Committee is very active in the forum, voting, and organising the collective. Their combined voting power is high, and their career experience is very relevant & senior, and thus they should be having a say in these committees.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.844444444444444
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "26",
                    "likes": "0",
                    "time": "07/09/2022-06:57:19",
                    "content": "Okay then I will vote for 1 more other than C. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.458333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/SEED_LATAM_Joxes",
                    "index": "27",
                    "likes": "0",
                    "time": "07/09/2022-13:33:53",
                    "content": "Voting: for. Our entire rational is posted here. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/forrest",
                    "index": "28",
                    "likes": "1",
                    "time": "07/09/2022-15:38:20",
                    "content": "I voted FOR this committee. Very active voices and clear leaders in OP governance. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.816666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "29",
                    "likes": "0",
                    "time": "12/09/2022-19:03:15",
                    "content": "snapshot vote - passed ",
                    "links": [
                        "https://gov.optimism.io/t/governance-update-4/3435"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "30",
                    "likes": "0",
                    "time": "13/09/2022-19:59:04",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "204"
}