{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/draft-gf-phase-1-proposal-makerdao/4078",
            "title": "[DRAFT][GF: Phase 1 Proposal] MakerDAO ",
            "index": 4078,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Grants Council"
            ],
            "tags": [
                "season-3",
                "cycle-10",
                "not-passed"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/Facundo",
                    "index": "1",
                    "likes": "9",
                    "time": "25/11/2022-15:38:02",
                    "content": "This is a resubmission under the new proposal format. Since the launch of MCD in Optimism is not likely to happen at least until next year, we’re re-submitting this proposal, but changing some of the parameters and distribution conditions. Project name: MakerDAO Author name and contact info: @Facundo - Head of Research - Discord: Profesor Utonio#6658 @Jensenhaji - Business Development - Discord: Jenn#6356 I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: Yes L2 recipient address: msig TBA Which Voting Cycle are you applying for?: Season 3 Grant category: DeFi Is this proposal applicable to a specific committee?: DeFi Committee Project description: MakerDAO is a decentralized autonomous organization that enables the functionality of the Maker Protocol, a permissionless credit facility. Through the Maker Protocol, any user can use its crypto holdings as collateral to generate Dai loan against it. The decentralized governance community of MakerDAO manages the generation of Dai through an embedded governance mechanism within the Maker Protocol. Project links:  Website: makerdao.com  Twitter: @makerdao  Discord/Discourse/Community: MakerDAO discord - Maker Growth discord  Please include all other relevant links below: Maker Growth twitter   Additional team member info: twitter - Head of growth Nadia - Head of growth Mariano - Business Development Jenn - Researcher Facundo Please link to any previous projects the team has meaningfully contributed to: No applicable  Relevant usage metrics (TVL, transactions, volume, unique addresses, etc. Optimism metrics preferred; please link to public sources such as Dune Analytics, etc.): You can see an overview of MakerDAO’s metrics at @SebVentures’s Dune here Highlights: Currently, Maker has +5 billion Dai in circulation with +$6.5 billion of total value locked as collateral across hundreds of thousands of loans. MakerDAO is #1 in TVL on Mainnet and DAI is the most used stablecoin in terms of on-chain velocity Since July 21’, Dai has been supported in the Optimism ecosystem through the Optimism official bridge. Dai is one of the most used stable-coins in Optimism with over ~$55M liquidity and it was the first stablecoin to reach 1M and 50M in TVL on Optimism. Dai is supported across almost all the dApps in the Optimism ecosystem. For example, users could lend Dai in Aave v3, swap in Uniswap/Curve and leverage LPs positions into Arrakis Finance, to mention some use-cases. USDC/DAI is the pair with the highest TVL across Uniswap. In Aave v3, Dai is the most lended stable-coin behind USDC with ~$12M. Competitors, peers, or similar projects: Synthetix Is/will this project be open sourced? Yes Optimism native?: No Expected deployment on Optimism: Q2 2023  Ecosystem Value Proposition:  What is the problem statement this proposal hopes to solve for the Optimism ecosystem? How does your proposal offer a value proposition solving the above problem? Why will this solution be a source of growth for the Optimism ecosystem?  This past month, Maker officially launched a fast-withdrawals and the ‘Maker Teleport’ (previously Wormhole) bridge for Dai to allow users to withdraw Dai near-instant and skip the 7 days lockup rollup period. The Maker protocol is uniquely positioned to provide a solution to the 7 days period problem while preserving trustlessness and decentralization. The fast-withdrawal bridge will allow locking up L1 DAI to mint L2 DAI as well as allowing L2 DAI to be burned in exchange for near-instant access to L1 DAI.  1600×793 216 KB  This will attract a constant flow of users and liquidity towards Optimism since users will have the possibility to constantly move Dai between L1 and L2 instantly. The average user will not want to wait a week to get their assets into L1. The Optimism Dai Bridge can serve as the go-to service for exiting L2 in a timely manner. As the Layer 2 ecosystem evolves and DAI liquidity grows within these domains, it will become important for users to be able to move DAI between them in a trustless manner. This initiative to Teleport Dai across Layer 2 ecosystems, starting with Optimism and Arbitrum, will become an integral feature of the fungibility of Layer 2 Dai. The Optimism and MakerDAO communities have the same goal: to scale Ethereum. This is a game changer not only for Maker, but the Ethereum ecosystem at large as we can finally offer a fast, trustless, decentralized off-ramp for optimistic rollups. Moving forwards, the launch of MCD in Optimism is targeted to be released on Q2 2023. Has your project previously applied for an OP grant? No. Number of OP tokens requested: 1.5M Did the project apply for or receive OP tokens through the Foundation Partner Fund?: No How much will your project match in co-incentives?: No applicable Proposal for token distribution:  How will the OP tokens be distributed? Over what period of time will the tokens be distributed for each initiative? Shorter timelines are preferable to longer timelines. Shorter timelines (on the order of weeks) allow teams to quickly demonstrate achievement of milestones, better facilitating additional grants via subsequent proposals. Please list the milestones/KPIs you expect to achieve for each initiative, considering how each relates to incentivizing sustainable usage and liquidity on Optimism. Please keep in mind that progress towards these milestones/KPIs should be trackable. Why will incentivized users and liquidity on Optimism remain after incentives dry up?  At Maker Growth we are thinking about ways to incentivize Dai usage on Optimism by rewarding real Optimism Dai users who were and continue to be legitimately involved in the Optimism ecosystem: may we present to you The Interstellar Dai Journey:  1600×810 155 KB  Inspired by the mechanism Optimism used with the OP token launch, we planned a schedule to reward users who got to perform certain tasks to receive OP incentives.“The Interstellar Dai Journey” will have a few ‘stages’ to fulfill and every stage that is completed will give the users more rewards and a potential boost on the reward (than the previous ones), in a given period of time. The conditions to receive the boost are based on the phases that users have completed in the past. This initial plan is structured by 6 months and it may or it may be not consecutive, but is open to modifications. Maker officially launched the Fast Withdrawal bridge for L2 → L1 whereby Optimism users are able to quickly and securely transfer Dai from Optimism to Mainnet avoiding the 7 days waiting period to have Dai in L1. Teleporting DAI from L2 → L1 is known as a “Fast Withdrawal”. To complete a fast withdrawal, DAI is burnt on L2, minted on L1, and sent to the user as soon as the L2 transaction is confirmed. Although the fast withdrawal bridge is currently deployed and live on Mainnet without any problem, it has no official UI for the final-user to interact with, something that we’re working on by activating a 10,000 DAI grant for any builder who wants to integrate the Maker Teleport with a functional user interface. So, for example in the scenario described above the rewards will be distributed in a few different stages:   Phase 1: Bridge at least $1000 Dai (to avoid sybil attacks) to Optimism and the user will receive some % OP incentives for 1 month (when the month has passed the rewards will end). No previous conditions needed.   Phase 2: Providing Dai liquidity on Velodrome* will give users another % OP incentives, for about 1 month. If users have completed the task on ‘Phase 1’ (bridged Dai through Maker Teleport) they’ll receive a boost on their rewards.   Phase 3: Open a DCA position with any DAI pair on Mean Finance*   *We’re trying to incentivize the usage of the whole OP ecosystem instead of just one dApp, because of such we’re prioritizing native Optimism dApps that have seen to attract a lot of liquidity or dApps that doesn’t have much usage but are offering an innovate product, such as Velodrome, Mean Finance or Sonne by giving them priority putting them at the front of the stages. We can add or remove some based on the comments received. And so on, covering the remaining phases in the table:  Phase 4: Provide Dai liquidity on Aave / Sonne Finance Phase 5: Provide liquidity to DAI/OP pair on Uniswap Phase 6: Provide liquidity on 3pool on Curve  In order to have greater transparency at following the objectives within the journey, we believe that breaking this grant into 2 tranches is the right thing to do. If the community agrees we will ask for 50% of the amount requested (750k OP) once it/if is approved, and the remaining 50% (750k OP) after the first 3 months to properly track the objectives following the Journey with a report made to Optimism governance prior to disbursement of the remaining tranche by showing metrics to measure the success or the objectives that remain to be reach. KPIs:  Increase Dai liquidity in Optimism by xx% over a period of 3 months Increase Dai usability and utility within trading and yield opportunities Increase the number of Dai holders by xx% Increase Optimism native dApp (Velodrome, Mean Finance…) usage through Dai liquidity flow  Additional Info: At a future date (likely 2023) Maker plans (with community approval) to launch MCD on Optimism natively. Maker Growth Core Unit can help propose OP as a supported collateral. Maker Growth will also help to co-promote dApps on Optimism that support DAI as a way to increase awareness about the Optimism ecosystem and use cases. These are just a few tasks and ideas that we think could bring value to the Optimism ecosystem, we can rethink and change them based on comments received. We are also thinking of distributing back a percentage (maybe ~50%) of gas spent on Dai usage, just to make Dai usage super cheap but not free, to avoid sybil attacks. By doing this, we will be giving users extra OP rewards based on the amount of gas spent on transactions in Optimism in a given period of time. So, for example a user who spent $200 on gas in Optimism will be receiving $100 valued in OP gas refund. This incentive will last approximately 6 months. Note that this is a completely separate reward mechanism and it has nothing to do with the ‘Dai Journey’ incentivization. ",
                    "links": [
                        "https://twitter.com/MakerDAO",
                        "https://discord.gg/N9UXsSxt",
                        "https://discord.gg/9dSaNkvN",
                        "https://twitter.com/MakerGrowth",
                        "https://twitter.com/nad8802",
                        "https://twitter.com/Mariandipietra",
                        "https://twitter.com/jensenhaji",
                        "https://twitter.com/utonianum",
                        "https://dune.com/SebVentures/maker---accounting_1",
                        "https://dune.com/queries/865988",
                        "https://synthetix.io/",
                        "https://forum.makerdao.com/t/introducing-maker-wormhole/11550",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/5/590890959d739ec655743f847f0d9c1cdbd83ad6.jpeg",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/c/c072c6a792ffdab4f67796b35580e4825e0e02b3.jpeg",
                        "https://twitter.com/MakerDAO/status/1592537340131430400?s=20&t=a11pry90vvvyN6WsZwp8bg"
                    ],
                    "GPT-summary": "The post is a proposal for MakerDAO, a decentralized autonomous organization that enables the functionality of the Maker Protocol, a permissionless credit facility. The proposal aims to provide a solution to the 7-day period problem while preserving trustlessness and decentralization. The proposal suggests the use of a fast-withdrawal bridge that will allow locking up L1 DAI to mint L2 DAI as well as allowing L2 DAI to be burned in exchange for near-instant access to L1 DAI. The post also includes a plan to incentivize Dai usage on Optimism and distribute back a percentage of gas spent on Dai usage.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Interoperability and Scaleability",
                        "Token economics",
                        "Community and engagement",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.357288348444009
                },
                {
                    "author_link": "https://gov.optimism.io/u/hait",
                    "index": "2",
                    "likes": "0",
                    "time": "27/11/2022-00:24:21",
                    "content": "I think it could be a good project partner for OP!  I’ll cheer you on! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/gunboats",
                    "index": "3",
                    "likes": "3",
                    "time": "28/11/2022-12:30:00",
                    "content": "I like how incentive is structured to use native dApps on Optimism, with that said, I don’t think incentivizing lending market like Aave is useful when in reality it will be farmed by looping and it will be gone as soon as incentive ended. In long term, the real value Maker can provide is to launch MCD on Optimism. Lot of people is priced out from borrowing from Maker on Mainnet and it is long overdue to start borrowing on L2. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/Mingyue",
                    "index": "4",
                    "likes": "0",
                    "time": "27/01/2023-06:59:59",
                    "content": "Very novel practice.By ‘Dai Journey’ incentivization,Maker will bring more users and usage to optimism! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0625
                },
                {
                    "author_link": "https://gov.optimism.io/u/mastermojo",
                    "index": "5",
                    "likes": "1",
                    "time": "31/01/2023-15:36:05",
                    "content": "  twitter.com    Optimism Grants (✨🔴_🔴✨) @OptimismGrants  Season 3 is in full swing and the Grants Council has begun accepting applications.   If you are building on Optimism or looking to build on Optimism, apply here to be considered for Cycle 10:  rb.gy/e0fthv  Applications are due by Feb 1 at 19:00 GMT   6:00 PM - 30 Jan 2023           56                23            If you guys haven’t yet, make sure you apply on the google form posted in the above tweet. ",
                    "links": [
                        "https://twitter.com/OptimismGrants/status/1620119698401808387?s=20&t=kVZTD0nb8i08RaEuxtAsrQ",
                        "https://twitter.com/OptimismGrants/status/1620119698401808387?s=20&t=kVZTD0nb8i08RaEuxtAsrQ",
                        "https://rb.gy/e0fthv",
                        "https://twitter.com/OptimismGrants/status/1620119698401808387?s=20&t=kVZTD0nb8i08RaEuxtAsrQ"
                    ],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.90625
                },
                {
                    "author_link": "https://gov.optimism.io/u/NarutoOP",
                    "index": "6",
                    "likes": "0",
                    "time": "31/01/2023-16:26:05",
                    "content": "This season looks like it has a 250k op max per proposal. The 1.5 million op seems to not fall within the requirements for this season. Really like MakerDAO and would to see this accepted so might want to lower OP to be within the requirments? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Mingyue",
                    "index": "7",
                    "likes": "0",
                    "time": "31/01/2023-16:55:18",
                    "content": "If so,consider partner fund? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/MattL",
                    "index": "8",
                    "likes": "2",
                    "time": "02/02/2023-03:38:52",
                    "content": "Hey @Facundo - Quick reminder, the governance fund has set a limit of 250,000 OP tokens per grant for this Season. I’d recommend fitting within this limit (250k) and/or coordinating with the Optimism Partner Fund. I personally (as a delegate and grants council member) believe that this limit is restrictive to protocols, especially a protocol the size of MakerDAO, but sadly I’m not able to change this limit as it’s been set by the Optimism Foundation. cc: @lavande (to coordinate the convo on the partner fund) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.069444444444445
                }
            ]
        }
    ],
    "group_index": "353"
}