{
    "poll_list": [
        {
            "id": "0x638f2adbeded3a0409ea238610753a86c78d4c4cc5569565139c350f58ba944b",
            "title": "Season 2: Cycle 7: Sushiswap",
            "discussion": "https://gov.optimism.io/t/ready-gf-phase-1-sushi-part-1/3301",
            "body": "This Governance Fund Phase 1 proposal is eligible for voting in Cycle 7. \n\nThis proposal is was reviewed by [DeFi Committee A](https://gov.optimism.io/t/defi-committee-a-season-2-recommendations/3522/8). You can find committee recommendations below:\n\n[DeFi Committee A recommendations]([https://gov.optimism.io/t/defi-committee-a-season-2-recommendations/3522/8](https://gov.optimism.io/t/defi-committee-a-season-2-recommendations/3522/8))\n\nShadow DeFi Committee B is not an official committee but has posted their own recommendations here: [https://gov.optimism.io/t/defi-shadow-committee-season-2-recommendations/3549/11](https://gov.optimism.io/t/defi-shadow-committee-season-2-recommendations/3549/11)\n\nBy approving committees, the Token House entered a social contract to entrust and delegate the bulk of decision-making to official committees. However, delegates may vote against the recommendation of official committees but should provide a justification to the community as to why they voted differently.",
            "choices": [
                "For",
                "Against",
                "Abstain"
            ],
            "scores": [
                12131023.061621573,
                154934.64421532548,
                304047.69144783233
            ],
            "start": 1665691653,
            "end": 1666292853,
            "snapshot": "29191053",
            "state": "closed",
            "author": "0x47C88bb92B409fF25F6587EA611fac4e55f76007",
            "space": {
                "id": "opcollective.eth",
                "name": "Optimism Collective"
            }
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/ready-gf-phase-1-sushi-part-1/3301",
            "title": "[READY] [GF: Phase 1] Sushi - Part 1 ",
            "index": 3301,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Governance Fund: Phase 1"
            ],
            "tags": [
                "cycle-7",
                "season-2",
                "passed"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/Trudahamzik",
                    "index": "1",
                    "likes": "7",
                    "time": "15/08/2022-02:47:34",
                    "content": "Project Name: Sushiswap Author Names: Trudahamzik, JiroOno, Sarang Contact Info (Discord): Trudahamzik#8743, JiroOno#4493, sarang#5598 I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: Yes Number of OP tokens requested: 504,000 Did the project apply for or receive OP tokens through the Foundation Partner Fund?: No If OP tokens were requested from the Foundation Partner Fund, what was the amount?: NIL L2 Recipient Address: 0x1219Bfa3A499548507b4917E33F17439b67A2177 Grant category: Governance Fund Phase 1 Is this proposal applicable to a specific committee?: DeFi Committee Group A Relevant Usage Metrics:  TVL across all chains - $1.14B (DefiLlama) Daily volume - $50m to $150m across networks  Project links:  Website Twitter Discord Discourse Github Docs  Additional team member info: Information about all current members of Sushi can be found here. Please link to any previous projects the team has meaningfully contributed to: Sushi’s ethos has always been about multichain expansion. We’ve ran various liquidity mining programs on Polygon, Fantom, Moonriver, Arbitrum etc. We’ve helped kick start liquidity in various ecosystems and plan to continue to do so. Recent deployments in 2022:  Metis Launch Kava Launch Boba Launch Optimism Launch Arbitrum Nova  Competitors, peers, or similar projects:  Uniswap TraderJoe Spookyswap  Is/will this project be open sourced?: Yes, Sushi has always been open sourced. Optimism native?: Multichain Date of deployment/expected deployment on Optimism: Sushi got deployed on Optimism in May 2022. Check out the announcement here. Project Description, Optimism Alignment & Ecosystem Value Proposition: Sushiswap is currently one of the leading decentralized exchanges which was launched in August 2020. The protocol adopts an AMM model and has facilitated over $225.05B worth of trades since its inception. Sushi products deployed on Optimism (Over the past 3 months):  Trident  SushiXSwap Coming soon: Limit orders, Kashi, MISO & Permissionless Onsen Farms, Trident Stable Swap Pools  The team at Sushi plans to use this grant to help increase the liquidity of the Optimism ecosystem. How will the OP tokens be distributed? All of the OP tokens granted to Sushi will be distributed to liquidity providers who help bootstrap the initial Optimism liquidity for Trident with cross-chain swaps via SushiXSwap being the focus. SushiXSwap is a unified, multichain UI for swapping tokens across any of the major chains.The team solves the liquidity crunch by plugging into our own Sushi liquidity pools which are currently deployed on over 18 different chains. Being able to use this liquidity guarantees our users to always receive the best price for any pair across all the chains. SushiXSwap can be currently used here. With cross-chain swaps in mind for the rewards, we’re proposing to incentive these 3 pairs to start:  OP-ETH 1% (500 $OP per day for 180 days) ETH-USDC 0.05% (1500 $OP per day for 180 days) ETH-USDT 0.05% (800 $OP per day for 180 days)  OP rewards will be used to bootstrap the 1% fee tier for OP-ETH, and 0.05% USDT/USDC - ETH pairs. Each of the pairs will be constant product pools (50-50), and will have TWAP oracles enabled. With the OP rewards we will be targeting around 10% APR on $10m in TVL for ETH-USDC, $5m for ETH-USDT, and $3m for OP-ETH. With liquid ETH-USDC & ETH-USDT pools an easy gateway will open up to allow users on other chains to easily swap tokens from the source chain to Optimism tokens. Main benefit being the ability to top up gas on Optimism wallets via swaps on any source chain Sushi is deployed on. For example w/ fee tiers and stargate’s 0.06% bridge fee, users will be able to swap from MATIC on Polygon to ETH on Optimism with a 0.16% fee. Also with a 1% fee tier on the OP-WETH pair it will ensure that swaps from any chains on Sushi will be routed through the Optimism OP-WETH pair with all of the fees staying within the OP ecosystem. How will this distribution incentivize usage and liquidity on Optimism? Sushi has plans to co-incentivize the liquidity pools as well. With targeted 10% APRs on the pairs, we believe this provides enough rewards to bootstrap the main pairs enough to get things kick started for cross-chain swaps and help increase the activity & usage on Optimism. We’ll also be looking to bootstrap other pairs with SUSHI as they work their way into the onsen program. With increased liquidity on OP, it’ll also open the opportunity for native projects to have a place for their token to become liquid for cross-chain swaps as well. Added benefits in the form of BentoBox’s strategies will also deploy idle capital (OP, WETH, USDC, USDT) within the Optimism ecosystem, and thus will help aid in increasing usage and liquidity across OP. Sushi has previously run similar dual rewards for LPs on Polygon, Gnosis, MoonRiver, Fantom, etc. Why will the incentivized users and liquidity remain after incentives dry up? The plan is to kickstart cross-chain activity with bootstrapped OP rewards for 180 days, and SUSHI rewards continuing after the OP rewards end (potentially also recycled Sushi from fees w/ implementation of Meji proposal). Expectations are that volume will reach levels that it continues to be profitable w/o rewards, and liquidity will be sticky enough for long-term usage of the cross-chain swap functionality. Additionally, Sushi has plans to deploy each of our other products on Optimism and with bootstrapped liquidity it will be a good kickstart for activity from day one with the additional products like Miso, Kashi, Furo and Limit Orders. Over what period of time will the tokens be distributed? The rewards will be distributed over a 180 days period. Has your project previously received an OP token grant? If yes, what’s the status of these tokens? Sushi has not received any grants from OP. This is the first proposal submitted. How much will your project match in co-incentives? Initially Sushi will be able to reward similar rates as we do on other chains, with 100-300 SUSHI per day being the initial targets for each pair plus expansion into rewarding other pairs as they pop up or work into the onsen program.  300 Sushi per day for ETH-USDC 250 Sushi per day for ETH-USDT 150 Sushi per day for OP-ETH  The above are rates similar to what we incentivize on Arbitrum (700 sushi per day in total). Please provide any additional information that will facilitate accountability:  Sushi’s Treasury (ETH Mainnet): 0xe94B5EEC1fA96CEecbD33EF5Baa8d00E4493F4f3  ",
                    "links": [
                        "https://twitter.com/0xJiro",
                        "https://twitter.com/sarangparikh22",
                        "https://www.sushi.com",
                        "https://twitter.com/SushiSwap",
                        "https://discord.gg/BwUb2pdqGt",
                        "https://forum.sushi.com/",
                        "https://github.com/sushiswap",
                        "https://docs.sushi.com/",
                        "https://forum.sushi.com/t/sushi-2-0-a-restructure-for-the-road-ahead/10111",
                        "https://twitter.com/SushiSwap/status/1552302623562268672?s=20&t=QdC08cI9a2EiUiTazT0DCQ",
                        "https://www.coindesk.com/business/2022/05/30/kava-onboards-sushi-with-14m-in-developer-incentive-funding/",
                        "https://crypto.news/sushi-products-now-available-on-the-boba-network/",
                        "https://sushichef.medium.com/sushis-rolling-up-to-optimism-a325d2c585c7",
                        "https://twitter.com/arbitrum/status/1557167207171641345?s=20&t=fHhfbfmtyyoiYEugz0-CEQ",
                        "https://uniswap.org/",
                        "https://traderjoexyz.com/home#/home",
                        "https://spooky.fi/#/",
                        "https://twitter.com/optimismFND/status/1525122252949397505?s=20&t=p1YCPlfB5A_7pbZ2S-ecAQ",
                        "https://sushichef.medium.com/sushis-rolling-up-to-optimism-a325d2c585c7",
                        "https://sushi.com/blog/sushi-xswap-a-crosschain-dex",
                        "https://sushi.com/swap",
                        "https://forum.sushi.com/t/sushi-meiji-restoration/10969/16",
                        "https://gov.optimism.io/t/voting-cycle-6-roundup/3481/19",
                        "https://gov.optimism.io/t/voting-cycle-7-roundup/3586/4",
                        "https://gov.optimism.io/t/gfx-labs-delegate-communication-thread/2728/19",
                        "https://gov.optimism.io/t/scaleweb3-delegate-communication-thread/3314/15",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-giveth-cycle-8/3735/5",
                        "https://gov.optimism.io/t/draft-gf-phase-1-sushi-part-2-to-be-reviewed-in-april-2023/3553",
                        "https://gov.optimism.io/t/defi-committee-a-season-2-recommendations/3522/8"
                    ],
                    "GPT-summary": "The post is a proposal for a grant from the Optimism Foundation for the Sushiswap project. The proposal explains how the grant will be used to increase liquidity in the Optimism ecosystem through cross-chain swaps via SushiXSwap. The post also provides details on how the OP tokens will be distributed and how the distribution will incentivize usage and liquidity on Optimism. The post does not receive any negative feedback and does not advertise the proposal.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Interoperability and Scaleability",
                        "Board composition",
                        "Smart contract updates",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.493175287356323
                },
                {
                    "author_link": "https://gov.optimism.io/u/MinimalGravitas",
                    "index": "2",
                    "likes": "3",
                    "time": "15/08/2022-07:17:16",
                    "content": "Hi Trudahamzik, I haven’t used your cross-chain swaps yet, so could you clarify if I’m understanding the proposal correctly… is the ‘OP-ETH 1%’ a pool that allows you to swap directly between ether on L1 and OP on Optimism? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/Trudahamzik",
                    "index": "3",
                    "likes": "1",
                    "time": "15/08/2022-11:15:15",
                    "content": "Hi there buddy, Yes you’re absolutely correct. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Zapacheenie",
                    "index": "4",
                    "likes": "2",
                    "time": "17/08/2022-15:17:38",
                    "content": "Bumping for notifications and emotional support. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "5",
                    "likes": "3",
                    "time": "19/08/2022-18:21:24",
                    "content": "here to provide emotional support. been a sushi user and fan since the day nomi rolled it out. our goal is to get as much bridging here as possible, and facilitating this seems like a no-brainer. at velodrome we used LZ tech for an initial burn-mint transfer, and it was a real pleasure to use. would love to see this tech deployed at scale for Optimism. would love to hear some more detail about follow-on work you intend to do for Optimism specifically. also wouldn’t mind some ways you can envision new things protocols on Optimism can do as a result of this omnichain capability being brought online - would be helpful to try to coordinate some interesting things. first suggestion that comes to mind here is that because you intend to do a staged rollout of products, you and OP could all be better off if you ask for a smaller grant up front (scaled by time) over less time so that you can then demonstrate efficacy with that grant and get even more later on, targeting the additional features. sidenote: very excited about the meji proposal, in part selfishly because it cites the success of the economic structure we’ve laid out at velodrome. but generally very cool to see the level of thoughtfulness in that proposal. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.086237373737374
                },
                {
                    "author_link": "https://gov.optimism.io/u/MoneyManDoug",
                    "index": "6",
                    "likes": "2",
                    "time": "19/08/2022-21:03:50",
                    "content": "While the proposal seems reasonable, I had a few questions about co incentives, is the 100-300 sushi earmarked for the pools being split evenly between each pair or is it going to be 100-300 per day per pair? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Jiro",
                    "index": "7",
                    "likes": "1",
                    "time": "19/08/2022-23:48:27",
                    "content": "It would be 100-300 per pair. Likely will be 300 sushi per day for ETH-USDC, 250 per day for ETH-USDT, and 150 per day for OP-ETH. Shooting for around the same rates as we do for Arbitrum which is 700 sushi per day currently. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Jiro",
                    "index": "8",
                    "likes": "3",
                    "time": "20/08/2022-00:54:04",
                    "content": "Thanks Jack for the emotional support  Really interesting about the LZ tech for initial burn to mints. Cool thing about xSwap is that it’s easy to slot in additional bridges, so we can definitely incorporate a ZK style bridge into xSwap for users to use when bridging to OP. In regards to future plans for OP, personally I’ve imagined Optimism being a main test bed / development playground for a lot of our products. One of the main reasons why we haven’t deployed rewards yet on OP too is because we were planning on spinning out our new permissionless Staking Contract here to start. Also actually am curious though what everyone thinks in regards to the amount of rewards we are asking, initially we wanna keep it low to just get a good start going here but we also wanna keep it low so we can do other cool things with OP grants n stuff down the road especially if/when Meji comes through and opens up an easier and streamlined way for funding grants / further development. Totally agreed on Meji as well, a lot of us are really excited with the proposal / work already being done for it as well. Which is why I do think it’s important to get a kick start going on OP for 180 days, and then when Meji kicks in the fly wheel will already be in place to really get it spinning here. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.814347175458287
                },
                {
                    "author_link": "https://gov.optimism.io/u/sarang",
                    "index": "9",
                    "likes": "3",
                    "time": "22/08/2022-11:13:00",
                    "content": "Thanks a lot @jackanorak @Jiro Has covered it very well. I would just like to add few more details to it. To, start with we have already deployed several of our products on Optimism - Trident, SushiXSwap, BentoBox and Furo. These all our new products powering the best of Sushi, just for OPtimism. Sushi is very focused in the Multichain vision. We believe that the future will be multichain first. We are taking careful steps in that direction. The first multichain expansion was with the SushiXSwap, which gave users the capability to do cross chain swaps. Our next step in this expansion is Sushi 2.0 UI. Which is a UI that is built to rule them’all and blur the lines between different chains for the user. Users will be able to see all the opportunity at Sushi across all the chains in a single page, providing superior UX than any other dapp in the ecosystem currently. This would allow better visibility for Optimism as users don’t have to change chains to see the opportunity. The UI would also allow users to LP directly into these opportunities via SushiXSwap. So, now users see all the opportunities in a single page, and no matter which chain they have funds in, they can easily LP into OPtimism in just a single transaction. We will be also deploying Bentobox Strategies that will provide better capital efficiency for sushi users on Trident & Furo. These strategies will be deployed to dapps on OPtimism, hence contributing to the larger ecosystem. We are also launching a new Pool Type on Trident really soon, which will allow users to trade the correlated assets better, it inherits all the benefits of the bentobox as well. As @Jiro has already mentioned, our Permission-less Staking will also be released on OPtimism, providing incentive for multiple projects inside OPtimism ecosystem. With all the benefits we provide to the OP ecosystem and it’s users, it will help us build the strong foundation and provide users to move from various chains to OP  The main component for this would be our Trident and SushiXSwap, coupled with the new UI, users can see the opportunity at OPtimism and can easily traverse into it. So, the above grant helps us to build strong foundation on OPtimism and paving the way for future products to easily extract the benefits and give it back to the OP users and the ecosystem. On the Meji Proposal, like every tokenomics update, we would be looking at all the aspect and how it impacts the Sushi Ecosystem, as unlike other protocols, Sushi has been working towards a DeFi Powerhouse and soon a NFT Powerhouse too  We would be looking at various data points and try to improve the model from that gathering, but as @Jiro outlined, it will make our process only smoother. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.861152105470287
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "10",
                    "likes": "0",
                    "time": "13/09/2022-00:01:58",
                    "content": "Thanks for the proposal! If you plan to have this reviewed in Voting Cycle 6, can you please specify which committee should review your proposal (NFTs and Gaming, Tooling, or DeFi) under the grant category field in the updated proposal template for Cycle 6? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/Trudahamzik",
                    "index": "11",
                    "likes": "0",
                    "time": "13/09/2022-07:33:53",
                    "content": "Hey lavande! Thanks for sounding out the new proposal structure. I’ve made some changes and also added more details into the proposal. It should be good to go.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.920454545454545
                },
                {
                    "author_link": "https://gov.optimism.io/u/Trudahamzik",
                    "index": "12",
                    "likes": "2",
                    "time": "16/09/2022-03:56:35",
                    "content": "Feedback After submitting our draft proposal a month ago, the team has been constantly gathering feedback from various community leaders and members. Below is a short summary of the concerns and what we’ll be doing to address them. 1. Extend Rewards Distribution Cycle: Previously, we were planning to finish distributing the $OP incentives over a 6 month period. However after some feedback, we decided it would be best to extend it to a 1 year distribution period so liquidity providers will be incentivized to keep their liquidity on OP. Sushi will be matching and co-incentivizing the pools as well. 2. Be clear about the matched incentives: Initially we gave an estimate of around 100-300 Sushi rewards per day for each of the pools. We are now clearly defining the reward numbers for each pool.  300 Sushi per day for ETH-USDC 250 Sushi per day for ETH-USDT 150 Sushi per day for OP-ETH Do note that we plan to expand and incentive more pairs going forward. The pairs listed above are what we are proposing as an initial kickoff.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.696969696969697
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "13",
                    "likes": "2",
                    "time": "16/09/2022-16:07:12",
                    "content": "Hey @Trudahamzik curious about the reasoning behind extending the distribution cycle. If anything I’d recommend returning it to 6 months, if not shorter – that way you’d be able to reapply with some more validation and even to support some of the additional tooling. Saying that LPs will pull at the end of rewards otherwise kind of runs against the premise that these rewards incentivize activity beyond the end of the grant  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.1
                },
                {
                    "author_link": "https://gov.optimism.io/u/Trudahamzik",
                    "index": "14",
                    "likes": "0",
                    "time": "16/09/2022-16:30:47",
                    "content": "We’re definitely open to adjusting the distribution cycle. Happy to take additional comments.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/linda",
                    "index": "15",
                    "likes": "4",
                    "time": "24/09/2022-07:36:58",
                    "content": "Sharing our feedback from DeFi Committee A on this proposal: “The team is well established and this proposal has great co-incentives. However, we would like to see this proposal broken up into 2 separate smaller requests, each with a 6 month timeline. Once this proposal has been resubmitted into 2 separate, smaller requests, we would be happy to give a yes vote. We are requesting that the updated proposal get re-submitted back to DeFi Committee Group A.” ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Trudahamzik",
                    "index": "16",
                    "likes": "6",
                    "time": "25/09/2022-16:37:38",
                    "content": "Hi Linda, Thank you! Sushi definitely appreciates the feedback given by the team. I have split the proposal into 2 parts: Part 1 - [REVIEW] [GF: Phase 1] Sushi - Part 1 - #13 by jackanorak Part 2 - [REVIEW] [GF: Phase 1] Sushi - Part 2 I have added additional details in part 2 of the proposal. They have been bolded so you can easily locate them. Sushi is happy to address any additional concerns or questions the committee may have. ",
                    "links": [
                        "https://gov.optimism.io/t/review-gf-phase-1-sushi-part-2/3553"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.055555555555556
                },
                {
                    "author_link": "https://gov.optimism.io/u/linda",
                    "index": "17",
                    "likes": "1",
                    "time": "25/09/2022-17:03:21",
                    "content": "I had reviewed an earlier version of this proposal as part of DeFi Committee A and our feedback was incorporated. I am an Optimism delegate [Delegate Commitments - #37 by linda] with sufficient voting power and I believe this proposal is ready to move to a vote. ",
                    "links": [
                        "https://gov.optimism.io/t/voting-cycle-7-roundup/3586/4",
                        "https://gov.optimism.io/t/voting-cycle-6-roundup/3481/19"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party auditing and reviewing proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/katie",
                    "index": "18",
                    "likes": "3",
                    "time": "25/09/2022-17:06:14",
                    "content": "I am an Optimism delegate [Delegate Commitments - #18 by katie] with sufficient voting power and I believe this proposal is ready to move to a vote. ",
                    "links": [
                        "https://gov.optimism.io/t/voting-cycle-6-roundup/3481/19",
                        "https://gov.optimism.io/t/voting-cycle-7-roundup/3586/4"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/mastermojo",
                    "index": "19",
                    "likes": "2",
                    "time": "27/09/2022-03:12:25",
                    "content": "I am an Optimism delegate [Delegate Commitments - #65 by mastermojo] with sufficient voting power, and I believe this proposal is ready to move to a vote ",
                    "links": [
                        "https://gov.optimism.io/t/voting-cycle-7-roundup/3586/4"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/marc",
                    "index": "20",
                    "likes": "2",
                    "time": "02/10/2022-21:07:12",
                    "content": "hi @Trudahamzik, thank you for your well written proposal and your adjustment to the feedback by community members and delegates. I personally value Sushi for its solid products and its ability to ship across multiple areas across swaps, cross-chain, lending, NFTs, and streams. I recognize that my feedback might come in a bit late, given that you have started gathering feedback since mid-august. I hope you wouldn’t be frustrated with the long process and it would be a fruitful experience for you, Sushi, and Optimism. Given your diverse product ranges, I will further take @jackanorak comment for Sushi products and  encourage you to split the incentives not only towards the three pools, but also towards others. Sushi contributors mentioned correlated assets pools, permission-less staking and others. I might not be fully updated to what Sushi has been cooking, so please update me where I am at fault:   Kashi Markets: Kashi Markets isn’t on Optimism yet. Is there a possibility deploying a few selected isolated pools on Kashi Markets to Optimism, and add incentives to them.   Limit Orders: Limit orders aren’t yet available on Optimism. Is there a space to incentive using them?   Shoyu 2.0: Your future open marketplace for NFTs. Is there a place for an initial optimism launch, instead of mainnet?   Furo Stream: This is a great product that is well underused. Is there ways to push for a wider adoption for DAOs on Optimism?   Interested to hear other community members and delegates feedback on this well. Sushi is a fully loaded Swiss Army knife that is yet to unleash its potential on Optimism. IMHO, your proposal would be much stronger if you manage to cooperate with the different teams in Sushi to collectively increase usage for Sushi on Optimism. Lastly, a logistic question to clarify the splitting of the proposal: are you including both Part 1 and Part 2 in cycle 7 for a voting round? My understanding is that Part 2 proposal would come in 6 months after Part 1 for review, given how the incentives have worked. ",
                    "links": [
                        "https://app.sushi.com/limit-order?chainId=10",
                        "https://forum.sushi.com/t/shoyu-2-0-community-update/9785",
                        "https://www.sushi.com/furo"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.017857142857142
                },
                {
                    "author_link": "https://gov.optimism.io/u/Trudahamzik",
                    "index": "21",
                    "likes": "3",
                    "time": "03/10/2022-16:22:18",
                    "content": "Hi Marc, Thank you for the feedback. The team is humbled by your words. We are constantly building and have more plans to ship additional products in the future. Here are some answers to your questions:   Yes, we do plan to launch additional pools and split the incentives among them as well. As our main focus is currently SushiXSwap, we decided to start off with the 3 most popular pools (OP/ETH, ETH/USDC, ETH/USDT) to draw initial liquidity over to OP. We do have plans to offer incentivized WBTC, Sushi & Synth pools as more liquidity flows into OP. We also didn’t want to go crazy right off the bat with the incentives but gradually ramp them up over time instead.   Kashi Markets & Limit Orders will be launched on OP for sure. We’re currently in the midst of integrating them with our new Sushi 2.0 UI. This might take a while, but we’re hoping to get them up and running asap.   The team from Shoyu plans to launch only on mainnet for now. But yes, there will be a place for an Optimism launch in the future.   Thank you for highlighting Furo, we do have big plans for it. Furo currently has a TVL of almost 100M. We’re planning to use “Sushi Academy”, an education hub that features content on all things Sushi to educate users on our products and push for wider adoption. We also want to get our new head chef to actively engage with other native OP protocols and ensure they know that Sushi has a streaming/vesting product that can be implemented with their existing DAO tooling system e.g Making appearances on OP radio or various AMAs held by the OP team.   Part 2 of the proposal should only be reviewed in April 2023. I will not include it in cycle 7 for a voting round.   Feel free to DM me if more clarifications are needed. ",
                    "links": [
                        "https://gov.optimism.io/t/draft-gf-phase-1-sushi-part-2-to-be-reviewed-in-april-2023/3553"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.608995171495171
                },
                {
                    "author_link": "https://gov.optimism.io/u/Jadmat.Eth-DefiLatam",
                    "index": "22",
                    "likes": "1",
                    "time": "04/10/2022-14:49:26",
                    "content": "Hey @Trudahamzik I’m excited about this thread; I hope we get to see that creative and innovative Sushi again. I leave you with some questions Is Sushi one of Stargate’s qualified partners? Can you tell us which bridges are integrated with Xsushi? what are the integration possibilities? What will Sushi’s new stake on optimism look like?     Trudahamzik:  Las expectativas son que el volumen alcanzará niveles en los que seguirá siendo rentable sin recompensas, y la liquidez será lo suficientemente rígida para el uso a largo plazo de la funcionalidad de intercambio entre cadenas.   Could you elaborate more on this statement? Finally, do you have any metrics on Sushi’s performance in other chains after the subsidies received? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.491477272727273
                },
                {
                    "author_link": "https://gov.optimism.io/u/Trudahamzik",
                    "index": "23",
                    "likes": "1",
                    "time": "05/10/2022-13:48:17",
                    "content": "Hi Jadmat, Please find replies to your questions below:   Yes Sushi is one of Stargate’s main integrated partners. As of now SushiXSwap is integrated only with Stargate. We are currently in discussions with various bridges to get them integrated as well.   To elaborate more on the statement, Sushi’s long term plan is to help increase liquidity and trading volume on OP up to a sustainable level where neither extra $SUSHI nor $OP rewards are needed to incentive liquidity providers to remain on OP. e.g. Earning the swap fees alone will be enough to keep liquidity providers for various popular pool pairings happy   You can find a chart below which shows the Swap, LP, Lending & Borrowing activity on Sushi Polygon. Unfortunately I could only retrieve data from October 2021, but we started our dual reward incentive programme in May 2021 hence the uptick in activity. Fast forward to a year later (in a bear market), you can see that the current on-chain activity still sits in a healthy 5K - 20K range.    Swaps, LP events on Sushi Polygon866×741 114 KB  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.75462962962963
                },
                {
                    "author_link": "https://gov.optimism.io/u/Jadmat.Eth-DefiLatam",
                    "index": "24",
                    "likes": "0",
                    "time": "06/10/2022-10:54:03",
                    "content": "Thank you for your feedback Some ideas that were not clear to me Regarding the new Stake on Optimism; is there anything you can tell us?     Trudahamzik:  Para dar más detalles sobre la declaración, el plan a largo plazo de Sushi es ayudar a aumentar la liquidez y el volumen de negociación en OP hasta un nivel sostenible en el que no se necesitan recompensas adicionales de $SUSHI ni $OP para incentivar a los proveedores de liquidez a permanecer en OP. Por ejemplo, ganar solo las tarifas de intercambio será suficiente para mantener contentos a los proveedores de liquidez para varios emparejamientos de grupos populares.   What do you consider to be the main advantages of Sushi over competitors such as Velodrome, Uniswap or Beethoven? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.316287878787879
                },
                {
                    "author_link": "https://gov.optimism.io/u/Trudahamzik",
                    "index": "25",
                    "likes": "1",
                    "time": "06/10/2022-13:08:00",
                    "content": "Hi Jadmat, Not too sure what you mean by new stake. Would be great if you could elaborate more. As for Sushi’s strength, I would say that we’ve evolved over time and have churned out a diverse range of products that definitely would be able to help bring more TVL to OP. Current range of Sushi products:  Bentobox – Vaults Trident – AMM Factory Swap – Regular token swap SushiXSwap – Crosschain Onsen – Liquidity mining Kashi – Lending & Borrowing Miso – Launchpad Furo – Token Streaming & Vesting  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.419938016528926
                },
                {
                    "author_link": "https://gov.optimism.io/u/Jadmat.Eth-DefiLatam",
                    "index": "26",
                    "likes": "0",
                    "time": "07/10/2022-02:14:53",
                    "content": "    sarang:  Como @Jiro ya ha mencionado, nuestro Stake sin permiso también se lanzará en OPtimism, proporcionando incentivos para múltiples proyectos dentro del ecosistema de OPtimism.   Maybe I have misunderstood and it is not a new stake mechanism? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 4.659090909090909
                },
                {
                    "author_link": "https://gov.optimism.io/u/Trudahamzik",
                    "index": "27",
                    "likes": "1",
                    "time": "07/10/2022-03:04:50",
                    "content": "Hi Jadmat, Ah got it. The permissionless staking my developers were talking about is for the Onsen liquidity mining programe. We plan to make contracts permissionless in the future so protocols can manage the rewards that they want to give out to liquidity providers themselves instead. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/katie",
                    "index": "28",
                    "likes": "5",
                    "time": "12/10/2022-16:20:13",
                    "content": " Defi Committee A Recommendation Voting recommendation: Yes Rationale: The proposal team incorporated previous feedback and updated the proposal into a smaller amount requested and shorter distribution timeline. We are happy to support the updated proposal. Previous recommendation can be found here. Note: Flipside Crypto abstained from this committee decision since they have a position in Sushi and are involved in Sushi governance. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.583333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/katie",
                    "index": "29",
                    "likes": "1",
                    "time": "13/10/2022-20:31:20",
                    "content": "Voted yes - Thank you to the sushi team for incorporating feedback and updating your proposal! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Trudahamzik",
                    "index": "30",
                    "likes": "1",
                    "time": "14/10/2022-02:02:38",
                    "content": "Thank you katie  the team is excited as well ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "31",
                    "likes": "3",
                    "time": "15/10/2022-18:55:12",
                    "content": "Voted For Solid proposal. Going with committee recommendation. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPenthusiast",
                    "index": "32",
                    "likes": "2",
                    "time": "16/10/2022-08:04:32",
                    "content": "Strong proposal with a well known protocol such as sushi joining OP. I support this proposal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.083333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "33",
                    "likes": "3",
                    "time": "20/10/2022-11:17:40",
                    "content": "Voted FOR this proposal following committee A. Solid proposal, solid team and nice to see previous feedback incoroporated. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.433333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/SEED_LATAM_Joxes",
                    "index": "34",
                    "likes": "1",
                    "time": "21/10/2022-02:58:36",
                    "content": "[Final] Voting: Against Contrary to the recommendations of the DeFi A committee, our community expressed its rejection of the proposal, we would have liked a lower amount given the status of Sushi as a DEX or some of the new features finally released to later be incentivized. Since the proposal passed a few hours ago, we wish it luck in gaining traction that can be sustained long-term beyond today’s incentives. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.446969696969697
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "35",
                    "likes": "0",
                    "time": "21/10/2022-03:07:10",
                    "content": "Respect your desire to get on the record after voting has closed. Important to get everyone’s view.     SEED_LATAM_Joxes:  we would have liked a lower amount given the status of Sushi as a DEX   Can you explain this? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "36",
                    "likes": "0",
                    "time": "21/10/2022-13:11:09",
                    "content": "Snapshot vote - passed ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "37",
                    "likes": "0",
                    "time": "21/10/2022-13:12:00",
                    "content": "@Trudahamzik can you provide a Telegram handle or other contact method so the Optimism team can get in touch about paying out this grant! Feel free to DM or email palash@optimism.io ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.609375
                },
                {
                    "author_link": "https://gov.optimism.io/u/Trudahamzik",
                    "index": "38",
                    "likes": "0",
                    "time": "21/10/2022-13:30:29",
                    "content": "Hey @lavande, Thank you! I have just sent you a DM ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "206"
}