{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/layer2dao-intends-to-match-the-op-token-incentives-in-the-opincubator-program-on-a-1-1-basis-with-l2dao-tokens/1304",
            "title": "Layer2DAO intends to match the OP token incentives in the OPIncubator program on a 1:1 basis with L2DAO tokens. ",
            "index": 1304,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Governance Fund: Phase 0"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/nata",
                    "index": "1",
                    "likes": "14",
                    "time": "26/05/2022-15:47:09",
                    "content": "Continuing the discussion from [GF: Phase 0 Proposal] Layer2DAO: good[quote=“Exosphere, post:1, topic:1198, full:true”] Project Name: Layer2DAO Author Name: mctopcat.L2, train.L2, exosphere.L2 (@Exosphere) Defillama TVL (at snapshot): 0 Transactions/day (at snapshot): 244 Tier: 3 Optimism native: No Number of OP tokens to claim: 300,000 L2 Recipient Address: 0xaF5a0068f5465260A1a88A6264D0dcE4469609CF  Proposal for token distribution (under 1000 words)   Introduction to Layer2DAO Layer2DAO is expanding the Ethereum L2 ecosystem and investing in L2 ecosystem projects. The DAO uses its treasury to invest into high-impact L2 protocols and ecosystem plays, serving as a diversified venture fund for investors looking to gain exposure to the L2 ecosystem growth. It may also provide liquidity, depositing, and staking in the future, perpetually reinvesting proceeds back into the DAO. Layer2DAO will also provide incentives for users to move their funds to L2s and use protocols on those L2s, modeled after other protocols’ successful incentive programs. We plan on particularly supporting projects that have not launched their own token to drive adoption. Layer2DAO is governed by L2DAO token holders. Through the proposal and voting process L2DAO token holders will determine the actions and direction of Layer2DAO. Layer2DAO is proposing to use 240,000 of the 300,000 OP fund to create an ‘OPIncubator’ that will invest in projects that run on Optimism in addition to incentivizing a new L2DAO/OP liquidity pool with 60,000 tokens. The OPIncubator will incorporate a dynamic NFT on Optimism that can be used by holders to vote for their favorite Optimism projects in return for bribes. Successful projects will be awarded a portion of the OP drop over 6 funding rounds. Layer2DAO will match these funds on a 1:1 basis. The Layer2DAO treasury intends to bridge 100 million L2DAO tokens from Arbitrum to its multi-sig wallet on Optimism.  How will the OP tokens be distributed?   OPIncubator Layer2DAO’s stated mission as a DAO is to expand the Ethereum L2 ecosystem and invest in L2 ecosystem projects. As such the DAO aims to use part of its Optimism Fund grant to incentivize high-impact Optimism protocols. Layer2DAO is proposing to use 240,000 OP tokens to create the OPIncubator project that will incentivise projects that run on Optimism. It intends to coordinate this investment through the development of a unique ‘dynamic’ NFT - the OPIncubator passport - which will reside on Optimism. We intend to sell this NFT for OP tokens. We are aiming for access to the first round of voting to be economically neutral for a portion of our Early Adopter user base. Layer2DAO intends to identify an Optimism native NFT project and developer and use up to 15,000 tokens for the creation of the OPIncubator passport NFT and OPIncubator functionality. We will sell 2,000 of these dynamic NFT’s to users on Optimism. Dynamic NFTs evolve over time as they are used in different ways and their rarity can increase. In this instance the OPIncubator passport will allow holders to vote in a series of OPIncubator investment rounds. Six successful projects will be awarded 27,500 OP each over six separate funding rounds (thus completing the 165,000 OP distribution). We intend the sale of the NFT to be economically neutral for our early adopters by incentivizing them to participate and vote in the six projects. We will use 60,000 of the tokens to incentivize voting (10,000 for each round).  Liquidity Incentives We plan on distributing the remaining 60,000 tokens as incentives to users for staking in the new L2DAO/OP LP, preferably through an Optimism-native project such as Zipswap.  Summary of distribution   15,000 OP - Partner with NFT project and developer to create OPIncubator passport NFT and functionality 165,000 OP - OPIncubator distribution to 6 Optimism projects 60,000 OP - OPIncubator voting incentives over 6 rounds 60,000 OP - L2DAO/OP LP   How will this distribution incentivize usage and liquidity on Optimism?  Layer2DAO will be incentivizing a new long-term L2DAO/OP LP pool on Optimism with 60,000 of the OP tokens. In addition, the OPIncubator project will create a mechanism by which users will be rewarded for their long-term participation of protocols on Optimism.  Why will the incentivized users and liquidity remain after incentives dry up?  The key to our proposal, and our long term mission as a DAO, is the sustainability of Ethereum L2 protocols. Layer2DAO will also be staking treasury funds for the LP pools. The participation in governance in OP affords us the opportunity to have a lasting presence on the chain. The OPIncubator will provide the DAO an ability to incentivise projects on Optimism that last well beyond the current incentives provided.  Over what period of time will the tokens be distributed?  We anticipate that these incentives will be distributed over a 6-12 month time frame depending on the number of quality projects that are put forth for the OPIncubator program.  How much will your project match in co-incentives?  Layer2DAO intends to match the OP token incentives in the OPIncubator program on a 1:1 basis with L2DAO tokens. [/quote] ",
                    "links": [
                        "https://www.layer2dao.org/",
                        "https://docs.layer2dao.org/overview/projects/l2-early-adopter-nft",
                        "https://www.zipswap.fi/"
                    ],
                    "GPT-summary": "The post is a proposal by Layer2DAO to expand the Ethereum L2 ecosystem and invest in L2 ecosystem projects. The proposal includes using 240,000 of the 300,000 OP fund to create an ‘OPIncubator’ that will invest in projects that run on Optimism in addition to incentivizing a new L2DAO/OP liquidity pool with 60,000 tokens. The post also explains how the OP tokens will be distributed and how the project will incentivize usage and liquidity on Optimism. The post includes constructive criticism and questions from third parties, and the author is explaining the proposal.",
                    "GPT-proposal-categories": [
                        "Token economics",
                        "Grants, Funding and resource allocation",
                        "Community and engagement"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.627354627354627
                },
                {
                    "author_link": "https://gov.optimism.io/u/Piyush",
                    "index": "2",
                    "likes": "1",
                    "time": "26/05/2022-15:51:53",
                    "content": "Great initiative: hats off to Layer2DAO ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/AFFA",
                    "index": "3",
                    "likes": "1",
                    "time": "26/05/2022-17:15:17",
                    "content": "Layer2DAO! the best dao in OP ecosystem!    ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/yefeng",
                    "index": "4",
                    "likes": "1",
                    "time": "27/05/2022-08:31:22",
                    "content": "yes.its a good idea for it so youcan do it ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/brucewang614",
                    "index": "5",
                    "likes": "0",
                    "time": "29/05/2022-10:31:22",
                    "content": "Just minted a L2DAO NFT, good proposal! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.375
                },
                {
                    "author_link": "https://gov.optimism.io/u/Sethoshi",
                    "index": "6",
                    "likes": "0",
                    "time": "31/05/2022-02:07:03",
                    "content": "The best. My support is with you ! Let’s #BUIDL together. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/potatoonwar87",
                    "index": "7",
                    "likes": "0",
                    "time": "01/06/2022-20:36:52",
                    "content": "great idea! keep it up ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "8",
                    "likes": "0",
                    "time": "13/09/2022-13:15:10",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "8"
}