{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/draft-gf-phase-1-proposal-rabbithole-quests-on-optimism/5377",
            "title": "[DRAFT][GF: Phase 1 Proposal] RabbitHole Quests on Optimism ",
            "index": 5377,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Grants Council"
            ],
            "tags": [
                "growth",
                "cycle-11"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/brian_rabbithole",
                    "index": "1",
                    "likes": "10",
                    "time": "01/03/2023-18:57:13",
                    "content": "Basic Details Project name: RabbitHole Author name and contact info (please provide a reliable point of contact for the project.): Brian Flynn (@flynnjamm on Telegram) L2 recipient address: 0xbD72a3Cd66B3e40E5151B153164905FD65b55145 Which Voting Cycle are you applying for?: 11 I confirm that I have read the landing pages for the Sub-Committees and that I have determined my proposal is best suited to be reviewed by the Growth Experiments Sub-Committee: [Yes/No]: Yes I understand that Growth Experiments grants are subject to a “no sale rule,” and I have read the terms of the rule: [Yes/No]: Yes Project Details What are you building?: RabbitHole is a token distribution platform that enables users to earn ERC20 tokens for completing on-chain tasks in various protocols. RabbitHole makes it easy for protocols to distribute tokens in quick, ad-hoc quests, all on-chain through its Quest Protocol. Why do you believe what you are building is going to succeed?: We’ve already demonstrated success through Quests, and want to use the grant to supercharge efforts. How many users does your project have currently? Please include how you arrived at this estimate: We’ve driven 22,000 unique wallets to do 36,000 t/xs on Optimism over the past two weeks, and have 197,000 unique wallets across all networks just in the two weeks since we’ve launched V2. This data is verifiable on-chain with a Dune query. How will receiving a grant enable you to further the mission of maximizing the number of users interacting with Optimism? Please include a step-by-step flow of how you imagine this grant can lead to a greater number of user interactions with Optimism:  RabbitHole will create daily on-chain tasks for the top protocols on Optimism, distributing tokens evenly across a fixed time period. The protocols that will be incentivized are as follows: PoolTogether, Superfluid, Velodrome, Sonne, and Mirror. RabbitHole will seek to find price equilibrium which will maximize the efficiency of token spendings to drive certain actions in each of these protocols.  Tell us about the users you plan to target with this grant. Include any defining characteristics that will help you identify and target them.:  We plan on targeting users that are sensitive to gas fees and want to discover Optimism applications in a safe and easy way.  How would these users interact with Optimism? For how long?:  Users will interact with Optimism on a daily basis over the course of seven weeks.  Provide us with links to any of the following for the project:   Demo: rabbithole.gg  Website: rabbithole.gg  Twitter: @rabbithole_gg   Discord/Discourse/Community: rabbitholegg  Github: https://github.com/rabbitholegg/quest-protocol  Technical/Economic Documentation: Other:  Do you have any metrics on the project currently? (TVL, transactions, volume, unique addresses, etc. Optimism metrics preferred; please link to public sources such as Dune Analytics, etc.): You can see Optimism metrics here: (WIP - Rabbithole v2) Who are your competitors, and are they on Optimism?: Galaxe/Layer3/Coinbase Earn. Please link to code audits (if any): Audits can be found in Quest Protocol GitHub repo Team Who are your founders?: Brian Flynn What makes your team well-suited to carry out the project described in this proposal? RabbitHole has been running quests for two years and have helped major projects like ENS, Uniswap, Gnosis Safe, dydx, and others to grow their project through quests. We’ve helped projects distribute millions of tokens and drove hundreds of thousands of users. We’ve recently built RabbitHole V2 so protocols can quickly spin up quest opportunities in a matter of minutes. Is this your first Web3 project?: No If not, what else have you built? (Share links, Github repository, or any other useful information.): The team has worked at Dapper Labs, OpenSea, Coinbase, among other various crypto projects. Grant Request What is the size of the grant request? (250k OP max): 248,500 How do you justify the size of the grant?: We already are distributing OP tokens from our own treasury, and plan on catalyzing these efforts through an OP grant, which we plan on distributing over the course of seven weeks. Roadmap and Distribution Plan Describe in discrete steps how you will successfully implement your grant plan: See below How will the OP tokens be distributed? (please include % allocated to different initiatives such as user rewards/marketing/liquidity mining. Please also include a justification as to why each of these initiatives align with the problem statement this proposal is solving. Distribution should not include the sale of any tokens by the grantee or the use of tokens for compensation, protocol expenses, etc.: Week 1: 17,500 OP distributed | 35,000 Users Week 2: 21,000 OP distributed | 42,000 Users Week 3: 28,000 OP distributed | 56,000 Users Week 4: 35,000 OP distributed | 70,000 Users Week 5: 42,000 OP distributed | 84,000 Users Week 6: 49,000 OP distributed | 98,000 Users Week 7: 56,000 OP distributed | 112,000 Users Total Distributed: 248,500 OP The tokens will be distributed to quests across the following projects:  PoolTogether (Deposit) Velodrome (Swap) Sonne (Lend) Mirror (Collect/Publish) Superfluid (Stream) Kwenta (Swap)  Over what period of time will the tokens be distributed for each initiative?: The tokens will be distributed over a period of 7 weeks. Please provide benchmark milestones for this project. These milestones should guide the Optimism community on the progress of your project throughout your work on the project. Do not use distribution of the grant itself as a milestone: We will scale the number of tokens being distributed via quests linearly to ensure that users are transacting on Optimism according to our estimates. Each week will be a new milestone for grant, to ensure a quick feedback loop with the community. Please define critical milestones for this project. Critical milestones are meant to show good-faith efforts to accomplish the project. Non-completion of these milestones could lead to revocation of remaining grant rewards. Do not use distribution of the grant itself as a milestone: Each week refers to its own milestone. Please refer to the table above for the appropriate milestones. Data from the quest protocol can be verified on-chain directly. If the OP tokens are for direct distribution to users, why will incentivized users and liquidity on Optimism remain after incentives dry up?: We’ve found that users will come back if there is a daily reward to stay engaged with the protocol. We can condition repeat behavior through daily quests. We plan on doing this efficiently so the economics make sense for the Optimism Network long-term, and that substantial fees are being generated. Please provide any additional information that will facilitate accountability (smart contracts addresses relevant to the proposal, relevant organizational wallet addresses, etc.): You can track completion of Optimism Quests at our contract address here: 0x52629961f71c1c2564c5aa22372cb1b9fa9eba3e Does your project solve a problem for the Optimism ecosystem? If so how?: RabbitHole is not only a platform for users to discover crypto applications, but it is also a tool for projects to experiment with incentives. We hope that projects in the Optimism ecosystem will use RabbitHole to A/B test token incentives and maximize efficiency of token spendings through small-scale, rapid experimentation of Quests. We hope to demonstrate the effectiveness of the tool by dogfooding it ourselves with a grant and show results to the community. Over time, we also plan on integrating Attestation Station as one potential way to filter users for quests. Why will this solution be a source of growth for the Optimism ecosystem?: We’ve already demonstrated that RabbitHole V2 can drive tens of thousands of users to the Optimism Ecosystem in just two weeks, we expect to multiply those numbers through the grant. Is your project Optimism Native?: Yes (Only deployed on Mainnet, Optimism, and Goerli) Confirmations I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: [Yes/No]: Yes I understand that I will be expected to following the public grant reporting requirements outlined in the Public Reporting Requirements for Grantees: [Yes/No]: Yes ",
                    "links": [],
                    "GPT-summary": "The author of the proposal, Brian Flynn, is requesting a grant from the Optimism Foundation for his project, RabbitHole. RabbitHole is a token distribution platform that enables users to earn ERC20 tokens for completing on-chain tasks in various protocols. The proposal outlines how the grant will be used to incentivize users to interact with Optimism through RabbitHole's Quest Protocol. The post includes details on the team, competitors, metrics, and distribution plan. The proposal is positively received and there are no negative comments or criticisms.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Token economics",
                        "Interoperability and Scaleability",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.412889756639757
                },
                {
                    "author_link": "https://gov.optimism.io/u/CryptoKachu",
                    "index": "2",
                    "likes": "5",
                    "time": "02/03/2023-01:22:28",
                    "content": "I have read several articles from RabbitHole and I love the approach that RabbitHole is taking on airdrops. In addition to that, the iteration-based approach of RabbitHole, which takes inputs from previous iterations and modify the future iterations based on that, would perfectly match the Optimism’s road toward airdrop and Optimism quests. If you are interested, take a look at my post wrt analysis on the Optimism quest!    Optimism Quest Retrospect and Future Direction       Author:   CryptoKachu(katsu.philosophia@gmail.com, @CryptoKachu ) Robbie OH(robbie@philosophiavc.com, @robbie_philosophia )  Optimism Quest Retrospect  The Optimism Quest has recently ended and the level of optimism network activation demonstrated during the event was amazing. The daily transaction volume and user count showed that Optimism outperformed Arbitrum. It’s worth mentioning that the level of participation during the Quest was remarkable.  Specifically, projects that participated in th…     Besides, I have a question. Are there any specified plans or directions on how to design a daily quest on the protocols mentioned above (PoolTogether, Velodrome) and will the content of the quests be updated throughout the seven weeks? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.177083333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/ScaleWeb3",
                    "index": "3",
                    "likes": "2",
                    "time": "02/03/2023-07:08:52",
                    "content": "Big fans of Rabbithole. Ask & distribution seems reasonable for an easy to track incentive program  We hope to see a real user / learning journey for different protocols which goes above and beyond making people simply swap on a DEX or lend & borrow on a money market. The Mirror quests might help with that  Looking forward to a bit more details on daily tasks and potential iterations throughout the season. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.666666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/brian_rabbithole",
                    "index": "4",
                    "likes": "1",
                    "time": "04/03/2023-22:43:18",
                    "content": " Are there any specified plans or directions on how to design a daily quest on the protocols mentioned above (PoolTogether, Velodrome) and will the content of the quests be updated throughout the seven weeks?  We’ll definitely consider adjusting the content throughout the seven weeks if the community is interested. We want to make sure that we’re first and foremost driving growth and have a clear way to show progress, so wanted a little variability as possible in the seven week program.  We hope to see a real user / learning journey for different protocols which goes above and beyond making people simply swap on a DEX or lend & borrow on a money market. The Mirror quests might help with that   Defintiely! We’re quite limited by the protocols that exist on Optimism today, so if there are interesting use cases or protocols that aren’t DeFi or NFTs related, we would be happy to support those as well. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.688550420168067
                },
                {
                    "author_link": "https://gov.optimism.io/u/StoneColdSober",
                    "index": "5",
                    "likes": "2",
                    "time": "07/03/2023-06:56:24",
                    "content": "this is an effective way to lead people by the nose to explore and understand/familiarize themselves with various platforms/dApps that (I may) not otherwise have incentive to use. I say this having learnt about useful projects via similar ‘Quest’ walk throughs on both Optimism & Arbitrum Polygon Avalanche . Some of the dApps get bookmarked for future use. at the end of the day there are some very cool & useful dapps being built but there are a myriad of projects to sort through/discover/choose from : Gamifying that search & exposing people to the UI with a step by step quest instruction helps with marketing. speaking as a user ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.182142857142857
                },
                {
                    "author_link": "https://gov.optimism.io/u/katie",
                    "index": "6",
                    "likes": "2",
                    "time": "13/03/2023-19:40:23",
                    "content": "Hello and thank you for your proposal!  Throughout the application process, this forum thread will be one of the official means of communication. Please be sure to monitor it for updates over the course of the review period. At this stage, applications are mainly being reviewed for completeness, and nothing at this stage should be construed as support or opposition by any members of the Grants Council. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 6.666666666666666
                }
            ]
        }
    ],
    "group_index": "548"
}