{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/alpha-drops-growth-experiments-cycle-11/5591",
            "title": "Alpha Drops - Growth Experiments Cycle 11 ",
            "index": 5591,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Grants Council"
            ],
            "tags": [
                "cycle-11"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/aramz",
                    "index": "1",
                    "likes": "1",
                    "time": "13/03/2023-23:51:57",
                    "content": "Basic Details Project name: Alpha Drops Author name: Aram Barzani Email: aram.mebashar@gmail.com Telegram: arammebashar L2 recipient address: 0x21A02d86A23D1670153A98880CA2B2B79b6aC9d1 Which Voting Cycle are you applying for?: Cycle 11 I confirm that I have read the landing pages for the Builders and Growth Experiments Sub-Committees and that I have determined my proposal is best suited to be reviewed by the Growth Experiments Sub-Committee: [Yes/No]: Yes I understand that Growth Experiments grants are subject to a “no sale rule,” as explained in this post: Season 2 Grant Proposal Template, and I have read the terms of the rule: [Yes/No]: Yes Project Details What are you building?: Alpha Drops is not just a community of DeFi users - it’s a vibrant and growing community of early supporters in the world of Web3. We are passionate about connecting our community members with the latest and most exciting Web3 projects, providing free educational content, and fostering a collaborative and supportive environment for everyone involved. Our focus is on supporting early-stage Web3 projects, as we believe that these projects are the key to driving innovation in this rapidly evolving space. Since launching Alpha Drops in mid-2022, we have already made significant contributions to the Optimism ecosystem, and we are always looking for new ways to support the DeFi community, especially within the Optimism ecosystem. Why do you believe what you are building is going to succeed?: There are several reasons why I believe that Alpha Drops is poised for success. First, we have already built a strong and engaged community over the past 10 months, which shows that there is a real demand for the type of content and support that we are providing. We have also demonstrated our commitment to supporting early-stage Web3 projects by actively contributing to the Optimism ecosystem, which has earned us the respect and trust of many Web3 leaders and influencers. Additionally, we are constantly seeking feedback from our community members and working to improve the quality and relevance of our content, which means that we are constantly evolving and adapting to the changing needs of the Web3 landscape. Overall, I believe that Alpha Drops is well-positioned to continue growing and making a meaningful impact in the Web3 space for years to come. How many users does your project have currently? Please include how you arrived at this estimate: Our project currently has an estimated user base of: 41k followers on Twitter, with 1-3 million impressions per month 5k members on Telegram 5k members on Discord 2k monthly website visitors We arrived at this estimate by tracking the number of followers and members on our social media channels, as well as using website analytics tools to track our monthly website traffic. Please also note that these numbers may change as our community is growing very quickly and all through organic reach and engagement. How will receiving a grant enable you to further the mission of maximizing the number of users interacting with Optimism? Please include a step-by-step flow of how you imagine this grant can lead to a greater number of user interactions with Optimism: Receiving a grant would allow me to launch a campaign called Optimistic Weekend, which will focus on increasing knowledge awareness, knowledge, and user interactions with the Optimism network. The campaign will be implemented in the following steps:   Develop a comprehensive marketing plan: I have already brainstormed my plans for the Optimistic Weekend campaign, however, I will attempt to develop a well-planned strategy. This plan will include identifying the target audience, identifying the most appropriate communication channels, and developing appropriate marketing materials.   The Optimistic Weekend will be a series of weekly threads, blog posts, and monthly newsletters featuring protocols built on Optimism. To create more awareness and interest in Optimism, I will develop weekly threads and blog posts that will highlight the features of the platform. These threads and blog posts will cover different topics, including how to use the protocols, their benefits, the latest updates, and quests on Galxe with NFT rewards. To incentivize users to engage with Optimism, I will launch a Galxe quest campaign with NFT rewards that will be attached to the weekly blog posts and threads. The quests will be designed to educate users about the Optimism ecosystem while rewarding them with unique NFTs. This will create a fun and engaging way for users to interact with the platforms. Also, the NFTs will be used to reward the participants at the of each.   A special page on the Alpha Drops website - To maximize the reach of the campaign, and easy access to blog posts and materials, I’ll also promote the Optimistic Weekend campaign on the Alpha Drops website. Besides, I’ll also open a set of channels in our Discord server for this campaign.   In short, receiving the grant will enable me to launch the Optimistic Weekend campaign, which will include weekly threads, guides, and a Galxe campaign with NFT rewards, all designed to educate users and increase user interaction with Optimism. By implementing this campaign, I believe we can attract new users to the platform while creating a more engaging experience for current users. Tell us about the users you plan to target with this grant. Include any defining characteristics that will help you identify and target them.: Our community members primarily consist of DeFi users, but we are aiming to expand our reach and target a wider audience within this niche. Our target audience includes both newcomers to the Optimism ecosystem, as well as experienced users interested in utilizing Optimism and DeFi platforms. We aim to attract crypto traders, NFT enthusiasts, liquidity providers, etc. We will offer quests and content designed to benefit both new and experienced users, offering basic, intermediate, and advanced level tasks to suit a variety of skill levels. How would these users interact with Optimism? For how long?: As mentioned earlier, I’m planning to launch quests along with the blog posts as part of the “Optimistic Weekend” campaign. During this time, users will have the opportunity to explore the dApps built on Optimism, earn NFT rewards for their engagement, and earn OP tokens based on their activities and NFT acquired.I am developing a campaign that will last 16 weeks, divided into 4 distinct phases. Each phase will be comprised of 4 weeks. Provide us with links to any of the following for the project:  Website: alphadrops.net  Twitter: myAlphaDrops Discord/Discourse/Community: discord.gg/alphadrops Galxe: /alphadrops Link3: link3.to/alphadrops  Do you have any metrics on the project currently? (TVL, transactions, volume, unique addresses, etc. Optimism metrics preferred; please link to public sources such as Dune Analytics, etc.): We do not have any metrics specific to our project as we are a community and a library of early Web3 projects rather than a dApp. However, we are focused on promoting and supporting on-chain activities on other platforms within our community. Who are your competitors, and are they on Optimism?: There are many projects and individuals focusing on early projects though we don’t find them as competitors but complementary projects. Of the most popular ones, I can name Olimpio (earndrop) and Bankless which are not competitors but rather great resources for Web3 enthusiasts. Please link to code audits (if any): Team Who are your founders?: Aram, Twitter: aramzcrypto What makes your team well-suited to carry out the project described in this proposal? Our team is well-suited to carry out this project for several reasons. Firstly, we have a strong track record of conducting rigorous research, with team members who have experience designing and implementing studies in a variety of contexts. Secondly, we work well together and have a proven ability to collaborate effectively, which will be critical for coordinating with other projects and stakeholders. Finally, we have a range of complementary skills that will allow us to run successful campaigns and achieve the desired outcomes of the project. Overall, we are confident that our team has the expertise and experience needed to carry out this project successfully. Is this your first Web3 project?: Yes, this is our first project that solely focuses on Web3. If not, what else have you built? (Share links, Github repository, or any other useful information.): Grant Request What is the size of the grant request? (250k OP max): 40,000 OP How do you justify the size of the grant?: I believe the grant size is reasonable as we already have an active and large community that is interested in DeFi and especially Layer 2 networks which will be very helpful in adding value and contributing to the Optimism ecosystem. Roadmap and Distribution Plan Describe in discrete steps how you will successfully implement your grant plan: As mentioned earlier in this proposal, the campaign will be divided into four phases, each consisting of 4 weeks, and one or more platforms introduced per each week. We aim to start the campaign as soon as the proposal is approved with the following action steps:  Collaborations and partnerships Content creation and marketing materials Setting up campaigns on Galxe and attaching them with our content Snapshot and reward calculations Rewards distibution  How will the OP tokens be distributed? (please include % allocated to different initiatives such as user rewards/marketing/liquidity mining. Please also include a justification as to why each of these initiatives align with the problem statement this proposal is solving. Distribution should not include the sale of any tokens by the grantee or the use of tokens for compensation, protocol expenses, etc.: The plan is to allocate 100% of the OP tokens to the community, 10,000 OP tokens per phase and to be given at the end of each phase (25% per phase). The rewards will be based on user activities that will be calculated based on the NFTs collected on Galxe as the following: Allocation equation: 10,000 OP / total number of NFTs collected = OP tokens per NFT * number of NFTs collected per wallet = allocation per wallet Supposing that 5k NFTs are collected in total during the first phase, therefore, 2 OP will be allocated per NFT. Over what period of time will the tokens be distributed for each initiative?: The tokens will be distributed within two weeks after each phase. Please provide benchmark milestones for this project. These milestones should guide the Optimism community on the progress of your project throughout your work on the project. Do not use distribution of the grant itself as a milestone: The campaign is divided into four phases and each phase is a milestone where a minimum of 4 projects and on-chain quests are introduced. Milestone #1 - 25%: End of Phase 1 Milestone #2 - 25%: End of Phase 2 Milestone #3 - 25%: End of Phase 3 Milestone #4 - 25%: End of Phase 4 Please define critical milestones for this project. Critical milestones are meant to show good-faith efforts to accomplish the project. Non-completion of these milestones could lead to revocation of remaining grant rewards. Do not use distribution of the grant itself as a milestone: All the four milestones mentioned earlier are critical. If the OP tokens are for direct distribution to users, why will incentivized users and liquidity on Optimism remain after incentives dry up?: Undoubtly, there will be users who only look for the rewards and will withdraw their assets from the partner protocols after receiving the incentives, though the Optimistic Weekend campaign aims to help users to discover and learn about opportunities and DeFi protocols in the Optimism ecosystem. Please provide any additional information that will facilitate accountability (smart contracts addresses relevant to the proposal, relevant organizational wallet addresses, etc.): Not applicable Optimism Relationship Does your project solve a problem for the Optimism ecosystem? If so how?: Yes, our project aims to solve a problem for the Optimism ecosystem by promoting knowledge about DeFi protocols to a broader community. Currently, the Optimism ecosystem has a strong and active community, but we believe that there are still many people who are unfamiliar with the benefits and opportunities that decentralized finance can offer. By educating more people about DeFi on the Optimism network, we can help grow the community and attract more users and developers to the platform. One specific problem that our project addresses is the lack of accessible and user-friendly resources for learning about DeFi on Optimism. Though, there are communities that try to address this, I believe there’s room for more improvements. Many people may be interested in using DeFi apps, but they may find it difficult to navigate the complex and broad world of DeFi apps. We aim to provide clear and concise explanations of how DeFi works on Optimism, as well as tutorials and guides for using specific applications and protocols. Why will this solution be a source of growth for the Optimism ecosystem?: Promoting knowledge about DeFi on the Optimism ecosystem can be a source of growth for the platform by attracting more users and developers, increasing adoption of DeFi protocols, addressing the issue of low awareness, fostering a more diverse and inclusive community, and creating opportunities for innovation and development. Is your project Optimism Native?: Our project is not on a smart contract, however, our community is interested in L2 networks, and we are somehow already involved in the Optimism ecosystem. Confirmations I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: [Yes/No]: Yes I understand that I will be expected to following the public grant reporting requirements outlined here: https://gov.optimism.io/t/suggested-public-reporting-requirements-for-grantees/4176: [Yes/No]: Yes ",
                    "links": [
                        "https://gov.optimism.io/t/suggested-public-reporting-requirements-for-grantees/4176:"
                    ],
                    "GPT-summary": "The post is a grant proposal for a project called Alpha Drops, which aims to promote knowledge about DeFi protocols to a broader community. The proposal explains the project's mission, target audience, and how it plans to achieve its goals. The post also includes details about the grant request, distribution plan, and milestones. The proposal may receive constructive criticism or questions from third parties, and the author is advertising the project to the Optimism ecosystem.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Interoperability and Scaleability"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal",
                        "None"
                    ],
                    "Sentiment": 5.892205332546242
                },
                {
                    "author_link": "https://gov.optimism.io/u/FractalVisions",
                    "index": "2",
                    "likes": "1",
                    "time": "14/03/2023-13:31:42",
                    "content": "Do you have any metrics available for your project in the form of Dune analytics to see what type of on chain activity your users have already? I see a few things may be missing from the application like competitors. I also see one of your competitors Galxe is involved with the process of the token distribution. OP token is not available for token rewards on Galxe platform. There is also no way to filter for sybil attacks on this platform so is there any sort of plan on how that will be handled? I see the token rewards distribution would not actually take place through the alpha drops app. Why is this ? Instead it says you will use Galxe so I am a bit confused as to why you would submit a grant only to distribute tokens from a competitors platform which is not yet compatible with OP token distribution. It would be nice to see this proposal focused on your platform for the token distribution if there is a strong user base already. How is alpha drops any different from existing platforms like galxe, quest3, layer3, or crew3 ? Also I see alpha drops has a paid mint to be part of the platform or receive access to the launch pad system. So this is not a free application or membership correct? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author is advertising proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.763888888888888
                },
                {
                    "author_link": "https://gov.optimism.io/u/aramz",
                    "index": "3",
                    "likes": "1",
                    "time": "14/03/2023-17:37:56",
                    "content": "To make it clear, Alpha Drops is not an app like Galxe or Quest3 but a community that focuses on early projects. To simplify the proposal, we are aiming to create educational and introductory content posted as blog posts + Twitter threads about the projects built on Optimism. Each blog post comes with some on-chain quests. I’m planning to run the on-chain quests and NFT rewards on Galxe. and there are ways to minimize Sybil attacks like making Galxe Passport a requirement for claiming the NFTs. However, I’m flexible to use other apps to distribute the NFTs or SBTs, and I will use these NFTs/SBTs to determine reward allocation per wallet. The purpose of the proposal is to educate users on DeFi strategies and using the platforms built on Optimism. Something similar to the Optimism Quests but run by a Web3 community and with a main difference which is the educational and promotional content. Regarding the Alpha Pass NFT, it’s a membership NFT for other purposes. Our community is 100% free for everyone. We discuss early DeFi, NFTs, and gaming projects. The holders of the Alpha Pass NFT will receive some exclusive content though most of the content will be available for free. I also have to mention that the Alpha Pass NFT is not related to this proposal. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.863095238095238
                },
                {
                    "author_link": "https://gov.optimism.io/u/FractalVisions",
                    "index": "4",
                    "likes": "1",
                    "time": "14/03/2023-18:04:20",
                    "content": "I agree that the galxe passport would help with sybil attacks as it requires KYC for approval. The tokens would need to be distributed through a 3rd party application which is okay. Hopefully  Galxe will provide services for $OP token distribution in the near future. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/aramz",
                    "index": "5",
                    "likes": "1",
                    "time": "14/03/2023-18:06:47",
                    "content": "Thank you for your comments. I will use Galxe for the quests and a third-party app for token distribution. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/MoneyManDoug",
                    "index": "6",
                    "likes": "2",
                    "time": "15/03/2023-15:51:54",
                    "content": "Hey this is Doug from the growth council, throughout the application process, this forum thread will be one of the official means of communication. Please be sure to monitor it for updates over the course of the review period. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.5
                }
            ]
        }
    ],
    "group_index": "604"
}