{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/proposal-for-a-governance-structure/2977",
            "title": "Proposal for a governance structure ",
            "index": 2977,
            "category": [
                "\\xf0\\x9f\\x8f\\x9b Governance",
                "Metagovernance"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/hank",
                    "index": "1",
                    "likes": "2",
                    "time": "14/07/2022-18:19:21",
                    "content": "The forum of Optimism need to be the backbone of our governance. The forum will be a place to share proposals, bounce ideas, rank proposals and promote engaged members to suiting roles. Different roles that are needed are a treasury, voters and proposal promoters. The goal should be too automate as many tasks as possible to make pay for work efficient. What do we want? We want to grow OP as much as possible with the least possible resistance. That’s why we should create different groups and the most important one is the workers/builders. Builders are incentivized to build and improve OP because they are paid. It is very important to pay the right amount of OP to the right builders and that’s we’re the voter comes in. The voters task is to make the final decision on who’s getting founds and who’s not. How do we build a system were voters are incentivized to do real work and diligence to vote and vote the right way? The voters should earn tokens from voting and could earn even more if they spend less OP, but still manage to create growth. This is an example I came up with. Op should have issuance of tokens every month, based on user growth.  Set in stone should be that 10% goes to the voters and 90% should be distributed by the voters to build the platform. So if  voters, voted on proposals that gives OP more users and growth, the voter will earn more OP tokens. We want to make sure  that the voters really care about how they vote. So we should reward the voter for each vote they make and according to the amount of OP tokens they are voting with. If voters only distribute half of OP tokens from that month, the rest will be vested for a year, after that year the system should decide what to do with tokens. If OP network has grown with users and activity the tokens should be released, 90% added to that months natural issuance and 10% should be airdropped to the voters that voted on that months proposals. Voters are rewarded for each vote they make and according to the amount of OP tokens they are voting with. If the Network activity decreased over that period all the vested tokens will be burned. This will make the voter incentivized to vote in what is right for OP because they will gain directly from growing the network as efficiently  as possible. The voter can show their commitment to OP by locking  their tokens in stake for 1 year, 6 month or 3 month. By locking you will receive more weight in the vote and earn more of the voter reward. This will reward the most committed participant. Proposal promoters role is to filter and fine tune proposals. The forum should be there to lift proposals and ideas and the most active and liked posters on the forum will get the rank proposal promoters. The title will last 1 month, a voting period and a salary will be paid out. If 100% of the OP issuance  are voted on to be used, the promoter will be paid a full salary. The  promoters  salary is  based on the % of OP that are used that month. If 75% is used salary is 75% if 25% is used salary is 25% of max salary. If 0% are passed salary will be 0% and the promoters will be inalienable for next month’s promotion to proposal promotor. The base salary of the promoters will be based upon the growth of OP as ecosystem. The voter and the Promoter will work in symbiosis were voter are driven to spend as little OP as possible, but at same time grow the ecosystem. The promoters are driven to make the voter spend al OP of that period, and also grow the ecosystem because of their re base pay. ",
                    "links": [
                        "https://gov.optimism.io/t/draft-s02-committee-proposal-decentralized-finance-governance-committee/3286/14"
                    ],
                    "GPT-summary": "The author of the post is explaining a proposal for a governance structure for the Optimism forum. The proposal includes different roles such as treasury, voters, and proposal promoters, and suggests incentivizing voters to make the right decisions by rewarding them with tokens. The post also invites feedback and questions from third parties and suggests collaboration on the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.4972619047619045
                },
                {
                    "author_link": "https://gov.optimism.io/u/hank",
                    "index": "2",
                    "likes": "2",
                    "time": "14/07/2022-19:23:48",
                    "content": "A voters history should also be visible, a top list of best voters. How to measure the performance of voters? The voter that gets the most of OP in relation to the amount of OP staked, the total % of possible earnings as a voter. This list makes it easy for people who wants to delegate their stake to a voter with the best voting performance. The voter that is a delegate should be able to charge a % for managing a persons stake. This makes it easier for a person to work as a delegate. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 7.296296296296296
                },
                {
                    "author_link": "https://gov.optimism.io/u/katie",
                    "index": "3",
                    "likes": "5",
                    "time": "14/07/2022-19:33:30",
                    "content": "I imagine a governance dashboard is in the works.  Once this is place, delegates can be measured on their voter participation and any other metrics the community feels appropriate such as communication, amount of tokens delegated, etc.  I would be happy to help create a governance structure! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party offering to collaborate on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.71875
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "4",
                    "likes": "3",
                    "time": "14/07/2022-20:07:03",
                    "content": "this sounds great! happy to plug in so will be paying attention. will think about other possible things to track ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.09375
                },
                {
                    "author_link": "https://gov.optimism.io/u/hank",
                    "index": "5",
                    "likes": "2",
                    "time": "14/07/2022-20:11:41",
                    "content": "I love being a part of creating the modern governance, a place where voters are inline with the growth of the system. I feel like the first thing i should do is to express my thoughts about it, be part of the conversation. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party giving positive feedback on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.583333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "6",
                    "likes": "2",
                    "time": "16/07/2022-19:41:45",
                    "content": "to be clear, by the way, i’m ambivalent about this proposal as written. not to overuse the term but i think there ought to be a discussion from first principles on growing the base of active voters and engaged delegates, and there are a lot of loose ends that can occur from, e.g., outright paying for participation but i’m certainly interested in maintaining a dashboard and having this discussion on gov structure ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.6581196581196584
                },
                {
                    "author_link": "https://gov.optimism.io/u/hank",
                    "index": "7",
                    "likes": "2",
                    "time": "16/07/2022-21:14:07",
                    "content": "Yes i agree ambivalent nature of the proposal. But i have not come up with a better solution for the problem about voting. To do a good job as a voter you need to dedicate a lot of time to research proposals, preferably like a full time job. If we want to decentralize the voting process, so everyone with the will and skill can become a voter, and dedicate their life to it. We need to monetize that role so people can free up enough time and dedication to do a good job. What do you think about that? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 7.208333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/diligit",
                    "index": "8",
                    "likes": "2",
                    "time": "27/08/2022-14:19:49",
                    "content": "I don’t like the idea, I want everyone to get involved and contribute without direct financial benefit, now the whole ecosystem is incentivized, and I would like to see more people who will get involved and contribute without rewards, at least in governance. Regarding voting and governance, we have delegates doing the hardest part of the governance process, analysing and working on proposals, now we will have committees, so every voting participant will be able to see a constructive analysis from the committees, and it’s just a matter of voting. Also each voter votes on which projects will receive grants that will then be allocated to users, i.e. each voter will be able to get rewards by getting involved in the projects they voted for, and the projects that will distribute rewards. At the moment the circle is complete, impact=profit. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/diligit",
                    "index": "9",
                    "likes": "2",
                    "time": "27/08/2022-14:26:19",
                    "content": "    hank:  How do we build a system were voters are incentivized to do real work and diligence to vote and vote the right way?   “right way”? Now voting participants don’t vote correctly because they don’t get rewards?     hank:  The voters should earn tokens from voting and could earn even more if they spend less OP, but still manage to create growth.   Voters can receive rewards if they get involved and contribute to the projects they voted for. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.023809523809524
                },
                {
                    "author_link": "https://gov.optimism.io/u/diligit",
                    "index": "10",
                    "likes": "0",
                    "time": "27/08/2022-14:30:54",
                    "content": "    hank:  Proposal promoters role is to filter and fine tune proposals.   But what will delegates do? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.083333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/hank",
                    "index": "11",
                    "likes": "0",
                    "time": "27/08/2022-19:13:54",
                    "content": "Thank you for taking part in the discussion. I agree with you on all this. I just think that it would be better if growth of Optimism have an even more direct feedback loop to the voter. The risk i see with committees is that you centralize the decisions more, but i also see a great value of getting insight and perspective from the great minds of the game. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/hank",
                    "index": "12",
                    "likes": "1",
                    "time": "27/08/2022-19:26:16",
                    "content": "    diligit:  “right way”? Now voting participants don’t vote correctly because they don’t get rewards?   They can vote the right way. The point is to incentivize a person so they can work full time as a voter. If a person can dedicate their life to the process, the process will improve. For sure people can do it now, i would just like a more direct and clear path to the correct vote.     diligit:  Voters can receive rewards if they get involved and contribute to the projects they voted for.       diligit:  Voters can receive rewards if they get involved and contribute to the projects they voted for.   I agree again. My point is just to create a more direct and a way to measure success a voter within the system itself. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.51984126984127
                },
                {
                    "author_link": "https://gov.optimism.io/u/hank",
                    "index": "13",
                    "likes": "1",
                    "time": "27/08/2022-19:37:43",
                    "content": "    diligit:  But what will delegates do?   Delegates vote Proposal promoters role is more like the suggested committees  role, just a lite bit more decentralized. In our forum only citizens  should be allowed to post. The most active citizens of Optimism with the most liked and engaged posts should be offered a term as a proposal promoter. There role is to make sure that all OP issued should be spent. This is to incentivize them to lift and promote the best ideas to get funding. So the voters/delegates is like yin and the promoter is like yang, every were a balance is needed. Thats why we keep on seeing yin and yang repeatedly in nature. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.933333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/diligit",
                    "index": "14",
                    "likes": "1",
                    "time": "27/08/2022-20:39:57",
                    "content": "    hank:  The point is to incentivize a person so they can work full time as a voter. If a person can dedicate their life to the process, the process will improve.   You are proposing the creation of a new entity that will receive a “lifetime” salary from the OP for the work that delegates do now.     hank:  i would just like a more direct and clear path to the correct vote.   What is not clear and correct in the current governance process?     hank:  Proposal promoters role is more like the suggested committees role, just a lite bit more decentralized.   What makes it more decentralised?     hank:  The most active citizens of Optimism with the most liked and engaged posts should be offered a term as a proposal promoter.   30 accounts can be created that will appreciate each other, so they will occupy all positions, and governance will be compromised.     hank:  Delegates vote   Delegates will just vote… then why people will delegate tokens, now people delegate tokens to delegates because delegates have experience, knowledge, do an expertise, analyze proposals, improve proposals. If the delegates are just going to vote, and they don’t get involved in the process, and they don’t do everything they do now, there is no sense in delegating.     hank:  So the voters/delegates is like yin and the promoter is like yang, every were a balance is needed. Thats why we keep on seeing yin and yang repeatedly in nature.   Yin & Yang is balance in a person, balance in delegates’ work, analysis-improve/vote. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.326010101010101
                },
                {
                    "author_link": "https://gov.optimism.io/u/hank",
                    "index": "15",
                    "likes": "1",
                    "time": "28/08/2022-04:46:47",
                    "content": "    diligit:  You are proposing the creation of a new entity that will receive a “lifetime” salary from the OP for the work that delegates do now.   No, you first need to stake OP and then vote. If you don’t have a stake in the network and don’t vote you will not get a reward.     diligit:  What is not clear and correct in the current governance process?   The direct effects of the network growth now and in the coming year. And again I’m  not saying its “not” clear i say “more” clear path.     diligit:  What makes it more decentralised?   The more things you can automate the better it is. This is an automated process that promotes a citizen to the role, based on the criteria mentioned. If you do not perform in the measured areas the person will be ineligible for next period.     diligit:  30 accounts can be created that will appreciate each other, so they will occupy all positions, and governance will be compromised.   If we do not figure out a way if identifying our citizens no democratic process is possible. I would suggest some kind of KYC.     diligit:  Delegates will just vote… then why people will delegate tokens, now people delegate tokens to delegates because delegates have experience, knowledge, do an expertise, analyze proposals, improve proposals. If the delegates are just going to vote, and they don’t get involved in the process, and they don’t do everything they do now, there is no sense in delegating.   To me voting  means  to have experience, knowledge, do an expertise, analyze proposals, improve proposals. Otherwise you are just a wasted vote. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.803787878787878
                },
                {
                    "author_link": "https://gov.optimism.io/u/diligit",
                    "index": "16",
                    "likes": "0",
                    "time": "28/08/2022-08:19:20",
                    "content": "    hank:  No, you first need to stake OP and then vote. If you don’t have a stake in the network and don’t vote you will not get a reward.   Where to stake?     hank:  The direct effects of the network growth now and in the coming year.   In a year’s time the eosystem will be much bigger and more balanced, governance is not yet complete, Citizens House will be formed, and retroPGF will be launched.     hank:  The more things you can automate the better it is. This is an automated process that promotes a citizen to the role, based on the criteria mentioned.   You mean:     hank:  The forum should be there to lift proposals and ideas and the most active and liked posters on the forum will get the rank proposal promoters. The title will last 1 month, a voting period and a salary will be paid out. If 100% of the OP issuance are voted on to be used, the promoter will be paid a full salary.   This is not an automatic process, nor is it decentralised.     hank:  To me voting means to have experience, knowledge, do an expertise, analyze proposals, improve proposals.   Yes, but you said that the promoters will do all this and the delegates will just vote.)     hank:  Delegates vote   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.769345238095238
                },
                {
                    "author_link": "https://gov.optimism.io/u/diligit",
                    "index": "17",
                    "likes": "0",
                    "time": "28/08/2022-08:25:58",
                    "content": "Finally, you have taken some familiar OP governance terms, changed them around, offered new roles, and proposed this as a new governance structure. And the ‘promoter’ role completely devalues the delegates.     hank:  90% added to that months natural issuance and 10% should be airdropped to the voters that voted on that months proposals       hank:  So we should reward the voter for each vote they make and according to the amount of OP tokens they are voting with.       hank:  The voters should earn tokens from voting and could earn even more if they spend less OP       hank:  The promoters salary is based on the % of OP that are used that month. If 75% is used salary is 75% if 25% is used salary is 25% of max salary.   Regarding the financial benefits, with such a % it will be more advantageous to vote than to engage and contribute to the ecosystem. You can’t offer such a %, it will lead to a mathematical, financial, and social error. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.571464646464647
                },
                {
                    "author_link": "https://gov.optimism.io/u/hank",
                    "index": "18",
                    "likes": "1",
                    "time": "28/08/2022-18:04:00",
                    "content": "    diligit:  Finally, you have taken some familiar OP governance terms, changed them around, offered new roles, and proposed this as a new governance structure. And the ‘promoter’ role completely devalues the delegates.   Why?  The promoter is less important to the system and the voters/delegates gets more of the OP issuance. If i give you an example, the committee is now paid 20 k usd equivalent in OP for 3 months of work there is supposed to be 4 committee’s. So if we just use the OP that is suggested to be used on committees, we can pay 1,3 k per month to 20 promoters with same cost as now planed. I don’t  understand why delegates are undermined they are in a way the bosses of the promoters. If the voters/delegates don’t  like the ideas of the promoters they get a pay cut. If a promoter performs bad enough they get blocked from next month promoter position.     diligit:  Regarding the financial benefits, with such a % it will be more advantageous to vote than to engage and contribute to the ecosystem. You can’t offer such a %, it will lead to a mathematical, financial, and social error.   This is just a hypothetical %. Much more calculations needs to be performed to get more exact numbers. What suggestions would you have about improving the proposal? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.582816804407713
                },
                {
                    "author_link": "https://gov.optimism.io/u/hank",
                    "index": "19",
                    "likes": "0",
                    "time": "28/08/2022-18:11:29",
                    "content": "    diligit:  Where to stake?   That needs to be built. But check out https://app.velodrome.finance/ They have a good example of how its done.     diligit:  In a year’s time the eosystem will be much bigger and more balanced, governance is not yet complete, Citizens House will be formed, and retroPGF will be launched.   Amazing, looking so much forward to everyday of this experiment.     diligit:  This is not an automatic process, nor is it decentralised.   Not now but i can be programmed to be.     diligit:  Yes, but you said that the promoters will do all this and the delegates will just vote.)   Just vote? According to me voting is a much overlooked process and a big reason why the world looks like it does today. I want to improve the value of the voters/delegates with these ideas. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.166666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/diligit",
                    "index": "20",
                    "likes": "2",
                    "time": "28/08/2022-18:35:14",
                    "content": "    hank:  Why? The promoter is less important to the system and the voters/delegates gets more of the OP issuance. If i give you an example, the committee is now paid 20 k usd equivalent in OP for 3 months of work there is supposed to be 4 committee’s. So if we just use the OP that is suggested to be used on committees, we can pay 1,3 k per month to 20 promoters with same cost as now planed.   You just want to hire 20 people where there is no need.     hank:  I don’t understand why delegates are undermined they are in a way the bosses of the promoters. If the voters/delegates don’t like the ideas of the promoters they get a pay cut. If a promoter performs bad enough they get blocked from next month promoter position.   “bosses”))) Governance that is based on equality has more positive effects, any hierarchy has a negative effect in the end.     hank:  That needs to be built.   You want to create another project for this governance structure, maybe you create a project and implement this governance structure.     hank:  we can pay 1,3 k per month to 20 promoters with same cost as now planed.   What qualifications and knowledge must this promoter have to agree to work full time for 1.3k     hank:  Not now but i can be programmed to be.   Again you have to build something to give salary to 20 people, a complication that is unnecessary and has no advantages.     hank:  This is just a hypothetical %. Much more calculations needs to be performed to get more exact numbers. What suggestions would you have about improving the proposal?   I don’t support this proposal, it just complicates the governance process, and has no benefit to the ecosystem, the main purpose of this proposal is to hire 20 people (promoters) the need is not there, and that devalues delegates. And another purpose is excessive rewards for governance participants, it will be time for delegates and other voting participants to be rewarded, probably after the retroPGF launch. This governance structure for Token House is not necessary, and certainly no secretaries and bosses are needed. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.320269016697589
                },
                {
                    "author_link": "https://gov.optimism.io/u/diligit",
                    "index": "21",
                    "likes": "0",
                    "time": "28/08/2022-18:56:42",
                    "content": "    hank:  This is just a hypothetical %. Much more calculations needs to be performed to get more exact numbers.   I have created a mathematical model for a bank lending/borrowing system, and I have created a mathematical index model for a fund, and I can tell you that such a mathematical reward model is not effective. Example: an investor participates in governance with 50-100M, the rewards provided to the voting participants will exceed the value of the grants allocated to the ecosystem, what effect will this governance have on the ecosystem? And there are several entities that in the future will participate in governance: investors, projects, DEVs, institutional investors, I don’t know now these entities will delegate tokens to current delegates, or will participate directly in voting but for sure in the future there will be more entities in governance. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.683333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/hank",
                    "index": "22",
                    "likes": "1",
                    "time": "28/08/2022-19:19:30",
                    "content": "    diligit:  You just want to hire 20 people where there is no need.   So you are against this then?  Introducing Governance Committees - #37 by Seyed     diligit:  “bosses”))) Governance that is based on equality has more positive effects, any hierarchy has a negative effect in the end.   I would argue that this is a positive effect. Everything in life is just a trade of services and its very good to get the right feedback on your services, so you can improve them.     diligit:  You want to create another project for this governance structure, maybe you create a project and implement this governance structure.   Ya maybe that turns out to be the best idea. Im just sharing my thoughts about something i think is suitable for this project.     diligit:  What qualifications and knowledge must this promoter have to agree to work full time for 1.3k   I don’t  think this is a full time job. A small part time job. We are writing now in the forum just because we like it. Read this proposal Introducing Governance Committees - #37 by Seyed In there they describe this exakt payment amount for the new committees, 4 groups with 5 members each 20k for each group for 3 month work. No one is complaining about this pay being too little. How much do you think they should get paid? [quote=“diligit, post:20, topic:2977”] I don’t support this proposal, it just complicates the governance process, and has no benefit to the ecosystem, the main purpose of this proposal is to hire 20 people (promoters) the need is not there, and that devalues delegates. And another purpose is excessive rewards for governance participants, it will be time for delegates and other voting participants to be rewarded, probably after the retroPGF launch. This governance structure for Token House is not necessary, and certainly no secretaries and bosses are needed. [/quote] and Why does it devalue delegates? It’s  about giving delegates  higher  value.  I would say that this system values Builders highest and delegates right after. Delegates would be able to monetize  their work by charging the delegators a fee for there’s  work. Im even suggesting a top list of delegates so delegators will be able to choose more easy.     hank:  A voters history should also be visible, a top list of best voters. How to measure the performance of voters? The voter that gets the most of OP in relation to the amount of OP staked, the total % of possible earnings as a voter. This list makes it easy for people who wants to delegate their stake to a voter with the best voting performance. The voter that is a delegate should be able to charge a % for managing a persons stake. This makes it easier for a person to work as a delegate.   ",
                    "links": [
                        "https://gov.optimism.io/t/introducing-governance-committees/3238/37"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.540861162646877
                },
                {
                    "author_link": "https://gov.optimism.io/u/diligit",
                    "index": "23",
                    "likes": "0",
                    "time": "28/08/2022-19:41:43",
                    "content": "    hank:  So you are against this then? Introducing Governance Committees - #37 by Seyed   Who is Seyed?     hank:  I don’t think this is a full time job. A small part time job.   But you said:     hank:  The point is to incentivize a person so they can work full time as a voter. If a person can dedicate their life to the process, the process will improve.   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/diligit",
                    "index": "24",
                    "likes": "0",
                    "time": "28/08/2022-19:48:58",
                    "content": "    hank:  In there they describe this exakt payment amount for the new committees, 4 groups with 5 members each 20k for each group for 3 month work. No one is complaining about this pay being too little.   Exactly, that’s the value of delegates, they do the hard work of analysing and improving proposals, and if there will be “promoters”, the value of delegates is lost.     hank:  How much do you think they should get paid?   I don’t have any proposals regarding rewards, and I don’t want to assess the financial value of the delegates’ work. 20k and rewards at the end of the season is set now, it is possible that this amount will be reassessed after season 2, also delegates can make a proposal in this regard. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0765692640692635
                },
                {
                    "author_link": "https://gov.optimism.io/u/diligit",
                    "index": "25",
                    "likes": "2",
                    "time": "28/08/2022-19:57:09",
                    "content": "    hank:  Im just sharing my thoughts about something i think is suitable for this project.   I like new ideas, but I also like the idea of contributing without set rewards, so any reward is a surprise. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.715909090909092
                },
                {
                    "author_link": "https://gov.optimism.io/u/hank",
                    "index": "26",
                    "likes": "1",
                    "time": "30/08/2022-19:11:37",
                    "content": "    diligit:  But you said:   Thats a voter/delegate should be able to work with this full time. A proposal promoter not.     diligit:  Exactly, that’s the value of delegates, they do the hard work of analysing and improving proposals, and if there will be “promoters”, the value of delegates is lost.   The Delegates and committees are not necessary the same thing. Delegate vote for people that do not have time or care to vote themselves. Committee’s  are four groups  with five members in each  group. These groups are voted in by delegates and single voters to do research and state benefits and drawbacks with a proposal.     diligit:  I like new ideas, but I also like the idea of contributing without set rewards, so any reward is a surprise.   Contributing without set rewards means uncertainty. I would argue for the good of certainty. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.8740379990379985
                }
            ]
        }
    ],
    "group_index": "159"
}