{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/draft-upgrade-proposal-bedrock/5014",
            "title": "[DRAFT] Upgrade Proposal: Bedrock ",
            "index": 5014,
            "category": [
                "\\xf0\\x9f\\x93\\x83Other Proposals",
                "Protocol Upgrade"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/ben-chain",
                    "index": "1",
                    "likes": "139",
                    "time": "01/02/2023-20:59:03",
                    "content": " Executive Summary   In short, what is this upgrade proposal? Impacted stakeholders & expected outcomes Why the Collective should upgrade  The Optimism Foundation is proud to propose the first protocol upgrade to the Optimism Collective: Bedrock. The Bedrock release of the OP Stack represents the culmination of years of research and development by the Ethereum scaling community and is a complete rewrite of the core components of the Optimism architecture. This upgrade offers a new level of modularity, simplicity, and Ethereum equivalence for Layer 2 solutions, providing unprecedented performance and functionality. Most users will not be impacted by the upgrade as the current mainnet is already EVM-equivalent. Users and projects that run both full and archive nodes, make use of deposits and withdrawals, and make assumptions about the block time on Optimism Mainnet will need to take action to prepare for the upgrade. To help ensure a smooth transition, a thorough changelog and stakeholder-specific requirements can be found below. In addition to these technical improvements, the Bedrock upgrade is a significant step towards the multi-chain future. By creating a shared standard, the OP Stack, Bedrock sets the stage for a Cambrian explosion of aligned L2s. This is an opportunity for leadership in the Ethereum ecosystem. We are confident that the post-Bedrock experience will be a positive change for developers in the Optimism ecosystem and have received consistent excitement for the upgrade from our partners.  We are committed to making this upgrade a success and are eager to see the results in the months and years to come.  Technical Summary   Overview of architectural changes Link to all protocol/API/tech specifications Overview of ongoing security considerations incl. all audits and findings  At the highest level, the Bedrock release implements a modular architecture, separating the OP Stack into 3 components: consensus, execution, and settlement.  These designs borrow heavily from the Engine API introduced for the Merge, and, as a result, an Ethereum execution client can be converted into an Optimism execution client in <2,000 lines of code. This is a huge win, paving the way for a multi-client future, and allowing for maximal use of Ethereum’s battle-tested code. Technical documentation for Bedrock is split into 3 main parts:   An explainer detailing Bedrock and its major architectural choices.  Protocol specifications for all major components of the codebase.  Developer documentation for those using any APIs affected by the release.  Additionally, a summary of the security measures and considerations for Bedrock can be found in this blog post by OP Labs, which includes links to security audits and testing measures.  Notably, the Bedrock release introduces a 2-phase withdrawal process, doubling down on bridge security, which proved to be a primary risk factor for chains in 2022. There is also a community security contest currently live. This program provides strong incentives for high-severity bugs, so it’s possible that the program uncovers new findings. Results will be known on February 6, before any voting starts.  Impact Summary   Changes in performance characteristics Time-of-upgrade considerations (downtime, etc) Links to exhaustive upgrade documentation for impacted stakeholders  The Bedrock release enables performance improvements across the board, including transaction costs, throughput characteristics, and sync speeds.  A detailed list of performance metrics for the release will be published by next week, with a link updated here when ready. We estimate that the upgrade to Bedrock will take <4 hours. Unlike previous upgrades to Optimism, this release will not require a “regenesis,” and historic chain data will still be accessible after the upgrade.  As such, little action is required from end-users of Optimism other than being aware of that timing, during which deposits and transactions will be paused. While the upgrade strictly improves on EVM equivalence, some application developers may be affected. While we have been in active touch with major partners, the developer community has also been actively notified over the past few months in 1:many communications. We maintain the following documentation pages for impacted developers:  A guide by persona on what most developers need to prepare for the upgrade. A guide specifically for node operators, which are impacted most by the upgrade. A general FAQ page for the upgrade.   Action Plan   Mainnet Upgrade Timing Contingency plans in case of last-minute bugs or issues Plan for communication and education to the community  If this vote passes, the Bedrock upgrade will be scheduled for execution 2 weeks after the vote passes, on March 15, at 9:00 AM PST. The upgrade overview documentation page describes mechanically how the upgrade will be executed if approved by the Token House, and the code here implements the migration logic from the old chain to Bedrock. Optimism’s Goerli testnet has already been successfully upgraded, with major partners following suit, without significant setbacks. However, in the event that substantial new information comes to light between a successful vote and execution of the upgrade, this proposal includes two fallback scenarios:  In the event that a specific application has not prepared for the upgrade, and doing so would pose significant risk of end-users being negatively misled, then we will delay the execution of the upgrade by approximately 1-2 weeks in order to provide additional preparation time. In the event that a significant, new security risk is discovered, we may cancel the upgrade, requiring a new vote once the community has had time to react.  The Optimism Foundation and OP Labs will continue public communication efforts around the upgrade, including public communications and tweets reminding stakeholders of the upgrade in the weeks, days, and hours leading up to the upgrade.  Conclusion  This proposal outlines the Optimism Collective’s first Protocol upgrade of Optimism Mainnet to the Bedrock release. This upgrade aims to provide unprecedented modularity, simplicity, and Ethereum equivalence to the L2 network, with positive impacts on performance and security. Bedrock is the codebase which will help Optimism stand the test of time, and is also preparatory step towards the multi-chain future. We expect the upgrade will take around 4 hours, with no loss of historical data. Detailed technical specifications and impact summaries are available for the upgrade. We strongly believe that the Collective should upgrade Optimism Mainnet to the Bedrock release, take advantage of the benefits it brings, and to continue to play a leadership role in the scaling community. For any further questions or concerns, we will be hosting an AMA on February 8th at 18:30 GMT in Discord to go over the proposal with team members from the Optimism Foundation and OP Labs. ",
                    "links": [
                        "https://op-geth.optimism.io/",
                        "https://medium.com/ethereum-optimism/our-pragmatic-path-to-decentralization-cb5805ca43c1",
                        "https://community.optimism.io/docs/developers/bedrock/explainer/",
                        "https://github.com/ethereum-optimism/optimism/tree/develop/specs",
                        "https://community.optimism.io/docs/developers/bedrock/differences/",
                        "https://dev.optimism.io/bedrock-security/",
                        "https://app.sherlock.xyz/audits/contests/38",
                        "https://community.optimism.io/docs/developers/bedrock/differences/#guide-by-persona",
                        "https://community.optimism.io/docs/developers/bedrock/node-operator-guide/",
                        "https://community.optimism.io/docs/developers/bedrock/upgrade-guide/#",
                        "https://community.optimism.io/docs/developers/bedrock-temp/upgrade-guide/#upgrade-overview",
                        "https://github.com/ethereum-optimism/optimism/tree/develop/op-chain-ops",
                        "https://discord.com/events/667044843901681675/1071089483891621928",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/32",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/37",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/36",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/35"
                    ],
                    "GPT-summary": "The post is a proposal for the first protocol upgrade to the Optimism Collective, called Bedrock. The proposal explains the technical changes and improvements that Bedrock offers, as well as the impact it will have on stakeholders. The post also includes an action plan for the upgrade, including timing and contingency plans. The proposal invites questions and feedback from stakeholders and includes links to technical documentation and impact summaries.",
                    "GPT-proposal-categories": [
                        "Smart contract updates",
                        "Interoperability and Scalability",
                        "Grants, Funding and resource allocation",
                        "Privacy, Security and risk management",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.780794867277425
                },
                {
                    "author_link": "https://gov.optimism.io/u/0xWeston",
                    "index": "4",
                    "likes": "18",
                    "time": "01/02/2023-23:43:46",
                    "content": "This is so exciting to read, and I think the potential this could unlock - if all goes to plan here - is tremendous for enabling global adoption. This potential here of mass on-boarding…perhaps for the first time becoming real. Looking forward to following the progress! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.851851851851851
                },
                {
                    "author_link": "https://gov.optimism.io/u/FractalVisions",
                    "index": "5",
                    "likes": "11",
                    "time": "02/02/2023-00:04:09",
                    "content": "The upgrade guide is a very nice way to explain exactly what is happening through the hard fork and find the process very intriguing. We will make sure our community is aware of the upgrade prior to the event. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.341666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/cjh",
                    "index": "6",
                    "likes": "12",
                    "time": "02/02/2023-00:14:42",
                    "content": "what a fantastic moment in Ethereum scaling history- I’m excited beyond belief and incredibly grateful for the team pouring energy into co-ordinating this reality. values win, persistence is key. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 7.4750000000000005
                },
                {
                    "author_link": "https://gov.optimism.io/u/shaw",
                    "index": "7",
                    "likes": "9",
                    "time": "02/02/2023-01:27:43",
                    "content": "good,Looking forward to following the progress! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/polynya",
                    "index": "8",
                    "likes": "17",
                    "time": "02/02/2023-02:13:23",
                    "content": "A milestone, congrats to the OP Labs and OF teams! I’d recommend information about and links to third-party audits being in the main proposal itself; instead of being behind a link - as it is critical information. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 4.611111111111111
                },
                {
                    "author_link": "https://gov.optimism.io/u/E4ma",
                    "index": "9",
                    "likes": "5",
                    "time": "02/02/2023-02:55:15",
                    "content": "A beautiful read it is  LFG ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/SEED_LATAM_Joxes",
                    "index": "10",
                    "likes": "7",
                    "time": "02/02/2023-03:00:22",
                    "content": "Congratulations on this, very detailed information; looking forward to the AMA!     ben-chain:  In the event that a specific application has not prepared for the upgrade, and doing so would pose significant risk of end-users being negatively misled, then we will delay the execution of the upgrade by approximately 1-2 weeks in order to provide additional preparation time.   Have we already identified the main applications that will need to be prepared before the upgrade? or what is the procedure for the specific team of an app to inform and alert the need to prepare or be in communication with the OP labs/foundation team. Thank you ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.351190476190476
                },
                {
                    "author_link": "https://gov.optimism.io/u/yongyexiaozi",
                    "index": "11",
                    "likes": "3",
                    "time": "02/02/2023-03:12:17",
                    "content": "Congratulations OP is getting better and better, the project side is doing things very honestly, change the world human!!! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.2250000000000005
                },
                {
                    "author_link": "https://gov.optimism.io/u/tiga",
                    "index": "12",
                    "likes": "3",
                    "time": "02/02/2023-03:16:57",
                    "content": "Go Optimism, Go Bedrock ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Taminater",
                    "index": "13",
                    "likes": "3",
                    "time": "02/02/2023-03:48:36",
                    "content": "Huge upgrade, can’t wait this to go live. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.34090909090909
                },
                {
                    "author_link": "https://gov.optimism.io/u/wijit.b",
                    "index": "14",
                    "likes": "3",
                    "time": "02/02/2023-04:51:40",
                    "content": "I think This Proposal is obvious ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/LightningShiva",
                    "index": "15",
                    "likes": "4",
                    "time": "02/02/2023-05:51:25",
                    "content": "I don’t see any L2’s near Optimisms tech with the bedrock upgrade, as far as optimistic rollups go, OP sure is leading the pack. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.166666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/Ghazwan",
                    "index": "16",
                    "likes": "3",
                    "time": "02/02/2023-07:27:42",
                    "content": "This upgrade will change the game. I love how Optimism team working and how the community helping. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/Harper",
                    "index": "17",
                    "likes": "2",
                    "time": "02/02/2023-07:53:40",
                    "content": "Very good very nice. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.225
                },
                {
                    "author_link": "https://gov.optimism.io/u/noobman",
                    "index": "18",
                    "likes": "2",
                    "time": "02/02/2023-10:11:45",
                    "content": "Wow, I’m so happy to see this upgrade.   Congrats to OP ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/Bobbay_StableLab",
                    "index": "19",
                    "likes": "3",
                    "time": "02/02/2023-13:26:00",
                    "content": "We are in support of this and appreciate the information and links provided within this post. I’d recommend making some of the information in those links more front-facing in the main post, such as the summary of the Bedrock Explainer and Security & Audits. ",
                    "links": [
                        "https://dev.optimism.io/bedrock-security/"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.111111111111112
                },
                {
                    "author_link": "https://gov.optimism.io/u/Rocky",
                    "index": "20",
                    "likes": "1",
                    "time": "02/02/2023-15:36:25",
                    "content": "Well, such a move is democratic. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/gfhfh96832127",
                    "index": "21",
                    "likes": "1",
                    "time": "02/02/2023-15:51:59",
                    "content": "Good proposal, the Collective should upgrade Optimism Mainnet to the Bedrock release. I hope the community will accept this too. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/dgfhfghgfh",
                    "index": "22",
                    "likes": "1",
                    "time": "02/02/2023-16:05:27",
                    "content": "    tiga:  Go Optimism, Go Bedrock   this update is tremendous, keep it up ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.666666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/MinimalGravitas",
                    "index": "23",
                    "likes": "4",
                    "time": "02/02/2023-16:33:08",
                    "content": " Bedrock abstracts the proof system from the OP Stack so that a rollup may use either a fault proof or validity proof (e.g., a zk-SNARK) to prove correct execution of inputs on the rollup. This abstraction enables systems like Cannon to be used to prove faults in the system.  This seems the most exciting part to me, am I correct in reading it as meaning that: a) working fraud proofs are not too far away; and b) that when ZK tech is mature enough we can just slot in validity proofs and transition OE into a ZKR if that seems to be the best route forward?! Both of those items would be fantastic news even without the fee reduction and other improvements included. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.421875
                },
                {
                    "author_link": "https://gov.optimism.io/u/FractalVisions",
                    "index": "24",
                    "likes": "3",
                    "time": "02/02/2023-16:53:45",
                    "content": "Cannon is the next step to the ZK tech implementation from my understanding. I agree this is all very exciting seeing as how both rollup technologies have been praised for their advancement in scaling blockchain on L2 and how Optimism has now implemented and intertwined ZK tech into the network. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving entirely positive feedback on proposal"
                    ],
                    "Sentiment": 5.9750000000000005
                },
                {
                    "author_link": "https://gov.optimism.io/u/nanativeman",
                    "index": "25",
                    "likes": "1",
                    "time": "02/02/2023-17:36:27",
                    "content": "Wonderful event. Much to look forward to in the future ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/teaser",
                    "index": "26",
                    "likes": "1",
                    "time": "02/02/2023-18:03:40",
                    "content": "I’m excited about Bedrock! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.34375
                },
                {
                    "author_link": "https://gov.optimism.io/u/Vasquez",
                    "index": "27",
                    "likes": "1",
                    "time": "02/02/2023-18:47:08",
                    "content": "Great moment guys! Great results! ith best wishes ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "28",
                    "likes": "5",
                    "time": "02/02/2023-19:27:32",
                    "content": "Very excited to be seeing this. I will echo other delegates who mentioned that seeing some important information outside of the main proposal is a bit weird so it would be better to inclide them in the post directly. But other than that really happy to see us come to Bedrock. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.852083333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/AkmBrahim",
                    "index": "29",
                    "likes": "1",
                    "time": "02/02/2023-20:34:28",
                    "content": "I’m sure this is just the beginning of something fabulous that will change the way people think about cryptos and the web3    ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/goluis",
                    "index": "30",
                    "likes": "2",
                    "time": "02/02/2023-20:55:41",
                    "content": "¡Increíble y esperanzador! Espero que todo vaya bien   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Kase",
                    "index": "31",
                    "likes": "1",
                    "time": "02/02/2023-20:56:48",
                    "content": "Interesting. We will see this beautiful upgrade. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.375
                },
                {
                    "author_link": "https://gov.optimism.io/u/thesleeper",
                    "index": "32",
                    "likes": "1",
                    "time": "03/02/2023-01:32:10",
                    "content": "this will be huge, congrats to the team and thank you for your dedication. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.000000000000001
                },
                {
                    "author_link": "https://gov.optimism.io/u/polynya",
                    "index": "33",
                    "likes": "3",
                    "time": "03/02/2023-04:09:56",
                    "content": "They have been quite open about this, however the ZK teams say the overhead to this approach is too great and it’s much better to do a native ZKR. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.166666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/raquelsloop",
                    "index": "34",
                    "likes": "1",
                    "time": "03/02/2023-06:51:59",
                    "content": "congratulations, looks like a really big improvement ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/pcwto",
                    "index": "35",
                    "likes": "1",
                    "time": "03/02/2023-07:31:55",
                    "content": "lfg, ops devloping is very fast. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.3
                },
                {
                    "author_link": "https://gov.optimism.io/u/Luckymonkey",
                    "index": "36",
                    "likes": "1",
                    "time": "03/02/2023-08:41:29",
                    "content": "Truly groundbreaking and another milestone achieved. Optimism is not just your average layer2 blockchain but a global leader in blockchain technology. It is always innovating for the best in both worlds. I am excited with these new stuffs and updates and I am looking forward for the best in Optimism projects!  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal"
                    ],
                    "Sentiment": 6.96780303030303
                },
                {
                    "author_link": "https://gov.optimism.io/u/0xtassilo.eth",
                    "index": "37",
                    "likes": "4",
                    "time": "03/02/2023-09:24:42",
                    "content": "I have been using Optimism from day 1 (or 2). Reading about the Bedrock upgrade makes me realize the progress you guys have made. I get really excited reading about the modular aspects of the OP Stack. Modularity has proven to be a superior design for Blockchains. Don’t try to do all at once, but create one module, that is best in one area. What makes me particularly excited is the sharing of base resources when it comes to the conversion of execution clients. This is a great deal that many people might not realize. For those reasons I will vote in favor of Bedrock  Looking forward to the optimistic future … ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.84375
                },
                {
                    "author_link": "https://gov.optimism.io/u/thinkDecade",
                    "index": "39",
                    "likes": "6",
                    "time": "03/02/2023-13:37:02",
                    "content": "looking forward to this upgrade. Dropped a tweet on it.  twitter.com    thinkDecade(💙,🧡) @thinkDecade  #GovWatch @DaoStewards > #Optimism  The Optimism Collective is about to level up 🎚️  Bedrock is coming! 🏃🏾👟  The first protocol upgrade from @optimismFND  So what's it?🤔🤯  A thread🧵👇🏾 https://t.co/L94M5C0EyY         12:00 PM - 3 Feb 2023       ",
                    "links": [
                        "https://twitter.com/thinkDecade/status/1621478641594138630?s=20&t=ogCtkwLqhJaUTOQpUKqN2w",
                        "https://twitter.com/thinkDecade/status/1621478641594138630?s=20&t=ogCtkwLqhJaUTOQpUKqN2w",
                        "https://twitter.com/search?q=%23GovWatch",
                        "https://twitter.com/DaoStewards",
                        "https://twitter.com/search?q=%23Optimism",
                        "https://twitter.com/optimismFND",
                        "https://t.co/L94M5C0EyY",
                        "https://twitter.com/thinkDecade/status/1621478641594138630?s=20&t=ogCtkwLqhJaUTOQpUKqN2w"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/Urban_Raccoon",
                    "index": "40",
                    "likes": "1",
                    "time": "03/02/2023-14:10:08",
                    "content": "Excited to see what comes with this. Layer 2 season ahead. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://gov.optimism.io/u/mikegriff",
                    "index": "41",
                    "likes": "1",
                    "time": "03/02/2023-17:25:06",
                    "content": "Bedrock is going to make a big difference to dapp performance on Optimism. Excited to see this release. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9375
                },
                {
                    "author_link": "https://gov.optimism.io/u/Rexar",
                    "index": "42",
                    "likes": "1",
                    "time": "03/02/2023-18:51:13",
                    "content": "thats verry prommising for the future of the whole network  , i like it alot  Optimism making waves with this new kind of economy in its ecosystem …nobody does this which optimism did so far … ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal"
                    ],
                    "Sentiment": 6.036363636363636
                },
                {
                    "author_link": "https://gov.optimism.io/u/thakhathepcryp",
                    "index": "43",
                    "likes": "1",
                    "time": "03/02/2023-21:17:53",
                    "content": "I’m excited to be a part of optimism’s massive upgrade.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9375
                },
                {
                    "author_link": "https://gov.optimism.io/u/ypretty",
                    "index": "44",
                    "likes": "1",
                    "time": "03/02/2023-21:19:05",
                    "content": "Great new, looking forward for the upgrade  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.340909090909092
                },
                {
                    "author_link": "https://gov.optimism.io/u/Tiger",
                    "index": "45",
                    "likes": "1",
                    "time": "03/02/2023-21:52:10",
                    "content": "Another L2 summer  I like where this is going ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Mark_De.Fi",
                    "index": "46",
                    "likes": "2",
                    "time": "03/02/2023-22:50:31",
                    "content": "Reading about this update was very exciting This idea to improve modularity will actually make it possible for the Ethereum and Optimism ecosystem to evolve to the next level Looking forward to voting I’ll tweet a thread about it right now ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.675714285714286
                },
                {
                    "author_link": "https://gov.optimism.io/u/Butterbum",
                    "index": "47",
                    "likes": "3",
                    "time": "04/02/2023-15:57:09",
                    "content": "Really awesome proposal… The modular architecture of Bedrock and its compatibility with Ethereum’s battle-tested code is a major advantage… Optimism is setting the L2 bar high  I optimistically look forward to March 15th.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.0375
                },
                {
                    "author_link": "https://gov.optimism.io/u/undercreuse",
                    "index": "48",
                    "likes": "2",
                    "time": "05/02/2023-20:45:09",
                    "content": "Supported Bedrock to the powerfull of OP. Waiting for the vote  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/SophiaFang",
                    "index": "50",
                    "likes": "4",
                    "time": "06/02/2023-07:05:40",
                    "content": "It’s happy to be informed that optimism is keep upgarding, Looking forward to following the progress! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Juliy",
                    "index": "51",
                    "likes": "3",
                    "time": "06/02/2023-14:49:49",
                    "content": "good,Looking forward to following the progress! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/benjamin",
                    "index": "52",
                    "likes": "4",
                    "time": "06/02/2023-19:22:25",
                    "content": "Bullish on bedrock  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Soulllvision",
                    "index": "54",
                    "likes": "1",
                    "time": "06/02/2023-20:52:43",
                    "content": "After this update OP will only increase the distance and stay behind other L2 solutions ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.125
                },
                {
                    "author_link": "https://gov.optimism.io/u/TFiD",
                    "index": "55",
                    "likes": "2",
                    "time": "06/02/2023-22:39:10",
                    "content": "Let’s go for the upgrade! Nice job. It will be incredible. Can’t wait. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/angyts.eth",
                    "index": "56",
                    "likes": "2",
                    "time": "09/02/2023-14:23:27",
                    "content": "exciting upgrade, would we experience lower gas fees after that? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/Michael",
                    "index": "57",
                    "likes": "4",
                    "time": "09/02/2023-15:11:22",
                    "content": "For anyone that wants a quick explainer on what Bedrock actually is and why it’s important, I made a quick video on it! Optimism's Bedrock Upgrade: Explained - YouTube Obviously I couldn’t fit everything in there but I tried to cover the most important points. Check it out.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party advertising proposal"
                    ],
                    "Sentiment": 6.472222222222222
                },
                {
                    "author_link": "https://gov.optimism.io/u/frick94",
                    "index": "58",
                    "likes": "3",
                    "time": "09/02/2023-16:56:57",
                    "content": "the rules that create equality in the ecosystem ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/WintermuteGovernance",
                    "index": "59",
                    "likes": "3",
                    "time": "09/02/2023-22:20:02",
                    "content": "Huge congrats to the Optimism Team! We look forward to supporting this when the vote goes up  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://gov.optimism.io/u/Mon",
                    "index": "60",
                    "likes": "2",
                    "time": "10/02/2023-07:09:32",
                    "content": "looking forward on this, one of best upgrades… lfg ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/cmalize",
                    "index": "61",
                    "likes": "2",
                    "time": "10/02/2023-20:33:57",
                    "content": "Great proposal. I’m looking forward to it! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/cryptosteve1",
                    "index": "62",
                    "likes": "2",
                    "time": "10/02/2023-23:07:15",
                    "content": "Very pumped for the future! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/eelbbllea",
                    "index": "63",
                    "likes": "1",
                    "time": "11/02/2023-06:02:31",
                    "content": "A bedrock upgrade would be great. I agree with you ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Roshni",
                    "index": "64",
                    "likes": "1",
                    "time": "12/02/2023-03:45:22",
                    "content": "    ben-chain:  The upgrade overview  documentation page describes mechanically how the upgrade will be executed if approved by the Token House, and the code here  implements the migration logic from the old chain to Bedrock.   Very well explained. Looking forward to learning about the progress. ",
                    "links": [
                        "https://github.com/ethereum-optimism/optimism/tree/develop/op-chain-ops"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/Amber",
                    "index": "65",
                    "likes": "1",
                    "time": "12/02/2023-03:59:54",
                    "content": "Very well explained… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/pheyyex",
                    "index": "66",
                    "likes": "2",
                    "time": "13/02/2023-10:06:32",
                    "content": "very impressive rea, love the fact that the community are carried along with each decision taken we await the vote.well done to the team. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/olimpio",
                    "index": "67",
                    "likes": "6",
                    "time": "15/02/2023-23:43:40",
                    "content": "I am very excited for Bedrock. Manifesting my approval to this Draft so it can move to a vote: I am an Optimism delegate Delegate Commitments - #76 by olimpio.eth with sufficient voting power and I believe this proposal is ready to move to a vote. ",
                    "links": [
                        "https://gov.optimism.io/t/voting-roundup-cycle-10/4924/2"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 6.71875
                },
                {
                    "author_link": "https://gov.optimism.io/u/GFXlabs",
                    "index": "68",
                    "likes": "5",
                    "time": "15/02/2023-23:47:41",
                    "content": "We are an Optimism delegate with sufficient voting power and believe this proposal is ready to move to a vote. ",
                    "links": [
                        "https://gov.optimism.io/t/delegate-commitments/235/34"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/MoneyManDoug",
                    "index": "69",
                    "likes": "5",
                    "time": "15/02/2023-23:55:07",
                    "content": "As an Optimism delegate with voting power above the required threshold I believe this proposal is ready for vote. Delegate Commitments - #71 by MoneyManDoug ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party auditing and reviewing proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/kaereste",
                    "index": "70",
                    "likes": "5",
                    "time": "15/02/2023-23:58:01",
                    "content": "I’m representing L2BEAT and we are a delegate with sufficient voting power, I believe this proposal is ready for a vote. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/fig",
                    "index": "71",
                    "likes": "6",
                    "time": "16/02/2023-00:10:16",
                    "content": "We are excited for the next iteration of Optimism. As an Optimism delegate with ample voting power, we support this proposal moving to the next stage. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://gov.optimism.io/u/katie",
                    "index": "72",
                    "likes": "4",
                    "time": "16/02/2023-02:17:17",
                    "content": "As an Optimism delegate with ample voting power, I support this proposal moving to the next stage. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/MattL",
                    "index": "73",
                    "likes": "3",
                    "time": "16/02/2023-16:13:38",
                    "content": "As an Optimism delegate (SNX Ambassadors) with ample voting power, I support this proposal moving to the next stage. Super excited for optimism. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.180555555555555
                },
                {
                    "author_link": "https://gov.optimism.io/u/Mark_De.Fi",
                    "index": "74",
                    "likes": "1",
                    "time": "16/02/2023-18:47:05",
                    "content": "This is a proposal for an update that is definitely supported by most of the participants (me too) Waiting for Bedrock will be is live ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0606060606060606
                },
                {
                    "author_link": "https://gov.optimism.io/u/sorawitk31",
                    "index": "75",
                    "likes": "1",
                    "time": "17/02/2023-14:48:32",
                    "content": "1 Op to 1500$ in this year Go Optimism, Go Bedrock ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Hoyas.eth",
                    "index": "76",
                    "likes": "2",
                    "time": "17/02/2023-21:30:25",
                    "content": "Hello everyone, this is our first post in our efforts to become an Optimism delegate. We are excited to join the community and contribute.  The Bedrock Upgrade will be one of the most influential turning points in Eth scalability and layer 2 networks.  The modularity of the proposed stack has the potential to position Optimism as a cornerstone of Layer 2 development. Moreover, the revenue earned from this will go to The Collective and retroactive public goods, furthering our mission of impact = profit. A 2000-line difference from Geth is astonishing and will allow for Ethereum developers to easily transition to Optimism and feel confident doing so. The barrier to entry in porting dApps to Optimism is significantly reduced by this. It also reduces the variance in application maintenance and updates. By enabling multiple transactions to be rolled up into one block, upgrade fees per block can be spread across the transactions and data storage growth will decrease by 15 gb/year. This also reduces deposit confirmation times from 10 minutes to 3 minutes.  Overall, we expect the OP Stack to become a hub of both innovation and commerce, and we are excited by what this means for the growth of The Optimism Collective.  Huge shoutout to all who participated in the design and development of this proposal. We are so excited to see where this takes Optimism! Henry Hobin, Georgetown Blockchain ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.491815476190476
                },
                {
                    "author_link": "https://gov.optimism.io/u/Axel_T",
                    "index": "77",
                    "likes": "1",
                    "time": "21/02/2023-00:22:28",
                    "content": "Sorry for the silly question, here, but where do we Vote on this Proposal?  There are no votes available on https://snapshot.org/  There are no votes available on https://vote.optimism.io/  Is this just a vote for an elected committee?  Any help or clarification or links from anyone would be greatly appreciated. @ben-chain Can I ping you here for some direction? Thanks for your time. ",
                    "links": [
                        "https://vote.optimism.io/"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.166666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/Bennyj504",
                    "index": "78",
                    "likes": "1",
                    "time": "21/02/2023-02:26:07",
                    "content": "Wow,I thought this was a simple gas optimization upgrade…boy it’s so much more. A multi chain in a multi chain world is exciting ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.333333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "79",
                    "likes": "4",
                    "time": "21/02/2023-12:38:32",
                    "content": "Hi @Axel_T - Bedrock has been pushed to Cycle 11    Discord   Discord - A New Way to Chat with Friends & Communities Discord is the easiest way to communicate over voice, video, and text.  Chat, hang out, and stay close with your friends and communities.        twitter.com    Optimism (✨🔴_🔴✨) @optimismFND  The Bedrock upgrade has been rescheduled to the voting Cycle 11 (March 2 - April 5) in order to give governance ample time to review code changes.  Rigorous, transparent governance in action!  twitter.com/optimismFND/st…   Optimism (✨🔴_🔴✨) @optimismFND  Update for the Collective: We have rescheduled the Bedrock upgrade vote to Cycle 11 (March 2 - April 5) to resolve bugs uncovered by vigilant community members as part of the Bedrock bug bounty contest.    6:45 PM - 17 Feb 2023           79                23            There will be a more detailed update added as a comment to this proposal draft shortly ",
                    "links": [
                        "https://discord.com/channels/667044843901681675/989611992295813241/1075885849977303154",
                        "https://twitter.com/optimismFND/status/1626654085934944261?s=20",
                        "https://twitter.com/optimismFND/status/1626654085934944261?s=20",
                        "https://twitter.com/optimismFND/status/1626654085934944261?s=20",
                        "https://twitter.com/optimismFND/status/1626380025418113024",
                        "https://twitter.com/optimismFND/status/1626380025418113024",
                        "https://twitter.com/optimismFND/status/1626654085934944261?s=20"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.161363636363636
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "80",
                    "likes": "2",
                    "time": "21/02/2023-12:48:21",
                    "content": "Great to see Georgetown Blockchain getting involved! You can create a delegate communication thread here to make it easy for delegators to understand how you’ve voted on all proposals  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 8.583333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/Axel_T",
                    "index": "81",
                    "likes": "1",
                    "time": "21/02/2023-12:54:54",
                    "content": "Thanks @lavande  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/ben-chain",
                    "index": "82",
                    "likes": "15",
                    "time": "21/02/2023-16:54:03",
                    "content": "Hey all, I wanted to loop back here and talk about our decision to delay the proposal until next cycle. At the end of the day, what this decision boils down to is rigor, and the precedent that we need to be setting as a Collective.  While we had high hopes for the Sherlock audit competition, the turnout was stronger than anticipated!  We had 333 people sign up to participate, and 60 people submitted at least 1 report. In total, this incredible group of community members submitted 314 unique reports, which break down into:  149 suggestions for improvements on our specifications. 166 reports claiming to identify a bug or vulnerability.  After deduplication, these 166 reports further break down into:  6 high severity findings. 9 medium severity findings. A large number of findings or recommendations which are subjective in nature.  As stated in the initial proposal—the entire point of the Sherlock competition was to leverage the community find things. Our goal is to have all fixes merged into the codebase well in advance of the original go-live date. At the same time, we haven’t yet open sourced the Sherlock results like we have for the rest of the Bedrock security reviews. At the end of the day—while we’re just as excited about the prospect of the Bedrock upgrade as the community, this is the first ever vote of the Token House in perhaps its most critical area of responsibility.  Starting a vote before the community has all the information—and ample time to review it—just isn’t acceptable, and we shouldn’t be setting that standard. Code needs to be frozen. So, despite our excitement, we decided not to finalize this proposal until all the information is public. Well in advance of next cycle’s discussion period, we’ll be providing a detailed analysis of the Sherlock results, and a new code-frozen release. Speaking in my personal capacity for a minute, it’s moments like these that make me really appreciate having a governance community holding us accountable. Simply put, it’s a forcing function for rigor—it helps remind me that releases are not a race, but an exercise in polishing. This an all-too-common trap. While I’m sad to see Bedrock pushed out, I’m proud of the precedent being set. ",
                    "links": [
                        "https://gov.optimism.io/t/draft-upgrade-proposal-bedrock-v2/5548/3",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/36"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.548330709694346
                },
                {
                    "author_link": "https://gov.optimism.io/u/ortorombik",
                    "index": "83",
                    "likes": "1",
                    "time": "22/02/2023-21:46:26",
                    "content": "Great explanation, OP  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/FractalVisions",
                    "index": "84",
                    "likes": "1",
                    "time": "23/02/2023-02:26:55",
                    "content": "We are relieved actually… That the best news we could hear in comparison to other scenarios. As long as it doesn’t take as long as the eth 2.0 merger did you’re still shipping faster than most other networks so give yourself some kudos. People still have no clue what this network is capable of and that is definitely exciting to think about sharing no matter how quick the bedrock update comes ! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.148148148148148
                },
                {
                    "author_link": "https://gov.optimism.io/u/theince",
                    "index": "85",
                    "likes": "1",
                    "time": "23/02/2023-11:12:47",
                    "content": "There are really exciting developments in the optimism ecosystem… the future is ours… stay safe and optimistic. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.333333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/Axel_T",
                    "index": "86",
                    "likes": "1",
                    "time": "24/02/2023-17:00:08",
                    "content": "Very positive post. I’m sure based on the reports and info you’ve discussed the community will be happy to wait for the polished release. …And I hope all the team coped okay from being peer-reviewed by 333 people   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.619318181818182
                },
                {
                    "author_link": "https://gov.optimism.io/u/CryptoKachu",
                    "index": "87",
                    "likes": "1",
                    "time": "26/02/2023-08:25:14",
                    "content": "Love to see Bedrock’s impact on overall layer 2 ecosystem!! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/Bkk420",
                    "index": "88",
                    "likes": "2",
                    "time": "26/02/2023-10:38:20",
                    "content": "i think this proposal will change the game.Looking forward to follow the progress!!! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/kaereste",
                    "index": "89",
                    "likes": "5",
                    "time": "28/02/2023-18:29:35",
                    "content": "I have some questions regarding the planned 4h downtime:  Is it really necessary? Can’t we have an upgrade similar to how hard forks are happening, that from some specific block forward we’ve got a new version handling the chain? If it is really necessary, how are we going to handle it? Especially in DeFi? 4h is a lot for some protocols that are price sensitive. How are we going to communicate it? I’m afraid that if it comes as a surprise, we can expect CT go wild with Solana comparisons.    ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.722348484848485
                },
                {
                    "author_link": "https://gov.optimism.io/u/FractalVisions",
                    "index": "90",
                    "likes": "0",
                    "time": "28/02/2023-19:28:49",
                    "content": "Prepare for the storm! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/zk1t",
                    "index": "91",
                    "likes": "1",
                    "time": "01/03/2023-00:57:17",
                    "content": "Would like to bump this ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "92",
                    "likes": "0",
                    "time": "03/03/2023-14:17:52",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "93",
                    "likes": "0",
                    "time": "03/03/2023-14:18:55",
                    "content": "A new version of this proposal, marked v2 and linked back to this original, will be posted during the review period of Cycle 11. Cycle 11 dates Review period: March 2- March 22 Voting period: March 23- April 5 Stay tuned! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.881392045454545
                }
            ]
        },
        {
            "thread_link": "https://gov.optimism.io/t/draft-upgrade-proposal-bedrock-v2/5548",
            "title": "[DRAFT] Upgrade Proposal: Bedrock - v2 ",
            "index": 5548,
            "category": [
                "\\xf0\\x9f\\x93\\x83Other Proposals",
                "Protocol Upgrade"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/ben-chain",
                    "index": "1",
                    "likes": "27",
                    "time": "09/03/2023-02:39:28",
                    "content": " Executive Summary   In short, what is this upgrade proposal? Impacted stakeholders & expected outcomes Why the Collective should upgrade  The Optimism Foundation is proud to propose the first protocol upgrade to the Optimism Collective: Bedrock. The Bedrock release of the OP Stack represents the culmination of years of research and development by the Ethereum scaling community and is a complete rewrite of the core components of the Optimism architecture. This upgrade offers a new level of modularity, simplicity, and Ethereum equivalence for Layer 2 solutions, providing unprecedented performance and functionality. Most users will not be impacted by the upgrade as the current mainnet is already EVM-equivalent. Users and projects that run both full and archive nodes, make use of deposits and withdrawals, and make assumptions about the block time on Optimism Mainnet will need to take action to prepare for the upgrade. To help ensure a smooth transition, a thorough changelog and stakeholder-specific requirements can be found below. In addition to these technical improvements, the Bedrock upgrade is a significant step towards the multi-chain future. By creating a shared standard, the OP Stack, Bedrock sets the stage for a Cambrian explosion of aligned L2s. This is an opportunity for leadership in the Ethereum ecosystem. We are confident that the post-Bedrock experience will be a positive change for developers in the Optimism ecosystem and have received consistent excitement for the upgrade from our partners. We are committed to making this upgrade a success and are eager to see the results in the months and years to come.  Technical Summary   Overview of architectural changes Link to all protocol/API/tech specifications Overview of ongoing security considerations incl. all audits and findings   Overview/Architecture At the highest level, the Bedrock release implements a modular architecture, separating the OP Stack into 3 components: consensus, execution, and settlement. These designs borrow heavily from the Engine API introduced for the Merge, and, as a result, an Ethereum execution client can be converted into an Optimism execution client in <2,000 lines of code. This is a huge win, paving the way for a multi-client future, and allowing for maximal use of Ethereum’s battle-tested code. Technical documentation for Bedrock is split into 3 main parts:   An explainer detailing Bedrock and its major architectural choices.  Protocol specifications for all major components of the codebase.  Developer documentation for those using any APIs affected by the release.   Security Considerations A summary of the initial security measures and considerations for Bedrock can be found in this blog post by OP Labs, which includes links to security audits and testing measures. For easier access, a list of security audits are hosted in the OP Stack monorepo. Audits relevant to the Bedrock release are prefaced with 2022/3. Notably, the Bedrock release introduces a 2-phase withdrawal process, doubling down on bridge security, which proved to be a primary risk factor for chains in 2022. Since the previous draft of this proposal in voting cycle 10, the Sherlock community completed a successful bug hunt, which most notably resulted in 3 High severity findings and 11 Medium severity findings. None of these enable theft of assets, but some could have caused users’ assets to be locked until a subsequent upgrade made them recoverable.  Impact Summary   Changes in performance characteristics Time-of-upgrade considerations (downtime, etc) Links to exhaustive upgrade documentation for impacted stakeholders  The Bedrock release enables performance improvements across the board, including transaction costs, throughput characteristics, and sync speeds. Exact numbers are dependent on real-world chain activity, which can’t be known until actual deployment. However, we estimate a 47% reduction in protocol costs/security fees. You can read more in this post on the OP Labs dev blog. The Bedrock migration will require pausing deposits and sequencer transaction ingestion during the upgrade, effectively resulting in network downtime. We estimate that this will take <4 hours. Unlike previous upgrades to Optimism, this release will not require a “regenesis,” and historic chain data will still be accessible after the upgrade. As such, little action is required from end-users of Optimism other than being aware of that timing. While the upgrade strictly improves on EVM equivalence, some application developers may be affected. While we have been in active touch with major partners, the developer community has also been actively notified over the past few months in 1:many communications. We maintain the following documentation pages for impacted developers:  A guide by persona on what most developers need to prepare for the upgrade. A guide specifically for node operators, which are impacted most by the upgrade. A general FAQ page for the upgrade.   Action Plan   Mainnet Upgrade Timing Contingency plans in case of last-minute bugs or issues Plan for communication and education to the community  Since the previous version of this proposal, we have made the decision to favor a set of rigorous go-live criteria for the upgrade, as opposed to specifying to the exact date in the proposal itself.  Specifying go-live criteria allows the community to focus on the ideal conditions for the upgrade, rather than committing to a timeline that could result in a rush to the finish line. Primarily, these criteria consist of:  A successful upgrade of Goerli to the “Regolith” release, which incorporates the improvements recently identified by Sherlock. A follow up audit to test the fixes made after the previous audit. Internal rehearsals of both the migration and recovery from an invalid output root 2 weeks of testnet stability on a consensus- and feature-frozen release, followed by a public announcement with 3 weeks of notice to the community.   Regolith Goerli Hard Fork The Regolith hard fork is a hard fork that will be activated at a set block time on Optimism Goerli around March 17, 2023 @ 7:00:00 pm UTC. Because the hard fork will be activated before the governance vote completes, Optimism Mainnet will be upgraded to Bedrock with the Regolith hard fork already activated. Regolith improves Ethereum equivalence, primarily for deposit system transactions which are required by L2. Changes are defined in the specs here. These features would be activated from day 1 of Bedrock on Optimism Mainnet.  Go-live Criteria Once the Regolith fork is complete, the next step is to upgrade mainnet. If this proposal passes, we will upgrade to Bedrock given that the following criteria are met:  Consensus and Feature Frozen  No consensus changes are to be made to the op-geth op-node, op-batcher, or op-proposerpackages. No major refactors, architectural changes, or non-trivial feature additions are to be made to op-gethand op-node packages .  “Consensus changes” are defined as any changes that modify the batch derivation function, the EVM, or would otherwise require coordination between node operators.  Examples include: L1 Cost function / Receipt changes in op-geth, introduction of a new batch version or compression, changing signing hashes. No changes should be made to op-geth unless they are clearly justified as non-consensus No changes should be made to the in the rollup package in the op-node unless they are clearly justified as non-consensus   No major refactors or architectural changes (e.g.: pulling in an upstream geth version, modifying the derivation pipeline, fundamental changes to peer-to-peer networking) No non-trivial features should be added to op-node or op-geth (e.g. Snap Sync)   No upgrades to the L1 or L2 Goerli smart contracts are required or executed.  Note: Low severity bug fixes, additional testing, small scope refactors will not be considered “un-freezing.” These small refactors may precipitate minor releases of our software.  2 Weeks’ Stability After Optimism Goerli is change-frozen, the sequencer, batcher & proposer must show 14 consecutive days of stability. We define stability in this context as:   No Sequencer failures.  The sequencer does not persistently drop any valid L2 transactions. The sequencer does not produce any invalid blocks. The sequencer consistently produces blocks at the intended 2-second intervals.    No Batcher downtime exceeding 6 hours.  Batch transactions are regularly submitted and confirmed on L1 at the intended frequency. The batcher is “keeping up” with the sequencer (i.e. the number of not-yet-batched L2 blocks is not growing over time). The majority of batch transactions confirmed in each window are valid.    No Proposer downtime exceeding 12 hours.  There is no gap in output root submission exceeding 12 hours. The proposer does not otherwise violate its responsibility to keep the output roots live, e.g. by unnecessarily deleting valid output roots. There is no invalid output root submitted.     Internal Rehearsals  We have completed two end-to-end internal upgrade rehearsals, using forks of the Mainnet L1 & L2 networks. We have completed a rehearsal deleting an L2 Output, to prepare for the unexpected event of a faulty proposal.   Community Awareness Only after hitting the above criteria will the Optimism Foundation announce an upgrade date, set at least 3 weeks after the time of announcement. Tentatively, we expect to announce the nearest Tuesday, at 9am PST, which fulfills this requirement. Note that the upgrade will be triggered at a specific time, and not a block height. The Optimism Foundation and OP Labs will continue public communication efforts around the upgrade, including public communications and tweets reminding stakeholders of the upgrade in the weeks, days, and hours leading up to the upgrade.  Security Cancellation Clause Note that this proposal would allow for bugfixes and stability improvements to be incorporated after the date that this proposal passes, potentially resetting the clock for the change freeze criteria.  However, in the event that a significant, new security risk is discovered, we may cancel the upgrade, requiring a new vote once the community has had time to react.  Conclusion  This proposal outlines the Optimism Collective’s first Protocol upgrade of Optimism Mainnet to the Bedrock release. This upgrade aims to provide unprecedented modularity, simplicity, and Ethereum equivalence to the L2 network, with positive impacts on performance and security. Bedrock is the codebase which will help Optimism stand the test of time, and is also preparatory step towards the multi-chain future. We expect the upgrade will incur around 4 hours of downtime, with no loss of historical data. Detailed technical specifications and impact summaries are available for the upgrade, as well as a thorough run-book of go/no-go criteria. We strongly believe that the Collective should upgrade Optimism Mainnet to the Bedrock release, take advantage of the benefits it brings, and to continue to play a leadership role in the scaling community. ",
                    "links": [
                        "http://optimism.io/superchain",
                        "https://op-geth.optimism.io/",
                        "https://medium.com/ethereum-optimism/our-pragmatic-path-to-decentralization-cb5805ca43c1",
                        "https://community.optimism.io/docs/developers/bedrock/explainer/",
                        "https://github.com/ethereum-optimism/optimism/tree/develop/specs",
                        "https://community.optimism.io/docs/developers/bedrock/differences/",
                        "https://dev.optimism.io/bedrock-security/",
                        "https://github.com/ethereum-optimism/optimism/tree/develop/technical-documents/security-reviews",
                        "https://github.com/sherlock-audit/2023-01-optimism-judging/issues?q=is:issue+is:open+sort:updated-desc+label:High",
                        "https://github.com/sherlock-audit/2023-01-optimism-judging/issues?q=is:issue+is:open+sort:updated-desc+label:Medium+",
                        "https://dev.optimism.io/heres-how-bedrock-will-bring-significantly-lower-fees-to-optimism-mainnet/",
                        "https://community.optimism.io/docs/developers/bedrock/differences/#guide-by-persona",
                        "https://community.optimism.io/docs/developers/bedrock/node-operator-guide/",
                        "https://community.optimism.io/docs/developers/bedrock/upgrade-guide/#",
                        "https://github.com/ethereum-optimism/optimism/pull/5010",
                        "https://github.com/ethereum-optimism/optimism/blob/develop/specs/network-upgrades.md#regolith",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/38",
                        "https://gov.optimism.io/t/voting-roundup-cycle-11/5620/2",
                        "https://gov.optimism.io/t/recording-recap-17th-op-community-governance-call-march-14th/5617",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/39"
                    ],
                    "GPT-summary": "The post is a proposal for the first protocol upgrade to the Optimism Collective, called Bedrock. The proposal explains the technical improvements and impact of the upgrade, as well as the action plan for the upgrade. The post also includes information on the security considerations and the go-live criteria for the upgrade. The proposal is open to feedback and questions from third parties, and includes a thorough run-book of go/no-go criteria.",
                    "GPT-proposal-categories": [
                        "Smart contract updates",
                        "Interoperability and Scalability",
                        "Grants, Funding and resource allocation",
                        "Privacy, Security and risk management",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.645871963684463
                },
                {
                    "author_link": "https://gov.optimism.io/u/ben-chain",
                    "index": "2",
                    "likes": "9",
                    "time": "09/03/2023-02:46:23",
                    "content": "Hey folks, just wanted to provide some context on this v2 of the Bedrock proposal beyond what makes sense in the proposal itself. While much of this proposal is the same as the initial version from last cycle, I thought it would be worth making some explicit callouts on what has changed:   Incorporation of Sherlock results: the post includes a summary of the results of the our most recent audit competition, and adds direct links to all historic audits for Bedrock.  I’ve also asked that someone from the OP Labs team provides an even more detailed breakdown than we think would be appropriate for the proposal itself.  Explicit callout of downtime: one important piece of feedback we got was that it should be clearer in the post that during the upgrade, transaction ingestion will be paused. It’s more explicit and bolded now; I thought worth restating here.  Lastly and most notably, instead of committing to a date up front this version of the proposal includes a rigorously specified go-live criteria for the upgrade, which includes circumstances that would block or delay the upgrade even after voting concludes.  The TLDR of this criteria is:  2 weeks of testnet stability on a feature and consensus-frozen Goerli, followed by at least 3 weeks of notice to the community.  The goal of this approach is to provide the community with a more rigorous standard for the proposed upgrade, and avoid any circumstances which could cause the release to be rushed. For example, in the previous version of the proposal, if we had discovered a potential stability improvement after completion of the vote, we would not have had 2 weeks to test on Goerli. In this version of the proposal, that scenario would reset the clock on the consensus and feature frozen criteria of the proposal, strictly blocking the upgrade. We think this strikes a good balance, which allows us to focus on the ideal conditions for the upgrade, rather than committing to a timeline that could result in a rush to the finish line, while still providing rigorous standards for the community to uphold. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.2666666666666675
                },
                {
                    "author_link": "https://gov.optimism.io/u/maurelian",
                    "index": "3",
                    "likes": "11",
                    "time": "09/03/2023-02:57:20",
                    "content": "Hey folks, Maurelian from OP Labs here to provide a more detailed rundown on the final results of the Sherlock audit contest. First to provide some context: an audit contest is a variation on a typical smart contract security audit, in which a total reward pot is posted to incentivize auditors to look for issues in a codebase. The rewards are paid out based on the number and severity of findings. You can find more details about audit contests in general in the Sherlock docs and about the Bedrock contest in particular in the contest description.  Recap of the numbers   A total reward of $720k was posted 333 people signed up for the contest 314 issues were submitted in total (note: this does not mean there were 314 unique issues) 60 people submitted at least one issue  Summary of Findings After reviewing all 314 issues, identifying duplicates, and assigning severities, we’ve identified:  3 High severity findings (which you can see here) 11 Medium severity findings (which you can see here)  You may notice that the numbers in this update are different from Ben’s previous update. This is because the audit contest has recently completed the escalation period, during which auditors could stake funds on any issues they feel have been misjudged. This has led to a re-review of 32 issues by the Sherlock team with support from OP Labs. Importantly, one of the high severity findings we previously reported has since been identified as a false positive. The ‘evolving understanding’ of the results is a necessary by-product of the audit competition model, as a significant effort was required to understand and validate the many reports we received. Next, I’ll walk through the details of the various issues. Each of these issues has already either been fixed, or else has a fix in progress.  Overview of high severity findings The high severity findings were all of a similar nature, namely permissionless griefing attacks which would allow any malicious user to interfere with a victim’s withdrawals from L1 to L2, causing their assets to be locked in the system. If the contracts were not upgradable, the locked assets would be irrecoverable. Relevant to each of the high severity findings is the fact that all withdrawal transactions are sent via the OptimismPortal, which finalizes the withdrawal regardless of the result (so if the call from the portal fails, it cannot be ‘replayed’). In order to provide additional safety guarantees for most users, CrossDomainMessenger contracts are included in the codebase, which are designed to ensure that deposits and withdrawals sent using these contracts can always be retried. It is also important to note that finalizing a withdrawal transaction is permissionless, ie. Bob can finalize Alice’s withdrawals and vice versa. With that context, the specifics of each attack are as follows:  High severity finding 1: Reentrancy lock up This finding specifically affects withdrawals that are sent via the messenger contracts. It would enable an attacker to lock up users’ withdrawals one at a time, meaning that they could identify a specific withdrawal and ensure that it is finalized in the OptimismPortal, but cannot be replayed by the L1CrossDomainMessenger. Details can be found in issue 87.  High severity finding 2: High gas limit lock up This finding specifically affects withdrawals which have a very high gas limit (greater than 11,245,655 gas). In such cases an attacker can finalize the withdrawal but ensure that slightly less than the requested gas amount is forwarded. This is an edge case, but breaks the important guarantee that the amount of gas specified for the withdrawal on L2 will be made available to it on L1. Details can be found in issue 109.  High severity finding 3: Low gas limit lock up This finding specifically affects withdrawals with gas limits set close to the lower bound of what is required to finalize it on L1. In such cases, an attacker can finalize the withdrawal with just enough gas to ensure that is is finalized, but not enough for the call to succeed. Details can be found in issue 80.  Overview of Medium severity findings These findings (which you can see here) fall into 4 categories:  Griefing  Permissioned withdrawal griefing, would allow the Proposer to lockup a withdrawal, or the Challenger to invalidate finalized withdrawals. These attacks are similar to the High severity ‘permissionless griefing’ attacks except that they require increased authorization. Details can be found in issues 53, 57, 75 and 138. Deposit griefing, which would allow a malicious user to interfere with other users’ deposits. Details can be found in issue 277.   Errors in the migration process. Issue 105 would cause the migration process to halt thus increasing down time. Issue 235 may result in some pre-bedrock withdrawals being locked in the system. DoS attacks on the op-geth or op-node services. Details can be found in issues 71, 177, 276, and 279  Token compatibility issues. Details can be found in issue 220.   Next steps  Each of the identified issues has already either been fixed, or else has a fix in progress. We are now performing our own internal audit, using these findings to:  Retroactively search for similar issues; Identify testing and process improvements which would have prevented these issues from being introduced; and Create monitoring to ensure that we can detect and respond to similar issues should they occur in production.  We will also be conducting a follow up audit, and will announce the date as soon as it is confirmed. ",
                    "links": [
                        "https://app.sherlock.xyz/audits/contests/38",
                        "https://github.com/sherlock-audit/2023-01-optimism-judging/issues?q=is:issue+is:open+sort:updated-desc+label:High",
                        "https://github.com/sherlock-audit/2023-01-optimism-judging/issues?q=is:issue+is:open+sort:updated-desc+label:Medium+",
                        "https://gov.optimism.io/t/draft-upgrade-proposal-bedrock/5014/82",
                        "https://en.wikipedia.org/wiki/Wikipedia:Griefing",
                        "https://github.com/sherlock-audit/2023-01-optimism-judging/issues/87",
                        "https://github.com/sherlock-audit/2023-01-optimism-judging/issues/109",
                        "https://github.com/sherlock-audit/2023-01-optimism-judging/issues/80",
                        "https://github.com/sherlock-audit/2023-01-optimism-judging/issues?q=is:issue+is:open+sort:updated-desc+label:Medium+",
                        "https://github.com/sherlock-audit/2023-01-optimism-judging/issues/53",
                        "https://github.com/sherlock-audit/2023-01-optimism-judging/issues/57",
                        "https://github.com/sherlock-audit/2023-01-optimism-judging/issues/75",
                        "https://github.com/sherlock-audit/2023-01-optimism-judging/issues/138",
                        "https://github.com/sherlock-audit/2023-01-optimism-judging/issues/277",
                        "https://github.com/sherlock-audit/2023-01-optimism-judging/issues/105",
                        "https://github.com/sherlock-audit/2023-01-optimism-judging/issues/235",
                        "https://github.com/sherlock-audit/2023-01-optimism-judging/issues/71",
                        "https://github.com/sherlock-audit/2023-01-optimism-judging/issues/177",
                        "https://github.com/sherlock-audit/2023-01-optimism-judging/issues/276",
                        "https://github.com/sherlock-audit/2023-01-optimism-judging/issues/279",
                        "https://github.com/sherlock-audit/2023-01-optimism-judging/issues/220",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/38"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party auditing and reviewing proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.621173298923299
                },
                {
                    "author_link": "https://gov.optimism.io/u/polynya",
                    "index": "4",
                    "likes": "6",
                    "time": "09/03/2023-05:41:31",
                    "content": "I’m unclear about the timelines. Ideally, I’d like to see voting on this proposal after Go-live criteria is established, and 2 weeks’ stability is demonstrated, but it’s unclear at what point this proposal goes to vote. Cycle 11 seems a bit sketchy while Goerli testing is still pending on a new version with multiple changes post-Sherlock. Without that, governance voting is more like “giving Optimism Foundation rights to manage the upgrade as defined” rather than actually voting on the upgrade. Which may be the defacto situation anyway, and I don’t have an issue with that in this early stage, but it should be clarified. In the medium-to-long term, though, upgrade proposals should only be submitted after readiness for mainnet has been abundantly demonstrated. Appreciate the detailed recap of Sherlock. Can the “internal upgrade rehearsals” be expanded akin to shadowforks L1 devs do? I.e. after the fork, mainnet transactions are replicated on the shadowfork. That’s a great way to test upgrades. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.718181818181819
                },
                {
                    "author_link": "https://gov.optimism.io/u/bakgwei",
                    "index": "5",
                    "likes": "2",
                    "time": "09/03/2023-13:20:16",
                    "content": "I dont have the technical expertise to check the fixes in detail myself. I understand that an external audit is being planned, before this is going to vote (and implementation). I wonder though - with such an important update for the whole ecosystem - if not (at least) TWO external audits from two Tier-1 auditors would be the smart thing to do? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.321428571428571
                },
                {
                    "author_link": "https://gov.optimism.io/u/n1kanor",
                    "index": "6",
                    "likes": "1",
                    "time": "13/03/2023-00:15:30",
                    "content": "omg what a big text^_^ ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/rshuel",
                    "index": "7",
                    "likes": "3",
                    "time": "13/03/2023-16:59:42",
                    "content": "Hey everyone, Ross and Mason here from a16z. We are excited to see the Bedrock upgrade come to fruition in the near future. Thanks to @ben-chain for the highly detailed overview and the entire OP team for the work they’ve done on Bedrock. The community’s identification of 14 findings in the Sherlock audit contest is a testament to the practical value of decentralized governance processes. The introduction of the OP stack untethers users from the bootstrapping and technical requirements typically necessary to stand up a chain and allows for experimentation via its highly modular design. We foresee this framework of open experimentation and rapid iteration resulting in the proliferation of novel L2 deployments. As more developers introduce modified deployments of the OP stack via their own chains, further cohorts of developers will be inspired and incentivized to deploy their chain using the OP stack. This cyclical feedback will feed a flywheel effect wherein developers launch their chain based on the OP stack and contribute to the codebase and surrounding tooling → the OP stack’s codebase and developer experience matures and improves over time → more developers launch their chains using the OP stack and contribute to the ecosystem. The Bedrock upgrade also lays the groundwork for the Superchain vision. OP chains with shared infrastructure will inherit stronger security assumptions, better tooling, and new sequencing models that open up a massive design space for innovation. Finally, this proposal is a symbolic opportunity to mark Optimism’s transition to on-chain voting. We look forward to hearing the community’s assessment of on-chain voting’s impact on transparency, decentralization, and efficiency. We also look forward to hearing community feedback on Agora’s implementation of Optimism’s on-chain voting module. ",
                    "links": [
                        "https://vote.optimism.io/"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.913516746411483
                },
                {
                    "author_link": "https://gov.optimism.io/u/ben-chain",
                    "index": "8",
                    "likes": "4",
                    "time": "13/03/2023-20:08:52",
                    "content": "Thanks for the thoughtful followup as always!  Yes, this proposal does defer additional discretion to the Foundation regarding timing and deployment for the upgrade. While it also attempts to provide a rigorous standard for the community to uphold, and various conditions which would require a re-vote, that is definitely a bottom line. As I mentioned in my previous comment, we believe this is the best path forward in this early stage, given the involved nature of this upgrade. In the medium term (i.e. post-Bedrock), I believe we should work as a community to make upgrades which are smaller, more explicit, and more incremental. There are meaningful advantages to upgrades which are implementable more similarly to L1 Ethereum, in which all code can be deployed in advance and then subsequently triggered by a pre-set block number. We’re just not there pre-Bedrock. WRT the shadowforks, this is an interesting callout — let me loop back with the team to get some thoughts. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.215686274509804
                },
                {
                    "author_link": "https://gov.optimism.io/u/Tjark",
                    "index": "9",
                    "likes": "6",
                    "time": "13/03/2023-20:36:24",
                    "content": "Thanks for the detailed overview. The go-live criteria seem reasonable. Very excited for this one to happen! I am an Optimism delegate [ Delegate Commitments - #141 by Tjark ] with sufficient voting power, and I believe this proposal is ready to move to a vote. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.609375
                },
                {
                    "author_link": "https://gov.optimism.io/u/FractalVisions",
                    "index": "10",
                    "likes": "2",
                    "time": "14/03/2023-14:26:12",
                    "content": "Scalability- The potential that this Bedrock update has for the continued scaling capabilities on layer two is incredible and provides the true potential for mass adoption to occur. This is a critical time for such an event to take place. I believe the OP stack creates a standard for blockchain technology that is unheard of for modern day development teams who are looking for new opportunities provided from the retroactive public goods fund. It’s amazing that the funds continue to grow larger for the builders of the network who make the most impact as they are attracting new users with state of the art development products. IMPACT OVER PROFIT Centralization- There are still many aspects of the network that are currently still centralized including the way the discord server is setup at the moment. The actual sequencers for the network are also centralized from my understanding. As far as security for the network is concerned there is much more that can be done to ensure the safety of the users on the network and who are active in the community discussion. A major amount of work needs to be done in this category to continue on a steady path towards decentralizing these aspects so that way we do not rely on the convenience of the old legacy system which provides a point of failure for the way optimism operates at the current moment. When we rely on convenience we not only sign away our rights by using this type of technology, we also risk our security by storing information in a centralized database or servers that are vulnerable to attack. Decentralization - The DAO for optimism has provided a sense of participation from the token holders who use the native $OP token to cast votes for proposals or important milestones for the network. Although it seems there is still a majority of the growth to be made on the network for the way grants are structured as well as the way international applicants are communicated with during the application process to ensure fairness for all regions of the planet. This aspect of an autonomous organization helps provide checks and balances to keep the community true to the original vision that it is focused on with the growth and expansion of the network while providing security for the users. These three pillars are essential in the way they are balanced and it’s important to remember as we shift closer towards one of them we lean further away from the other two. This should help explain to people who do not understand the difference between a central bank and decentralized finance. I am very excited for the bedrock update and have become fascinated with this technology over the past few years. We are aiming towards building our own iteration of a layer two blockchain similar to Optimism with planned interoperability and retroactive contributions heading back to the mother of the OP Stack. It would be amazing to see exactly what we can all we come up with when we put our brains together. Bedrock is the type of technical update that gives me a deeper appreciation for blockchain or development teams who are dedicated to pushing this scaling technology forward ! We are ready to commit our efforts into building a sustainable ecosystem for creators whether they make art or code in solidity. Alongside Optimism, Base, and any others who join the OP stack over the course of the future. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.611162646876933
                },
                {
                    "author_link": "https://gov.optimism.io/u/mastermojo",
                    "index": "11",
                    "likes": "5",
                    "time": "14/03/2023-22:43:53",
                    "content": "I am one of the Synthetix Ambassadors, and a Optimism Badgeholder. I am an Optimism delegate [Delegate Commitments - #65 by mastermojo ] with sufficient voting power, and I believe this proposal is ready to move to a vote. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/GFXlabs",
                    "index": "12",
                    "likes": "6",
                    "time": "15/03/2023-19:28:24",
                    "content": "We are an Optimism delegate with sufficient voting power  and believe this proposal is ready to move to a vote. ",
                    "links": [
                        "https://gov.optimism.io/t/delegate-commitments/235/34"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/djo",
                    "index": "13",
                    "likes": "1",
                    "time": "16/03/2023-08:03:54",
                    "content": "Thank you very much for the information ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.3
                },
                {
                    "author_link": "https://gov.optimism.io/u/thinkDecade",
                    "index": "14",
                    "likes": "1",
                    "time": "16/03/2023-18:36:44",
                    "content": "Thanks for the proposal. Looks like there’s a lot of work going on to ensure a smooth upgrade. kudos​:100: One area I would like to get a little bit of clarity is the education part. Are there any elaborate efforts to keep the community and the world informed about everything going on with the upgrade? Or is mainly tweets, forums and discord for now? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.079166666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/rubicon",
                    "index": "15",
                    "likes": "6",
                    "time": "16/03/2023-22:31:36",
                    "content": "We are an Optimism delegate with sufficient voting power and believe this proposal is ready for a vote. After months of playing on the testnet to ensure Rubicon is prepared for the upgrade, our team is excited to see Bedrock’s lower fees, consistent block time, and multi-client L2 ecosystem in production!  Network upgrades are no easy feat; we were very pleased to see the strong commitment to security and transparency throughout this process. In particular, we love the “reset” functionality in this vote and think it will be great practice for future network upgrades! ",
                    "links": [
                        "https://vote.optimism.io/delegate/0xaa31CB426e2C83cDa9C850874D166d7fcA836B14"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.610416666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/ethan0",
                    "index": "16",
                    "likes": "2",
                    "time": "20/03/2023-08:25:12",
                    "content": "This is Ethan from Pika Protocol, an Optimism delegate with sufficient voting power and believe this proposal is ready for a vote. Since Pika Protocol’s users are very sensitive to gas fees and block stability, we are excited to see Bedrock’s low gas fees and consistent block time and believe the upgrade will bring large benefits to our users. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.974404761904761
                }
            ]
        }
    ],
    "group_index": "493"
}