{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/draft-gf-phase-1-utopia-labs/3468",
            "title": "[DRAFT] [GF: Phase 1] Utopia Labs ",
            "index": 3468,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Governance Fund: Phase 1"
            ],
            "tags": [
                "cycle-7"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/kaitocunningham",
                    "index": "1",
                    "likes": "5",
                    "time": "13/09/2022-22:07:58",
                    "content": "Project Name: Utopia Labs Author name and contact info (please provide a reliable point of contact for the project): Kaito Cunningham (Kaito@utopialabs.com) I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: [Yes] L2 Recipient Address: 0x7f1df3eba7cB16Cc7A09ACBf2E1FaaD37DEa6BC0 Which Voting Cycle are you applying for?: Phase 1 Grant category: (Tooling) Is this proposal applicable to a specific committee? Yes. This proposal falls under the Tooling/Infrastructure committee. At the time of writing, the formation of this committee is being voted on. And the relevant information about this committee can be found here:  [DRAFT] S02 Committee Proposal: Tooling Governance Committee 1  Governance Project description (please explain how your project works): Utopia helps any organisation with a Gnosis SAFE execute and contextualise complex financial workflows. Today this is done through payment request links 3, supporting the automation and batching of recurring payments and helping improve organisation-wide transparency via our history page, which allows you to access any type of metadata to any kind of payment. Project links:  Website: https://www.utopialabs.com  Twitter: https://twitter.com/utopialabs_  Discord/Discourse/Community: n/a  Additional team member info (please link): Victoria Kim (victoria@utopialabs.com) Please link to any previous projects the team has meaningfully contributed to: @YieldGuild, @FWBTweets, @PleasrDAO, @Sushiswap, @BadgerDAO Relevant usage metrics (TVL, transactions, volume, unique addresses, etc. Optimism metrics preferred; please link to public sources such as Dune Analytics, etc.):  Cumulative Payment Volume: 100m+ Wallets/Accounts on Utopia: 5k+ Number of Payments Conducted: 30K+  Competitors, peers, or similar projects (please link): https://app.parcel.money/    app.coinshift.xyz   Coinshift Dashboard Crypto Treasury Management Simplified      Is/will this project be open sourced? No Optimism native?: No Date of deployment/expected deployment on Optimism: June 2022 Ecosystem Value Proposition: *** What is the problem statement this proposal hopes to solve for the Optimism ecosystem?**  As the crypto space becomes more crowded with more chains, there is opportunity for stronger incentives for DAOs and projects to build on Optimism. *** How does your proposal offer a value proposition solving the above problem?** Utopia’s vision is to become the foundation for a better internet economy; we see the blockchain as a facet to achieve that. In particular, we’re excited about the potential of communities powered by decentralised governance to foster collective agency and abundance. We’re aligned with Optimism in our mission to promote sustainability among these communities. We want to help OP build collaborative incentive systems and public goods funding models by being the cornerstone for helping these organisations achieve excellent financial operations. Specifically, we’re confident that we can bring more projects onto the Optimism chain. *** Why will this solution be a source of growth for the Optimism ecosystem?** By offering gas subsidies to projects on Optimism, we’re looking to help kickstart the adoption of Optimism for DAOs as their primary chain for payment operations.  Has your project previously applied for an OP grant? If successful, please link to your previous grant proposal and provide a brief update on milestones achieved with the grant. If unsuccessful, and this is a resubmission, please specify how you have incorporated significant changes in accordance with feedback. Number of OP tokens requested: 100,000 OP Did the project apply for or receive OP tokens through the Foundation Partner Fund?: No If OP tokens were requested from the Foundation Partner Fund, what was the amount?: How much will your project match in co-incentives? (not required but recommended, when applicable): We will not be able to provide co-incentives as Utopia Labs does not have a token. Proposal for token distribution: How will the OP tokens be distributed? (please include % allocated to different initiatives such as user rewards/marketing/liquidity mining. Please also include a justification as to why each of these initiatives align with the problem statement this proposal is solving.) We plan on using the token distribution plan with the following: 80% Gas Cost Subsidies: OP tokens will subsidize multi-sig gas costs whenever Utopia’s signing interface is used for payment execution. Requirements for gas subsidy:  The Gnosis SAFE that is on OP must have a minimum of $1K worth of assets in the SAFE. 20% Future Ecosystem Grants + Partnerships: OP tokens will be distributed as grants to users and developers, building tools and partnerships to help Utopia Labs grow its presence on Optimism. The grants will be paid out directly in OP.  Over what period of time will the tokens be distributed for each initiative? Shorter timelines are preferable to longer timelines. Shorter timelines (on the order of weeks) allow teams to quickly demonstrate achievement of milestones, better facilitating additional grants via subsequent proposals. Tokens will be distributed until the OP incentives run out, where we’re expecting to distribute this around a 6-12 month period. Please list the milestones/KPIs you expect to achieve for each initiative, considering how each relates to incentivizing sustainable usage and liquidity on Optimism. Please keep in mind that progress towards these milestones/KPIs should be trackable. We’re aiming to achieve the following metrics by the end of the 6-12 month period on the Optimism ecosystem:   Cumulative Payment Volume on OP (this is measured by calculating the USD value transacted via Utopia upon time of execution): 10M+   Wallets/Accounts created via Utopia on OP: 2.5k+   Number of Payments Conducted on OP: 10K+   Why will incentivized users and liquidity on Optimism remain after incentives dry up?   We believe that a DAO’s treasury currently on L1’s will eventually transition to L2’s as their primary operating chain, where Utopia serves to be a catalyst for accelerating that transition. Users + liquidity will remain as Utopia serves to be a primary software tool to help manage a DAO’s back office operations, alongside the high costs of switching chains/tools. Please provide any additional information that will facilitate accountability:(smart contracts addresses relevant to the proposal, relevant organizational wallet addresses, etc.) ",
                    "links": [
                        "https://gov.optimism.io/c/governance/41",
                        "https://app.utopialabs.com/request/payment/62a044b2ccd95fbf89fe91d4",
                        "https://www.utopialabs.com",
                        "https://twitter.com/utopialabs_",
                        "https://twitter.com/YieldGuild",
                        "https://twitter.com/FWBTweets",
                        "https://twitter.com/PleasrDAO",
                        "https://twitter.com/Sushiswap",
                        "https://twitter.com/BadgerDAO",
                        "https://app.parcel.money/",
                        "https://app.coinshift.xyz/",
                        "https://app.coinshift.xyz/"
                    ],
                    "GPT-summary": "The post is a proposal for a grant from the Optimism Foundation for the Utopia Labs project. The proposal explains how Utopia Labs helps organizations with Gnosis SAFE execute and contextualize complex financial workflows. The proposal also outlines how Utopia Labs plans to bring more projects onto the Optimism chain by offering gas subsidies to projects on Optimism. The post includes relevant information about the project, such as usage metrics, team member info, and relevant links. Additionally, the post mentions that the proposal falls under the Tooling/Infrastructure committee. A 3rd party gives entirely positive feedback on the proposal and extends to the proposal, offering to help with the project.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Interoperability and Scaleability",
                        "Community and engagement",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.798163841807909
                },
                {
                    "author_link": "https://gov.optimism.io/u/jrocki.eth",
                    "index": "2",
                    "likes": "2",
                    "time": "16/09/2022-15:43:57",
                    "content": "Well put together. We have an updated proposal template you should use now with modified/additional questions here: Grant Proposal Template Most notably is the addition of the two below: Grant category: Is this proposal applicable to a specific committee? [y/n, link to committee] ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.666666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/kaitocunningham",
                    "index": "3",
                    "likes": "1",
                    "time": "16/09/2022-18:52:07",
                    "content": "Awesome - just updated! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Defi_LATAM_axlvaz",
                    "index": "4",
                    "likes": "3",
                    "time": "21/09/2022-06:16:03",
                    "content": "Please update the proposal with this template for evaluation.     Grant Proposal Template 🏛 Governance   Phase 1 Proposal Template v2 Hey folks!  This thread will contain our drafted updates to various Governance-Fund-related language and the proposal template. We look forward to hearing your feedback as we enter the Reflection Period!  This is an update to the “How to Create a Proposal” post.   Key information about Governance Fund grants 5.4% of the total initial token supply (231,928,234 OP) will be distributed to Optimism projects and communities via the Governance Fund.  During Season 2, proj…     ",
                    "links": [
                        "https://gov.optimism.io/t/governance-fund-phase-1-how-to-create-a-proposal/216"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/schorgie30",
                    "index": "5",
                    "likes": "1",
                    "time": "21/09/2022-19:31:36",
                    "content": "In strong support of an OP grant for Utopia. I’ve worked with the team while at Notional to handle all of our grant and contributor payments and have always been impressed with their product and overall strategic direction. Adding the OP incentives to Utopia’s offerings makes a transition for existing DAO treasury management operations onto Optimism a no brainer. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 7.388888888888889
                },
                {
                    "author_link": "https://gov.optimism.io/u/kaitocunningham",
                    "index": "6",
                    "likes": "0",
                    "time": "27/09/2022-16:19:13",
                    "content": "Done! Thanks for the note here. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/kaitocunningham",
                    "index": "7",
                    "likes": "0",
                    "time": "27/09/2022-18:48:47",
                    "content": "Thanks Cameron - we really appreciated working with you and the Notional team  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Bobbay_StableLab",
                    "index": "8",
                    "likes": "1",
                    "time": "29/09/2022-09:51:07",
                    "content": "Overall it is a good proposal with very strong conditions on token distribution. Utopia is a great product that adds value to the Optimism ecosystem. Out of curiosity, how did you arrive at $1k as the minimum? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.579166666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/kaitocunningham",
                    "index": "9",
                    "likes": "2",
                    "time": "29/09/2022-16:16:46",
                    "content": "Thanks for the note @Bobbay_StableLab! We decided on a 1K minimum needing to be in the SAFE as we’ve noticed previously (mostly on main-net) that there were several accounts being created to take advantage of our gasless transaction + signing experience, and to combat bots writing any malicious scripts. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.5625
                },
                {
                    "author_link": "https://gov.optimism.io/u/Bobbay_StableLab",
                    "index": "10",
                    "likes": "1",
                    "time": "01/10/2022-04:36:48",
                    "content": "Ah, I meant more why $1k and not $2k or $5k etc.?  Either way, I am in favor of this proposal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/kaitocunningham",
                    "index": "11",
                    "likes": "0",
                    "time": "05/10/2022-03:23:15",
                    "content": "Hmm no specific reason here! In some senses, we don’t want to “gatekeep” our product to only “enterprise” level customers! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "251"
}