{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/gf-phase-1-proposal-questbook-optimism-grants-tooling/5069",
            "title": "[GF: Phase 1 Proposal] Questbook <> Optimism Grants Tooling ",
            "index": 5069,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Grants Council"
            ],
            "tags": [
                "cycle-10",
                "not-passed"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/mentalist0x",
                    "index": "1",
                    "likes": "1",
                    "time": "02/02/2023-17:04:40",
                    "content": "Project name: Questbook <> Optimism Grants Tooling Author name and contact info (please provide a reliable point of contact for the project): Arjun - Questbook (arjun@creatoros.co) I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: Yes I understand that I will be expected to following the public grant reporting requirements outlined here: Yes L2 recipient address: 0xA79d2B158aD0AbBeD56e36f24B8e20BfCbF53cD0 Which Voting Cycle are you applying for?: Cycle 10 Which sub-committee should review your proposal? (Builders Grants, Growth Experiment Grants): Growth Experiment Grants Project description (please explain how your project works): Questbook is a decentralized grant management platform. The platform is on-chain, open-sourced, transparent, and deployed on Optimism. (Questbook · GitHub)Using the tool,- Grant managers have created, reviewed, accepted, tracked and funded grants worth $2.1M- 1500+ Builders have applied for the grants, reported milestones and funding, and received feedback. Over 20,000 builders every month browse opportunities.- The entire grant flow on the tool is on-chain, transparent and accessible to the community.Notably, Compound Grants and Polygon has moved completely to Questbook to ensure transparency and accountability. Website: https://questbook.app Twitter: https://twitter.com/questbookapp Discord/Discourse/Community: Questbook Other relevant links (including any demos): https://www.notion.so/Product-Wiki-for-Grant-Programs-1d43dd8af8ee4d6181e1d51a285bf226https://www.notion.so/Questbook-5c13ed20dad74a6f88108620c532198c Additional team member info (please link): https://twitter.com/madhavanmalolanhttps://twitter.com/HarshaKaramchathttps://twitter.com/abhilashihttps://twitter.com/subhash_karri Please link to any previous projects the team has meaningfully contributed to: The team also built Open Quest, a quest-based decentralised university educating builders to build on Optimism, Ethereum, Solana, Near, etc. More than 30k builders have graduated from the programs. We have worked with Compound, Solana, Polygon, Aave, Prezenti, Perpetual and many of the top protocols to help improve the grant program in their ecosystems.The team also created Zero Wallet. It is an SDK that enables allows for on-chain transactions without installing a wallet or paying gas fees. Madhavan was involved in early prototypes of Plasma MVP (Minimal Viable Plasma) and an active member on Ethresear.ch (https://ethresear.ch/u/madhavanmalolan) Relevant usage metrics (TVL, transactions, volume, unique addresses, etc. Optimism metrics preferred; please link to public sources such as Dune Analytics, etc.): 20k+ unique users brought to Optimism10k+ transactions/month$2.1mn disbursed Competitors, peers, or similar projects (please link): Grants are currently managed across multiple platforms (Notion, Airtable, Typeform, Google forms). This unstructured approach lacks transparency, increases management workload, adds friction to decision-making, Lack of transparency in decision making, increases turn around time, has no community participation and lacks accountability.Gitcoin Grants Hub Is/will this project be open sourced?: Yes Optimism native?: Yes Date of deployment/expected deployment on Optimism: 4/17/2022 What is the problem statement this proposal hopes to solve for the Optimism ecosystem?: We aim to improve the Grant Program in 2 specific dimensions.1. Enforcing on-chain financial controls in order to make it easier to measure the impact of the grant program. This will increase transparency and accountability of the grant program.2. Attracting high-quality pseudonymous builders. How can builders apply to a grant without revealing their identity, but yet prove their credentials?We see this as a step towards eliminating barriers between work, workforce and capital. How does your proposal offer a value proposition solving the above problem?: We propose the 250K OP fund to be disbursed across the following domainsWe have chosen the following domains,1. Pseudonymous grant applications; ~40% of bounty hunters of GitCoin are pseudonymous. ~25% of the workforce in DAOs like Maker and Compound are pseudonymous. This widens the applicant pool more by enabling builders who want to remain anonymous to apply for grants using verified credentials.2. On-chain financial controls for Grants. Financial controls allow grant programs to track projects, disburse funds based on milestones and revert funds after a certain period or if the team doesn’t deliver. This keeps both grant reviewers and builders accountable at the same time. More importantly, it ensures that builders receive timely feedback. Such controls improve project quality over time and builders remain accountable.3. Impact measurement. Measuring impact, milestone completion status, and project delivery will enable protocols and the community to have clarity on what needs to improve in the following seasons. The potential domain allocators are, Gonna.eth (aka Dhhante, EthernautDAO) for Pseudonymous Grant Applications. Dhhante has considerable experience working with builders and enabling developers to help onboard them into web3. Scott Moore (GitCoin) for On-chain financial controls. On-chain financial controls for grants will have a measurable impact on the space and will bring additional accountability to all projects through grants. Bobby (StableNode) for Impact Measurement. Stable Node is a delegate at OP and has experience working hands-on with DAOs as well as grant processes.QuestBook will act as the program manager. Why will this solution be a source of growth for the Optimism ecosystem?: The tool can directly be used by Optimism to run Retro, Gov Fund and other grants initiatives efficiently. Questbook is built on Optimism. So, anyone who works to add pseudonymity or financial controllers to Questbook will be working on Optimism. By rewarding them for their work in OP token, there is a high likelihood for them to become long term contributors — because builders would feel they’ve earned the OP tokens, rather than having won it in an airdrop. Has your project previously applied for an OP grant?: No Number of OP tokens requested: 250k Did the project apply for or receive OP tokens through the Foundation Partner Fund?: No If OP tokens were requested from the Foundation Partner Fund, what was the amount?: N/a How much will your project match in co-incentives? (not required but recommended, when applicable): N/a How will the OP tokens be distributed? (please include % allocated to different initiatives such as user rewards/marketing/liquidity mining. Please also include a justification as to why each of these initiatives align with the problem statement this proposal is solving.): We will be allocating OP tokens to fund the following domains. Pseudonymous Applications/ Credentialing (30%)Enabling builders to pseudonymously apply for grants and open-source projects will enable more builders to participate in the space.On-chain Financial Controls (30%)Ensuring financial controls exist in grant payouts leads to increased accountability from builders.Impact Measurement/ Project Delivery (30%)Measuring impact, milestone completion status, and project delivery will enable protocols and the community to have clarity on what needs to improve in the following seasons. Operations (10%)Compensation:The committee compensation will be allocated from the 10% OP tokens, for 3 Domain Allocators and one Program manager during the 12-week period. The proposed committee consists of existing OP contributors. All participants (Domain Allocators, Program Manager, Builders) will adhere to the no sale rule. The tokens they receive as part of the proposed program must be used to increase their involvement in the OP ecosystem or be further passed down to incentivise a new wave of users. Over what period of time will the tokens be distributed for each initiative? Shorter timelines are preferable to longer timelines. Shorter timelines (on the order of weeks) allow teams to quickly demonstrate achievement of milestones, better facilitating additional grants via subsequent proposals: We will conduct 2 cycles of funding seasons where each cycle lasts 6 weeks. We will be prioritising projects that have quick delivery to execution to ensure that at the end of the 12 week cycle, the funded modules will be ready to ship.### ImplementationWe will set up a committee consisting of a Grant Manager (Questbook) and 3 Domain Allocators from the community. There will be a Grants SAFE, with 3/4 multi-sig, between the program manager and the 3 domain allocators. We will then have 3 SAFEs for each of the domains with a 2/2 between the program manager and the specific domain allocator.Grants SAFE is where all the initial funds for the grants program flow from the treasury. This SAFE holds funds related to operational costs, committee compensation, and the grants budget initially. The domain-level SAFEs will have funds only for the disbursal of the approved applications.OP refund policy:At the end of the 12-week cycle, we will propose to renew the proposal for an increased time frame. If the renewal doesn’t happen all funds will be sent back to the Governance Fund Treasury. Please clearly define the milestones you expect to achieve in order to receive milestone based installments. Please consider how each milestone relates to incentivizing sustainable usage and liquidity on Optimism. Progress towards each milestone must be trackable: We will define these completely during the review phase.Milestone 1Ratify domains and allocators.Ratify domain-specific guidelines. Set up safes for each domain. Milestone 2Disburse up to 100k OP tokens among the domains to various builders. Milestone 3Disburse an additional 125k OP tokens among the domains to various builders.All progress on the grant distribution will be transparent and trackable via the Questbook platform. Why will incentivized users and liquidity on Optimism remain after incentives dry up?: Protocols looking to expand the pool of builders will want to tap into pseudonymous talent, this will also lead to users wanting to stay and build their on-chain credentials on OP. The users who ultimately earn OP tokens are builders. Once a builder has spent considerable effort in building some infrastructure and earned OP tokens for it, they are very likely to continue to build on Optimism. Builders don’t need ongoing incentives to go deeper into a tech stack. Once a developer starts building and understands the tech inside out, there is a very high switching cost to move to a new network. Having earned OP tokens in return for real hard work of building infrastructure, makes one loyal and a potential long-term contributor. Additionally, OP tokens are Governance tokens. So, builders can participate in governance — they’re likely to be much more useful in the community discourse, especially at this point of time in the bear market. Please provide any additional information that will facilitate accountability (smart contracts addresses relevant to the proposal, relevant organizational wallet addresses, etc.): chains/optimism-mainnet.yaml at main · questbook/chains · GitHub Confirm you have read and agree to the Eligibility Restrictions (here): I have read the Eligibility Restrictions and agree to abide by their conditions ",
                    "links": [
                        "https://github.com/questbook",
                        "https://questbook.app",
                        "https://twitter.com/questbookapp",
                        "https://discord.com/invite/tWg7Mb7KM7",
                        "https://www.notion.so/Product-Wiki-for-Grant-Programs-1d43dd8af8ee4d6181e1d51a285bf226",
                        "https://www.notion.so/Questbook-5c13ed20dad74a6f88108620c532198c",
                        "https://twitter.com/madhavanmalolan",
                        "https://twitter.com/HarshaKaramchat",
                        "https://twitter.com/abhilashi",
                        "https://twitter.com/subhash_karri",
                        "https://openquest.xyz/",
                        "https://docs.zerowallet.org/",
                        "http://Ethresear.ch",
                        "https://ethresear.ch/u/madhavanmalolan",
                        "https://github.com/questbook/chains/blob/main/chains/optimism-mainnet.yaml",
                        "https://gov.optimism.io/t/grant-proposal-template/3233"
                    ],
                    "GPT-summary": "The post is a proposal for a decentralized grant management platform called Questbook, which is built on Optimism. The proposal aims to improve the grant program in two specific dimensions: enforcing on-chain financial controls and attracting high-quality pseudonymous builders. The proposal offers a value proposition by allocating OP tokens to fund pseudonymous applications/credentialing, on-chain financial controls, impact measurement/project delivery, and operations. The post also provides relevant links, team member info, and usage metrics.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Interoperability and Scaleability",
                        "Privacy, Security and risk management",
                        "Community and engagement",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.553691904904776
                },
                {
                    "author_link": "https://gov.optimism.io/u/mentalist0x",
                    "index": "2",
                    "likes": "1",
                    "time": "06/02/2023-18:58:14",
                    "content": "Clarification about the No Sale Rule Based on feedback regarding the No Sale Rule we’d like to make it explicit that all participants (Domain Allocators, Program Manager, Builders) will have to adhere to the rule. The tokens they receive as part of the proposed program must be used to increase their involvement in the OP ecosystem or be further passed down to incentivise a new wave of users. @lavande we’d like to clarify this in the proposal. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 4.968013468013468
                }
            ]
        }
    ],
    "group_index": "513"
}