{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/governance-weekly-recap/3352",
            "title": "Governance Weekly Recap ",
            "index": 3352,
            "category": [
                "\\xf0\\x9f\\x93\\xa2 Updates and Announcements",
                "Governance Updates"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/Boardroom",
                    "index": "1",
                    "likes": "27",
                    "time": "22/08/2022-22:30:39",
                    "content": "Hi all - duncand from Boardroom here  Part of our team’s mission is to increase informed participation in governance, and as a project supporting Optimism voters we thought it would be useful to provide a weekly recap of recent governance activity in the Optimism community. While the Foundation releases a fantastic general weekly recap, we feel a governance-focused summary will be useful for delegates and voters due to the rapid pace of governance news and updates. When appropriate we’ll also note a few specific areas for action on timely subjects. Within our weekly recap, we’ll provide a look back at:  Proposals Governance changes Impactful operating suggestions, and Critical governance-related discussions across Discourse, Twitter, and Discord.  The recap is intended to provide an overview of what’s happening in governance and easy access to the most critical information—so that it’s easy to stay up-to-date and make informed decisions. The first recap will be posted today. We’d love to hear your feedback and any suggestions you have! ",
                    "links": [
                        "https://twitter.com/optimismfnd/status/1560699894280531968?s=21&t=mG0pTSc9C4kNDZVMKh4taw",
                        "https://gov.optimism.io/t/tooling-utilities-nominations-for-rpgf2/4639/84"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.004385964912281
                },
                {
                    "author_link": "https://gov.optimism.io/u/Boardroom",
                    "index": "2",
                    "likes": "18",
                    "time": "22/08/2022-22:50:14",
                    "content": " Week of August 15, 2022 TL;DR: Optimism is in the midst of a reflection period and considering significant updates to the governance process. See below for all the details.  Summary A brief recap of where we’re at (it’s been busy!):  Season 1 of Optimism Governance voting ended on August 3rd with Voting Cycle #4. We entered the second week of a reflection period during which ideas about and feedback on the governance process have been actively solicited. A special Voting Cycle #5 will be held from August 25 through September 7 to vote on proposed governance process improvements. Season 2 will begin on September 8 with Voting Cycle #6, which will enact any governance improvements passed in the previous cycle. See this governance update from @ben-chain for a full review.   Proposed Changes  Operating Manual Optimism’s Operating Manual, which describes the mechanics of the governance process, is being updated by the Foundation in response to observations made and feedback received. Draft v0.2,  will go into effect with Season 2. Among the many changes contemplated:  switching from a two-week to a three-week voting cycle increasing to two the number of delegate approvals needed for a proposal to move to a vote changing the quorum from 10% to 30% of votable $OP supply   This is the time to provide feedback on the draft if you haven’t already.  Proposal Template A new grant proposal template has also been put forward by the Foundation during this reflection period. The draft template incorporates a number of suggestions from the community and should make the merits of each proposal easier to assess.  Provide your feedback here.  Governance Committees In response to observations made of Season 1 and in keeping with their experimental spirit, the Optimism Foundation has proposed the use of Governance Committees in Season 2. The committees (five in different areas are suggested) are meant to help distribute the work of assessing proposals, which has been overwhelming, particularly for delegates.  The details of committee formation and responsibility are worth an attentive read. Proposals for committees are to follow a specific template and will be voted upon in special Voting Cycle #5 (which opens this week, on August 25). Here are the committee proposals that have been put forward:   @katie’s proposal for a DeFi committee.  @Gonna.eth’s Committee Proposal for DeFi  @MoneyManDoug’s proposal for a DeFi committee  @Krzkaczor’s proposal for a tooling committee Plus, a query from @OPUser about the utility of a “conflict committee”   In The Forums   Delegate updates: The Delegate Updates Thread collects communications directly from a number (currently six) of active Optimism delegates.  Delegate commitments: Keep your eye on this thread to learn more about each delegate.  Valuable observations: @raho and @tnorm provide productive commentary on Season 1 of the Governance Fund. They’ve also created a spreadsheet that tracks the participation rate (among other things) of the top 50 delegates.  Pause for decentralization? @polynya suggests pausing Governance Fund voting cycles until “minimum viable decentralization” is achieved.  OP for gas? Long thread about whether to switch OP from being a governance token.   On Governance Calls Governance calls are an excellent way to stay up-to-date and contribute:   @katie is organizing and hosting bi-weekly governance calls, and they’re open to anyone. Recordings of the first call and the second call are available. The next call is scheduled for August 30.   Download the .ics file, import it to your calendar, and read the previous call notes here.  On Twitter   Delegate dashboard: Michael Silbering points us to Optimism’s dashboard on Dune.  Poor participation: @polynya argues that delegate participation “is getting very low.”  Token transfers: The Optimism Foundation explains recent $OP transfers from a multisig.  #OPSummer is heating up!  ",
                    "links": [
                        "https://gov.optimism.io/t/governance-update-3/3232",
                        "https://gov.optimism.io/t/draft-operating-manual-v0-2/3234",
                        "https://gov.optimism.io/t/draft-operating-manual-v0-2/3234",
                        "https://gov.optimism.io/t/grant-proposal-template-v2/3233",
                        "https://gov.optimism.io/t/grant-proposal-template-v2/3233",
                        "https://gov.optimism.io/t/introducing-governance-committees/3238",
                        "https://gov.optimism.io/t/introducing-governance-committees/3238",
                        "https://gov.optimism.io/t/phase-1-committee-formation-proposal-template/3281",
                        "https://gov.optimism.io/t/draft-s02-committee-proposal-decentralized-finance-governance-committee/3286",
                        "https://gov.optimism.io/t/draft-s02-committee-proposal-defi/3320",
                        "https://gov.optimism.io/t/draft-s02-committee-proposal-category-defi/3318",
                        "https://gov.optimism.io/t/draft-s02-committee-proposal-tooling-governance-committee/3333",
                        "https://gov.optimism.io/t/how-do-you-feel-about-a-conflict-committee/3117",
                        "https://gov.optimism.io/c/governance/delegate-updates/45",
                        "https://gov.optimism.io/t/delegate-commitments/235",
                        "https://gov.optimism.io/t/governance-fund-observations/3257",
                        "https://docs.google.com/spreadsheets/d/1G-NRFYuS_Vin3kIDum4-7RdaTVFVUqS0gu1XiLH80og/edit#gid=0",
                        "https://gov.optimism.io/t/proposal-to-pause-governance-fund-voting-cycles-till-minimum-viable-decentralization-is-achieved/3215",
                        "https://gov.optimism.io/t/change-the-use-of-op-tokens-from-a-governance-token-to-the-main-network-token-for-gas-payment/2245/12",
                        "https://drive.google.com/file/d/1K9s5KFE6FgLgEw6GZ_UxSsUhz3kzsGOT/view",
                        "https://gov.optimism.io/t/second-governance-call-august-16th/3262/6",
                        "https://zoom.us/meeting/tJIpdO2pqT8uGdVO-kmr8EsbBoSCx0YU-aqf/ics?icsToken=98tyKuCuqjguG9ORtBqGRowABojCLOvwtilbjadrs1LuDjILRxD0FO1xEaovKe2d",
                        "https://gov.optimism.io/t/second-governance-call-august-16th/3262/7",
                        "https://twitter.com/MSilb7/status/1557707788373082117?s=20&t=fwkvWApj5hCBeOOzlECn7A",
                        "https://twitter.com/apolynya/status/1559394119562039297?s=20&t=yOqzuN3ABfbD1lURTd5v0w",
                        "https://twitter.com/optimismFND/status/1560033726532182018",
                        "https://twitter.com/optimismFND/status/1559916518246211584?s=20&t=NPHS4wKKJn34BLLsYln79Q"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.7280994468494475
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "3",
                    "likes": "2",
                    "time": "23/08/2022-08:56:48",
                    "content": "This is good summary, thank you for doing this. We can also use such update to measure engagement, if same stuff is repeating or list is getting smaller, we know that the overall engagement is going down and vice-versa. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.453703703703704
                },
                {
                    "author_link": "https://gov.optimism.io/u/Boardroom",
                    "index": "4",
                    "likes": "12",
                    "time": "29/08/2022-22:54:36",
                    "content": " Week of August 22, 2022  Summary Season 1 has ended, and the reflection period is over. Welcome to Voting Cycle #5, which began on August 25 and runs through September 7 (7PM GMT). This is a special, two-week cycle dedicated to proposals meant to improve Optimism governance processes.  Proposals We have five proposals up for voting, each one for a Governance Committee (the purposes of which are described in full here):   @katie’s proposal for a DeFi committee  @Gonna.eth’s Committee Proposal for DeFi  @MoneyManDoug’s proposal for a DeFi committee  @Krzkaczor’s proposal for a tooling committee  @jrocki.eth’s proposal for an NFT & gaming committee  Up to four committees will be approved for Voting Cycle #6. Committee proposals must first reach quorum, and then be approved by majority vote; the top four proposals that have met these thresholds will be implemented for the next cycle. Keep in mind that this could mean that fewer than four committees will be in place.  Vote now! (on Snapshot or on Boardroom) Season 2: Voting Cycle #6 begins on September 8 (7PM GMT) and will run for three weeks until September 28 (7PM GMT). The revised Operating Manual will go into effect with this Cycle; read through it carefully and take note of changes.  Provide your feedback on Governance Fund proposals being drafted for Cycle #6.  In Discord There’s a new gov-temp-check channel with a bot that makes it easy to post your proposal for a temp-check. Should delegates vote for themselves? @millie asks whether delegates who are on the proposed committees above should be voting for themselves—with all the voting power delegated to them.  In the Forums What about the self-delegation of tokens received in grants? @Defi_LATAM_axlvaz raises important questions (some of which were previously raised) about a recent case of self-delegation, and the discussion that follows reveals different stances about how a governance token like $OP should (and shouldn’t) be used. The revised grant proposal template, which is now in effect, states that “the expectation is that token grants will not be self-delegated for use in governance”; but if you plan to self-delegate, “this should be made clear in your grant proposal along with your reasoning.” Debate on the potential effect and utility of governance committees continues. The committees are an experiment for Season 2, at which point they will be re-evaluated.  On Twitter The Optimism Foundation took stock: Check out the OP Summer thread here, read the summary, and examine the dashboard of ecosystem programs funded so far.  Governance Calls Calls are held bi-weekly. Put them on your calendar.  Join the next call, on Tuesday, August 30 (5PM GMT). Quick Gov Links: Working Constitution | Operating Manual v0.2 | Proposal template | Delegates | Snapshot | Optimism on Boardroom ",
                    "links": [
                        "https://gov.optimism.io/t/draft-s02-committee-proposal-decentralized-finance-governance-committee/3286",
                        "https://gov.optimism.io/t/draft-s02-committee-proposal-defi/3320",
                        "https://gov.optimism.io/t/draft-s02-committee-proposal-category-defi/3318",
                        "https://gov.optimism.io/t/draft-s02-committee-proposal-tooling-governance-committee/3333",
                        "https://gov.optimism.io/t/draft-so2-committee-proposal-nfts-gaming-group-a/3364",
                        "https://snapshot.org/#/opcollective.eth",
                        "https://boardroom.io/optimism/proposals",
                        "https://gov.optimism.io/t/operating-manual-of-the-optimism-collective-v0-2-0/3370",
                        "https://gov.optimism.io/c/proposals/38",
                        "https://discord.com/channels/667044843901681675/1011238484373159956",
                        "https://discord.com/channels/667044843901681675/989611992295813241/1012014676609089656",
                        "https://gov.optimism.io/t/another-case-of-self-delegation-of-op-tokens-received-in-grants/3372",
                        "https://gov.optimism.io/t/i-want-to-discuss-project-boosting-their-delegate-power-with-governance-fund/2961",
                        "https://gov.optimism.io/t/grant-proposal-template/3233",
                        "https://gov.optimism.io/t/introducing-governance-committees/3238/44",
                        "https://twitter.com/optimismFND/status/1562171325858271232?s=20&t=_XGYFWYvc-we_MDX9fkLcA",
                        "https://optimism.mirror.xyz/BdCGX9klPs2MpT8zywJhNIiTdD3zFpRBb8a4WZc5AKs",
                        "https://www.notion.so/26d856d5ad7c4fda919c62e839cf6051",
                        "https://zoom.us/meeting/tJIpdO2pqT8uGdVO-kmr8EsbBoSCx0YU-aqf/ics?icsToken=98tyKuCuqjguG9ORtBqGRowABojCLOvwtilbjadrs1LuDjILRxD0FO1xEaovKe2d",
                        "https://gov.optimism.io/t/third-op-governance-call-august-30th-and-looking-for-future-hosts/3365",
                        "https://gov.optimism.io/t/working-constitution-of-the-optimism-collective/55",
                        "https://gov.optimism.io/t/operating-manual-of-the-optimism-collective-v0-2-0/3370",
                        "https://gov.optimism.io/t/grant-proposal-template/3233",
                        "https://app.optimism.io/delegates",
                        "https://snapshot.org/#/opcollective.eth",
                        "https://boardroom.io/optimism/overview"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.775720373376624
                },
                {
                    "author_link": "https://gov.optimism.io/u/Boardroom",
                    "index": "5",
                    "likes": "10",
                    "time": "05/09/2022-19:38:25",
                    "content": " Week of August 29, 2022  Summary We’re nearing the end of Voting Cycle #5, and ramping up for Voting Cycle #6. Remember that the new proposal template is now in effect, as are the new procedures outlined in the updated Operating Manual.  Proposals There are five proposals up for voting in Cycle #5, which ends this Wednesday, September 7 (7PM GMT). Each one is for a Governance Committee; the top four Governance Committees will begin their work with Voting Cycle #6 — later this week!  DeFi Committee [Group A] DeFi Committee [Group B] DeFi Committee [Group C]  Tooling & Infrastructure Committee [Group A]  NFT & Gaming Committee [Group A]   There’s still time to vote on Snapshot or on Boardroom. Over 9,000 wallets have voted for each proposal so far   A new proposal rhythm will begin with Voting Cycle #6, following a three-week pattern as described in the Operating Manual:  Week 1: proposals labeled [Draft] are posted in the forum for community feedback (there’s also a dedicated temp-check channel in Discord). Week 2: Delegate feedback. Two delegates with >0.5% of the current votable token supply must explicitly indicate approval of a given proposal in the relevant discussion thread in order for the proposal to move to the Voting Cycle Roundup thread in the forum. Week 3: Voting. Proposals in the Voting Cycle Roundup thread that meet the above requirements will be moved to Snapshot for voting.  As per the Operating Manual: “Each ‘week’ runs from Wednesday at 19:00p GMT (12p PST) until Tuesday at 19:00 GMT (12p PST).” The quorum threshold for Governance Fund (Phase 1) is now 30% of votable $OP supply. The approval threshold is 51%.  Provide your feedback on Governance Fund proposals being drafted for Cycle #6.  In Discord Given the high number of delegates implicated in the Governance Committee proposals for Cycle #5, Reformed_Normie asks whether “abstain” votes count towards quorum. @diligit pointed out in the forum that the answer should be specified in the Manual.  In the Forums Soulbound badges in Optimism? @0xbendo (from Otterspace) makes the suggestion. This recalls the “crown for delegates” discussion — an idea to make it clear which forum participants are delegates with >.5% of voting power. See recent updates from @Bobbay_StableLab and @GFXlabs in the collection of delegate communications threads.  On Twitter @linda put up a poll asking whether DAO delegates should vote on proposals when there is a potential (disclosed) conflict of interest, and then observes some of the possible drawbacks to abstaining. Boardroom spoke with @fig and @GFXlabs about their proposal for a DeFi Governance Committee in the latest Roundup (brief proposal discussion begins around minute five).  Governance Calls Discussion of governance committees was the main feature of last week’s call. Notes and a link to the recording can be found here.  Join the next call on September 13 (5PM GMT, though that may change). Quick Gov Links: Working Constitution | Operating Manual v0.2 | Proposal template | Delegates | Snapshot | Optimism on Boardroom ",
                    "links": [
                        "https://gov.optimism.io/t/operating-manual-of-the-optimism-collective-v0-2-0/3370",
                        "https://gov.optimism.io/t/introducing-governance-committees/3238",
                        "https://gov.optimism.io/t/s02-committee-proposal-decentralized-finance-governance-committee-group-a/3286",
                        "https://gov.optimism.io/t/draft-s02-committee-proposal-category-defi-group-b/3318",
                        "https://gov.optimism.io/t/draft-so2-committee-proposal-defi-group-c/3320",
                        "https://gov.optimism.io/t/draft-s02-committee-proposal-tooling-governance-committee/3333",
                        "https://gov.optimism.io/t/draft-so2-committee-proposal-nfts-gaming-group-a/3364",
                        "https://snapshot.org/#/opcollective.eth",
                        "https://boardroom.io/optimism/proposals",
                        "https://gov.optimism.io/t/operating-manual-of-the-optimism-collective-v0-2-0/3370",
                        "https://discord.com/channels/667044843901681675/1011238484373159956",
                        "https://gov.optimism.io/c/proposals/38",
                        "https://discord.com/channels/667044843901681675/968498307913637919/1014234907557511219",
                        "https://gov.optimism.io/t/operating-manual-of-the-optimism-collective-v0-2-0/3370",
                        "https://gov.optimism.io/t/introducing-otterspace-a-soulbound-badge-solution-for-daos/3221",
                        "https://gov.optimism.io/t/crown-for-delegates/3123/15",
                        "https://gov.optimism.io/c/governance/delegate-updates/45",
                        "https://twitter.com/ljxie/status/1565402029182304264?s=20&t=S-Iq1EW393igx-HFefA-9g",
                        "https://twitter.com/boardroom_info/status/1565741207078154240?s=20&t=S-Iq1EW393igx-HFefA-9g",
                        "https://gov.optimism.io/t/third-op-governance-call-august-30th-and-looking-for-future-hosts/3365/12",
                        "https://gov.optimism.io/t/working-constitution-of-the-optimism-collective/55",
                        "https://gov.optimism.io/t/operating-manual-of-the-optimism-collective-v0-2-0/3370",
                        "https://gov.optimism.io/t/grant-proposal-template/3233",
                        "https://app.optimism.io/delegates",
                        "https://snapshot.org/#/opcollective.eth",
                        "https://boardroom.io/optimism/overview"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.515702479338843
                },
                {
                    "author_link": "https://gov.optimism.io/u/olimpio",
                    "index": "6",
                    "likes": "3",
                    "time": "05/09/2022-22:21:00",
                    "content": "Thanks for your recap. Very good work. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.7749999999999995
                },
                {
                    "author_link": "https://gov.optimism.io/u/Boardroom",
                    "index": "7",
                    "likes": "7",
                    "time": "12/09/2022-19:59:18",
                    "content": " Week of September 5, 2022  Summary We’re now in the first week of Voting Cycle #6, with new proposals being crafted and set before the community. @ben-chain has summarized governance process changes from the reflection period and Voting Cycle #5, re-iterated the purpose and goals of the Governance Fund, and provided a look ahead to the full Season 2. Four Governance Committees have been established and will begin their work this Cycle. @lavande has provided guidance for the committees. Expect feedback from each committee before the third day of third week of this Cycle; committees will post their recommendations in dedicated threads, such as this one. This week’s governance call (Tuesday, September 13, 5PM GMT) may include discussion of how the committees will distribute their work.  Proposals A number of proposals have been submitted for community review — collected in this thread. Those proposals that are marked “[Review]” by this Tuesday, 7PM GMT will enter the second week of the Cycle, which consists of delegate feedback. A retrospective and brief analysis of proposals approved in Season 1 has been posted by @jackanorak.  Provide your feedback on Governance Fund proposals being drafted for this Cycle.  In the Forums A serious, lengthy, and at times heated debate about Governance Committees took place in the forums and on Discord. It concerned, among other things, the level of expertise needed to participate fruitfully in committees, whether someone should be able to serve on more than one committee, and whether proposed committee members should or should not have abstained from voting on committee proposals.  Keep questions and considerations in mind as we proceed through Season 2. Governance Committees are an experiment limited (for the moment) to this Season, after which the community will reflect on their utility. Should protocols be discouraged from borrowing against their granted OP? @diligit asks that we use the filters on the the delegate information page to promote “diversification of voting power and more decentralization.”  In Discord A quick overview of Season 2 Cycles and dates is provided by @lavande. There were issues in Voting Cycle #5 with certain multi-sig wallets not being able to cast their votes, and questions about how votes not counted would have affected the outcome. Given the above problem, there were requests to approve all five proposed Governance Committees. The Optimism Foundation ultimately decided to stay with the original plan of four committees, as explained fully here. Here’s another good discussion among delegates about whether those who were on proposed Governance Committees should or should not have abstained from voting on committees.  On Twitter   Optimists are in Berlin for @dappcon_berlin and ETHBerlin. Here’s where they’ll be. The URL for the list of OP Summer incentives programs has changed.   Governance Calls  Join the next call, hosted by @michael, on September 13 (5PM GMT). The agenda is posted in this thread. Quick Gov Links: Working Constitution | Operating Manual v0.2 | Proposal template | Delegates | Snapshot | Optimism on Boardroom ",
                    "links": [
                        "https://gov.optimism.io/t/committees-next-steps-for-season-2/3436",
                        "https://gov.optimism.io/t/defi-committee-c-season-2-recommendations/3437",
                        "https://gov.optimism.io/t/4th-op-community-governance-call-september-13th-10am-pt-1pm-et-7pm-cet/3428",
                        "https://gov.optimism.io/c/proposals/38",
                        "https://gov.optimism.io/t/op-season-1-proposals-retrospective/3417",
                        "https://gov.optimism.io/c/proposals/38",
                        "https://gov.optimism.io/t/draft-so2-committee-proposal-defi-group-c/3320/67",
                        "https://gov.optimism.io/t/grant-proposal-template/3233/16",
                        "https://gov.optimism.io/t/update-the-delegates-page-areas-of-interest/3442",
                        "https://app.optimism.io/delegates",
                        "https://discord.com/channels/667044843901681675/991340698995544176/1017467668992901201",
                        "https://discord.com/channels/667044843901681675/968498307913637919/1017451551368957952",
                        "https://discord.com/channels/667044843901681675/989611992295813241/1017897894864490626",
                        "https://discord.com/channels/667044843901681675/989611992295813241/1016743473925328958",
                        "https://twitter.com/optimismFND/status/1568260454644056065?s=20&t=GV47z9HzyLLDLpoZ8l7dwg",
                        "https://twitter.com/dappcon_berlin",
                        "https://www.notion.so/b9ecb047047c4dbe82bd3719ae890091",
                        "https://www.notion.so/26d856d5ad7c4fda919c62e839cf6051",
                        "https://twitter.com/optimismFND/status/1568316325961027584?s=20&t=Ch6cPm30hgJKC7e55IOAWw",
                        "https://www.google.com/url?q=https://us02web.zoom.us/j/88063153058?pwd%3DaGRoM3dxTERlUndZS0diamxNUlJNdz09&sa=D&source=calendar&usd=2&usg=AOvVaw21d6xH45DfcnyUhWKmGXgZ",
                        "https://gov.optimism.io/t/4th-op-community-governance-call-september-13th-10am-pt-1pm-et-7pm-cet/3428",
                        "https://gov.optimism.io/t/working-constitution-of-the-optimism-collective/55",
                        "https://gov.optimism.io/t/operating-manual-of-the-optimism-collective-v0-2-0/3370",
                        "https://gov.optimism.io/t/grant-proposal-template/3233",
                        "https://app.optimism.io/delegates",
                        "https://snapshot.org/#/opcollective.eth",
                        "https://boardroom.io/optimism/overview"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.888032106782106
                },
                {
                    "author_link": "https://gov.optimism.io/u/Boardroom",
                    "index": "8",
                    "likes": "8",
                    "time": "19/09/2022-17:50:45",
                    "content": " Week of September 12, 2022  Summary We’re reaching the end of the second week of Voting Cycle #6 — and about to enter the third (or voting) week. Here’s a handy Google calendar for Optimism governance, created by @bobby. Need to review the proposal and voting cycle process? The Operating Manual is the ultimate source of information concerning governance procedures.  Keep an eye out for Governance Committee recommendations this week, and be prepared to vote on proposals that have made it into the Voting Cycle #6 Roundup thread.  Proposals Roundup: At the time of writing there are two proposals that have made it into the Voting Cycle #6 Roundup thread, which is reserved for those that have received explicit approval from two delegates with >.5% voting power. dHedge: dHedge describes itself as the “only decentralized asset management platform currently on Optimism.” This revised proposal asks for 350k OP to split across DHPT (dHEDGE Pool Token) Incentives (70%) and Liquidity Mining (30%) over the course of six months. Otterspace: Otterspace is “building a flexible and easy-to-use infrastructure for DAOs to use non-transferable NFTs” (Badges), which have a number of different uses. The proposal asks for 100k OP, 70% of which would be used to incentivize user adoption, onboarding users to Optimism “with enough funds to mint their first badge and experiment with a few other transactions on Optimism.” The remaining 30% would be used to incentivize integration partner adoption.  Provide your feedback on Governance Fund proposals being drafted for this Cycle (the relevant ones are tagged “cycle 6”).  In the Forums Report: State of Optimism Governance. @tnorm and @raho from Messari have written up this insightful report, which reflects back on Season 1. A helpful proposal process flowchart was posted by @OPUser in their delegate communication thread. Anti-rug pull suggestion: @ovetta wonders whether a phased rollout of funds to grantees, as they reach successive milestones, might be worthwhile. The grant proposal template was updated to include a field that asks the proposer to identify the voting cycle they are participating in. Aelin Protocl GF Phase 0 Token Distribution. @OPUser has raised the question of whether the protocol has significantly changed how it had proposed to deploy the 900K OP it received.  In Discord Optimism will be re-organizing the forum and moving it to a self-hosted site. Here’s a productive discussion among Governance Committee delegates about how to sort proposals to review, and at what stage to review them. Governance Committee channels: the Tooling committee as well as DeFi committees A and C have dedicated discussion channels.  Check in on the #gov-temp-check channel to respond to proposals looking for feedback.  On Twitter This week in Optimism. Introducing OP Radio, a weekly Twitter Spaces event “covering a wide range of topics in the Optimism ecosystem.” First on deck, @qx_app, on Wednesday, September 21, 3PM GMT. “WTF is retroactive public goods funding?” @binji_x lays it out. @flipsidecrypto highlights this Optimism dashboard by @SocioCrypto. (And, separately, all Optimism data has been backfilled at Flipside: “queries are now fully supported, from beginning to end infinity.”)  Governance Calls The most recent call has been summarized by @michael. The conversation was lively, and included such topics as how the Foundation will handle voting problems going forward, creating the governance culture we want to create, and how the two DeFi Governance Committees will split their assessment work.  Keep your eyes peeled for details about the next call, which will be on September 27. Quick Gov Links: Working Constitution | Operating Manual v0.2 | Proposal template | Delegates | Snapshot | Optimism on Boardroom ",
                    "links": [
                        "https://gov.optimism.io/t/operating-manual-of-the-optimism-collective-v0-2-0/3370",
                        "https://gov.optimism.io/t/voting-cycle-6-roundup/3481",
                        "https://gov.optimism.io/t/voting-cycle-6-roundup/3481",
                        "https://gov.optimism.io/t/review-gf-phase-1-proposal-dhedge-v2-revised/3321",
                        "https://gov.optimism.io/t/review-gf-phase-1-proposal-otterspace/3445",
                        "https://gov.optimism.io/c/proposals/38",
                        "https://gov.optimism.io/t/state-of-optimism-governance/3489",
                        "https://gov.optimism.io/t/opuser-delegate-communication-thread/2777/11",
                        "https://gov.optimism.io/t/anti-rug-pull-suggestion/3467",
                        "https://gov.optimism.io/t/grant-proposal-template/3233/19",
                        "https://gov.optimism.io/t/we-need-to-address-aelin-protocl-gf-phase-0-token-distribution/3484",
                        "https://discord.com/channels/667044843901681675/968498307913637919/1019985814916169799",
                        "https://discord.com/channels/667044843901681675/968498307913637919/1020040473542398043",
                        "https://discord.com/channels/667044843901681675/1019310579984371842",
                        "https://discord.com/channels/667044843901681675/1019311447706189968",
                        "https://discord.com/channels/667044843901681675/1019514978128117771",
                        "https://discord.com/channels/667044843901681675/1011238484373159956",
                        "https://twitter.com/optimismFND/status/1568279948410130432?s=20&t=RANxJJDN8sAyARz3njgyeA",
                        "https://twitter.com/optimismFND/status/1571849901650366466?s=20&t=GO0ym0uvhWpfgSgdB0WzYA",
                        "https://twitter.com/qx_app",
                        "https://twitter.com/binji_x/status/1524199614412435457?s=20&t=RANxJJDN8sAyARz3njgyeA",
                        "https://twitter.com/flipsidecrypto/status/1570825982659166208?s=20&t=RANxJJDN8sAyARz3njgyeA",
                        "https://twitter.com/flipsidecrypto/status/1570520564359659522?s=20&t=RANxJJDN8sAyARz3njgyeA",
                        "https://gov.optimism.io/t/recap-community-call-4-september-13th/3457",
                        "https://gov.optimism.io/t/working-constitution-of-the-optimism-collective/55",
                        "https://gov.optimism.io/t/operating-manual-of-the-optimism-collective-v0-2-0/3370",
                        "https://gov.optimism.io/t/grant-proposal-template/3233",
                        "https://app.optimism.io/delegates",
                        "https://snapshot.org/#/opcollective.eth",
                        "https://boardroom.io/optimism/overview"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.483939393939394
                },
                {
                    "author_link": "https://gov.optimism.io/u/Boardroom",
                    "index": "9",
                    "likes": "8",
                    "time": "26/09/2022-16:30:40",
                    "content": " Week of September 19, 2022  Summary Well here we are in the final, voting week of Cycle #6. There was a flurry of activity (and some confusion) as teams got their proposals ready to be included in the Roundup and the newly formed Governance Committees got to work. Some proposals didn’t make it in time for this Cycle, but you can still take a look at what’s being put forward for the next Cycle.  Proposals Summaries of the dHedge and Otterspace proposals were in included in last week’s recap (see above); here are summaries of the remaining eight: Across Protocol claims to be “the fastest, cheapest and most secure bridge between L1 and L2s.” With this proposal Across asks for 750k OP, 75% of which will be used to “subsidize bridge fees for users that would like to transfer assets to Optimism.” The remaining portion will be allocated as a reward to anyone who operates a relayer on Optimism. Across will also provide up to 320% ACX as a co-incentive for those bridging to Optimism. Across believes that the proposed incentive programs could create from $500m to $1b of volume on Optimism. Bankless Academy describes itself as a “free-to-access, open-source, education hyper-structure seeking to empower internet society with the information and tools necessary to achieve financial self-sovereignty.” The Academy does this by creating lessons or “quests” that guide the user through the experience of using progressively more complex web3/crypto tools and platforms. This proposal asks for 33,000 $OP, 60% of which will be distributed to contributors building the lessons for onboarding Academy users to Layer 2s (including Optimism); the remainder will go to the community treasury to support future development of the Academy. Interest Protocol, from GFX Labs, ****is as a “fractional reserve, overcollateralized borrowing protocol.” Deployment to Optimism is predicted in the “immediate future” should the grant be approved. Importantly, “Interest Protocol is designed to allow tokens held as collateral to still be able to participate in governance via delegation controlled by the user,” meaning OP holders could use the protocol without losing their ability to participate in Optimism governance. The proposal requests 31,764 OP to provide 50% of estimated developer costs to deploy the protocol on Optimism. Interest Protocol would then be able to accept OP as collateral, creating a “demand sink” for the token without sacrificing the token holder’s ability participate in governance. The Kromatika dApp was first active on Optimism in December of 2021 and is one of the few (if not the only) DEX protocols with automated limit orders and a swap aggregator on Optimism. As the proposal states, “DEX trading is complicated, expensive and is limited in terms of convenience when compared to CEX trading. Kromatika hopes to solve this problem for the Optimism Ecosystem.” Kromatika’s goal is to make “DEX trading simple, accessible, and affordable on Ethereum L1 and L2’s.” The proposal asks for 300k OP. OptiChads is focused on “improving Health & Wellness in Web3 through our art. We have a very active and passionate community of Chads focused on self improvement in and out of the gym.” The proposal asks for 50k OP, 100% of which will be used to incentivize health and wellness behaviors through the use of Web3 quests. As a co-incentive, 50 OptiChad NFTs will be given to the addresses with the highest completion rate. The Revert Compoundor, created by Revert Labs, automates the compounding of fees for liquidity providers on Uniswap V3 — a function that can substantially improve returns for the user. The proposal asks for 240k OP to incentivize users to bring liquidity to Uniswap on Optimism (estimated to increase by ~20m USD) via the Compoundor. 100% of OP incentives will go to Compoundor liquidity providers over the course of three months. “Socket is an interoperability protocol for secure & efficient data and asset transfers across chains.” The project aims to create “seamless user onboarding,” which is, as the proposal describes in detail, often complicated, onerous, and expensive. One million OP are requested, 60% of which would be used to subsidize 90% of fees for every user that onboards to Optimism via Socket. The remaining 40% is allocated to builders that integrate Socket into their UX or their dApps. Tarot is a decentralized lending and leveraged yield farming protocol that has been on Optimism since May of 2022. This proposal, which was initially introduced in mid July, requests 600k OP, 90% of which will be “allocated to liquidity bribes and incentivization mechanisms on Velodrome, Beethoven X, and/or other major DEXs on Optimism to incentivize TAROT-based liquidity.” The remaining 10% is allocated to the Tarot team, which will pair the OP with TAROT to provide initial liquidity on Optimism for a minimum of 12 months.  Check out the Governance Committee Recommendations concerning the above proposals:  DeFi Committee A  DeFi Committee C  NFT & Gaming Committee Tooling Committee   Vote now! — voting is live only until September 28, 7PM GMT. That’s Wednesday.  In the Forums Shadow Governance Committee: DeFi Committee B, which is not an official Governance Committee, has posted its recommendations, which are “just suggestions that we hope are coming from a helpful, informed perspective.” This has been, unsurprisingly, controversial. Delegate communication. @polynya has updated their thread, outlining their approach to the new season. Another delegate commitment. @Tjark, on behalf of a collective of PoolTogether community members, has laid out their delegate case. A grant update from PoolTogether, “the front door to defi on Optimism,” has been posted by @Leighton. Proposals for retroactive public goods funding. @Jonas has posted some recommendations for the next experiment.  In Discord Lots of discussion in #gov-general about seeking delegate feedback and approval. Formally signaling that a proposal is ready for the voting cycle is not an indication of a delegate’s endorsement of the proposal itself. Should Governance Committee recommendations be posted earlier in the voting cycle? In the future, Governance Committee recommendations may be linked to in Snapshot. New and improved Gov docs have been put out there, incorporating feedback.  Check in on the #gov-temp-check channel to respond to proposals looking for feedback.  On Twitter This week in Optimism. OP Radio is a weekly Twitter Spaces event “covering a wide range of topics in the Optimism ecosystem” — every Wednesday at 3PM GMT. Optimism Docs are now available as an app for mobile and desktop. Claim your Delegatooor. A proposal tracker, courtesy of @OPGovWatch.  Governance Calls  Join the next call (Discord event link) — which is sure to be lively —  on September 27, 5PM GMT. Call details and agenda items are in this forum post. Quick Gov Links: Working Constitution | Operating Manual v0.2 | Proposal template | Delegates | Snapshot | Optimism on Boardroom ",
                    "links": [
                        "https://gov.optimism.io/t/introducing-governance-committees/3238",
                        "https://gov.optimism.io/c/proposals/38",
                        "https://gov.optimism.io/t/review-gf-phase-1-proposal-dhedge-v2-revised/3321/4",
                        "https://gov.optimism.io/t/review-gf-phase-1-proposal-otterspace/3445",
                        "https://gov.optimism.io/t/review-gf-phase-1-proposal-across-protocol-updated-template/3401",
                        "https://gov.optimism.io/t/review-gf-phase-1-proposal-bankless-academy-v2/3353",
                        "https://gov.optimism.io/t/review-gf-phase-1-interest-protocol-development-deployment-to-optimism/2951",
                        "https://gov.optimism.io/t/review-gf-phase-1-proposal-cycle-6-kromatika/3306",
                        "https://kromatika.finance/",
                        "https://gov.optimism.io/t/review-gf-phase-1-proposal-optichads-nft-project/3430",
                        "https://gov.optimism.io/t/review-gf-phase-1-revert-finance-compoundor/3242",
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-socket/3368",
                        "https://gov.optimism.io/t/review-gf-phase-1-proposal-tarot/3002",
                        "https://gov.optimism.io/t/defi-committee-a-season-2-recommendations/3522",
                        "https://gov.optimism.io/t/defi-committee-c-season-2-recommendations/3437",
                        "https://gov.optimism.io/t/nft-gaming-committee-a-season-2-recommendations/3535",
                        "https://gov.optimism.io/t/tooling-committee-season-2-recommendations/3551",
                        "https://snapshot.org/#/opcollective.eth",
                        "https://gov.optimism.io/t/defi-shadow-committee-b-season-2-recommendations/3549",
                        "https://discord.com/channels/667044843901681675/968498307913637919/1023692162661109771",
                        "https://gov.optimism.io/t/polynya-delegate-communication-thread/3085/5",
                        "https://mirror.xyz/poolcollective.eth/cyQPlTN_JK5SDAMRO-chXlNe3QS7QJ-lUftmcRnPMek",
                        "https://gov.optimism.io/t/delegate-commitments/235/141",
                        "https://gov.optimism.io/t/pooltogether-grant-update/3531",
                        "https://gov.optimism.io/t/proposals-for-retroactive-public-goods-funding-experiment-2/3550",
                        "https://discord.com/channels/667044843901681675/968498307913637919/1021859629111705832",
                        "https://discord.com/channels/667044843901681675/989611992295813241/1022175100671361105",
                        "https://discord.com/channels/667044843901681675/968498307913637919/1022640262171861002",
                        "https://discord.com/channels/667044843901681675/968498307913637919/1023308158162194554",
                        "https://discord.com/channels/667044843901681675/989611992295813241/1022251372076343377",
                        "https://discord.com/channels/667044843901681675/1011238484373159956",
                        "https://twitter.com/optimismFND/status/1573381541316931584?s=20&t=64h3bOCrm7ZQv0vIHJHWkg",
                        "https://twitter.com/optimismFND/status/1571849901650366466?s=20&t=GO0ym0uvhWpfgSgdB0WzYA",
                        "https://twitter.com/OPLabsPBC/status/1573071438894055430?s=20&t=64h3bOCrm7ZQv0vIHJHWkg",
                        "https://twitter.com/qx_app/status/1573067325506736128?s=20&t=64h3bOCrm7ZQv0vIHJHWkg",
                        "https://twitter.com/OPGovWatch/status/1574083526466609152?s=20&t=ii1iCy3AFUkgNRlHjfw5Jg",
                        "https://discord.gg/optimism?event=1022522994570043442",
                        "https://gov.optimism.io/t/5th-op-community-governance-call-september-27th-10am-pt-1pm-et-7pm-cet/3543",
                        "https://gov.optimism.io/t/working-constitution-of-the-optimism-collective/55",
                        "https://gov.optimism.io/t/operating-manual-of-the-optimism-collective-v0-2-0/3370",
                        "https://gov.optimism.io/t/grant-proposal-template/3233",
                        "https://app.optimism.io/delegates",
                        "https://snapshot.org/#/opcollective.eth",
                        "https://boardroom.io/optimism/overview"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.342551507134841
                },
                {
                    "author_link": "https://gov.optimism.io/u/Boardroom",
                    "index": "10",
                    "likes": "8",
                    "time": "03/10/2022-18:38:53",
                    "content": " Week of September 26, 2022  Summary We’re in Week 1 of Voting Cycle #7, and coming up on Week 2, which begins on Thursday, October 6 at 7PM GMT. Week 2 is Governance Committee review week. There have a been a few small but important changes to the Operating Manual, summarized here. These include an update to Governance Committee operations. In particular, “proposals that are not included” in the Roundup thread (see below) by the end of Week 1 (October 5, 7PM GMT) “will not be reviewed by Committees.”  Proposals Seven of the 10 proposals from Voting Cycle #6 passed. See them at a glance by selecting the “passed” tag in the forum and scanning for “cycle-6.” Remember: only those proposals that have “received explicit approval comments from two delegates with >0.5% voting power” will be included in the Cycle #7 Roundup thread.  Take a look through all the proposals tagged “cycle 7,” ask some questions or leave some comments if you are so moved.  In the Forums Delegate communication threads have been updated to include voting rationales. There’s a good exchange about self-delegation, started by @jackanorak, which led to clarification of ambiguity in the grant proposal template. Governance fund accountability: @OPUser has started a thread to provide a “low level overview” of funds “usage and impact on OP ecosystem.” There’s a new delegate commitment from @iover2020 Create a subDAO for OP holders to explore governance? Anyone want to meet up at Devcon?  In Discord Should you delegate to yourself? Still issues for some voting through Snapshot.  Check in on the #gov-temp-check channel to respond to proposals looking for feedback.  On Twitter When your protocol service provider contract comes with governance tokens there’s a “clear first mover advantage,” @francisgowen says. How to handle it? Why retroactive public goods funding (RPGF) matters, by @binji_x. This week in Optimism. OP Radio, a weekly Twitter Spaces event “covering a wide range of topics in the Optimism ecosystem.” Wednesdays at 3PM GMT. ETHonline Optimism Hackathon winners announced. Optimism Kovan testnet will be fully decommissioned on October 5.  Governance Calls A thorough and helpful recap of the last call has been provided by @Michael, who also hosted and moderated. Quick Gov Links: Working Constitution | Operating Manual v0.2 | Proposal template | Delegates | Snapshot | Optimism on Boardroom ",
                    "links": [
                        "https://gov.optimism.io/t/update-to-committee-operations/3571",
                        "https://gov.optimism.io/t/voting-cycle-7-roundup/3586",
                        "https://gov.optimism.io/tag/passed",
                        "https://gov.optimism.io/t/voting-cycle-7-roundup/3586",
                        "https://gov.optimism.io/tag/cycle-7",
                        "https://gov.optimism.io/c/governance/delegate-updates/45",
                        "https://gov.optimism.io/t/lets-settle-once-and-for-all-the-question-of-grantees-self-delegating/3577",
                        "https://gov.optimism.io/t/grant-proposal-template/3233",
                        "https://gov.optimism.io/t/goverance-fund-accountability-an-overview/3591",
                        "https://gov.optimism.io/t/delegate-commitments/235/142",
                        "https://gov.optimism.io/t/delegators-lets-move/3588/2",
                        "https://gov.optimism.io/t/devcon-community-governance-meetup/3573",
                        "https://discord.com/channels/667044843901681675/968498307913637919/1024243412502843402",
                        "https://discord.com/channels/667044843901681675/968498307913637919/1024656537676959825",
                        "https://discord.com/channels/667044843901681675/1011238484373159956",
                        "https://twitter.com/francisgowen/status/1575567331207413763?s=20&t=Ki0czHAT8nYA-fxMUE8nEw",
                        "https://twitter.com/binji_x/status/1575475152929886209?s=20&t=Ki0czHAT8nYA-fxMUE8nEw",
                        "https://twitter.com/optimismFND/status/1575940135967133696?s=20&t=yDmgybh3UB8KcuYKDctcsg",
                        "https://twitter.com/optimismFND/status/1571849901650366466?s=20&t=GO0ym0uvhWpfgSgdB0WzYA",
                        "https://twitter.com/optimismFND/status/1575864604747780096?s=20&t=Ki0czHAT8nYA-fxMUE8nEw",
                        "https://twitter.com/optimismFND/status/1575534790031380488?s=20&t=Ki0czHAT8nYA-fxMUE8nEw",
                        "https://gov.optimism.io/t/recap-community-call-5-september-27th/3572",
                        "https://gov.optimism.io/t/working-constitution-of-the-optimism-collective/55",
                        "https://gov.optimism.io/t/operating-manual-of-the-optimism-collective-v0-2-1/3587",
                        "https://gov.optimism.io/t/grant-proposal-template/3233",
                        "https://app.optimism.io/delegates",
                        "https://snapshot.org/#/opcollective.eth",
                        "https://boardroom.io/optimism/overview"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.548701298701299
                },
                {
                    "author_link": "https://gov.optimism.io/u/Boardroom",
                    "index": "11",
                    "likes": "8",
                    "time": "10/10/2022-09:04:47",
                    "content": " Week of October 3, 2022  Summary We’re coming to the end of week 2 in Voting Cycle #7. Proposals included in the Roundup thread will soon be receiving assessments from Governance Committees and will be posted to Snapshot for Week 3, which is voting week. Week 3 begins this Thursday, October 13, at 7PM GMT and will end on Wednesday, October 19, 7PM GMT.  Optimists are at ETHBogotá and Devcon from the 7th-14th; you can see where they’ll be and check out the project prize list here.  Proposals  Look over the 16 (!) proposals in the Roundup thread. There are already several proposals drafted and tagged for Voting Cycle #8.  In the Forums Continuing thoughts about how to bring “no coiners” into Optimism, via a university or a curriculum, from @TheDoctor. A conflict management guide, courtesy of Gravity DAO via @juankbell, following up on the idea of a conflict committee. Is OP overlooked in social media? asks @Ovetta. Yield farming / staking tokens while maintaining voting rights: At least a couple of projects are working on this.  In Discord The Uniswap Foundation has posted a request-for-comments in their forums to get feedback on the structure of the liquidity mining program for which they were granted $1m OP during Phase 0 of the Governance Fund. What if a proposal changes significantly after having received delegate approval? How flexible or rigid should we be about Voting Cycle rules?  Check in on the #gov-temp-check channel to respond to proposals looking for feedback.  On Twitter “¡que tal nerdos!” It’s this week in Optimism. OP Radio Featured a conversation with PoolTogether. Voter participation in Optimism has increased, according to this thread by @flipsidegov.  Governance Calls The next call is on Tuesday, October 11 at 5PM GMT, hosted by @lavande.  Check out the agenda and keep your eyes peeled for the Zoom link. Quick Gov Links: Working Constitution | Operating Manual v0.2 | Proposal template | Delegates | Snapshot | Optimism on Boardroom ",
                    "links": [
                        "https://gov.optimism.io/tag/committee-recs",
                        "https://snapshot.org/#/opcollective.eth",
                        "https://bogota.ethglobal.com/",
                        "https://app.devcon.org/schedule",
                        "https://www.notion.so/1d77903eed2840929f793df0304d7fba",
                        "https://gov.optimism.io/t/voting-cycle-7-roundup/3586",
                        "https://gov.optimism.io/tag/cycle-8",
                        "https://gov.optimism.io/t/optimism-university/2487/17",
                        "https://gov.optimism.io/t/how-do-you-feel-about-a-conflict-committee/3117/14",
                        "https://gov.optimism.io/t/marketing-online-footprint/3654",
                        "https://gov.optimism.io/t/yield-bearing-staked-tokens-with-vote-rights/3634",
                        "https://discord.com/channels/667044843901681675/989611992295813241/1027631131379642378",
                        "https://discord.com/channels/667044843901681675/989611992295813241/1028428503097552937",
                        "https://discord.com/channels/667044843901681675/968498307913637919/1027986921114325002",
                        "https://discord.com/channels/667044843901681675/1011238484373159956",
                        "https://twitter.com/optimismFND/status/1578460446813696001?s=20&t=W9FYsOE74ZZnGUIpTMAfmw",
                        "https://twitter.com/optimismFND/status/1577673730083459073?s=20&t=W9FYsOE74ZZnGUIpTMAfmw",
                        "https://twitter.com/flipsidegov/status/1578473213859835904?s=20&t=W9FYsOE74ZZnGUIpTMAfmw",
                        "https://gov.optimism.io/t/6th-op-community-governance-call-october-11th-10am-pt-1pm-et-7pm-cet/3664",
                        "https://gov.optimism.io/t/working-constitution-of-the-optimism-collective/55",
                        "https://gov.optimism.io/t/operating-manual-of-the-optimism-collective-v0-2-0/3370",
                        "https://gov.optimism.io/t/grant-proposal-template/3233",
                        "https://app.optimism.io/delegates",
                        "https://snapshot.org/#/opcollective.eth",
                        "https://boardroom.io/optimism/overview"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.334635416666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/Boardroom",
                    "index": "12",
                    "likes": "5",
                    "time": "17/10/2022-16:36:14",
                    "content": " Week of October 10, 2022  Summary We’re in the third week of Cycle #7, which is voting week. We’ve got until October 20 (7PM GMT) to submit our votes for this Cycle. Community feedback week of Voting Cycle #8 begins thereafter.  Proposals I’m not including synopses of the (14) proposals this time around since they have been collected and thoroughly assessed by the various parties noted below. And it would make this a very lengthy post. (If you have a different take, let me know.) Here’s the Voting Cycle Roundup thread for Cycle #7. Note that the Curve, EthernautDAO, and Homora V2 proposals listed there did not make it to the Snapshot this time.  Check out the Governance Committee Recommendations concerning this Cycle’s proposals:  DeFi Committee A [Forum][Discord] DeFi Committee C [Forum][Discord] NFT & Gaming Committee [Forum] [Discord] Tooling Committee [Forum][Discord]   Vote now! — voting is live only until October 20, 7PM GMT. That’s Thursday.  In the Forums DeFi Shadow Committee recommendations for Cycle #7 are posted in this thread. Governance Committees are now expected to publicly identify their assigned proposals by the first day of week 2, and post their recommendations by the last day of week 2. Additionally, as @lavande writes following discussion during a community call, if something isn’t spelled out in Governance Committee procedures, the committees have discretion over their own operations. See the delegate communications category for updates from @ScaleWeb3 — and more likely forthcoming. Delegate areas of interest. There’s more discussion about updating this page. Community Mottos: Check out the brainstorm and contribute something pithy that captures the spirit of community interaction we’re looking for.  In Discord Reminder: Governance Committees are a Season 2 experiment. Debates in #gov-general have been heated. When DAO funding proposals go wrong — chills.  Check in on the #gov-temp-check channel to respond to proposals looking for feedback.  On Twitter Modular Rollup Theory through the Lens of the OP Stack, a talk by @kelvinfichter at Devcon. Social coordination in DAOs — pressing issues. Optimism NFT bridge. Official, via @qx_app. This week in Optimism.  Governance Calls Community Call #6 (last week) was hosted by @lavande and is summarized here.  Join the next call, on Tuesday October 25 (5PM GMT). Quick Gov Links: Working Constitution | Operating Manual v0.2 | Proposal template | Delegates | Snapshot | Optimism on Boardroom ",
                    "links": [
                        "https://gov.optimism.io/t/voting-cycle-7-roundup/3586",
                        "https://gov.optimism.io/t/defi-committee-a-season-2-recommendations/3522/8",
                        "https://discord.com/channels/667044843901681675/1019311447706189968",
                        "https://gov.optimism.io/t/defi-committee-c-season-2-recommendations/3437/6",
                        "https://discord.com/channels/667044843901681675/1019514978128117771",
                        "https://gov.optimism.io/t/nft-gaming-committee-a-season-2-recommendations/3535",
                        "https://discord.com/channels/667044843901681675/1024748846720487544",
                        "https://gov.optimism.io/t/tooling-committee-season-2-recommendations/3551/8",
                        "https://discord.com/channels/667044843901681675/1019310579984371842",
                        "https://snapshot.org/#/opcollective.eth",
                        "https://gov.optimism.io/t/defi-shadow-committee-season-2-recommendations/3549/11",
                        "https://gov.optimism.io/t/committees-next-steps-for-season-2/3436/3",
                        "https://gov.optimism.io/t/introducing-governance-committees/3238",
                        "https://gov.optimism.io/t/introducing-governance-committees/3238/63",
                        "https://gov.optimism.io/c/governance/delegate-updates/45",
                        "https://gov.optimism.io/t/scaleweb3-delegate-communication-thread/3314/12",
                        "https://gov.optimism.io/t/update-the-delegates-page-areas-of-interest/3442/10",
                        "https://gov.optimism.io/t/community-mottos-brainstorm/3681",
                        "https://discord.com/channels/667044843901681675/968498307913637919/1029898391456579715",
                        "https://discord.com/channels/667044843901681675/968498307913637919/1030343588594323456",
                        "https://discord.com/channels/667044843901681675/1011238484373159956",
                        "https://twitter.com/kelvinfichter/status/1581142246048399360?s=20&t=uN7GrG37gZhe0WUjMCvKfA",
                        "https://twitter.com/StableNode/status/1581093736980697089?s=20&t=uN7GrG37gZhe0WUjMCvKfA",
                        "https://twitter.com/optimismFND/status/1580997032420204544?s=20&t=uN7GrG37gZhe0WUjMCvKfA",
                        "https://twitter.com/optimismFND/status/1580997029659975682?s=20&t=kxfLDHwQDTEE_aW7tSIGag",
                        "https://gov.optimism.io/t/recap-community-call-6-october-11th/3682",
                        "https://gov.optimism.io/t/working-constitution-of-the-optimism-collective/55",
                        "https://gov.optimism.io/t/operating-manual-of-the-optimism-collective-v0-2-0/3370",
                        "https://gov.optimism.io/t/grant-proposal-template/3233",
                        "https://app.optimism.io/delegates",
                        "https://snapshot.org/#/opcollective.eth",
                        "https://boardroom.io/optimism/overview"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.488257575757576
                },
                {
                    "author_link": "https://gov.optimism.io/u/Boardroom",
                    "index": "13",
                    "likes": "7",
                    "time": "24/10/2022-13:20:58",
                    "content": " Week of October 17, 2022  Summary Eleven out of 14 proposals passed in Cycle #7. Rough math: 13-14K wallets voted on each proposal, which is significantly more than Cycle #6, which itself outpaced Cycle #5. That’s amazing.  We’re now coming to the end of week 1 of Cycle #8.  Get those delegate approvals and move your proposal to the Roundup thread. This is the last Voting Cycle of Season 2. We’ll be having an off season and reflection period.  Proposals The Voting Cycle #8 Roundup thread has already started, with three entries as of today having received the needed delegate approval.  You can view all Cycle #8 proposals — in “draft,” “review,” or “ready” states — by filtering with categories and tags.  In the Forums Community Mottos brainstorm: there are a few more ideas and contributions — check them out. The delegate updates category includes the latest reflections and recommendations from @GFXlabs, @OPUser, @polynya, @Bobbay_StableLab, and @SEED_LATAM_Joxes. “Incentives aren’t having much of an effect in incentivizing user growth,” says polynya, and suggests Governance Committees “start considering the results of previous incentives in greater depth” so as not repeat ineffective approaches. Synthetix and Phase 0 delegation: @MattL explains the current stance of the Synthetix Ambassadors. “Don’t make Quest a large criteria for airdrop 2,” says @bangrygoose.  In Discord Do delegates have to explain when they vote against a Governance Committee recommendation? Resubmitting a proposal for Cycle #8 after changes have been made requires getting delegate approval again. Delegates to submit solutions to GitHub: See @lavande’s post detailing an experiment to have delegates submit PRs for solutions to the last-minute-change-to-an-already-approved-proposal problem. Can OP received via governance fund grants be sold to fund development and R&D, if so stated in a proposal? Snapshot issues persist for some voters. Here’s the Optimism Foundation’s position.  Check in on the #gov-temp-check channel to respond to proposals looking for feedback.  On Twitter Play OPCraft! This week in Optimism. OP Radio: Autonomous World Building with Lattice.  Governance Calls There’s a community governance call on Tuesday, October 25, (10am PT / 1 pm ET / 7pm CET) hosted by yours truly. All are welcome.  Join in to reflect on Cycle #7 and help shape Optimism governance. Agenda-in-formation posted here. Quick Gov Links: Working Constitution | Operating Manual v0.2 | Proposal template | Delegates | Snapshot | Optimism on Boardroom ",
                    "links": [
                        "https://gov.optimism.io/t/voting-cycle-8-roundup/3742",
                        "https://gov.optimism.io/tags/c/proposals/governance-fund-phase-1-proposals/40/cycle-8",
                        "https://gov.optimism.io/t/community-mottos-brainstorm/3681",
                        "https://gov.optimism.io/c/governance/delegate-updates/45",
                        "https://gov.optimism.io/t/polynya-delegate-communication-thread/3085/8",
                        "https://gov.optimism.io/t/synthetix-ambassadors-phase-0-delegation-2m-op-tokens/3726",
                        "https://gov.optimism.io/t/dont-make-quest-a-large-criteria-for-airdrop-2/3770",
                        "https://discord.com/channels/667044843901681675/968498307913637919/1031669405433737276",
                        "https://discord.com/channels/667044843901681675/968498307913637919/1032285304150839306",
                        "https://discord.com/channels/667044843901681675/968498307913637919/1032756953656598538",
                        "https://discord.com/channels/667044843901681675/989611992295813241/1031655257450758304",
                        "https://discord.com/channels/667044843901681675/989611992295813241/1033055190326202408",
                        "https://discord.com/channels/667044843901681675/1011238484373159956",
                        "https://twitter.com/ChristaSullie/status/1583636052274577409?s=20&t=aP2Rd_TaHaWmDyxNxVOEEQ",
                        "https://twitter.com/optimismFND/status/1583550464355770368?s=20&t=aP2Rd_TaHaWmDyxNxVOEEQ",
                        "https://twitter.com/optimismFND/status/1583550472719589376?s=20&t=aP2Rd_TaHaWmDyxNxVOEEQ",
                        "https://meet.google.com/qgj-eqht-xki",
                        "https://gov.optimism.io/t/7th-op-community-governance-call-october-25th-10am-pt-1pm-et-7pm-cet/3732",
                        "https://gov.optimism.io/t/working-constitution-of-the-optimism-collective/55",
                        "https://gov.optimism.io/t/operating-manual-of-the-optimism-collective-v0-2-0/3370",
                        "https://gov.optimism.io/t/grant-proposal-template/3233",
                        "https://app.optimism.io/delegates",
                        "https://snapshot.org/#/opcollective.eth",
                        "https://boardroom.io/optimism/overview"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.35453869047619
                },
                {
                    "author_link": "https://gov.optimism.io/u/Boardroom",
                    "index": "14",
                    "likes": "5",
                    "time": "31/10/2022-13:28:53",
                    "content": " Week of October 24, 2022  Summary Happy Halloween Optimists!  We’re nearing the end of week two of Voting Cycle #8. Governance Committees will be issuing their recommendations for all the proposals that will be up for voting beginning on Thursday, November 3 at 7pm GMT. Keep your eye on delegate communication threads as well. The #gov-general channel in Discord exploded last week, until @lavande stepped in and provided guidance. The Optimism Foundation is working on an “enforceable delegate code of conduct”; in the meantime, we should be adhering to the Discord and forum codes of conduct.  Proposals  Check out all the proposals in the Voting Cycle #8 Roundup Thread. Voting begins later this week.  In the Forums Season 2 Feedback Thread. Contribute constructive thoughts here ahead of the upcoming Reflection Period. Lots of insight shared already. Discursive health of DAOs. Here’s a brief research survey to complete, about governance. Synthetix and Phase 0 delegation. This continuing thread is both contentious and important for OP governance. Take a read. Concerns about OP governance. @ScaleWeb3 provides some thoughts and an analogy: “The lack of meaningful governance activity in this governance delegate model and the cartelization/oligopoly around grants reminded us of a good old article: Lisk - the mafia blockchain.”  In Discord If you have the capacity, dive into the #gov-general exchanges from this week. Then go outside and touch grass.  Check in on the #gov-temp-check channel to respond to proposals looking for feedback.  On Twitter Optimists at ETHSanFrancisco — see here. This week in Optimism and @jinglejamOP on this episode of OP Radio. What are the top apps on Optimism? 15k OP up for grabs in this metaverse hackathon.  Governance Calls A recording of the most recent Governance Call can be found here. There was an excellent presentation by @haonan and @MSilb7 dissecting the effectiveness (or lack thereof) of the Governance Fund so far.  The next call is scheduled for November 8. Keep your eyes on this calendar for all things Optimism governance. Quick Gov Links: Working Constitution | Operating Manual v0.2 | Proposal template | Delegates | Snapshot | Optimism on Boardroom ",
                    "links": [
                        "https://gov.optimism.io/t/voting-cycle-8-roundup/3742",
                        "https://gov.optimism.io/c/governance/delegate-updates/45",
                        "https://discord.com/channels/667044843901681675/968498307913637919/1034919310264647680",
                        "https://www.notion.so/7902a5bed039471c8ea7ca23fc780e8a",
                        "https://gov.optimism.io/t/rules-of-engagement/5",
                        "https://gov.optimism.io/t/voting-cycle-8-roundup/3742",
                        "https://gov.optimism.io/t/season-2-feedback-thread/3818",
                        "https://forms.gle/dAEr18Bbt43v5mJA7",
                        "https://gov.optimism.io/t/how-good-are-you-at-identifying-governance-topics-research-survey-gauging-discursive-health-of-daos/3817",
                        "https://gov.optimism.io/t/synthetix-ambassadors-phase-0-delegation-2m-op-tokens/3726/18",
                        "https://gov.optimism.io/t/scaleweb3-delegate-communication-thread/3314/13",
                        "https://discord.com/channels/667044843901681675/968498307913637919",
                        "https://discord.com/channels/667044843901681675/1011238484373159956",
                        "https://twitter.com/optimismFND/status/1586118518461939712?s=20&t=KLO0OlJEjJCsZUmWoRX9sw",
                        "https://twitter.com/optimismFND/status/1586115010069422080?s=20&t=KLO0OlJEjJCsZUmWoRX9sw",
                        "https://twitter.com/optimismFND/status/1585015947626426368?s=20&t=KLO0OlJEjJCsZUmWoRX9sw",
                        "https://twitter.com/MSilb7/status/1586070398097055744?s=20&t=KLO0OlJEjJCsZUmWoRX9sw",
                        "https://twitter.com/optimismFND/status/1585723012128677890?s=20&t=KLO0OlJEjJCsZUmWoRX9sw",
                        "https://gov.optimism.io/t/7th-op-community-governance-call-october-25th-10am-pt-1pm-et-7pm-cet/3732/9",
                        "https://calendar.google.com/calendar/embed?src=c_fnmtguh6noo6qgbni2gperid4k%40group.calendar.google.com&ctz=America%2FNew_York",
                        "https://gov.optimism.io/t/working-constitution-of-the-optimism-collective/55",
                        "https://gov.optimism.io/t/operating-manual-of-the-optimism-collective-v0-2-0/3370",
                        "https://gov.optimism.io/t/grant-proposal-template/3233",
                        "https://app.optimism.io/delegates",
                        "https://snapshot.org/#/opcollective.eth",
                        "https://boardroom.io/optimism/overview"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.53921568627451
                },
                {
                    "author_link": "https://gov.optimism.io/u/Boardroom",
                    "index": "15",
                    "likes": "6",
                    "time": "07/11/2022-15:11:06",
                    "content": " Week of October 31, 2022  Summary We’ve got 18 proposals up for voting; several were added late by Governance Committees, which had the discretion to do so.  Proposals  Vote on Snapshot, if you haven’t already. We have only until Thursday, ~20:00 UTC. Here are links to the Governance Committee recommendations:  DeFi Committee A DeFi Committee C Tooling Committee No NFT or gaming proposals this round  Several delegates have updated their threads to detail their votes and reasoning or otherwise provide thoughts on Cycle #8: @Bobbay_StableLab; @polynya; @OPuser; @ScaleWeb3  In the Forums The Season 2 feedback thread remains active — contribute here. An old voter apathy thread has been resuscitated with some interesting observations, and a new one has been started. Take a look at both. The governance accountability thread is updated by OPUser. Support for partial delegation from new user @S4t0sh1. A badge for Governance Committee members? A new delegate commitment from @0x000.  In Discord The OP Foundation to “open-source” their thinking on Season 3 ahead of schedule. An idea for tagging interested delegates on proposals, from @Gonna.eth  On Twitter Vitalik presents an updated Ethereum roadmap diagram. This week in Optimism. OP Radio #6: Social Metaverse project Atlantis World. **** What’s next for DAOs: with Optimism, GnosisDAO, Superfluid, and Snapshot.  Governance Calls  The next call will be hosted by @Michael and is on Tuesday, November 8, 18:00 UTC. Call details in this post. Quick Gov Links: Working Constitution | Operating Manual v0.2 | Proposal template | Delegates | Snapshot | Optimism on Boardroom ",
                    "links": [
                        "https://snapshot.org/#/opcollective.eth?state=all",
                        "https://gov.optimism.io/t/defi-committee-a-season-2-recommendations/3522/10",
                        "https://gov.optimism.io/t/defi-committee-c-season-2-recommendations/3437/10",
                        "https://gov.optimism.io/t/tooling-committee-season-2-recommendations/3551/13",
                        "https://gov.optimism.io/c/governance/delegate-updates/45",
                        "https://gov.optimism.io/t/season-2-feedback-thread/3818",
                        "https://gov.optimism.io/t/solving-voter-apathy/2964/17",
                        "https://gov.optimism.io/t/temp-check-give-incentives-to-solve-voters-apathy/3926",
                        "https://gov.optimism.io/t/goverance-fund-accountability-an-overview/3591/5",
                        "https://gov.optimism.io/t/proposal-to-parcially-delegate-your-voting-power/3902",
                        "https://gov.optimism.io/t/a-badge-for-season-two-committee-member-s/3905",
                        "https://gov.optimism.io/t/delegate-commitments/235/143",
                        "https://discord.com/channels/667044843901681675/968498307913637919/1038145713978216551",
                        "https://discord.com/channels/667044843901681675/968498307913637919/1037703307852001321",
                        "https://twitter.com/VitalikButerin/status/1588669782471368704?s=20&t=uw9dLEHQQcDzs1paYlZP0g",
                        "https://twitter.com/optimismFND/status/1588623095107293184?s=20&t=uw9dLEHQQcDzs1paYlZP0g",
                        "https://twitter.com/optimismFND/status/1588623101776232448?s=20&t=uw9dLEHQQcDzs1paYlZP0g",
                        "https://twitter.com/i/spaces/1ypKddWWMjaKW",
                        "https://gov.optimism.io/t/8th-op-community-governance-call-november-8th-at-9am-pt-12pm-et-6pm-cet/3914",
                        "https://gov.optimism.io/t/working-constitution-of-the-optimism-collective/55",
                        "https://gov.optimism.io/t/operating-manual-of-the-optimism-collective-v0-2-0/3370",
                        "https://gov.optimism.io/t/grant-proposal-template/3233",
                        "https://app.optimism.io/delegates",
                        "https://snapshot.org/#/opcollective.eth",
                        "https://boardroom.io/optimism/overview"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.2624777183600715
                },
                {
                    "author_link": "https://gov.optimism.io/u/Boardroom",
                    "index": "16",
                    "likes": "6",
                    "time": "14/11/2022-13:22:43",
                    "content": " Week of November 7, 2022  Summary We’ve reached the end of Voting Cycle #8 — and Season 2. Thirteen out of 18 proposals were approved in this last round. We’re now in the “Off Season,” which ends on November 16.  Read and respond to the Optimism Foundation’s Guide to Season 3, which puts forward new ideas, approaches, and proposals concerning the delegate code of conduct, the Governance Fund charter, and retroactive delegate awards, among other things. (Proposals are covered below.) Reflection Period: November 17 - December 7 Special Voting Cycle # 9a: December 8 - December 21  Proposals Moving to a Grants Council: A draft proposal from the Foundation to “restructure the grants process to overcome the challenges faced by committees, improve the proposer experience, create accountability for grant recipients, and reduce delegate workload.” Protocol Delegation Program: Another draft proposal from the Foundation to “allow protocols to have a voice in governance without self-delegating grants.”  Both of the above proposals will be voted on in Special Voting Cycle # 9a.  In the Forums Delegate communication. Voting Cycle #8 and seasonal updates from GFX Labs and @Gonna.eth. Is it time for on-chain OP voting? @GFXlabs and @millie get the discussion started. Retroactive delegate awards for Seasons 1 & 2 are explained here. The Season 2 feedback thread continues. Incentives to address voter apathy. The discussion continues. Delegate accountability. Karma shares progress on its grant-funded dashboard — check it out.  In Discord The #gov-monitoring channel has been created to “discuss the monitoring and oversight of Optimism governance.” Here’s what to do if you had any issues voting on Snapshot during Cycle #8. The allocation of retroactive rewards for Governance Committee members has been shared.  On Twitter Here’s Optimism’s weekly update, which has a link to OP Radio #7 (Motorheadz Nostalgic NFT Collection). How do you shuffle a deck of cards on the blockchain? A thread by @norswap. Cycle #8 voting decisions laid out and explained, by @lefterisjp.  Governance Calls  Here’s a recap of last week’s community call, hosted by @michael, with a link to the recording if you missed it. And here’s a recording of last Wednesday’s call with the Optimism Foundation about the Guide to Season 3: Course Correcting.  Quick Gov Links: Working Constitution | Operating Manual v0.2 | Proposal template | Delegates | Snapshot | Optimism on Boardroom ",
                    "links": [
                        "https://gov.optimism.io/t/guide-to-season-3-course-correcting/3942",
                        "https://gov.optimism.io/t/draft-proposal-moving-to-a-grants-council/3945",
                        "https://gov.optimism.io/t/draft-proposal-protocol-delegation-program/3946",
                        "https://gov.optimism.io/t/it-is-time-for-on-chain-op-voting/3956",
                        "https://gov.optimism.io/t/retroactive-delegate-rewards-for-season-1-2/3947",
                        "https://gov.optimism.io/t/season-2-feedback-thread/3818/34",
                        "https://gov.optimism.io/t/temp-check-give-incentives-to-solve-voters-apathy/3926",
                        "https://gov.optimism.io/t/karma-grantee-accountability-feedback-thread/3960",
                        "https://optimism.showkarma.xyz/",
                        "https://discord.com/channels/667044843901681675/1035325223442063360",
                        "https://discord.com/channels/667044843901681675/968498307913637919/1040374343403835392",
                        "https://discord.com/channels/667044843901681675/968498307913637919/1040399589007691776",
                        "https://twitter.com/optimismFND/status/1591217381761814529?s=20&t=FRszWFwl1HswTNbw6_feiw",
                        "https://twitter.com/i/spaces/1kvJpmwgnvMxE?s=20",
                        "https://twitter.com/norswap/status/1590489878726205440?s=20&t=FRszWFwl1HswTNbw6_feiw",
                        "https://twitter.com/LefterisJP/status/1590314052655681537?s=20&t=FRszWFwl1HswTNbw6_feiw",
                        "https://gov.optimism.io/t/recap-community-call-8-november-8th/3950",
                        "https://drive.google.com/file/d/1LtC9Zo4AddHuussmmC0UIYsUJf2qUeVl/view?usp=sharing",
                        "https://gov.optimism.io/t/guide-to-season-3-course-correcting/3942",
                        "https://gov.optimism.io/t/working-constitution-of-the-optimism-collective/55",
                        "https://gov.optimism.io/t/operating-manual-of-the-optimism-collective-v0-2-0/3370",
                        "https://gov.optimism.io/t/grant-proposal-template/3233",
                        "https://app.optimism.io/delegates",
                        "https://snapshot.org/#/opcollective.eth",
                        "https://boardroom.io/optimism/overview"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.163173947264856
                },
                {
                    "author_link": "https://gov.optimism.io/u/Boardroom",
                    "index": "17",
                    "likes": "7",
                    "time": "21/11/2022-21:54:56",
                    "content": " Week of November 14, 2022  Summary We’re reflecting. But only through December 7. The Guide to Season 3 thread continues to see engagement; read up and contribute if you have something to say.  Proposals —Still the same two we had last week. Discussion continues. Moving to a Grants Council: A draft proposal from the Foundation to “restructure the grants process to overcome the challenges faced by committees, improve the proposer experience, create accountability for grant recipients, and reduce delegate workload.” Protocol Delegation Program: Another draft proposal from the Foundation to “allow protocols to have a voice in governance without self-delegating grants.”  Both of the above proposals will be voted on in Special Voting Cycle # 9a (December 8 - December 21).  In the Forums Proposals are difficult to track on the forums. @GFXlabs calls our attention to this problem. Where has the OP gone? @jackanorak has started a thread “loosely tracking” what happens to granted OP. Delegate communication thread update from @SEED_LATAM_Joxes. Delegate pitch. @juanbug of FranklinDAO describes the group’s approach. Incentivizing OP delegation through quests. @jrocki.eth suggests a way this can be done. Incentives to solve voter apathy. Discussion continues.  In Discord Next snapshot of OP for the next round of voting: December 8, 19:00 UTC. Retroactive delegate compensation has been updated.  On Twitter Optimism Foundations sponsors season 7 of SheFi.  Governance Calls The next community governance call is on Tuesday, November 22, at 18:00 UTC. See and contribute to the agenda here. Quick Gov Links: Working Constitution | Operating Manual v0.2 | Proposal template | Delegates | Snapshot | Optimism on Boardroom ",
                    "links": [
                        "https://gov.optimism.io/t/draft-proposal-moving-to-a-grants-council/3945",
                        "https://gov.optimism.io/t/draft-proposal-protocol-delegation-program/3946",
                        "https://gov.optimism.io/t/proposals-are-difficult-to-track-on-the-forum-due-to-large-numbers-of-posts/4019",
                        "https://gov.optimism.io/t/op-grants-through-season-2-where-has-the-op-gone/4025",
                        "https://gov.optimism.io/t/defi-latam-delegate-communication-thread/2950/11",
                        "https://gov.optimism.io/t/franklindao-penn-blockchain-delegate-communication-thread/4024",
                        "https://gov.optimism.io/t/draft-incentivizing-op-delegation-via-optimism-quests/4026",
                        "https://gov.optimism.io/t/temp-check-give-incentives-to-solve-voters-apathy/3926/34",
                        "https://discord.com/channels/667044843901681675/968498307913637919/1041736719105540157",
                        "https://discord.com/channels/667044843901681675/968498307913637919/1042477161254236170",
                        "https://twitter.com/She__Fi/status/1593290637209583616?s=20&t=5e_U4mbH2ikHVTnUmwnPBA",
                        "https://us02web.zoom.us/j/81673866299?pwd=eE43eGp2TjVrSmc1Q3NjUW42UENlUT09",
                        "https://gov.optimism.io/t/9th-op-community-governance-call-november-22th-at-9am-pt-12pm-et-6pm-cet/4067",
                        "https://gov.optimism.io/t/working-constitution-of-the-optimism-collective/55",
                        "https://gov.optimism.io/t/operating-manual-of-the-optimism-collective-v0-2-0/3370",
                        "https://gov.optimism.io/t/grant-proposal-template/3233",
                        "https://app.optimism.io/delegates",
                        "https://snapshot.org/#/opcollective.eth",
                        "https://boardroom.io/optimism/overview"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.963980463980464
                },
                {
                    "author_link": "https://gov.optimism.io/u/Dodge",
                    "index": "18",
                    "likes": "1",
                    "time": "24/11/2022-07:11:28",
                    "content": "Very concise and governance recap insightful. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6499999999999995
                },
                {
                    "author_link": "https://gov.optimism.io/u/Boardroom",
                    "index": "19",
                    "likes": "6",
                    "time": "28/11/2022-14:28:31",
                    "content": " Week of November 21, 2022  Summary We’re still reflecting — there’s much to consider. In the meantime, here’s a screenshot of the schedule for the upcoming weeks and months. Further details can be found in the Guide to Season 3 thread (from which the screenshot is taken):  Timeline1488×656 111 KB   Proposals Updates to the Grants Council proposal and Protocol Delegation Program proposal continue to be made. Stay current: voting will start on December 8.  In the Forums What is votable supply? @diligit points to some guidance. Karma’s delegate dashboard has been updated. Rewards for users who didn’t sell everything after Airdrop #1 — and perhaps a punishment for those who did. This question has come up again.  In Discord More information about the above proposals, voting processes, and Season 3 will soon be forthcoming from the Foundation (in the forums).  On Twitter Quix is winding down, and going open-source. This week in Optimism. Beethoven X was on OP Radio  Governance Calls Here’s @Michael’s excellent recap of call #9 on November 22; it includes links to the slides and the recording.  Keep your eyes peeled for details on the next call, which will be on December 6. Quick Gov Links: Working Constitution | Operating Manual v0.2 | Proposal template | Delegates | Snapshot | Optimism on Boardroom ",
                    "links": [
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/1/157d1d99709ef94ce8bf570e1c302ab8805fd321.png",
                        "https://gov.optimism.io/t/draft-proposal-moving-to-a-grants-council/3945/40",
                        "https://gov.optimism.io/t/draft-proposal-protocol-delegation-program/3946/14",
                        "https://gov.optimism.io/t/retroactive-delegate-rewards-for-season-1-2/3947/21",
                        "https://gov.optimism.io/t/karma-grantee-accountability-feedback-thread/3960/8",
                        "https://gov.optimism.io/t/rewards-for-those-users-who-received-airdrop-1/4090",
                        "https://discord.com/channels/667044843901681675/968498307913637919/1044751698280849550",
                        "https://twitter.com/qx_app/status/1595507545774460928?s=20&t=vdjXxUcIR5ADZe6hJptNew",
                        "https://twitter.com/optimismFND/status/1596209543423627266?s=20&t=pxjorzDGV1tHrFGwHfXuMA",
                        "https://twitter.com/optimismFND/status/1596209548653576192?s=20&t=pxjorzDGV1tHrFGwHfXuMA",
                        "https://gov.optimism.io/t/recap-community-governance-call-9-november-22th/4072",
                        "https://gov.optimism.io/t/working-constitution-of-the-optimism-collective/55",
                        "https://gov.optimism.io/t/operating-manual-of-the-optimism-collective-v0-2-0/3370",
                        "https://gov.optimism.io/t/grant-proposal-template/3233",
                        "https://app.optimism.io/delegates",
                        "https://snapshot.org/#/opcollective.eth",
                        "https://boardroom.io/optimism/overview",
                        "https://gov.optimism.io/t/op-community-governance-call-december-6th-at-10am-pt-1pm-et-7pm-cet/4112"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.04320987654321
                },
                {
                    "author_link": "https://gov.optimism.io/u/jrocki.eth",
                    "index": "20",
                    "likes": "3",
                    "time": "30/11/2022-18:12:34",
                    "content": "Thank you for putting this together. I will be hosting the next call. Looking to put everything together for that call within the next day or so ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Boardroom",
                    "index": "21",
                    "likes": "6",
                    "time": "05/12/2022-15:56:50",
                    "content": " Week of November 28, 2022  Summary We’re nearing the end of the reflection period, with the next voting cycle just ahead of us (see below).  On November 29 the Optimism Foundation posted information about Grants Council membership — so if you’re interested in being on the Council, check it out.  Proposals The Grants Council and Protocol Delegation Program proposals continue to see active discussion ahead of Voting Cycle #9a, which begins on December 8.  Voting Cycle #9a is coming up!  In the Forums Reporting requirements for grantees. Suggestions from the Foundation. The Karma delegate dashboard continues to be developed. Try it out and provide feedback. Delegate communication. @SEED_LATAM_Joxes presents a “compilation of thoughts” on Season 2, gathered from the DeFi LATAM community. The delegate code of conduct has been updated.  In Discord Council Reviewers. Here’s an exchange about how council members might keep delegates informed.  On Twitter “How can we get them to fork us more?” One of @divine_economy’s favorite things about Optimism. Vitalik on governance rights and token value. Happy birthday beacon chain! This week in Optimism, with OP Radio #9 featuring Lido.  Governance Calls  The next call, led by @jrocki.eth, is coming up on December 6 (18:00 UTC). Keep your eye on this post for further details. Quick Gov Links: Working Constitution | Operating Manual v0.2 | Proposal template | Delegates | Snapshot | Optimism on Boardroom ",
                    "links": [
                        "https://gov.optimism.io/t/draft-proposal-moving-to-a-grants-council/3945/43",
                        "https://gov.optimism.io/t/draft-proposal-protocol-delegation-program/3946/16",
                        "https://gov.optimism.io/t/suggested-public-reporting-requirements-for-grantees/4176",
                        "https://gov.optimism.io/t/karma-grantee-accountability-feedback-thread/3960/10",
                        "https://gov.optimism.io/t/defi-latam-delegate-communication-thread/2950/12",
                        "https://gov.optimism.io/t/delegate-code-of-conduct/3943/16",
                        "https://discord.com/channels/667044843901681675/968498307913637919/1047328271680946216",
                        "https://twitter.com/divine_economy/status/1598557802351546368?s=20&t=Urc3sXU9gBbGHjVnN60FVw",
                        "https://twitter.com/VitalikButerin/status/1597570120456769536?s=20&t=jQ0h6xMZEs76rGWhrplLsA",
                        "https://twitter.com/VitalikButerin/status/1466411377107558402?s=20&t=jQ0h6xMZEs76rGWhrplLsA",
                        "https://twitter.com/optimismFND/status/1598795841686446082?s=20&t=Urc3sXU9gBbGHjVnN60FVw",
                        "https://twitter.com/optimismFND/status/1598795843250769920?s=20&t=Urc3sXU9gBbGHjVnN60FVw",
                        "https://gov.optimism.io/t/op-community-governance-call-december-6th-at-10am-pt-1pm-et-7pm-cet/4112",
                        "https://gov.optimism.io/t/working-constitution-of-the-optimism-collective/55",
                        "https://gov.optimism.io/t/operating-manual-of-the-optimism-collective-v0-2-0/3370",
                        "https://gov.optimism.io/t/grant-proposal-template/3233",
                        "https://app.optimism.io/delegates",
                        "https://snapshot.org/#/opcollective.eth",
                        "https://boardroom.io/optimism/overview"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.258333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/Boardroom",
                    "index": "22",
                    "likes": "7",
                    "time": "12/12/2022-12:08:49",
                    "content": " Week of December 5, 2022  Summary There are two important proposals up for voting. These two have seen record voter engagement so far, with over 20k wallets participating at the time of writing. Voting ends on December 21. Also important: Optimism governance will be transitioning to on-chain voting for Season 3. And even more important! The Optimism Foundation recently announced the first iteration of the Citizens’ House.  Related: Token House badge-holder nominations are due by December 14 (20:00 UTC).  Proposals Grants Council (Snapshot | Discussion). This proposal intends to establish a Grants Council — made up of a council lead working together with eight reviewers — to manage the Governance Fund proposal process. Governance Committees will no longer be in place; instead the Council “will have full decision making authority as to which grants are made.” If this proposal is approved, the Optimism Foundation will select the Council Lead while delegates will vote for the eight council reviewers (who must self-nominate). Reviewers on the Council will be split into two sub-committees: The Growth Experiments Sub-Committee and the Builders Sub-Committee. The Council will have a total seasonal budget of 5 million OP; budgets will need to be approved by delegates each season — if the Council itself proves a worthwhile evolution of Optimism governance. Protocol Delegation Program (Snapshot | Discussion). This proposal seeks to address the controversial protocol self-delegation issue by temporarily delegating a certain amount of “idle” tokens from the Governance Fund to protocols according to a specific criterion. This criterion is “designed to be simple, objective, not easily gameable, and applicable across protocols”: total gas fees generated on Optimism during the preceding Season. Multipliers and certain other important conditions detailed in the proposal. The maximum amount of OP a protocol can be delegated is 2 million (e.g. if a protocol already has 2 million in delegated OP, they will not receive any more through this program). Up to 15 protocols will be selected according the above criterion. An additional eight protocols may self-nominate to receive delegated OP; those self-nominating protocols will be voted on in Voting Cycle #9b — should this proposal pass.  In the Forums Delegate commitments. Six new ones have been posted since last week. L2BEAT’s new Governance Delegate is @kaereste. Voting power grant proposal. @Jadmat.eth-DefiLatam suggests a framework for proposers who want to self-delegate granted OP. More on on-chain. @rshuel from a16z provides insight about on-chain governance.  In Discord Data from a Dune dashboard will be used to identify the protocols eligible for the delegation program (see proposal above).  On Twitter This week in Optimism. It was a big one. Gitcoin hosted a Twitter Spaces convo about Optimism’s retroPGF round. And a thread on the same RPGF Round 2 by the Optimism Foundation.  Governance Calls  Check out the recap of last week’s call, together with a recording. Many thanks to @jrocki.eth for hosting. Quick Gov Links: Working Constitution | Operating Manual v0.2 | Proposal template | Delegates | Snapshot | Optimism on Boardroom ",
                    "links": [
                        "https://gov.optimism.io/t/transitioning-to-on-chain-voting/4193",
                        "https://optimism.mirror.xyz/wqk1Yeyn2OhV9paDzbRXvQ0m0JYDu2npbSkMClwk1rY",
                        "https://gov.optimism.io/t/token-house-badgeholder-nominations/4196",
                        "https://snapshot.org/#/opcollective.eth/proposal/0x37fc8a6ae60cff2e4e72fe9c0567f739bb9a78262c2ada236892fcbc7af2c32d",
                        "https://gov.optimism.io/t/special-voting-cycle-9a-grants-council/4198",
                        "https://snapshot.org/#/opcollective.eth/proposal/0x3a1f9a30c47d6060f3b732404f3a6b2ceba3da07be0505ef0f93b6dab7fa3185",
                        "https://gov.optimism.io/t/special-voting-cycle-9a-protocol-delegation-program/4200",
                        "https://gov.optimism.io/t/delegate-commitments/235/145",
                        "https://gov.optimism.io/t/l2beat-delegate-communication-thread/4263",
                        "https://gov.optimism.io/t/voting-power-grant-proposal/4197",
                        "https://gov.optimism.io/t/it-is-time-for-on-chain-op-voting/3956/8",
                        "https://discord.com/channels/667044843901681675/989611992295813241/1050827668813250630",
                        "https://twitter.com/optimismFND/status/1601275801420562433?s=20&t=-NPdyuw3jrDZbZhhv7ONYQ",
                        "https://twitter.com/i/spaces/1ynJOambWvqKR?s=20",
                        "https://twitter.com/optimismFND/status/1600187625649803265?s=20&t=-NPdyuw3jrDZbZhhv7ONYQ",
                        "https://gov.optimism.io/t/recap-community-governance-call-december-6th/4268",
                        "https://gov.optimism.io/t/working-constitution-of-the-optimism-collective/55",
                        "https://gov.optimism.io/t/operating-manual-of-the-optimism-collective-v0-2-0/3370",
                        "https://gov.optimism.io/t/grant-proposal-template/3233",
                        "https://app.optimism.io/delegates",
                        "https://snapshot.org/#/opcollective.eth",
                        "https://boardroom.io/optimism/overview"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.8356365856365855
                },
                {
                    "author_link": "https://gov.optimism.io/u/Boardroom",
                    "index": "23",
                    "likes": "3",
                    "time": "19/12/2022-14:12:05",
                    "content": " Week of December 12, 2022  Summary Another week of exciting announcements from the Optimism Foundation, including the AttestationStation, a smart contract on Optimism that provides “a permissionless and accessible data source for builders creating reputation-based applications.”  Voting for the three proposals below ends on December 21 ~1:30pm ET.  Proposals Badgeholder Nomination Voting (Snapshot | Discussion). The Optimism Foundation recently announced the initiation of its long-awaited Citizens’ House, which, together with the Token House, forms the bi-cameral governance structure of the Optimism Collective. As part of this initiation, voting badges for the Citizens’ House will be distributed to 90 community members; 10 of these community members will come from within the Token House, and are to be nominated and voted for by the community through this proposal. Requirements for nomination are listed in the originating post, and the final nominations are listed here. It is important to note that this is not “ranked choice” voting. I.e. any number of nominees can be voted for, but the 10 with the highest number of votes will be selected. Grants Council (Snapshot | Discussion). See description in last week’s recap above. Protocol Delegation Program (Snapshot | Discussion). See description in last week’s recap above.  In the Forums New delegate commitments from @Catdl and @Heartistry. Delegate communication updates from @Gonna.eth, @OPUser, and @SEED_LATAM_Joxes. Where has the OP gone? Analysis of Aelin and Singlshot grants by @jackanorak.  In Discord Voting in Token House badge-holder elections isn’t ranked choice. You can vote for any number of nominees, and the top ten will be selected. Just how many Citizens in the Citizens’ House? Season 3 will be roughly nine weeks long, depending. What happens if badge-holders from rPFG1 get elected for Citizens’ House badges?  On Twitter See your Optimism Score, built by Flipside on Attestation Station. AttestationStation Launch on Twitter Spaces. This week in Optimism. Supreme Optimist Kelvin Fichter on OP Radio #11. Justine (@lavande) talks about the Protocol Delegation Program proposal with Boardroom. Open-souricing the Quix NFT marketplace on Optimism, on The Web3 Experience Podcast with @jrocki.eth, web3mark, fucory, justsayuluvjo (live Space on Monday, December 19, 7pm ET).  Governance Calls  The next call will be on December 20 (10am PT / 1pm ET / 7pm CET), hosted by @Michael, on Zoom. More details here. Quick Gov Links: Working Constitution | Operating Manual v0.2 | Proposal template | Delegates | Snapshot | Optimism on Boardroom ",
                    "links": [
                        "https://snapshot.org/#/opcollective.eth",
                        "https://snapshot.org/#/opcollective.eth/proposal/0x22d4c3ab56832de58c1774d1a0aeb61ba6dde8b16c0f8382f85d8935f3ee1f11",
                        "https://gov.optimism.io/t/token-house-badgeholder-nominations/4196/30",
                        "https://optimism.mirror.xyz/wqk1Yeyn2OhV9paDzbRXvQ0m0JYDu2npbSkMClwk1rY",
                        "https://gov.optimism.io/t/token-house-badgeholder-election-information/4195",
                        "https://gov.optimism.io/t/token-house-badgeholder-election-information/4195",
                        "https://gov.optimism.io/t/badgeholder-nomination-roundup/4315",
                        "https://snapshot.org/#/opcollective.eth/proposal/0x37fc8a6ae60cff2e4e72fe9c0567f739bb9a78262c2ada236892fcbc7af2c32d",
                        "https://gov.optimism.io/t/special-voting-cycle-9a-grants-council/4198",
                        "https://snapshot.org/#/opcollective.eth/proposal/0x3a1f9a30c47d6060f3b732404f3a6b2ceba3da07be0505ef0f93b6dab7fa3185",
                        "https://gov.optimism.io/t/special-voting-cycle-9a-protocol-delegation-program/4200",
                        "https://gov.optimism.io/t/delegate-commitments/235/156",
                        "https://gov.optimism.io/c/governance/delegate-updates/45",
                        "https://gov.optimism.io/t/op-grants-through-season-2-where-has-the-op-gone/4025/7",
                        "https://discord.com/channels/667044843901681675/991340698995544176/1053091041328250960",
                        "https://discord.com/channels/667044843901681675/968498307913637919/1052613690249183272",
                        "https://discord.com/channels/667044843901681675/968498307913637919/1052944427900993656",
                        "https://discord.com/channels/667044843901681675/968498307913637919/1053046601708482650",
                        "https://twitter.com/flipsidecrypto/status/1603797889263849476?s=20&t=ILUvvBf8lT0PCEi-bpWucw",
                        "https://twitter.com/optimismFND/status/1603448753029103635?s=20&t=ILUvvBf8lT0PCEi-bpWucw",
                        "https://twitter.com/optimismFND/status/1603820886154350592?s=20&t=ILUvvBf8lT0PCEi-bpWucw",
                        "https://twitter.com/optimismFND/status/1603040973767966723?s=20&t=ILUvvBf8lT0PCEi-bpWucw",
                        "https://twitter.com/boardroom_info/status/1603763670655406089?s=20&t=ILUvvBf8lT0PCEi-bpWucw",
                        "https://twitter.com/Reformed_Normie/status/1603427163637547008?s=20&t=_yrT0hthCzk3VvemyKO38g",
                        "https://www.google.com/url?q=https://us02web.zoom.us/j/85046899696?pwd%3DazNrRDRDRmpGZm5TMjIwT3A1R1p3QT09&sa=D&source=calendar&usd=2&usg=AOvVaw1G0geFYxymWfWofv0U-5m1",
                        "https://gov.optimism.io/t/11th-op-community-governance-call-december-20th-at-10am-pt-1pm-et-7pm-cet/4317",
                        "https://gov.optimism.io/t/working-constitution-of-the-optimism-collective/55",
                        "https://gov.optimism.io/t/operating-manual-of-the-optimism-collective-v0-2-0/3370",
                        "https://gov.optimism.io/t/grant-proposal-template/3233",
                        "https://app.optimism.io/delegates",
                        "https://snapshot.org/#/opcollective.eth",
                        "https://boardroom.io/optimism/overview"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.81133658008658
                },
                {
                    "author_link": "https://gov.optimism.io/u/Boardroom",
                    "index": "24",
                    "likes": "5",
                    "time": "26/12/2022-15:11:08",
                    "content": " Week of December 19, 2022  Summary Governance Update #5 notes some important changes for Season 3 following from the success of the Grants Council and Protocol Delegation Program proposals (33k+ wallets voting in each!) and the distribution of voting badges to the first set of Citizens. Here are a few items from the Update:  Want to be a reviewer on the Grants Council? You can nominate yourself here. Want to apply to be Grants Council Lead? The application is here. Want to nominate your protocol for the delegation program? See here.  Applications for all of the above are due by January 4, 2023 19:00 GMT. Voting on the Council Reviewers and the self-nominated protocols in the delegation program will take place during Voting Cycle #9b.  Voting Cycle #9b: from January 5th 19:00 GMT to January 18th 19:00 GMT. See Update #5 for more details on RetroPGF2 and an outline of “what to expect in Season 3” — which officially starts on January 26th.  Proposals Voting Cycle #9a just ended. See above and Governance Update #5 for more info on the next Cycle.  In the Forums  Requests for grants: Builders & Growth Experiments. Post your suggestions! Delegate communication thread updates from @ScaleWeb3, @SEED_LATAM_Joxes, @kaereste (L2BEAT), @GFXlabs, @Bobbay_StableLab, and @jackanorak (here). Citizen House selection based on on-chain activity? Some more discussion on the subject of the Synthetix Ambassadors Phase 0 delegation. Enabling governance with OP that is used as collateral? New delegate commitment from @Organicfruitjuice.  On Twitter Happy holidays, nerds! The week in Optimism. Optimism 2022: Year in Review (Mirror article). Also in Chinese, Polish, Russian, and Vietnamese. Deep-dive stats for every project on Optimism, courtesy of Michael Silbering. OP Radio #12, with Mirror.  Governance Calls  The next call will be on January 3, 2023 10am PT / 1pm ET / 7pm CET. Details will be posted to the forum. Michael’s recap of the last one is here, together with the recording. Quick Gov Links: Working Constitution | Operating Manual v0.2 | Proposal template | Delegates | Snapshot | Optimism on Boardroom ",
                    "links": [
                        "https://snapshot.org/#/opcollective.eth",
                        "https://gov.optimism.io/t/grant-council-reviewer-nominations/4372",
                        "https://docs.google.com/forms/u/1/d/e/1FAIpQLScbf-v4hXm_YjAiG9w3MnvTRig1RMzKLcw7UCfbLPVMnkJrSw/viewform?usp=sf_link",
                        "https://gov.optimism.io/t/protocol-delegation-self-nominations/4357",
                        "https://gov.optimism.io/t/governance-update-5/4397",
                        "https://optimism.mirror.xyz/wqk1Yeyn2OhV9paDzbRXvQ0m0JYDu2npbSkMClwk1rY",
                        "https://gov.optimism.io/t/governance-update-5/4397",
                        "https://gov.optimism.io/t/request-for-grants-builders-grants/4373",
                        "https://gov.optimism.io/t/request-for-grants-growth-experiments/4374",
                        "https://gov.optimism.io/c/governance/delegate-updates/45",
                        "https://gov.optimism.io/t/jack-anorak-delegate-communication-thread/4367",
                        "https://gov.optimism.io/t/suggesting-on-chain-activity-based-citizen-selection-for-later-citizen-house-phases/4350",
                        "https://gov.optimism.io/t/synthetix-ambassadors-phase-0-delegation-2m-op-tokens/3726/28",
                        "https://gov.optimism.io/t/enabling-optimism-token-that-is-used-as-collateral-to-count-towards-voting-power/4395",
                        "https://gov.optimism.io/t/delegate-commitments/235/159",
                        "https://twitter.com/optimismFND/status/1606355606473826304?s=20&t=fo1ZdURchoLdPnpE3O1BxA",
                        "https://twitter.com/optimismFND/status/1606355608193605632?s=20&t=fo1ZdURchoLdPnpE3O1BxA",
                        "https://optimism.mirror.xyz/O8DesNLJ5HXD6C55Lwnks8xIPU45BjJlwZARKWBqXuE",
                        "https://twitter.com/optimismFND/status/1606331284984397825?s=20&t=fo1ZdURchoLdPnpE3O1BxA",
                        "https://twitter.com/MSilb7/status/1606413055809691648?s=20&t=fo1ZdURchoLdPnpE3O1BxA",
                        "https://twitter.com/MSilb7",
                        "https://twitter.com/i/spaces/1lDGLnqnRAPxm?s=20",
                        "https://gov.optimism.io/t/recap-community-call-11-december-20/4363",
                        "https://drive.google.com/file/d/1iQRwqi1kqTFduSIdUCcHIfWI0OI8qfJL/view?usp=sharing",
                        "https://gov.optimism.io/t/working-constitution-of-the-optimism-collective/55",
                        "https://gov.optimism.io/t/operating-manual-of-the-optimism-collective-v0-2-0/3370",
                        "https://gov.optimism.io/t/grant-proposal-template/3233",
                        "https://app.optimism.io/delegates",
                        "https://snapshot.org/#/opcollective.eth",
                        "https://boardroom.io/optimism/overview"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.875757575757577
                },
                {
                    "author_link": "https://gov.optimism.io/u/Boardroom",
                    "index": "25",
                    "likes": "9",
                    "time": "02/01/2023-14:31:03",
                    "content": " Week of December 26, 2022  Summary Happy New Year, Optimists.   Applications are due January 4th 19:00 GMT for the Grants Council Lead, for Grants Council reviewer self-nominations, and for protocol delegation self-nominations. (We have five Grants Council reviewer nominations so far, check them out.) As noted last week: See Update #5 for more details on RetroPGF2 and an outline of “what to expect in Season 3” — which officially starts on January 26th.  Proposals  Voting Cycle #9b takes place from January 5th 19:00 GMT to January 18th 19:00 GMT.  In the Forums New delegate commitments from @0xMauri, @revmiller, @Oxytocin, @Benjamin.lens. Delegate updates from @jackanorak and @SEED_LATAM_Joxes. Protocol delegation self-nominations are being added to this thread. Can we get a final list of the protocols that will be getting the delegated OP? Rebalance delegate tokens for more decentralization? @Gonna.eth wonders.  In Discord How to be included in Voting Cycle #10?  On Twitter Crypto predictions for 2023, from @protolambda.  Governance Calls  The next community call is Tuesday, January 10 at 10am PT / 1pm ET / 7pm CET. See the forum post for more info (and here’s the Zoom link). Quick Gov Links: Working Constitution | Operating Manual v0.2 | Proposal template | Delegates | Snapshot | Optimism on Boardroom ",
                    "links": [
                        "https://gov.optimism.io/t/protocol-delegation-self-nominations/4357",
                        "https://gov.optimism.io/t/grant-council-reviewer-nominations/4372",
                        "https://gov.optimism.io/t/governance-update-5/4397",
                        "https://optimism.mirror.xyz/wqk1Yeyn2OhV9paDzbRXvQ0m0JYDu2npbSkMClwk1rY",
                        "https://gov.optimism.io/t/delegate-commitments/235/161",
                        "https://gov.optimism.io/c/governance/delegate-updates/45",
                        "https://gov.optimism.io/t/protocol-delegation-self-nominations/4357",
                        "https://gov.optimism.io/t/special-voting-cycle-9a-protocol-delegation-program/4200/16",
                        "https://gov.optimism.io/t/delegate-rebalance-debate/4408",
                        "https://discord.com/channels/667044843901681675/968498307913637919/1059410603942367282",
                        "https://twitter.com/protolambda/status/1608870209460502528?s=20&t=XVFLMzYiEgE4W1uO-RP7fQ",
                        "https://gov.optimism.io/t/12th-op-community-governance-call-january-3rd-at-10am-pt-1pm-et-7pm-cet/4428",
                        "https://www.google.com/url?q=https://us02web.zoom.us/j/81095506593?pwd%3DQ0llV0l6UjZ1M1RzNEkvUElIOSt3Zz09&sa=D&source=calendar&usd=2&usg=AOvVaw2lZUs5D48LqGP9_S3f7Q6V",
                        "https://gov.optimism.io/t/working-constitution-of-the-optimism-collective/55",
                        "https://gov.optimism.io/t/operating-manual-of-the-optimism-collective-v0-2-0/3370",
                        "https://gov.optimism.io/t/grant-proposal-template/3233",
                        "https://app.optimism.io/delegates",
                        "https://snapshot.org/#/opcollective.eth",
                        "https://boardroom.io/optimism/overview"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.200441919191919
                },
                {
                    "author_link": "https://gov.optimism.io/u/Boardroom",
                    "index": "26",
                    "likes": "3",
                    "time": "09/01/2023-15:06:10",
                    "content": " Week of January 2, 2023  Summary Since the deadline for applications for Grants Council Lead, Reviewers, and protocol self-nominations was extended to January 11 , a number of new folks (and groups) have put themselves forward for the role of Reviewer. Too many to list here, but take a good look now as voting for Reviewers will begin this week. Similarly, protocol delegation self-nominations are coming in strong.  If you have questions or comments, there’s a community governance call coming up tomorrow.  Proposals  Voting Cycle #9b — for Grants Council Reviewers and protocol delegations — will take place from January 12th 19:00 GMT to January 18th 19:00 GMT.  In the Forums Optimism en Español — 2022 Recap, thanks to @NicoEsp. Eight new delegate commitments have been posted over the last week. Delegate communication thread update from @MoneyManDoug. Delegate rebalance debate — continues.  In Discord The Snapshot of your (delegated) OP will take place on January 12, ahead of the voting cycle. Make sure your OP is where you want it to be.  On Twitter First Optimism weekly recap of the year. “This meeting could’ve been an email : This NFT could’ve been an attestation,” says Michael Silbering.  Governance Calls  The next community call is tomorrow, Tuesday, January 10 at 10am PT / 1pm ET / 7pm CET. See the forum post for more info (and here’s the Zoom link). Quick Gov Links: Working Constitution | Operating Manual v0.2 | Proposal template | Delegates | Snapshot | Optimism on Boardroom ",
                    "links": [
                        "https://gov.optimism.io/t/grant-council-reviewer-nominations/4372",
                        "https://gov.optimism.io/t/protocol-delegation-self-nominations/4357",
                        "https://gov.optimism.io/t/postponed-12th-op-community-governance-call-is-now-january-10th-at-10am-pt-1pm-et-7pm-cet/4428",
                        "https://gov.optimism.io/t/optimism-en-espanol-2022-recap/4453",
                        "https://gov.optimism.io/t/delegate-commitments/235/165",
                        "https://gov.optimism.io/t/doug-sugma-eth-delegate-communication-thread/4452",
                        "https://gov.optimism.io/t/delegate-rebalance-debate/4408/5",
                        "https://discord.com/channels/667044843901681675/968498307913637919/1060210365381742653",
                        "https://twitter.com/optimismFND/status/1611436109807947791?s=20&t=QLDwz5FFZ3iX2hbf8l6jhQ",
                        "https://twitter.com/MSilb7/status/1612422655277137920?s=20&t=QLDwz5FFZ3iX2hbf8l6jhQ",
                        "https://gov.optimism.io/t/12th-op-community-governance-call-january-3rd-at-10am-pt-1pm-et-7pm-cet/4428",
                        "https://www.google.com/url?q=https://us02web.zoom.us/j/81095506593?pwd%3DQ0llV0l6UjZ1M1RzNEkvUElIOSt3Zz09&sa=D&source=calendar&usd=2&usg=AOvVaw2lZUs5D48LqGP9_S3f7Q6V",
                        "https://gov.optimism.io/t/working-constitution-of-the-optimism-collective/55",
                        "https://gov.optimism.io/t/operating-manual-of-the-optimism-collective-v0-2-0/3370",
                        "https://gov.optimism.io/t/grant-proposal-template/3233",
                        "https://app.optimism.io/delegates",
                        "https://snapshot.org/#/opcollective.eth",
                        "https://boardroom.io/optimism/overview"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.418997668997669
                },
                {
                    "author_link": "https://gov.optimism.io/u/Boardroom",
                    "index": "27",
                    "likes": "4",
                    "time": "16/01/2023-15:48:49",
                    "content": " Week of January 9, 2023  Summary Optimism’s Goerli testnet was upgraded to Bedrock! Mainnet next. As shared during the last community call, hosted by @michael, @ben-chain is looking for feedback about what kind of protocol upgrade information the community would want ahead of an upgrade vote: “Mainnet upgrades need to go through the Token House.” The Grants Council will soon be set and at work. Check out the two request-for-grants threads, which will inform the Council’s Growth Experiments and Builders sub-committees.  Proposals  Special Voting Cycle #9b is under way — voting ends soon, on January 18, 19:00 UTC.  Protocol Delegation Elections Grants Council Elections - Growth Experiments  Grants Council Elections - Builders    In the Forums Delegate code of conduct was updated by @lavande with several additions/clarifications, including under what circumstances a delegate can vote for their own candidacy. Delegate communication thread updates from @Gonna.eth, @ScaleWeb3, @GFXlabs, and @OPuser. New delegate commitments — there are ~20 of them.  In Discord The forum is being reorganized. And also, forum spam seems to have increased lately.  On Twitter RetroPGF2 nominations start on Tuesday (plus, a good meme). This week in Optimism, and OP Radio is now a podcast too.  Governance Calls  The next community governance call, hosted by @jrocki.eth, is tomorrow Tuesday, January 17th at 10am PT / 1pm ET / 7pm CET. The recap (link to recording) of last week’s call is here. Quick Gov Links: Working Constitution | Operating Manual v0.2 | Proposal template | Delegates | Snapshot | Optimism on Boardroom ",
                    "links": [
                        "https://gov.optimism.io/t/request-for-comment-protocol-upgrade-proposal-information/4538",
                        "https://gov.optimism.io/t/request-for-grants-growth-experiments/4374",
                        "https://gov.optimism.io/t/request-for-grants-builders-grants/4373",
                        "https://snapshot.org/#/opcollective.eth/proposal/0x88583c43b196ec86cee45345611b582108f1d6933ab688a7cae992a6baa552a6",
                        "https://snapshot.org/#/opcollective.eth/proposal/0xa9457a5344747a6c272de786419fc7a4e83fcf0f927ef9b1ce767452faa9b453",
                        "https://snapshot.org/#/opcollective.eth/proposal/0xdcff47b93fb17a11411bda1809e22cba72e5131d31624e4c0f2b9dbee6811f5c",
                        "https://gov.optimism.io/t/delegate-code-of-conduct/3943/26",
                        "https://gov.optimism.io/c/governance/delegate-updates/45",
                        "https://gov.optimism.io/t/delegate-commitments/235/173",
                        "https://discord.com/channels/667044843901681675/968498307913637919/1063497558778986548",
                        "https://discord.com/channels/667044843901681675/968498307913637919/1064550114238152734",
                        "https://twitter.com/JonasSFT/status/1614624071680933888?s=20&t=aK435p65YFSwI2DvskYaoQ",
                        "https://twitter.com/optimismFND/status/1613970488556138498?s=20&t=aK435p65YFSwI2DvskYaoQ",
                        "https://twitter.com/optimismFND/status/1613970495304781824?s=20&t=aK435p65YFSwI2DvskYaoQ",
                        "https://gov.optimism.io/t/13th-op-community-governance-call-is-january-17th-at-10am-pt-1pm-et-7pm-cet/4586",
                        "https://gov.optimism.io/t/recap-12th-op-community-governance-call-january-19th/4530",
                        "https://gov.optimism.io/t/working-constitution-of-the-optimism-collective/55",
                        "https://gov.optimism.io/t/operating-manual-of-the-optimism-collective-v0-2-0/3370",
                        "https://gov.optimism.io/t/grant-proposal-template/3233",
                        "https://app.optimism.io/delegates",
                        "https://snapshot.org/#/opcollective.eth",
                        "https://boardroom.io/optimism/overview"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.011183261183262
                },
                {
                    "author_link": "https://gov.optimism.io/u/Boardroom",
                    "index": "28",
                    "likes": "6",
                    "time": "23/01/2023-12:31:50",
                    "content": " Week of January 16, 2023  Summary The Grants Council Reviewers have been elected and the Council Lead chosen — congratulations to all! (See tweet thread here for details.) Here’s a complete list of protocols participating in the delegation program for Season 3. Season 3 of the Governance Fund begins on January 26. Meanwhile, nominations are being submitted for RetroPGF2 in the education, infrastructure & dependencies, and tooling & utilities categories — nominations will be accepted through January 31. You can also provide your feedback on this round of RetroPGF.  Proposals Special Voting Cycle #9b ended on January 18.  Check out the proposals being submitted for Cycle #10.  In the Forums You may have noticed that the forum has been reorganized; here’s a navigation guide. Request for grants — Growth Experiments, and Builders. Delegate communication thread updates from @polynya, @Bobbay_StableLab, @jackanorak, and @SEED_LATAM_Joxes. Six new delegate commitments. Grant proposal template has been updated.  On Twitter Optimism in the World Economic Forum report on DAOs. This week in Optimism, and Tally Ho on OP Radio. If people think what you’re doing is grandiose and unrealistic….  Governance Calls  The next community governance call will likely be on Tuesday, February 7th at 10am PT / 1pm ET / 7pm CET. (Details haven’t been posted yet.) The recap (and the link to the recording) of last week’s call is here. Quick Gov Links: Working Constitution | Operating Manual v0.2 | Proposal template | Delegates | Snapshot | Optimism on Boardroom ",
                    "links": [
                        "https://discord.com/channels/667044843901681675/968498307913637919/1065970989030195260",
                        "https://twitter.com/OptimismGov/status/1616491677220208643?s=20&t=YJAzjCKrFpIDlUUPGvkd4A",
                        "https://gov.optimism.io/t/protocol-delegation-program-season-3-participants/4675",
                        "https://gov.optimism.io/t/education-nominations-for-rpgf2/4640",
                        "https://gov.optimism.io/t/infrastructure-dependencies-nominations-for-rpgf2/4637",
                        "https://gov.optimism.io/t/tooling-utilities-nominations-for-rpgf2/4639",
                        "https://gov.optimism.io/t/community-feedback-on-retropgf2/4641",
                        "https://gov.optimism.io/tag/cycle-10",
                        "https://gov.optimism.io/t/navigating-the-forum/4726",
                        "https://gov.optimism.io/t/request-for-grants-growth-experiments/4374/6",
                        "https://gov.optimism.io/t/request-for-grants-builders-grants/4373/8",
                        "https://gov.optimism.io/c/governance/delegate-updates/45",
                        "https://gov.optimism.io/t/delegate-commitments/235/198",
                        "https://gov.optimism.io/t/grant-proposal-template/3233/28",
                        "https://twitter.com/jinglejamOP/status/1615747076801040384?s=20&t=YJAzjCKrFpIDlUUPGvkd4A",
                        "https://twitter.com/optimismFND/status/1616510642470457355?s=20&t=YJAzjCKrFpIDlUUPGvkd4A",
                        "https://twitter.com/optimismFND/status/1616510649881792514?s=20&t=YJAzjCKrFpIDlUUPGvkd4A",
                        "https://twitter.com/optimismFND/status/1616524292753072129?s=20&t=YJAzjCKrFpIDlUUPGvkd4A",
                        "https://gov.optimism.io/t/recap-13th-op-community-governance-call-january-17th/4704",
                        "https://gov.optimism.io/t/working-constitution-of-the-optimism-collective/55",
                        "https://gov.optimism.io/t/operating-manual-of-the-optimism-collective-v0-2-0/3370",
                        "https://gov.optimism.io/t/grant-proposal-template/3233",
                        "https://app.optimism.io/delegates",
                        "https://snapshot.org/#/opcollective.eth",
                        "https://boardroom.io/optimism/overview"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.514911014911014
                },
                {
                    "author_link": "https://gov.optimism.io/u/Boardroom",
                    "index": "29",
                    "likes": "2",
                    "time": "30/01/2023-15:44:53",
                    "content": " Week of January 23, 2023  Summary  As Grants Council Lead @danelund.eth explains, Season 3 of the Governance Fund will have two cycles. Those looking to apply for the first of those cycles, Cycle #10, should do so before 19:00 GMT on February 1, 2023. All Grants Council details can be found on their new landing page; the Council’s internal procedures are detailed here and their aims here. The latest version of the Operating Manual, which “describes the current governance proposal process of the Optimism Collective,” has been posted by @lavande.  RetroPGF round 2 nominations continue through January 31st. Check out the categories of education, infrastructure & dependencies, and tooling & utilities.   Proposals Special Voting Cycle #9b ended on January 18.  In the Forums New delegate commitments from @Oxytocin, @0xtassilo.eth, and @WintermuteGovernance.  In Discord If your proposal relates to governance funding…apply on the Grants Council form (see above); you don’t need to post in the forum. Examples of successful applications to the governance fund (but not authoritative).  On Twitter The Optimism AttestationStation “is a new building block for identity and trust, and ‘making blockchains human friendly’.” This week in Optimism, and Bored Town Original NFT collection on OP Radio. Optimism research study “to help inform how we can improve the experience on Optimism.”  Governance Calls  The next community governance call will be on Tuesday, January 31st at 10am PT / 1pm ET / 7pm CET on Zoom. Quick Gov Links: Working Constitution | Operating Manual v0.2 | Proposal template | Delegates | Snapshot | Optimism on Boardroom ",
                    "links": [
                        "https://www.notion.so/2d47da131a004e94a74e56af9438026b",
                        "https://www.notion.so/090bb648d1854136b9630c608da7a8bc",
                        "https://gov.optimism.io/t/grants-council-internal-operating-procedures/4832",
                        "https://gov.optimism.io/t/grants-council-achieving-aims-in-season-3/4831",
                        "https://gov.optimism.io/t/operating-manual-v0-3/4834",
                        "https://community.optimism.io/docs/governance/retropgf-2/#",
                        "https://gov.optimism.io/t/education-nominations-for-rpgf2/4640",
                        "https://gov.optimism.io/t/infrastructure-dependencies-nominations-for-rpgf2/4637",
                        "https://gov.optimism.io/t/tooling-utilities-nominations-for-rpgf2/4639",
                        "https://gov.optimism.io/t/delegate-commitments/235/206",
                        "https://discord.com/channels/667044843901681675/968498307913637919/1068307399213056061",
                        "https://discord.com/channels/667044843901681675/968498307913637919/1069418466949480549",
                        "https://twitter.com/MSilb7/status/1619429272430723072?s=20&t=BjLZGIBNYN8g9WZIQ2GyOw",
                        "https://twitter.com/optimismFND/status/1619043599391535106?s=20&t=BjLZGIBNYN8g9WZIQ2GyOw",
                        "https://twitter.com/optimismFND/status/1619043610426769408?s=20&t=BjLZGIBNYN8g9WZIQ2GyOw",
                        "https://twitter.com/zainbacchus/status/1618105231191183366?s=20&t=BjLZGIBNYN8g9WZIQ2GyOw",
                        "https://gov.optimism.io/t/14th-op-community-governance-call-is-january-31st-at-10am-pt-1pm-et-7pm-cet/4873",
                        "https://www.google.com/url?q=https://us02web.zoom.us/j/81641455790?pwd%3DaHhMSzN4WWdMRmdvQjh6NEJ0dWdpdz09&sa=D&source=calendar&usd=2&usg=AOvVaw1-tY1N6yYMtq_QXDeOoNeB",
                        "https://gov.optimism.io/t/working-constitution-of-the-optimism-collective/55",
                        "https://gov.optimism.io/t/operating-manual-of-the-optimism-collective-v0-2-0/3370",
                        "https://gov.optimism.io/t/grant-proposal-template/3233",
                        "https://app.optimism.io/delegates",
                        "https://snapshot.org/#/opcollective.eth",
                        "https://boardroom.io/optimism/overview"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.76304397357029
                },
                {
                    "author_link": "https://gov.optimism.io/u/Boardroom",
                    "index": "30",
                    "likes": "8",
                    "time": "06/02/2023-16:58:04",
                    "content": " Week of January 30, 2023  Summary  Nominations for RetroPGF2 closed on January 31st; nominated projects have until February 14th to opt-in. Keep a look-out for a test of the new on-chain governance system, which will be coming our way thanks to @zcf and Agora. Grant application info can be found on the Grants Council’s Notion home page.   The first cycle is underway, and will end on March 1. Here’s a summary of the grant proposer AMA that was held on February 3rd. The tldr provided: “On-time applicants have until Monday (Feb. 6) at 19:00 GMT to amend their applications to meet basic parameters.” You can see the many grant applications by selecting Grants Council and/or Cycle-10 tags.  @lavande has written a grant token-lock explainer.   Proposals [Draft] Upgrade Proposal: Bedrock. This is the first protocol upgrade to be be put before the Collective. There’ll be an AMA with folks from OP Labs and the Foundation on February 8th at 18:30 GMT in Discord.  Voting starts on February 16th. Here’s an explanation of the non-grant proposal process for this cycle.  In the Forums Introducing Babel m-DAO, a community driven experiment proposed by @TheDoctor. There are five new delegate commitments, check them out.  In Discord There’s a read-only #grants-council communications channel.  On Twitter Clique provides an update to their OP AttestationStation. Optimism Bedrock explainer. This week in Optimism, and OP Radio #17 with metaverse hackathon winners.  Governance Calls  A recording of the last call can be found here, thanks to @Michael. The next community governance call will be on Tuesday, Feburary 14th at 10am PT / 1pm ET / 7pm CET. Details to come. Quick Gov Links: Working Constitution | Operating Manual v0.2 | Proposal template | Delegates | Snapshot | Optimism on Boardroom ",
                    "links": [
                        "https://gov.optimism.io/t/transitioning-to-on-chain-voting/4193/24",
                        "https://www.notion.so/090bb648d1854136b9630c608da7a8bc",
                        "https://www.notion.so/Proposer-AMA-February-3-2023-279db2774af249a8b07797d3cb9b5ef3",
                        "https://gov.optimism.io/c/proposals/grants-council/51",
                        "https://gov.optimism.io/tag/cycle-10",
                        "https://gov.optimism.io/t/grant-token-lock-explainer/5060",
                        "https://discord.com/events/667044843901681675/1071089483891621928",
                        "https://gov.optimism.io/t/voting-roundup-cycle-10/4924",
                        "https://gov.optimism.io/t/introducing-babel-m-dao-the-seed-of-a-decentralized-op-community-formed-by-human-beings-from-all-over-the-world/4960",
                        "https://gov.optimism.io/t/delegate-commitments/235/209",
                        "https://discord.com/channels/667044843901681675/1069654031322075207",
                        "https://twitter.com/Clique2046/status/1621183134124621826?s=20&t=OWSR-l18YlUsEkYck3DQGw",
                        "https://twitter.com/liamihorne/status/1621878573840596994?s=20&t=mUZgfRfNmgPbj4UkrNr8dw",
                        "https://twitter.com/optimismFND/status/1621594445517840389?s=20&t=mUZgfRfNmgPbj4UkrNr8dw",
                        "https://twitter.com/i/spaces/1YqxoAVwpqEGv?s=20",
                        "https://gov.optimism.io/t/recap-14th-op-community-governance-call-january-31st/4966",
                        "https://gov.optimism.io/t/working-constitution-of-the-optimism-collective/55",
                        "https://gov.optimism.io/t/operating-manual-of-the-optimism-collective-v0-2-0/3370",
                        "https://gov.optimism.io/t/grant-proposal-template/3233",
                        "https://app.optimism.io/delegates",
                        "https://snapshot.org/#/opcollective.eth",
                        "https://boardroom.io/optimism/overview"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.733100233100234
                },
                {
                    "author_link": "https://gov.optimism.io/u/Karim27",
                    "index": "31",
                    "likes": "1",
                    "time": "10/02/2023-11:55:00",
                    "content": "Good job Man waw OP hut progct Good ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/Boardroom",
                    "index": "32",
                    "likes": "6",
                    "time": "13/02/2023-21:22:03",
                    "content": " Week of February 06, 2023  Summary  All Token House votes will now occur on-chain. Agora has built an excellent portal for Optimism — you can try it out with this test proposal ahead of the next live voting round. You’ll need to fill out your delegate profile first, however.  RetroPGF2 nominated projects have until February 21st to opt-in. You can see the many grant applications by selecting Grants Council and/or Cycle-10 tags. A list of grants in Preliminary Review has been distributed via the Grants Council Discord channel. And oh yes, there was an OP airdrop.   Proposals [Draft] Upgrade Proposal: Bedrock. The first protocol upgrade to be be put before the Collective.  Voting starts on February 16th.  In the Forums Registering as a delegate. The process has changed, and will take place through the voting portal. Voting power consolidation? @0xtassilo.eth considers the question. Airdrop #2 anomalies?  On Twitter Airdrop sybil hunting defense approach. “The chain/rollup-as-a-service field is furiously heating up right now,” observes Norswap. Things to build on Optimism, from @jack_anorak. This week in Optimism, and OP Radio #18 on Binance stablecoin integration and partnership.  Governance Calls  The next community governance call will be on Tuesday, Feburary 14th at 10am PT / 1pm ET / 7pm CET, on Zoom. Quick Gov Links: Working Constitution | Operating Manual v0.2 | Proposal template | Delegates | Voting Portal | Optimism on Boardroom ",
                    "links": [
                        "https://vote.optimism.io/",
                        "https://vote.optimism.io/proposals/103606400798595803012644966342403441743733355496979747669804254618774477345292",
                        "https://discord.com/channels/667044843901681675/968498307913637919/1073922327886184468",
                        "https://gov.optimism.io/t/nominations-for-retropgf2/4636",
                        "https://gov.optimism.io/c/proposals/grants-council/51",
                        "https://gov.optimism.io/tag/cycle-10",
                        "https://discord.com/channels/667044843901681675/1069654031322075207/1073766007321137152",
                        "https://discord.com/channels/667044843901681675/968498016417902673/1074510362042445824",
                        "https://gov.optimism.io/t/draft-upgrade-proposal-bedrock/5014",
                        "https://gov.optimism.io/t/delegate-commitments/235/217",
                        "https://vote.optimism.io/",
                        "https://gov.optimism.io/t/top-20-of-delegates-consolidate-82-of-all-delegated-voting-power-is-that-concerning/5240",
                        "https://gov.optimism.io/t/did-no-one-question-the-anomalies-of-airdrop-2/5236",
                        "https://twitter.com/MSilb7/status/1623802664017448963?s=20&t=ylIWpDryl0z9QuUhFwqe_A",
                        "https://twitter.com/norswap/status/1624852238706561024?s=20&t=ylIWpDryl0z9QuUhFwqe_A",
                        "https://twitter.com/jack_anorak/status/1624133327681687555?s=20&t=ylIWpDryl0z9QuUhFwqe_A",
                        "https://twitter.com/optimismFND/status/1624116722264334336?s=20&t=ylIWpDryl0z9QuUhFwqe_A",
                        "https://twitter.com/i/spaces/1mnGeRjNewvJX?s=20",
                        "https://gov.optimism.io/t/15th-op-community-governance-call-is-february-14th-at-10am-pt-1pm-et-7pm-cet/5264",
                        "https://www.google.com/url?q=https://us02web.zoom.us/j/83240273460?pwd%3DaGlVU2M4Ti9DRXNBSExsdG1LUlkxUT09&sa=D&source=calendar&usd=2&usg=AOvVaw12V_FWFqgXrkm8pSH3TegL",
                        "https://gov.optimism.io/t/working-constitution-of-the-optimism-collective/55",
                        "https://gov.optimism.io/t/operating-manual-of-the-optimism-collective-v0-2-0/3370",
                        "https://gov.optimism.io/t/grant-proposal-template/3233",
                        "https://app.optimism.io/delegates",
                        "https://vote.optimism.io/",
                        "https://boardroom.io/optimism/overview"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.16155057064148
                },
                {
                    "author_link": "https://gov.optimism.io/u/hait",
                    "index": "33",
                    "likes": "1",
                    "time": "14/02/2023-05:47:05",
                    "content": "good read  Thanks for the summary. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/Cole",
                    "index": "34",
                    "likes": "0",
                    "time": "14/02/2023-17:48:36",
                    "content": "Hi, what is the password for the community call? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Boardroom",
                    "index": "35",
                    "likes": "5",
                    "time": "20/02/2023-18:16:23",
                    "content": " Week of February 13, 2023  Summary  Voting for the Bedrock protocol upgrade has been delayed until Cycle 11 (voting period begins March 23).  RetroPGF2 nominated projects (still) have until February 21st to opt-in.   Proposals [Draft] Upgrade Proposal: Bedrock. The first protocol upgrade to be be put before the Collective.  In the Forums Quests retrospect, and questions about future directions from @CryptoKachu Community calls. Should they be moved to Discord stages? Cycle 10 grant review roundup, from @danelund.eth. New grant proposal templates, for Cycle 11.  On Twitter a16z announces its first cohort of OP delegates. How Optimism plans to bootstrap the first use case of decentralized identity. The Optimist NFT — custom profile pictures coming soon. Submit your best Optimist NFT memes here. This week in Optimism, and OP Radio #19: Rainbow Web3 Wallet.  Governance Calls  Here’s a recap and recording of last week’s community governance call. Quick Gov Links: Working Constitution | Operating Manual v0.3 | Voting Portal | Optimism on Boardroom ",
                    "links": [
                        "https://gov.optimism.io/t/nominations-for-retropgf2/4636",
                        "https://gov.optimism.io/t/draft-upgrade-proposal-bedrock/5014",
                        "https://gov.optimism.io/t/optimism-quest-retrospect-and-future-direction/5300",
                        "https://gov.optimism.io/t/optimism-community-calls-should-be-moved-to-discord-stages/5306",
                        "https://gov.optimism.io/t/cycle-10-grant-review-roundup/5284",
                        "https://gov.optimism.io/t/grants-proposal-template-cycle-11/5291",
                        "https://twitter.com/RossShuel/status/1625528627935981569?s=20",
                        "https://twitter.com/zainbacchus/status/1627466264947077120?s=20",
                        "https://twitter.com/optimismFND/status/1603437456547790848?s=20",
                        "https://twitter.com/Reformed_Normie/status/1626693108967657493?s=20",
                        "https://twitter.com/optimismFND/status/1626654084185919505?s=20",
                        "https://twitter.com/i/spaces/1djxXlZpjpexZ?s=20",
                        "https://gov.optimism.io/t/recap-15th-op-community-governance-call-february-14th/5277",
                        "https://gov.optimism.io/t/working-constitution-of-the-optimism-collective/55",
                        "https://gov.optimism.io/t/operating-manual-v0-3/4834",
                        "https://vote.optimism.io/",
                        "https://boardroom.io/optimism/overview"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.233164983164983
                },
                {
                    "author_link": "https://gov.optimism.io/u/Boardroom",
                    "index": "36",
                    "likes": "2",
                    "time": "27/02/2023-15:39:10",
                    "content": " Week of February 20, 2023  Highlights  Optimism goes Superchain, fyi. Here’s a set of helpful links to explanatory docs. Grant applicants: make sure you understand the OP no-sale/lock-up policies. Cycle 11 grant hopefuls: follow the new proposal template here, and be mindful of the new milestone assessment guidance.   Proposals [Draft] Upgrade Proposal: Bedrock. Voting has been delayed until Cycle 11. See the explanation here.  In the Forums Karma’s delegate dashboard has some new features. Distribution of voting power discussion continues. Coinbase + OP = BASE  On Twitter Optimism weekly recap OP Radio #21: Base Built on the OP Stack The Superchain  Governance Calls  The next community governance call is tomorrow, Tuesday, February 28th at 10am PT / 1pm ET / 7pm CET, on Zoom. Quick Gov Links: Working Constitution | Operating Manual v0.3 | Voting Portal | Optimism on Boardroom ",
                    "links": [
                        "https://discord.com/channels/667044843901681675/968498307913637919/1078341258772217857",
                        "https://discord.com/channels/667044843901681675/1035325223442063360/1079079306707357706",
                        "https://gov.optimism.io/t/grants-proposal-template-cycle-11/5291",
                        "https://gov.optimism.io/t/milestone-assessment/5314",
                        "https://gov.optimism.io/t/draft-upgrade-proposal-bedrock/5014",
                        "https://vote.optimism.io/",
                        "https://gov.optimism.io/t/draft-upgrade-proposal-bedrock/5014/82",
                        "https://optimism.karmahq.xyz/",
                        "https://gov.optimism.io/t/karma-grantee-accountability-feedback-thread/3960/23",
                        "https://gov.optimism.io/t/top-20-of-delegates-consolidate-82-of-all-delegated-voting-power-is-that-concerning/5240/24",
                        "https://gov.optimism.io/t/coinbase-op-base/5329",
                        "https://twitter.com/optimismFND/status/1629215777143369729?s=20",
                        "https://twitter.com/i/spaces/1BRKjZEyQeaKw?s=20",
                        "https://twitter.com/optimismFND/status/1628762300847980544?s=20",
                        "https://gov.optimism.io/t/16th-op-community-governance-call-is-febuary-28th-at-10am-pt-1pm-et-7pm-cet/5332",
                        "https://us02web.zoom.us/j/89808009720?pwd=WVZWNmpPMG5ScWhUMHdHdlFpOEVjdz09",
                        "https://gov.optimism.io/t/working-constitution-of-the-optimism-collective/55",
                        "https://gov.optimism.io/t/operating-manual-v0-3/4834",
                        "https://vote.optimism.io/",
                        "https://boardroom.io/optimism/overview"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.776515151515151
                },
                {
                    "author_link": "https://gov.optimism.io/u/Boardroom",
                    "index": "37",
                    "likes": "3",
                    "time": "06/03/2023-18:08:31",
                    "content": " Week of February 27, 2023  Highlights  Cycle 10 grant finalists were announced a few days ago. Cycle 11 grant applications are due on March 8, 19:00 GMT. Keep an eye on the Grants Council’s landing page for more information. Current Cycle 11 proposals can be seen using the appropriate forum category.   @lavande announced the Collective DAO Archives, comprising two resources to research policies, programs, and the unofficial roadmaps of 20 Ethereum DAOs. See Justine’s presentation at ETHDenver.  Proposals [Draft] Upgrade Proposal: Bedrock. V2 of this proposal is expected to be posted soon.  In the Forums Some questions (and answers) about Optimism’s monetary policy. Feedback on Agora’s voting portal continues in this thread.  On Twitter Technical deep dive on the Superchain, summarized. Weird ETH Yankovic at ETHDenver, and a long thread. Attestation-based identity, explained. Optimism weekly recap.  Governance Calls  A recording of last week’s community governance call can be found here, with recap to come soon. Quick Gov Links: Working Constitution | Operating Manual v0.3 | Voting Portal | Optimism on Boardroom ",
                    "links": [
                        "https://www.notion.so/090bb648d1854136b9630c608da7a8bc",
                        "https://gov.optimism.io/tag/cycle-11",
                        "https://discord.com/channels/667044843901681675/968498307913637919/1080909635910897754",
                        "https://www.youtube.com/watch?app=desktop&v=-szn6codPOk",
                        "https://gov.optimism.io/t/draft-upgrade-proposal-bedrock/5014",
                        "https://gov.optimism.io/t/optimism-monetary-policy/5430",
                        "https://gov.optimism.io/t/agora-vote-optimism-io-feedback-thread/5358",
                        "https://twitter.com/OPLabsPBC/status/1632186148578811904?s=20",
                        "https://twitter.com/optimismFND/status/1632100633464672256?s=20",
                        "https://twitter.com/OPLabsPBC/status/1631804376179195904?s=20",
                        "https://twitter.com/optimismFND/status/1631804600817963009?s=20",
                        "https://gov.optimism.io/t/recap-16th-op-community-governance-call-february-28th/5369",
                        "https://gov.optimism.io/t/working-constitution-of-the-optimism-collective/55",
                        "https://gov.optimism.io/t/operating-manual-v0-3/4834",
                        "https://vote.optimism.io/",
                        "https://boardroom.io/optimism/overview"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.149305555555555
                },
                {
                    "author_link": "https://gov.optimism.io/u/Boardroom",
                    "index": "38",
                    "likes": "5",
                    "time": "13/03/2023-16:18:41",
                    "content": " Week of March 6, 2023  Highlights  RetroPGF2 voting is live! Check out all the eligible projects. Here’s a recording of the kick-off call. Badgeholders can vote through March 23; see more info in the Badgeholder Manual. The grant submission deadline for cycle 11 has been moved to March 14 — keep your eye on the Grants Council docs. Current Cycle 11 proposals can be seen using the appropriate forum category. As @lavande notes in Discord: “Provided the [Bedrock v2] proposal draft receives the required delegate approvals, Bedrock will go to a vote during the voting period of Cycle #11, which begins at 19:00 GMT on March 23rd.” Community governance call is tomorrow — see details below.   Proposals [Draft] Upgrade Proposal: Bedrock - v2. This version includes important changes and context, and is followed up with the final results of the Sherlock audit contest.  In the Forums Citizens’ House badgeholders can if they want provide their RetroPGF2 voting rationales here. Badgeholder conflicts of interest can be disclosed in this thread. RPGF2: Overview of education nominees, generously provided by @Michael. Delegate communication thread updates from @OPUser and @saludiego201. Some feedback on EIP4844 Contributors Collection.  On Twitter If life is a party, RetroPGF is the music. Optimism weekly recap. OP Radio #22: Quests on Coinbase Wallet.  Governance Calls  The next community governance call is Tuesday, March 14th, at 10am PT / 1pm ET / 7pm CET, on Zoom. Quick Gov Links: Working Constitution | Operating Manual v0.3 | Voting Portal | Optimism on Boardroom ",
                    "links": [
                        "https://discord.com/channels/667044843901681675/892113251851206756/1083340551706923038",
                        "https://www.notion.so/11ef6cd63c254258a32246289f45925c",
                        "https://www.notion.so/cdcbfaebee494d339e85f459f39576ab",
                        "https://gov.optimism.io/tag/cycle-11",
                        "https://discord.com/channels/667044843901681675/968498307913637919/1083218806974980176",
                        "https://gov.optimism.io/t/17th-op-community-governance-call-is-march-14th-at-10am-pt-1pm-et-7pm-cet/5580",
                        "https://gov.optimism.io/t/draft-upgrade-proposal-bedrock-v2/5548",
                        "https://gov.optimism.io/t/draft-upgrade-proposal-bedrock-v2/5548/3",
                        "https://gov.optimism.io/t/retropgf-round-2-voting-rationale/5570",
                        "https://gov.optimism.io/t/badgeholder-conflict-of-interest-disclosures/5569",
                        "https://gov.optimism.io/c/governance/delegate-updates/45",
                        "https://gov.optimism.io/t/feedback-on-eip4844-contributors-collection/5566",
                        "https://twitter.com/harpethr/status/1634285393641197594?s=20",
                        "https://twitter.com/optimismFND/status/1634320369518608385?s=20",
                        "https://twitter.com/i/spaces/1vOxwMvEmpNGB?s=20",
                        "https://gov.optimism.io/t/17th-op-community-governance-call-is-march-14th-at-10am-pt-1pm-et-7pm-cet/5580",
                        "https://www.google.com/url?q=https://us02web.zoom.us/j/84087544843?pwd%3DcVpweHpEa2drYVRDZ1U0UklYSnR1QT09&sa=D&source=calendar&usd=2&usg=AOvVaw22TnqMjK_BYeCshiVu5GCw",
                        "https://gov.optimism.io/t/working-constitution-of-the-optimism-collective/55",
                        "https://gov.optimism.io/t/operating-manual-v0-3/4834",
                        "https://vote.optimism.io/",
                        "https://boardroom.io/optimism/overview"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.189867424242425
                },
                {
                    "author_link": "https://gov.optimism.io/u/Boardroom",
                    "index": "39",
                    "likes": "0",
                    "time": "20/03/2023-15:47:18",
                    "content": " Week of March 13, 2023  Highlights   RetroPGF voting is live until March 23. Here are all the eligible projects. See badgeholder voting rationales and conflict-of-interest disclosures. Bedrock goes up for voting on the new portal this week — 19:00 GMT on March 23.   Proposals [Draft] Upgrade Proposal: Bedrock - v2.  In the Forums Kromatika is looking for feedback on changing their use of proceeds from a Cycle 6 grant. Delegate communication thread update from @OPUser.  On Twitter This week in Optimism OP Radio #23: The Uncommon Mark Tyneway  In Discord There’s been a lot of activity in #gov-monitoring recently. Can edits be made to a grant proposal after the submission deadline has passed?  Governance Calls  Here’s the recording and recap of last week’s community governance call. Quick Gov Links: Working Constitution | Operating Manual v0.3 | Voting Portal | Optimism on Boardroom ",
                    "links": [
                        "https://app.optimism.io/retropgf-discovery?tab=All%20projects",
                        "https://gov.optimism.io/t/retropgf-round-2-voting-rationale/5570",
                        "https://gov.optimism.io/t/badgeholder-conflict-of-interest-disclosures/5569",
                        "https://vote.optimism.io/",
                        "https://gov.optimism.io/t/draft-upgrade-proposal-bedrock-v2/5548",
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-cycle-6-kromatika/3306/58",
                        "https://gov.optimism.io/t/opuser-delegate-communication-thread/2777/26",
                        "https://twitter.com/optimismFND/status/1636851031463145472?s=20",
                        "https://twitter.com/i/spaces/1vOxwMOpWXNGB?s=20",
                        "https://discord.com/channels/667044843901681675/1035325223442063360",
                        "https://discord.com/channels/667044843901681675/1069653708369047623/1085255175209496597",
                        "https://gov.optimism.io/t/recording-recap-17th-op-community-governance-call-march-14th/5617",
                        "https://gov.optimism.io/t/working-constitution-of-the-optimism-collective/55",
                        "https://gov.optimism.io/t/operating-manual-v0-3/4834",
                        "https://vote.optimism.io/",
                        "https://boardroom.io/optimism/overview"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.171717171717171
                }
            ]
        }
    ],
    "group_index": "217"
}