{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/op-x-pth-builders-cycle-11/5621",
            "title": "OP x PTH Builders Cycle 11 ",
            "index": 5621,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Grants Council"
            ],
            "tags": [
                "cycle-11"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/Raconcilio",
                    "index": "1",
                    "likes": "3",
                    "time": "14/03/2023-18:53:18",
                    "content": " Growth Experiments Form Note: We ask for an additional $50k to be used to build the platform not only for growth.  The builder grant would be used to make a robust blockchain platform, to test that the data is secure and would be distributed over the 6 months to UX designers, data managers, 2 crypto persons and one database manager. Basic Details Project name: PathoMapPth-Growth Author name and contact info (please provide a reliable point of contact for the project.): Rose Haft, Wilmer Daza L2 recipient address: 0x78CAa461da41bb64e08Fd7191657DF48E5804b2A Which Voting Cycle are you applying for?:Cycle 11 I confirm that I have read the landing pages for the Builders 23 Sub-Committees and that I have determined my proposal is best suited to be reviewed by the Growth Experiments Sub-Committee: [Yes/No]: I understand that Growth Experiments grants are subject to a “no sale rule,” as explained in post, and I have read the terms of the rule: [Yes/No]: Yes Project Details What are you building?: We are building an AI digital twin for healthcare and blockchain healthcare research management system. There are four main features:  a standardized intake form, our database that has digested information on what is relevant for the intake information where practitioners can provide feedback, follow topics, receive updates, and share information our AI that processes new information, and creates a digital twin for better understanding of what’s happening in the body A Web3 reporting platform for the usefulness of recommendations (case studies) – where anyone can register on the blockchain and help to digest data from research papers and provide peer reviews, decentralizing the health system  This combination allows the healthcare community to start to solve the problem of lack of transparency about healthcare solutions, support to provide excellent tools that are affordable to all professionals, and accountability around the use of best practices. Medical error and misdiagnosis are one of the highest costs to the healthcare industry, with almost no easy and trusted solution to help prevent this. Minorities are disproportionately hurt by the system as it stands and there is no flagging for medically racist or otherwise outdated formulas and no accountability for doctors that use them especially more than once or understanding if there is awareness or feedback. This system-based solution to protect both medical professionals and patients is incredibly important. This is solving a few problems:  When you ask doctors about what information they make decisions based on, it is largely based on memory with very little verification and no follow-up on the quality or usefulness of care Most quality of care ratings are purely subjective and relate to bedside manner there is no one prescriptive cure that works for everyone. Recommendations require bio-individuality and an understanding of the individual’s needs, as well as a way to report case studies that help to demonstrate the recommendations are working. there is a massive amount of health information on the internet and some of it is useful and some of it is not but it’s hard to understand things like conflict of interest, terminology, and best practices especially outside of a general field of study/ Our processes are digesting that data into an AI to make it useful to practitioners to provide a better quality of care. To help make the vast amount of information useful, we have made a report that is useful for healthcare practitioners, and in user interviews, we’ve been told this and how exciting it is for the future of healthcare. Right now, other companies have attempted to intake data to demonstrate healthcare but there is no incentive to do so as it puts doctors at risk of malpractice and isnt presented in a way that helps to understand bio-individuality. Our AI process and kickback payments to providers who put in information in the Web3 will help to make this possible. Our system enables full, yet HIPPA compliant, transparency, we can make sure that data is accurate and that people are updated in real-time about contradictory, complementary, or supported data and that no one is creating defamatory flagging without consequence or education. We will decentralize while also creating accountability to easily track bad actors and update users who have seen the information.  Why do you believe what you are building is going to succeed?: Every healthcare practitioner we’ve spoken to from doctors, to nurses, students, and nutritionist are excited about what we are building. It’s considered one of the most important things to be able to increase accuracy and compliance in healthcare while also reducing costs. It’s been touted as a solution that can help to reduce healthcare issues and hunger in third-world countries. We’ve also beta tested our AI and it’s been highly accurate in not only predicting disease but also stopping disease quickly. In our beta tests we’ve been able to stop chronic pain, a heart attack, retroactively predicted a stroke, stopped someone’s bones from breaking, have helped ADHD and chronic cripling anxiety attacks be reduced from every day to 1/month. The world is moving towards decentralizing and desperately wants a better healthcare system. We will enable this!  1080×1080 124 KB  How many users does your project have currently? Please include how you arrived at this estimate: We have 48 people who are using our AI to help them make healthcare practitioners and 80+ healthcare providers signed up with several family offices and LOIs totaling 10k users for when our platform is fully launched. We have one research hospital and two education programs waiting. The AI users are from our beta testers and we have organically grown our network of doctors, nutritionists and other healthcare practitioners. How will receiving a grant enable you to further the mission of maximizing the number of users interacting with Optimism? Please include a step-by-step flow of how you imagine this grant can lead to a greater number of user interactions with Optimism: With the grant, we will be able to help to tokenize public goods helping to decrease the corruption associated with them. Each paper produced and/or case study will be given a token value based on page views and number of times found useful in the algorithm. The idea is that all practitioners can have long-term funding and globally peer-reviewed articles. This will allow us to document more on rare diseases, optimize health and decrease healthcare costs. The system is being tested right now for diabetes and heart disease patients, where WHO estimates 80% of cases of the ⅓ of US Americans is not only reversible but preventable but requires a system like ours to make this possible. Tell us about the users you plan to target with this grant. Include any defining characteristics that will help you identify and target them.: At present we are targeting two main groups: healthcare professionals to test the platform algorithm and add to validate and add more information to the platform. Our second group is diabetes patients as we are part of a 20-year study on diabetes and heart disease, which allows us to take health insurance, and to have insurance pay for it they have to put in information. It is also one of the most prevalent healthcare issues pervading the US and the world so being able to solve for this problem would have huge implications. There are several peripheral diseases that would also help to understand impacting even more people beyond our original user base. How would these users interact with Optimism? For how long?: Our platform is able to help optimize all areas of health and we anticipate people using the platform for the rest of their lives. The idea is to make it easy to be paid and trusted to input data on the platform, and incentivize collaboration and self-governance. Even if the company does not take off, the papers can still be on the blockchain with data tags that will make it useful for years to come. Provide us with links to any of the following for the project:  Demo:  members [dot] pathomap [dot] co [backslash] intake – PM us for Private demo of the latest as it’s working but not the prettiest Website:PathoMap.co Twitter: @It’sPathoMap Discord/Discourse/Community: @Raconcilio  Github: Technical/Economic Documentation: Not publicly available but is outlined in the private demo Other: PM  Do you have any metrics on the project currently? (TVL, transactions, volume, unique addresses, etc. Optimism metrics preferred; please link to public sources such as Dune Analytics, etc.): Not yett Who are your competitors, and are they on Optimism?: No known competitors Please link to code audits (if any): None Who are your founders?: -Rose’s background is in deep tech – computer vision, advanced AI and healthcare having served more than 1M people through Berkely Wellness Letters, Worksite Wellness programs and through serving people at local health departments. -Wilmer, is a computer science engineer with +10 years of experiences a software developper, technical leader and CTO. He has developed video games, worked in Fintech and Blockchain as well. We also have a small team based out of Vetnam that is helping to scale our platform, make it HIPPA compliant and do the real time analysis What makes your team well-suited to carry out the project described in this proposal? We are our ideal users. Rose, our CEO did the research to developed these methods while trying to understand how to heal her own pre-diabetes, and Wilmer has an autistic brother and would like to understand more methods that could be useful but reliable and coherent sources of information are lacking. We are part of a CDC backed program, 20+ year study on health how to prevent and delay the onset of diabetes, heart disease and stroke in the US, which gives us the ability to take insurance over a full year to intake data, track progress and our AI’s predictive model overall. Is this your first Web3 project?: No for WIlmer. Rose built a web3 social media app If not, what else have you built? (Share links, Github repository, or any other useful information.): Grant Request What is the size of the grant request? (250k OP max): 250k How do you justify the size of the grant?: We will use the funds to add tokens to as many as we can of the 35 M PubMed research articles so we can use them in the AI. Each time we run the AI we track 60-300 pieces of data and information that need to be logged onto the blockchain, not to mention when there needs to be a time stamp, location information, IP, camera source information, etc. so that each piece of data has some semblance of accountability. This means we will need to use tokens to build and test the data. In addition, we will use this 250k token to create a liquidity pool that is matched by other token users so we can pay developers and/or people who are inputting the information and can start to demonstrate that we are paying for people to add data and info and giving kickbacks. Pathomap has the tremendous ambition of democratizing access to healthdata and changing the way we think and conduct medical research, thus, we need a lot of resources to actually have a chance of introducing and helping this revolution come into reality. The grant will allow us to finance the project and make it possible to demonstrate Web3 capability. We are not likely to integrate tokenization otherwise. Roadmap and Distribution Plan We have these main milestones for this year:  Deployment on an initial data set of medical research so that trust is built with the health community  At this stage we need to be able to create our liquidity pool to check, verify and further digest the data (40%) We also need to set the platform addresses and costs (10%)   Blockchain registration to add data, review research, categorize, etc to be used in a decentralized way HIPPA complaint Intake form deployment to ensure data is accurate, reliable and protected (39%) AI creation to digest the form information (1%) Gathering and lunching of the community of users  At this stage we need to be able to distribute the user incentives (20%)   Deployment of our DAO for the Pathomap project A stretch goal will be creating an API that others can use the digested data and access all features  Describe in discrete steps how you will successfully implement your grant plan:  We will have the OP tokens matched in a liquidity pool and/or find backers to add value to the PTH token We currently have a user interface that is organized to show high-level scientific health information for different diseases and symptoms to find root causes. In doing user research we’ve found that health data needs to be presented more like a meta-analysis to show the significance and reliability of health information. This will happen with the tokenization project. We will invite doctors, nutritionists, and other health professionals to check the reference data in their areas of expertise to provide feedback and indicate what (if any additional data is necessary). We will create our HIPPA-compliant standardized health form for patients to fill out that is easy to use and meets user-interface demands We will create the tokenized data processing for intake data We will provide recommendations via our AI algorithm We will ask for feedback on the progression of symptoms (tokenized) We will create case studies to be added as evidence back to our database We will continuously add more research papers, and allow people to add research papers on out platform to be reviewed by peers (tokenized) We will create dashboards and visual data systems to make it easier to understand the data at hand.  How will the OP tokens be distributed? (please include % allocated to different initiatives such as user rewards/marketing/liquidity mining. Please also include a justification as to why each of these initiatives align with the problem statement this proposal is solving. Distribution should not include the sale of any tokens by the grantee or the use of tokens for compensation, protocol expenses, etc. See the no sale rule here 1): We will create a liquidity pool to start and get token investors and backers for the pool to match the amount as we do need cash to operate. Note money from customer orders may be part of this match. We will then use tokens as allowed for transactions and set-up fees. We will aim to pay healthcare users $.1 / per piece of data into the platform ($500/month expected) We will aim to receive income from healthcare practitioners and if adding information to the platform, we will pay back 10% of sales value. We anticipate needing more tokens to complete the project and will either apply for another grant or purchase with the liquidity pool. Over what period of time will the tokens be distributed for each initiative?: 6 months Please provide benchmark milestones for this project. These milestones should guide the Optimism community on the progress of your project throughout your work on the project. Do not use distribution of the grant itself as a milestone: Milestones include:  Number of practitioners actively using the platform (1, 10, 100, 1000) Percentage Doctors, Nurses, Hospitals, Nutritionist as total market distribution (.001%, .005%, .010%, .020%) The number of papers that have their data digested to show meta-analysis style and page views ( Amount of information collected from users daily (Milestones 1 DAU, 10 DAU, 100 DAU, 1000 DAU) Number of transactions per day (1, 10, 100, 1000, 10000, 50000) Amount of funding in the liquidity pool ($10USD equivalent, $100, $1000, 10000, 50,000, 100,000, and 250,000)  Please define critical milestones for this project. Critical milestones are meant to show good-faith efforts to accomplish the project. Non-completion of these milestones could lead to revocation of remaining grant rewards. Do not use distribution of the grant itself as a milestone: If the OP tokens are for direct distribution to users, why will incentivized users and liquidity on Optimism remain after incentives dry up?: The initial incentives are to be mapped to our own token PTH, Please provide any additional information that will facilitate accountability (smart contracts addresses relevant to the proposal, relevant organizational wallet addresses, etc.): 0x78CAa461da41bb64e08Fd7191657DF48E5804b2A and additional TBD Optimism Relationship Does your project solve a problem for the Optimism ecosystem? If so how?: We bring the possibility for this ecosystem to contribute to projects in the health care industry, extending the variety of use cases addressedadressed by the ecosystem, but also practical and long-term use cases. As we will use publicly available data this is also in alignment. Why will this solution be a source of growth for the Optimism ecosystem?: The industry will know that Optimism is capable of addresses not only traditional financial use cases in crypto, but also having other use cases across different industries, moreover one as important as healthcare. It will also help to decentralize and incentivize healthy information of health data, making universal healthcare a reality (our AI should help to reduce healthcare costs to by at least $300B out of current $600B current costs) Is your project Optimism Native?: Yes Confirmations I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: [Yes/No]: Yes I understand that I will be expected to following the public grant reporting requirements outlined here: [Yes/No]: Yes ",
                    "links": [
                        "https://foul-porch-0eb.notion.site/Proposer-AMA-February-3-2023-279db2774af249a8b07797d3cb9b5ef3",
                        "https://gov.optimism.io/t/suggested-public-reporting-requirements-for-grantees/4176"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.836672955422956
                },
                {
                    "author_link": "https://gov.optimism.io/u/memmedliruslan",
                    "index": "2",
                    "likes": "1",
                    "time": "15/03/2023-18:56:25",
                    "content": "    Raconcilio:  blockchain   Really want it you on ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Raconcilio",
                    "index": "3",
                    "likes": "1",
                    "time": "15/03/2023-18:57:36",
                    "content": "Thanks! We hope so, also! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5625
                }
            ]
        }
    ],
    "group_index": "614"
}