{
    "poll_list": [
        {
            "id": "0x61860171c5cbbd4ebec5e4a778d58f979e13e7f4657998defcee5fe46db3f54f",
            "title": "Season 2: Cycle 8: Symphony ",
            "discussion": "https://gov.optimism.io/t/review-gf-phase-1-proposal-symphony-finance/3694",
            "body": "This Governance Fund Phase 1 proposal is eligible for voting in Cycle 8. This is the last Voting Cycle of Season 2. \n\nThis proposal was reviewed by [DeFi Committee A](https://gov.optimism.io/t/defi-committee-a-season-2-recommendations/3522/10?u=lavande). You can find committee recommendations below:\n[DeFi Committee A Recommendations](https://gov.optimism.io/t/defi-committee-a-season-2-recommendations/3522/10?u=lavande)\n\nShadow DeFi Committee B is not an official committee but posts their own recommendations here: [https://gov.optimism.io/t/defi-shadow-committee-season-2-recommendations/3549/11](https://gov.optimism.io/t/defi-shadow-committee-season-2-recommendations/3549/11)\n    \n By approving committees, the Token House entered a social contract to entrust and delegate the bulk of decision-making to official committees. However, delegates may vote against the recommendation of official committees but should provide a justification to the community as to why they voted differently.",
            "choices": [
                "For",
                "Against",
                "Abstain"
            ],
            "scores": [
                142128.06087840124,
                11966307.704316614,
                3510296.297036587
            ],
            "start": 1667513176,
            "end": 1668110776,
            "snapshot": "30456637",
            "state": "closed",
            "author": "0x83E54889754e737Fb3CdF07BAaCC0eB9699B6Bdd",
            "space": {
                "id": "opcollective.eth",
                "name": "Optimism Collective"
            }
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/review-gf-phase-1-proposal-symphony-finance/3694",
            "title": "[REVIEW] [GF: Phase 1 Proposal] Symphony Finance ",
            "index": 3694,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Governance Fund: Phase 1"
            ],
            "tags": [
                "season-2",
                "cycle-8",
                "not-passed"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/kakashi",
                    "index": "1",
                    "likes": "12",
                    "time": "13/10/2022-16:03:09",
                    "content": "Project name: Symphony Finance Author name and contact info (please provide a reliable point of contact for the project): @kakashi @Rohan @Roland @Pankaj I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: Yes L2 recipient address: 0x49646c840f3F59de4Ab10E0F938477D50889607B Which Voting Cycle are you applying for?: Cycle 8 Grant category: DeFi Is this proposal applicable to a specific committee? DeFi Community Project description: A novel yield-optimized trading protocol that earns you extra yield while trading crypto. Symphony DEX is the composability layer that aggregates prices and liquidity across all DEXs and DEX aggregators, providing you with the best prices and fastest execution speeds for your trades. This way, you can buy and sell tokens more capital-efficiently than ever. Your trades keep earning yield on safe protocols like Aave, Yearn, etc. till the time they execute. Symphony also offers limit and stop loss order features, allowing maximum flexibility for various trading strategies. These features help protect you from depegs and let you DCA effectively during market dips - while still earning you interest. Along with being the only yield-generating DEX, Symphony DEX is also a certified gnosis-safe standard platform, allowing users to control their digital assets with much more granular permissions. It is the perfect protocol for multisigs, DAOs & funds to diversify their treasuries. We are proudly backed by Aave, Balancer, and Mstable grants. Symphony DEX is live on Optimism and, it allows you to trade tokens including $OP with limit and stop-loss order functionality. We have already integrated with industry leaders like Uniswap, Aave, Balancer, Paraswap and are open to integrating with more protocols such as Velodrome & other DEXes, DEX aggregators, and lending & yield optimizers thereby bringing more growth to the broader Optimism ecosystem. Project links:  Website: https://symphony.finance  Twitter: https://twitter.com/SymphonyFinance  Discord: https://discord.com/invite/HsVP3KP3VD  GitHub: Symphony Finance · GitHub  Medium: https://symphony-finance.medium.com  TikTok: https://www.tiktok.com/@symphonyfinance  Subgraph: Yolo Optimism Subgraph   Additional team member info: Team - Docs Relevant usage metrics (TVL, transactions, volume, unique addresses, etc. Optimism metrics preferred; please link to public sources such as Dune Analytics, etc.): (As of 13th October 2022) Order Created Cumulative Orders (Optimism) - 2487 Cumulative Orders (Polygon) - 79702 Unique wallets Unique address on Optimism - 1397 Unique address on Polygon - 33,490 Cumulative Volume Cumulative Volume (Optimism) - $145,635 Cumulative Volume (Polygon) - $10,810,536 Dune Dashboard:   dune.com    Symphony Blockchain ecosystem analytics by and for the community. Explore and share data from Ethereum, xDai, Polygon, Optimism, BSC and Solana for free.       unique wallets884×383 16 KB   yolo value886×381 19 KB  Competitors, peers, or similar projects:  https://1inch.io/ https://www.0x.org/ https://www.sushi.com  Is/will this project be open sourced? Yes Optimism native?: No Date of deployment/expected deployment on Optimism: July 2022 Ecosystem Value Proposition: What is the problem statement this proposal hopes to solve for the Optimism ecosystem? During our research, we found that most DEXs fail to execute trades on time, even when there is sufficient liquidity and appropriate price on other AMMs. This problem was due to the design of order book-based DEXs, where liquidity from other DEXs couldn’t be leveraged. That is a massive problem that needs to be solved, considering that we expect a huge number of new investors to enter the crypto market in the next 6-12 months. Although DeFi is generally known for its high and safe yields, a lot of inexperienced new users don’t understand the process of liquidity providing:  How to stake / unstake Swap Bridge Move funds between wallets.  If things go wrong, they can’t remember what step they missed and start double-checking again. It’s a complicated and time-consuming process, especially for a common user. In the past few months, the ecosystem saw tremendous stablecoin de-pegs like never before. Volatility led to a massive downturn in asset prices and resulted in huge capital losses for investors. 99% of DEXs don’t earn interest for you when your trades are waiting in the order book. As a result, you have to choose between earning interest and stop-loss protection. So we asked: Why can’t we have both? Millions of dollars worth of stablecoins are waiting right now across all protocols’ order books to hit their order prices, without earning any yield. As a result, a huge amount of potential yield goes to waste. Symphony aims to solve these problems on Optimism. How does your proposal offer a value proposition solving the above problem? At Symphony, we understand that when you’re riding the volatility, your trades need to execute quickly. This is why we’ve built our DEX as the composability layer that aggregates liquidity across the network giving the user quick trade execution. Symphony acts as a Meta DEX aggregator giving the user the best price across all decentralized exchanges and aggregators such as Uniswap, ParaSwap, 1inch, and other liquidity sources. A small price change can make a big difference especially as trading is a matter of fine margins. We’ve automated yield generation so users can focus on the trading. The trades keep earning yield on safe protocols till the time they execute. Symphony DEX optimizes yield on trades and auto compounds them by integrating with safe and battle-tested protocols like Aave, Yearn, etc. All one needs to do is create an order, and the yield comes automatically. Symphony also solves depeg protection by providing a stop-loss order feature. With Symphony you can protect your capital from a stablecoin depeg situation, by setting a stop loss at $0,95. Your stable will keep earning yield even while it’s in the order book. If a stable depegs, your stop loss will hit and you will get out in time with no yield wasted. So your stables keep earning interest while you wait for the asset to reach your buy price. If a user wants to buy ETH under $1.2k and earn yield till it executes, they can just set a buy limit order on Symphony DEX. This way the user earns passive yield on the stables even if the order price never hits. All in all, Symphony DEX provides a win-win situation for its users, while they maintain self-custody of their assets on Optimism. Why will this solution be a source of growth for the Optimism ecosystem? Symphony Finance aims to spur the growth of the Optimism ecosystem by providing a wide range of features that will attract both traders & yield farmers. Symphony DEX would also attract the holders of stable assets like stable USD pegged coins, LIDO staked eth, etc. Holders can reduce losses in the event of de-pegging while keep earning yield in the background. Apart from this, Symphony is well-positioned to cater to DAOs & multi-sig wallets by successfully integrating with Gnosis safe. Symphony DEX can serve as a treasury management tool for Safe users. By simplifying on-chain trading through Symphony DEX, we are trying to onboard the next-gen users to Web3 & DeFi. Most people interested in DeFi, especially non-native users can’t use the on-chain protocols due to high L1 gas fees and often find the whole trading process complicated. Optimism optimizes gas fees and Symphony provides automatic yields along with great trading features making it a low-risk, high-reward solution and help incentivize the new users to transition from CEX to DEX. This in turn encourages a new wave of users to explore and grow the OP ecosystem. We already have a decent amount of users across other chains and by incentivizing activity on Optimism, Symphony DEX will be able to attract those users to Optimism and become the go-to trading DEX for all types of Web3 users ranging from an average Joe to professional traders. With this grant distribution, Symphony DEX will be able to incentivize trading activity, utilize resources to expand our marketing efforts, and increase further developments and maintenance of our DEX on Optimism. Through sustained growth, our aim is to make Optimism the main network for DeFi users. Has your project previously applied for an OP grant? No Number of OP tokens requested: 250,000 OP Did the project apply for or receive OP tokens through the Foundation Partner Fund?: No How much will your project match in co-incentives? (not required but recommended, when applicable): Our project does not have a native token yet, so we are currently unable to co-incentivize, but this can change in the future. Proposal for token distribution: How will the OP tokens be distributed? (please include % allocated to different initiatives such as user rewards/marketing/liquidity mining. Please also include a justification as to why each of these initiatives align with the problem statement this proposal is solving.) Users on Optimism (55%) $OP will serve as a direct incentive for Symphony Finance Optimism users, primarily active users and new ones, to increase trading activity on the platform. Once the traders use Symphony and experience the smooth UX along with the yield and price aggregation features, they will not want to change their DEX preference. The initial trading activity will be incentivized through this distribution and help in attracting a maximum number of users. i) 35% OP token airdrops for limit order For the most active traders and users on Symphony, we will distribute the OP token airdrops retrospectively after we analyze the data. We specifically chose this method to prevent boting / airdrop hunting. Through token airdrops, we want to boost sustainable growth and minimize airdrop hunting. We can use the following metrics to analyze and disburse token airdrops:  Unique wallets interacted with the protocol (OP side) for the most number of days. (Minimum 14 days) Has used (for example: Swapped at least $100 worth of crypto) in Symphony AND on another OP native project in the last X days.  This feature directly incentivizes the usage of Symphony on the Optimism Network. It will indirectly boost the OP ecosystem usage because it applies to all limit orders for every Token from the Optimism ecosystem. ii) 20% gas refunds 20% $OP tokens will be used to cover the gas fees for the users on the Symphony DEX. The grant will be used to subsidize gasless/free trades for the users of Symphony. Each user can possibly get a maximum of 90% gas rebate. There can be a possibility that the gas fee refund allocation is more than the actual gas refunds. In that case, the remaining tokens will be allocated to the user incentives. Marketing: Ecosystem & Community - Optimism (15%) $OP will be used for marketing, ecosystem & community initiatives to foster user outreach and amplify our marketing efforts across various channels, through strategic partnerships and collaborations. We are growing rapidly and through this distribution, we want to boost our efforts to onboard as many new users as we can. We are also planning some creative ways to give back to the community, similar to what Aave did for lending which rewarded the user with $OP tokens. Hence, Symphony will reward the grants for content creation, and cross-promotion / collaboration with other OP projects. For example:  Host AMAs with OP industry-leading projects, make Q&As, and those who participate OR answer a 5 to 10 questionnaire, can win prizes. Create a Request For Innovation campaign. Take a look at this (Notion – The all-in-one workspace for your notes, tasks, wikis, and databases. ) We will choose topics related to DeFi, DEX & OP ecosystem and incentivize members to make content on the same. for eg. Make a 500-600 words article on why DEXs are essential in the global economy. People write these articles, submit them to us, and we choose the best one. After that, we publish it on our Medium and the writer gets its reward in OP tokens. We don’t believe in influencer shilling so we can incentivize the community with written articles/tweets/videos and distribute the funds to those who genuinely deserve it on merit. We will also highlight at the end of every article that it was made possible by OP funds.  Social media marketing has the potential to attract new users to Crypto & DeFi by creating an aggressive marketing campaign in order to convert leads given the number of people that consume content in the form of short-form reels on platforms like Youtube, Instagram, Facebook, and TikTok for which paid campaigns will be utilized. Onboarding and educating users who are used to Web2 services to Web3 takes some investments but it can help convert a huge number of leads. We’ll also be targeting Twitter as it’s the most used platform by crypto users. Development & Maintenance (30%) $OP will be dedicated to the development and maintenance to ensure Symphony DEX is evolving with updated features and security measures. Currently, the Symphony Finance team runs the relayer (a bot that automatically executes trades). The fund allocation for further development of the platform will help Symphony DEX to stay ahead of the curve and continue being a pioneer in innovation across the DEX ecosystem. Short-Term Roadmap  Add more tokens to get additional TVL Support more protocols for execution orders such as Velodrome Add more yield generation strategy to provide better APY to users Boost community engagement via RFIs (refer to marketing distribution)  Long-Term Roadmap  Order Book Interface - Allow users to fill orders directly from the interface. Support of COW (Coincidence of Wants) - Internal order matching. Support more complex order types such as twap/icebergs orders. More Yield - Users can choose to earn more yield according to their risk appetite. Advanced Trading UI - The UI is just like CEXes. Add more products to Symphony DAO.  Over what period of time will the tokens be distributed for each initiative? Shorter timelines are preferable to longer timelines. Shorter timelines (on the order of weeks) allow teams to quickly demonstrate achievement of milestones, better facilitating additional grants via subsequent proposals. Due to the variable nature of the distribution method, it’s difficult to provide definite timelines for the program but we are aiming for it to be a 3-6 months program. We will adjust the period to try to incentivize more sustainable liquidity as we learn from the results as stated in the previous answer. We don’t want to utilize these rewards too quickly and make sure that there is long-term growth in our DEX and Optimism usage. Please list the milestones/KPIs you expect to achieve for each initiative, considering how each relates to incentivizing sustainable usage and liquidity on Optimism. Please keep in mind that progress towards these milestones/KPIs should be trackable. These are the relevant KPIs that we are targeting by the end of incentives. The KPIs will be measurable through Dune Analytics.  Exceeding 4000 unique wallets onboarded onto Optimism Growth of 5-10x in the global trading volume on Optimism At least 2 limit orders per wallet (to prevent airdrop hunting)  We can also add Yield earned as a metric. We think this is a very modest target. Our main focus is to onboard new users to Optimism rather than bringing volume in the first place. Even if they make a trade of value of $50, we will be happy. If we are able to successfully onboard active users then, we can even make 50-100% growth in volume. So in the long run the risk of cannibalization effect is low. Why will incentivized users and liquidity on Optimism remain after incentives dry up? Even after the incentives have finished, the retention value of users will be at the higher end, because there isn’t a better alternative in the market right now. Symphony’s innovative features coupled with the benefits of low gas fees and high transaction speed due to the roll-up architecture of Optimism will make users stay. This grant will accelerate growth initially, as OP tokens will incentivize users in the initial fast growth period. After the “fast growth period” we’d retain users, because of our previously mentioned features & better UX. Within the existing set of DEXs, Symphony DEX offers a unique solution that is not only attractive but also sustainable in the long run. We are simplifying DeFi for the next wave of new users and we ensure their first stop will be the OP ecosystem. Optimism provides some of the highest APYs across different protocols. In market conditions like this, where capital efficiency is given more priority, the yield generation feature will also incentivize traders to use Symphony DEX as an easy yield farming opportunity on Optimism, thus maintaining sufficient liquidity on the platform. We have shown signs of growth despite bearish market conditions. There is a clear market fit for Symphony in the industry and it’ll continue to grow along with the broader crypto market. Symphony has the potential and capabilities to grow in the long term and with the right incentives, the chances of more users getting attracted to use Symphony on Optimism are very high. Please provide any additional information that will facilitate accountability:(smart contracts addresses relevant to the proposal, relevant organizational wallet addresses, etc.) YOLO: 0x3ff61f4d7e1d912ca3cb342581b2e764ae24d017 ",
                    "links": [
                        "https://twitter.com/a_variable_",
                        "https://twitter.com/therolandgal",
                        "https://twitter.com/Pkjdalmia",
                        "https://symphony.finance",
                        "https://twitter.com/SymphonyFinance",
                        "https://discord.com/invite/HsVP3KP3VD",
                        "https://github.com/symphony-finance",
                        "https://symphony-finance.medium.com",
                        "https://www.tiktok.com/@symphonyfinance",
                        "https://thegraph.com/hosted-service/subgraph/symphony-finance/yolo-optimism",
                        "https://symphonyfi.gitbook.io/docs/team",
                        "https://dune.com/variable/Symphony",
                        "https://dune.com/variable/Symphony",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/7/77bb3c72526edf8c352b13aea5b6c640709157c6.png",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/6/6d174c789fa0750619b7545d2862d6e5bd8b6691.png",
                        "https://1inch.io/",
                        "https://www.0x.org/",
                        "https://www.sushi.com",
                        "https://tempusfinance.notion.site/Request-for-Innovation-RFIs-728c728ff39948149ff771a43f34048d",
                        "https://optimistic.etherscan.io/address/0x3ff61f4d7e1d912ca3cb342581b2e764ae24d017",
                        "https://gov.optimism.io/t/voting-cycle-8-roundup/3742/14",
                        "https://gov.optimism.io/t/gfx-labs-delegate-communication-thread/2728/19",
                        "https://gov.optimism.io/t/defi-committee-a-season-2-recommendations/3522/10"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.876469567299061
                },
                {
                    "author_link": "https://gov.optimism.io/u/cryptologycation",
                    "index": "2",
                    "likes": "2",
                    "time": "14/10/2022-12:01:42",
                    "content": "have used symphony on polygon and matic, a good experience+yield…keep up guys ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/Benak1",
                    "index": "3",
                    "likes": "2",
                    "time": "15/10/2022-14:30:18",
                    "content": "One of the most innovative feature I’ve seen in DEXes. Imagine actually being “paid” to open a limit order. It’s ingenious ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/CaptainTee",
                    "index": "4",
                    "likes": "2",
                    "time": "16/10/2022-18:32:01",
                    "content": "Symphony DEX has saved me many times with the amazing stoploss feature notably was during the UST (Polygon chain) depeg crisis where I naively aped in  Earning yield while trading is cool but being able to sell $OP token almost at it’s ATH while I was in bed is one of the reason I’m giving kudos to the Symphony Finance team for coming with this great initiative, I bought $OP at a lower price now, placed it again on Symphony DEX patiently waiting for the magic. With Symphony Finance, Multi-Tasking is achievable in DeFi  We need to onboard many projects like Symphony into Optimism Ecosystem, TBH ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.194444444444445
                },
                {
                    "author_link": "https://gov.optimism.io/u/moshiri",
                    "index": "5",
                    "likes": "3",
                    "time": "16/10/2022-23:22:51",
                    "content": "i’ve been a long time user on polygon and AVAX and love how Symphony is user friendly making it easier to earn yield while waiting for orders to be filled. i hope they the collective boost their efforts by making it easier for them to onboard users into Optimism Ecosystem. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.53125
                },
                {
                    "author_link": "https://gov.optimism.io/u/Nero",
                    "index": "6",
                    "likes": "1",
                    "time": "17/10/2022-07:06:27",
                    "content": "I like symphony dex for these following reasons.  Its fast and reliable A quick accessible interface I get to send token to a different wallet if i wish just as am converting my token  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.908333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/Profitbooster",
                    "index": "7",
                    "likes": "2",
                    "time": "17/10/2022-10:10:42",
                    "content": "I have been using Symphony finance for some months. Back in the days when they dex only existed on Polygon network. I personally this project has great potential and will bring more value to Optimism network. One of the innovative idea about symphony finance is the ability to earn yield while waiting for d order to close. I find this fascinating. I think Optimism network is lucky to have this great developers from symphony finance. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.816666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/ScaleWeb3",
                    "index": "8",
                    "likes": "3",
                    "time": "17/10/2022-12:21:33",
                    "content": "Thank you for your proposal. The product makes sense and can be beneficial to Optimism users. 3 questions for clarification:  “Your order will be executed when the price of 1 token reaches the limit price.” Does this mean someone else can create a small order within your limit and the rest of your Ask will be potentially filled with a worse price? Or would your order be split up into multiple trades? To determine the value-add, we’d love to get a bit more (quantitative) insight into the product economics. What is the (%, total, net) advantage over using other DEX aggregators or yield managers. And, how big + how long do limit orders need to be in the pool to make additional gas costs from transactions worth it? Do you have any calculations that you can share? The roadmap on the website details little next steps/dates after multi-chain expansion? Any insight?  Re Proposal: The stated goal of onboarding users, incl. current users from other chains, is good use of grant funds. The innovative project can potentially add value to the Op ecosystem and its users.   Traction:  It’s good to see you already deployed on Optimism, integrated protocols & gained first traction Adoption is little so far with about $11M total volume (most during LM 2.0 campaign on Polygon) $50K total value locked according to DefiLlama. (Is this equal to open limit orders?)    Distribution:  The Op distribution is a bit broad which makes it hard to a) assess positive impact of the proposal and b) retrospectively evaluate the success of this grant proposal. Can you give more detail on spending the 40%? Any concrete plans on incentive programs? 60% for “discrete use” in form of marketing and further development is a bit unclear. Generally, grants can be used for development work but it would be good to understand what kind of features would be unlocked, added and consequently help Op users. The marketing proportion seems relatively high.    Ask is pretty high for a small project where the value-add to the Optmism ecosystem is yet to be seen and no co-incentives are added.  imo, it’s reasonable to ask projects to match liquidity/APY boosts achieved through Op grants. Some additional insights into value-add may already improve this point & justifiy a certain Ask for a unique, innovative product on Optimism without co-incentives. Additionally, a reduction in the Ask amount would potentially limit the “risk” Op takes and you’d still be able to prove your contribution to Optimism user growth & trading efficiency within a smaller scope before applying for additional grants.    KPIs:  A combination of (unique) user onboarding & Total Trade Volume/Market Share Growth is reasonable for a DEX. In your specific case, DEX execution prices (vs. others) and especially yield earned could also be interesting to define the value-add of using Symphony vs. other aggregators. What do you mean with “Growth of 5-10x in the global trading volume on Optimism”*? Does this mean you want to grow your cumulative volume on Op from $150K to $750K - $1.5Mio? Or are you refering to market share? Again, 250K Op for $1M additional volume (potentially cannibalization effect?) would be a high Ask    Generally, we are not the biggest fans of grant funding for marketing use as we believe collaborative projects should run marketing anyways - especially when there are incentive programs funded with Op tokens. That’s why it could make sense to scale down the marketing proportion in favor of more direct user incentives. However, we do also see that there is a very high focus on pure monetary incentives & TVL in the Op ecosystem so far and we believe that specific marketing efforts can indeed bring new users to Op - whether that is for a betting market, game, a first touchpoint on Optimism, or a quality trading interface & experience. Hence, no need to share secret plans but it would be good to get a bit more insights to evaluate the proposal. Thx ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.617401660388674
                },
                {
                    "author_link": "https://gov.optimism.io/u/kakashi",
                    "index": "9",
                    "likes": "1",
                    "time": "18/10/2022-20:10:33",
                    "content": "Thanks for this detailed feedback @ScaleWeb3.  Your order will be executed when the price of 1 token reaches the limit price.*” Does this mean someone else can create a small order within your limit and the rest of your Ask will be potentially filled with a worse price? Or would your order be split up into multiple trades?  Actually, we aggregate prices across DEXes and DEX aggregators and we use FCFS. So, your order will be executed first if there is liquidity. Currently, we don’t support iceberg orders. That’s in our future roadmap to support different types of orders.  To determine the value-add, we’d love to get a bit more (quantitative) insight into the product economics. What is the (%, total, net) advantage over using other DEX aggregators or yield managers. And, how big + how long do limit orders need to be in the pool to make additional gas costs from transactions worth it? Do you have any calculations that you can share?    Compared to the Gelato limit order protocol on Polygon, the transaction cost is 50% cheaper.   A $1000 order takes anywhere approx 66 hours to earn more profit than the cost of the extra gas fee paid as compared to the 1inch Limit Order. But the point to note here is that most of the 1inch Limit orders are canceled. It might be because of a lack of incentives for the executor, the 1inch team will not be able to run the relayer because of the unstainable business model as of now. This delays the execution of limit orders which ultimately causes monetary loss.   Here is the spreadsheet that demonstrates the time taken to recover the extra cost paid on Symphony DEX:  docs.google.com    Order Time Calculator Polygon   Transaction Details Calculation,Symphony Create Order Cost,$0.044,Create Order Gas (in Matic),0.0438772,https://polygonscan.com/tx/0xbf0489c3720b0599a1c25fd1a9d7ae5bf33e3b9689c19966f3...      Comparing average fees for a transaction on 1inch Limit Order Protocol with Symphony DEX assuming ETH is priced at $1500.  Taking the example further and assuming the yield to be in the range of 5% APY, the order will earn back the fees paid as yield in ~ 66 hours.  Taking the same example, a chart illustrates the interest accrued over time.  interest earned926×129 16.7 KB  Hence, in our example comparison with 1inch limit order, not only will the user recoup the extra transaction cost in around 2.5 days of yield but also continue to earn interest as per their order value and time period without any hassle on Symphony.  The roadmap on the website details little next steps/dates after multi-chain expansion? Any insight?  Short-Term Roadmap  Add more tokens to get additional TVL Support more protocols for execution orders such as Velodrome Add more yield generation strategy to provide better APY to users Boost community engagement via RFIs (refer to marketing distribution)  Long-Term Roadmap  Order Book Interface - Allow users to fill orders directly from the interface. Support of COW (Coincidence of Wants) - Internal order matching. Support more complex order types such as twap/icebergs orders. More Yield - Users can choose to earn more yield according to their risk appetite. Advanced Trading UI - The UI is just like CEXes. Add more products to Symphony DAO.   $50K total value locked according to DefiLlama. (Is this equal to open limit orders?)  Yes.  Distribution:  I agree with your point and, am happy to share a detailed/revised version of our token distribution plan:  55% Incentives for OP users 15% for marketing 30% Maintenance & Development  55% Incentives for OP users i) 35% OP token airdrops for limit order For the most active traders and users on Symphony, we will distribute the OP token airdrops retrospectively after we analyze the data. We specifically chose this method to prevent boting / airdrop hunting. This feature directly incentivizes the usage of Symphony on the Optimism Network. It will indirectly boost the OP ecosystem usage because it applies to all limit orders for every Token from the Optimism ecosystem. ii) 20% gas refunds 20% $OP tokens will be used to cover the gas fees for the users on the Symphony DEX. We will offer gasless swaps on the Optimism network via its MetaDEX aggregator. The grant will be used to subsidize gasless/free trades for the users of Symphony. 15% for marketing Symphony will reward the grants for content creation, and cross-promotion / collaboration with other OP projects. For example:  Host AMAs with OP industry-leading projects, make Q&As, and those who participate OR answer a 5 to 10 questionnaire, can win prizes. Create a Request For Innovation campaign. Take a look at this (Notion – The all-in-one workspace for your notes, tasks, wikis, and databases.) We will choose topics related to DeFi, DEX & OP ecosystem and incentivize members to make content on the same. for eg. Make a 500-600 words article on why DEXs are essential in the global economy. People write these articles, submit them to us, and we choose the best one. After that, we publish it on our Medium and the writer gets its reward in OP tokens. We don’t believe in influencer shilling so we can incentivize the community with written articles/tweets/videos and distribute the funds to those who genuinely deserve it on merit. We will also highlight at the end of every article that it was made possible by OP funds.  30% Maintenance & Development As mentioned earlier, $OP will be dedicated to the development and maintenance to ensure Symphony DEX is evolving with updated features and security measures. Some of the features that we are looking to integrate into Symphony are as follows:  COW (Coincidence of Wants) - Internal order matching. Order Book UI - It will allow takers (users) to fill orders directly from the interface. Support more protocols for execution orders such as Velodrome. More Yield - Users can choose to earn more yield according to their risk appetite. MEV Protection - An essential feature for large-size trades. Help Symphony DEX better serve multi-sigs & DAO with big treasuries. Advance Trading UI.  The fund allocation for further development of the platform will help Symphony DEX to stay ahead of the curve and continue being a pioneer in innovation across the DEX ecosystem.  Ask is pretty high for a small project where the value-add to the Optimism ecosystem is yet to be seen and no co-incentives are added.  Symphony has not launched its governance token. We are currently working on tokenomics, and upon the launch of the token, we will allocate a good amount to the community as liquidity incentives. Symphony has worked perfectly and brought in much value even without token incentives so far since launch, and we have confidence that it will remain so in the future. Given the value that symphony’s features bring to the OP ecosystem, The $OP incentives will act as a bootstrapping mechanism to attract many more traders and investors within and from outside the chain, who are expected to stay with us for the long term.  KPIs: What do you mean with “Growth of 5-10x in the global trading volume on Optimism”*? Does this mean you want to grow your cumulative volume on Op from $150K to $750K - $1.5Mio? Or are you refering to market share? Again, 250K Op for $1M additional volume (potentially cannibalization effect?) would be a high Ask  I agree with your point here. We can add yield earned as a KPI. “Growth of 5-10x in the global trading volume on Optimism” means growth of 1-1.5M in total trading volume. We think this is a very modest target. Our main focus is to onboard new users to Optimism rather than bringing volume at the first place. Even if they make a trade of value of $50, we will be happy. If we are able to successfully onboard active users then, I think we can make even 50-100% growth in volume. So in the long run the risk of cannibalization effect is low. Finally, thanks again for taking the time to read the proposal and providing feedback. I will love to answer any further questions you have. We will also incorporate your suggestion and update the proposal accordingly. ",
                    "links": [
                        "https://docs.google.com/spreadsheets/d/1C7zVtGOxgzfUpN7m4jLtsCaeuGf71Ad9wEH9WbtToYI/edit",
                        "https://docs.google.com/spreadsheets/d/1C7zVtGOxgzfUpN7m4jLtsCaeuGf71Ad9wEH9WbtToYI/edit",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/c/cfafc11d6f3afeede8ac4233f1e6093847c6acd3.png",
                        "https://tempusfinance.notion.site/Request-for-Innovation-RFIs-728c728ff39948149ff771a43f34048d"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.802862697774202
                },
                {
                    "author_link": "https://gov.optimism.io/u/ScaleWeb3",
                    "index": "10",
                    "likes": "2",
                    "time": "18/10/2022-21:14:22",
                    "content": "Thank you for this great reply, especially the details on product and competitiveness to other solutions. The product is unique & innovative and we’d like to see Symphony fully integrate quality apps on Optimism and consequently offer traders on Optimism a superior experience. Re: Adjusted Distribution   The 30% part for development funding is well-reasoned and will help additional projects on Optimism as well.   Happy to see the increased incentives (55%) for Symphony users on Optimism. We like the approach of retroactively distributing rewards as that can indeed limit opportunistic APY hunters. (Maybe someone else can also comment on this IF they prefer more details on this significant amount of the total grant distribution). Maybe a 100% gas fee refund is not optimal and someone will deplete the funds. Hence, it could be better to refund “only” 90%.   The reduced amount (15%) for marketing in combination with a clear focus on qualitative onboarding funnels & educating new users is a good use of Op grant funding.   The adjusted distribution reflects your goals of user onboarding very well and we are impressed by the level of detail that you put into this. As Optimism grants hasn’t funded many young, innovative projects with a focus on user onboarding yet, but rather larger projects which might add TVL, we see a good value-add and support this adjusted proposal as it is. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.900309917355372
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPGovWatch",
                    "index": "11",
                    "likes": "0",
                    "time": "19/10/2022-01:14:22",
                    "content": "Hello! DEX aggregation is a crowded space and Optimism already has a number of solutions. Can you provide any comparative statistics from Polygon that can help us put your stats there in context against other aggregators? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.375
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "12",
                    "likes": "0",
                    "time": "19/10/2022-03:21:36",
                    "content": "Features, Users, and Usage  How do orders currently gain yield on OP and Polygon (I saw yearn on your website), and what are likely next steps in yield sources? (Apologies for the questions below if you have a subgraph – please lmk if you’ve got one) Looks like roughly 2-2.5 limit orders per wallet. Do you have more detailed data on use likelihood? Specifically, the distribution of orders per wallet by size or frequency (which would help to identify churn and power users)? To be clear, what I’m asking for is different than the graphs on your provided dashboard, which look only at aggregate counts. Do you have data on the distribution of length of time limit orders have historically been held for? Any data on usage of stop-losses? Is there a risk of bad slippage or failed execution during large market swings? I’m guessing the risk would be dependent on liquidity so might be an involved answer. Is the below image the most accurate volume chart in Symphony’s history, or is there something more comprehensive (ie is this missing Yolo?)?  image2804×600 43.7 KB   Similarly, is this an accurate graph of DAUs?  image2808×598 51 KB    Asks Token airdrops:  For the most active traders and users on Symphony, we will distribute the OP token airdrops retrospectively after we analyze the data. We specifically chose this method to prevent boting / airdrop hunting.   This means that the team would have absolute discretion over how to mete out a third of all rewards. How exactly would you conduct this analysis and make decisions?  Gas swaps:  Given the rate of roughly 2-3 limit orders done by user to date (again, would like to see a distribution), how much in rebates do you project individual users seeing?  Marketing  How do bug bounties fit in with marketing? When you say “incentivize members,” who would you be hiring? Existing community members? I do respect the desire not to work with influencers. That said, if you don’t believe in working with KOLs, how do you intend to get eyeballs on the materials you are paying community members to create?  Maintenance and dev  Given the roadmap you’ve offered in response to @ScaleWeb3, can you work out which specific features you’d be building with the grant, and over what amount of time? What are the anticipated product and adoption effects of these features? What sorts of costs do partners incur to integrate your product? How has your development to date been funded?  KPIs My suggestion here is to specify the nature of the wallets and trading volume. I think KPIs here ought to match the kind of growth we’d want to see, so instead of unique wallets:  unique existing wallets onboarded onto Optimism (i.e., not new wallets), perhaps even existing wallets that hadn’t yet interacted with Symphony perhaps even specifically volume two tx’s after bridging some # of limit orders per unique existing wallet bridged there should also be some intermediate KPIs based on marketing, such as engagements or inbound interest  ",
                    "links": [
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/f/f83983109f255b8feb61d79375e391e7ed176dbd.png",
                        "https://dune.com/queries/574312",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/6/641541aa5a7810cb2b8e8482fc6334b025284ac7.png"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.641110080395794
                },
                {
                    "author_link": "https://gov.optimism.io/u/kakashi",
                    "index": "13",
                    "likes": "0",
                    "time": "19/10/2022-17:19:44",
                    "content": "Hey @OPGovWatch, Thanks for taking the time to read the proposal. Symphony is not a DEX aggregator but a novel DEX trading platform with yield-generating and limit/stop-loss features. We do have an additional feature of liquidity aggregation to ensure timely trade execution for our users. On that basis, currently, there is no other platform with these similar features on Polygon to provide comparative statistics. Please let us know if you have any additional questions, we would love to answer them. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.7625
                },
                {
                    "author_link": "https://gov.optimism.io/u/kakashi",
                    "index": "14",
                    "likes": "0",
                    "time": "19/10/2022-17:32:20",
                    "content": "We appreciate the time and effort you’ve put into reviewing the proposal. Your thoughtful feedback has been very helpful. We are delighted to see support from you. We also agree with your point about the gas fee refund. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.166666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPGovWatch",
                    "index": "15",
                    "likes": "1",
                    "time": "19/10/2022-19:03:47",
                    "content": "I am slightly confused by your answer as this is how you describe yourself in your proposal:     kakashi:  Symphony is a Meta DEX aggregator   My impression is you have a novel feature in the ability to earn yield while waiting for an order to fill, but otherwise it would be fair to say you fit in the same category as other DEX aggregators and meta aggregators. Do you agree? This is why it would be good to understand what kind of adoption you have been able to create on Polygon relative to other products your category. Some comparative statistics around volume, transactions, and wallets would be helpful. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.125
                },
                {
                    "author_link": "https://gov.optimism.io/u/Mark",
                    "index": "16",
                    "likes": "0",
                    "time": "19/10/2022-19:22:05",
                    "content": "Looking forward to trying it out, so spread out testing new protocols. Some dapps are incredible, without L2 OP it would be way too costly, high gas is against my principals  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.993939393939393
                },
                {
                    "author_link": "https://gov.optimism.io/u/mannersinvest",
                    "index": "17",
                    "likes": "0",
                    "time": "19/10/2022-20:41:26",
                    "content": "Looking forward to trying it out, so spread out testing new protocols. I have used symphony on polygon, a good experience+yield…keep up guys ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.090909090909091
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPGovWatch",
                    "index": "18",
                    "likes": "2",
                    "time": "19/10/2022-21:01:13",
                    "content": "These copy paste commenters are a bit of a red flag. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/kakashi",
                    "index": "19",
                    "likes": "0",
                    "time": "20/10/2022-05:15:53",
                    "content": "Yes, the feature of liquidity aggregation is common but we don’t allow market orders rn. We do liquidity aggregation to provide the best rates for limit/stop-loss orders. So, it’s unfair to compare Symphony with other DEX aggregators who provide swapping at market rates only. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.074999999999999
                },
                {
                    "author_link": "https://gov.optimism.io/u/kakashi",
                    "index": "20",
                    "likes": "0",
                    "time": "20/10/2022-05:34:23",
                    "content": "We asked our community to show their love, but we can not guarantee the quality of our community members’ comments.  SCR-20221020-agk1734×164 24.1 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/kakashi",
                    "index": "21",
                    "likes": "0",
                    "time": "20/10/2022-10:54:35",
                    "content": "Thanks for taking the time to read the proposal and providing feedback @jackanorak.  How do orders currently gain yield on OP and Polygon (I saw yearn on your website), and what are likely next steps in yield sources?  On Optimism, we use Aave v3 for the Yield source. On Polygon, we use Aave v2 and Aave v3 rn. We were planning to integrate more protocols such as a yield aggregator. In the initial days, we just want to integrate Safe Protocols but In the future, we plan to integrate a more complex yield strategy keeping in mind the risks attached to it.  (Apologies for the questions below if you have a subgraph – please lmk if you’ve got one)  Yes, we do have a subgraph. You can access it here:   Yolo Optimism Subgraph    Yolo Optimism Subgraph Symphony Finance's Yolo Subgraph         Yolo Polygon Subgraph    Yolo Polygon Subgraph Symphony Finance's Yolo Subgraph       Looks like roughly 2-2.5 limit orders per wallet. Do you have more detailed data on use likelihood? Specifically, the distribution of orders per wallet by size or frequency (which would help to identify churn and power users)? To be clear, what I’m asking for is different than the graphs on your provided dashboard, which look only at aggregate counts.  Yes. We have added a query on the dashboard. Now, you can see the orders per wallet for both Optimism and Polygon. Link to the query: Yolo top wallets (Optimism)  Do you have data on the distribution of length of time limit orders have historically been held for?  Yes, Please check this query: yolo order duration (Optimism)  747×274 9.61 KB   Any data on usage of stop-losses? Is there a risk of bad slippage or failed execution during large market swings? I’m guessing the risk would be dependent on liquidity so might be an involved answer.  The execution depends entirely on the liquidity of DEXes. So by nature, yes there is a risk of failed execution if prices are moving too frequently. But because of our price & liquidity aggregation feature, we have better chances of matching the best price & liquidity for trades.  Is the below image the most accurate volume chart in Symphony’s history, or is there something more comprehensive (ie is this missing Yolo?)?  This query has not been created by us but the contents seem true with respect to our deployment on Polygon. We have now added the cumulative volume area chart on the dashboard for both Polygon and Optimism. Here is the link to the optimism query: yolo cumulative volume (optimism)  Similarly, is this an accurate graph of DAUs?  Yes. It’s accurate with respect to our deployment on Polygon.  This means that the team would have absolute discretion over how to mete out a third of all rewards. How exactly would you conduct this analysis and make decisions?  We operate on the principles of fairness and integrity, so decisions on token airdrops will be taken on that basis. Through token airdrops, we want to boost sustainable growth and minimize airdrop hunting. We will use the following metrics to analyze and disburse token airdrops -  Unique wallets interacted with the protocol (OP side) for the most number of days. (Minimum 14 days) Has used (for example: Swapped at least $100 worth of crypto) in Symphony AND on another OP native project in the last X days.  As we keep getting more data, we’ll be in a better position to take decisions that would be in the long-term interest of the OP ecosystem and symphony DEX.  Given the rate of roughly 2-3 limit orders done by user to date (again, would like to see a distribution), how much in rebates do you project individual users seeing?  Apart from past usage, we’ll also consider future usage. Each user can possibly get a maximum of 90% gas rebate. There can be a possibility that the gas fee refund allocation is more than the actual gas refunds. In that case, the remaining tokens will be allocated to the user incentives.  How do bug bounties fit in with marketing?  That was an oversight, we intended to put it in the Development & Maintenance category. Thanks for the correction, we’ve edited our answer accordingly.  When you say “incentivize members,” who would you be hiring? Existing community members?  Yes. We’ll provide detailed guidelines for them (How to write an article, what bullet points need to be included). We have a strong community across socials, especially discord. This way we’ll be able to leverage our existing members and new users and allow them to participate and have a chance to contribute on the side. We’ll be able to leverage the economics of a capitalist market and be able to choose the best materials from users’ submissions. And, as a bonus we’ll be left with a lot of valuable article/research resources, since there will be only one winner for an RFI, we can always repurpose the rest.  I do respect the desire not to work with influencers. That said, if you don’t believe in working with KOLs, how do you intend to get eyeballs on the materials you are paying community members to create?  Community-made contents have to support bigger marketing goals. We truly believe that with the right form of content and the right purpose, we can achieve remarkable organic growth. Incentives to create community-made TikTok videos TikTok is an undervalued platform to get organic views. As mentioned previously, we can create RFIs like: Create a max. 30 sec TikTok video, explaining why Symphony is a better alternative to 1inch. Rewards could be distributed based on performance:  Views Unique Discord invitation link, so we can measure how a video performs.  Our team has a TikTok crypto influencer from Hungary with 140k followers, who can educate community members on how to make engaging videos and provide them with best practices, host AMAs, etc. Here’s a bit of an insight into how we plan to do that: Notion – The all-in-one workspace for your notes, tasks, wikis, and databases. Since we don’t believe in the shilling, what’s the best way to get your content seen by others with $0 on ads? Collaborations  Reach out to other OP projects in DeFi, looking to receive grants from the OP board (just like us) and ask them to collaborate.  This way, we can share each other’s organic content (tweets, videos, and medium articles made by our community). This approach also favors the OP foundation, since as you mentioned, you prefer seeing OP projects supporting each other. Plus, this way we reduce our chances of failure. It’s less likely for 2 projects to fail than 1.  Reach our target audience  The worst part of working with crypto influencers is that you can not be sure that your target group will see your message. So why not create an incentive campaign for those users, who are most likely to use our product? Let’s say our competitors are 1inch and 0x. A Twitter organic marketing campaign could look like this: Get rewarded in OP, if you traded at least $X amount in 0x token in the past 30 days AND / OR hold X amount of the (competitor’s token). Come and create a limit order inside Symphony, and get your OP airdrop now.” Why do we believe it’s a great marketing strategy? For users: it’s free money, and rewards can be received in 5 mins. For Symphony: a chance to present our product to users who actually use services like ours. Of course, there will be a retention rate, but our chances of increasing our DAUs are much higher this way than paying an influencer to share our Twitter post. That’s because the target group in this case (niche audience) is 100% correct. And if our UX is as good as we stated previously then we’ll have a bunch of new active users. For OP foundation: More activity on their chain, more adaption. Since it’s a bear market, for now, we don’t see new users’ joining the crypto world, meaning we are stuck with what we already have: DeFi users inside the Web3 ecosystem. The only logical solution is to onboard users from other chains. The previously mentioned use of funds is a perfect way to do that.  Given the roadmap you’ve offered in response to @ScaleWeb3, can you work out which specific features you’d be building with the grant, and over what amount of time?  Here are the features which we are looking to cover under the grant scope.  Integration of more protocols such as Velodrome, Paraswap on Optimism. Order Book UI: Allow takers to fill orders directly from the interface.  Apart from this, the development allocation also includes other costs such as auditing, bug-bounty, and maintenance of the relayer service (operational cost).  What are the anticipated product and adoption effects of these features?  We anticipate that these features will bring additional volume and revenue to Symphony. As we are working on integrating more protocols in Symphony, we will be able to provide the best price for trades. The APY could potentially increase the interest earned by users incentivizing them to use Symphony over other competitors. There is a demand for different types of orders such as iceberg orders. Once integrated, we can provide swap/iceberg orders which would be beneficial. The iceberg order will be beneficial for large-size orders. The order book UI will allow users to fill orders directly from the UI. The Coincidence of Wants can reduce the risk of MEV to some extent. So, it could be beneficial for the users and we have already seen that there is a demand for these features.  937×138 25.7 KB   What sorts of costs do partners incur to integrate your product?  There is no cost as such to integrate Symphony into any platform. If they want to execute transactions themselves then, they have to run a backend relayer service which is good for decentralization but will incur some additional operational costs (eg: AWS instance cost).  How has your development to date been funded?  Initially, it was self-funded and from grants that we received from Aave, Balancer, etc. Then, we raised a small round to fund the development.  My suggestion here is to specify the nature of the wallets and trading volume. I think KPIs here ought to match the kind of growth we’d want to see, so instead of unique wallets: unique existing wallets onboarded onto Optimism (i.e., not new wallets), perhaps even existing wallets that hadn’t yet interacted with Symphony  I totally agree with your point. We will include existing wallets in the KPI.  some # of limit orders per unique existing wallet bridged  Yes, we could keep 2-3 limit orders per wallet as KPI.  there should also be some intermediate KPIs based on marketing, such as engagements or inbound interest  Yes. We could keep these metrics in the marketing KPIs:  Double average Twitter engagements under tweets. Double weekly active communicators on Discord (notice: we didn’t say members since we believe in building a community based on active users and not engagement farming giveaways) Community knowledge base with at least 20 articles/guides, made by the community (RFIs). We will use them to gain more Medium followers. Plus, we will repurpose them into SEO-friendly articles, and make a blog section to increase our likelihood of getting seen on Google Search. 1,000 TikTok followers, with at least 200k views across all videos.  Please let me know if you have any additional questions, we would love to answer them. ",
                    "links": [
                        "https://thegraph.com/hosted-service/subgraph/symphony-finance/yolo-optimism",
                        "https://thegraph.com/hosted-service/subgraph/symphony-finance/yolo-polygon",
                        "https://thegraph.com/hosted-service/subgraph/symphony-finance/yolo-polygon",
                        "https://dune.com/queries/1291722/2213461",
                        "https://dune.com/queries/1425970",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/f/f71af3abfaf95f9efc77592ddaffb04bd922e225.png",
                        "https://dune.com/queries/203128",
                        "https://dune.com/queries/1428873",
                        "https://dune.com/queries/574312",
                        "https://bit.ly/SymphonyTikTokGuide",
                        "https://gov.optimism.io/u/scaleweb3",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/a/abbcde2d375f2954fcd4bf95b3db6aadc9ed78b9.png"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.775918047469773
                },
                {
                    "author_link": "https://gov.optimism.io/u/Jadmat.Eth-DefiLatam",
                    "index": "22",
                    "likes": "2",
                    "time": "20/10/2022-17:06:56",
                    "content": "Your proposal and quality of responses is impeccable; I support Symphony as a great little protocol with an interesting value proposition. I agree with the amount requested, but not with the distribution 1- I do not consider subsidizing the development and maintenance of the protocol 2- Subsidizing marketing strategies is not usually a coherent decision; but from the way you present it, from an educational point of view with participation of the community; designating about 6% of the distribution would seem correct to me, this represents half of the grant awarded to Bankless Academy 3- Regarding distribution to users: Good strategy to minimize airdrop hunting     kakashi:  Cada usuario posiblemente puede obtener un máximo de 90% de descuento en gas. Puede haber una posibilidad de que la asignación del reembolso de la tarifa de gas sea mayor que los reembolsos de gas reales. En ese caso, los tokens restantes se asignarán a los incentivos del usuario.   I am not very clear how they would allocate the gas reimbursement Would you agree to modify the distribution with my comments? Honest question, I’m not a communication expert, but do you think you have a potential audience looking for alpha on Tik-Tok? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.232238247863248
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "23",
                    "likes": "1",
                    "time": "21/10/2022-01:19:59",
                    "content": "Appreciate all the detail here, @kakashi – really unusual and welcome to see so much info back. Gonna dig through the data here and subgraph. Couple more background q’s if it’s all right.  Data     kakashi:  This query has not been created by us but the contents seem true with respect to our deployment on Polygon. We have now added the cumulative volume area chart on the dashboard for both Polygon and Optimism. Here is the link to the optimism query: Dune   I’m getting a 404 on this. Would it be possible to make this public?  Questions   You say you raised a small round and had grants previously. How much runway do you have on these funds?   Given the two statements below, if integrating these protocols is free, what exactly is the OP subsidizing?       kakashi:  Here are the features which we are looking to cover under the grant scope.  Integration of more protocols such as Velodrome, Paraswap on Optimism. Order Book UI: Allow takers to fill orders directly from the interface.        kakashi:  There is no cost as such to integrate Symphony into any platform. If they want to execute transactions themselves then, they have to run a backend relayer service which is good for decentralization but will incur some additional operational costs (eg: AWS instance cost).     Order Book UI: other than potentially preventing frontrunning, how is this different from simply placing an order on a standard dex aggregator? Is the point that the UI provides knowledge of extra liquidity where there are limit orders?   Can you provide a rough breakdown in development costs between these additional pieces (auditing, bug bounties, maintenance, etc)?   Finally, I couldn’t see in your docs how the protocol earns revenue. I see $0.50 in Order Time Calculator  – I assume that’s a $0.50 fee on every limit order placed or filled? Or is it $0.25 on placement and filling? And are there any other fees or sources of protocol revenue? Does the platform do its own trading?   KPIs look solid. In general I’ve got to think about bot resistance for marketing metrics. ",
                    "links": [
                        "https://docs.google.com/spreadsheets/d/1C7zVtGOxgzfUpN7m4jLtsCaeuGf71Ad9wEH9WbtToYI/edit"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.692279942279942
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "24",
                    "likes": "1",
                    "time": "21/10/2022-07:05:38",
                    "content": "Hi @kakashi  love the engagement here from your side. Still need to go though couple of links you have provided but overall I am in favor of this proposal. We need innovative new approach from Dexs on OPtimism. I am usually supportive of marketing allocation as i believe there are scope of improvement and i see knowledge gap in community. But, I would like to see more about Optimims and not just about specific protocol.  We will also highlight at the end of every article that it was made possible by OP funds.  Foundation is already doing this at different community event and majority of web3 space knows that Optimism is giving grant to on-board user and new platform. We need to work on future roadmap of Optimism, Bedrock, possible path towards zk-rollup and Citizen house. How are you planning to show accountability for dev fund use? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.946969696969697
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPGovWatch",
                    "index": "25",
                    "likes": "0",
                    "time": "21/10/2022-12:57:48",
                    "content": "Okay, in that case can you please provide comparative stats for any products on Polygon that provide limit/stop-loss orders? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPGovWatch",
                    "index": "26",
                    "likes": "0",
                    "time": "21/10/2022-13:03:55",
                    "content": "    OPUser:  We need innovative new approach from Dexs on OPtimism.   They are not a DEX. They are a “Meta DEX aggregator” that only allow limit/stop-loss orders. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0606060606060606
                },
                {
                    "author_link": "https://gov.optimism.io/u/kakashi",
                    "index": "27",
                    "likes": "0",
                    "time": "21/10/2022-14:11:44",
                    "content": " I’m getting a 404 on this. Would it be possible to make this public?  sorry. this is the correct link: yolo cumulative volume (optimism)  You say you raised a small round and had grants previously. How much runway do you have on these funds?  Approx 4-5 months.  Given the two statements below, if integrating these protocols is free, what exactly is the OP subsidizing?  This is the case if some other protocol (eg: Uniswap) wants to integrate Symphony limit order on their interface. But, if we add support of any protocol (eg. Uniswap, Aave, etc) in Symphony to provide better prices then, we have to write a handler contract and additional relayer code. Similarly, if we want to add support for any protocol to provide better yield, we need to write a yield adapter contract. These also need auditing & testing which require resources.  Order Book UI: other than potentially preventing frontrunning, how is this different from simply placing an order on a standard dex aggregator? Is the point that the UI provides knowledge of extra liquidity where there are limit orders? If so, what’s preventing toxic order flow using information provided by the UI?  The order book UI would display all the open limit orders. So anyone with sufficient liquidity would be able to fill these orders directly from the interface. There won’t be a need to run a backend service for this. This would result in better price discovery. As of now if someone wants to fill any trades with owned liquidity then they need to run a backend service which is not very convenient, the order book interface would change that.  Can you provide a rough breakdown in development costs between these additional pieces (auditing, bug bounties, maintenance, etc)?  The cost of auditing depends on the size of the contract and the auditor. Apart from that, every month we need to spend at least $200 on operations.  Finally, I couldn’t see in your docs how the protocol earns revenue. I see $0.50 in Order Time Calculator – I assume that’s a $0.50 fee on every limit order placed or filled? Or is it $0.25 on placement and filling? And are there any other fees or sources of protocol revenue? Does the platform do its own trading?  There is a platform fee on every order, which is currently 5bps. We may change that eventually depending on our strategy. The platform doesn’t do its own trading. Thanks again for taking the time to read the answers. And, let us know if you have any additional questions. ",
                    "links": [
                        "https://docs.google.com/spreadsheets/d/1C7zVtGOxgzfUpN7m4jLtsCaeuGf71Ad9wEH9WbtToYI/edit"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.451190476190476
                },
                {
                    "author_link": "https://gov.optimism.io/u/kakashi",
                    "index": "28",
                    "likes": "0",
                    "time": "21/10/2022-16:02:46",
                    "content": "We really appreciate you taking the time to read the proposal and the relevant answers. Your feedback will really help us.  I do not consider subsidizing the development and maintenance of the protocol  We believe that the development of additional features will help us attract more users to Symphony and Optimism. To ship new features we would need to compensate devs. The genesis of Symphony’s yield-generating feature came out of innovation and this innovation is helping a lot of users earn yield in an easy manner creating a great value add-on. By subsidizing development, we wish to keep improving our features and find ways to simplify DEX trading with new features that can serve as a catalyst for growth on Optimism.  Subsidizing marketing strategies is not usually a coherent decision; but from the way you present it, from an educational point of view with the participation of the community; designating about 6% of the distribution would seem correct to me, this represents half of the grant awarded to Bankless Academy  I agree with your point but our marketing strategy not only includes incentivizing education among our community members but also social media marketing where there is a potential to attract new users to Crypto & DeFi by creating an aggressive marketing campaign in order to convert leads given the number of people that consume content in the form of short-form reels on platforms like Youtube, Instagram, Facebook and TikTok for which paid campaigns will be utilized. Onboarding and educating users who are used to Web 2 services to Web 3 takes some investments but it can help convert a huge number of leads. We’ll also be targeting Twitter as it’s the most used platform by crypto users. Our plan also includes collaborations & partnerships with other projects and given the current market sentiment in the medium term, we will need to incentivize participation in order to attract exposure and wide involvement of potential leads. So keeping in mind these varied resource requirements, We believe 15% of funds are adequately allocated in order to ensure that we reach out to more users and to educate them about both Optimism and Symphony.  I am not very clear how they would allocate the gas reimbursement.  Currently, we have planned to reimburse users a maximum of 90% of gas cost. We would do it retrospectively in fixed intervals through airdrops.  Honest question, I’m not a communication expert, but do you think you have a potential audience looking for alpha on TikTok?  With the rise of short video content consumption, many big social media players are trying to keep up with TikTok. Youtube Shorts, Instagram Reels, and Facebook Reels are all similar content streams. We honestly believe that people’s attention lifespan is getting smaller and smaller, meaning that content providers/brands need to adjust to that. Meaning: provide as much value as you can in the smallest time possible. These short reels have the potential to show your content to millions of people, with $0 on ads. You can do thousands of videos and get average views close to 1,000, but you need 1 video to put your brand out there. By doing this, we won’t have to spend $3-4 on user acquisition. Another selling point on why we think it’s one of the best ways of marketing Symphony is the For You section on an average user’s feed. The algorithm shows content based on what content a user likes. There is no “THE VIDEO” everyone sees - like the news - because each social media user has a different taste, since different for you pages. This gives us the ability to niche down our videos (use captions, descriptions, and hashtags which are crypto-related, to put us in the Web3/Crypto on a user’s feed) We already have a precedent in one of our team members, who reached 140k followers on TikTok around his personal brand(Crypto) even in a country with a 9M population with record low crypto-adoption. We’ve accordingly set our KPI and given the nature of this grant, We shall be utilizing not only Tiktok but also other platforms like Instagram, Facebook, and twitter and by heavily investing in content production for whole Optimism ecosystem and Symphony, we are confident to meet those metrics. Please let me know if you have any further questions, we would love to answer them. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.681146825883667
                },
                {
                    "author_link": "https://gov.optimism.io/u/kakashi",
                    "index": "29",
                    "likes": "0",
                    "time": "21/10/2022-16:23:57",
                    "content": "Thank you for taking the time & effort to review our proposal. Your feedback & support is valuable for Symphony.  I am usually supportive of marketing allocation as i believe there are scope of improvement and i see knowledge gap in community. But, I would like to see more about Optimims and not just about specific protocol.  Yes, content related to Optimism & ecosystem will be a high priority.  How are you planning to show accountability for dev fund use?  We’ll publish updates about new features regularly in our community. This would give transparency to our community & also hold our team accountable. We’d publish an expense sheet at the end of finishing all the milestones. The expense sheet would highlight the usage of all the allocated OP tokens for development. Thanks again and please let us know if you have any additional questions, we would love to answer. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.1090909090909085
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "30",
                    "likes": "3",
                    "time": "21/10/2022-16:30:43",
                    "content": "Thank you. Appreciate your engagement answering all our queries. I dont have any other question but remember to get two delegate approval before second week and once you have the approval, include your proposal in round up thread. Also, remember to summarize all the feedback your proposal has got before moving to second week of current cycle. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.675000000000001
                },
                {
                    "author_link": "https://gov.optimism.io/u/kakashi",
                    "index": "31",
                    "likes": "1",
                    "time": "21/10/2022-16:42:24",
                    "content": "Thanks for providing the details. Your comments were really helpful and we will keep note of the same. If you are in favor of our proposal, It would be a great help if you can give your approval. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/kakashi",
                    "index": "32",
                    "likes": "0",
                    "time": "21/10/2022-18:35:44",
                    "content": "@OPGovWatch Thanks for taking the time to read the proposal & answers.  Okay, in that case, can you please provide comparative stats for any products on Polygon that provide limit/stop-loss orders?  These metrics are of Quickswap limit orders which use Gelato on Polygon.  Sources: Gelato Limit Order Transaction Vol Quickswap, gelato (quickswap limit order) volume and count The transaction cost of Gelato is 0.1% whereas on Symphony it’s 0.05%.  Please let us know if you have any further questions, we would love to answer them. ",
                    "links": [
                        "https://dune.com/queries/1438781"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/kakashi",
                    "index": "33",
                    "likes": "1",
                    "time": "22/10/2022-06:29:39",
                    "content": "Dear delegates, It was nice to get some of your feedback, we have updated our proposal accordingly. If you like to see this proposal moving forward, please state your approval. Tagging a few delegates here: @jackanorak @SEED_LATAM_Joxes @solarcurve @MoneyManDoug @fig @tongnk @mastermojo @quix @katie @ScaleWeb3 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Defi_LATAM_axlvaz",
                    "index": "34",
                    "likes": "1",
                    "time": "22/10/2022-08:34:25",
                    "content": "Hey @kakashi  thanks for all the details provided and the answers to all the questions with a very high level of detail. Good to see the commitment of the applicants in clarifying all the doubts. No doubt Symphony Finance is a protocol with a unique value proposition. I only have one comment, allocating 15% to marketing when they could use those funds to incentivize users more. In these last cycles some projects have applied that will do the job of spreading the Optimism ecosystem, so I don’t see the need to use the funds for marketing.     kakashi:  Marketing: Ecosystem & Community - Optimism (15%) $OP will be used for marketing, ecosystem & community initiatives to foster user outreach and amplify our marketing efforts across various channels, through strategic partnerships and collaborations. We are growing rapidly and through this distribution, we want to boost our efforts to onboard as many new users as we can. We are also planning some creative ways to give back to the community, similar to what Aave did for lending which rewarded the user with $OP tokens. Hence, Symphony will reward the grants for content creation, and cross-promotion / collaboration with other OP projects. For example:  Host AMAs with OP industry-leading projects, make Q&As, and those who participate OR answer a 5 to 10 questionnaire, can win prizes. Create a Request For Innovation campaign. Take a look at this (Notion – The all-in-one workspace for your notes, tasks, wikis, and databases. ) We will choose topics related to DeFi, DEX & OP ecosystem and incentivize members to make content on the same. for eg. Make a 500-600 words article on why DEXs are essential in the global economy. People write these articles, submit them to us, and we choose the best one. After that, we publish it on our Medium and the writer gets its reward in OP tokens. We don’t believe in influencer shilling so we can incentivize the community with written articles/tweets/videos and distribute the funds to those who genuinely deserve it on merit. We will also highlight at the end of every article that it was made possible by OP funds.  Social media marketing has the potential to attract new users to Crypto & DeFi by creating an aggressive marketing campaign in order to convert leads given the number of people that consume content in the form of short-form reels on platforms like Youtube, Instagram, Facebook, and TikTok for which paid campaigns will be utilized. Onboarding and educating users who are used to Web2 services to Web3 takes some investments but it can help convert a huge number of leads. We’ll also be targeting Twitter as it’s the most used platform by crypto users.   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.160011223344557
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "35",
                    "likes": "1",
                    "time": "22/10/2022-12:39:55",
                    "content": "I’m sorry to keep bothering you about this; it’s just that I can’t find alternative sources of info on this point. I see that you charge 5bps on the trades. This might’ve gotten lost in the mix last time, but in what circumstances is the fee charged? Is it when the order is just placed, or when it’s filled? Or half on each event? Second (and I think last) q again concerns the dev incentives You’re asking for roughly 80k OP in dev incentives. You say you spend $200/mo on operations and have 4-5 months of runway.  Does this mean that you have $1k left in your treasury? If not, please clarify. Of this 80k OP, now much are you budgeting on the order book UI, integrations, audit(s), etc? Line items would be helpful here because I’m having trouble making a mental budget based on what you’ve proposed. can you confirm that no integration is free, then, that it’s just a matter of who’s paying for dev costs? (Eg Uniswap integrating symphony into its UI would require dev work)  And if so, which dev costs are being subsidized?  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.854166666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/kakashi",
                    "index": "36",
                    "likes": "2",
                    "time": "22/10/2022-14:10:07",
                    "content": " but in what circumstances is the fee charged? Is it when the order is just placed, or when it’s filled? Or half on each event?  It gets charged when the order is filled.  Does this mean that you have $1k left in your treasury? If not, please clarify.  Yes, we have more than $1k left.  Of this 80k OP, now much are you budgeting on the order book UI, integrations, audit(s), etc? Line items would be helpful here because I’m having trouble making a mental budget based on what you’ve proposed.  Integration:  New Contracts Development: 20k OP Make changes in the backend Relayer: 10k OP Auditing: 25k OP  Order Book UI:  UI development: $15k UI Designing: 10k OP  Please note all these costs are rough approximations.  can you confirm that no integration is free, then, that it’s just a matter of who’s paying for dev costs? (Eg Uniswap integrating symphony into its UI would require dev work) And if so, which dev costs are being subsidized?  If Uniswap makes changes to integrate Symphony limit order on their interface then, they need to bear the development cost. But In case, if we create any pull request we will use OP to subsidize the dev work. On the other hand, if we integrate Uniswap to provide better prices then, we have to create a handler contract and make changes in the relayer to execute the orders. Feel free to let us know if you have any further questions, we would love to answer that too. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.67561026936027
                },
                {
                    "author_link": "https://gov.optimism.io/u/kakashi",
                    "index": "37",
                    "likes": "1",
                    "time": "22/10/2022-15:17:28",
                    "content": "Thanks for taking the time & effort to read the proposal. Really appreciate your kind words. We agree that the project funded earlier has done a great job of spreading knowledge about the Optimism ecosystem. But our process targets new users with a different form of marketing. We are also targeting unpenetrated platforms such as short-time video platforms, which have many potential Web3 users. Optimism ecosystem can be the first one to target these users hence, we need the marketing budget. Please let us know if you have any additional questions, would be happy to answer them. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.452651515151516
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "38",
                    "likes": "1",
                    "time": "22/10/2022-16:04:32",
                    "content": "Okay actual last question: without a grant, how much of your roadmap could be completed with your current runway assuming little user growth from here ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.427083333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/kakashi",
                    "index": "39",
                    "likes": "2",
                    "time": "22/10/2022-16:31:41",
                    "content": "It would be a bit difficult to add new features without any additional funds. So, a grant will help us to achieve that. As we believe in regular innovation & improvement so, we think community-requested features should be taken on priority. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.393939393939394
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPGovWatch",
                    "index": "40",
                    "likes": "0",
                    "time": "23/10/2022-13:59:48",
                    "content": "My impression is that your product has yet to meaningful adoption even on busier chain. I have trouble understanding how it will support meaningful growth on Optimism. Why should Governance to fund yet another product that combines some combination of DEX aggergation with stop/limit orders? How many of these products do we need to subsidize or have a successful ecosystem? I was also confused why governance approved a similar proposal from Kromaika before they had demonstrated that there was actually some demand for their product. We need to be much more discerning for grants. My suggestion would be that the team takes time to fully integrate into the ecosystem and demonstrate a ability to attract meaningful users and volume. Then come back to governance with a request that shows us how we can accelerate your growth for a big return on investment, not subsidize it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.104166666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/Jadmat.Eth-DefiLatam",
                    "index": "41",
                    "likes": "1",
                    "time": "24/10/2022-01:26:56",
                    "content": "I find myself in agreement with some of @OPGovWatch conclusions. Although I believe in the potential of this project, but the Optimism grant seek the growth of the ecosystem, and not what seems like a seed round, I will go by points:   Development: 0% I agree with your comments that development should happen, but not with Optimism funding; Symphony was released a little over a year ago (September 2021), being able to have your own development is key to demonstrating a healthy roadmap; I do not agree that Optimism subsidizes these types of initiatives, their funds should go where they have the highest risk/reward, the seed investment is a risk factor, and the development of a protocol does not directly impact Optimism.   Market: 6% It seems that you come from the field of communication, you are very good in your answers and you have also brought us innovation in terms of where to communicate; I don’t know if it can be a success but I support innovation; although this does not change my earlier comment about not allocating more than $15k OP to this initiative, and this is based on what is supported within these initiatives   Users: 94% I consider the objective of the funds and the distribution to be correct: gas subsidy - airdrop to order limit users   This distribution would bring 70% more $OP, available to users; which can bring flow of operations encouraged for much longer than projected, relying on this to enhance its development projection can be organic and sustainable. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.24140625
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "42",
                    "likes": "2",
                    "time": "24/10/2022-02:53:14",
                    "content": "I can’t support this proposal as it stands because I don’t believe Symphony Finance has an abundant user constituency, nor do I think any of the grant proposals have a real shot at increasing the economic sustainability of the protocol or of growth layerwide. I’m saying this early in this cycle and laying things out without too much structure because the Symphony team have been unbelievably accommodating in answering my many questions, and I want them to be able to respond to this and prove me wrong before I present my thoughts to the Shadow Committee.  The fundamental economic model doesn’t work for how the product is most often used. The claim here is that setting a limit order earns users yield and thus presents an advantageous value proposition to users relative to competing products like 1inch. The problem, though, is that the vast majority of limit orders aren’t held for long enough for users to even break even on the limit order fees, much less earn enough yield for it to be worth their while. The protocol earns money on these unit economics, but because users evidently haven’t seen a lot of value, there also aren’t enough users to lift Symphony out of cash-burning mode. The vast majority of limit orders are placed for under 12 hours.  image2752×564 36.3 KB  There is negligible yield earned on these orders in that amount of time, and it’s uneconomic for Symphony users relative to 1inch limit orders on Optimism. Assuming a 5k order at 5% APY, users need to leave their orders up for over a day – over 2x the modal amount of time – to break even with 1inch. So something like 80% of people who’d placed orders with Symphony were worse off than had they placed with 1inch.  image1866×322 56.7 KB  You would need to place a 10k limit order at a bull-market stables rate of 14% APY for Symphony to be worth the while of people in the middle of that under 12 hour bracket.  image1872×354 57.3 KB  Both of these conditions seem unlikely for the vast majority of cases today. Setting aside a comparison with 1inch, it takes almost 4 days to break even on a 5k limit order charge at 5% APY:  image1868×354 62.4 KB  And how much would they make from yield on that 10k order? $1.30. A rounding error for somebody trying to make money on, say, a directional ETH bet. Bottom line, for their yield-bearing limit model to beat 1inch’s or other examples on the market since at least early 2021, Symphony must either 1) dramatically increase yields, which seems like a nonstarter as a low-risk yield instrument in today’s market, or 2) court longer-term limit orders, which appear in short supply/interest. Otherwise, as a user I care much more about placing the order and making money on whatever the order is intended for do than earning yield while the order’s waiting to fill. And it’s not obvious to me that there’s a real constituency of people who need to have some amount of money up for long amounts of time. My thinking is that in most cases of long-term limit buys, people are more likely to farm how they want to and follow the desired asset in question, buying when the time comes – unless we’re talking about setting stink bids, which seem more of a phenomenon with CLOBs, where the amount of liquidity provided by market making is more variable and fat fingers more common than what you see in AMMs. Happy to be wrong here – maybe MEV/frontrunning leaves open some opportunities. One note, though: I think stop loss orders do make sense, and perhaps there’s something there (could imagine people leaving orders up on their USDT sells for months, for which there could actually be a pretty cool integration with other protocols), but there’s not much evidence of uptake to date. Would love to see some data from Symphony suggesting otherwise. It’s late and I’m tired, so maybe my math here is wrong. I kind of hope it is.  There hasn’t been real evidence of PMF Here’s their daily volume on Optimism Yolo since launch:  image1914×366 41.2 KB  and daily amount of limit orders placed  image1916×352 35.4 KB  Entire days have gone by with no orders placed. Even on Polygon, Symphony’s home eco, there were few days above 30 DAUs on Yolo v2 one year after the protocol’s launch.  image2808×598 51 KB  I haven’t done a ton of research into 1inch limit orders, i.e., whether they enjoy a ton of use, but anecdotally I haven’t seen much use, and I don’t anticipate much relative to, say, order book dApps like dxdy. But fundamentally, it’s not like these limit orders are expensive in low-gas ecos. This tells me that fees aren’t really a bottleneck; I just see a general lack of interest in this niche instrument. The concept is cool, but does the market care? I’m not sure it has.  The user grants as structured aren’t going to drive growth. The grant currently offers users rebates on their gas/limit order fees. That’s 0.05% money back on a limit order that’s been placed. Assuming an average limit order of $100 (consistent with the graph below), that’s 5c per order. And assuming 2-3 trades per person, that’s still not very much.  image2746×710 51.6 KB  It’s not clear to me where the gas rebates really come in for users unless they’re looking to court programmatic traders, in which case there should be some discussion of that route. I’m trying to game out how much of an incentive really would get people to place limit orders on their profile on a continuous basis after the fact, and even then I look to the example of Polygon incentives and see a large dropoff in use – which makes me wonder how providing incentives in this way on Optimism would lead to any different of an outcome. Regarding marketing distribution, I’ll just put it quickly. The high-LTV users are likely to be the long-term limit order players, programmatic traders, ponzistable hedgers, niche players interested in a niche instrument. I’m pretty bullish on TikTok as a marketing channel, but I’m not sure this product is the kind of thing that resonates with the kind of audience I imagine coming in high volumes from TikTok. I’m actually sympathetic in principle to the idea that subsidizing integrations of high-potential products are the right kind of investment in that they catalyze broader growth: but to my view, the potential for PMF has to come first, and there’s still not evidence of this.  Overall I’m going to stop short of suggesting outright that Symphony Finance consider pivoting their model given their hitting something of a wall in runway, as the team seem highly skilled, and their UI really stands out in defi, but there’s a user gap here that I’m not sure is obviously overcome by a governance grant or bootstrapped by artificial activity. There are some potentially interesting avenues that take real advantage of defi composability (e.g., i could imagine an end ‘trader’ being not an individual but an org using this for one side of a broader strategy), but if they’re working those leads or use cases, this information needs to be highlighted more clearly so people like me can pick up on it. It’s tough for me to have to say this, as it’s been a pleasure speaking with @kakashi and seeing the great care with which the information’s been provided, but I think there just needs to be a clear path I’m not seeing. ",
                    "links": [
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/0/0b7e1dd640e96a16ff456dd5eb8edfad9954eafa.png",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/1/18ec564c048b2694667216ce43073d0719c8e882.png",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/6/63daba4bb0ec577028398b9f0d25169b34209c74.png",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/7/7c746b841fba9936d8034058882b8250622a4005.png",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/a/a725abde95d2da99feb8c9841b8d7392947fabf9.png",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/6/641541aa5a7810cb2b8e8482fc6334b025284ac7.png",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/c/ca8ee80e0fbbded5de33c2a3072a85a2515eb941.png",
                        "https://gov.optimism.io/t/goverance-fund-accountability-an-overview/3591/6"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.520947940947941
                },
                {
                    "author_link": "https://gov.optimism.io/u/ScaleWeb3",
                    "index": "43",
                    "likes": "2",
                    "time": "24/10/2022-09:15:05",
                    "content": "Agree with the general sentiment stated above that  the feature of yield-generation while waiting for limit orders to fill doesn’t have good unit economics; Symphony is still a small, innovative project searching for product market fit.  That said, we believe Symphony does fit into the second category and this proposal can help onboarding and educating new users to Optimism. @kakashi, a smaller Ask may help convince delegates as it would limit the risk to Op and give your team an opportunity to showcase what you can contribute to Optimism.    Committees: Next Steps for Season 2   Target L1 applications with PMF: To the extent that people use crypto applications, they should be using those apps on Optimism. The Governance Fund should support the migration of trusted, proven applications currently deployed on L1s. Grow population of values-aligned builders: To be the home for the next wave of novel applications, the Governance Fund should support developers launching novel applications that will draw new users to Optimism.   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.74025974025974
                },
                {
                    "author_link": "https://gov.optimism.io/u/xxzh",
                    "index": "44",
                    "likes": "1",
                    "time": "24/10/2022-13:36:37",
                    "content": "I like symphony because of its easy-to-use interface, low transaction fees, and most excitingly, the ability to make money while waiting for execution ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.333333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/ehsan19890",
                    "index": "45",
                    "likes": "1",
                    "time": "24/10/2022-13:41:40",
                    "content": "I think “Symphony Finance” will be more successful among decentralized exchanges. One of these reasons is the possibility of limited transactions. And another important point is that they give profit to the traders before the trade is opened. And this feature will make them unique. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.953571428571429
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "46",
                    "likes": "0",
                    "time": "24/10/2022-17:59:10",
                    "content": "See, I don’t think that this proposal merits any grant without a clearly presented path to growth. The application is no longer novel; it was tested and failed in two different ecosystems in two different broader market circumstances. I don’t see how the product with its current go-to-market strategy or development path attracts the kind of use that benefits Optimism (e.g., funding ecosystem integrations to what end?), and it’s not at all obvious to me that marketing on TikTok (rip) does much to help (the question at hand is not one of market exposure; it’s about market fit). At risk of sounding overly didactic, I think @ScaleWeb3 would do well to reconsider his inclination to “fund less and risk less” – that’s not the right way to think about things. You fund the right projects and initiatives for growth on Optimism and choose not to fund the projects that don’t present a likely path. Granting this group 100k, for example, doesn’t make them any more likely to succeed with this route – unless there’s some data we’ve missed or misinterpreted (e.g., more description of the profile of long-term limit order placers), what Symphony Finance needs to do is come up with a different product strategy or evidence-based path to growth and come back to Governance once they have. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.366213151927438
                },
                {
                    "author_link": "https://gov.optimism.io/u/kakashi",
                    "index": "47",
                    "likes": "0",
                    "time": "24/10/2022-18:39:34",
                    "content": "Thanks again Jack for going through our proposal and answers. Really appreciate your time, research, and effort.  The fundamental economic model doesn’t work for how the product is most often used.  The yield on trades might be not the biggest selling point of Symphony. Please compare the YOLO feature to competitors’ similar services and we can clearly see that we offer way better prices (because we aggregate liquidity across the chain) and execution. I myself have used 1inch and Matcha for limit orders, I have observed that the order was not executed even after the market price surpassed the limit price. This is one of the major issues in DeFi limit order platforms. This is because of the lack of incentives for “Trade Executors”, so the limit orders are not executed on time. Hence users prefer to use CEX Limit Orders over DeFi limit orders. We have designed our protocol in a way that allows Symphony to integrate any DEX & DEX aggregators to provide the best prices which result in the best execution time. We also have sufficient incentives for Trade Executors so that the trades are executed on time & users don’t lose money. We agree with you that the current limit order users don’t hold order too long and that result in paying more in fee than the competitive products. Hence, we are planning to get rid of the protocol fee for short-duration orders (eg: order duration less than 12 hours). That means, only for higher-duration orders, the protocol fee will be charged. So even for short-duration trades, the users won’t have to pay the fee. This makes sense because for trades that last less than 12 hours the yield won’t be significant. This way we can compete with competitors that charge less or no protocol fees without compromising our protocol’s economics.  I could imagine an end ‘trader’ being not an individual but an org using this for one side of a broader strategy  We are working on this too. Features like MEV protection would significantly help us compete as a treasury management tool. You can also see it on our website under the “Use-Cases” section. Symphony can be used as a treasury management tool but we need good BD to reach adoption from medium & large institutions, DAO & multi-sigs.  There hasn’t been real evidence of PMF  Many others have this concern so this answer will also apply there. I agree that there has been little adoption so far but is it due to the lack of value proposition for the users? I don’t think so (Why? I have highlighted above). Until now, we focused mostly on shipping useful features & smoothing out the UI. Although we launched the project on polygon more than a year ago our spending on marketing & educational initiatives has been negligible. DeFi has a lot of protocols & the noise-to-signal ratio is on the higher end so without marketing/educating/selling no product can achieve a PMF. I’m not saying that the product is not important. But without marketing, even the best products won’t reach PMF in the current competitive environment. Do you know why CEX companies spent billions of dollars on ads? Because once they acquired their customer and got them soaked into their ecosystem, they are less likely to use another CEX. So I think it would be a bit early to conclude that there can’t be a PMF.  The user grants as structured aren’t going to drive growth.  We never gave any gas rebates or incentives to the users on Polygon. The surge in DAU on polygon was all due to organic marketing. As a result, we were selected for Polygon LM2.0. I understand that the gas rebates are in order of cents but that is just an additional benefit on top of other incentives. We think the grant could help us to reach growth milestones in many ways. From the grant, we could start with marketing/education about protocol and the Optimism ecosystem. We could do collaborative marketing with good protocols. From the development budget, we can integrate more protocols to provide even better prices than now on Optimism. Currently, we have integrated Uniswap V3 but we will integrate Velodrome (leading DEX) and Paraswap DEX aggregator soon. Also, Can you please back up your statement with supporting evidence? We would be curious about how projects like ours, in a market sentiment like this, came over similar difficulties. Note: We offer an option to the OP board, to invest in us. Why? Because we can truly believe that with the seamless UX we have, the features we offer, and our community behind us - we can bring new users to the ecosystem. And at the end of the day, that’s what matters for you all and not how “technologically groundbreaking blockchain services” we offer. For comparison, pls look at Notion. They are valued at $10B. Everything they offer could be done in Google Docs as well. We would love to answer any further questions you do have. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.968446783101955
                },
                {
                    "author_link": "https://gov.optimism.io/u/ScaleWeb3",
                    "index": "48",
                    "likes": "0",
                    "time": "24/10/2022-18:40:45",
                    "content": "Breaking up larger Asks in smaller parts, working with clear deliverables and milestone payments has been proven again and again to achieve better results and works especially well in an adversarial, experimental environment.    [REVIEW] [GF: Phase 1 Proposal] Overnight.fi   to me the simple part of the answer is to make sure the dev grant is for a specific deliverable outlined in the proposal the more complicated part entails potentially staging funding for milestones or reducing asks to where the r/r on taking a risk on a team’s stewardship of funds is favorable (i.e., a known team gets more leeway than a less known one). we haven’t gotten there yet as a community but it’s a good one to review   You definitely have a point with funding the right initiatives but r/r for Optimism differs from venture funding. If we were not „bound“ to Optimism governance guidelines, we’d also advocate an extremely focused grant funding approach, for example on truly unique projects & top teams with tremendous network effects. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.857709750566893
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "49",
                    "likes": "2",
                    "time": "24/10/2022-18:41:22",
                    "content": "Thanks for the quick response. Will get something substantive back. An acquihire is an interesting proposition tbh! I do think this team seems really impressive. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.158333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "50",
                    "likes": "0",
                    "time": "24/10/2022-18:45:54",
                    "content": "    ScaleWeb3:  You definitely have a point with funding the right initiatives but r/r for Optimism differs from venture funding.   This is consistent with what I’m saying – unlike VC you’re not swinging for home runs as OP governance. You’re looking for stuff that’s clearly promising for an ecosystem and for which a grant is clearly catalytic. I’m saying that this proposal as presented offers neither.     ScaleWeb3:  reaking up larger Asks in smaller parts, working with clear deliverables and milestone payments has been proven again and again to achieve better results and works especially well in an adversarial, experimental environment.   I’m not sure what this is in response to or why you’re quoting me on Overnight’s proposal. Their product has shown exceptional PMF (i.e., it’s a product that should be accelerated), and what I was proposing was a clearer delineation of what was to be built. That’s not relevant to this discussion. If your point is that it’s good to stage asks and match them to intended outcomes, yes. That’s exactly what we’ve done with Velodrome, for instance – we made a 6 month ask and are making another one now – with intended outcomes – and we’ve come back with an abundance of data. Tarot’s revised one did similarly, as have a number of other proposals. I think we’re getting better at this. But making a large ask that does nothing for governance smaller (which is what you suggested above) isn’t beneficial for anybody. What you need to do is make the path to growth credible. EDIT: This was written before I’ve fully read Kakashi’s last post, so there well could be info I’ve missed that might make me completely reverse my position. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.72067901234568
                },
                {
                    "author_link": "https://gov.optimism.io/u/ScaleWeb3",
                    "index": "51",
                    "likes": "0",
                    "time": "24/10/2022-18:55:50",
                    "content": "A. Optimism needs to build a full ecosystem. Onboarding top devs, projects, users (this proposal can help) is among the goals - even if not incredibly catalytic but with solid CACs etc. B. Short-Term Experiments, milestone payments can limit risks, kick off a fruitful long-term partnership and enable us to evaluate and cut funding or doubledown on initiatives that prove themselves. Please message me if you want to further discuss r/r or Op ecosystem building as discussion is going slightly off and we should fully focus on Symphony in this thread  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.194444444444445
                },
                {
                    "author_link": "https://gov.optimism.io/u/kakashi",
                    "index": "52",
                    "likes": "0",
                    "time": "25/10/2022-04:45:47",
                    "content": "Hey delegates, It would be great if you can read and approve our proposal. @mastermojo @Exosphere @krzkaczor @linda @quix @katie @OPUser @solarcurve ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/kakashi",
                    "index": "53",
                    "likes": "0",
                    "time": "25/10/2022-16:40:28",
                    "content": "Thanks for the kind words. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/katie",
                    "index": "54",
                    "likes": "2",
                    "time": "25/10/2022-16:48:48",
                    "content": "I am an Optimism delegate [Delegate Commitments - #18 by katie] with sufficient voting power and I believe this proposal is ready to move to a vote. ",
                    "links": [
                        "https://gov.optimism.io/t/voting-cycle-8-roundup/3742/14"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Exosphere",
                    "index": "55",
                    "likes": "2",
                    "time": "25/10/2022-18:23:34",
                    "content": "As an Optimism delegate [Delegate Commitments - #29 by Exosphere ] with sufficient voting power I move that this proposal be transitioned to the voting stage. ",
                    "links": [
                        "https://gov.optimism.io/t/voting-cycle-8-roundup/3742/14"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/fig",
                    "index": "56",
                    "likes": "2",
                    "time": "25/10/2022-18:57:46",
                    "content": "We are an additional Optimism delegate with sufficient voting power (1.13% of the vote), and we believe this proposal is ready to move to a vote. Delegate Commitments - #69 by fig ",
                    "links": [
                        "https://gov.optimism.io/t/voting-cycle-8-roundup/3742/14"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/kakashi",
                    "index": "57",
                    "likes": "1",
                    "time": "26/10/2022-06:48:46",
                    "content": "@katie @Exosphere @fig We are deeply grateful for your support and thank you for helping Symphony progress to the next phase. We are also grateful to all the delegates who have taken the time to review our proposal and provided some great feedback. Looking forward to your support in later phases  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/kakashi",
                    "index": "58",
                    "likes": "2",
                    "time": "26/10/2022-15:45:56",
                    "content": "Moving this proposal to REVIEW status ahead of Voting Cycle #8, Week 2, as per OPerating Manual v0.2.0 2. Summary of feedback and changes to the proposal The feedback received on the proposal has been very constructive and has helped us to create a proposal that will incentivize Symphony’s usage on OP and drive the ecosystem’s growth. The changes can be summarized as follows:   The team has added a detailed short-term & long-term roadmap for Symphony as per community feedback.   After a long discussion & community feedback, the distribution plans have been revised. We have allocated more tokens(55%) for User incentives and decreased marketing allocation to 15%.   The proposal has been updated with details regarding our marketing programs and provided detailed justification on how we plan on using those funds.   The team has responded to questions regarding the level of Optimism focus in our marketing and community education.   The team has provided information regarding Symphony’s yield generation process, maintenance & integration costs.   The team has provided different subgraphs on user data and analytics per different queries.   The proposal has been updated with information regarding airdrops and gas rebates for user incentives.   The team has provided comparative charts for volume, transaction counts, and transaction costs with respect to other DEXs on Polygon.   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.513888888888889
                },
                {
                    "author_link": "https://gov.optimism.io/u/katie",
                    "index": "59",
                    "likes": "2",
                    "time": "01/11/2022-19:51:45",
                    "content": " Defi Committee A Recommendation Voting recommendation: No Rationale: 35% is allocated to retroactive air drops which have proven to be ineffective as shown in the governance grant performance presentation. 30% is allocated for development and maintenance and it’s unclear if these tokens will be sold which would violate the no sale rule. Next Steps: We would like to see the retroactive airdrop removed and clarify whether the intention is to sell the 30% allocated for development and maintenance. Note: Linda and Bobby recused themselves due to conflicts of interest. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.6875
                },
                {
                    "author_link": "https://gov.optimism.io/u/kakashi",
                    "index": "60",
                    "likes": "2",
                    "time": "02/11/2022-05:09:54",
                    "content": "Thanks to the committee for taking the time to review our proposal. We don’t have any intention of selling the tokens allocated for development and maintenance. We will keep it in our treasury for a long time. It will help us diversify our treasury. We are also happy to keep a lockup of a minimum of 6 months on funds allocated for development. In an emergency, we may use these funds to compensate the developers, but we will do so directly in the $OP token (without selling to any other token). The 35% tokens are allocated to incentivize the actual usage. We will allocate a very small percentage in the early stages for retroactive airdrop, and if the strategy doesn’t work, we’ll change our strategy. For eg: we can start LM. The limit order will earn an extra APY in $OP tokens on top of the real yield (from protocols like Aave). The yield can only be earned if the limit/stoploss order executes. This way we will be able to stop mercenary actors from gaming the system. Please let us know if you have any other questions. We would love to answer them. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.758333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "61",
                    "likes": "0",
                    "time": "03/11/2022-20:12:15",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "62",
                    "likes": "0",
                    "time": "03/11/2022-20:51:38",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "63",
                    "likes": "0",
                    "time": "09/11/2022-13:52:38",
                    "content": "I am voting against this proposal following the committee recommendation. The retroactive airdrop is a deal breaker for me.     katie:  Rationale: 35% is allocated to retroactive air drops which have proven to be ineffective as shown in the governance grant performance presentation. 30% is allocated for development and maintenance and it’s unclear if these tokens will be sold which would violate the no sale rule . Next Steps: We would like to see the retroactive airdrop removed and clarify whether the intention is to sell the 30% allocated for development and maintenance.   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/SEED_LATAM_Joxes",
                    "index": "64",
                    "likes": "0",
                    "time": "11/11/2022-03:10:13",
                    "content": "Voted: Against The discussion here was very constructive. Committee A showed two important points to correct and our community also accompanied. I personally value the added value of Symphony for a particular sector of the DeFi ecosystem, so the main goal is to encourage volume, trading competitions can be a good approach while the marketing strategy is still in place; in my understanding trading on-chain needs more push (while farming activities doesn’t because the APY does it by itself). We will be waiting for a better focused proposal, Symphony has been used by various members of our community for some time now. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.462962962962963
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "65",
                    "likes": "0",
                    "time": "14/11/2022-16:32:08",
                    "content": "Snapshot vote - not passed ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "66",
                    "likes": "0",
                    "time": "14/11/2022-16:32:11",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/mony",
                    "index": "67",
                    "likes": "0",
                    "time": "28/11/2022-02:56:58",
                    "content": "I’m not often active on op, but I activated this account for this project. It’s a great program and with its stop-loss feature, it’s saved me a lot of losses! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.166666666666667
                }
            ]
        }
    ],
    "group_index": "296"
}