{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/grant-for-1st-omniverse-gallery-in-the-world/5311",
            "title": "Grant for 1st Omniverse Gallery in the world ",
            "index": 5311,
            "category": [
                "\\xf0\\x9f\\x8f\\x9b Governance",
                "Grants Council"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/AstonM",
                    "index": "1",
                    "likes": "1",
                    "time": "21/02/2023-10:23:42",
                    "content": "In the next 10-12 years, smartphones will give way to devices that will allow you to quickly enter the metaverse, and now we are creating an atmosphere for this future. Thanks to the gallery, hundreds of millions of people will have access to luxury investments and will be able to create the future they want The world’s first omniverse nft-gallery, Atmosphera, is a bridge between the worlds: our reality and the meta universes. Here you can move things from the real and familiar to you world - to the virtual reality or take items from the virtual universe to the real world… The main difference between Atmosphera and other projects is Possibility to choose the possession:   The gallery workers themselves check the documents confirming the authenticity of the objects, digitize the things themselves, create the nft themselves.   Gallery Atmosphera takes care of the advertising campaign completely: from creating the concept to the budget for promotion.   Gallery “Atmosphera” cooperates with antique houses and private collectors in Europe and Asia.   The gallery’s team are people who have achieved competitive excellence in their fields, from art to law. Advantages for buyers:  Have the opportunity to buy a piece of an actual physical object, with the goal of investing or systematically acquiring all the pieces NFT.    Have an opportunity to buy a virtual copy of it digitized from the original, if that’s the format you need (for example, for your house/avatar in the meta universe).   You can buy a copy digitized from a copy. It’s less expensive, but has less functionality and distinctive features of the virtual object.   Buy out all pieces of NFT and get a physical object, with ownership rights, but leave it in storage of former owners or give it to museum/gallery (trust management/storage) Users’ motives for purchasing:   There are many different options, as well as many motives to buy. Someone wants to own something valuable and universally recognized, someone wants to invest with a guarantee of growth ( deficit creates value and Van Gogh won’t paint any more). Someone, gathered in groups, wants to buy a piece of world art from a private individual and give it to a museum, making it available to the public. Someone wants to get Napoleon’s saber or Louis Saint’s sundress into their home in the metaverse … I need an investment of 100.000 dollars to redesign the gallery and create a full-fledged product and primary marketing promotion. For 100k dollars i’m ready to offer a 5% share in the project. I am looking for investments for the marketing promotion of the project.  the technical part is already ready.  purchased equipment for scanning objects. More information: atmosphera.global, connct me on LinkedIn: @astonishomme ",
                    "links": [],
                    "GPT-summary": "The post describes a proposal for the world's first omniverse NFT-gallery, Atmosphera, which aims to bridge the gap between the real and virtual worlds. The author explains the advantages for buyers and the motives for purchasing. The author is seeking an investment of $100,000 for redesigning the gallery and primary marketing promotion, offering a 5% share in the project. The post also provides a website and LinkedIn contact for more information.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.826388888888889
                },
                {
                    "author_link": "https://gov.optimism.io/u/FractalVisions",
                    "index": "2",
                    "likes": "0",
                    "time": "21/02/2023-16:29:02",
                    "content": "Please refer to the grant proposal template.     Grants Proposal Template - Cycle 11 Grants       Based on the Cycle 10 experience, the Grants Council has determined that the Grant Proposal Template and submissions process can be improved to facilitate a more seamless experience for proposers and reviewers.  For Cycle 11, each Sub-Committee has created its own Grant Proposal Template, designed to guide proposers to provide information most relevant to the Sub-Committee’s evaluation criteria.  Proposers should copy the proposal template for the relevant Sub-Committee and start a new post to t…     ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 6.883116883116883
                }
            ]
        }
    ],
    "group_index": "535"
}