{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/optimism-monetary-policy/5430",
            "title": "Optimism Monetary Policy ",
            "index": 5430,
            "category": [],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/cihatozturk",
                    "index": "1",
                    "likes": "3",
                    "time": "05/03/2023-09:26:26",
                    "content": "Hello. I have been researching about Optimism Token Monetary policy. I have questions about this. Firstly;  we see in the first graph all supply will be available end of the 4 year. Also, airdrop will be end-up 2 year later.  image1920×914 47.1 KB  However, we see different supply model in this document It shows we will just reach %65 of main supply end of the 4 year. Airdrop won’t be end-up 2 year later and it will continue more than 4 year. May I know the reason for this difference? ",
                    "links": [
                        "https://docs.google.com/spreadsheets/d/1qVMhLmmch3s6XSbiBe8hgD4ntMkPIOhc1WrhsYsQc7M/edit#gid=1283480580",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/37"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.979166666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/TheDoctor",
                    "index": "2",
                    "likes": "2",
                    "time": "05/03/2023-12:56:08",
                    "content": "Hi @cihatozturk, Welcome to the OP discourse. This is a link to the updated documentation:   Optimism Docs   OP Allocations Allocations at a glance Category Percentage Description --- --- --- Ecosystem Fund 25% The Ecosystem Fund is a proactive program meant to stimulate development in the Collective ec      Please note that above the graph, there is a note that says:  Note this graph is for illustration only, and actual circulating supply will depend on governance and the rate that OP is allocated across user airdrops, the Ecosystem Fund, and RetroPGF.  The spreadsheet document is a more recent estimation. The Optimism collective works through an iterative process, so adjustments will be made based on the results of each iteration. Anyway, it’s a good observation and perhaps it would be good to update the graph, but on the other hand, the process is what it is and it provides transparency to see the evolution as it happens. I hope you keep contributing with your comments, we need more people involved in the community. Cheers! ",
                    "links": [
                        "https://community.optimism.io/docs/governance/allocations/#token-distribution-details"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.6000000000000005
                },
                {
                    "author_link": "https://gov.optimism.io/u/FractalVisions",
                    "index": "3",
                    "likes": "1",
                    "time": "05/03/2023-13:23:49",
                    "content": "The graph is not the deciding factor here. Only the governance decides how the tokens are distributed and that can change easily with each season. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.083333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/cihatozturk",
                    "index": "4",
                    "likes": "1",
                    "time": "05/03/2023-14:21:43",
                    "content": "Thanks for information @TheDoctor, I support to be more transparent. The spreadsheet document goes along the simillar lines on “GovFund”, “PartnerFund-SeedFund-Unallocated”, “RetroPGF”, “EarlyCoreContributors”, “SugarXaddies”. However, there is a serious deflection on Airdrops. There will be lower than %50 percentage of total Airdrop in 4 year. If we make a direct proportion, it will take around 10 years for the Airdrop to be completely finished. IMO, this situation will make longer time fake usage rate and wrong network datas. In addition, this degree of deflection from the first graph may damage the reliability. Morever, Optimism started at 5% of total supply and people invest token which %95 lack of total supply Token. In this time, Optimism do successful things but only %5-7 of circuliting supply is far to take investors. When you add just at least %5 one more time, inflation will be %100 and price will get effect. Therefore, with low circulating supply and adding more supply will be so big problem in the future. I advice to discuss Monetary Policy more and make it improve. I will be happy to attend it too because i have been researching Monetary Policy on crypto coins during years. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.606060606060606
                },
                {
                    "author_link": "https://gov.optimism.io/u/FractalVisions",
                    "index": "5",
                    "likes": "0",
                    "time": "05/03/2023-14:34:25",
                    "content": "    Agora (vote.optimism.io) Feedback Thread 🏛 Governance       Hey everyone   Charlie here from team Agora.  Really appreciate everyone for trying out Optimism Agora Beta with the first test proposal and giving us such helpful feedback.  We’ve been reading all the posts, comments, and messages on Discord/Twitter/Discourse, and really appreciate the thoughtful responses. Special thank you to @lavande, @diligit, @TanBinh and the other mods for helping us triage, loop into convos and surface great feedback.  The feedback has been invaluable as we work to…     Did you notice there is also a bit of a monopoly on the way that the tokens are being delegated as well ??? It is highly unfair in which the airdrop #2 was sent out without having a proper dashboard for discovery of new delegates… What is a bigger concern to you ? When or how many of the tokens get sent out? Or who ends up in power due to a broken system? This is not looking good for the Optimism governance. It seems that private investment firms have moved into the ecosystem in the form of decentralized enterprises and are currently claiming their stake in decisions being made through Optimism governance. Controlling the monetary policies that you speak about and leaving the tokens house community or other delegates powerless when it comes to decisions or grant approval. Ignoring the concerns of new members who don’t have any voting rights due to a rigged system of token delegation! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.397413665879575
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "6",
                    "likes": "1",
                    "time": "06/03/2023-15:29:29",
                    "content": "the system is not rigged @FractalVisions . everyone’s looking into increasing and broadening delegate representation. we’ve been talking about this for months. it’s not easy but we’re moving in the right direction. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.1726190476190474
                },
                {
                    "author_link": "https://gov.optimism.io/u/FractalVisions",
                    "index": "7",
                    "likes": "0",
                    "time": "06/03/2023-15:42:47",
                    "content": "I hope so. I understand how long it takes for problems like this to arise and also get fixed after being addressed. I will wait to see how this is handled and if there is any improvement in the ui of all platforms used for delegating tokens. It has come to my attention that this issue with sorting has occurred since the very start on the Optimism governance website and now persists on both Karma hq & Agora. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.416666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "8",
                    "likes": "1",
                    "time": "06/03/2023-16:01:49",
                    "content": "it may have recently come to your attention but i’d been sounding the alarm on this for months since not long after the airdrop; it’s not a new issue. what i’m saying is that after having spent a good amount of time focused on this issue, there’s more to go, but I think all concerned parties are taking the question seriously. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.516774891774892
                },
                {
                    "author_link": "https://gov.optimism.io/u/FractalVisions",
                    "index": "9",
                    "likes": "0",
                    "time": "06/03/2023-16:17:39",
                    "content": "Yeah, I understand. I was just asking what the timeline was but if I’m not gonna get an answer it may be months just like you said. I am patient. I will wait. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "560"
}