{
    "poll_list": [
        {
            "id": "0x6cc31c08dd7b59a516934fbab9f5fd355d9c92d5a438cc9474df65b9f7edd545",
            "title": "Season 2: Cycle 7: Rainbow Wallet",
            "discussion": "https://gov.optimism.io/t/review-gf-phase-1-proposal-optimism-rainbow/3564",
            "body": "This Governance Fund Phase 1 proposal is eligible for voting in Cycle 7. \n\nThis proposal is was reviewed by [Tooling Committee](https://gov.optimism.io/t/tooling-committee-season-2-recommendations/3551). You can find committee recommendations below:\n\n[Tooling Committee recommendations]([https://gov.optimism.io/t/tooling-committee-season-2-recommendations/3551](https://gov.optimism.io/t/tooling-committee-season-2-recommendations/3551))\n\nBy approving committees, the Token House entered a social contract to entrust and delegate the bulk of decision-making to official committees. However, delegates may vote against the recommendation of official committees but should provide a justification to the community as to why they voted differently.",
            "choices": [
                "For",
                "Against",
                "Abstain"
            ],
            "scores": [
                11739540.768477803,
                781123.7622475091,
                26428.419032533096
            ],
            "start": 1665692286,
            "end": 1666293486,
            "snapshot": "29192542",
            "state": "closed",
            "author": "0x47C88bb92B409fF25F6587EA611fac4e55f76007",
            "space": {
                "id": "opcollective.eth",
                "name": "Optimism Collective"
            }
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/review-gf-phase-1-proposal-optimism-rainbow/3564",
            "title": "[Review][GF Phase 1 Proposal] Optimism \\xf0\\x9f\\x8c\\x88 Rainbow ",
            "index": 3564,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Governance Fund: Phase 1"
            ],
            "tags": [
                "cycle-7",
                "passed"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/timmmy",
                    "index": "1",
                    "likes": "5",
                    "time": "27/09/2022-01:03:38",
                    "content": "  Optimistic Rainbow OP Incentive Proposal   Project Name: Rainbow Wallet Author Name: Mike Demarais, Imhiring.eth on Twitter, GitHub Contact Info: Grant Wright, grant@rainbow.me, grunt.eth, Twitter, Forum profile Mike m.demarais@gmail.com - Imhiring.eth (Twitter, GitHub), christianbaroni.eth (Twitter, GitHub) I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: Yes L2 Recipient Address: oeth:0x9d62e3f4f5a2ef4F446dA692B07860F3C78CEAa4 Which Voting Cycle are you applying for?: Voting Cycle 7 Grant Category: Governance Fund Phase 1 Is this proposal applicable to a specific committee?: Yes. The Optimism Tooling/Infrastructure Committee - [DRAFT] S02 Committee Proposal: Tooling Governance Committee Governance  Project Overview  Project Description:  Rainbow has two core products: RainbowKit and Rainbow Wallet (mobile), with more in development   Rainbow Wallet is the most fun, simple, & secure way to explore Web3, NFTs, & Ethereum. RainbowKit is the best way for users to connect their wallet. It’s designed for everyone and built for developers. It was released to the community as a public good in 2022. Since its release in February 2022, RainbowKit has been downloaded almost a quarter of a million times, and integrated by countless Web3 and DeFi DApps across EVM chains.  Across all our efforts, Rainbow aims to make the Ethereum ecosystem fun and accessible for all users through unparalleled user-experience design and deep understanding of DeFi and Web3. This includes open-sourcing our products and building public goods. Our Approach to L2s: In early 2019, while deeply embedded in the DeFi community, Rainbow became the first wallet to not only support NFTs, but also treat them as first class citizens. At the time the crypto community largely didn’t understand this move, but Rainbow saw the cultural potential of NFTs and Web3 beyond DeFi. Rainbow viewed NFT adoption as somewhat of a chicken and egg issue: As long as there was no great interface to showcase and interact with one’s NFTs, most users would fail to see their value. We see the same issue with L2 adoption. Who will build the tools necessary for scaling Ethereum without the demand? It’s our belief that mass adoption of L2s will not be possible until L2s are fully empowered and easily accessible from the consumer’s primary touchpoint, their wallet. Rainbow treats L2 networks as first class citizens.  Phoneop-phone21920×1440 97.6 KB  Rainbow already offers complete feature parity for L2s as it does for mainnet. This means Optimism and other L2 users enjoy the same great experience as Mainnet Ethereum users:  L2 tokens and NFTs are displayed in-line with Mainnet assets Users can swap between nearly any token on our supported networks without leaving the app Soon Rainbow will integrate seamless bridging and cross-chain swaps to make traversing Mainnet and L2s frictionless. For our users it is all one unified Ethereum ecosystem.  We have also already teamed up with Optimism for promotions related to NFT launches and offered special features to L2 users in-app. Rainbow is one of the best user experiences for Optimism available today. We want to incentive more people to try using OP. We believe that the inherent benefits of the network combined with our exceptional user experience will keep people in the Optimism ecosystem for the long term! Current Highlight Features:  In-app swaps - Rainbow’s custom router contract aggregates all of the most trusted liquidity sources (0x, 1inch, etc) to let users swap tokens on Optimism, Ethereum, Arbitrum, and Polygon networks at the best exchange price. More tokens & exchanges are added each day. Best in class NFT showcasing and support - Rainbow supports all media formats for NFTs on Optimism, Ethereum, Arbitrum and Polygon. Rainbow also supports POAPs currently on Gnosis Chain. Intuitive crypto portfolio - Rainbow automatically discovers Optimism tokens, portfolio value, and has native Optimism support built in without any extra settings or additional effort for the end user. RainbowKit - provides a fast, easy and highly customizable way for developers to add a great wallet experience to their application. We handle the hard stuff so developers and teams can focus on building amazing products and communities for their users. Add Cash - Fiat on-ramp to Ethereum Mainnet ENS profiles - Claim ENS handles, extend ENS registrations, and customize your ENS profile all in Rainbow. We also support sending to ENS addresses on all networks available in Rainbow.   Our story:  Rainbow founders Christian Baroni, Mike Demarais, and Jin Chung came together with a mission to make navigating Ethereum simpler for the average consumer. Baroni used to contract design for Microsoft while he was at high school and became Stripe’s 4th designer at the age of 17. Demarais immersed himself in computer design and website creation from a young age, dropping out of college to work as an engineer at several user-focused start-ups. Chung majored in computer science engineering at UPenn and later wrote trading tools for equity derivatives and algorithms for eBay’s recommendation systems. Project links:  Wallet - iOS, Android  Rainbow Wallet Website: rainbow.me  RainbowKit Website: RainbowKit.com  Twitter: twitter.com/rainbowdotme  GitHub: https://github.com/rainbow-me/  Rainbow Wallet GitHub: https://github.com/rainbow-me/rainbow/  Rainbow Wallet FAQ: https://learn.rainbow.me/  RainbowKit GitHub: https://github.com/rainbow-me/rainbowkit  RainbowKit Documentation: https://www.rainbowkit.com/docs/introduction  Rainbow Swaps GitHub: https://github.com/rainbow-me/swaps  Rainbow Swaps OptimismScan: https://optimistic.etherscan.io/address/0x00000000009726632680fb29d3f7a9734e3010e2   Additional team member info (please link): The whole Rainbow team can be found here! https://twitter.com/rainbowdotme/following Please link to any previous projects the team has meaningfully contributed to: Rainbow team members have worked at or on some of these projects:  MetaMask Wagmi Shopthru Wallet Connect Vanilla-extract Stripe Facebook Messenger Discord  Relevant Usage Metrics:  Rainbow Router is deployed on Mainnet, Optimism, Arbitrum, and Polygon.  https://dune.com/rainbowwallet/rainbow-router-network-stats - on-chain data for users of our in-app swaps   Untitled1104×697 59.3 KB  Competitors, peers, or similar projects MetaMask, Coinbase Wallet, Candide (proposal link), Tally Ho (proposal link) Is/will this project be open sourced?: Yes. Rainbow’s code base is open source on GitHub, Rainbow Wallet is open source licensed with GPLv3 (link). RainbowKit uses the MIT license (link). Rainbow Router is also GPLv3 (link) code is deployed on Mainnet, Optimism, Arbitrum, and Polygon. The contract code and the audit are also available on GitHub. Optimism native?: Ethereum Native, our goal is Optimism feature parity  Rainbow was an early mover to support Optimism. We were the first wallet to support Optimism NFTs! How do you add Optimism to Rainbow Wallet? You don’t! It’s already there!  https://help.optimism.io/hc/en-us/articles/4417258511131-How-do-I-use-Optimism-with-Rainbow-Wallet-  Rainbow currently supports on-chain swaps on Optimism in-app Rainbow will soon integrate cross-chain bridging and cross-chain swaps. Rainbow is working to add L2 fiat on-ramps  Optimism Deployment date: August 2021 https://twitter.com/rainbowdotme/status/1427304535450660867 https://twitter.com/rainbowdotme/status/1427304535450660867  Screen Shot 2022-09-26 at 5.59.30 PM1184×1578 111 KB   Ecosystem Value Proposition: What is the problem statement this proposal hopes to solve for the Optimism ecosystem? Feature parity, lagging UX, bridging, swapping, adding NFTs manually, buying tokens with fiat—these are all pain points for L1s, and the technical expertise demanded of an L2 user is even higher. To put it simply: using an open source & self-custody wallet is often harder than it has to be. Furthermore, the benefits of using an L2 like Optimism aren’t always easily understood. Many users do things the way they’ve always done them—on mainnet—and carry the perception there are high switching costs (like extra steps, time, complexity) to using L2s. How does your proposal offer a value proposition solving the above problem? Rainbow is an open source and cross-chain wallet that is working towards feature parity for Optimism. We make using Optimism easy, no matter what your level of experience. An Optimism grant will enable Rainbow to offer OP token rewards to users using Optimism. This initiative will incentivize users to experience the benefits of Optimism first hand. Rainbow already made a large investment to support and offer feature parity for Optimism, and we are in midst of further enhancing this experience for Optimism users. Specifically, Rainbow is building cross-chain swaps and bridging to completely abstract the process of bridging. Without the friction of bridging funds to L2s, users have no reason not trade and interact on Optimism where transactions are just as secure and exponentially more affordable. There’s no risk, extra effort, or new steps to learn to use Optimism on Rainbow. Why will this solution be a source of growth for the Optimism ecosystem? The Optimism ecosystem will benefit from a strong association with the Rainbow brand. Rainbow is well-known for being friendly, approachable, and a top tier wallet choice for both newbies and pros. Rainbow can help expand the market for Optimism beyond experts and degens. With our unique and aesthetic style, Rainbow will advertise the incentive program and new opportunities to use Optimism and be able to reach thousands of users directly in their wallets.  optimism_icon1920×1440 56.5 KB   IMG_BBE85073A39D-11170×700 55.5 KB  Has your project previously applied for an OP grant? No  Token Distribution  Number of OP tokens requested: 420,069 OP Did the project apply for or receive OP tokens through the Foundation Partner Fund?: No If OP tokens were requested from the Foundation Partner Fund, what was the amount?: N/A How much will your project match in co-incentives?: Rainbow is not committing to purchase OP for incentives programs. We have no plans to match at this time, but wish we could  Proposal for token distribution: How will tokens be allocated 100% of $OP will be distributed as an incentive for users to make swaps on Optimism within Rainbow, or to bridge assets to Optimism within Rainbow. Milestone Unlocks 126,019 tokens for the initial grant and then rest once proof-of-concept achieved.      OP Granted KPI (key performance indicator)     Initial Grant 126,019 (30%)    Milestone 1 294,050 (70%) $200,000 vol on Optimism or 500 bridges/trades per week   Total 420,069 OP awarded     KPIs: trading volume and total number of trades per week Rainbow and Optimism would work collaboratively to determine the best way to award incentives over the course of the program to best hit each milestone. Additional context for draft reviewers - Our initial thoughts would be to reward Rainbow Swap users on Optimism and Ethereum, which would introduce our Ethereum users to the Optimism token and network. We welcome input on the optimal distribution methods and tokenomics to improve user retention on Optimism and limit the sale of Optimism tokens. Why will users continue using Optimism after incentives are gone? Rainbow makes Optimism easy and fun to use. The incentives will entice new users to try Optimism risk-free, and Rainbow’s ease of use plus the obvious value of Optimism (security, speed, affordability) will keep them coming back. Trackable Milestones / KPIs  Total swaps made from the Rainbow app on our supported networks Unique addresses using Rainbow swaps on Optimism Swap volume from Rainbow swaps on Optimism  Additional information to facilitate accountability:  Rainbow Router address on all deployed chains: 0x00000000009726632680fb29d3f7a9734e3010e2   ",
                    "links": [
                        "https://github.com/mikedemarais",
                        "https://twitter.com/grntwrght",
                        "https://gov.optimism.io/u/grunt",
                        "https://twitter.com/mikedemarais",
                        "https://github.com/mikedemarais",
                        "https://twitter.com/christianbaroni",
                        "https://github.com/christianbaroni",
                        "https://gov.optimism.io/t/draft-s02-committee-proposal-tooling-governance-committee/3333",
                        "https://gov.optimism.io/c/governance/41",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/5/541195ea7d9f6069cb1923133072e8681b8b956d.jpeg",
                        "https://apps.apple.com/us/app/rainbow-ethereum-wallet/id1457119021",
                        "https://play.google.com/store/apps/details?id=me.rainbow&hl=en_US&gl=US",
                        "https://rainbow.me",
                        "https://rainbowkit.com",
                        "https://twitter.com/rainbowdotme",
                        "https://github.com/rainbow-me/",
                        "https://github.com/rainbow-me/rainbow/",
                        "https://learn.rainbow.me/",
                        "https://github.com/rainbow-me/rainbowkit",
                        "https://www.rainbowkit.com/docs/introduction",
                        "https://github.com/rainbow-me/swaps",
                        "https://optimistic.etherscan.io/address/0x00000000009726632680fb29d3f7a9734e3010e2",
                        "https://twitter.com/rainbowdotme/following",
                        "https://dribbble.com/shots/10031599-Metamask-Chrome-Extesion-2016",
                        "https://wagmi.sh/",
                        "https://www.shopthru.xyz/",
                        "https://walletconnect.com/",
                        "https://vanilla-extract.style/",
                        "https://stripe.com/?utm_campaign=paid_brand-US_Search_Brand_Stripe_Control-1803852691&utm_medium=cpc&utm_source=google&ad_content=604030746209&utm_term=stripe&utm_matchtype=e&utm_adposition=&utm_device=c&gclid=Cj0KCQjwj7CZBhDHARIsAPPWv3fH7XbtMlstFlnlp2tm0Kdx58ymUrzrR03mGDpnMOGWbdnNA1PNZvYaAr9IEALw_wcB",
                        "https://www.messenger.com/",
                        "https://discord.com/",
                        "https://etherscan.io/address/0x00000000009726632680fb29d3f7a9734e3010e2",
                        "https://optimistic.etherscan.io/address/0x00000000009726632680fb29d3f7a9734e3010e2",
                        "https://arbiscan.io/address/0x00000000009726632680fb29d3f7a9734e3010e2",
                        "https://polygonscan.com/address/0x00000000009726632680fb29d3f7a9734e3010e2",
                        "https://dune.com/rainbowwallet/rainbow-router-network-stats",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/6/6c6be43fce3781c9234aa8ff50c0f28f6a496747.png",
                        "http://metamask.io",
                        "http://coinbase.com",
                        "https://candidewallet.com/",
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-candide-wallet/2656",
                        "https://tally.cash/",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-optimism-tally-ho/3517",
                        "https://github.com/rainbow-me/",
                        "https://github.com/rainbow-me/rainbow/blob/develop/LICENSE",
                        "https://github.com/rainbow-me/rainbowkit/blob/main/LICENSE",
                        "https://github.com/rainbow-me/swaps/blob/main/LICENSE",
                        "https://etherscan.io/address/0x00000000009726632680fb29d3f7a9734e3010e2",
                        "https://optimistic.etherscan.io/address/0x00000000009726632680fb29d3f7a9734e3010e2",
                        "https://arbiscan.io/address/0x00000000009726632680fb29d3f7a9734e3010e2",
                        "https://polygonscan.com/address/0x00000000009726632680fb29d3f7a9734e3010e2",
                        "https://github.com/rainbow-me/swaps",
                        "https://help.optimism.io/hc/en-us/articles/4417258511131-How-do-I-use-Optimism-with-Rainbow-Wallet-",
                        "https://twitter.com/rainbowdotme/status/1427304535450660867?s=20&t=DuFhArx6fC-FVkaJ-RvgBQ",
                        "https://twitter.com/rainbowdotme/status/1427304535450660867",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/7/7c8cae04675d6ee55c8339debad3faa916804740.png",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/2/2d219e31fd3eb7615fe91fa0e1f93cef894ed416.jpeg",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/b/bb10e283f89e42545f5ff2a1245aa025e7c59b9d.jpeg",
                        "https://optimistic.etherscan.io/address/0x00000000009726632680fb29d3f7a9734e3010e2",
                        "https://gov.optimism.io/t/voting-cycle-7-roundup/3586/12",
                        "https://gov.optimism.io/t/infinity-wallet-growth-experiments-cycle-11/4915",
                        "https://gov.optimism.io/t/infinity-wallet-builders-cycle-11/5428",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-ambire-wallet/3806/18",
                        "https://gov.optimism.io/t/review-gf-phase-1-proposal-optimism-tally-ho/3517/37",
                        "https://gov.optimism.io/t/review-gf-phase-1-proposal-optimism-tally-ho/3517/41",
                        "https://gov.optimism.io/t/gfx-labs-delegate-communication-thread/2728/17",
                        "https://gov.optimism.io/t/review-gf-phase-1-proposal-optimism-tally-ho/3517/42"
                    ],
                    "GPT-summary": "The post is a proposal for an Optimism grant by Rainbow Wallet, which aims to offer feature parity for Optimism and make it easy to use for all users. The proposal includes a detailed description of the project, its goals, and its approach to L2s. The post also mentions the team behind the project, its competitors, and its relevant usage metrics. The proposal offers an incentive program to users to make swaps on Optimism within Rainbow or to bridge assets to Optimism within Rainbow. The post has entirely positive feedback and extends to the proposal, advertising it as a source of growth for the Optimism ecosystem.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Interoperability and Scaleability",
                        "Smart contract updates",
                        "Community and engagement",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party is advertising proposal"
                    ],
                    "Sentiment": 5.988629678833536
                },
                {
                    "author_link": "https://gov.optimism.io/u/Bobbay_StableLab",
                    "index": "2",
                    "likes": "1",
                    "time": "29/09/2022-09:47:45",
                    "content": "Not sure if you need 420.69k for swap/bridges. it’s a hefty amount for this usecase. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/grunt",
                    "index": "3",
                    "likes": "1",
                    "time": "29/09/2022-17:51:16",
                    "content": "Bobbay! We really appreciate you taking the time to review our proposal. Thanks for your feedback, we value the input on our draft proposal and we are open to suggestions! To us the amount seemed in line with recent requests from Tally Ho, other wallets, and defi incentive requests, we are dedicating all funds to user incentives to accelerate Optimism onboarding through Rainbow. Right now our in-apps swaps heavily favor mainnet ethereum. We are hoping that offering incentives would drive growth on Optimism use in Rainbow similar to the growth PoolTogether saw with their incentive program. We also have only asked for 30% upfront, with a KPI milestone locking the remainder until we see results. The format of this table is open to comment as well! We have been the among first wallets to support many Optimism features natively in-app including swaps and NFTs. Rainbow is now looking to accelerate Optimism growth through in-app feature parity and marketing! These features are already built and available in Rainbow and we are closing in on feature parity. Right now in-app bridging and cross-chain swaps are in beta! We think user incentives will drive a wave of Optimism growth and adoption from mobile wallet users. In my personal experience Optimism is already faster, cheaper, and easier to use than mainnet, especially on mobile! Thanks again Bobbay! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.659663865546218
                },
                {
                    "author_link": "https://gov.optimism.io/u/quix",
                    "index": "4",
                    "likes": "2",
                    "time": "03/10/2022-23:05:15",
                    "content": "I am an Optimism delegate [Delegate Commitments - #66 by quixotic] with sufficient voting power, and I believe this proposal is ready to move to a vote. ",
                    "links": [
                        "https://gov.optimism.io/t/voting-cycle-7-roundup/3586/12"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Defi_LATAM_axlvaz",
                    "index": "5",
                    "likes": "1",
                    "time": "04/10/2022-06:51:25",
                    "content": "I see few unique directions in Optimism and also in Ethereum. How much of the funds will you allocate to Swaps and how much to Bridge? And in case of bridging will you have a minimum? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.71875
                },
                {
                    "author_link": "https://gov.optimism.io/u/grunt",
                    "index": "6",
                    "likes": "1",
                    "time": "04/10/2022-19:10:45",
                    "content": "Thanks for reviewing our proposal! We appreciate your comments and questions! Apologies for the delayed response, I was checking with my team for further details. At this time we cannot commit to a defined incentive split between Swaps and Bridging transactions. Our aim is to promote combined swap and bridging transactions. The easiest metrics to track will be on-chain swap data, as we have a unique router contract for those. For bridging transactions we are using an existing bridge. We haven’t decided on a minimum dollar or ethereum amount for bridge transactions to qualify for incentives, that could be a good preventive measure against sybil attacks and other incentive farming activity. Are you concerned it would limit the accessibility to the program? Our friends on the Optimism team asked us to work with their cryptoeconomics and analytics team on the details of the incentive programs. Our apologies for the vagueness of our proposal at this stage, we will defer to the Optimism team and to our DeFi product managers for the exact implementation of our incentives program. We are considering reimbursing users for gas fees for bridges, as well as separate rewards for bridges and swaps. Right now we are working on deploying cross-chain swaps in conjunction with the proposed incentive program, and would like to abstract the bridging process as much as possible for our users. Bridging and swaps will be combined in our UI to remove friction and enable users to get the best possible prices on swap transactions across our supported networks. We will encourage users to swap and bridge at the same time. Here is an example of the UI for a swap and bridge in Rainbow from Ethereum mainnet to DAI tokens on Optimism. It uses the same format as our current in-app token swaps.  image1170×1417 61 KB  Thanks again and we appreciate your feedback! PS - We are also working on our Spanish translations for Rainbow and would love your feedback when they are ready in the next month or so! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.041170634920635
                },
                {
                    "author_link": "https://gov.optimism.io/u/Defi_LATAM_axlvaz",
                    "index": "7",
                    "likes": "1",
                    "time": "04/10/2022-21:40:35",
                    "content": "I am part of the Latam community, I like that the products are in Spanish language. Very few protocols consider the user potential in Latam. On the other hand, I like your product and I think it has a better reach to the users. But your current metrics are too low for the amount you are asking for. My recommendation is to ask for 60% less and then see the results and if they are good you can apply for a second grant. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.324166666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/grunt",
                    "index": "8",
                    "likes": "1",
                    "time": "04/10/2022-22:59:10",
                    "content": "At the suggestion of our friends at Optimism we put a KPI milestone in place to lock 70% of the funds, asking for 30% upfront. We welcome any guidance or suggestions about the grant amount and structure. We are new to the proposal process, and welcome the community guidance and committee review to help us refine those details to make our proposal and the incentives program successful! We have some good on-chain data for our Optimism and Mainnet swaps. Overall our Optimism swaps contract has about 35x less volume in Rainbow swaps than Mainnet Ethereum. We were excited to see the preliminary results from PoolTogether’s incentive program. We hope that Rainbow Swap volume on Optimism can also approach that on Mainnet! Thanks again for your time! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.18108164983165
                },
                {
                    "author_link": "https://gov.optimism.io/u/Defi_LATAM_axlvaz",
                    "index": "9",
                    "likes": "1",
                    "time": "04/10/2022-23:14:42",
                    "content": "    grunt:  At the suggestion of our friends at Optimism   When you refer to your friends in Optimism, do you mean people within the Optimism Foundation? or do you mean people who participate in this governance? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 3.4375
                },
                {
                    "author_link": "https://gov.optimism.io/u/grunt",
                    "index": "10",
                    "likes": "1",
                    "time": "04/10/2022-23:21:59",
                    "content": "People at the Optimism Foundation. We worked with them on our earlier Optimism partnerships and adding support for Optimism in Rainbow. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/mastermojo",
                    "index": "11",
                    "likes": "1",
                    "time": "05/10/2022-01:21:00",
                    "content": "I am an Optimism delegate [Delegate Commitments - #65 by mastermojo ] with sufficient voting power, and I believe this proposal is ready to move to a vote ",
                    "links": [
                        "https://gov.optimism.io/t/voting-cycle-7-roundup/3586/12"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "12",
                    "likes": "1",
                    "time": "05/10/2022-02:01:44",
                    "content": "I am an Optimism delegate [Delegate Commitments - #136 by jackanorak ] with sufficient voting power. I believe this proposal is ready to be reviewed and voted on. ",
                    "links": [
                        "https://gov.optimism.io/t/voting-cycle-7-roundup/3586/12"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/cryptotesters",
                    "index": "13",
                    "likes": "1",
                    "time": "14/10/2022-07:59:44",
                    "content": " Rainbow response  1. Presentation  We are an officially recognized Tooling Governance Committee, responsible for assessing proposals related to tooling and infrastructure (wallets, bridges etc.).  2. About the project  Rainbow is a highly popular mobile wallet with support for Ethereum and several scaling solutions such as Optimism, Arbitrum, Polygon and Gnosis chain. External links:  Website: https://rainbow.me https://mobile.twitter.com/rainbowdotme  Similar OP Governance proposals:  Candide - 190K OP tokens Tally - 400k OP tokens   3. About the following  The proposal was detailed and the authors responded to several questions raised around implementation details.  4. About the proposal valuation    Added value (good to bad): very good. A mobile wallet offering native support for Optimism is paramount for Optimism adoption. Rainbow invested heavily into Optimism beyond simply displaying wallet balances, displaying Optimism NFTs, allowing in-app swaps and soon integrated bridging.  Impact or expected usage (high to low): high. Rainbow has a large existing userbase that will be compelled to try out L2 networks by seeing call-to-actions in the Rainbow wallet.  Current Status [Development stage/Open Source?] (early to ready): mostly ready. The wallet itself has been live for several years and Optimism support has been live for a few months now. The only feature which is not live yet but will be soon is the in-app bridging. The wallet is open-source and so is the router contract for swapping.  Expenditure plan and distribution (appropriate to inappropriate): somewhat appropriate.  They intend to distribute 100% of the $OP grant to end-users who perform swaps on Optimism and bridge into Optimism. They request 30% of the grant upfront and 70% once certain KPI’s are hit (namely: $100,000 vol or 500 bridges/trades for two weeks). We really like tying the second grant tranche to KPI’s but think they could be set a bit higher.  Amount requested (high to low): medium. The requested amount is high but seems appropriate given the amount of work the Rainbow team has invested into Optimism. However, we do recommend more ambitious KPI’s for the second grant tranche.   5. KPIs and impact tracking To track the success of the campaign it would make sense to track:  #swaps  #users bridging  The team has already set-up an excellent dashboard: https://dune.com/rainbowwallet/rainbow-router-network-stats  6. FINAL RECOMMENDATION: Yes We think Rainbow provides a lot of value to Optimism and recommend to vote yes. We hope the Rainbow team will agree to tie the second tranche of the grant to a more ambitious set of KPI’s. ",
                    "links": [
                        "https://www.otterspace.xyz/",
                        "https://mobile.twitter.com/rainbowdotme",
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-candide-wallet/2656",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-optimism-tally-ho/3517",
                        "https://dune.com/rainbowwallet/rainbow-router-network-stats",
                        "https://gov.optimism.io/t/tooling-committee-season-2-recommendations/3551/10"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party auditing and reviewing proposal",
                        "3rd party extending to proposal",
                        "None"
                    ],
                    "Sentiment": 5.829909886032335
                },
                {
                    "author_link": "https://gov.optimism.io/u/grunt",
                    "index": "14",
                    "likes": "0",
                    "time": "14/10/2022-19:36:38",
                    "content": "   Thanks to everyone for your help with the proposal process. We increased the KPI to $200k weekly swap volume on Optimism The Snapshot vote is live! Any feedback from delegates is welcome, we will monitor this thread and our Twitter DMs are open! ",
                    "links": [
                        "https://twitter.com/rainbowdotme"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.463068181818182
                },
                {
                    "author_link": "https://gov.optimism.io/u/katie",
                    "index": "15",
                    "likes": "1",
                    "time": "18/10/2022-01:16:15",
                    "content": "Voted yes - Following the Tooling Committee recommendation, I also really like the milestone unlocking component.  Great proposal! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "16",
                    "likes": "1",
                    "time": "20/10/2022-11:50:05",
                    "content": "I am voting YES following the recommendation we published with the tooling committee of which I am a member. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/SEED_LATAM_Joxes",
                    "index": "17",
                    "likes": "0",
                    "time": "21/10/2022-01:34:45",
                    "content": "[Final] Voting: Yes Following our own Tooling committee recommendation, we like what Rainbow Wallet is solving, and some of our community members manifest how cool Rainbow is for some case uses. We’re happy to support this project and proposal. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "18",
                    "likes": "0",
                    "time": "21/10/2022-13:24:14",
                    "content": "Snapshot vote - passed ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "19",
                    "likes": "0",
                    "time": "21/10/2022-13:24:32",
                    "content": "@timmmy  can you provide a Telegram handle or other contact method so the Optimism team can get in touch about paying out this grant! Feel free to DM or email palash@optimism.io ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.609375
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "20",
                    "likes": "0",
                    "time": "21/10/2022-13:24:34",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "272"
}