{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/original-post-gf-phase-1-across-protocol/3163",
            "title": "[Original post] [GF: Phase 1] Across Protocol ",
            "index": 3163,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Governance Fund: Phase 1"
            ],
            "tags": [
                "cycle-6"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/britt",
                    "index": "1",
                    "likes": "53",
                    "time": "29/07/2022-15:36:01",
                    "content": "IMPORTANT NOTE: Optimism governance has taken a Reflection Period, during which time they implemented changes to their proposal process. As a result, this proposal will be updated to the new format in a NEW post. That post will include a link to this proposal in order to preserve the discussion in comments below. You can read the new post here.  Overview Project Name: Across Protocol Author Name: Across community + Risk Labs (Britt is the author of this post, and the best point of contact. She is the community lead for Across, employed by Risk Labs. Risk Labs is the foundation that built and supports Across) Number of OP tokens requested: 1,000,000 $OP Timeline for distribution: until they run out. We hope to see these rewards distributed over a 9-12 month period. L2 Recipient Address: 0x8180d59b7175d4064bdfa8138a58e9babffda44a  Relevant Usage Metrics: (TVL, transactions, volume, unique addresses, etc.)  Total Bridge Volume: $448,940,817 TVL: $71,290,836 in total Total Bridge Users: 70,331 Total Transfers: 161,586   Optimism alignment:  Across is the fastest, cheapest and most secure bridge between L1 and L2s.  Across protocol is a novel bridging method that combines an optimistic oracle, bonded relayers and single-sided liquidity pools to provide decentralized instant transactions from rollup chains to and from Ethereum mainnet. Across Protocol supports bridging to and from Optimism from Ethereum mainnet and L2s.  UMA launched Across Protocol in early November 2021. Across is a bridging solution which uses UMA’s Optimistic Oracle.  Proposal for token distribution:  We have two planned mechanisms for the distribution of $OP tokens. We aim to use 75% of the tokens to subsidize bridge fees for users that would like to transfer assets to Optimism.  Currently, we support USDC, ETH, DAI, WBTC, and UMA.  The remaining 25% of the tokens will be used to reward anyone outside of Risk Labs (the team who builds and supports Across) who runs a relayer on Optimism.  How will the OP tokens be distributed?  Bridge Users For any user going to Optimism, we will rebate their bridge fee 105% (so they will earn 5% to bridge to Optimism).  The composure of this rebate depends on whether or not the user is already earning $ACX rewards on their transaction.  If there is no $ACX reward, the bridge fee will be rebated back 80% $OP and 25% $ACX.  If there is an $ACX reward, the $OP amount will be (105%-$ACX%).  All of this will be computed on the bridge fee component of a transfer and capped at 12 basis points (which covers the entire fee during periods of low to moderate bridge utilization. Note: Across differentiates between the bridge fee and the gas fee. This distribution is only applied to bridge fees, so network conditions that cause an increase in gas fees should not make an impact in this program. For more information on our bridge fees, you can see this section of our docs site. Relayers We will direct 25% of this grant towards rewarding non-Risk Labs relayers that facilitate transfers to Optimism. This will be dispersed as 0.01% (1bp) on the amount transferred in each relay. For context, this is equal to a 33% bonus for relayers operating on Optimism. This incentive will last until the 25% is exhausted. Note: This was an addition to the original proposal, which only rewarded bridge users. It was decided that this would serve to enhance the overall bridge experience for Optimism users, making it a worthwhile investment. Having a robust relayer network strengthens the security mechanism of the bridge, and reduces transaction times during high traffic events.  How will this distribution incentivize usage and liquidity on Optimism?  Users will only receive the tokens if they bridge assets to Optimism or run a relayer on Optimism. Both of these require people to move their funds to Optimism.  Why will the incentivized users and liquidity remain after incentives dry up?  Because they will find all the great dapps on Optimism and want to stay!  Over what period of time will the tokens be distributed?  This depends on bridging volume we see to Optimism.  Hopefully it is large and tokens are all used within 1 year.  Has your project previously received an OP token grant? If yes, what’s the status of these tokens?  No  How much will your project match in co-incentives?  For bridge users, we will match between 31% to 320% depending on the type of transaction as explained above. Here is how that math works out. If a bridgooor uses a ref link and is Platinum then they get 80% rebate in $acx and 25% in $op.  80/25 = 320%. If a bridgooor doesn’t use ref link, they get 80% $op and 25% $acx.  25/80 = 31%. ",
                    "links": [
                        "https://docs.across.to/v2/how-does-across-work/fees",
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-across-protocol-updated-template/3401",
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-across-protocol-updated-template/3401/8",
                        "https://gov.optimism.io/t/review-gf-phase-1-proposal-updated-template-safe/3426/29"
                    ],
                    "GPT-summary": "The post is an explanation of the Across Protocol proposal, which aims to distribute 1,000,000 $OP tokens to incentivize users to bridge assets to Optimism and run relayers on Optimism. The proposal includes details on the distribution of tokens, the usage metrics of the protocol, and the alignment with Optimism. The post also mentions the author and the best point of contact for the proposal. The post could receive positive feedback, constructive criticism, or extensions from third parties, and there is potential for collaboration.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Interoperability and Scaleability",
                        "Token economics",
                        "Smart contract updates",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.625005033725964
                },
                {
                    "author_link": "https://gov.optimism.io/u/scarlet",
                    "index": "2",
                    "likes": "8",
                    "time": "29/07/2022-15:59:36",
                    "content": "Proposal looks great and would definitely bring value to OP! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/FantomFunhouse",
                    "index": "3",
                    "likes": "2",
                    "time": "29/07/2022-18:23:18",
                    "content": "Looks like a sound idea and the execution looks straightforward. Do you have a way to prevent users who bridge funds from cycling the funds repeatedly to game the incentive program? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://gov.optimism.io/u/diligit",
                    "index": "4",
                    "likes": "2",
                    "time": "29/07/2022-18:24:43",
                    "content": "    britt:  Author Name: Across community + Risk Labs (Britt is point of contact)   Cool, community… I couldn’t find who Britt is, but I found that Risk Labs is the dev team. It’s like: Author Name: Bitcoin community (Satoshi Nakamoto is point of contact). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/britt",
                    "index": "5",
                    "likes": "3",
                    "time": "29/07/2022-18:27:54",
                    "content": "Fair point! I’m the community lead for Across, employed by Risk Labs. I can add that context in that section if it helps  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.375
                },
                {
                    "author_link": "https://gov.optimism.io/u/diligit",
                    "index": "6",
                    "likes": "3",
                    "time": "29/07/2022-18:45:07",
                    "content": " In general I like the proposal, for bridge the form of user incentive is correct, but it would probably be better if the refundable fee would be 80-90% max.99% but not 105%. Just my opinion. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.375
                },
                {
                    "author_link": "https://gov.optimism.io/u/britt",
                    "index": "7",
                    "likes": "3",
                    "time": "29/07/2022-18:50:16",
                    "content": "There are 2 things that make it less gameable:  they only get paid the incentive going to optimism. so they would have to pay the proper fee to leave optimism. We are only subsidizing the bridge fee component, not the destination gas fee. so the user will not immediately profit a full 5% in going to optimism. (Destination gas fee may be pretty small though, so this point is less meaningful than the first).  In theory, you still have to want to be going to Optimism for this to be meaningful. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.575757575757576
                },
                {
                    "author_link": "https://gov.optimism.io/u/MangoDAO",
                    "index": "8",
                    "likes": "1",
                    "time": "30/07/2022-01:56:07",
                    "content": "Great ! Support it! I believe it will also be beneficial to the ecology of Optimism! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/0xadrien",
                    "index": "9",
                    "likes": "1",
                    "time": "30/07/2022-02:07:42",
                    "content": "Great proposal!Across is the fastest, cheapest and most secure bridge between L1 and L2s.Please consider this proposal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.833333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/okexwallet",
                    "index": "10",
                    "likes": "1",
                    "time": "30/07/2022-02:31:56",
                    "content": "    diligit:  I like the proposal   Cool!  like the proposal, i’m a big fan of Optimism and Across ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.09375
                },
                {
                    "author_link": "https://gov.optimism.io/u/lzt",
                    "index": "11",
                    "likes": "0",
                    "time": "30/07/2022-02:38:29",
                    "content": "it’s really great,i like it ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/men",
                    "index": "12",
                    "likes": "0",
                    "time": "30/07/2022-03:24:01",
                    "content": "This will bring more user volume to Optimism ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/Davidma",
                    "index": "13",
                    "likes": "0",
                    "time": "30/07/2022-04:16:05",
                    "content": "Very good, this will benefit both Across and OP ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.549999999999999
                },
                {
                    "author_link": "https://gov.optimism.io/u/Sethoshi",
                    "index": "14",
                    "likes": "0",
                    "time": "30/07/2022-04:20:06",
                    "content": "Looks good. This would create avid users. Been using Across regularly… pretty smooth. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/touba",
                    "index": "15",
                    "likes": "0",
                    "time": "30/07/2022-09:02:25",
                    "content": "good  proposal will it open vote on snapshot? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/bitcoinorange",
                    "index": "16",
                    "likes": "0",
                    "time": "30/07/2022-11:41:54",
                    "content": "It is suggested to subsidize the excess expenses(12 basis points) in the form of $OP ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "17",
                    "likes": "2",
                    "time": "30/07/2022-11:46:51",
                    "content": "hey, glad you joined! Seems like a direct subsidy for users to do exactly what we’re hoping for eco growth. Wanted to know a few things for general knowledge: What sorts of impediments have you seen in bridging to OP to date - is there, for example, less bridging from mainnet because gas is high (which would make small bridgers not want to spend the gas plus fees on transfer)? Is there any behavior specific to bridging to Optimism you’ve noticed? Also, where does this subsidy set you relative to other bridging options in terms of user costs? Does it make you more competitive than some, all other bridges, and in which circumstances? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.31474358974359
                },
                {
                    "author_link": "https://gov.optimism.io/u/leowasatoo",
                    "index": "18",
                    "likes": "0",
                    "time": "30/07/2022-12:29:21",
                    "content": "I hope the bridge fee exceed 0.12% will redund as OP! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/FantomFunhouse",
                    "index": "19",
                    "likes": "1",
                    "time": "30/07/2022-15:50:24",
                    "content": "Topic seems to be getting brigaded by new accounts. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.681818181818182
                },
                {
                    "author_link": "https://gov.optimism.io/u/Prakash",
                    "index": "20",
                    "likes": "0",
                    "time": "31/07/2022-12:13:38",
                    "content": "Super protocol , op next airdrop will include across bridge users ,no minimum transaction limit,this will help all small and big traders and create great volume ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.883333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/HuntTheFarmers",
                    "index": "21",
                    "likes": "3",
                    "time": "31/07/2022-17:42:05",
                    "content": "Great project. Good project. Nice project. Great project. Good project. Nice project. Waiting for them to say like, comment and tag 3 friends. It’s so obvious fake accounts are being created on some proposals. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None"
                    ],
                    "Sentiment": 7.3125
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "22",
                    "likes": "1",
                    "time": "31/07/2022-17:54:16",
                    "content": "Hi @britt, thank you for adding an example of how incentive will work. One quick question, are you planning to do the incentive dynamically or will it be fixed? Imagine for some reason L1 gas is high(100gwie+ for example) then moving to OP chain will expensive. So how are you planning to tackle such situations? Full gas refund or is there a max limit? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.283333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/Bobbay_StableLab",
                    "index": "23",
                    "likes": "4",
                    "time": "01/08/2022-08:46:42",
                    "content": "This is a simple but effective idea to refund bridge fees. We like the idea that you are only refunded for going to optimism. I suggest clarifying in the main post that users are only refunded for the bridge fee, not the destination fee. Not sure whether 1,000,000 is completely necessary since it’s still somewhat a new protocol and a smaller amount is more ideal. And do you currently subsidize the fee in $ACX? Not sure if these comments are from your community, but these comments aren’t exactly helpful. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.733225108225108
                },
                {
                    "author_link": "https://gov.optimism.io/u/take",
                    "index": "24",
                    "likes": "0",
                    "time": "01/08/2022-14:36:26",
                    "content": "Very excited and looking forward to the future! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.21875
                },
                {
                    "author_link": "https://gov.optimism.io/u/dh13027",
                    "index": "25",
                    "likes": "0",
                    "time": "01/08/2022-15:35:29",
                    "content": "The suggestions are great. OP’s future is bright ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "26",
                    "likes": "1",
                    "time": "01/08/2022-15:36:11",
                    "content": "We’ve got to cool it on the fake accounts. It’s going to be hard to follow the discourse here. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.263888888888888
                },
                {
                    "author_link": "https://gov.optimism.io/u/jiangtao",
                    "index": "27",
                    "likes": "0",
                    "time": "01/08/2022-16:09:51",
                    "content": "Looks like a sound idea and the execution looks straightforward. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.9375
                },
                {
                    "author_link": "https://gov.optimism.io/u/superman",
                    "index": "28",
                    "likes": "0",
                    "time": "01/08/2022-16:10:21",
                    "content": "This agreement really won my heart, and I hope to develop better and better. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/zeck",
                    "index": "29",
                    "likes": "0",
                    "time": "01/08/2022-16:11:05",
                    "content": "I think the values of acorss and Optimism are similar. Across the pursuit of extreme safety and low rates, which is optimism, which is also what Optimism strives for, and the two are culturally aligned, which is a great proposal. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.775
                },
                {
                    "author_link": "https://gov.optimism.io/u/a1144",
                    "index": "30",
                    "likes": "0",
                    "time": "01/08/2022-16:11:26",
                    "content": "Support, make the op ecology bigger and stronger ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/EL_PASO",
                    "index": "31",
                    "likes": "0",
                    "time": "01/08/2022-19:25:54",
                    "content": "Across is my favorite L1/L2 bridge. This proposal look good, definitely bring more volume to OP eco. Good for OP & Across. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.4
                },
                {
                    "author_link": "https://gov.optimism.io/u/fyr",
                    "index": "32",
                    "likes": "0",
                    "time": "02/08/2022-13:57:26",
                    "content": "totally agreed！ I like the proposal,  I believe it will also be beneficial to the ecology of Optimism! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/ruslanklinkov",
                    "index": "33",
                    "likes": "0",
                    "time": "03/08/2022-06:33:21",
                    "content": "hello Britt! I want to share this information with my community. If each of the lowers make a bridge for example Ethereum—>Optimism for $1000, how many rewards in OP and ACX tokens will they get? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/Shuangzzz",
                    "index": "34",
                    "likes": "0",
                    "time": "04/08/2022-04:13:48",
                    "content": "Great ! Support it! It is a good begining! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.6875
                },
                {
                    "author_link": "https://gov.optimism.io/u/britt",
                    "index": "35",
                    "likes": "3",
                    "time": "05/08/2022-21:58:29",
                    "content": "Hey @OPUser good question! It would be dynamic, so this question still applies, but we actually break it down in our UI to show 2 different types of fees - the gas fee and the bridge fee. And we’d be applying this to bridge fees rather than gas fees, so fluctuations in gas shouldn’t make an impact here. Here’s a link to where we discuss that in our docs, but the tl;dr is that the bridge fee isn’t reliant on network conditions. Instead, the bridge fee is based on liquidity pool utilization. We’d only expect to hand out crazy numbers of tokens if we were experiencing crazy numbers of transfers to OP - like 100s of millions in volume just to OP. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.699652777777778
                },
                {
                    "author_link": "https://gov.optimism.io/u/britt",
                    "index": "36",
                    "likes": "0",
                    "time": "05/08/2022-21:59:38",
                    "content": "I don’t actually have an immediate answer here for you, but I’ll check with the giga brains and get back to you! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/britt",
                    "index": "37",
                    "likes": "1",
                    "time": "05/08/2022-22:09:25",
                    "content": "Hi @Bobbay_StableLab I’ve asked the community to only participate with meaningful contributions - sorry for the excess noise! I will update the main post accordingly - thank you for that feedback. We do currently subsidize with $ACX for anyone using our referral link program (you can self refer). So this would be complementary to those efforts. I also agree that 1mm is a lot! I think one path forward could be to reduce that amount, but we might also consider adding in a second mechanism by which the tokens could be distributed. For example, our system relies on a network of relayers. If we were to incentivize relayers to operate on OP, that would serve a few purposes. It would make the bridge to OP able to support larger volumes, increase the security of the bridge, and encourage these parties to keep funds on OP rather than directing them elsewhere. I’m curious if you think this addition to the proposal would be well received? We’re pretty keen on getting creative with this grant, and using it to benefit as many of the users that exist in the Across+OP ecosystem as possible. So I’d be really happy to get any feedback on that! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.830555555555556
                },
                {
                    "author_link": "https://gov.optimism.io/u/millie",
                    "index": "38",
                    "likes": "4",
                    "time": "06/08/2022-00:55:33",
                    "content": "Well written proposal, thanks Britt! I think the proposal is well designed and I appreciate the fact that there will be matching incentives. Across has already integrated two versions of its bridging architecture with Optimism so that’s a bonus also. I do find the duration of the program to be long dated and the amount of $OP being requested is quite significant. I think however the length of the proposal and size of the $OP allocation is reasonable in light of the following facts:  Across will be matching incentives The bridge is already live Proposed distribution is very simple and predictable  With those points in mind, I would still suggest possibly shortening the proposal to a 6-9 month target length instead of 1 year, then propose a continuation/extension as the OP distribution gets close to finishing. I say this because it gives Optimism governance reassurance when a program brings successful results on shorter timeframes (indicating it’s effectiveness), after which projects can always propose a continuation/extension or even a whole new proposal, with a much higher likelihood of being approved a second time given previous positive results. I do not feel too strongly about this change however, and would still approve the proposal the way it is, if Across really feels a 1 year program is warranted. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.826754385964912
                },
                {
                    "author_link": "https://gov.optimism.io/u/Bobloblaw",
                    "index": "39",
                    "likes": "0",
                    "time": "06/08/2022-02:22:48",
                    "content": "Yes. Me likey. This is a great simple proposal for a great bridge. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.666666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/superman",
                    "index": "40",
                    "likes": "0",
                    "time": "06/08/2022-02:42:16",
                    "content": "The protocol is great, I love this, hope it will be better in the future. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/britt",
                    "index": "41",
                    "likes": "0",
                    "time": "06/08/2022-02:45:35",
                    "content": "That’s helpful feedback @millie, thanks! I’d be keen to hear your thoughts about also incentivizing [non-Risk Labs] relayers that operate on OP. It would benefit the Across ecosystem by diversifying our relayer network, and it would benefit OP by providing another incentive for folks to keep their funds on OP. With that in mind, it probably still makes sense to shorten the duration (and associated amount). But I’m wondering if you think that adds unnecessary complications to it, or if it makes it more well-rounded. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.583333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/Prometheus",
                    "index": "42",
                    "likes": "3",
                    "time": "06/08/2022-09:35:32",
                    "content": "    millie:  With those points in mind, I would still suggest possibly shortening the proposal to a 6-9 month target length instead of 1 year, then propose a continuation/extension as the OP distribution gets close to finishing. I say this because it gives Optimism governance reassurance when a program brings successful results on shorter timeframes (indicating it’s effectiveness), after which projects can always propose a continuation/extension or even a whole new proposal, with a much higher likelihood of being approved a second time given previous positive results.   This is the best approach and something I would like to see considered in all proposals. So far Across is doing well and I wouldn’t have many issues voting yes for the 1M token allocation but I definitely support a lower ask (with the adjusted time frame). It reduces risk for everyone and it will make the approval easier.     britt:  I’d be keen to hear your thoughts about also incentivizing [non-Risk Labs] relayers that operate on OP. It would benefit the Across ecosystem by diversifying our relayer network, and it would benefit OP by providing another incentive for folks to keep their funds on OP.   That’s the thing, with a smaller allocation and smaller time frame you could include this in the current proposal as an experiment or in the continuation/extension. I think the first proposal should focus on what gives more direct impact to users, what is easier to measure and evaluate. From there, the next proposal (continuation/extension) can include more complexity/diversity/changes considering the previous proposal effectiveness/impact. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.995310245310246
                },
                {
                    "author_link": "https://gov.optimism.io/u/millie",
                    "index": "43",
                    "likes": "1",
                    "time": "07/08/2022-12:14:05",
                    "content": "hey Britt, had a chance to think about it and I think incentivizing [non-Risk Labs] Relayers is a great idea, I just wonder how confident Across is in incentivizing the Relayer role permissionlessly at its current stage? IMO it would be make sense to allocate OP for Relayers once Across feels confident enough to begin directing ACX to [non-Risk Labs] relayers. From what I understand the Relayer role isn’t currently incentivized but there are plans to incentivize it in the future, I’d have no problem supporting OP incentives for relayers when ever Across thinks it’s time to permissionlessy incentivize that role! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.3203125
                },
                {
                    "author_link": "https://gov.optimism.io/u/vito",
                    "index": "44",
                    "likes": "0",
                    "time": "07/08/2022-13:47:10",
                    "content": "Love ACROSS!!! the first bridge I used in layer2 hope we can make it and it will feedback us  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.06640625
                },
                {
                    "author_link": "https://gov.optimism.io/u/vale",
                    "index": "45",
                    "likes": "6",
                    "time": "07/08/2022-16:04:49",
                    "content": "I propose to use 5% of that amount requested to rebate the fees spent by early OP-through-across bridgers(the fees would be rebated partially). I think it is always nice to reward true early users, and i think that 5% of the requested tokens is a fair amount. Elegibility: every users who bridged to optimism with across will have an $OP reward proportional to the fees spent. Applicable to everyone who performed such action before today 7th august 2022. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.825
                },
                {
                    "author_link": "https://gov.optimism.io/u/vale",
                    "index": "46",
                    "likes": "0",
                    "time": "07/08/2022-16:05:21",
                    "content": "please everyone feel free to comment and tell what you think of this  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/SEED_LATAM_Joxes",
                    "index": "47",
                    "likes": "0",
                    "time": "07/08/2022-19:38:32",
                    "content": "Hello @britt  glad to see this project here. My opinion about tokens requested + distribution looks a big ask if you only plan to cover this portion of fees mentioned. Reducing the amount to 400k can be more reasonable, at least you have some analysis about expected expenditures to share and discuss with us. Even don’t worry about reducing the time of distribution (let’s say, six months) we will happy to see the results after (in case of approval) and then reapply.     britt:  We aim to use the token to subsidize bridge fees for users that would like to transfer assets to Optimism. Currently, we support USDC, ETH, DAI, WBTC, and UMA.   (Suggestion) as we can see, there’s so many projects applying to Phase 1 and incentiving liquidity in so many assets, don’t you think it would be positive (this is the moment) to join an alliance with some other projects and thus increase the list of available tokens? Some I’d love to see stETH Rocket Pool, or Aave token, other stablecoins, etc. Let us know what do you think or if this makes sense. ",
                    "links": [
                        "https://gov.optimism.io/t/gf-phase-0-proposal-aave/1712/3"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 6.086647727272727
                },
                {
                    "author_link": "https://gov.optimism.io/u/mrmartins",
                    "index": "48",
                    "likes": "0",
                    "time": "08/08/2022-09:41:35",
                    "content": "I agree with this proposal. i saw different protocols asking to get share some OP for retroactive compensation. I suggest to read this https://blog.clipper.exchange/clippers-op-token-distribution-plan/; where the protocol allocate 10% for retroactive users and gas remborsment. Another protocol is this: https://gov.optimism.io/t/gf-phase-0-proposal-polynomial-protocol/1625 where they allocate 20%. I think it’s a good idea to increase to 10% the retroactive allocation for Across Protocol @britt ",
                    "links": [
                        "https://gov.optimism.io/t/gf-phase-0-proposal-polynomial-protocol/1625"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/britt",
                    "index": "49",
                    "likes": "4",
                    "time": "08/08/2022-15:23:04",
                    "content": "@SEED_LATAM_Joxes thanks for reading and providing feedback! I wanted to provide a little bit of context on what it takes to support a new token. It’s not super relevant to this proposal, but might be useful for anyone else wondering. tl;dr - we’re happy to add new tokens, but it requires a good amount of capital to do. When we support a new token, we have to make sure there are sufficient funds in the Hub pool to support the anticipated volume (without compromising the UX), AND at least 1 funded relayer on each supported chain to be able to support transfers. This is something we hope will become less of a barrier as more tokens are onboarded and more people start running relayers. . . . I’ll also use this as a chance to reply to @millie in regard to relayers  The code for relayers has been open source this whole time, and technically anyone could have spun up a relayer if they wanted to (so it’s not a permissioned role as it is in some other bridges). Risk Labs has been doing lots of work to make it easier and more profitable for folks to run a relayer, and we’re at the point now where we’d like to see people start trying it out. We have a few external relayers now, and are providing ongoing support to anyone interested in doing this. I’m happy to report that it’s been really smooth so far! In terms of ACX incentives for relayers, I’ll pass this feedback along for consideration, and thank you again for the feedback. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.108936588103255
                },
                {
                    "author_link": "https://gov.optimism.io/u/diman22",
                    "index": "50",
                    "likes": "0",
                    "time": "08/08/2022-15:29:24",
                    "content": " I m in. Its great ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/millie",
                    "index": "51",
                    "likes": "4",
                    "time": "08/08/2022-15:37:42",
                    "content": "No problem and yes you’re right the relayer is fully open source and any one could potentially relay their own transactions as well. The relayer role is an extremely important part of Across’s bridging architecture so I think it’s a great idea to incentivize relayers on Optimism. Relayer’s are basically responsible for making the bridging experience seamless for the end user and the more liquidity that relayers can support for fast bridging, the faster and smoother the UX for bridging to/from Optimism is. Fast bridging is vital for a rollup to gain mass adoption and allows for healthy arbitrage, so to sum things up, yes I would support this proposal if there was a carve out for Relayer incentives included in the pitch as well! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.542582417582418
                },
                {
                    "author_link": "https://gov.optimism.io/u/calman",
                    "index": "52",
                    "likes": "0",
                    "time": "09/08/2022-08:38:32",
                    "content": "I’d like to fully support to this proposal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/sabri",
                    "index": "53",
                    "likes": "0",
                    "time": "10/08/2022-14:10:03",
                    "content": "As an early optimism and across user i support this change on the initial proposal. I think it is a good way to reward early users an i do agree that a 5-10% is an okay amount. i’ve seen many other protocols(meanFi, perp,clipper, polynomial rewarding early users with a small percentage(5-10%) of their OP requested. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.0625
                },
                {
                    "author_link": "https://gov.optimism.io/u/jorah",
                    "index": "54",
                    "likes": "0",
                    "time": "10/08/2022-14:27:54",
                    "content": "i’m stepping stone to this @vale proposal, i hope it can be added into @britt original one. as said by other users, other protocols did the same, so it would be nice if we can do the same ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.604166666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/ScaleWeb3",
                    "index": "55",
                    "likes": "4",
                    "time": "11/08/2022-12:33:32",
                    "content": "Generally speaking, we don’t believe the most effective use of OP funds is giving large grants to 50+ bridge projects. (50 * 1Mio Op * 1.5$…) That said, we like the effective mechanism described (cost-covered onboarding) and we support the proposal - though a lower ask and potential refill would be more appropriate after evaluation of a trial. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.852678571428571
                },
                {
                    "author_link": "https://gov.optimism.io/u/peyo17",
                    "index": "56",
                    "likes": "0",
                    "time": "11/08/2022-16:23:50",
                    "content": "I agree with @vale! This is a great way to reward early users  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/Rocca",
                    "index": "57",
                    "likes": "1",
                    "time": "11/08/2022-19:45:25",
                    "content": "Yea cool idea. It’s always a good idea to reward easily users!! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.878472222222221
                },
                {
                    "author_link": "https://gov.optimism.io/u/Mukyo",
                    "index": "58",
                    "likes": "0",
                    "time": "12/08/2022-17:22:26",
                    "content": "Looks like a good proposal, hope it gets support. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/GinjaNinja",
                    "index": "59",
                    "likes": "0",
                    "time": "13/08/2022-19:06:50",
                    "content": "Sounds like a solid idea, I support it, it would definitely support the growth of Optimism. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Optimism2022",
                    "index": "60",
                    "likes": "0",
                    "time": "14/08/2022-05:37:13",
                    "content": "Call me anon but you guys really could use some good UI designers, where the heck is my vote button? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/Girellus",
                    "index": "61",
                    "likes": "1",
                    "time": "14/08/2022-14:17:41",
                    "content": "Really interesting and i want agree with this. I read few feedbacks that I approve:  OP for liquidity provider; OP for early users+retroactive reward around 10/15% (not more because after is too much).  I want add something new that it is related the Audit of the protocol. All we know about the exploits that happened, mostly related bridges; so what i wanna say is that i would push also in this direction doing a really good audit. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.659090909090909
                },
                {
                    "author_link": "https://gov.optimism.io/u/britt",
                    "index": "62",
                    "likes": "1",
                    "time": "15/08/2022-15:23:33",
                    "content": "Hey @Girellus thanks for the engagement! All of the smart contracts produced by Risk Labs (this includes everything by UMA and Across) are audited by OpenZeppelin. You can find the audit report for Across v2 right here This is a really good talking point, though, and worth further discussion. The most recent bridge hack (at the time of writing) was Nomad. We put out a tweet thread with more information on this exploit, and I’d encourage anyone with high-level questions to start there. The tl;dr is that the exploit was a result of a misconfiguration that was called out in an audit but not addressed. Importantly, it was not a weakness/vulnerability in the optimistic verification pattern that underlies both Across and Nomad. ",
                    "links": [
                        "https://twitter.com/AcrossProtocol/status/1554557868221014016?s=20&t=ipdCUtB5rVNjkYwXIsvEeQ"
                    ],
                    "GPT-discussion-categories": [
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.574999999999999
                },
                {
                    "author_link": "https://gov.optimism.io/u/millie",
                    "index": "63",
                    "likes": "1",
                    "time": "16/08/2022-12:45:01",
                    "content": "Hey @britt, I just wanted to follow up about your idea to potentially incentivize relayers for Optimism as part of the distribution plan for this proposal? I noticed you haven’t included it in the proposal body and just wanted to check to see if it’s still something you intend to include in the final version? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/igrkalina1",
                    "index": "64",
                    "likes": "0",
                    "time": "16/08/2022-15:33:29",
                    "content": "The right decision and approach , each participant will be given the opportunity to choose . ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.428571428571428
                },
                {
                    "author_link": "https://gov.optimism.io/u/SEED_LATAM_Joxes",
                    "index": "65",
                    "likes": "1",
                    "time": "21/08/2022-01:52:20",
                    "content": "Hi @britt !     britt:  we’re happy to add new tokens, but it requires a good amount of capital to do.   Yes, thanks to reaffirm these points, let me return to the point expressed later by ScaleWeb3 here:     ScaleWeb3:  Generally speaking, we don’t believe the most effective use of OP funds is giving large grants to 50+ bridge projects. (50 * 1Mio Op * 1.5$…)   It’s true that a situation may arise in which many bridge projects are already being funded and others are in search of that (6 already passed, and 2, including this one, in discussion). With this I mean that (and only my vision) the more bridges we should start to see some initiatives that seek to solve particular problems of this ecosystem; by example a simple one, dedicate themselves to specific tokens. For example withdrawal waiting 7 days is always a problem to attract liquidity from non-top tokens into Optimism, and perhaps a coordination with other protocols will allow them to add other tokens, if the problem is identified (by example, in this case see this DeFi protocol assigning some bridge incentives). Again this is just an open idea that I think is an interesting opportunity and I share with you and everyone here. For now, reducing amount would be appropriate, unless you want to share with us a more detailed spending plan or projected use.  I have seen that you have changed the proposal from Draft to Ready and I want to emphasize that the governance process is currently being revamped and an important point is a new template that projects will have to apply (it’s under discussion, so don’t make formal changes now and wait for their approval, but it’s good to keep an eye on it and be prepared). ",
                    "links": [
                        "https://gov.optimism.io/t/grant-proposal-template-v2/3233"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.291582698910285
                },
                {
                    "author_link": "https://gov.optimism.io/u/britt",
                    "index": "66",
                    "likes": "4",
                    "time": "21/08/2022-20:23:38",
                    "content": "Hey @millie - just wanted to let you know it is in there! See this section and the second half of this section. The tl;dr is this - 25% of tokens go towards non-RL relayers on OP at a roughly ~33% bonus to what they already receive as a relayer. @SEED_LATAM_Joxes I’ll tag you here as well since I think you may find this to be relevant. There are a couple of other points you mention that I’d like to briefly respond to. First, can you help me understand what additional detail you’d like to see in the existing plan? In my opinion, one of the strengths of this proposal is that it’s pretty straightforward about how these tokens will be used. Second, you mention that you’d like to see some initiatives that seek to solve particular problems in this ecosystem like onboarding more tokens. I completely agree with this sentiment. In fact, one of the other proposals we’re working on right now is one that would add BAL to Across. And while I believe these efforts are essential, I don’t see a particularly obvious tie-in that makes sense for a long-term initiative like this. Having said that, I would encourage voters here to do their research and make sure the protocols receiving these tokens are seeking to improve the ecosystem in more than one way. I believe that we are. I also believe that there are great opportunities ahead for collaborative grants. And finally, thank you for pointing out the updated template. I’ll keep an eye on it to see if it goes into effect during this voting cycle and update this proposal accordingly. ",
                    "links": [
                        "https://gov.optimism.io/t/ready-gf-phase-1-across-protocol/3163#how-will-the-op-tokens-be-distributed-5"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.85969387755102
                },
                {
                    "author_link": "https://gov.optimism.io/u/linda",
                    "index": "67",
                    "likes": "0",
                    "time": "24/08/2022-01:30:13",
                    "content": "Thanks for sharing this proposal. It’s straightforward and I like the token distribution to bridge users transferring assets to Optimism and relayers operating on Optimism. This seems great for Optimism ecosystem growth. However, the amount requested is quite high especially relative to many of the other approved proposals so would prefer the requested amount get reduced. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.364285714285715
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "68",
                    "likes": "0",
                    "time": "24/08/2022-20:56:05",
                    "content": "Thank you for your engagement here @britt . I have two suggestion, you might need to move the proposal to the newer template and post it on our discord temp-check channel. As a second point, I would like to echo others view on reducing the duration to 6 month. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/0xTrevor",
                    "index": "69",
                    "likes": "0",
                    "time": "29/08/2022-10:08:44",
                    "content": "Looks like a sound idea and the execution looks straightforward. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.9375
                },
                {
                    "author_link": "https://gov.optimism.io/u/taojin3",
                    "index": "70",
                    "likes": "0",
                    "time": "02/09/2022-09:20:46",
                    "content": "good news,and,exciting… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/vanzoo",
                    "index": "71",
                    "likes": "0",
                    "time": "25/10/2022-11:49:06",
                    "content": "I like the proposal, can be beneficial ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/memmedliruslan",
                    "index": "72",
                    "likes": "0",
                    "time": "06/01/2023-18:05:32",
                    "content": "IP address on the way to the way to the way to the way to the way to the way to the way  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/yaobi",
                    "index": "73",
                    "likes": "1",
                    "time": "07/01/2023-03:10:06",
                    "content": "I like the proposal, can be beneficial good ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/memmedliruslan",
                    "index": "74",
                    "likes": "0",
                    "time": "08/01/2023-19:22:50",
                    "content": "Fena değil. You on the guy ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Ethantoast",
                    "index": "75",
                    "likes": "1",
                    "time": "09/01/2023-08:19:25",
                    "content": "I have used Across a few times to Bridge to optimism and it has always been a smooth and fast experience. I think it also pops up with lifi when aggregating bridges. I believe that this request is reasonable but no the amount of OP requested. I think 200,000 OP at most would suffice or even a little less but 1,000,000 is just too much. Overall great community and team! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.969907407407407
                }
            ]
        }
    ],
    "group_index": "183"
}