{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/draft-gf-phase-1-proposal-marsbase/4974",
            "title": "[DRAFT][GF: Phase 1 Proposal] Marsbase ",
            "index": 4974,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Grants Council"
            ],
            "tags": [
                "cycle-10",
                "not-passed"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/GrantsOps",
                    "index": "1",
                    "likes": "1",
                    "time": "31/01/2023-23:21:44",
                    "content": "Project name: Vesting trading & defi OTC tool - Marsbase Author name and contact info (please provide a reliable point of contact for the project): Co-Founder, Product director & COO otcmarsbase.io - Isaulov Denis : https://www.linkedin.com/in/denis-isaulov-ba51b485/; @Marscolonizer I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: Yes I understand that I will be expected to following the public grant reporting requirements outlined here: Yes L2 recipient address: 0x63AF25Da4DbFC3bF96075ef162f3950B912e1266 Which Voting Cycle are you applying for?: Cycle 10 Which sub-committee should review your proposal? (Builders Grants, Growth Experiment Grants): Builders Grants Project description (please explain how your project works): MarsBase is the first decentralized cross chain OTC desk for illiquid DeFi assets and the secondary market for vested allocations trading. Already online in ERC-20 and BEP-20 chains.Features in prod- Best bid-auction orders, - Fractional deals with discount model to connect both whales and retails, - Zero deposit OTC ofeers - Direct (escrow) deals.Marsbase concentrates and aggregates liquidity of large orders of market & vested assets in one place through unique p2p trading tools. Using NFT to wrap SAFE & SAFT’s.Created by a need to solve dominant problems in the CEX and DEX markets and providing the opportunity to make OTC deals transparent, fast, cheap and secure. New entrants, professional traders and big funds often experience one of the following problems:* The complexity of OTC deals in terms of duration, cost and security * Complicated and lengthy onboarding in OTS* High Entry $ Barrier to OTC* OTC Only for TOP-30 CMC* Lack of liquidity & Price Slippage ( CEX / DEX )* Paper gain with vested tokens & no tool to solve it* Exit the project without dumping MarsBase creates the solutions for all these problems: * Smart contracts guarantee the safety of OTC at DEX swap speed with a minimal fee* Access to OTC for all types of investors * IDO Launchpad with asset price protection * Completely anonymous desk and easy ongoing process * Vesting trading availability - with our ANYVEST protocol it is possible to exit the project at any time with minimal risk and maximum profit  Website: https://otcmarsbase.io Twitter: https://twitter.com/MARSBASEio Discord/Discourse/Community: MARSBASE OTC Other relevant links (including any demos): Crypto OTC Marsbase - YouTubeAll useful links: MARSBASE | Twitter, Instagram, TikTok | Linktree Additional team member info (please link): Team: Nick Cote (CEO - Business developmnet) - Nick has been entrenched in the crypto space since 2012, joining the 1Broker / 1Fox team in 2013 and grew the CFD / to over 100,000 users. In 2015, he started and currently manages a primarily institutional focused OTC network for digital assets.https://www.linkedin.com/in/nick-cote-24a786a4/Austin Merricks (Co-Founder & IR) - Co-Founder at Magnus Capital, with over 50M AUM and a potfolio of 50+ companies. Over 5 years of experience in consulting and managing blockchain projects. Worked with BlockZero Labs (XIO Network) as one of the initial founding members.https://www.linkedin.com/in/austinmerricks/?originalSubdomain=caDenis Isaulov (Co-Founder, COO & Product owner) - Successfully brought to the market 3 different products for trading: Since 2016, have been actively working with new blockchain and cryptocurrencies.https://www.linkedin.com/in/denis-isaulov-ba51b485/Dmitry Radkovsky (Co-Founder & CTO) - 15 years of experience in IT. Worked at top-IT companies — Rambler&Co on Tech Lead positions. Previously CTO of Small Band Games, Kliro Interactive, Zebrain. 5 years as CTO of blockchain development of different DeFi protocols.Sign Up | LinkedInGarry Bell (Co-Founder & Main business development adviser) - Serial startup entrepreneur, Co-Founder of the Oracles blockchain platform, Co-Founder of Pulse, aUK-based fintech company, Founder of a successful DeFi automation platform, and also a winner of 5+ Blockchain Hackathons.https://www.linkedin.com/in/cryptogeorge/ Please link to any previous projects the team has meaningfully contributed to: Nick cote - Titans Finance, Molecule Protocol, Austin Merricks - Magnus Capital , BlockZero LabsGarry Bell - Oracles blockchain platform, Pulse, DeQuest, CyberFi LaunchpadDenis Isaulov - Nomiswap DEX, TokenplaceDmitry Radkovsky - Rambler&Co, Small Band Games, Kliro Interactive, Zebrain, Relevant usage metrics (TVL, transactions, volume, unique addresses, etc. Optimism metrics preferred; please link to public sources such as Dune Analytics, etc.): 1,4 mln OTC volume from start. 680 connected wallets while testnet, 20 active wallets while mainnet. 6000+ CM subscribers. Competitors, peers, or similar projects (please link): DeFiGiga swap - https://gigaswap.app/Cow swap - CoW Swap | The smartest way to trade cryptocurrenciesDexpools - https://dexpools.com/CeFiCoinbase OTC - https://www.coinbase.com/blog/announcing-new-features-and-services-to-make-trading-easier-for-high-volume-customers-in-asia-andBinance OTC - Торговля на Binance OTCGemini OTCOTC servicesCumberland - https://cumberland.io/Zerocap - https://zerocap.com/services/crypto-investment/otc/ Is/will this project be open sourced?: Yes Optimism native?: No Date of deployment/expected deployment on Optimism: 3/20/2023 What is the problem statement this proposal hopes to solve for the Optimism ecosystem?: We observe the OP ecosystem growing at lightspeed as more young projects and user guilds are joining it.However, we cannot ignore the fact that many projects struggle with low liquidity and high risks of panic sales as it can negatively affect the company ecosystem. It also brings stress to investors, founders, and the community.  How does your proposal offer a value proposition solving the above problem?: To protect the price of OP projects from volatility and panic selling, Marsbase suggests making large deals outside the CEX/DEX market. Unique PART mode of OTC deals allows selling bigger token volumes to many buyers at once by splitting the offer into parts. Traditional OTC auctions will help to find demand in the long-term market for large transactions.As well as projects launched in the presence of optimism and having vesting will be able to carry out safe trading of vested assets through our protocol. This will release more liquidity into the network Why will this solution be a source of growth for the Optimism ecosystem?: This is a smart decision whereby hundreds of thousands of investors will be able to save money on slippage, large whales will return liquidity faster from vesting, average retailers will be involved in OTC deals with dicsounta that were not available before, and all of liquidity will return to your ecosystem and will not just be lost due to lack of liquidity and dumps of projects that are in the vesting Has your project previously applied for an OP grant?: Тщ Number of OP tokens requested: 45000 ( OP ± $ 2 ) Did the project apply for or receive OP tokens through the Foundation Partner Fund?: No If OP tokens were requested from the Foundation Partner Fund, what was the amount?: - How much will your project match in co-incentives? (not required but recommended, when applicable): - How will the OP tokens be distributed? (please include % allocated to different initiatives such as user rewards/marketing/liquidity mining. Please also include a justification as to why each of these initiatives align with the problem statement this proposal is solving.): Dev salary - 40%OTC trading rewards (cashback from deals) - 30%OP + Marsbase Ambassador task center - 20%Vesting trading rewards for OP projects - 10% Over what period of time will the tokens be distributed for each initiative? Shorter timelines are preferable to longer timelines. Shorter timelines (on the order of weeks) allow teams to quickly demonstrate achievement of milestones, better facilitating additional grants via subsequent proposals: Dev salary - 3 months until we transfer contracts and mechanics to optimismOTC trading rewards - 1 mnthOP + Marsbase Ambassador task center - 1 mnthVesting trading rewards for OP projects - 2 mnth Please clearly define the milestones you expect to achieve in order to receive milestone based installments. Please consider how each milestone relates to incentivizing sustainable usage and liquidity on Optimism. Progress towards each milestone must be trackable: Already DonePart-deals auctions zero-collateralmarketplace notification system calculatorsStage 2 - START Q1-Q2 2023Stage 1 - Q1Marsbase OTC deals contracts megrating to OPOTC leaderboard for OP trading volumsStage 2 - Q2Vesting trading protocol also for OP projectsOTC Widget for B2B (OP) & OTC Why will incentivized users and liquidity on Optimism remain after incentives dry up?: Users will understand the value of OTC and vesting trading for themselves when trading medium and low-liquid assets in OP ecosystemYoung (OP) projects will be able to protect their community and market prices from dumps during manipulation and unlockingTherefore, we believe the tool will take root in the network Please provide any additional information that will facilitate accountability (smart contracts addresses relevant to the proposal, relevant organizational wallet addresses, etc.): MARSBASE · GitHubAbout Marsbase - MARSBASE Confirm you have read and agree to the Eligibility Restrictions (here): I have read the Eligibility Restrictions and agree to abide by their conditions ",
                    "links": [
                        "https://www.linkedin.com/in/denis-isaulov-ba51b485/",
                        "https://gov.optimism.io/t/suggested-public-reporting-requirements-for-grantees/4176",
                        "https://otcmarsbase.io",
                        "https://twitter.com/MARSBASEio",
                        "https://discord.com/invite/fKUFqgBBWF",
                        "https://www.youtube.com/channel/UCmtM-VPNiLLQljTEJAd0PHg",
                        "https://linktr.ee/MARSBASE",
                        "https://www.linkedin.com/in/nick-cote-24a786a4/",
                        "https://www.linkedin.com/in/austinmerricks/?originalSubdomain=ca",
                        "https://www.linkedin.com/in/denis-isaulov-ba51b485/",
                        "https://www.linkedin.com/mwlite/in/zlumer",
                        "https://www.linkedin.com/in/cryptogeorge/",
                        "https://gigaswap.app/",
                        "https://swap.cow.fi/#/1/swap/WETH",
                        "https://dexpools.com/",
                        "https://www.coinbase.com/blog/announcing-new-features-and-services-to-make-trading-easier-for-high-volume-customers-in-asia-and",
                        "https://www.binance.com/ru/OTC-Trading",
                        "https://cumberland.io/",
                        "https://zerocap.com/services/crypto-investment/otc/",
                        "https://github.com/otcmarsbase",
                        "https://otc-marsbase.gitbook.io/marsbase/general/about-marsbase",
                        "https://gov.optimism.io/t/grant-proposal-template/3233",
                        "https://gov.optimism.io/t/cycle-10-grant-review-roundup/5284"
                    ],
                    "GPT-summary": "The post is a proposal for a decentralized cross-chain OTC desk for illiquid DeFi assets and the secondary market for vested allocations trading. The author explains the project's features, team members, and usage metrics. A 3rd party gives entirely positive feedback on the proposal, extending to the proposal by suggesting that it will be a smart decision for hundreds of thousands of investors. The post also includes links to relevant websites and previous projects.",
                    "GPT-proposal-categories": [
                        "Token economics",
                        "Interoperability and Scalability",
                        "Grants, Funding and resource allocation",
                        "Law and regulations",
                        "Privacy, Security and risk management"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.644322254806125
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "2",
                    "likes": "2",
                    "time": "23/02/2023-13:38:58",
                    "content": "Hi, @Denis_Marsbase! I wanted to bring awareness of a new Milestone Assessment the Grants Council added. It is not mandatory for cycle 10 but you could get a better score on the final review if you implement it. Thank you for the team effort in this proposal! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.0606060606060606
                },
                {
                    "author_link": "https://gov.optimism.io/u/Denis_Marsbase",
                    "index": "3",
                    "likes": "0",
                    "time": "27/02/2023-16:28:06",
                    "content": "Benchmark Milestones 1st of April 2024 $ 80 000 000 low liquid OTC trading volume / month $ 20 000 000 SAFT trading volume / month 15000+ Active OTC traders ( wallets ) 150+ b2b clients ( VC, Private pools / Syndicate , Projects TOP-250 CMC, Liquidity provider pools) Critical Milestones ( every feature are using Smart contracts ) 4 types of OTC deals - done ( ERC / BSC )  4 OTC deals for OP ecosystem after successful grant support ( we need ± 2 month ) SAFT & vesting trading tool ( BSC / ERC / OP ) - in progress ( August-September ) Vesting NFT management tools ( BSC / ERC / OP ) ( September - November ) AMM integration ( BSC / ERC / OP ) ( September - October ) Fix price deal ( BSC / ERC / OP ) ( December ) All in one - OTC widget for projects ( BSC / ERC / OP ) ( December ) ! I also want to add that part of the allocated grant will go to smart contract audits ! Can this product be integrated to other projects and attract more devs? Yes, sure. To provide SAFT with trading, we intend to integrate with other protocols and DAO tools. We intend to collaborate with AMM, we have been negotiating since November with one of the largest aggregators. Let’s do the first integration. Do you have funds to run more than 1 year? Our Burn rate is 30k per month and our runway today is 5 months. We are also actively raising investments from VC and syndicates, and in March our runway should grow to 12-15 months. Looks like an enclosed projects with their own devs but no atractions for new At the moment, we are not attracting new ones, so as not to increase the burn rate. As soon as we receive additional funds, we will increase the development room to 5 people. Engages on community discussions? Today we are focused on business development and attracting clients for low liquidity and SAFT trading. In March, we are launching a promo campaign, leaderboard, airdrop and other mechanics that will allow us to involve more of the community in the new OTC trading tool. Every week 2-3 new tokens join us to form the secondary market. Such as XDAO, 8.Finance and others ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.806964736652237
                },
                {
                    "author_link": "https://gov.optimism.io/u/GrantsOps",
                    "index": "4",
                    "likes": "1",
                    "time": "28/02/2023-14:15:22",
                    "content": "Note the following update was sent by the candidate prior to the review deadline. @Gonna.eth @jackanorak @kaereste Benchmark Milestones 1st of April 2024 80 000 000 low liquid OTC trading volume / month 20 000 000 SAFT trading volume / month 15000+ Active OTC traders ( wallets ) 150+ b2b clients ( VC, Private pools / Syndicators , Projects TOP-250 CMC, Liquidity provider pools) Critical Milestones ( every feature are using Smart contracts ) 4 types of OTC deals - done ( ERC / BSC ) 4 types of OTC deals for OP ecosystem after successful grant support ( we need ± 2 month ) SAFT & vesting trading tool ( BSC / ERC / OP ) - in progress ( August-September ) Vesting NFT management tools ( BSC / ERC / OP ) ( September - November ) AMM integration ( BSC / ERC / OP ) ( September - October ) Fix price deal ( BSC / ERC / OP ) ( December ) All in one - OTC widget for projects ( BSC / ERC / OP ) ( December ) ! I also want to add that part of the allocated grant will go to smart contract audits ! Can this product be integrated to other projects and attract more devs? Yes, sure. To provide SAFT with trading, we intend to integrate with other protocols and DAO tools. We intend to collaborate with AMM, we have been negotiating since November with one of the largest aggregators. Let’s do the first integration. Do you have funds to run more than 1 year? Our Burn rate is 30k per month and our runway today is 5 months. We are also actively raising investments from VC and syndicates, and in March our runway should grow to 12-15 months. Looks like an enclosed projects with their own devs but no atractions for new At the moment, we are not attracting new ones, so as not to increase the burn rate. As soon as we receive additional funds, we will increase the development room to 5 people. Engages on community discussions? Today we are focused on business development and attracting clients for low liquidity and SAFT trading. In March, we are launching a promo campaign, leaderboard, airdrop and other mechanics that will allow us to involve more of the community in the new OTC trading tool. Every week 2-3 new tokens join us to form the secondary market. Such as XDAO, 8.Finance and others ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.744890526140526
                },
                {
                    "author_link": "https://gov.optimism.io/u/Denis_Marsbase",
                    "index": "5",
                    "likes": "1",
                    "time": "01/03/2023-16:45:04",
                    "content": "Benchmark Milestones 1st of April 2024 100 000 000 low liquid OTC trading volume / month 20 000 000 SAFT trading volume / month 15000+ Active OTC traders ( wallets ) 150+ b2b clients ( VC, Private pools / Syndicators , Projects TOP-250 CMC, Liquidity provider pools) Critical Milestones ( every feature are using Smart contracts ) OTC deals - done ( ERC / BSC ) OTC deals - 4 OTC deals for OP ecosystem after successful grant support ( we need ± 1,5 month ) SAFT & vesting trading tool ( BSC / ERC / OP ) - in progress ( August-September ) Vesting NFT management tools ( BSC / ERC / OP ) ( September - November ) AMM integration ( BSC / ERC / OP ) ( September - October ) Fix price deal ( BSC / ERC / OP ) ( December ) All in one - OTC widget for projects ( BSC / ERC / OP ) ( December ) ! I also want to add that part of the allocated grant will go to smart contract audits ! Can this product be integrated to other projects and attract more devs? Yes, sure. To provide SAFT with trading, we intend to integrate with other protocols and DAO tools. We intend to collaborate with AMM, we have been negotiating since November with one of the largest aggregators. Let’s do the first integration. Do you have funds to run more than 1 year? Our Burn rate is 30k per month and our runway today is 5 months. We are also actively raising investments from VC and syndicates, and in March our runway should grow to 12-15 months. Looks like an enclosed projects with their own devs but no atractions for new At the moment, we are not attracting new ones, so as not to increase the burn rate. As soon as we receive additional funds, we will increase the development room to 5 people. Engages on community discussions? Today we are focused on business development and attracting clients for low liquidity and SAFT trading. In March, we are launching a promo campaign, leaderboard, airdrop and other mechanics that will allow us to involve more of the community in the new OTC trading tool. Every week 2-3 new tokens join us to form the secondary market. Such as XDAO, 8.Finance and others ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.806964736652237
                }
            ]
        }
    ],
    "group_index": "471"
}