{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/gf-phase-1-proposal-tiny-dino-show-optimism/4914",
            "title": "[GF: Phase 1 Proposal] Tiny Dino Show - Optimism ",
            "index": 4914,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Grants Council"
            ],
            "tags": [
                "cycle-10",
                "not-passed"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/hollow",
                    "index": "1",
                    "likes": "2",
                    "time": "31/01/2023-00:57:34",
                    "content": "Project name: Tiny Dino Show - Optimism Author name and contact info (please provide a reliable point of contact for the project): hollowcapital@gmail.com, https://twitter.com/hollowcapital I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: Yes I understand that I will be expected to following the public grant reporting requirements outlined here: Yes L2 recipient address: 0xAFDAF4C0fb1c0d025F81E4707C1b123c9a620aB9 Which Voting Cycle are you applying for?: Cycle 10 Which sub-committee should review your proposal? (Builders Grants, Growth Experiment Grants): Growth Experiment Grants Project description (please explain how your project works): The “Tiny Dino Show” is an NFT-based animated story aimed at kids and young adults. The Tiny Dinos NFTs are the main characters in the show, and together they are on a mission to save our planet from global warming. Tiny dinos were one of the first projects (second to Gh0stly Gh0sts) minted across seven chains and can be traversed from Optimism to Ethereum and back thanks to Layer Zero. Not only there are Genesis tiny dinos that were minted on Optimism, but there were also three event collections with Summer 2022, Halloween 2022, and Winter 2022 one-way traversals, with Optimism being one of the cost-friendly networks. The Tiny Dino Show is an independent, community project utilizing the power of #cc0 licensing of the Tiny Dinos NFT and bringing our audience new perspectives on the world of living green, loving the planet, and exploring novel ways of generating, storing, and transporting clean energy.In January 2023, we won a 2ETH Prop House round sponsored by the Tiny Dinos and launched a JuiceBox campaign for the rest of the funding that is needed for the production of Season 1 and beyond. Our soft goal is 10ETH, and with this first contribution, we can start the pre-production process, and will be looking to include Optimism in our show material.The mission of the Tiny Dino Show is aligned with Optimism’s ethos for creating public goods and educating about ways of creating a sustainable future. The Tiny Dinos is a perfect way for the Optimism Collective to highlight its provenance and involvement in the NFT space. Website: https://www.notion.so/TINY-DINO-SHOW-0126ffb9a7e64b7a8c10c0cb9b7ab2df Twitter: https://twitter.com/hollowcapital Discord/Discourse/Community: Other relevant links (including any demos): Premier of the Pilot Immersive Experience: The Tiny CinemaWatch Tiny Dino Show Pilot on YouTube: Tiny Dino Show - YouTubeTiny Dinos NFT Official Website: https://tinydinos.funOpen Sea Tiny Dinos Genesis - Optimism: https://opensea.io/collection/tiny-dinos-optimism Additional team member info (please link): Written by: https://twitter.com/TishaWandersAnimation by: https://twitter.com/DaBoomDaBipProduced by: https://twitter.com/hollowcapital Please link to any previous projects the team has meaningfully contributed to: As a team we contributed to tiny dinos since September of 2022, please read our unique formation history here: https://twitter.com/hollowcapital/status/1613633914932985857 Relevant usage metrics (TVL, transactions, volume, unique addresses, etc. Optimism metrics preferred; please link to public sources such as Dune Analytics, etc.): Tiny Dinos on Open Sea with 4,000 ETH + volume:https://opensea.io/collection/tiny-dinos-ethTiny Dinos NFT Genesis contract on Optimism with active traversal history:tiny dinos (dino) Token Tracker | Optimism Competitors, peers, or similar projects (please link): Claynosaurz: Solana-based, making animated PFPs and working on a 3d animated movie, though the storyline is unclear and the IP is guarded by the creators. https://twitter.com/Claynosaurz/status/1611383567174537216Atrium X Nouns - A Lore Experiment: recently won 20ETH to produce a 2-minute pilot for a 3d animated movie. We are in contact with Atrium as a studio for professional help or a potential partner. Together with the Nouns they support the same ethos of building public goods.Nouns DAOThere are other examples of the networks like Polygon breaking into NFTs, and NFT brands like Doodles breaking into video production by purchasing an animation studio: The Block: Doodles to buy animation studio Golden Wolf: Billboard. The Tiny Dino Show is the OG in the omnichain space, based on free IP thanks to cc0, and is much lighter and quicker in production because of the focus on storytelling and using the original 2d cartoon images with professional voices. Is/will this project be open sourced?: Yes Optimism native?: Yes Date of deployment/expected deployment on Optimism: 4/5/2022 What is the problem statement this proposal hopes to solve for the Optimism ecosystem?: There are no existing NFT projects that are aligned with the Optimism ethos as much as tiny Dinos. Optimism has limited NFT exposure and limited educational video exposure. How does your proposal offer a value proposition solving the above problem?: The production of the Season 1 of the “Tiny Dino Show” could be sponsored by the Optimism Collective with complete Episodes delivered and auctioned (optional). By contributing to the show, the Optimism Collective is supporting the creators in the two most innovative areas currently for the NFTs: omnichain and cc0. Why will this solution be a source of growth for the Optimism ecosystem?: The growing popularity of omnichain and NFTs will bring more use cases for cost-efficient chains such as Optimism, whether it is for governance, gaming, or finance. Has your project previously applied for an OP grant?: No Number of OP tokens requested: 10,000 OP Did the project apply for or receive OP tokens through the Foundation Partner Fund?: No If OP tokens were requested from the Foundation Partner Fund, what was the amount?: n/a How much will your project match in co-incentives? (not required but recommended, when applicable): n/a How will the OP tokens be distributed? (please include % allocated to different initiatives such as user rewards/marketing/liquidity mining. Please also include a justification as to why each of these initiatives align with the problem statement this proposal is solving.): The OP grant would be distributed based on wallet eligibility, which could be determined by the proof of interaction with our JuiceBox smart contract. There can be a fixed or floating number of tokens or eligible wallets, such that there’s no correlation to ETH value of donations, or the Show NFTs, or the $TDS tokens. With this grant, the Tiny Dino Show will further proliferate the use of Optimism network for Tiny Dinos and will shine the spot light on the ethos of both projects, and increase in network usage/ value retained. Over what period of time will the tokens be distributed for each initiative? Shorter timelines are preferable to longer timelines. Shorter timelines (on the order of weeks) allow teams to quickly demonstrate achievement of milestones, better facilitating additional grants via subsequent proposals: We are running the JuiceBox campaign for the production of Season 1 of the Show and propose launching a 30-day cycle where the donators to the campaign can become eligible for OP token reward. Additionally, we wanted to propose using 80% of the OP tokens reserved for eligible wallets (those who donate to the campaign), and 20% for the Optimism Tiny Dino NFT holders - thus providing an incentive to lock the value on the Optimism network after the traversal. Disclosures: The donators are incentivized with the $TDS tokens, and get NFT posters as a reward for their ETH contributions - there is a closed loop within Ethereum network. The Show production team would not be incentivized by OP tokens or the grant, nor would it make the team members eligible for future distribution. Please clearly define the milestones you expect to achieve in order to receive milestone based installments. Please consider how each milestone relates to incentivizing sustainable usage and liquidity on Optimism. Progress towards each milestone must be trackable:  Pre-production - 1 month, Starting Feb Social media OP partnership announcement, promotions and show collection giveaways. JuiceBox - Tiny Dino Show - Optimism campaign, Feb - March 30-day cycle for the Show donations. Release - May/ June 2023  Why will incentivized users and liquidity on Optimism remain after incentives dry up?: Optimism Tiny Dino NFT holders will be eligible for 20% of the grant, which would serve as an incentive to keep the dinos on Optimism chain after traversing, apart from other benefits, such as transaction cost, and supporting the mission of the project. NFT marketplaces are working to bring together the collections that originate on Layer Zero and offer omnichain assets. For example, the Tiny Dinos NFT consists of 3 collections across 7 chains, which fragments the liquidity into 21 separate markets. With the Pudgy Penguins jumping the gun on omnichain, the Open Sea is rushing to create an interface that combines all omnichain collections and will hopefully bring more liquidity to other chains like Optimism. Please provide any additional information that will facilitate accountability (smart contracts addresses relevant to the proposal, relevant organizational wallet addresses, etc.): The Tiny Dino Show is using Tiny Dino Show | Juicebox for its treasury and as a way to reward those who donate to the show. The deployer wallet (0xAFDAF4C0fb1c0d025F81E4707C1b123c9a620aB9) for that contract holds tinydinoshow.eth which resolves to the Tiny Dino Show Treasury multi-sig: 0x2F63e9c5f1927B103a5a085133A17C711Ab20b18The Tiny Dino Show Treasury also holds several show assets - the NFTs that are used in the show as characters or in production like sounds and graphics.https://opensea.io/0x2F63e9c5f1927B103a5a085133A17C711Ab20b18 Confirm you have read and agree to the Eligibility Restrictions (here): I have read the Eligibility Restrictions and agree to abide by their conditions ",
                    "links": [
                        "https://gov.optimism.io/t/suggested-public-reporting-requirements-for-grantees/4176",
                        "https://www.notion.so/TINY-DINO-SHOW-0126ffb9a7e64b7a8c10c0cb9b7ab2df",
                        "https://twitter.com/hollowcapital",
                        "https://oncyber.io/thetinycinema",
                        "https://youtube.com/@tinydinoshow",
                        "https://tinydinos.fun",
                        "https://opensea.io/collection/tiny-dinos-optimism",
                        "https://twitter.com/TishaWanders",
                        "https://twitter.com/DaBoomDaBip",
                        "https://twitter.com/hollowcapital",
                        "https://twitter.com/hollowcapital/status/1613633914932985857",
                        "https://opensea.io/collection/tiny-dinos-eth",
                        "https://optimistic.etherscan.io/token/0xaaeef52ad4695b8e3b758215ca6bbca4d7680c62",
                        "https://twitter.com/Claynosaurz/status/1611383567174537216",
                        "https://nouns.wtf/vote/195",
                        "https://www.theblock.co/post/204596/doodles-to-buy-animation-studio-golden-wolf-billboard",
                        "https://juicebox.money/@tinydinoshow",
                        "https://opensea.io/0x2F63e9c5f1927B103a5a085133A17C711Ab20b18",
                        "https://gov.optimism.io/t/grant-proposal-template/3233"
                    ],
                    "GPT-summary": "The post is a proposal for a project called \"Tiny Dino Show - Optimism,\" which is an NFT-based animated story aimed at kids and young adults. The proposal explains how the project works, its alignment with Optimism's ethos, and how it offers a value proposition to the Optimism ecosystem. The post also includes links to relevant websites and metrics, as well as information on team members and milestones. A 3rd party gives entirely positive feedback on the proposal, extending to the project, and advertising it.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Smart contract updates",
                        "Interoperability and Scaleability",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.445497652065448
                },
                {
                    "author_link": "https://gov.optimism.io/u/hollow",
                    "index": "2",
                    "likes": "1",
                    "time": "31/01/2023-03:39:17",
                    "content": "Hi everyone, This is hollow and I am the show producer. We are working toward a path for the NFT communities to explore Optimism network and the incentives it provides for the NFT creators and collectors, such as low cost and public goods ethos. Through interactive videos and educational content, we can kick off the production with dedicating the first season to Optimism, aside from the main storyline of saving this green-blue planet from the global warming. If you want to support what we do - give us a follow, and please don’t hesitate to ask questions in this forum!  Tiny Dino Show crew  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party advertising proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.314814814814815
                },
                {
                    "author_link": "https://gov.optimism.io/u/hollow",
                    "index": "3",
                    "likes": "1",
                    "time": "31/01/2023-20:22:54",
                    "content": "Hello, we wanted to follow up with the Application and add an update: From what we heard on the call for Season 3, we understood that the OP tokens from the grant would be locked for 1 year. With that in mind, we would like to update the Use of Proceeds to incentive distribution: we have a JuiceBox campaign that has a soft target of 10 ETH, with 8 ETH remaining after the Prop House award. We will run an INCENTIVE program and MATCH the donations with OP tokens. Similar to how the $TDS (Tiny Dino Show) tokens for the contributors will be locked up for a certain period of time. Please reach out to more questions, and we would be happy to amend our application. Thanks! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.331632653061225
                },
                {
                    "author_link": "https://gov.optimism.io/u/cinna",
                    "index": "4",
                    "likes": "1",
                    "time": "31/01/2023-23:30:42",
                    "content": "Great proposal Hollow. Would love to see it pass and be implemented. It’d be a very interesting development to come from this ecosystem if it gets the funding. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party is advertising proposal"
                    ],
                    "Sentiment": 7.3125
                },
                {
                    "author_link": "https://gov.optimism.io/u/hollow",
                    "index": "5",
                    "likes": "0",
                    "time": "31/01/2023-23:36:40",
                    "content": "Thanks, Cinna. The Optimism ethos is very much aligned with the Tiny Dino Show, and Tiny Dinos NFT are no stranger to Optimism. I traversed to OP in Halloween and Winter collections to save on the cost. We have 7 chains, and could produce Season 1 sponsored by Optimism (incentivized). Contribute to the Show production on JuiceBox - and receive the OP incentive for the future. Win - win if you ask me! Update on the incentive structure: Donate to the Show campaign on JuiceBox, and Optimism will match that donation with OP tokens (equivalent of 8 ETH soft target), that will be locked for 1 year. The donator will also be rewarded with the official Show posters (NFT) and $TDS tokens. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 6.475
                },
                {
                    "author_link": "https://gov.optimism.io/u/MattL",
                    "index": "6",
                    "likes": "1",
                    "time": "02/02/2023-04:45:38",
                    "content": "    GrantsOps:  Token distribution for 6,000 OP, please note those are the estimates at best: Writer 20%, Art Director 20%, Producer 20%, Post-Production 20%, Socials 20%. Please note, that the team members also own show assets, at least the 3 main characters in the show, and are in alignment with the nature of this experiment. We would be looking to acquire additional assets for the new characters in the show, that can be held in Show Treasury.   There is currently a prohibition on selling of OP tokens by grantees. I am personally of the view that this should be rescinded, but while this is still in place, Governance Fund grants can’t be used to offset expenses directly by selling – in this case, you’ve listed salaries/payments to different contributors, which would be expected to be sold by these individuals.  image1452×486 150 KB  I recommend revising the grant application to exclude activities that require direct funding through selling OP or clarifying their use. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party advertising proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.774104683195592
                },
                {
                    "author_link": "https://gov.optimism.io/u/FractalVisions",
                    "index": "7",
                    "likes": "0",
                    "time": "02/02/2023-05:09:36",
                    "content": "Unfortunately the token distribution here does not seem to be appropriate for the usage of the funds on a growth experiments grant. It seems like there are some developer funds that are needed for this project and this is not the right type of proposal to apply for if that is the case. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.476190476190476
                },
                {
                    "author_link": "https://gov.optimism.io/u/hollow",
                    "index": "9",
                    "likes": "0",
                    "time": "02/02/2023-05:13:22",
                    "content": "how can we update the application? i tried leaving the comment were we wanted to change the use of funds to an incentive structure ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/hollow",
                    "index": "10",
                    "likes": "0",
                    "time": "02/02/2023-05:15:55",
                    "content": "Update on the incentive structure: Those who donate to the Show campaign on JuiceBox, will be eligible for OP tokens (equivalent of 8 ETH soft target), that will be locked for 1 year. The donator will also be rewarded with the official Show posters (NFTs) and $TDS tokens. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party is advertising proposal"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/FractalVisions",
                    "index": "11",
                    "likes": "0",
                    "time": "02/02/2023-05:20:26",
                    "content": "“Token distribution for 6,000 OP, please note those are the estimates at best: Writer 20%, Art Director 20%, Producer 20%, Post-Production 20%, Socials 20%. Please note, that the team members also own show assets, at least the 3 main characters in the show, and are in alignment with the nature of this experiment.” This is the section that I am referring to as it shows there is some distribution in the form of payments to team members for development related work. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.466666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/hollow",
                    "index": "12",
                    "likes": "0",
                    "time": "02/02/2023-05:25:37",
                    "content": "To be clear, we are not looking to use OP tokens or sell OP for operations. We have a transparent JuiceBox smart contract for the treasury and ETH donations, and we can only accept ETH to use for the operations. What we wanted to offer is using the OP grant as a rebate for the contributors, calculated based on the value of the ETH contributed. We will have the list of addresses of contributors on JuiceBox, and this way the foundation will know how many contracts are eligible. Lastly, the use of funds indicated was before we listened to the space on twitter explaining the lock-up and wanted to update that section, which reflects the use of ETH if we are successful in running the Optimism sponsored Season 1 of the Show. Thank you for reviewing! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party advertising proposal"
                    ],
                    "Sentiment": 6.459821428571429
                },
                {
                    "author_link": "https://gov.optimism.io/u/hollow",
                    "index": "13",
                    "likes": "0",
                    "time": "02/02/2023-05:30:43",
                    "content": "    hollow:  We will run an INCENTIVE program and MATCH the donations with OP tokens. Similar to how the $TDS (Tiny Dino Show) tokens for the contributors will be locked up for a certain period of time. Please reach out to more questions, and we would be happy to amend our application. Thanks!   I was looking for a way to edit the application and add this ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.188775510204082
                },
                {
                    "author_link": "https://gov.optimism.io/u/MattL",
                    "index": "14",
                    "likes": "1",
                    "time": "02/02/2023-06:18:30",
                    "content": "Hey @danelund.eth would you say the best path to editing the proposal would be to work with you on the edits or would another path be better? Only because this proposal was posted by @GrantsOps, which complicates the editing process. @hollow  - Regarding the below, I do not think this is enough of a separation to say this isn’t a direct payment, as you’re effectively exchanging donations for OP tokens, which will most likely lead to sale anyway. I appreciate it as a creative solution, though I do not want to give you false hope here – so it’d be best to have the Optimism Foundation provide further context. CCing @lavande     hollow:  We will run an INCENTIVE program and MATCH the donations with OP tokens. Similar to how the $TDS (Tiny Dino Show) tokens for the contributors will be locked up for a certain period of time. Please reach out to more questions, and we would be happy to amend our application. Thanks!   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.3410714285714285
                },
                {
                    "author_link": "https://gov.optimism.io/u/hollow",
                    "index": "15",
                    "likes": "0",
                    "time": "02/02/2023-07:27:53",
                    "content": "Thank you! The way we see it, there are already assets held in Show Treasury, such as Tiny Dino NFTs which can be traversed to Optimism. We plan on acquiring more assets for the Season’s production and could traverse the entire character set into Optimism, thus locking more value on the network. This could be the direct use for overflow funds, i.e. the funds that are contributed over the target of ~10ETH (based on the number of limited NFT posters for Season 1). To address the separation and future sale concerns: with JuiceBox, our own ERC-20 token eligibility is determined at a fixed rate of X/per 1 ETH, subject to change. $TDS tokens are given as a co-incentive (same as NFTs), but will not be available for transfer until we actually mint tokens and enable the claim feature. The way we see $OP tokens is as a co-incentive similar to $TDS, and we could determine the rate of distribution – be it a fixed rate with minimum ETH contribution (same as NFTs), or based on the % of the total pool contributed to the Show during the 30-day cycle. As far as the sales go, we can only hope that contributors who support the “Tiny Dino Show” will enjoy their experience and keep supporting the network after OP tokens are unlocked, maybe even used to purchase more dinos on Optimism! Finished video product(s), as well as promotional materials can be produced and actioned as NFTs on Optimism, as there are other ways to keep the value locked on the network and providing liquidity for the market. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party advertising proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.689980158730159
                },
                {
                    "author_link": "https://gov.optimism.io/u/MattL",
                    "index": "16",
                    "likes": "0",
                    "time": "02/02/2023-16:33:23",
                    "content": "Hey Hollow. I spoke to @danelund.eth - We’ve agreed that the best path to editing is to include your edits in the comments which will allow the grants council to separate changes from the original post. Still though - I expect token distributions to contributors as a salary can be reasonably expected to be thought of as a salary. But any other sort of experimentation could be thought of otherwise. I look forward to the edits! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 6.018749999999999
                },
                {
                    "author_link": "https://gov.optimism.io/u/hollow",
                    "index": "17",
                    "likes": "1",
                    "time": "02/02/2023-17:05:42",
                    "content": "    MattL:  token distributions to contributors as a salary can be reasonably expected to be thought of as a salary.   The donations to the Show, or ETH contributions, are without an expectation of profit and should not  be considered contracts for income, or interest earned, and they are marked as “donations” on JuiceBox. The ETH funds derived from the donations are used for the production, which includes the salaries of the crew. The Donators are incentivized with the $TDS tokens, and get NFT posters as a reward for their ETH contributions - there is a closed loop within Ethereum network. The Show production team would not be incentivized by OP tokens or the grant, nor would it make the team members eligible for future distribution. The OP grant would be distributed based on wallet eligibility, which could be determined by the proof of interaction with our JuiceBox smart contract. There can be a fixed or floating number of tokens or eligible wallets, such that there’s no correlation to ETH value of donations, or the Show NFTs, or the $TDS tokens. This experiment can be viewed as Optimism making a product placement, and those who donate (contribute) to the show campaign will be rewarded by the Optimism Collective for their support, and without an expectation of profit. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party advertising proposal"
                    ],
                    "Sentiment": 5.153061224489796
                },
                {
                    "author_link": "https://gov.optimism.io/u/MattL",
                    "index": "18",
                    "likes": "1",
                    "time": "02/02/2023-17:32:17",
                    "content": "Got it, I’d highly recommend adding this language to the proposal just to make sure that’s clarified for the grants council! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.9625
                },
                {
                    "author_link": "https://gov.optimism.io/u/hollow",
                    "index": "19",
                    "likes": "0",
                    "time": "02/02/2023-19:38:29",
                    "content": "@lavande can you give me ownership of this application post? ty ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/MattL",
                    "index": "20",
                    "likes": "2",
                    "time": "03/02/2023-16:22:14",
                    "content": "Hey Hollow, please make tag me once edits have been made so it’s possible to make another round of review. Thanks! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.9375
                },
                {
                    "author_link": "https://gov.optimism.io/u/hollow",
                    "index": "21",
                    "likes": "1",
                    "time": "06/02/2023-15:36:51",
                    "content": "@MattL @FractalVisions hello, I sent an request for edit function before the weekend, and still do not have access to edit this post. @lavande could you please grant me access? Thank you! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/FractalVisions",
                    "index": "22",
                    "likes": "0",
                    "time": "06/02/2023-15:48:31",
                    "content": "Please add the edit here in the comments to start off and someone with permissions will help you. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/hollow",
                    "index": "23",
                    "likes": "1",
                    "time": "06/02/2023-16:54:33",
                    "content": "@MattL @FractalVisions thank you! I was able to make edits thanks to @lavande Our proposal is ready for another round of review, thanks! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.949999999999999
                },
                {
                    "author_link": "https://gov.optimism.io/u/hollow",
                    "index": "24",
                    "likes": "1",
                    "time": "01/03/2023-15:56:02",
                    "content": "Hello, we wanted to check in on the status of the proposal and see if we need to update our application. Please advise. Side note: the tiny dinos NFT also release a limited collection of ordinals tiny dinos | bringing fun, vibes and innovation to the nft community and have been holding traversal competitions for giveaways - you might see the traversals in the tiny dinos OP contract. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party is advertising proposal"
                    ],
                    "Sentiment": 5.2285714285714295
                },
                {
                    "author_link": "https://gov.optimism.io/u/FractalVisions",
                    "index": "25",
                    "likes": "0",
                    "time": "01/03/2023-16:35:05",
                    "content": "Here is the results from the last cycle.    Cycle 10 Grant Review Roundup Grants       The Grants Council congratulates 31 proposers for reaching the Cycle 10 Final Review.  Over the next two weeks, these proposals will be assessed by each reviewer in the relevant Sub-Committee (Growth Experiments or Builders). Each reviewer will review each proposal and assign a score based on the Sub-Committee’s rubric. Proposals will be ranked based on the average of the reviewer scores in order to guide the Council’s determination of grant recipients. Reviewers will reach out to proposers duri…     Seeing as how Ordinals is on a proof of work chain which is not environmentally friendly that takes away from the alignment of the vision and mission here on Optimism. We love our planet. That also takes away from the native ecosystem deployment that you had answered yes on in the application. Unfortunately this doesn’t give any advantage to applications for grants and I don’t suggest trying to promote other blockchain projects in the OP Gov forum. Remember to follow the ethos of impact over profit and you can never go wrong. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party or author is advertising proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/hollow",
                    "index": "26",
                    "likes": "1",
                    "time": "01/03/2023-18:29:19",
                    "content": "    FractalVisions:  Seeing as how Ordinals is on a proof of work chain which is not environmentally friendly that takes away from the alignment of the vision and mission here on Optimism. We love our planet.   This is exact type of misinformation we wanted to debunk with our show. Good luck with your pledge! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 7.5
                }
            ]
        }
    ],
    "group_index": "454"
}