{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/gf-phase-1-proposal-rubicon/5068",
            "title": "[GF: Phase 1 Proposal] Rubicon ",
            "index": 5068,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Grants Council"
            ],
            "tags": [
                "cycle-10",
                "passed"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/forrest",
                    "index": "1",
                    "likes": "7",
                    "time": "02/02/2023-17:02:37",
                    "content": "Project name: Rubicon Author name and contact info (please provide a reliable point of contact for the project): Forrest Norwood (TG: @forrestn), Denver Baumgartner (TG: @denverba), Benjamin Hughes (TG: @benjamindefi) I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: Yes I understand that I will be expected to following the public grant reporting requirements outlined here: Yes L2 recipient address: 0x3204AC6F848e05557c6c7876E09059882e07962F Which Voting Cycle are you applying for?: Season 3 Cycle 10 Which sub-committee should review your proposal? (Builders Grants, Growth Experiment Grants): Growth Experiment Grants Project description (please explain how your project works): Rubicon is an order book protocol built on Ethereum L2 networks. The order book contract implements fully on-chain order books and a matching engine for peer-to-peer trading of ERC-20 tokens. The contract uses an escrow model for liquidity; when a limit order is placed on the book, those tokens are sent to the contract. If/when an order is filled, the contract matches the traders directly and the tokens are sent to each party. A router contract allows for token swaps across multiple order books.Rubicon v1 liquidity pools enable passive LPs to lend tokens to active market makers in exchange for a share of market making yield. In Rubicon V2, these liquidity pools will be similar to traditional lending protocols and our current functionality will be deprecated, enabling seamless spot margin lending/borrowing on the protocol via over-collateralized lending. The liquidity incentives outlined in this proposal would only go to the V2 liquidity pools. Website: https://www.rubicon.finance/ Twitter: https://twitter.com/rubicondefi Discord/Discourse/Community: Rubicon; https://forum.rubicon.finance/ Other relevant links (including any demos): https://app.rubicon.finance/trade; https://docs.rubicon.finance/; Rubicon Additional team member info (please link): https://www.rubicon.finance/team Please link to any previous projects the team has meaningfully contributed to: n/a Relevant usage metrics (TVL, transactions, volume, unique addresses, etc. Optimism metrics preferred; please link to public sources such as Dune Analytics, etc.): TVL: $12.47M TXNs/Day (30D avg.): 9.78KAll Time Volume: $49MAll Time Unique Addresses: 255,254Sources: Our team maintains dashboards and queries here:@rubicondefiExternal Sources:Rubicon: TVL and Stats - DefiLlama; Optimism Quests - App Growth on Optimism After Quests 📺✨; Optimism Project Deep-Dive 🔴✨ Competitors, peers, or similar projects (please link): N/A Is/will this project be open sourced?: Yes Optimism native?: Yes Date of deployment/expected deployment on Optimism: 9/20/2021 What is the problem statement this proposal hopes to solve for the Optimism ecosystem?: The Rubicon protocol brings the efficiency of order books on-chain. Active market makers can provision liquidity profitably and traders can enjoy a simple, familiar structure with democratized root access.We need to bring price discovery for crypto assets to on-chain venues, and it will not happen unless liquidity is active. How does your proposal offer a value proposition solving the above problem?: This proposal incentives both active and passive liquidity providers in a direct fashion that most DEXs cannot do today. This program will bring active and sophisticated traders into the Optimism ecosystem, which is a win not just for Rubicon but for all DEXs on the chain. Why will this solution be a source of growth for the Optimism ecosystem?: Rubicon showed with its previous grant that we could translate token incentives into thousands of transactions and new users, and millions of dollars of volume and liquidity. This proposal improves upon our prior work by prioritizing active liquidity providers in addition to passive ones, which should be even more effective for growing KPIs like volume and transactions. Has your project previously applied for an OP grant?: Rubicon received 900,000 OP in a Phase 0 grant, with the supermajority allocated towards liquidity incentives. These OP incentives will end on February 10, 2023.The Phase 0 grant supercharged Rubicon’s growth across every conceivable metric. TVL increased by more than 11x, from $1.1M to $12.36M. Trading volume, liquidity, market depth, and unique addresses also had exponential growth. Perhaps most importantly, Rubicon’s transaction count grew immensely, with the protocol currently being the #5 Optimism dApp by transaction count in the last 30 days.Rubicon’s Phase 0 grant led to awesome growth, and our team is confident that this proposal will be even more effective because it directly rewards active liquidity in addition to passive liquidity. This proposal is even more direct in incentivizing usage (volume, liquidity, and transactions) than the previous one!Rubicon Phase 0 Proposal: [GF: Phase 0 Proposal] Rubicon Number of OP tokens requested: 200,000 Did the project apply for or receive OP tokens through the Foundation Partner Fund?: No If OP tokens were requested from the Foundation Partner Fund, what was the amount?: n/a How much will your project match in co-incentives? (not required but recommended, when applicable): Rubicon does not currently have a token and is not positioned to match with co-incentives. How will the OP tokens be distributed? (please include % allocated to different initiatives such as user rewards/marketing/liquidity mining. Please also include a justification as to why each of these initiatives align with the problem statement this proposal is solving.): Market Maker Incentives: 70% (140,000 OP)Addresses that actively ‘make’ liquidity on the Rubicon protocol will earn OP rewards based on their Maker Volume during 4-week epochs. After each epoch, our team will airdrop OP to addresses based on their proportional share of maker volume on trading pairs in the program.These epochs allow our team to be discretionary and filter out any addresses that engage in wash trading/malicious behavior to game the rewards, as well as filter out team addresses.The source for maker volume will be this public subgraph: rubi-subgraphs/RubiconMarketLight at master · RubiconDeFi/rubi-subgraphs · GitHubTrading pairs that where traders will receive incentives proportional to their share of maker volume:WETH/USDC, WETH/DAI, WETH/USDT, OP/USDC, USDC/DAILiquidity Pool Incentives: 30% (60,000 OP)These incentives will renew our successful liquidity rewards program for the next version of the protocol. LPs in Rubicon V2 will earn OP for supplying liquidity to the protocol.Liquidity Pools in the program:(W)ETH, USDC, DAI, USDT, OP, WBTCThese are the initial markets for Rubicon V2, and each will receive an equal share (10,000 OP) of rewards that continuously vest over 3 months. Over what period of time will the tokens be distributed for each initiative? Shorter timelines are preferable to longer timelines. Shorter timelines (on the order of weeks) allow teams to quickly demonstrate achievement of milestones, better facilitating additional grants via subsequent proposals: All of the upfront portion (40%) of this grant will go towards the Maker Incentives.These incentives will begin 2 weeks after the grant is received and in its initial phase last 14-weeks in total. Maker Incentives will be awarded on after 4-week epochs, and with a 1-week feedback/evaluation period between epochs.The first 3 epochs will have 26,666.67 OP up for grabs, and if the milestone is achieved the remaining 2 epochs will each have 30,000 OP. Please clearly define the milestones you expect to achieve in order to receive milestone based installments. Please consider how each milestone relates to incentivizing sustainable usage and liquidity on Optimism. Progress towards each milestone must be trackable: Milestone edit that incorporates community feedback:  Milestone 1: (initial unlock 80,000 OP, 40% of total) The Maker Program must exceed $100,000 USD in maker volume during each 4-week-long epoch. Volume Data Source: RubiconMarket subgraph Rubicon team addresses will be filtered out of the maker volume count and will not receive rewards. Our team will provide documentation to make this clear to the Grants Council. The first of the initial three epochs will start two weeks after March 2nd (or whenever the Phase 10 grants are distributed).  Milestone 2: (unlocks 60,000 OP, 30% of total) The Maker Program will distribute 60,000 OP over two final epochs following the same distribution model as the previous three.  Milestone 3: (unlocks 60,000 OP, 30% of total) Once Rubicon V2 is deployed and fully live on Optimism, 60,000 OP will be unlocked and sent to a BathBuddy contract to start liquidity provider rewards. Rubicon will submit documentation, including smart contract addresses, to the Grants Council to make it easy to confirm the deployment and distribution logic. The following liquidity pools will receive rewards: (W)ETH, USDC, DAI, USDT, OP, WBTC.  Milestone 4: Upon completing the other milestones, the Rubicon team will submit a summary of results to the Grants Council that assesses the Maker Program and Liquidity Provider Rewards. This report will be completed no later than 6 months after receipt of OP tokens, even if some milestones are incomplete. Why will incentivized users and liquidity on Optimism remain after incentives dry up?: Rubicon gives active traders and liquidity providers tools they cannot find anywhere else in DeFi. Instead of eating impermanent loss, users get a fully-featured order book protocol where they can profitably provide liquidity.Our team translated the previous grant into significant growth in volume, liquidity, transactions, and users on Optimism, and we plan to do the same with this grant, this time in an even more direct fashion. Please provide any additional information that will facilitate accountability (smart contracts addresses relevant to the proposal, relevant organizational wallet addresses, etc.): General Items:Like our previous grant, the address listed in this application will hold all OP in escrow until it is airdropped to makers or sent to a BathBuddy contract for liquidity incentives.Rubicon is currently Optimism native but will be launching on another L2 network in Q1. We conferred with an OP Labs rep and ask the sub-committee for guidance on whether or not this disqualifies us from being OP native. We will respect the decision either way!Liquidity Mining:The BathBuddy contract that will hold the Liquidity Rewards in escrow and vest them to the liquidity pools will not be deployed until Rubicon V2 is live. Unfortunately, we cannot use the previous BathBuddy contract from the previous program.Maker Incentives:Our team makes markets and actively provides liquidity on Rubicon. Thus it is important we are excluded from the Maker Incentives. We will exclude team addresses from the airdrop at the end of each epoch, we can do this transparently using the subgraphs and tagging team addresses prior to the drops. Confirm you have read and agree to the Eligibility Restrictions (here): I have read the Eligibility Restrictions and agree to abide by their conditions ",
                    "links": [
                        "https://www.rubicon.finance/",
                        "https://twitter.com/rubicondefi",
                        "https://discord.com/invite/E7pS24J",
                        "https://forum.rubicon.finance/",
                        "https://app.rubicon.finance/trade",
                        "https://docs.rubicon.finance/",
                        "https://mirror.xyz/rubicon.eth",
                        "https://www.rubicon.finance/team",
                        "https://dune.com/rubicondefi",
                        "https://defillama.com/protocol/rubicon",
                        "https://dune.com/oplabspbc/optimism-quests-project-usage-growth",
                        "https://dune.com/optimismfnd/optimism-project-deep-dive?1+Project+Name_te03bb=Rubicon",
                        "https://gov.optimism.io/t/gf-phase-0-proposal-rubicon/794",
                        "https://github.com/RubiconDeFi/rubi-subgraphs/tree/master/RubiconMarketLight",
                        "https://thegraph.com/hosted-service/subgraph/denverbaumgartner/rubiconmarket-light-optimism",
                        "https://gov.optimism.io/t/grant-proposal-template/3233",
                        "https://gov.optimism.io/t/cycle-10-final-grants-roundup/5418",
                        "https://gov.optimism.io/t/cycle-10-grant-review-roundup/5284"
                    ],
                    "GPT-summary": "The post is a proposal for a project called Rubicon, which is an order book protocol built on Ethereum L2 networks. The proposal explains how the project works, what problem it aims to solve, and how it offers a value proposition. The post also includes relevant links, metrics, and information about the team and previous grants. Additionally, the post includes information about how the OP tokens will be distributed and milestones that need to be achieved. The post also invites feedback and questions about the proposal.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Interoperability and Scaleability",
                        "Smart contract updates",
                        "Token economics",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.365956106734795
                },
                {
                    "author_link": "https://gov.optimism.io/u/Mark_De.Fi",
                    "index": "2",
                    "likes": "1",
                    "time": "02/02/2023-17:37:41",
                    "content": "I want first of all to highlight the site, which looks really great! I’m definitely ready to support the project and I think I’ll make a thread about it on my Twitter feed ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party is advertising proposal"
                    ],
                    "Sentiment": 7.416666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/forrest",
                    "index": "3",
                    "likes": "4",
                    "time": "02/02/2023-18:25:03",
                    "content": "Hi OP Collective, the Rubicon team is excited to apply for another Optimism Grant! Our Phase 0 Grant helped generate an awesome amount of growth for the protocol; TVL, Volume, Users, and Transactions all grew (and are still growing!) exponentially.  image2368×976 172 KB  (Source) This proposal takes learnings from our first grant and focuses on making incentives even more effective. Despite this grant being 4.5 times smaller than the first, our team is confident that it would be better at directly incentivizing some of Optimism’s KPIs! In particular, we think incentivizing active market making through the Maker Rewards more directly incentivizes trading volume and transactions growth. Trading bots are always some of the highest gas spenders on blockchains, so it’s important for Optimism to focus on catering to these users as the L2 DEX wars heat up. We look forward to feedback from the subcommittee and the broader Collective, please feel free to direct any questions to me, @denver, and @benjamin! ",
                    "links": [
                        "https://defillama.com/protocol/rubicon"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.691789215686274
                },
                {
                    "author_link": "https://gov.optimism.io/u/denver",
                    "index": "4",
                    "likes": "5",
                    "time": "02/02/2023-22:47:34",
                    "content": "Hello All, Wanted to highlight some resources and data behind the Maker Incentives portion of this proposal and discuss some of the efforts we are taking to support the growth of this aspect of Rubicon’s ecosystem. For the past year we, the Rubicon Team, have acted as the primary market makers on the protocol, leading to over $48M in volume to date. Now, we turn our focus to onboarding the next 1000+ Market Makers to the protocol, providing equal access to all level of actors in a fair, transparent, and trust-less fashion. In support of this goal we have open-sourced:   Custom Contracts: to support more advanced trading strategies on the protocol Developer SDKs: to empower developers, we have built and support both Python and Rust SDKs, with plans to support more languages in the future  Public Subgraphs: to provide historical data access, we have built and support a variety of open-source subgraphs for the protocol  In addition to the above tooling, we are actively working to open-source market making bots and trading infrastructure to enable users to quickly start making markets in an automated fashion. To continue supporting the growth of Rubicon, and Optimism’s, Maker Community, we are requesting a grant to incentive “maker volume” (volume created by offering liquidity on the platform) and drive active participation by new and existing market makers. Active Market Makers are power users of both the Rubicon Protocol and Optimism. Accounting for all addresses that have provided liquidity on the books (makers), the average transaction count per maker is ~1000. When filtering for addresses that have made over 100 offers on the protocol (automated traders and power users) this average jumps to ~37K transactions per maker. Maker Incentives are intended to focus growth through the following lenses:   Reach: Any DeFi user can earn these rewards, it’s as simple as placing limit orders on the App or calling the offer() function on the smart contract. Offering liquidity on the Rubicon Protocol is free, outside of gas, for every user. With zero fees, a limit order allows a user to decide a direction, size, and price for their trade, while benefitting from the low transaction fees on Optimism. For comparison, CEXs such as Coinbase implement maker fee tiers, with small-volume users (<$10K volume) paying a 40bps fee while only large-volume users (>$250M) qualify for zero fees. We are excited to help users of all levels start providing liquidity on the books, and can help with onboarding in our discord.  Users: Maker Incentives most directly benefit power users and developers through a reward structure that allocates OP proportional to the relative volume made by a user. In a competitive environment, we expect that top performing makers will be those who are able to build and maintain sophisticated trading systems on top of the protocol. Sophisticated traders benefit not only Rubicon, but every DEX on Optimism.  Likelihood of Success: As outlined in the proposal above, we are excited take our learnings and successes from the Phase 0 grant and pursue even greater returns on public investment when it comes to key growth metrics. Gas fees serve as the number one cost of market makers on the protocol. With huge technical advancements on the horizon, namely Bedrock and 4844, we expect that in the very near term these barriers to entry (gas costs) will rapidly fall. Maker Incentives are intended to help onboard users ahead of these advancements, and will help to subsidize operational costs. Onboarding users and helping them iterate towards profitable market making strategies, in todays relatively high gas cost environment, will prepare them to excel in the months and years to come.  After every epoch of the maker rewards, with guidance from the grants committee and Optimism Community at large, the program may be paused to correct course and ensure further growth of key KPIs. We are continuously striving to subtract our influence in order to enable, and promote, effective decision making from the collective. Thanks for your time, may we all build the future we know is possible together, and stay Optimistic about what is to come. Best, denver ",
                    "links": [
                        "https://twitter.com/rubicondefi/status/1593008176248807425?s=20&t=qtSaF4YRnqbbnRgxha3vVQ",
                        "https://github.com/RubiconDeFi/rubi-py",
                        "https://github.com/RubiconDeFi/rubi-rs",
                        "https://github.com/RubiconDeFi/rubi-subgraphs",
                        "https://dune.com/queries/1952550",
                        "https://dune.com/queries/1952570",
                        "https://optimistic.etherscan.io/address/0x7a512d3609211e719737E82c7bb7271eC05Da70d#writeProxyContract#F9",
                        "https://discord.gg/rubicon-752590582274326680",
                        "https://gov.optimism.io/t/gf-phase-0-proposal-rubicon/794",
                        "https://community.optimism.io/docs/developers/bedrock/",
                        "https://www.eip4844.com/"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.8567472757127925
                },
                {
                    "author_link": "https://gov.optimism.io/u/MS1",
                    "index": "5",
                    "likes": "3",
                    "time": "05/02/2023-12:43:17",
                    "content": "I really like DEX from Rubicon , which is easy to use and is very intuitive. Rubicon is a hard working team with a long term vision, but what is most important is that this is a native solution for Optimism, which shows how they believe in this ecosystem. I wish them all the best . ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.494791666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/GFXlabs",
                    "index": "6",
                    "likes": "1",
                    "time": "08/02/2023-19:07:57",
                    "content": "Thank you for applying for a grant through the Grants Council. We sit on the relevant subcommittee and had a couple questions that would help to evaluate your application. 1:     GrantsOps:  After the first three epochs, the Maker program will need to hit a milestone of $100,000 USD in maker volume in a given epoch which qualifies for the program (not team addresses), in order to unlock the next portion of the grant.   What is the current volume of this under the existing LM program (and what is the spend). If you have a couple different data points with both volume and OP spend through the lifetime of the previous grant, that would be even more helpful. 2: Continuing the discussion from [GF: Phase 0 Proposal] Rubicon:    [GF: Phase 0 Proposal] Rubicon   After rewards run out, Rubicon will have shown new users a trading experience and liquidity mechanism that is simply not possible on Ethereum mainnet. In particular, we think users will stick around for:  Truly on-chain limit orders (no reliance on off-chain keepers) Passive liquidity pools with the yields of actively managed liquidity Composable order book LP tokens (bathTokens)    How would you address concerns that applying for a second grant is demonstration that the first grant was not successful in creating sticky users? This request appears to be a continuation and iteration on the previous one, with only a modest reduction in spend in liquidity mining, when adjusting for time period. Why would Optimism want to continue to incentivize these pools on this protocol, given limited resources and high interest in the grants program? Thank you! Edit: Tagging @forrest for visibility, since they created the Phase 0 post, and hopefully this will ping them. ",
                    "links": [
                        "https://gov.optimism.io/t/gf-phase-0-proposal-rubicon/794/1"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.084983766233766
                },
                {
                    "author_link": "https://gov.optimism.io/u/forrest",
                    "index": "8",
                    "likes": "2",
                    "time": "08/02/2023-23:42:22",
                    "content": "Thanks for the questions @GFXLabs.     GFXlabs:  What is the current volume of this under the existing LM program (and what is the spend). If you have a couple different data points with both volume and OP spend through the lifetime of the previous grant, that would be even more helpful.   To clarify, the existing program only rewards passive LPs in the liquidity pools, so there are currently no rewards for maker volume. Since the start of the program, Rubicon saw more than $48 million in trading volume. For more data, please see our Volume Dune Dashboard and the RubiconMarket Subgraph (source code). This image from the Phase 0 proposal breaks down the daily OP spend of the existing program:  image1920×889 88 KB      GFXlabs:  How would you address concerns that applying for a second grant is demonstration that the first grant was not successful in creating sticky users?   The first grant led to a lot of growth and retention for the user group that it incentivized, which was passive LPs. This proposal improves upon the first by creating a new program that directs 70% of incentives to the most active and important user group: market makers.     GFXlabs:  Why would Optimism want to continue to incentivize these pools on this protocol, given limited resources and high interest in the grants program?   This proposal is not limited to rewards for the liquidity pools; the 30% of this grant for Liquidity rewards would only be unlocked if we reach our milestone, and would reward the Rubicon V2 money markets, not the current liquidity pools. The majority (70%) of this grant would go to a completely new Maker Program which would reward power users of Rubicon and Optimism who tend to make thousands of transactions and pay a lot of gas fees:     denver:  the average transaction count per maker is ~1000. When filtering for addresses that have made over 100 offers on the protocol (automated traders and power users) this average jumps to ~37K transactions per maker.   And since the start of the current program, Rubicon makers spent ~128 ETH in gas fees trading on the protocol. Thanks again for the review, and please let us know if you have any follow-ups! ",
                    "links": [
                        "https://thegraph.com/hosted-service/subgraph/denverbaumgartner/rubiconmarket-light-optimism",
                        "https://github.com/RubiconDeFi/rubi-subgraphs",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/b/bae81c6d9ee11cc0b5cae883e541f4cad3b66325.jpeg",
                        "https://dune.com/queries/1952550",
                        "https://dune.com/queries/1952570",
                        "https://dune.com/queries/1980878?d=11&category=decoded_project&namespace=rubicon&blockchains=optimism&contract=RubiconMarket&abi=LogMake"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.447883973665224
                },
                {
                    "author_link": "https://gov.optimism.io/u/Mark_De.Fi",
                    "index": "9",
                    "likes": "3",
                    "time": "09/02/2023-17:08:09",
                    "content": "Thanks for the update. I would like to point out that these milestones are actually a huge step in the development of the ecosystem And I think all investors have been waiting for this “zero-fees” that there’s actually been an insane amount of talk about, but it’s only now that we’re actually getting to it Already joining discord ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.666666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/benjamin",
                    "index": "10",
                    "likes": "2",
                    "time": "10/02/2023-20:20:53",
                    "content": "I’m a supporter of this proposal and think incentivizing active market makers on Rubicon and Optimism is worthwhile. These are sophisticated actors who make lots of transactions and pay gas to manage their books while earning democratized profits if successful. Unlike on AMMs, savvy Rubicon LPs and market makers can naturally profit from their risk and performance! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.741666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/bakgwei",
                    "index": "11",
                    "likes": "4",
                    "time": "16/02/2023-23:08:41",
                    "content": "I like the proposal as well. Rubicon is a good project, and this would help to attract more and deeper liquidity. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/GFXlabs",
                    "index": "12",
                    "likes": "1",
                    "time": "22/02/2023-12:27:58",
                    "content": "    GrantsOps:  Please clearly define the milestones you expect to achieve in order to receive milestone based installments. Please consider how each milestone relates to incentivizing sustainable usage and liquidity on Optimism. Progress towards each milestone must be trackable:   We wanted to provide some suggestions to help make this section as strong as possible. These suggestions are optional, and do not necessarily reflect the opinions of anyone other than GFX. Most suggestions are to make the language for milestones clear and unambiguous. The suggestions below are merely to demonstrate what kinds of clarification would make this section stronger, and the applicant obviously knows their protocol and grant plan best.     GrantsOps:  For the Maker Incentives, we propose the following milestones:  Average Maker Volume (and % growth from previous epoch) Number of New Makers (and % growth from previous epoch)  After the first three epochs, the Maker program will need to hit a milestone of $100,000 USD in maker volume in a given epoch which qualifies for the program (not team addresses), in order to unlock the next portion of the grant. The Final Phase will last for 8 weeks (two epochs) and account for the remaining 30% of the grant allocated to maker incentives. The timeline and distribution of OP is subject to change and conditional of approval and guidance from the Grants Committee and Optimism Community.   Milestone 1: The maker program will need to have $100,000 USD in maker volume in each epoch [estimated beginning and end dates if possible]. Rubicon team addresses will be excluded from this metric [state whether they are also excluded from the distributions]. Rubicon will submit documentation to make it easy for Grants Council to confirm this. Milestone 2: The maker program will distribute the remaining [enter amount of OP here] over the final two epochs [estimated beginning and end dates if possible]. Team addresses will be excluded.     GrantsOps:  For the Liquidity Incentives, the primary deliverable will be the launch of Rubicon V2 and the new liquidity pools, at which point 30% of this grant would be unlocked and sent to relevant rewards contracts to reward pool LPs like our previous program.   Milestone 3: Rubicon V2 will be live on Optimism. The following liquidity pools will be supported [specific pools]. Rubicon will submit documentation, including smart contract addresses, to the Grants Council to make it easy to confirm this. Milestone 4: On the completion of all other milestones, Rubicon will submit a brief summary of results to the Grants Council. This should be completed no later than 6 months after receipt of OP tokens, even if some milestones are incomplete. CC: @forrest ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.431487493987493
                },
                {
                    "author_link": "https://gov.optimism.io/u/forrest",
                    "index": "13",
                    "likes": "3",
                    "time": "22/02/2023-19:26:08",
                    "content": "Thanks for these suggestions and for helping clarify our milestones @GFXlabs. We agree with your improvements and went ahead and filled in the gaps:  Milestone 1: (initial unlock 80,000 OP, 40% of total) The Maker Program must exceed $100,000 USD in maker volume during each 4-week-long epoch. Volume Data Source: RubiconMarket subgraph Rubicon team addresses will be filtered out of the maker volume count and will not receive rewards. Our team will provide documentation to make this clear to the Grants Council. Edit: The first of the initial three epochs will start two weeks after March 2nd (or whenever the Phase 10 grants are distributed).  Milestone 2: (unlocks 60,000 OP, 30% of total) The Maker Program will distribute 60,000 OP over two final epochs following the same distribution model as the previous three.  Milestone 3: (unlocks 60,000 OP, 30% of total) Once Rubicon V2 is deployed and fully live on Optimism, 60,000 OP will be unlocked and sent to a BathBuddy contract to start liquidity provider rewards. Rubicon will submit documentation, including smart contract addresses, to the Grants Council to make it easy to confirm the deployment and distribution logic. The following liquidity pools will receive rewards: (W)ETH, USDC, DAI, USDT, OP, WBTC.  Milestone 4: Upon completing the other milestones, the Rubicon team will submit a summary of results to the Grants Council that assesses the Maker Program and Liquidity Provider Rewards. This report will be completed no later than 6 months after receipt of OP tokens, even if some milestones are incomplete. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 4.675482503607504
                }
            ]
        }
    ],
    "group_index": "512"
}