{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/draft-gf-phase-1-proposal-light-client-proxy-bridge-for-optimism/2940",
            "title": "[DRAFT] [GF: Phase 1 Proposal] Light Client Proxy bridge for Optimism ",
            "index": 2940,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Governance Fund: Phase 1"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/daiki",
                    "index": "1",
                    "likes": "0",
                    "time": "10/07/2022-09:33:48",
                    "content": "Project Name: Developing Light Client Proxy bridge for Optimism Author Name: Daiki Ishikawa @Datachain (https://www.datachain.jp/) Number of OP tokens requested: To be determined L2 Recipient Address: To be determined Optimism alignment (up to 200 word explanation): We’ ve been addressing interoperability issues and partnering with ICF, Harmony etc to build bridges based on Cross-Authentication. (Datachain · GitHub) And today, we are developing LCP Bridge which is the most secure ever, gas-efficient and high extensibility using TEE(e.g. SGX) Key features are Ultra Gas-efficient, Relay(On-chain verification) and Extensible & IBC Support. LCP could enable Optimism users to exit their funds into Ethereum securely without a challenge period using LCP. Please check this proposal https://docsend.com/view/ygmgy2fc8feu82ae We believe that LCP can make this multichain world more secure and more convenient. Grant Requirements We would like you to consider the following partnership possibility.  Efforts to make transactions through LCP maximized.   Seamless user flow to LCP bridge  links from the bridge page, user support page etc     Co-building a transfer bridge Interface Co-building bridge applications besides just token transfer  ",
                    "links": [
                        "https://github.com/datachainlab/",
                        "https://docsend.com/view/ygmgy2fc8feu82ae"
                    ],
                    "GPT-summary": "The post is a draft proposal for a Light Client Proxy bridge for Optimism. The author explains the project and its key features, and requests feedback and partnership possibilities. A 3rd party could provide constructive criticism or ask questions about the proposal.",
                    "GPT-proposal-categories": [
                        "Interoperability and Scalability",
                        "Grants, Funding and Resource Allocation",
                        "Smart Contract Updates",
                        "None",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.157692307692307
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "2",
                    "likes": "2",
                    "time": "10/07/2022-16:24:02",
                    "content": "Hello @daiki can you please go into more details in your proposal?  The template is missing some sections. Don’t expect us to read a pitch deck. Please put it all in the forum. Explain in a few words what it is you want to fund with this grant and why it is of use to Optimism Have a budget plan for it with details on all expenses Using (4) come up with an amount of $OP tokens to request.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.166666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/Defi_LATAM_axlvaz",
                    "index": "3",
                    "likes": "1",
                    "time": "12/07/2022-14:50:14",
                    "content": "Highlights:  This proposal lacks more description. Be clearer about the funds requested and how they will be used. Provide more information about the project. Provide more information on the value added to Optimism.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/daiki",
                    "index": "4",
                    "likes": "1",
                    "time": "12/07/2022-23:53:34",
                    "content": "Thanks for your feedback. I will fill up more details. allow us to take some time. thank you. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "5",
                    "likes": "1",
                    "time": "13/09/2022-21:39:17",
                    "content": "Just checking in to see if you would like this proposal to be evaluated in Voting Cycle #6 according to the updated grant proposal template? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "148"
}