{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/draft-gf-phase-1-proposal-op-medicine/5043",
            "title": "[DRAFT][GF: Phase 1 Proposal] OP Medicine ",
            "index": 5043,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Grants Council"
            ],
            "tags": [
                "cycle-10",
                "not-passed"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/seetadev",
                    "index": "1",
                    "likes": "3",
                    "time": "02/02/2023-04:39:56",
                    "content": "Project name: OP Medicine Author name and contact info (please provide a reliable point of contact for the project): Manu Sheel Gupta Contact Information: discord: manusheel#3075 Email: manu@seeta.in, aspiring.investments@gmail.com Github: seetadev (SEETA) · GitHub, aspiringsecurity (Aspiring Web3) · GitHub (organization) Twitter: https://twitter.com/manusheel Telegram: @manusheel I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: Yes I understand that I will be expected to following the public grant reporting requirements outlined here: Yes L2 recipient address: 0x5aE4a3335b1264B5910a9C64ADf8F209c45CE602 Which Voting Cycle are you applying for?: Season 3, Cycle 10 Which sub-committee should review your proposal? (Builders Grants, Growth Experiment Grants): Growth Experiment Grants Project description (please explain how your project works): Summary: Developer tools to enable visualization, management for developers to build solutions in medicine, healthcare, improve transparency in drug testing with Filecoin, Ethereum, Optimism, Embark and EtherCalc. We wish to engineer an eco-system for Optimism developers, full stack builders, smart contract designers, unit testers, performance engineers for the OP Medicine developer tool. Eco-system Goals:  To make Optimism Medicine project freely and readily available to developers, Optimism learners; To explore and share best practices; To provide a forum for discussion and support for OP Medicine for collaboration, contribution; To provide mechanism for evaluation and dissemination of developer efforts. How OP Medicine works:We are developing an Optimism NFT marketplace for DICOM images to enable research organizations and radiologists. This enables improving Data Transparency in Drug Testing and early-stage detection and prevention of community diseases.We also wish to scale our efforts to develop secure, transparent Drug Testing Pipeline and improving Data Transparency in Drug Testing using OP stack.Our OP solution enables medical trial testing and clinical trials via EMTTRs (Electronic Medicine Trial and Test Records as a Service) and EHR and Radiology services on the decentralized cloud using OP Stack.Vision and Goals: Enabling the bottom of pyramid through empowering pharma companies and the medical eco-system to do medicine trial testing and clinical trials via Ethereum and Optimism blockchain enabled EMTTRs (Electronic Medicine Trial and Test Records as a Service), EHR and Radiology services. EMTTRs as a service aims at providing■Secure data storage, transparent data movement and data authenticity;■Improving Data Transparency in Drug Testing using Optimism, Ethereum;■Enabling healthcare community by empowering pharma companies & the medical eco-system to do medicine trial testing securely, transparently using Optimism, Ethereum.   Healthcare Eco-system Benefits of the OP Medicine Developer Tool: a. Patients  Make instant appointments with a doctor and get quick access to e-records using bulk query and retrieve via Orthanc PACS, Optimism network. Computer-aided detection will help in early prediction and diagnosis of diseases.  b. Doctors and Hospitals  Prioritize and handle appointments better. Issue prescriptions using EtherCalc medical suite dapp. Coordinate with specialists using Medical DAOs tooling. Access to accurate records using medical history dapp. Improved care. Better dietary feedback based on genomelink API  c. Administrator and Insurers  Connect all stakeholders using Optimism network. Personalize care treatment. Accurate and timely payments. Reduce the cost of decentralized systems by Layer 2 Scaling.  d. Employees  Administer Benefit using IPFS, Ethereum, Optimism network Reduce healthcare costs. Reward employees Offer affordable benefit packages. Better diet and food programs at offices.  e. Research Institutions  Computer-aided detection of diseases and development of prevention models using DAOs. Personalized medicine and drug discovery practice using Ethereum and Optimism Network.  Github Repository of OP Medicine: GitHub - aspiringsecurity/EMTTR: Secure, Transparent Drug Testing Pipeline: Improving Data Transparency in Drug Testing Website: EMTTRs Twitter: https://twitter.com/OP_medicine_DAO  (recent page); https://twitter.com/manusheel (OSS Collaboration); Community Engagement: https://twitter.com/encodeclub/status/1620777000997916673 Discord/Discourse/Community: Electronic Health Records Youtube Channel: Aspiring Demos - YouTube Screencast: FEVM Med 2 - YouTube (dapp, security), FEVM Med 2 - YouTube (dapp, portal). Tron DAO Forum: Profile - manusheel - TRON DAO Forum Community Initiative for running OP hackathons and pre-incubation programs in healthcare and mobility with Government authorities in New Delhi, India: NSUT IIF , Department of Design. - Student Glimpse Research Profile: https://www.researchgate.net/profile/Manu-Gupta-6 ; dblp: Manu Sheel Gupta Recent Publication: https://onlinelibrary.wiley.com/doi/epdf/10.1002/hbe2.240 Linkedin: https://www.linkedin.com/in/manusheelgupta/ Platform for Developers around Ideas and OSS applications: Platform aims to build communities around ideas | Mint Other relevant links: Metaverse Hackathon: EthMed Pitch - YouTube Github Repository of OP Medicine: GitHub - aspiringsecurity/EMTTR: Secure, Transparent Drug Testing Pipeline: Improving Data Transparency in Drug Testing Website: EMTTRs Screencast: FEVM Med 2 - YouTube (dapp, security), FEVM Med 2 - YouTube (dapp, portal). Github Repository of Medical Counselor: GitHub - aspiringsecurity/Medical-Counselor: Medical Counseling, preventive treatment and remediation portal using IPFS, NFT.Storage and Embark Website: Electronic Health Records Github Repository of Medical DAO: GitHub - seetadev/FEVM-Med: Medical Counseling, preventive treatment and remediation portal powered by Embark and Filecoin eco-system tools. Enable secure data storage & transparency of medical report data. Website: FEVM Med Notable achievements for OP Medicine:  Optimism Runner Up at Encode Metaverse Hackathon 2022: please visit Metaverse Hackathon: Prizewinners and Summary | by Neven Brlek | Encode Club | Medium and Metaverse Hackathon: EthMed Pitch - YouTube  Filecoin winner at Chainlink Fall hackathon 2022 (https://devpost.com/software/electronic-medicine-trial-and-test-records-as-a-service), EVM Ideathon Runner-Up 2022 (Government and Public)  Tableland and NFTPort winner at HackFS 2022: EtherGlance | ETHGlobal  Young Scientist Award in Healthcare to Manu and Deepti at India International Science Festival Scholarship at ZuriHac for Haskellers, Rapperswil, Switzerland and SAP-GITR, India winner  Additional team member info (please link): Deepti Gupta (Full Stack Blockchain Developer, Discord: deeptigupta#4290, Email: deepti.kotwal.2011@gmail.com), Vibhor Bijoy (Security Engineer, Email: bijoy.vibhor19@gmail.com), Praveen Patel (Data and Logistics Executive, Email: android.seeta.dev@gmail.com), Usha Gupta (Consultant for UI/UX, seeta.team@gmail.com), Dr MPS Bhatia (Consultant, Partnerships and Technology, aspiringuserapps@gmail.com), Arvind Kumar Gupta (Business Executive, arvindsenior@gmail.com), Vithika Gupta (iot and blockchain adviser, aspiringworkapps@gmail.com), Rakhee (Test Engineer, financeseeta@gmail.com) Please link to any previous projects the team has meaningfully contributed to:  1. Transport Monitor: Technical solution for citizens, police officers and drivers to report and manage incidents, detect and prevent accidents on web and mobile.   Filecoin Microgrant Recipient 2023: GitHub - ipfs/devgrants: The IPFS Grant platform connects funding organizations with builders and researchers in the IPFS community.   Eth Transport (Hall of Fame URL: Please search for Eth Transport at Airtable - Winners Hall of Fame (hackathons.filecoin.io) );   Github: GitHub - aspiringsecurity/EthTransport   Project Information: Aspiring Road Safety   Dev Grant/Prize Winner at Tron Hackathon ($12.5K USD), Near MetaBuild Hackathon ($20K USD) and Polygon winner at Chainlink, Ethglobal Hackathons, Conduent Finalist.   Fluence Best Use Case Winner, XMTP and Filecoin Pool Prize, Ledger Nano Prize at Moralis Filecoin Hackathon 2022 (please visit https://moralis.io/filecoin-hackathon/winners/)   Harmony Prize Winner at Encode Harmony Hackathon 2022 (Encode Club x Harmony Hackathon: Prizewinners and Summary | by Vanessa Losic | Encode Club | Medium)   2. Drone Monitor for Healthcare, Emergency Services (GitHub - aspiringsecurity/Water-ICM: Investigative Case Management for Integrated Water Management Resource Center);  Optimism Finalist at Encode Metaverse Hackathon 2022 (UAV Monitor) Website: LATC Global  Application for Logistics, Maintenance companies: - Drones for Real Estate  Application for End Consumers, Civic bodies: Water Management  We won the Aptos Challenge (5000 USDC) at Encode’s Next Video Build Hackathon: Next Video Build — Encode Club. Please find the finale and prize giving video: Next Video Build: Finale and Prizegiving - YouTube and blog entry at Next Video Build Hackathon: Prizewinners and Summary | by Neven Brlek | Encode Club | Jan, 2023 | Medium  Covalent Prize Winner at Encode Harmony Hackathon 2022 (Encode Club x Harmony Hackathon: Prizewinners and Summary | by Vanessa Losic | Encode Club | Medium; Github Repository: GitHub - seetadev/EthOps: Developer Tools to manage and monitor drones, UAVS and embedded devices for cost effective healthcare delivery) XMTP and Filecoin Pool Prize at Moralis Filecoin Hackathon 2022 (please visit Winners - Moralis Web3 | Enterprise-Grade Web3 APIs) We won the best use of Hedera Hashgraph at the Garuda 3.0 Hackathon. Please find the winner’s certificate at drone monitor - Google Drive (merit certificate directory) and winner’s link at https://garuda-hacks-3-0.devpost.com/project-gallery -Top 20 Innovations by Niti Aayog team at a Mobility Summit in Vigyan Bhawan, New Delhi   3.SocialCalc for Public Health and Education: Please visit  http://activities.sugarlabs.org/en-US/sugar/addon/4084  Number of users: 800,000 from OLPC deployments and 45,000 from downloads. Guide for using Charting tools by Harvard University’s Digital Literacy Project  - http://vimeo.com/11886029  Plan Ceibal OLPC Deployment Project, Uruguay - http://www.youtube.com/watch?v=-7cPHg4XJKY  Video by OLPC France Community member - http://vimeo.com/5291250  Guide for using Charting Tools - http://wiki.laptop.org/go/User:Ndoiron/SocialCalc     SocialCalc for improving social access to data and calculation at Federal Communication Commission (FCC): https://www.purplemotes.net/2009/09/13/universal-social-access-to-data-and-calculation/   Community Publications on SocialCalc    “Collaborating Towards Learning, Using Social Spreadsheets for Health Education and Community Awareness”, Aastha Chhabra, Manu Sheel Gupta, Sixth International Conference of MIT’s Learning International Networks Consortium (LINC), MIT, Cambridge, Massachusetts, USA · Jun 16, 2013   “Spreadsheet on Cloud - Framework for Learning and Health Management System”, K.S. Preeti, Vijit Singh, Sushant Bhatia, Ekansh Preet Singh, Manu Sheel Gupta,  Proceedings of the EuSpRIG Conference 2011 “Spreadsheet Governance - Policy and Practice”  ISBN : 978-0-9566256-9-4   “Constructionist Learning using Spreadsheet Based Models on Tablets”, Mithil Gupta, Manu Sheel Gupta, Sixth International Conference of MIT’s Learning International Networks Consortium (LINC), MIT, Cambridge, Massachusetts, USA · Jun 16, 2013   “A Synchronized Spreadsheet Framework as an IT solution and its Data Management Issues” Rohit Jain, KS Preeti, Vijit Singh, Shubham Shukla, Sushant Bhatia, Yatharth Bansal, Manu Sheel Gupta, International Conference on Information Technology, Systems and Management, Indian Institute of Management, Kozhikode, India · Dec 17, 2011   “SocialCalc: A Spreadsheet Activity for Computer Supported Collaborative Learning”, Manu Sheel Gupta, K.S. Preeti, Vijit Singh, Proceedings of the 2010 Conference on Frontiers in Education: Computer Science and Computer Engineering, FECS 2010, Las Vegas, Nevada, U.S.A., CSREA Press 2010, ISBN 1-60132-143-0, pp. 304-309  URL - http://www.informatik.uni-trier.de/~ley/db/conf/fecs/fecs2010.html   “Implementation of Private Cloud Computing using Integration of JavaScript and Python”, K.S. Preeti, Vijit Singh, Manu Sheel Gupta, The Python Papers Monograph, The PyCon Asia Pacific 2010, Singapore Management University Download URL - http://ojs.pythonpapers.org/index.php/tppm/article/view/149/161   SocialCalc project has also been covered in important sections of the following conference papers -   “A March Towards Constructionism based on Storytelling, Gaming and Collaboration”, Manu Sheel Gupta, Vijit Singh, Manjot Pahwa, The Fifth International Conference of Learning International Networks Consortium (LINC) 2010, Massachusetts Institute of Technology, Cambridge, Massachusetts, U.S.A.   “Collaborating Towards Learning: Using Web 2.0 for Educational Idea Development”, Krittika Adhikary, Manu Sheel Gupta, Ekansh Preet Singh, Swarandeep Singh, The Fifth International Conference of Learning International Networks Consortium (LINC) 2010, Massachusetts Institute of Technology, Cambridge, Massachusetts, U.S.A.      Recent research contribution: Co-author of the article, “Opinion of students on online education during the Covid 19 pandemic”, please visit the paper at https://onlinelibrary.wiley.com/doi/epdf/10.1002/hbe2.240   Sugar Labs (https://www.sugarlabs.org/) and One Laptop Per Child: https://laptop.org/     Co-author, SocialCalc (http://activities.sugarlabs.org/en-US/sugar/addon/4084); Notable OSS Release: http://www.olpcnews.com/software/applications/socialcalc_on_sugar_version_5.html   Platform for Developers around Ideas and OSS applications: Platform aims to build communities around ideas | Mint   Sugar on Ubuntu and Debian OS: https://bugs.launchpad.net/ubuntu/+source/sugar-0.88/+bug/617813   Co-author, Read Activity: ebook reader on Sugar environment (https://github.com/sugarlabs/read-activity)   Contributor, Food Force 2 game: http://www.pygame.org/project-Foodforce2-1122-2375.html   Relevant usage metrics (TVL, transactions, volume, unique addresses, etc. Optimism metrics preferred; please link to public sources such as Dune Analytics, etc.):  Total number of dataset transactions specific to X Ray modality: 160,000; Total number of addresses: 20; Number of addresses on Optimism: 6; Plan for total number of dataset transactions specific to X Ray Modality on Optimism: 130,000; Total number of dataset transactions specific to CT Scan, MRI and Nuclear Medicine: 30,000  Competitors, peers, or similar projects (please link): Collaborators:  Covid Care Center, Delhi (https://sites.google.com/nsut.ac.in/nsutcovidcarecentre/home?authuser=0) and Code 4 Gov Tech (https://www.codeforgovtech.in/) Eka.care (https://www.eka.care/) Used by 30 million South Asians primarily in India. Zurich Friends of Haskell (https://zfoh.ch/ and https://zfoh.ch/zurihac2020/projects.html), Haskellerz; NSUT Optimism Initiative (NSUT IIF) and My Kids NFT project (https://www.youtube.com/watch?v=jOn5-ZPhqi8 and https://github.com/i-am-Pony/MyKidsNFT_Project); Design Department, NSUT (Department of Design. - Student Glimpse ), Management Studies Department, NSUT (http://www.nsit.ac.in/divisions/mg/dept_mg_workshops/), NSUT IIF (http://nsut.ac.in/nsutiif/); Sugar Labs (https://www.sugarlabs.org/) and Google Summer of Code Program - Sugar Labs; OLPC (https://laptop.org/), Open Government Data, India (https://data.gov.in/); Samsung Labs at NSUT (https://developer.samsung.com/); AWS Customer Council and Activate Program (https://developer.amazon.com/); Near Pre Accelerator Program (https://github.com/near-examples) and Encode Layer 2 Accelerator Program (https://www.encode.club/l2-accelerator); Tron DAO Forum ( https://forum.trondao.org/); Urbit Eco-system (https://urbit.org/ecosystem); Rajshri Medical College and Hospital, Uttar Pradesh (India); Diagnosity (diagnostic labs in Noida and Delhi. They have agreed to contribute anonymized datasets and open source machine learning tools that will enable Optimism developers, researchers and data scientists in their efforts to use AI models for developing solutions for early detection and prevention of diseases.)  Is/will this project be open sourced?: Yes Optimism native?: Yes Date of deployment/expected deployment on Optimism: 5/15/2023 What is the problem statement this proposal hopes to solve for the Optimism ecosystem?: Given its size and prominence, pharma and drug research organizations seeks to always be guarded against information security threats—from both external and internal actors. This means that they are required to sift through billions of events generated by network devices, endpoint solutions, and enterprise software. Collecting and aggregating EHR is a complex activity for drug design, development. Further, there is a key need of collaboration between developers and subject matter experts, who can engage and design solutions collaboratively. The problem this proposal hopes to solve for the Optimism eco-system is towards engaging developers to build collaborative solution along with doctors and public health care experts on Optimism blockchain utilizing Web3 eco-system tools, ZK proof systems, sharding and soul-bonding ID. Further, we wish to encourage developers to develop key procedures and practices on maintainability, unit testing and security of project code on Optimism blockchain. How does your proposal offer a value proposition solving the above problem?: Our solution enables the bottom of pyramid and empowers the developer community through collaboration with radiology and research labs, pharma companies and the medical eco-system to do medicine trial testing and clinical trials via Ethereum and Optimism blockchain enabled EMTTRs (Electronic Medicine Trial and Test Records as a Service), EHR and Radiology services. EMTTRs on Optimism as a service aims at providing■Secure data storage, transparent data movement and data authenticity.■Improving Data Transparency in Drug Testing■Enabling healthcare community by empowering pharma companies & the medical eco-system to do medicine trial testing securely, transparently We will enable the developer community to share ideas collaboratively with medical experts via the builder events on Optimism, develop healthcare project blueprints and design, and organize information and content through videos, audio, images and blogs; engage non-profit organizations in innovation around healthcare and government agencies. We will invite them to localize and internationalize a Web3 developer library for electronic health records as a service to enable secure data storage, transparent data movement, and data authenticity via these builder events on Optimism: The model is based on the three ‘C’s of “collaboration, which is about working together at one place; community, when people work together, they form communities; and cooperation, which is essential for any particular project. Why will this solution be a source of growth for the Optimism ecosystem?: We are engineering an eco-system for Optimism developers to build an Optimism NFT marketplace for DICOM images to enable research organizations and radiologists. This enables improving Data Transparency in Drug Testing and early-stage detection and prevention of community diseases and also enable the Optimism eco-system to impact the bottom of the pyramid via open source community contribution and incentives.We also wish to scale our efforts to develop secure, transparent Drug Testing Pipeline and improving Data Transparency in Drug Testing using OP stack.Our OP solution enables medical trial testing and clinical trials via EMTTRs (Electronic Medicine Trial and Test Records as a Service) and EHR and Radiology services on the decentralized cloud using OP Stack.We are also enabling the development for EHR as a service using OP stack for scaling collaboration of DICOM data in EMTTR. We will help to drive the growth of Optimism in a number of metrics:The number of Web3 developers and users onboarded to OptimismThe number of Web3 developers and users investing in OP and other health projects built on OptimismThe number of users utilizing medical services on OptimismIncrease in on-chain volume Developer Innovation in Optimism eco-system:  New policy designs and models to harvest tokens in a DAO-driven decentralize compute fabric. Decentralized NFT-based voting system for community contribution and development on OP Medicine. Optimism Workflow for engaging developers: Developers create a patch request for improving community tooling on OP Medicine (Optimism project); Developers can join that patch request by minting an NFT of that RFP. This NFT is created on Optimism.  Has your project previously applied for an OP grant?: No Number of OP tokens requested: 45000 Did the project apply for or receive OP tokens through the Foundation Partner Fund?: No If OP tokens were requested from the Foundation Partner Fund, what was the amount?: 0 How much will your project match in co-incentives? (not required but recommended, when applicable): Wish to share that we will be awarding a $400 Linux laptop to the top contributors in our project. We will also be providing bootable educational pen drives on healthcare and medicine to our OP users. We have received 12 of such laptop devices and flash drives via grants from OLPC, Boston University and Sugar Labs. Further, we will share with them key research papers and articles authored by us to enable them to utilize our services collaboratively. The good developer proposals in OP medicine will be pre-incubated (in-house as well as virtually) and supported via funds and grants from NSUT IIF (NSUT IIF and Department of Design. - Student Glimpse). DTTE and AICTE in India will fund these proposals via the Yukti portal (https://yukti.mic.gov.in/) and SIH (https://www.aicte-india.org/Initiatives/smart-india-hackathon). How will the OP tokens be distributed? (please include % allocated to different initiatives such as user rewards/marketing/liquidity mining. Please also include a justification as to why each of these initiatives align with the problem statement this proposal is solving.): We will conduct four Optimism and open data science healthcare hackathons lasting 5 weeks each with a two week’s break in between. We will also organize two Optimism bootcamps focused on its application towards healthcare DAOs and Optimism community tooling. We will utilize 90% of the grant in organizing these Optimism hackathons, Optimism bootcamps as they will enable us to develop a community of optimism users and open data science healthcare researchers, hackers, designers and developers. We have been judges at Smart India Hackathon 2019 to 2022 and have interacted with more than 900 healthcare professionals in the past. We will also collaborate with both public and private hospitals to enable anonymized data collection and collaboration on the development of personalized medicine. We are already collaborating with Rajshri hospital and medical college in India and wish to incentivize the patients, who volunteer to share their medical information in an anonymized manner (PyDICOM library anonymization) with OP tokens. We will utilize 5% of the grant in the above community outreach activity. We also wish to incentivize doctors and radiologists who contribute to our platform with OP tokens (20% of the supply). We will utilize 5% of the grant in the above activity. Over what period of time will the tokens be distributed for each initiative? Shorter timelines are preferable to longer timelines. Shorter timelines (on the order of weeks) allow teams to quickly demonstrate achievement of milestones, better facilitating additional grants via subsequent proposals: First 9 months (distribution of 90% of tokens): We will have four Optimism and open data science healthcare hackathons lasting 5 weeks each with a two week’s break in between. We will also organize two Optimism bootcamps focused on its application towards healthcare DAOs and Optimism community tooling. We will utilize 90% of the grant in organizing these Optimism hackathons, Optimism bootcamps as they will enable us to develop a community of optimism users and open data science healthcare researchers, hackers, designers and developers. We have been judges at Smart India Hackathon 2019 to 2022 and have interacted with more than 900 healthcare professionals in the past. Next 9 months (remaining 10%): We will also collaborate with both public and private hospitals to enable anonymized data collection and collaboration on the development of personalized medicine. We are already collaborating with Rajshri hospital and medical college, Covid Care Center at NSUT in India and will look for patients, who volunteer to share their medical information in an anonymized manner (PyDICOM library anonymization). We will utilize 5% of the grant for training smart contract testers and quality assurance in the above community outreach activity for Optimism developers and buildersWe also wish to incentivize doctors and radiologists who contribute to our platform with OP tokens (5% of the supply) by providing key feature requests in the developer tool, guidance and feedback to Optimism developers. They will provide change management requests as we evolve the developer tools and platform. We will utilize 5% of the grant in the above activity. Please clearly define the milestones you expect to achieve in order to receive milestone based installments. Please consider how each milestone relates to incentivizing sustainable usage and liquidity on Optimism. Progress towards each milestone must be trackable: Phase 1: Design, develop and Engage Community: Demonstrate the solution using Optimism, Orthanc, Ethereum and spreadsheet on cloud connected radiology and medical computer devices, Android phones, iPhones, wearable and tablets. Set up timeline for planning the winter deployments and user training session. Share updates on website and blogs. Prototype feature list finalization.Participate in community events organized: First 9 months (distribution of 90% of tokens): We will have four Optimism and open data science healthcare hackathons lasting 5 weeks each with a two week’s break in between. We will also organize two Optimism bootcamps focused on its application towards healthcare DAOs and Optimism community tooling. We will utilize 90% of the grant in organizing these Optimism hackathons, Optimism bootcamps as they will enable us to develop a community of optimism users and open data science healthcare researchers, hackers, designers and developers. We have been judges at Smart India Hackathon 2019 to 2022 and have interacted with more than 900 healthcare professionals in the past. Phase 2: Next 9 months (remaining 10%): We will also collaborate with both public and private hospitals to enable anonymized data collection and collaboration on the development of personalized medicine for Optimism developers and builders. We are already collaborating with Rajshri hospital and medical college in India and look for patients, who volunteer to share their medical information in an anonymized manner (PyDICOM library anonymization). We will utilize 5% of the grant for training smart contract testers and quality assurance in the above community outreach activity for Optimism developers and builders. We also wish to incentivize doctors and radiologists who contribute to our platform with OP tokens (5% of the supply) by providing key feature requests in the developer tool, guidance and feedback to Optimism developers. They will provide change management requests as we evolve the developer tools and platform. We will utilize 5% of the grant in the above activity.Evolution of the developer tools and platform with the help of collaborators (Completion of supporting collateral required to fulfill services and deliverables such as the equipment, supplies and other open source software tools.Continue the collection, data organization and management of images and associated video report data to improve computer aided detection using deep learning algorithms and integrate them.Survey on community’s needs, user interaction, selection of vendors and diagnostic centers where we could deploy full-scale pilot, possibly focused on mobile.Organize a hardware agnostic program. Enable pilot users to be developers of platform and contribute in improving the existing algorithms using websites like Kaggle.Focus on making the platform interoperable with a variety of medical vendor systems in hospitals and labs. ) Why will incentivized users and liquidity on Optimism remain after incentives dry up?: The good developer RFP proposals in OP medicine will be pre-incubated (in-house as well as virtually) and supported via funds and grants from NSUT IIF (NSUT IIF , http://nsut.ac.in/nsutiif/ ). D.T.T.E. and A.I.C.T.E. in India will fund these proposals via the Yukti portal (https://yukti.mic.gov.in/) and build developer engagement via S.I.H. (https://www.aicte-india.org/Initiatives/smart-india-hackathon). There are 3 key platform features that will enable better retention of incentivized users and liquidity on Optimism post the grant period. ■Secure data storage, transparent data movement, and data authenticity.■Enabling the healthcare community by empowering pharma companies & the medical eco-system to do medicine trial testing securely, transparently■Improving Data Transparency in Drug TestingWe also wish to share that we will foster community partnerships with Ministry of Healthcare in India; utilize the scalability of Optimistic roll-ups to enable better outreach to citizens in reference to electronic health records as a service. We are collaborating with government advisers in India and will sustain the efforts by providing government incentives on maintaining the developer tool to enable tabulation, computation, visualization, and data management for developers to build solutions for the bottom of the pyramid in the areas of healthcare using Optimism. Please provide any additional information that will facilitate accountability (smart contracts addresses relevant to the proposal, relevant organizational wallet addresses, etc.): Organizational wallet address: 0x8dc640a257DE18857F8d24e1Ae2645F8bBa1E034 Organizational Wallet address for DICOM data incentive: 0x19DF3BFd0F2020275436653931326Ca417e02c73 (smart contracts interaction has happened via this address); Confirm you have read and agree to the Eligibility Restrictions (here): I have read the Eligibility Restrictions and agree to abide by their conditions ",
                    "links": [
                        "https://github.com/aspiringsecurity",
                        "https://twitter.com/manusheel",
                        "https://gov.optimism.io/t/suggested-public-reporting-requirements-for-grantees/4176",
                        "https://github.com/aspiringsecurity/EMTTR",
                        "https://sites.google.com/view/emttrservice/home",
                        "https://twitter.com/OP_medicine_DAO",
                        "https://twitter.com/manusheel",
                        "https://twitter.com/encodeclub/status/1620777000997916673",
                        "https://sites.google.com/view/electronichealthrecords/home",
                        "https://www.youtube.com/channel/UCigU_PpCCLimKxIHsSf5EvQ",
                        "https://youtu.be/BUiVvhuUdrE",
                        "https://youtu.be/BUiVvhuUdrE",
                        "https://forum.trondao.org/u/manusheel",
                        "https://sites.google.com/view/nsutiif/home",
                        "https://sites.google.com/view/departmentofdesign/student-glimpse?authuser=0",
                        "https://www.researchgate.net/profile/Manu-Gupta-6",
                        "https://dblp.org/pid/83/8804.html",
                        "https://onlinelibrary.wiley.com/doi/epdf/10.1002/hbe2.240",
                        "https://www.linkedin.com/in/manusheelgupta/",
                        "https://www.livemint.com/Industry/RXejxSDBL1x0KQQCJywU3K/Platform-aims-to-build-communities-around-ideas.html",
                        "https://www.youtube.com/watch?v=aIq3JiTlNVA&t=3s",
                        "https://github.com/aspiringsecurity/EMTTR",
                        "https://sites.google.com/view/emttrservice/home",
                        "https://youtu.be/BUiVvhuUdrE",
                        "https://youtu.be/BUiVvhuUdrE",
                        "https://github.com/aspiringsecurity/Medical-Counselor",
                        "https://sites.google.com/view/electronichealthrecords/home",
                        "https://github.com/seetadev/FEVM-Med",
                        "https://sites.google.com/view/fevm-med",
                        "https://medium.com/encode-club/metaverse-hackathon-prizewinners-and-summary-5d12353cc214",
                        "https://www.youtube.com/watch?v=aIq3JiTlNVA&t=1s",
                        "https://devpost.com/software/electronic-medicine-trial-and-test-records-as-a-service",
                        "https://ethglobal.com/showcase/etherglance-cjro9",
                        "https://github.com/ipfs/devgrants/",
                        "https://airtable.com/shr2xqq48PEHWzSBu/tblCwc1GeUbvwVrmU",
                        "https://github.com/aspiringsecurity/EthTransport",
                        "https://sites.google.com/view/aspiring-road-safety/home",
                        "https://moralis.io/filecoin-hackathon/winners/",
                        "https://medium.com/encode-club/encode-club-x-harmony-hackathon-prizewinners-and-summary-e088485c8af7",
                        "https://github.com/aspiringsecurity/Water-ICM",
                        "https://sites.google.com/view/latcglobal/home",
                        "https://sites.google.com/view/dronesforrealestate/home",
                        "https://sites.google.com/view/integratedwatermanagment/home",
                        "https://www.encode.club/next-video-build",
                        "https://www.youtube.com/watch?v=2USgb11kYzY",
                        "https://medium.com/encode-club/next-video-build-hackathon-prizewinners-and-summary-33f258fdc9f5",
                        "https://medium.com/encode-club/encode-club-x-harmony-hackathon-prizewinners-and-summary-e088485c8af7",
                        "https://github.com/seetadev/EthOps",
                        "https://moralis.io/filecoin-hackathon/winners/",
                        "https://drive.google.com/drive/u/3/folders/1l9ZG65js2Q-a1m8Iy3BO25dWISqr3oPk",
                        "https://garuda-hacks-3-0.devpost.com/project-gallery",
                        "http://activities.sugarlabs.org/en-US/sugar/addon/4084",
                        "http://vimeo.com/11886029",
                        "http://www.youtube.com/watch?v=-7cPHg4XJKY",
                        "http://vimeo.com/5291250",
                        "http://wiki.laptop.org/go/User:Ndoiron/SocialCalc",
                        "https://www.purplemotes.net/2009/09/13/universal-social-access-to-data-and-calculation/",
                        "http://www.informatik.uni-trier.de/~ley/db/conf/fecs/fecs2010.html",
                        "http://ojs.pythonpapers.org/index.php/tppm/article/view/149/161",
                        "https://onlinelibrary.wiley.com/doi/epdf/10.1002/hbe2.240",
                        "https://www.sugarlabs.org/",
                        "https://laptop.org/",
                        "http://activities.sugarlabs.org/en-US/sugar/addon/4084",
                        "http://www.olpcnews.com/software/applications/socialcalc_on_sugar_version_5.html",
                        "https://www.livemint.com/Industry/RXejxSDBL1x0KQQCJywU3K/Platform-aims-to-build-communities-around-ideas.html",
                        "https://bugs.launchpad.net/ubuntu/+source/sugar-0.88/+bug/617813",
                        "https://github.com/sugarlabs/read-activity",
                        "http://www.pygame.org/project-Foodforce2-1122-2375.html",
                        "https://sites.google.com/nsut.ac.in/nsutcovidcarecentre/home?authuser=0",
                        "https://www.codeforgovtech.in/",
                        "https://www.eka.care/",
                        "https://zfoh.ch/",
                        "https://zfoh.ch/zurihac2020/projects.html",
                        "https://sites.google.com/view/nsutiif/home",
                        "https://www.youtube.com/watch?v=jOn5-ZPhqi8",
                        "https://github.com/i-am-Pony/MyKidsNFT_Project",
                        "https://sites.google.com/view/departmentofdesign/student-glimpse?authuser=0",
                        "http://www.nsit.ac.in/divisions/mg/dept_mg_workshops/",
                        "http://nsut.ac.in/nsutiif/",
                        "https://www.sugarlabs.org/",
                        "https://laptop.org/",
                        "https://data.gov.in/",
                        "https://developer.samsung.com/",
                        "https://developer.amazon.com/",
                        "https://github.com/near-examples",
                        "https://www.encode.club/l2-accelerator",
                        "https://forum.trondao.org/",
                        "https://urbit.org/ecosystem",
                        "https://sites.google.com/view/nsutiif/home",
                        "https://sites.google.com/view/departmentofdesign/student-glimpse?authuser=0",
                        "https://yukti.mic.gov.in/",
                        "https://www.aicte-india.org/Initiatives/smart-india-hackathon",
                        "https://sites.google.com/view/nsutiif/home",
                        "http://nsut.ac.in/nsutiif/",
                        "https://yukti.mic.gov.in/",
                        "https://www.aicte-india.org/Initiatives/smart-india-hackathon",
                        "https://gov.optimism.io/t/grant-proposal-template/3233"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.602888860314604
                },
                {
                    "author_link": "https://gov.optimism.io/u/seetadev",
                    "index": "2",
                    "likes": "3",
                    "time": "03/02/2023-15:48:57",
                    "content": "@GrantsOps @lavande  Wish to share addition of the contact information for our team member, Vibhor Bijoy along with other key information that we wish to add in our proposal Vibhor Bijoy: (Email: bijoy.vibhor19@gmail.com ) (Github: vibsdrockstar (Vibhor) · GitHub ) Wish to share our contact information too: Manu Sheel Gupta:  (discord: manusheel#3075) (Email: [manu@seeta.in] , [aspiring.investments@gmail.com] (Github: seetadev (SEETA) · GitHub ) (Twitter: https://twitter.com/manusheel) Deepti Gupta:  (Discord: deeptigupta#4290) (Email: [deepti.kotwal.2011@gmail.com]) (Github: aspiringsecurity · GitHub ) OP Medicine Github Link: aspiringsecurity/EMTTR: Secure, Transparent Drug Testing Pipeline: Improving Data Transparency in Drug Testing (github.com) Wish to share other relevant links: Youtube Channel: https://www.youtube.com/channel/UCigU_PpCCLimKxIHsSf5EvQ Twitter Channel: Transformation from Web2 to Web3 on Optimism at Aspiring Investments Corp (@aspiringapps) / Twitter Other Notable Projects enabling OP community participation: LATC Global (Microgrant at IPFS: [MICROGRANT] Drone Monitor · Issue #281 · ipfs/devgrants · GitHub)    sites.google.com   Drones for Real Estate INSPIRATION         sites.google.com   Water Management Vision      Aspiring Road Safety (Microgrant at IPFS: [MICROGRANT] Eth Transport · Issue #263 · ipfs/devgrants · GitHub) Community Initiative for running OP hackathons and pre-incubation programs in healthcare and mobility: NSUT IIF Collaboration with Design Department, NSUT on running OP hackathons: Please visit Department of Design ",
                    "links": [
                        "https://github.com/seetadev",
                        "https://twitter.com/manusheel",
                        "https://github.com/aspiringsecurity/",
                        "https://github.com/aspiringsecurity/EMTTR",
                        "https://www.youtube.com/channel/UCigU_PpCCLimKxIHsSf5EvQ",
                        "https://twitter.com/aspiringapps",
                        "https://sites.google.com/view/latcglobal/home",
                        "https://github.com/ipfs/devgrants/issues/281",
                        "https://sites.google.com/view/dronesforrealestate/home",
                        "https://sites.google.com/view/dronesforrealestate/home",
                        "https://sites.google.com/view/integratedwatermanagment/home",
                        "https://sites.google.com/view/integratedwatermanagment/home",
                        "https://sites.google.com/view/aspiring-road-safety/home",
                        "https://github.com/ipfs/devgrants/issues/263",
                        "https://sites.google.com/view/nsutiif/home",
                        "https://sites.google.com/view/department-of-design/home"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.7109375
                },
                {
                    "author_link": "https://gov.optimism.io/u/TheDoctor",
                    "index": "3",
                    "likes": "3",
                    "time": "05/02/2023-15:22:58",
                    "content": "This is a big deal, I guess there are some difficult details to solve at different layers.   Technical: The medical row data file stored in IPFS would be encrypted or just anonymized and is the ID that is encrypted ( I suppose both). DNA data for instance is simple to compare between anyone, but some other data depend on some standards, calibration, etc. Radiological image is working well using AI algorithms, Is it easy to find a standard way of coding it in this case? I guess it’s not the same in a simple Rx in some other cases like flow cytometry, RMI, FMRI, evoking potential, etc. It may depend on some standards on the device, reactivates, calibration, and especially people performing the test.   Legal: I suppose the project has Indian regulations, and that’s a huge deal for the size of the country. It could be a game changer in medical research. How do you see this for other regulations like USA or EEUU?   Optimism: optimism’s view is open-sourced and let’s hope we finally get ways to incentivize governance collaboration vs competition. Are you or will you contact other projects around the ecosystem or even merge and join with them in a fair way if necessary? Thinking in the DeScience community projects working on technical solutions for ZK proof systems, sharding, soul-bonding ID (imagine losing access to your medical Data), etc.   I very much hope OP collective has the resources to evaluate properly you’re proposal and we don’t let go of people like your team from this community. Cheers ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.109876543209877
                },
                {
                    "author_link": "https://gov.optimism.io/u/seetadev",
                    "index": "4",
                    "likes": "1",
                    "time": "05/02/2023-19:26:56",
                    "content": "Thank you so much for your feedback, encouragement and pointers. Appreciate it. Wish to share our thoughts/ response on each of the vital key points shared in the feedback:   Technical: Anonymization and authorization for radiological data including X Rays, CT Scan, MRI images and Nuclear medicine can be achieved following standard methods of coding using PyDICOM open source library. We did try this for a variety of X Ray and other radiological images and accomplished it for hospitals in Noida (India), Greece and an NHS hospital (UK). We also have similar standard methods for anonymizing DNA data using open source software. We will commit the scripts that we wrote in Python for not only anonymizing the radiological data but also automating the process. We will update on this thread soon and will appreciate your feedback on it.   Legal: Wish to share that we have reasonable experience collaborating with organizations, who work with NHS and NIH. As guided by them, there are some very key principles and goals we need to follow before accessing and working with medical data of any kind. Example: DICOM radiology data comprises of both image and patient meta data. So, for any modality, we need to arrive at a set of parameters for anonymizing and encrypting the data before sharing it for medical research. There are key guidelines on taking consent from the patient and also sharing about CRO’s interests on using the data for medical research. Till now, we have also accomplished data collection, anonymization and storage by collaborating with medical colleges and research institutions. It has been easier for us to focus on improving the state of art in reference to IT, machine learning, decentralization and networking aspects while our pilot partners and organizations take care of the legal aspects. We appreciate your feedback and will keep you posted on the developments on this aspect as well.   We are more than happy to collaborate, learn and even merge with other eco-system projects if that helps the community and medical research family. DeScience community projects are a great place for us to learn, educate and improve our technical solution. Great community indeed and we will definitely look for technical solutions for ZK proof systems, sharding, soul bonding ID and even integrating with proxy re-encryption solutions using Optimism for scaling. Thank you so much once again.   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.698529411764706
                },
                {
                    "author_link": "https://gov.optimism.io/u/TheDoctor",
                    "index": "5",
                    "likes": "2",
                    "time": "06/02/2023-00:29:57",
                    "content": "Thanks for your detailed response. I am so bullish to see this project succeed. I was doing some research a few years ago with the Watson analytics solution IBM released for medical applications, it was too soon and we had many expectations for NLP, image processing was more successful. But I think now we have the best opportunity with decentralization + AI new power. I look forward to hearing more community feedback. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.8931818181818185
                },
                {
                    "author_link": "https://gov.optimism.io/u/seetadev",
                    "index": "6",
                    "likes": "1",
                    "time": "06/02/2023-16:46:41",
                    "content": "Thank you once again for your encouragement and wonderful feedback. Appreciate it. Watson analytics solution by IBM was indeed an interesting and insightful initiative. NLP, image processing have indeed evolved tremendously and very quickly. Decentralization + AI along with automation provides a very neat opportunity towards improving healthcare and medicine. Completely agree. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.138888888888889
                }
            ]
        }
    ],
    "group_index": "509"
}