{
    "poll_list": [
        {
            "id": "0x0ddd965be7471ca3d399af6b845791d86c649389e22681df1f62473d01a9a5fd",
            "title": "Season 2 Governance Fund Proposal: Interest Protocol 2",
            "discussion": "https://gov.optimism.io/t/review-gf-phase-1-interest-protocol-development-deployment-to-optimism/2951?u=gfxlabs",
            "body": "This Governance Fund Phase 1 proposal is eligible for voting in Cycle 6. For a complete list, check out Voting Cycle 6 Roundup.\nThis proposal is slated for review and recommendation by [committee name/link]. Please refer to [their thread] for this cycle to read more. Committees will post their recommendations by the 3rd day of the Voting Week.\nAs a reminder, since this is the first vote since the introduction of committees: by approving committees, the Token House entered a social contract to entrust and delegate the bulk of decision-making to the committee. Therefore, any delegates voting against the committee recommendation are expected to provide a justification to the community as to why they voted differently.",
            "choices": [
                "For",
                "Against",
                "Abstain"
            ],
            "scores": [
                11153999.66780192,
                180348.59501453937,
                8617.965396102225
            ],
            "start": 1663945283,
            "end": 1664391683,
            "snapshot": "24890314",
            "state": "closed",
            "author": "0x47C88bb92B409fF25F6587EA611fac4e55f76007",
            "space": {
                "id": "opcollective.eth",
                "name": "Optimism Collective"
            }
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/review-gf-phase-1-interest-protocol-development-deployment-to-optimism/2951",
            "title": "[REVIEW] [GF: Phase 1] Interest Protocol Development/Deployment To Optimism ",
            "index": 2951,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Governance Fund: Phase 1"
            ],
            "tags": [
                "cycle-6",
                "passed"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/GFXlabs",
                    "index": "1",
                    "likes": "3",
                    "time": "11/07/2022-14:04:53",
                    "content": "Project Name: Interest Protocol Author Name and Contact: GFX Labs; governance@gfxlabs.io I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: Yes Number of OP tokens requested: 31,764 OP L2 Recipient Address: 0xa6e8772af29b29B9202a073f8E36f447689BEef6 Grant Category: DeFi Is this proposal applicable to a specific committee? Yes. One of the DeFi Committees. Project Description: Interest Protocol is a fractional reserve, overcollateralized borrowing protocol. IP software allows users to permissionlessly generate USDi stablecoins against their collateral assets. Users may also swap USDC for USDi (and vice versa) at a 1:1 exchange rate through the protocol. All USDi utilize rebasing to report accrued fees. USDi accrues through fees paid by borrowers. Project Links: Website Twitter Discord Please link to any previous projects the team has meaningfully contributed to: To avoid forum clutter, this can be disclosed privately upon request. Relevant Usage Metrics: On Ethereum, Interest Protocol ranks 118th in TVL after less than 1 month, and $3.9m in overcollateralized loans (both at time of writing). Competitors, peers, and similar projects: Compound and Aave are both competitors. Similar projects (overcollateralized while also fractionally reserved) are difficult to locate. Is/will this project be open sourced? Yes. Optimism native? No. Date of deployment/expected deployment on Optimism: Ultimately up to IP governance, but this grant would likely prioritize that deployment to the immediate future. Ecosystem Value Proposition: Interest Protocol plans to support the OP token as collateral on Optimism. Interest Protocol is designed to allow tokens held as collateral to still be able to participate in governance via delegation controlled by the user. This means token holders – in particular small holders whose governance voice is not particularly loud – avoid choosing between using their OP to finance on- or off-chain priorities, or participating in Optimism governance. Has your project previously applied for an OP grant? No. But there is a separate grant request for this project for an incentives subsidy. Did the project apply for or receive OP tokens through the Foundation Partner Fund? No. Proposal for token distribution (under 1000 words): How will the OP tokens be distributed? The tokens will be used to partially fund deployment and development costs for an Optimism instance of Interest Protocol. How will this distribution incentivize usage and liquidity on Optimism? Interest Protocol would accept OP as a collateral at deployment, and preserve the ability of OP holders to delegate their voting rights. This serves the dual purpose of providing a demand sink for OP that would otherwise be sold, and allow OP holders a venue where they can avoid choosing between liquidity and governance participation. Normally there is an implicit “tax” to pay by retaining governance tokens for voting or delegation, since the opportunity to use it as collateral must be given up. Interest Protocol is designed to avoid this choice. On its Ethereum deployment, for instance, UNI tokens used as collateral can still delegate voting power to be used in Uniswap’s governance.  Screen Shot 2022-07-12 at 12.23.35 PM1094×1048 70.1 KB  Screenshot from Ethereum Interest Protocol highlighting delegation of collateral. We believe this results in a healthier governance ecosystem where small holders in particular continue to participate, since they do not have to choose between financial and governance utility of their tokens. Why will the incentivized users and liquidity remain after incentives dry up? This request is to fund deployment and development of a protocol that will provide utility to OP holders and the Optimism ecosystem. Over what period of time will the tokens be distributed? The tokens for would be sold as expenses accrue, since the grant is to fund development and deployment. How much will your project match in co-incentives? GFX Labs and/or Interest Protocol governance will cover the remainder of expenses related to Optimism deployment and all ongoing maintenance. Budget Estimate  Protocol testing prior to production deployment: 56 developer hours Front end multichain support: 10 developer hours Analytics back end support: 10 developer hours Governance bridge contract development & deployment: 38 developer hours Protocol integrations with other ecosystem apps: 48 developer hours  Estimated total: 162 developer hours This request is for an Optimism grant to cover 50% of estimated costs. $OP price of $0.51 (at time of writing) * 81 hours * $200/hour = 31,764 OP ",
                    "links": [
                        "https://interestprotocol.io/#/landing",
                        "https://twitter.com/interestdefi?lang=en",
                        "https://discord.gg/BjxN6t4MXN",
                        "https://defillama.com/protocol/interest-protocol",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/9/96959709eb37a720469426c5c9131506036c6a53.jpeg",
                        "https://gov.optimism.io/t/defi-shadow-committee-b-season-2-recommendations/3549/9",
                        "https://gov.optimism.io/t/defi-committee-c-season-2-recommendations/3437/4",
                        "https://gov.optimism.io/t/voting-cycle-6-roundup/3481/16",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/9",
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-overnight-fi/3536/23",
                        "https://gov.optimism.io/t/defi-latam-delegate-communication-thread/2950/8",
                        "https://gov.optimism.io/t/gfx-labs-delegate-communication-thread/2728/16",
                        "https://gov.optimism.io/t/review-gf-phase-1-interest-protocol-post-deployment/2968/7"
                    ],
                    "GPT-summary": "The post is a proposal for an Optimism grant for the development and deployment of Interest Protocol, a fractional reserve, overcollateralized borrowing protocol. The proposal explains the project, its usage metrics, competitors, and ecosystem value proposition. The author also provides a budget estimate and a proposal for token distribution. A 3rd party could give constructive criticism, extend to the proposal, or ask questions about it.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Interoperability and Scaleability",
                        "Token economics",
                        "Smart contract updates",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 4.918010752688172
                },
                {
                    "author_link": "https://gov.optimism.io/u/Defi_LATAM_axlvaz",
                    "index": "2",
                    "likes": "0",
                    "time": "12/07/2022-14:45:52",
                    "content": "HIGHLIGHTS  The funding request is reasonable They are not implemented in OP, although the grant is requested for implementation in Optimism, the current TVL in Ethereum is not relevant. Currently in Optimisim there are several lending protocols implemented, subsidizing their implementation in Optimism I don’t see that it really adds value to the chain  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.166666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/GFXlabs",
                    "index": "3",
                    "likes": "0",
                    "time": "12/07/2022-15:50:25",
                    "content": "    Defi_LATAM_axlvaz:  Currently in Optimisim there are several lending protocols implemented, subsidizing their implementation in Optimism I don’t see that it really adds value to the chain   Thanks for taking a look! We think a major value add is that Interest Protocol would accept OP as collateral, which should improve the utility of the OP token. To date, we are only aware of one small protocol that has onboarded OP as collateral. Note that Interest Protocol does not lend out collateral, so unlike a Compound or Aave fork, OP on the platform could not result in short-selling pressure in times of market stress. Additionally, Interest Protocol is built to allow users to continue to utilize their tokens for governance. On Ethereum, for instance, users who place UNI in their vaults are still able to delegate the voting power and participate in Uniswap governance. This means OP holders can realize both financing against their tokens and participation in Optimism governance. This should result in a healthier governance ecosystem where small players do not abandon governance simply because the financial rewards of collateralizing their tokens are significant. Again, appreciate your feedback! We’ll try to highlight the value add to Optimism more prominently ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.7437499999999995
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "4",
                    "likes": "0",
                    "time": "13/07/2022-18:38:50",
                    "content": "this, is both proposals of yours? I would recommend submitting the proposal once they are live on OP chain. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.681818181818182
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "5",
                    "likes": "2",
                    "time": "15/07/2022-00:03:55",
                    "content": "If Interest Protocol is unique in preserving the OP lender’s voting rights, then I’d say this lends considerable value to Optimism that isn’t being properly appreciated. OP lending with governance → more inherent value in holding voteable OP → greater incentive to buy & keep OP & more butts in governance seats (something evidently in high demand here) Think this deserves some attention as a straightforward layer value play. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.6937500000000005
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "6",
                    "likes": "0",
                    "time": "27/07/2022-11:21:18",
                    "content": "Like with other DeFi protocols it would perhaps make sense to make the proposal after you have deployed in optimism and do the usual OP incentivization request along with matching co-incentives from your side. That said, I think the request is quite small and minimal and I personally don’t shy away from giving funding for development. I also like that you would like to accept OP as collaterall and even retain voting rights at deposit. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 3.9791666666666665
                },
                {
                    "author_link": "https://gov.optimism.io/u/GFXlabs",
                    "index": "7",
                    "likes": "0",
                    "time": "13/09/2022-21:20:36",
                    "content": "@jackanorak @lefterisjp Apologies for the tag, but with the updated manual, delegates have been given a specific phrase to signal support to bring a proposal to a vote. ”I am an Optimism delegate [link to your delegate commitment] with sufficient voting power and I believe this proposal is ready to move to a vote.\" This is per the updated guidelines and we prefer not to take a chance that your support is overlooked! Thank you for understanding (we had to do the same on another proposal or two) ",
                    "links": [
                        "https://gov.optimism.io/t/delegate-commitments/235"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.416666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "8",
                    "likes": "1",
                    "time": "13/09/2022-21:34:15",
                    "content": "You got it @GFXlabs . Problem is that someone archived the delegate commitment post so boardroom will have to suffice for now. EDIT: turns out nobody archived the delegate commitment post. no idea how i got that one wrong. I am an Optimism delegate [Delegate Commitments - #136 by jackanorak] with sufficient voting power and I believe this proposal is ready to move to a vote. I do have one more question, though – say someone intends to borrow and self-delegate OP. Will they always be unable to do so, or does it depend on whether the lender has delegated? ",
                    "links": [
                        "https://gov.optimism.io/t/voting-cycle-6-roundup/3481/16"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.625
                },
                {
                    "author_link": "https://gov.optimism.io/u/GFXlabs",
                    "index": "9",
                    "likes": "1",
                    "time": "13/09/2022-21:35:26",
                    "content": "    jackanorak:  I do have one more question, though – say someone intends to borrow and self-delegate OP. Will they always be unable to do so, or does it depend on whether the lender has delegated?   USDi is the only borrowable asset on Interest Protocol, and can be swapped for USDC. OP would be a collateral only. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "10",
                    "likes": "1",
                    "time": "13/09/2022-21:35:36",
                    "content": "also wouldn’t mind an update on IP’s deployment timing, actually ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "11",
                    "likes": "1",
                    "time": "13/09/2022-21:36:09",
                    "content": "even better, to be honest ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/GFXlabs",
                    "index": "12",
                    "likes": "1",
                    "time": "13/09/2022-21:38:42",
                    "content": "    jackanorak:  also wouldn’t mind an update on IP’s deployment timing, actually   To Optimism? Quickly, but we don’t have the ability to promise a target date. If this proposal passes, we would expect it to be deployed within weeks, but that is ultimately up to IP token holders and delegates over on mainnet and constrained by developer hours if they’ve already been booked for a given time period. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.555555555555555
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "13",
                    "likes": "1",
                    "time": "13/09/2022-22:17:13",
                    "content": "Hey GFXLabs, don’t we do it via committees now? I thought that you would have to apply to a committee now that they have formed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/GFXlabs",
                    "index": "14",
                    "likes": "0",
                    "time": "13/09/2022-23:23:53",
                    "content": "Our understanding is that to advance to a vote two delegates (not the proposer) need to endorse its readiness. Committees will then make recommendations several days after voting begins. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Netrim",
                    "index": "15",
                    "likes": "0",
                    "time": "14/09/2022-00:45:52",
                    "content": "That is correct, the Committees will issue a recommendation UP to 3 days after voting has started (I think the ideal is to happen before). Regarding the mechanic as a value proposition for Optimism, I would lend OP to Interest Protocol and mint USDi, but I will keep my delegation power. Will you also partner with a DEX to incentivize USDi/TOKEN liquidity? I am assuming USDi is a composable ERC20 token. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 9.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/GFXlabs",
                    "index": "16",
                    "likes": "0",
                    "time": "14/09/2022-13:58:44",
                    "content": "    Netrim:  Will you also partner with a DEX to incentivize USDi/TOKEN liquidity? I am assuming USDi is a composable ERC20 token.   That would be up to IP governance. USDi can be freely converted to USDC held in IP’s reserves, so even if liquidity for USDi itself is limited, it can still be swapped – similar to Maker allowing DAI to be swapped permissionlessly for USDC and USDP. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.5476190476190474
                },
                {
                    "author_link": "https://gov.optimism.io/u/ScaleWeb3",
                    "index": "17",
                    "likes": "1",
                    "time": "20/09/2022-10:28:39",
                    "content": "We went through the whitepaper a while ago and liked a couple of innovative ideas:  Different ICO sale strategy Efficiency (Potentially able to quickly scale with higher utilization rate) Possibility of voting/delegation  The project is at the earliest stage with the ongoing ICO which likely takes longer than the originally envisioned 32 days with currently 124 holders & few daily purchases and we’d like to see the protocol risk (management - especially liquidity risk) play out a bit. Re: The proposal   Benefits for Op could be very strong: Op as Collateral, Op can still be used for governance, (Co-)Incentives can lead to strong initial & potentially sustained growth with IP efficiency   Risk: Similar to onboarding toxic assets in a lending protocol, Optimism should be cautious of incentivizing projects that potentially add significant risk to users in the ecosystem. We are a bit worried about the fractional reserve model which may lead to locked up user funds (+ bad debt in case of toxic assets, liquidation failures, other protocol bugs).   The size of this dev grant is small and a no-brainer. Despite not being fans of funding development, we’d support the 31,764 OP tokens for deployment.   The size of the other, main grant proposal (240K Op) is also reasonable for a new, value-adding project though we’d prefer to see the initial sale finish, more certainty around the date of deployment & Op distribution as well as protocol risk management before incentivizing growth with Op tokens.   (Not sure why there are 2 proposals on the forum.) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.566039707419018
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "18",
                    "likes": "2",
                    "time": "20/09/2022-13:46:50",
                    "content": "@GFXlabs wrote in the other thread:  Deployment to Optimism would likely not be prioritized to the same extent over other work (such as collateral onboardings) if the smaller proposal is not approved. Interest Protocol has decentralized token governance, so that’s obviously just a guess since any token holder with enough IPT or delegated votes could put forth a proposal to prioritize an Optimism deployment over other work.   These were broken into separate proposals to give governance the option to vote on each piece separately, since one is to defray deployment expenses and is quite small, while this proposal is targeted at more traditional co-incentivization and larger in size.  For what it’s worth, I do appreciate the option to consider individual asks separately like this. And I think funding development to move migration further up a project’s roadmap is absolutely the kind of thing we should be doing if our objective is to facilitate growth. @ScaleWeb3  says:  (Not sure why there are 2 proposals on the forum.)  You answered your own question. It’s an opportunity to get the ball rolling with a marginal ask. @GFXlabs reasons: doesn’t hurt to ask for incentives today. But if not having deployed is a nonstarter, the thinking is that splitting up the proposals helps devs get migration across the finish line faster. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.038043478260869
                },
                {
                    "author_link": "https://gov.optimism.io/u/MoneyManDoug",
                    "index": "19",
                    "likes": "1",
                    "time": "21/09/2022-17:36:39",
                    "content": "As an Optimism delegate with voting power above the required threshold I believe this proposal is ready. Delegate Commitments - #71 by MoneyManDoug ",
                    "links": [
                        "https://gov.optimism.io/t/voting-cycle-6-roundup/3481/16"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "20",
                    "likes": "0",
                    "time": "23/09/2022-22:17:09",
                    "content": "Recommendation from Defi Committee C is  in Favour of this proposal. Reasoning:-  image3490×494 53 KB  ",
                    "links": [
                        "https://gov.optimism.io/t/defi-committee-c-season-2-recommendations/3437/4",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/3/34a9312498fb2b8a6ceb10b60462ba3bacfc3016.png"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Butterbum",
                    "index": "21",
                    "likes": "0",
                    "time": "25/09/2022-16:17:23",
                    "content": "I have voted against this proposal and the recommendation. My reason for voting against, is the allocation is simply providing a team with working capital I refer to…    Grant Proposal Template   driving sustainable usage and engagement on Optimism (rather than simply providing teams with working capital or voting power).   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "22",
                    "likes": "1",
                    "time": "25/09/2022-20:31:54",
                    "content": "The shadow defi committee  – which is not an official committee – has published a review in support of this proposal. Aside from the broader merits of the lending protocol, which we’re still discussing, we view this proposed grant as a low-cost means of delivering a clear value-add to OP governance: allowing collateral to be delegated. We believe that deploying this capability will grant users more flexibility with their OP tokens while filling gaps in governance participation. We also commend @GFXlabs for splitting their initial proposal into two staged ones and suggest that other projects consider doing the same, depending on their asks. ",
                    "links": [
                        "https://gov.optimism.io/t/defi-shadow-committee-b-season-2-recommendations/3549/9"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.475
                },
                {
                    "author_link": "https://gov.optimism.io/u/katie",
                    "index": "23",
                    "likes": "0",
                    "time": "26/09/2022-16:21:44",
                    "content": "Voted yes - Following Defi Committee C recommendation ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "24",
                    "likes": "0",
                    "time": "26/09/2022-21:35:56",
                    "content": "Voted for the proposal after the Defi C committee recommendation ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Bobbay_StableLab",
                    "index": "25",
                    "likes": "1",
                    "time": "27/09/2022-12:01:28",
                    "content": "Vote: Yes Rationale: Small request to help accelerate the onboarding of a strong protocol to Optimism. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.458333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/arabianhorses",
                    "index": "26",
                    "likes": "0",
                    "time": "27/09/2022-15:36:07",
                    "content": "Voted FOR They are going to use this fund for opening a new using area for $OP, the allocation request is seen as reasonable when we think of this purpose. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.840909090909091
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "27",
                    "likes": "0",
                    "time": "29/09/2022-19:13:47",
                    "content": "Snapshot vote - passed ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "28",
                    "likes": "0",
                    "time": "29/09/2022-19:13:49",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "29",
                    "likes": "0",
                    "time": "30/09/2022-21:27:29",
                    "content": "@GFXlabs can you provide a Telegram handle or other contact method so the Optimism team can get in touch about paying out this grant! Feel free to comment on this thread, DM, or email palash@optimism.io ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.609375
                }
            ]
        }
    ],
    "group_index": "150"
}