{
    "poll_list": [
        {
            "id": "0x8ebe3b30462211e55f7f2d0ba60126f810c3a330b2b8aa935ea0f4c05dacb257",
            "title": "Proposal H: Governance Fund Phase 1 - WardenSwap",
            "discussion": "https://gov.optimism.io/t/ready-gf-phase-1-proposal-wardenswap/2712",
            "body": "This Governance Fund Phase 1 proposal has been marked ready and as such is eligible for voting in Cycle 2. This proposal HAS been approved as ready for vote by a delegate. For more info, check out Voting Cycle 2 Roundup: [https://gov.optimism.io/t/voting-cycle-2-roundup/2754](https://gov.optimism.io/t/voting-cycle-2-roundup/2754)\n\nLink to proposal: https://gov.optimism.io/t/ready-gf-phase-1-proposal-wardenswap/2712",
            "choices": [
                "Yes",
                "No",
                "Abstain"
            ],
            "scores": [
                9261556.56730744,
                4185297.891588347,
                3104340.6935514733
            ],
            "start": 1656011736,
            "end": 1657134936,
            "snapshot": "12842149",
            "state": "closed",
            "author": "0x47C88bb92B409fF25F6587EA611fac4e55f76007",
            "space": {
                "id": "opcollective.eth",
                "name": "Optimism Collective"
            }
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/ready-gf-phase-1-proposal-wardenswap/2712",
            "title": "[READY] [GF: Phase 1 Proposal] WardenSwap ",
            "index": 2712,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Governance Fund: Phase 1"
            ],
            "tags": [
                "cycle-2",
                "passed"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/Panas",
                    "index": "1",
                    "likes": "60",
                    "time": "17/06/2022-17:02:05",
                    "content": "Project Name : WardenSwap Author Name: Panas Number of OP tokens requested: 300,000 L2 Recipient Address: 0xc146a672c85b408a9a7bc00f74ad567b7684134c  Overview of WardenSwap: WardenSwap is the real-time best rate DEXes aggregator using AI Power to deliver the very best swap rates and lowest gas price from all markets in one place on wardenswap.finance. WardenSwap is proposing the idea of a sustainable ecosystem alongside the pillar of creating a strong community. WardenSwap launched MetaWarden, a NFT project which is aimed to boost the circular economy and community around the WardenSwap ecosystem. Furthermore, with 3 types of SDK for dApp developers to operate WardenSwap elsewhere. WardenSwap is live on Optimism, building on top of the concept of Data optimization method to pull out smaller data stored on Ethereum which causes lower gas cost by introducing compression techniques to make the Calldata smaller using “Address Table” and “Data Serialization”. ( WardenSwap 2.0 on Optimism)  Relevant Usage Metrics  Here are our metrics, all number is on the time of writing (17 June) Transaction Total Transaction: 1,113,100 tx Total Optimism Transaction: 11,097 tx (Since 19 April, 60 days) Volume Total trading volume: $4,276,184,771 (All Chains) Total Optimism volume: $3,392,877 (Since 19 April, 60 days) Unique address Total unique address: 70,119 addresses Unique address on Optimism: 2,293 addresses  Optimism alignment  WardenSwap hopes to encourage growth within the Optimism ecosystem by using subsidies, we hope to support the integrations and developments within L2. In addition, we want to sustainably boost Optimism and run with a good level of liquidity in order to migrate more of our activities to Optimism in the future.   WardenSwap will automatically locate the best swap rates and best gas across multiple pools for swappers on the Optimism network, providing them the best pricing. With the WardenSwap 2.0 Bloodstone upgrade, our splitting feature can split the trading volume to be as small as 1% in trading size in order to get a better price (the previous minimum trading size was 10%). This means the more it splits, the better price users will get   WardenSwap allows for community integrations by providing SDK which can freely integrate with WardenSwap by using our open-source (See gitbook for more information). 3 types of SDK we provided effortless and friendly to our community    Library For developers Customizable UI Kits that we ensure it is easy to implement Referral link program for both dApp and users These 3 SDK construct as another monetization strategy to earn the profit sharing from trading fees.   WardenSwap is supporting the Optimism ecosystem including NFT collection and product. We propose the use case of NFT on Optimism through a discount of trading fee. It is now shown that 40% of users on the Optimism chain in WardenSwap owned Optipunk.  To summarize: WardenSwap aims to build a community by providing both of the best trading experience for users on Optimism and adopt the ecosystem of Optimism at the same time.  Proposal for token distribution  How will the OP tokens be distributed? Currently, the following distribution will be proposed:  Builders (25%)   On top of WardenSwap, we have shown what can be done with our SDK tool for dApp developers, WardenSwap will create a thriving Optimism ecology and encourage the builders who successfully integrate WardenSwap in the Optimism ecosystem, with all support and a bonus plan depending on the metrics. Further by the Grants Program or Hackathon, WardenSwap aims to back up dApp developers to fund the project, selecting by community which is Optimism related. These are examples of our vision to dedicate ourselves for public goods that benefit the entire community and align with the Optimism ideal.  Traders (20%)   $OP will be incentive directly to the users of WardenSwap on Optimism as an opportunity to early adopter, active users, along with new users to increase the activity of trading in WardenSwap on Optimism. However, we believe that experience that traders will get from Optimism is absolutely valuable, and it will attract more activity on its own.  Referral Program (10%)   WardenSwap will also distribute $OP to referral programs users which benefit referrers who use referral link programs on Optimism through WardenSwap to spread the power of Optimism.  Marketing: Ecosystem & Optimism Representing (35%)   $OP will be used as a part of marketing campaigns targeted on Optimism, including the events for the WardenSwap community that make impact on Optimism, the competition which can take in many forms for different contributors such as researchers, and content creators. Also incentive to influencers that help the WardenSwap community on Optimism to create marketing programs and promotion.  Development & Maintenance (10%)   $OP will be dedicated to cover the development and maintenance cost of Optimism related project  How will this distribution incentivize usage and liquidity on Optimism?  More users will be enticed to join WardenSwap as a result of these distributions, giving the protocol more usage. In combination with the developer subsidies it would strongly encourage developers to switch to Optimism.  Why will the incentivized users and liquidity remain after incentives dry up?  We build things that last long WardenSwap knows that incentive programs will never last long, but we have absolute trust in smart contracts that are built on Optimism will be long lasting.WardenSwap always carry on our mission to deliver the best swap rates and best gas across multiple pools, which will stay to benefit WardenSwap users on Optimism to brings about a better outcome (Yes, save users’ money).  How much will your project match in co-incentives? We are currently unable to co-incentivize, but we may work on it in as a campaign that is related to Optimism, also we do believe in the future of Optimism that there is a lot of opportunity, WardenSwap will move along forward to work with other Optimism’s partners which help Optimism to strengthen their community.  Over what period of time will the tokens be distributed? According to WardenSwap’s plan, the $OP tokens will be distributed within a 1 year period. ",
                    "links": [
                        "https://medium.com/wardenofficial/the-tech-behind-wardenswap-2-0-on-optimism-72a32516a1eb",
                        "https://docs.wardenswap.finance/warden/wardenswap-sdk/profit-sharing-program",
                        "https://gov.optimism.io/t/voting-cycle-2-roundup/2754"
                    ],
                    "GPT-summary": "The post is a proposal for WardenSwap, a real-time best rate DEX aggregator using AI power to deliver the best swap rates and lowest gas price from all markets in one place. The proposal includes an overview of the project, relevant usage metrics, Optimism alignment, proposal for token distribution, and how the distribution will incentivize usage and liquidity on Optimism. The post explains the distribution of OP tokens and how they will be used to incentivize developers, traders, and marketing campaigns. The post also mentions the use of NFTs and SDKs to build a community around WardenSwap. Overall, the post is an explanation of the WardenSwap project and its proposal for token distribution.",
                    "GPT-proposal-categories": [
                        "Interoperability and Scalability",
                        "Token economics",
                        "Community and engagement",
                        "Grants, Funding and resource allocation",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 6.291368353868354
                },
                {
                    "author_link": "https://gov.optimism.io/u/investgineer",
                    "index": "2",
                    "likes": "8",
                    "time": "17/06/2022-17:43:37",
                    "content": "Thank you, Panas, for putting this proposal together. WARDEN’s spirit of boosting the Optimism ecosystem and incentivizing the users is admirable. However, I propose that the budget for incentivizing users and builders be separated in order to preserve the “Public Good Funding” ethos of Optimism and transparency. A high priority should be given to the projects that build on top of WARDEN’s SDK. Optimism’s ecosystem will be more sustainable as a whole. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.06
                },
                {
                    "author_link": "https://gov.optimism.io/u/PSN",
                    "index": "3",
                    "likes": "3",
                    "time": "18/06/2022-01:49:58",
                    "content": "great, I agree with this idea. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Justin",
                    "index": "4",
                    "likes": "1",
                    "time": "18/06/2022-05:18:39",
                    "content": "Hi!  Your “traders & builders” section includes at least 4 different groups to incentivize: retroactive traders; future traders; referrers; and builders.  Can you provide more detail on what % of the tokens you would allocate to each of those 4 groups? I am generally interested in marketing activities - can you provide any more detail on what type of promotional campaigns you intend to engage in? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.791666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/maykung",
                    "index": "5",
                    "likes": "4",
                    "time": "18/06/2022-10:07:56",
                    "content": "I second this. I think the distribution for traders and builders should be separated. Builders should be prioritized in order to expand Optimism ecosystem as well as Warden itself. For Metawarden, not sure if the team has plan to release a collection specifically on Optimism network? Perhaps providing a privilege for the original Metawarden like a whitelist for minting would be a good idea to attract those NFT holders to Optimism. An idea to be able to bridge Metawarden to OP is interesting as well. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.520833333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/CatloverWad",
                    "index": "6",
                    "likes": "1",
                    "time": "18/06/2022-14:01:45",
                    "content": "Wow.  Warden is the best ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "7",
                    "likes": "3",
                    "time": "19/06/2022-11:39:36",
                    "content": "    Panas:  55% of $OP incentive directly to the users of WardenSwap as an opportunity to users which onboarded in the early phase along with new users to increase the activity of trading in WardenSwap on Optimism and also benefit to referrers who use referral link program on Optimism through WardenSwap. We likewise encourage the builders such as dApp developers who successfully integrate WardenSwap in the Optimism ecosystem with a bonus plan depending on the metrics   Is it possible to break this into two section? one for users and other for dev? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.686688311688312
                },
                {
                    "author_link": "https://gov.optimism.io/u/tomoonae",
                    "index": "8",
                    "likes": "1",
                    "time": "19/06/2022-15:58:57",
                    "content": "I really love wardenswap and I like this idea. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/wcc",
                    "index": "9",
                    "likes": "1",
                    "time": "20/06/2022-08:15:31",
                    "content": "+1 for this. 55% is the majority portion, so would be great to see how the breakdown. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/adaykak",
                    "index": "10",
                    "likes": "1",
                    "time": "20/06/2022-09:01:36",
                    "content": "good job  i love warden ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Panas",
                    "index": "11",
                    "likes": "0",
                    "time": "20/06/2022-10:12:53",
                    "content": "Thank you @investgineer, we also see the point that you have mentioned. We will continue to collect all feedback and keep going forward.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Panas",
                    "index": "12",
                    "likes": "0",
                    "time": "20/06/2022-10:15:38",
                    "content": "Hi @Justin, thank you for your feedback. We will elaborate more detail in the Incentivization part. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/Panas",
                    "index": "13",
                    "likes": "1",
                    "time": "20/06/2022-10:18:11",
                    "content": "Hi @OPUser, Thanks for your feedback. As we also see that it is really important to elaborate more in those section. We will fix this ASAP  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/pisit563",
                    "index": "14",
                    "likes": "1",
                    "time": "20/06/2022-15:09:29",
                    "content": "Support this project  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/mcbonton",
                    "index": "15",
                    "likes": "2",
                    "time": "20/06/2022-16:36:40",
                    "content": "I always swap here every chain ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/MAMI",
                    "index": "16",
                    "likes": "1",
                    "time": "20/06/2022-16:51:56",
                    "content": "I definitely agree with you.  Support this project. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/MarkZa",
                    "index": "17",
                    "likes": "1",
                    "time": "20/06/2022-16:54:12",
                    "content": "Warden is the best and Mwad is so beautiful. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.625
                },
                {
                    "author_link": "https://gov.optimism.io/u/thesleeper",
                    "index": "18",
                    "likes": "1",
                    "time": "20/06/2022-17:07:32",
                    "content": "support this warden is such a creative DEX ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/meduzav",
                    "index": "19",
                    "likes": "1",
                    "time": "20/06/2022-17:22:54",
                    "content": "Agree. I like to use warden for swapping. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/EddO.S",
                    "index": "20",
                    "likes": "1",
                    "time": "20/06/2022-23:15:29",
                    "content": "Love this  Warden is the fantastic DEX. The 55% for traders & builders sounds awesome  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.166666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/KANTT",
                    "index": "21",
                    "likes": "1",
                    "time": "21/06/2022-05:12:48",
                    "content": "Thank you, Panas I think it is a great idea. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Panas",
                    "index": "22",
                    "likes": "2",
                    "time": "21/06/2022-05:50:55",
                    "content": "Hi all, we reply this comment as the idea of changing in the part of token distribution. First of all thank you for all supporting and feedback for WardenSwap. We do listen to all feedback and have fixed our proposal to elaborate in more detail of our distribution. We have separated the part of  builders, traders and referral programs, with more information provided, also more detail in marketing section with example of work that we are planing to do. We still waiting here if there is any feedback or idea for us. Thank you  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.857142857142858
                },
                {
                    "author_link": "https://gov.optimism.io/u/frankrx15",
                    "index": "23",
                    "likes": "1",
                    "time": "21/06/2022-07:51:40",
                    "content": "So great, I will support you, Warden! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "24",
                    "likes": "1",
                    "time": "21/06/2022-07:56:29",
                    "content": "Thank you for updating the distribution. Two quick question:-  will you be able to provide a report on where those fund are going on monthly/quarterly basis I dont this section in the proposal, How much will your project match in co-incentives? Why is that ? Overlooked or intentional.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.722222222222221
                },
                {
                    "author_link": "https://gov.optimism.io/u/AlTimist",
                    "index": "25",
                    "likes": "1",
                    "time": "21/06/2022-08:09:30",
                    "content": "Sound Great! Continue use wardenswap. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/Newt",
                    "index": "26",
                    "likes": "1",
                    "time": "21/06/2022-15:37:40",
                    "content": "Strongly agree. Warden x Optimism ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.166666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/Panas",
                    "index": "27",
                    "likes": "1",
                    "time": "22/06/2022-03:58:39",
                    "content": "Hi @OPUser, Thank you for your question    We are going to provide a monthly report on our site (in the part of the transparency document), and if there is any activity in WardenSwap on Optimism we will publish an activity update.   We skip it intentionally because we are not confirmed yet with that part at that moment. However, after work on this question, we already updated our proposal.   Thank you  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Cryptoz",
                    "index": "28",
                    "likes": "3",
                    "time": "22/06/2022-13:02:59",
                    "content": "Looks like an okay proposal that could bring some value! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.125
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "29",
                    "likes": "1",
                    "time": "22/06/2022-13:34:09",
                    "content": "Excellent. you have my support. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/solarcurve",
                    "index": "30",
                    "likes": "4",
                    "time": "22/06/2022-13:38:52",
                    "content": "I think overall this is an acceptable proposal. The 20% going to Traders is the least exciting part but when viewed together with everything else it’s not a huge concern. You’ve taken the initiative to deploy to Optimism and gain initial traction which I really appreciate. Happy to support this. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.571428571428571
                },
                {
                    "author_link": "https://gov.optimism.io/u/yinmin",
                    "index": "31",
                    "likes": "1",
                    "time": "23/06/2022-01:36:58",
                    "content": "I second this     ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Emer168",
                    "index": "32",
                    "likes": "1",
                    "time": "23/06/2022-05:07:00",
                    "content": "Agreed on this mentioned. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/TVop81",
                    "index": "33",
                    "likes": "1",
                    "time": "23/06/2022-08:17:20",
                    "content": "I totally agree with proposal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/charus",
                    "index": "34",
                    "likes": "1",
                    "time": "23/06/2022-10:36:08",
                    "content": "I agree with this proposal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/famassed",
                    "index": "35",
                    "likes": "0",
                    "time": "23/06/2022-12:06:39",
                    "content": "I have used WardenSwap before and stopped using after your website started taking 5 minutes to load. I just checked again now and it took around 4 minutes to load. If you fix the website it might be a good start, but overall the proposal is good ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 7.333333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/STARIXZ",
                    "index": "36",
                    "likes": "1",
                    "time": "23/06/2022-14:28:52",
                    "content": "I think devide 55% into two and it would be better. Thank for your team. #supportwarden ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/nuttps",
                    "index": "37",
                    "likes": "1",
                    "time": "23/06/2022-15:42:23",
                    "content": "Good idea. Can’t wait to see what will happen ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/PAKDO",
                    "index": "38",
                    "likes": "1",
                    "time": "23/06/2022-16:09:45",
                    "content": "I support this, Go beyond blockchain, let’s move people in the new world order with OP ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.681818181818182
                },
                {
                    "author_link": "https://gov.optimism.io/u/krscmax",
                    "index": "39",
                    "likes": "1",
                    "time": "23/06/2022-20:31:32",
                    "content": "Great, I love your dex so much. It’s the smoothest one for me tho. Besides, I always swap there since the first day you launch on OP. Love this 20% for traders. That’s cool. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 7.166666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/bonazzoli_17",
                    "index": "40",
                    "likes": "1",
                    "time": "24/06/2022-00:09:35",
                    "content": "Good project Keep going Warden ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/hena",
                    "index": "41",
                    "likes": "1",
                    "time": "24/06/2022-00:15:13",
                    "content": "i support this proposal ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/0xzenodotus",
                    "index": "42",
                    "likes": "1",
                    "time": "24/06/2022-02:01:14",
                    "content": "Wardenswap has my vote  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Panas",
                    "index": "43",
                    "likes": "0",
                    "time": "24/06/2022-03:45:04",
                    "content": "Hi @famassed, We are sorry to hear that from you, we will work hard to fix the problem. May I ask for you E-mail to ask for more information. Thank you ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 4.513888888888889
                },
                {
                    "author_link": "https://gov.optimism.io/u/jjlee710",
                    "index": "44",
                    "likes": "1",
                    "time": "24/06/2022-04:05:54",
                    "content": "thank you, Panas, for putting this proposal together. i agree with you. good luck to you !! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Hao",
                    "index": "45",
                    "likes": "1",
                    "time": "24/06/2022-08:59:52",
                    "content": "Support, hope to have results soon    ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/krscmax",
                    "index": "46",
                    "likes": "1",
                    "time": "24/06/2022-13:19:42",
                    "content": "tbh can it be like 25% for traders and 5% for referral program ? I think your product does not need to do thing like that much because it’s good in itself. Moreover, I think you can use your Twitter to do a full mode marketing because the point is that you are for traders. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party is advertising proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.083333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/Cryptoz",
                    "index": "47",
                    "likes": "1",
                    "time": "24/06/2022-14:37:46",
                    "content": "Voted for you guys. Hopefully a few more people see the potential! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/Endless",
                    "index": "48",
                    "likes": "1",
                    "time": "25/06/2022-08:57:18",
                    "content": "Warden exchage good the best ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/026",
                    "index": "49",
                    "likes": "1",
                    "time": "25/06/2022-15:12:46",
                    "content": "I support this.    ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Hall",
                    "index": "50",
                    "likes": "2",
                    "time": "25/06/2022-15:12:57",
                    "content": "great, I agree with this idea. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "51",
                    "likes": "1",
                    "time": "26/06/2022-10:14:26",
                    "content": "Voted : Yes Reason: Number of token requested is reasonable, token distribution plan is good (80% to platform and ecosystem growth) and distribution will last for 1 year which give me felling that they are not rushing to distribute the fund but rather focusing on slow and steady growth. Now, the feedback ball is in your corner. Give your feedback here and help us all.     Proposal to stop Phase 0 Projects to submit new proposal in Phase 1 💌 Ideas & Feedback       There were 20+ projects in Phase 0, some of them has a good plan to distribute the token while other does not. Here is an excellent summary by @MinimalGravitas .  Phase 0 officially concluded yesterday and soon OP will distribute 36M token between Phase 0 projects. Announcement  With this proposal, I want to share my idea and seeking your feedback on whether to allow Phase 0 projects to submit another funding proposal in phase 1 or not .  In my opinion, as long as previous funds are not exhauste…         Accountability of Phase 0/1 Funds given to projects 💌 Ideas & Feedback       That is a good question, and this is what I was thinking.  For integration fund, one example will be Infinity Wallet proposal where 80% is going for dev and integration - Let’s say project A is giving some incentive to project B for their integration, in this case I think it would not be a problem to share their address as both are public application.  For marketing and content creation (for example 80% Marketing proposal of Kromatika Proposal): - This depends on content creator(s), if they are …     ",
                    "links": [
                        "https://gov.optimism.io/t/voting-cycle-1-roundup/2619/34",
                        "https://twitter.com/OptimismGov/status/1540049300025114624?s=20&t=76-46b_Z3VdB9yBPrLU1UQ",
                        "https://gov.optimism.io/t/accountability-of-phase-0-1-funds-given-to-projects/2762/3",
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-infinity-wallet/2713/8",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-kromatika/2650/13",
                        "https://gov.optimism.io/t/voting-cycle-2-roundup/2754/45",
                        "https://gov.optimism.io/t/opuser-delegate-communication-thread/2777/5"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.138986013986014
                },
                {
                    "author_link": "https://gov.optimism.io/u/ScaleWeb3",
                    "index": "52",
                    "likes": "1",
                    "time": "27/06/2022-09:27:10",
                    "content": "This proposal fits into Gov Fund Phase 1 but the the value-add to Optimism is questionable: Voting No Value-add: Small Amount: Ok Op distribution: Okayish - a bit broad (Influencers ) Co-incentives: None This funding round’s goal is primarily in increasing liquidity and users on Optimism. Top, efficient DEXs and DEX aggregators are moving to Optimism and Wardenswap adds comparably little value. Some of your incentives are a bit broad and we have doubts that this will meaningfully increase Optimism growth. Nonetheless, we look forward to your steps into Optimism & potentially a new application in one of the next funding Phases. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.556301652892563
                },
                {
                    "author_link": "https://gov.optimism.io/u/matacen",
                    "index": "53",
                    "likes": "1",
                    "time": "27/06/2022-09:40:58",
                    "content": "Do you just put NO on everything without any clear research? Warden Swap is big on BSC ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/ScaleWeb3",
                    "index": "54",
                    "likes": "1",
                    "time": "27/06/2022-09:51:52",
                    "content": "Absolutely not. It took us significant time to go through all proposals and we voted Yes for Paraswap, dForce, Balancer-BeethovenX, Pickle Finance and Mean Finance in this round. Most other proposals fit into one or more of the following categories   Too much money ask for too little value add,   Mostly funding internal development (better to apply for VC funds if you’re building a venture),   Broad proposal, little detail, bad distribution of received funds   Key guiding principles are real value-add & long-termism. That said, we are interested in quality projects joining the Optimism ecosystem as well as smaller projects and we are keen on supporting new projects and tools - if they come up with a reaonable proposal in the future. In all funding decisions, we will be risk-taking but frugal and will not vote on not spending funds that we wouldn’t spend internally. (Here, you can read more about our core values) ",
                    "links": [
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-infinity-wallet/2713/45"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party auditing and reviewing proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.49256993006993
                },
                {
                    "author_link": "https://gov.optimism.io/u/matacen",
                    "index": "55",
                    "likes": "0",
                    "time": "27/06/2022-09:54:07",
                    "content": "The thing is dForce is a smaller project to WardenSwap and can provide much more value. Two similar project, one you know so its biased and the other you might not. Same with IW your comment shows 0 research of the platform. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party comparing proposal to similar project"
                    ],
                    "Sentiment": 5.375
                },
                {
                    "author_link": "https://gov.optimism.io/u/ScaleWeb3",
                    "index": "56",
                    "likes": "2",
                    "time": "27/06/2022-10:10:02",
                    "content": "This will be our last response to you as you seem not interested in constructive discourse but rather wasting time. In our small feedback to each project proposal, we clearly list things we look for:   Value-add: High-Ok-Small  Amount: High - Reaonable  Op distribution: Good - Bad  Co-incentives: Good, Small, None  We assessed each proposal, and the projects behind with significant diligence. We do not claim to be flawless. Hence, feel free to share good arguments and metrics with us in which way WardenSwap, IW or other proposals will add significant value to Optimism and we may adjust our opinions in the future. PS: If you look for additional information on blockchain, crypto & solution providers, you can also start at one of our websites called blockchain-comparison.com. ",
                    "links": [
                        "https://gov.optimism.io/t/stablenode-delegate-thread/2973/3",
                        "https://gov.optimism.io/t/voting-cycle-2-roundup/2754/43"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.7823529411764705
                },
                {
                    "author_link": "https://gov.optimism.io/u/tipecrpto",
                    "index": "57",
                    "likes": "0",
                    "time": "27/06/2022-10:16:10",
                    "content": "wardenswap i have not used it much but i have heard of it ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/EsiN",
                    "index": "58",
                    "likes": "0",
                    "time": "27/06/2022-12:33:22",
                    "content": "such a great Dex and actually it’s on most of L2 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.625
                },
                {
                    "author_link": "https://gov.optimism.io/u/investgineer",
                    "index": "59",
                    "likes": "0",
                    "time": "27/06/2022-12:58:10",
                    "content": "In deciding whether to say yes or no, I respect how your decision matrix was formed. However, if you can elaborate on “small value added” from DEX aggregator, that would be great. I’m curious how you quantify the impact… Was it just gut feeling or was there a numerical tool at work? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/ScaleWeb3",
                    "index": "60",
                    "likes": "3",
                    "time": "27/06/2022-15:06:41",
                    "content": "Ultimately, it is a subjective assessment based on some quantitative data, qualitative insights from parties we know & our own previous experiences. We haven’t fully quantified this assessment. On one side, we look at key KPIs for different categories in DeFi (DEX/Aggregators: Volume routed, Total Volume, Revenues, Users - partially filtered) and we do ofc look at Dashboards (Dune, Tokenterminal, etc.) like this DEX aggregator comparison. Soon, we’ll also share more and more of the key KPIs per category on DeFi-Reporting.com and other websites. On the other side, we have done research for years, engaged in ecosystem building and I’d call us crypto powerusers, who are active in DeFi communities and continue to follow developments. Hence, we are confident in assessing which projects add value to the stack or to ecosystems & and which are not. As it all started on Ethereum and we’ve been most active there, there is a slight bias towards projects that have been live there and had significant amounts of users/community (verifiable by us; facilitated by tools that support Ethereum first). If we have a blind eye, please let us know. (For example, we’ve seen Wardenswap with small market share on dashboards but haven’t used it ourselves. Hope to provide first feedback ahead of voting in the upcoming Phases which would also give you time to pitch in.) RE: DEX AGGREGATORS   Cutting-edge protocols are still in 95% cases launched on Ethereum as you get composability with other cutting-edge projects and benefit from the biggest DeFi liquidity, swap volume etc… (If you got a DEX aggregator that is competitive on l1 Ethereum, it is likely also competitive on Eth l2 or chain x.)   DEX Aggregators will grow their market share vs DEXs in low-transaction-cost environments over the next years, and with further adoption and abstraction of the DeFi space   In this great Dashboard you can see the DEX and DEX Aggregator landscape on Optimism. This gives a good overview which DEXs and aggregators are most efficient (or have short-term very well-designed incentives): Uniswap & 1inch dominate without incentives.   Feel free to send a message if you want to continue the discussion - as we don’t want to spam this thread. ",
                    "links": [
                        "https://defi-reporting.com/dashboard/",
                        "https://dune.com/queries/915662/1601261",
                        "https://dune.com/hildobby/optimism-dexs"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.685369318181818
                },
                {
                    "author_link": "https://gov.optimism.io/u/linda",
                    "index": "61",
                    "likes": "2",
                    "time": "27/06/2022-16:07:48",
                    "content": "Thanks for sharing your proposal. I’m abstaining from this vote since my husband is the co-founder of 0x which is also working on DEX aggregation and could create a potential conflict of interest. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None",
                        "None",
                        "None",
                        "None",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/fewol",
                    "index": "62",
                    "likes": "0",
                    "time": "27/06/2022-19:38:55",
                    "content": "WardenSwap is a good project and if you abstain here it means you need to abstain on nearly every similar project like ParaSwap and etc. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.333333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/linda",
                    "index": "63",
                    "likes": "0",
                    "time": "27/06/2022-19:59:21",
                    "content": "I hadn’t gotten around to commenting on that proposal yet but I just abstained on it too (also abstained on the earlier 0x proposal). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/fewol",
                    "index": "64",
                    "likes": "0",
                    "time": "27/06/2022-20:01:37",
                    "content": "My point which I might of missed was that if you abstain on projects you are going to be missing most of the good projects (Paraswap, Wardenswap and etc…) that can bring growth to OP. Would it not be best to set potential conflict of interest aside and focus on how it would benefit OP? I respect your honesty, I just think a lot of projects are generally similar to 0x in terms of trading or aggregation. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.666666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/linda",
                    "index": "65",
                    "likes": "1",
                    "time": "27/06/2022-20:36:24",
                    "content": "To my knowledge so far out of the 17 proposals this cycle, only 2 are DEX aggregators and present that conflict. Not sure I understand how this misses most projects that bring significant growth to the Optimism ecosystem? I don’t think it’s that easy to set aside. If I vote no on a project that is a direct competitor because I don’t think that’s the best use of funds then I can understand people would be upset about potential bias. If I only vote yes on ones I support, then there’s the potential concern that I’m selectively abstaining from some and not others (e.g. what you just said earlier). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.868589743589744
                },
                {
                    "author_link": "https://gov.optimism.io/u/trvkc",
                    "index": "66",
                    "likes": "0",
                    "time": "28/06/2022-06:23:43",
                    "content": "best rate swap on optimism! LOOKS GREAT  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/Ruby",
                    "index": "67",
                    "likes": "0",
                    "time": "29/06/2022-02:49:09",
                    "content": "great, i support this proposal! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/aummum",
                    "index": "68",
                    "likes": "0",
                    "time": "01/07/2022-06:27:49",
                    "content": " there are so many reason to support this project , great team BTW ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/Ruby",
                    "index": "69",
                    "likes": "0",
                    "time": "01/07/2022-15:58:30",
                    "content": "support this! great proposal! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/fasup",
                    "index": "70",
                    "likes": "0",
                    "time": "02/07/2022-05:30:28",
                    "content": "I support this project. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "71",
                    "likes": "0",
                    "time": "03/07/2022-13:28:33",
                    "content": "I am going to be voting a reluctant NO to this proposal. PROS  relatively okay amount interesting concept  CONS  Weird distribution. 20% to traders? 35% to marketing and influencers? 10% to referral? From the distribution it seems like the point is to use OP tokens to market their protocol and attract mercenary users to it. Other DEX aggregators work fine and already in optimisms without any incentives so I am not convinced that if incentives dry up the users will stay.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.604166666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/naresdang",
                    "index": "72",
                    "likes": "0",
                    "time": "03/07/2022-14:20:47",
                    "content": "I agree this propersal ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/krzkaczor",
                    "index": "73",
                    "likes": "0",
                    "time": "05/07/2022-19:14:41",
                    "content": "I’ll vote Weak YES  Project quality: Mid/High - DEX aggregators are important but it seems that project failed to get widespread adoption Team quality: mid - anon team, lack of gh activity Amount requested:  Reasonable OP distribution: Good. I actually like it. I think spending funds on marketing campaigns is better than LM. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party giving entirely positive feedback on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.578125
                },
                {
                    "author_link": "https://gov.optimism.io/u/vonnie610",
                    "index": "74",
                    "likes": "0",
                    "time": "07/07/2022-18:54:12",
                    "content": "Snapshot vote - Passed ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/yefeng",
                    "index": "75",
                    "likes": "0",
                    "time": "09/07/2022-03:27:43",
                    "content": "love op. always mana good news for the users ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Hollyheaven",
                    "index": "76",
                    "likes": "0",
                    "time": "17/07/2022-11:09:48",
                    "content": "I am really happy to hear that. Nice plan ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/bobby",
                    "index": "77",
                    "likes": "0",
                    "time": "26/07/2022-23:17:18",
                    "content": "@panas can you provide a Telegram handle or other contact method so the Optimism team can get in touch about paying out this grant  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.375
                },
                {
                    "author_link": "https://gov.optimism.io/u/Panas",
                    "index": "78",
                    "likes": "0",
                    "time": "09/08/2022-05:55:30",
                    "content": "Hi Booby, sorry for late response. You can reach me through this Telegram ID: @K_Krissada Thanks you ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.9999999999999996
                },
                {
                    "author_link": "https://gov.optimism.io/u/krscmax",
                    "index": "79",
                    "likes": "0",
                    "time": "09/08/2022-11:22:20",
                    "content": "lack of communication and more details after voted yes. Team should announce more details and criteria on public. Also, it sounds like 80% of OP token will be granted to influencers or core team instead of traders. IMO, it should be 40% + for traders because you represents yourself as a DEX for people. Thus, I offer to change some from marketing and referral to traders. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.666666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "80",
                    "likes": "0",
                    "time": "13/09/2022-19:55:30",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "81",
                    "likes": "3",
                    "time": "05/01/2023-19:28:06",
                    "content": "Hi @Panas! It’s been a few months since your OP grant distribution, checking in to see if there is a grant update you could share with the community? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "82",
                    "likes": "0",
                    "time": "09/01/2023-13:54:07",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Billy191",
                    "index": "83",
                    "likes": "0",
                    "time": "14/02/2023-13:46:37",
                    "content": "About not too long ago, I woke up feeling kind of blue. When will announce the plan to distribute OP token that you got? If not, please return back to Optimism Foundation.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.6875
                },
                {
                    "author_link": "https://gov.optimism.io/u/investgineer",
                    "index": "84",
                    "likes": "2",
                    "time": "27/02/2023-04:10:47",
                    "content": "@Panas It has come to my attention that you are changing the distribution duration from one to four years according to an announcement you made on Medium???  Screenshot 2023-02-27 110344724×802 67.3 KB  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving negative feedback on proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lionchenou",
                    "index": "85",
                    "likes": "1",
                    "time": "27/02/2023-04:40:35",
                    "content": "I support this project. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lionchenou",
                    "index": "86",
                    "likes": "1",
                    "time": "27/02/2023-04:42:25",
                    "content": "Great, support this project. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                }
            ]
        }
    ],
    "group_index": "95"
}