{
    "poll_list": [
        {
            "id": "0xcf408ef01d60307b668d349d80b930346f76e88835d50653e0a81ca3cb2637ff",
            "title": "Proposal P: Governance Fund Phase 1 - Roki",
            "discussion": "https://gov.optimism.io/t/ready-gf-phase-1-rotki/2732/",
            "body": "This Governance Fund Phase 1 proposal has been marked ready and as such is eligible for voting in Cycle 2. This proposal HAS been approved as ready for vote by a delegate. For more info, check out Voting Cycle 2 Roundup: [https://gov.optimism.io/t/voting-cycle-2-roundup/2754](https://gov.optimism.io/t/voting-cycle-2-roundup/2754)\n\nLink to proposal: https://gov.optimism.io/t/ready-gf-phase-1-rotki/2732/",
            "choices": [
                "Yes",
                "No",
                "Abstain"
            ],
            "scores": [
                14677089.999771606,
                3598282.727547936,
                1091670.057656183
            ],
            "start": 1656093651,
            "end": 1657134051,
            "snapshot": "12949751",
            "state": "closed",
            "author": "0x47C88bb92B409fF25F6587EA611fac4e55f76007",
            "space": {
                "id": "opcollective.eth",
                "name": "Optimism Collective"
            }
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/ready-gf-phase-1-rotki/2732",
            "title": "[READY] [GF: Phase 1] rotki ",
            "index": 2732,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Governance Fund: Phase 1"
            ],
            "tags": [
                "cycle-2",
                "passed"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "1",
                    "likes": "16",
                    "time": "21/06/2022-22:05:06",
                    "content": "Project Name: rotki Author Name: Lefteris Karapetsas Number of OP tokens requested: 190770 (See the budget - work outline section.) L2 Recipient Address: 0x9531C059098e3d194fF87FebB587aB07B30B1306 Relevant Usage Metrics:  Over 10k users, 146k downloads, 88 code contributors … birds love us! Optimism alignment (up to 200 word explanation): One of the stated intentions of Optimism is to fund public goods. rotki is a public good, as it’s the only opensource portfolio tracker + accounting tool for crypto that protects your privacy and lets you own your data. rotki at the moment does not support optimism in any way or form. We want to change this and would like to support optimism to the same extent as we support ethereum mainnet portfolio tracking, human readable transactions and PnL report. This will be of great benefit to all optimism users as they will finally have a privacy-first, local-first solution for portfolio tracking and accounting. Proposal for token distribution (under 1000 words):  How will the OP tokens be distributed?  100% development work of the opensource software. See the budget - work outline section.  How will this distribution incentivize usage and liquidity on Optimism?  It will incentivize usage since users will now have an opensource solution for portfolio tracking and accounting and will be able to benefit from the human readable transactions decoding of rotki also in optimism and have PnL analysis of optimism defi activity and not just mainnet. As a bonus other optimism projects can check our code and our work and incorporate whatever they need in their project (so long as they respect our opensource license – AGPLv3).  Why will the incentivized users and liquidity remain after incentives dry up?  My favorite question. Because rotki is not a freaking ponzi. We are a useful local application that solves a problem. All our users use us because we are of use to them and they stay because they love us.  Over what period of time will the tokens be distributed?  Since this is for development work we would sell them to cover expenses, but only on a need to pay-basis. We would also be totally fine if the tokens were given to us in batches after completing milestones but in that case the token amount would have to be adjusted for the $ value of work done.  How much will your project match in co-incentives?  Our project has no token or any other ability to provide co-incentives.  Budget proposal – Work outline In this section I would like to give a detailed budget spending proposal as we are asking the tokens for development and the optimism community should know how they are going to be spent and why. We are going to be using $ value here. We assume a weekly dev salary of $2,084. All these estimates also include a 40% markup on top for any extra work we may need to do, research but most importantly all other expenses these will incur for us such as taxes. rotki is incorporated in Germany and pays taxes there.  Architectural work to properly support EVM based chains like optimism Backend: 2 devs 4 weeks Total: $23,341  Implement address token + portfolio tracking for optimism in rotki’s backend Backend: 2 devs 2 weeks Frontend: 1 dev 2 weeks Total: $17,506  Implement transaction decoder system for optimism and some sample decoders for biggest optimism defi protocols Backend 2 devs, 4 weeks Frontend: 1 dev, 3 weeks Total: $32,094  Implement pnl analysis + report for optimism Backend: 2 devs 3 weeks Frontend: 1 dev 3 weeks Total: $26,259  Total 23341 + 17506 + 32094 + 26259 = $99,200 With an $OP price of $0.52 (time of this post) then this would mean 190,770 $OP tokens.  Relevant info rotki github: GitHub - rotki/rotki: A portfolio tracking, analytics, accounting and tax reporting application that protects your privacy rotki discord: (has captcha verification – so have DMs open): Rotki rotki twitter: https://twitter.com/rotkiapp  Final remarks  This proposal is only for the initial development and specifically for what is outlined in the budget proposal. Further support, bugfixes, and development/upgrade of relevant future is not included. We will naturally support rotki further and help users but we will not be under any special obligation after the initial development is done. This is not an SLA agreement between optimism and rotki. We reserve the right to request for more funds if the OP prices skews too low and no longer meets the budget requirements or if our estimates were way way off. We also reserve the right for further optimism related rotki funding proposals in the future assuming this one goes well and the users of optimism appreciate our work!  ",
                    "links": [
                        "https://discord.com/invite/aGCxHG7",
                        "https://twitter.com/rotkiapp",
                        "https://gov.optimism.io/t/voting-cycle-2-roundup/2754/21",
                        "https://gov.optimism.io/t/cycle-10-grant-review-roundup/5284",
                        "https://gov.optimism.io/t/grant-council-reviewer-nominations/4372/6",
                        "https://gov.optimism.io/t/voting-cycle-2-roundup/2754"
                    ],
                    "GPT-summary": "The author proposes to develop support for Optimism in their open-source portfolio tracker and accounting tool for crypto, called rotki. The proposal outlines the budget and work outline for the development work, which includes architectural work, implementing address token and portfolio tracking, transaction decoder system, and PnL analysis and report. The author explains how the development work will incentivize usage and liquidity on Optimism and how the tokens will be distributed. The proposal also provides relevant usage metrics and links to the rotki GitHub, Discord, and Twitter.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Interoperability and Scaleability",
                        "Smart contract updates",
                        "Privacy, Security and risk management",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.611973067915691
                },
                {
                    "author_link": "https://gov.optimism.io/u/solarcurve",
                    "index": "2",
                    "likes": "2",
                    "time": "21/06/2022-23:04:22",
                    "content": "Easy one to support. Thanks for taking the time to write such a detailed proposal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.291666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/allera",
                    "index": "3",
                    "likes": "3",
                    "time": "21/06/2022-23:57:44",
                    "content": "Great proposal. Loved the amount of detail you added to the budget proposal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/Cryptoz",
                    "index": "4",
                    "likes": "3",
                    "time": "22/06/2022-13:17:23",
                    "content": "I wouldn’t call this proposal a public good as its 100% to fund your venture. Also there are many portfolio tracker and account tools apps so how will yours be any different to the more well known ones? Another problem I have is that the prices and timelines you have quoted seem to be exaggerated, I am wondering if there is any specific reason as to why? As it sounds like its mostly integrating support for Optimism meaning the majority of the code logic will be reusable. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.0625
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "5",
                    "likes": "0",
                    "time": "22/06/2022-13:37:54",
                    "content": "    Cryptoz:  I wouldn’t call this proposal a public good   I would disagree, anything open-source is public good. I do agree on the price quotes, those are a senior dev weekly rate ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "6",
                    "likes": "5",
                    "time": "22/06/2022-15:00:51",
                    "content": "    Cryptoz:  I wouldn’t call this proposal a public good as its 100% to fund your venture. Also there are many portfolio tracker and account tools apps so how will yours be any different to the more well known ones?   The code is opensource and thus a public good. The difference between the more well known portfolio trackers in a TL;DR are:  rotki is the only opensource one. All others are closed source rotki is the only local one. All other are centralized SaaS so your data are all stored in centralized servers. rotki is the only privacy focused one. All other keep your data in their centralized servers and god knows what they do with it.   Another problem I have is that the prices and timelines you have quoted seem to be exaggerated,  That’s simply false. The timelines are optimistic. I could have given 2x the time but want us to try to finish it faster and not spend too much money on this as it’s an application for funding and want to respect the optimism community if they choose to give us this grant and not overcharge. The prices are european senior dev salaries. If I went with American they would be roughly 2x. But you are lucky we are based in Europe  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.473484848484849
                },
                {
                    "author_link": "https://gov.optimism.io/u/Defi_LATAM_axlvaz",
                    "index": "7",
                    "likes": "0",
                    "time": "22/06/2022-18:50:49",
                    "content": "Are all features of the premium subscriptions also open source? https://rotki.readthedocs.io/en/latest/faq.html#questions-on-premium It is not clear in the documentation, I understand that everything is open source. Is this correct? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.916666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/Defi_LATAM_axlvaz",
                    "index": "8",
                    "likes": "0",
                    "time": "22/06/2022-19:04:50",
                    "content": "Here I found the folder on GitHub    github.com   rotki/rotkehlchen/premium at develop · rotki/rotki develop/rotkehlchen/premium A portfolio tracking, analytics, accounting and tax reporting application that protects your privacy      ",
                    "links": [
                        "https://github.com/rotki/rotki/tree/develop/rotkehlchen/premium",
                        "https://github.com/rotki/rotki/tree/develop/rotkehlchen/premium"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author is advertising proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "9",
                    "likes": "4",
                    "time": "22/06/2022-19:09:37",
                    "content": "Very good question! Yes all the main code of rotki is opensource. Everything developed as part of this grant will be opensource and part of the same codebase. Premium simply unlocks some limits (in the opensource code) and provides some extra capabilities as part of syncing with our server such as syncing with our own server to sync the user DB between machines or provide some extra UI components such as dark mode, or some watching functionality for makerdao vaults etc. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.78030303030303
                },
                {
                    "author_link": "https://gov.optimism.io/u/Defi_LATAM_axlvaz",
                    "index": "10",
                    "likes": "5",
                    "time": "23/06/2022-00:29:16",
                    "content": "First I want to clarify that this is a personal opinion and not of the communities in which I am an active participant and contributor. Defi LATAM and OptimismESP During these days in the Defi LATAM community in the server they have dedicated to governance Optimism, we were discussing with other members of the group about the term “public goods”. How we should interpret it and if it was correct to call them that way or as Optimismo defines them. This generated a great debate in which, I believe, we did not arrive at any concrete definition. I think that the Optimismo Foundation together with the Optimismo Collective, of which I consider myself a part, are going to have to define what the characteristics and aspects of a “public good” are. In this particular case, my question is whether Rotki is enough to be a public good just for being open source. Since it has a “premium” part that monetizes and it seems fine to me that it has a business model. But that premium section is not accessible to all web3 citizens unless you are endowed with extensive technical knowledge in programming. Some protocols collect or monetize through marketing fees and the funds are managed by a DAO, this would not be the case. Is open source enough to be a public good? What other characteristics should we take into account to label a project as a public good? All this questioning also arises from the fact that in this Phase 1 we have seen some projects of dubious provenance. In the case of rotki we all or at least most of us know the reputation of Lefterisjp and its contributions to the community and we trust or at least I trust that the grants it is going to receive will be well used as detailed in the [DRAFT]. In short, I think this particular case of rotki depending on how you look at it may or may not be considered a public good. It will surely happen with other similar projects, that is why I think it is necessary as governance to have more clarity in defining some characteristics of “public goods”. Disclaimer: Surely some of the ideas, including paragraphs, are not understood 100%. I am not a native English speaker. ",
                    "links": [
                        "https://twitter.com/OptimismESP",
                        "https://twitter.com/DeFi_LATAM",
                        "https://discord.gg/vCkRrM4x",
                        "https://twitter.com/LefterisJP",
                        "https://twitter.com/LefterisJP/status/1408556020209684484",
                        "https://gov.optimism.io/t/draft-gf-phase-1-rotki/2732"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.791103603603603
                },
                {
                    "author_link": "https://gov.optimism.io/u/William",
                    "index": "11",
                    "likes": "1",
                    "time": "23/06/2022-04:46:32",
                    "content": "Rotki is a public good, and an awesome tool. Keep on building! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.833333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/Takeshi_Kovacs",
                    "index": "12",
                    "likes": "1",
                    "time": "23/06/2022-04:54:30",
                    "content": "Agreed. I am an early user of Rotki. Awesome tool ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "13",
                    "likes": "7",
                    "time": "23/06/2022-07:49:07",
                    "content": "    Defi_LATAM_axlvaz:  Is open source enough to be a public good?   Thank you so much for taking the time to ask such questions @axivaz. And no worries I completely understand your English! Such healthy criticism and questions are more than welcome! So in short I believe opensource is a public good. True opensource. Like rotki. So any OSI approved license: The Open Source Definition | Open Source Initiative There is other licenses which may allow for the code to be open but limit usage in various ways such as non-commercial etc. These are called “source available” instead of opensource. The entire public good talks in crypto started from gitcoin. Gitcoin’s stated mission back in 2019 was to fund opensource development. A category which has been and still is something that is considered “impossible to do”. Later this changed to the more broad term public good, to include other projects non-software related. But why is opensource software hard to fund? Why is is a public good? Because opensource can be copied, modified and redistributed. And that is even encouraged. It’s part of the very definition of open soure I pasted above! In the traditional for-profit model a venture will not get funding if it does not have an IP. Opensource software is not IP since it can be copied. For example you can spend hundreds of thousands of dollars in development to create a piece of software and someone else can take that software, copy the code, repackage it and sell it. And that would be fine in all opensource licenses. This is why VCs do not touch opensource code. They touch opensource protocols, since there is tokens and all the ponzinomics that come with them but for pure code they do not. And to further cement my point about rotki specifically let me tell you a story. A German company created a portfolio tracking SaaS end of last year. And sold access to it for ~1k $ / month per user. Their code was closed. We had a look at how their app behaves and it was obvious from the start they were using rotki’s source code. We confronted them. They admitted they were using our code but said they don’t need to respect the license. Our license is AGPL, which means you can use it, copy, redistribute, sell it, but you should also be opensource and give credit to the original authors (so rotki). They refused to do that. We hired a lawyer. Spent ~3k EUR and 2 months of going back and forth with lawyers. At the end they simply removed some features and claimed they were no longer using our code. Our lawyer informed us this was the best case scenario and that we had no way of verifying anything. Did not really feel like a win. Why am I saying this? I am saying this to show you that even defending opensource licenses is hard and it falls on the opensource project. Projects that traditionally have no money to begin with. The idea is your code is out there, can be used by others and you are vulnerable and have to accept that fact or you have to not build opensource. For all the above, opensource is a public good ",
                    "links": [
                        "https://gov.optimism.io/t/draft-s02-committee-proposal-tooling-governance-committee/3333"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.732093253968254
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "14",
                    "likes": "3",
                    "time": "23/06/2022-07:52:04",
                    "content": "To comply with Phase 1 rules stated here: Governance Fund Phase 1: How to Create a Proposal and after having responded to any feedback we got here, I am changing the proposal from DRAFT to READY, so it can be included at the next round of votes. ",
                    "links": [
                        "https://gov.optimism.io/t/voting-cycle-2-roundup/2754/21"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/MinimalGravitas",
                    "index": "15",
                    "likes": "0",
                    "time": "23/06/2022-08:07:11",
                    "content": "    Defi_LATAM_axlvaz:  Is open source enough to be a public good?   I think open source software is pretty much the archetypal Ethereum public good. @lefterisjp explains this well above, but I feel his argument lacks something… music!      ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.925000000000001
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "16",
                    "likes": "2",
                    "time": "23/06/2022-08:50:25",
                    "content": "This is such a great question as I am also discussion this with my circle. Two things that we need to work on, definition of public good and should we, the gov, fund them or the funding should come from OP RPGF. Coming back to open source, yes, open source is public good, in my view.  endowed with extensive technical knowledge in programming.  Even I thoughts its not open-source as it include some premium feature but the code is open, anyone can clone it, amend it and use it as long as they are respecting the open-source license. Author is not responsible for teaching technical knowledge, its his wish to do so or not but that a totally different topic. On the other side, Open Source Software(OSS) are built and developed by public funding and donations, precisely what Gitcoin and QF funding round are trying to do. Submitting a proposal and seeking funding for the development is not aligned with OSS and/or public good or is it ?. Public Good(OSS including) should be based on “Bottom Up” approach; here you develop something and then getting the reward retroactively and not “Top Down”; here you ask for funding first and then develop something. Then is it still public good ? I would like hear others opinion on this. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.6919642857142865
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "17",
                    "likes": "5",
                    "time": "23/06/2022-09:03:13",
                    "content": "    OPUser:  Submitting a proposal and seeking funding for the development is not aligned with OSS and/or public good or is it   Why would it not be? Gitcoin does not have a monopoly on funding public goods. Retroactive funding part of the development as gitcoin always does is simply not enough. Gitcoin is trying but the reality of the situaton is that the matching pots are simply too small and the projects applying for them too many. Funding development of specific features is even how gitcoin started. See gitcoin bounties. I would even argue that this is much more fair to the community that does the funding. As they know exactly what they are getting as opposed to the much more vague retroactive funding. It’s also much more fair to the opensource project. And I can’t stress this enough as a person who runs one. With a grant application such as this,  they know where they need to focus their development efforts on. Can’t just develop randomly trying to satisfy as many different communities and people as possible in the hopes that some of them may in the future toss few coins their way which are almost always simply not going to be enough. The resulting opensource code is the public good. Who funds it and when does not have any effect on the end result. You can still take the end result, copy it, modify it, redistribute or sell it so as per the OSI opensource definition it’s still a public good. I mean the question really makes no sense. The Ethereum foundation itself is also funding opensource projects with grants exactly because they are public good. Other protocols/projects also give grants to projects that produce opensource code that deals with their protocols. That does not change them from  being a public good. It’s the curse of opensource maintainers. Trying to get funding from as many sources as possible just to keep afloat. So your definition of a public good would be opensource code that is not funded by grants but only with a few pennies retroactively? By the time those pennies flow into the project, the project is dead. Let’s not perpetuate the myth of the poor opensource maintainer. That’s just a myth, it’s unhealthy and hurts opensource development. Software development costs a lot of money and opensource software is no different. I argue that opensource software is the most important kind of software and thus should be paid even more than closed source. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.765330188679245
                },
                {
                    "author_link": "https://gov.optimism.io/u/jlewis50",
                    "index": "18",
                    "likes": "1",
                    "time": "23/06/2022-12:56:14",
                    "content": "Rotki is a cool app… Just one area where I think it is odd. As a gitcoin steward you were highly critical of projects paying 7-8k $ a month (some were even a little less than that and based in US)… but if we used US equivalent of 4.33 weeks in a month, you pay your devs 9k$ a month and are talking about how great a deal that is… seems like when you are on the opposite side of the funding window your tune changes ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.449404761904761
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "19",
                    "likes": "6",
                    "time": "23/06/2022-13:52:05",
                    "content": "Very valid criticism. The answer is quite simple. The quoted price is not salary we pay our devs on a usual month (also here we count 4 weeks/month so quoted monthly salary is  $8,336). When requesting money to do specific work that’s when we request market salaries for the time period of said work so we can for a short period pay them what they are worth. The monthly salaries we pay in rotki are already stated in the gitcoin forums and range from $20k yearly (my salary) to $60-70k. rotki should really at some point become a non-profit. We don’t make any profit anyway. Have no investors to give said profit back to. It’s my own personal funds that started this, and then community grants and a tiny it in revenue from premium. Really guys … all we get we pay to our devs. My own salary is the minimum legal salary in Germany and I only pay it since otherwise the company would be in trouble (according to our accountant) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.578125
                },
                {
                    "author_link": "https://gov.optimism.io/u/jlewis50",
                    "index": "20",
                    "likes": "0",
                    "time": "23/06/2022-14:05:01",
                    "content": "thanks for clarifying I think this highlights one of the issues though… I have also worked on a project in past with grants funding, and it is incredibly difficult to get people to commit to a long term vision when you are constantly begging for bare minimum funding and devs have to take large pay cuts…turnover becomes high, meaning training and onboarding takes up a lot of resources and recruiting you shouldn’t have to pay yourself 20K! that is unsustainable in the us, that “salary” is also pre-tax and also pre-health care (in us family health insurance can be a big chunk of that amount!) if you have a family completely ridiculous to expect a dev to take a job with no benefits for 7$ a month where taxes and health care eat up majority of it…imho ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.765476190476191
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "21",
                    "likes": "2",
                    "time": "23/06/2022-15:13:36",
                    "content": "    lefterisjp:  Why would it not be? Gitcoin does not have a monopoly on funding public goods.   I think we jumped to wrong foot, I am huge fan of privacy and OSS development, what I wanted to discuss is not the fund but the approach/time of getting/asking the fund. Anyway, I want to pick your brains on few more points:- Case 1:- I have developed an OSS, its not prod ready but it does work, now in order to make it prod ready, i want to get the fund and reaching out to different entities such as OP gov fund /gitcoin/qf and similar. Case 2:- I have an idea, I am willing to spend my time and want to built that idea into a reality, for that I need the fund, so I submit the proposal. Now, both will be OSS, but case 1 has something to show for and case 2 has nothing to but a idea. How would you allocate fund to them? In Case 1, not only I am aligned to support him for his past work but also for future work, just because a working product gives me more confidence. In Case 2, s/he might build something, cant accept/reject for sure but looking at optimistic side, I agree to support, now should we support the full budget ? I mean a full prod ready application or support them to convert that idea into a POC and decide on further funding ? What do you think ?  So your definition of a public good would be opensource code that is not funded by grants but only with a few pennies retroactively? By the time those pennies flow into the project, the project is dead. Let’s not perpetuate the myth of the poor opensource maintainer. That’s just a myth, it’s unhealthy and hurts opensource development.  Looks like I triggered you there…lol, again that was not my intention. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.308189655172414
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "22",
                    "likes": "3",
                    "time": "23/06/2022-15:24:50",
                    "content": "    OPUser:  Looks like I triggered you there…lol, again that was not my intention.   Ah don’t mind it. I suck at expressing myself in written form and almost always sound like I want to strangle the counterparty  I have to work on that. My colleagues also sometimes get the wrong idea in my code reviews.     OPUser:  In Case 1, not only I am aligned to support him for his past work but also for future work, just because a working product gives me more confidence. In Case 2, s/he might build something, cant accept/reject for sure but looking at optimistic side, I agree to support, now should we support the full budget ? I mean a full prod ready application or support them to convert that idea into a POC and decide on further funding ? What do you think ?   I see what you meant now. Yes definitely if the team has past work to showcase they are capable of delivering then this would definitely be a big plus as it gives you a confidence boost. In case 2 perhaps releasing the funds in milestones is what would be really cool as then you can be sure that work will be achieved and only iff they complete the first milestone would second one be paid out, then third one and so on and so forth. So if the first milestone is never done then a very small amount of funds would be wasted, as opposed to wasting the entire budget. EDIT: As for this specific proposal I believe rotki has shown it can and does deliver with a product that is used by many users and being improved continuously with frequent new releases. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.45949413489736
                },
                {
                    "author_link": "https://gov.optimism.io/u/eze.op",
                    "index": "23",
                    "likes": "1",
                    "time": "23/06/2022-15:39:16",
                    "content": "avalo esta propuesta a darle accion ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Griff",
                    "index": "24",
                    "likes": "1",
                    "time": "24/06/2022-22:35:20",
                    "content": "    OPUser:  Submitting a proposal and seeking funding for the development is not aligned with OSS and/or public good or is it ?   It is very mush aligned… Developers shouldn’t be the only ones contributing to Open Source development… yes, they are the only ones that can do the LABOR… but capital contributions to pay for that labor are also valid contributions… The idea isn’t that open source code should be built for free, the idea is that open source code should be free to reuse. Paying devs just shifts the heroism from the devs to the funders. Let’s be the heroes this time, and spare the devs, let them feed their kids (and not have to sell out to FAANG).  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.85
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "25",
                    "likes": "1",
                    "time": "24/06/2022-23:04:05",
                    "content": "Yes, you are and I have corrected myself in my reply to lefterisjp, I was referring to timing of the fund rather than the fund itself. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Billtino",
                    "index": "26",
                    "likes": "1",
                    "time": "24/06/2022-23:12:00",
                    "content": "Great proposal i will support ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "27",
                    "likes": "1",
                    "time": "26/06/2022-09:01:05",
                    "content": "Voted : Yes. Pros:  Open source i.e public good Amount request is justified by proper distribution plan Application is already live on other chain Privacy…hell yeah.  Cons: None I was that you have already shared you view on Phase 0/Phase1 funding. I am afraid, I will have to bother you one more time, this I was thinking since past few weeks and I would love to hear your opinion on this Accountability of Phase 0/1 Funds given to projects That is not a proposal but rather I request from both, OP /Project, team, If I get a positive response, I will reach out to the Team and would also encourage upcoming project proposal to consider this. ",
                    "links": [
                        "https://gov.optimism.io/t/opuser-delegate-communication-thread/2777/5",
                        "https://gov.optimism.io/t/voting-cycle-2-roundup/2754/45"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.49562937062937
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "28",
                    "likes": "2",
                    "time": "26/06/2022-14:40:00",
                    "content": "Thank you for your support @OPUser! I will comment on the thread you posted to keep things here on topic. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Cryptoz",
                    "index": "29",
                    "likes": "0",
                    "time": "26/06/2022-14:56:54",
                    "content": "Honestly, I am still to trying to understand how Rotki will bring long term value to Optimism. There are many portfolio management Apps out there that have a much heavier focus on UX, UI and features with a far larger user base. I see the open source side may make it a public good, but does your project provide something new to warrant funding your venture with 100% for development? That I have seen it doesnt, unless you could point out some core differences? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.630165289256198
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "30",
                    "likes": "0",
                    "time": "26/06/2022-15:12:50",
                    "content": "We are not asking for 100% of development funding. We are asking for funding the development of a specific set of features that are solely optimism related.  I see the open source side may make it a public good, but does your project provide something new to warrant funding your venture with 100% for development?  Yes. I already answered this above. I believe it was you who asked this.     lefterisjp:   rotki is the only opensource one. All others are closed source rotki is the only local one. All other are centralized SaaS so your data are all stored in centralized servers. rotki is the only privacy focused one. All other keep your data in their centralized servers and god knows what they do with it.    Also keep in mind rotki is not only a portfolio tracking app, but also historical PnL analysis and account  which is something that can be used for taxes. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.151988636363636
                },
                {
                    "author_link": "https://gov.optimism.io/u/Cryptoz",
                    "index": "31",
                    "likes": "0",
                    "time": "26/06/2022-15:15:25",
                    "content": "    lefterisjp:  All other keep your data in their centralized servers and god knows what they do with it.   How does rotki get all wallet information without communicating with a server. Since there is always a server or API involved which is centralized so I don’t see how this is unique? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "32",
                    "likes": "0",
                    "time": "26/06/2022-15:34:13",
                    "content": "Thank you for the question! The answer is by providing the choice to the user. The user can run their own node or customize a set of open nodes to which to connect to. For example I run my own node and use it with rotki, with metamask and with otterscan (a local blockchain explorer: GitHub - wmitsuda/otterscan: A blazingly fast, local, Ethereum block explorer built on top of Erigon). That is for blockchain data. For most other data it’s all calculated locally. For whatever we need to query external services we query multiple and try to randomize them so as to not leak data (in case user is not just privacy aware – but paranoid). For example historical forex prices etc. Let me give you an example. Say you use zerion/zapper. Just by you using the centralized website, they know (1) your location (2) your entire crypto networth and your (3) spending habits and possibly more depending on other factors such as having an ENS associated with the wallets you track etc. That easily puts a target on your back if any of this data leaks, especially combined with say the ledger data leak which contains a gazillion of home addresses. Now of course … they all say the same thing. They “respect” your privacy and refer you to their privacy policy. If you have ever worked in software you know that’s a big load of bull. And I am not necessarily assuming malice. All it takes is one intern making a mistake. That’s the web2 way. Trust should be out of the equation. Can’t be evil is better than don’t be evil. Which is why local-first apps like rotki are the only true dapps. All else is simply web2 centralized apps masquerading as “dapps”. Sure they are easier to start with as a user since they are centralized webapps but to what cost? I will refer you to: Local-first software: You own your data, in spite of the cloud for an explanation of our development approach. And just one of many questions you should be asking yourself when you use centralized apps: https://twitter.com/martinkl/status/1540971616347250688 Keep in mind. Your financial data is probably one of the most sensitive data about yourself. Protect yourself. Finally all those centralized apps, zerion and zapper included, are completely free to use. Yet they have had millions invested on them by VCs in multiple rounds. Doesn’t take a genius to understand that the product of a centralized service like that is eventually you, the user. Those VCs are expecting a return in their investment. They did not invest out of charity. As for us, we don’t have any investors. We also seek none. We are idealists. We have had a big initial investment by me (I have been around crypto for a while) and then it’s all organic income from donations and development grants like this one. Thus rotki is not capturable by external interests. ",
                    "links": [
                        "https://www.inkandswitch.com/local-first/",
                        "https://twitter.com/martinkl/status/1540971616347250688"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.569444444444445
                },
                {
                    "author_link": "https://gov.optimism.io/u/jlewis50",
                    "index": "33",
                    "likes": "0",
                    "time": "27/06/2022-10:51:45",
                    "content": "I just can’t even… you were the steward who was proposing global wage arbitrage by hiring boatloads of devs off upwork for 10$ an hour…and now here completely different tune with others funds… you gitcoin stewards need to have more consistency…you guys are one day talking about lofty ideals of open source funding (with others funds) and then on gitcoin wanting to enact the fiverr dev meme Lol ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party questioning proposal"
                    ],
                    "Sentiment": 6.3
                },
                {
                    "author_link": "https://gov.optimism.io/u/ScaleWeb3",
                    "index": "34",
                    "likes": "4",
                    "time": "27/06/2022-11:23:32",
                    "content": "This proposal fits into Phase 1 but does not add significant value to the growth of Op: Voting No Value-add: Small (Privacy-protected tracking but small impact on Op growth) Amount: Reasonable Op distribution: Bad - internal development Co-incentives: None Thank you for your product, detailed proposal, transparency and quality engagement as delegate. In our view, this funding round’s goal is primarily in increasing liquidity and users on Optimism. Supporting public goods is at the core of the Op retroactive public goods funding but we doubt the positive impact & return for the Optimism ecosystem with this proposal. (Funding Rotki support for Op with $100K will likely not add many users to Optimism as you don’t have a large user base & platform support for Op will not offer network effects).  Ultimately, we are not very supportive of funding internal developments - especially when they don’t have a meaningful impact on the stated goal. Sidenote: That said, we believe a bigger focus on privacy and your support for Optimism are important. On one hand, we hope to see another proposal from you that puts more focus on co-growth initiatives and the Op ecosystem. On the other hand, if the Optimism community clearly stated that they’d also want to improve user privacy in one of the next Phases, this would be an easy yes too. Right now, we feel we can’t make that call as delegate. ",
                    "links": [
                        "https://gov.optimism.io/t/stablenode-delegate-thread/2973/3",
                        "https://gov.optimism.io/t/voting-cycle-2-roundup/2754/43"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.425568684189374
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "35",
                    "likes": "3",
                    "time": "27/06/2022-11:28:57",
                    "content": "Hey ScaleWeb3 thanks a lot for your feedback on why you voted no! I disagree with your overall assessment on the impact of the proposal for optimism and hope the proposal passes so we can build this for the Optimism ecosystem but I really appreciate your feedback on why you voted negatively  This is something all delegates should be doing! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.09375
                },
                {
                    "author_link": "https://gov.optimism.io/u/Bobbay_StableLab",
                    "index": "36",
                    "likes": "2",
                    "time": "28/06/2022-10:56:14",
                    "content": "Rotki is an open-source product so in our opinion it is a public good. Not only that but the proposal details the exact amount of $OP spent, which makes it easy to understand the amount of $OP requested. Even though it does not add a large amount of value to the Optimism ecosystem, it is an essential product. Privacy and open-source goods are important to both web3 and optimism and supporting products similar to Rotki, is something we should focus more on. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.103174603174604
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "37",
                    "likes": "3",
                    "time": "01/07/2022-09:59:39",
                    "content": "I am writing this post as Lefteris the OP delegate and not as the proposer. I opted to vote to ABSTAIN from this proposal as I have a conflict of interest as a delegate here since rotki is also the project I have founded. I am not sure if this is the right thing to do, since many rotki users who would like to see this implemented have delegated to me and asked me to vote with a YES. But it just does not feel correct to do so. I am torn on this. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.892857142857143
                },
                {
                    "author_link": "https://gov.optimism.io/u/fig",
                    "index": "38",
                    "likes": "2",
                    "time": "01/07/2022-15:59:18",
                    "content": "Flipside Crypto will be voting YES in support of rotki. We applaud @lefterisjp  for the detail of his proposal and staunch attention to budget and expenses. Despite the size ~$90,000 - he shows important care of the Collective’s funds and rationality. A delegate and OG among a myriad of Web3 communities we entrust Lefteris to build a product that furthers Optimism and the greater L2 ecosystem. Also - this transparency is important for the forum.     lefterisjp:  I am not sure if this is the right thing to do, since many rotki users who would like to see this implemented have delegated to me and asked me to vote with a YES.   Follow your gut - best of luck building. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 7.025510204081633
                },
                {
                    "author_link": "https://gov.optimism.io/u/Billtino",
                    "index": "39",
                    "likes": "0",
                    "time": "03/07/2022-15:22:38",
                    "content": "great ideas from the team ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/fewol",
                    "index": "40",
                    "likes": "0",
                    "time": "04/07/2022-22:35:00",
                    "content": "I will be voting NO because I didn’t like your biased attitude to another project which was very clear and unprofessional. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.65
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "41",
                    "likes": "0",
                    "time": "05/07/2022-08:29:43",
                    "content": "Thank you for your feedback. You are entitled to your vote. But what is unprofessional is voting out of spite and not on the merit of a proposal ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/SEED_LATAM_Joxes",
                    "index": "42",
                    "likes": "1",
                    "time": "05/07/2022-17:42:27",
                    "content": "We are voting yes on this proposal. Reasons are: very well detailed proposal and amount seems reasonable. Interesting use case to increase interest on Optimism with new tools available. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.530303030303031
                },
                {
                    "author_link": "https://gov.optimism.io/u/krzkaczor",
                    "index": "43",
                    "likes": "1",
                    "time": "05/07/2022-19:19:00",
                    "content": "I’ll vote Yes  Project quality: High - useful app. I can imagine that many users might avoid Optimism without proper tooling. Team quality: High - led by crypto OG, active GitHub Amount requested: Reasonable OP distribution: Bad - funding development ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.304166666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/fewol",
                    "index": "44",
                    "likes": "0",
                    "time": "05/07/2022-20:26:41",
                    "content": "To vote out of spite I would need to have a project proposed and since I don’t then quite hard for it to be spiteful! I didn’t like your clear biased attitude which is highly unprofessional, but the main reason for voting NO is the same reason I posted here [READY] [GF: Phase 1 Proposal] Candide Wallet - #29 by fewol ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.2184027777777775
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "45",
                    "likes": "0",
                    "time": "05/07/2022-21:49:17",
                    "content": "thank you for your feedback and for pointing me to an answer that would explain your approach. I obviously disagree with you and your view on opensource. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Justin",
                    "index": "46",
                    "likes": "1",
                    "time": "06/07/2022-05:28:36",
                    "content": "I have a couple objections to this, even though it looks like it will easily pass. 1 - If this is a public good, isn’t it more appropriate to seek retroactive public goods funding, something that is at the core of OP. 2 - Developers have to get paid obviously, but isn’t the point of Phase 1 to incentivize usage and liquidity?  These tokens are to stimulate usage, not speculate on development. Why do you think this is passing and what do you think i am missing? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.208333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/linda",
                    "index": "47",
                    "likes": "1",
                    "time": "06/07/2022-13:50:58",
                    "content": "I voted yes on this proposal since there is already traction and a proven track record with the team, the amount requested is reasonable, and I’m a fan of having an open source, privacy-focused portfolio tracker for Optimism users. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/luxumbra",
                    "index": "48",
                    "likes": "1",
                    "time": "06/07/2022-17:22:18",
                    "content": "Love Rotki and would love to see support for more networks. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/vonnie610",
                    "index": "49",
                    "likes": "1",
                    "time": "07/07/2022-18:36:35",
                    "content": "Snapshot vote - passed ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "50",
                    "likes": "0",
                    "time": "08/07/2022-00:09:03",
                    "content": "Hey Justin. Thanks for those points. I think I answered those both above and in discord but for completeness sake let me go at it here again.  No. Retroactive public goods funding is not a sustainable way to fund open source software development (or any kind of software development). You can’t expect people to create a project for free and then maybe if you like it throw them a small amount of coins as a thank you. For (2) I asked around discord and some members of the optimism team and they said it’s fine. I find “incentivizing usage” a waste of money as this is just creating fake adoption by buying users who come in just for the extra tokens and then leave. So called mercenary users. Creating real software that can help people is creating value. Not speculation.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.361111111111111
                },
                {
                    "author_link": "https://gov.optimism.io/u/bobby",
                    "index": "51",
                    "likes": "0",
                    "time": "26/07/2022-23:12:59",
                    "content": "hey @lefterisjp – can you provide a Telegram handle or preferred contact method so the Optimism team can get in touch about paying out this grant  Feel free to comment on this thread, DM, or email bobby@optimism.io. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "52",
                    "likes": "0",
                    "time": "27/07/2022-07:30:26",
                    "content": "Ah thanks @bobby was wondering what were the next steps. Let me email you. By the way I am also in Optimism discord if you need to quickly chat: lefterisjp | Rotki#7253 ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.888888888888889
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "53",
                    "likes": "0",
                    "time": "13/09/2022-19:54:30",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "54",
                    "likes": "0",
                    "time": "27/01/2023-18:32:49",
                    "content": "Hi @lefterisjp! Do you have any update on your grant that you could share with the community? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "55",
                    "likes": "0",
                    "time": "27/01/2023-21:48:52",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "56",
                    "likes": "6",
                    "time": "27/01/2023-23:30:42",
                    "content": "Hey @lavande. So the update is that everything is almost ready. If someone wants to test it they can check out the develop branch of rotki. Code is all there: GitHub - rotki/rotki: A portfolio tracking, analytics, accounting and tax reporting application that protects your privacy and they can build by source. For some sneak peeks of how Optimism integration looks like in rotki check the following tweets and screenshots:  twitter.com    Lefteris Karapetsas | Hiring for @rotkiapp @LefterisJP  The @rotkiapp v1.27.0 version is coming very soon™!  With it is the long-awaited @optimismFND upgrade where: 1. All your addresses that have had activity in optimism will automatically pull it. 2. All optimism transactions are decoded. 3. Optimism balances will be shown. https://t.co/cVzJFUh27t   9:38 PM - 27 Jan 2023           6                1              twitter.com    Lefteris Karapetsas | Hiring for @rotkiapp @LefterisJP  🐦So freaking excited about all the cool stuff coming to @rotkiapp in v1.27.0!  🧑‍💻The team is working hard to test/perfect the code  😋First and foremost all our @optimismFND users will be happy to see all optimism transactions properly decoded and shown in the user interface! https://t.co/3BedEdBX7S   12:13 PM - 19 Jan 2023           42                9            What is included is:  All addresses tracked that have also optimism activity get it detected and are considered also as optimism capable addresses. Balances for ETH and tokens of all optimism addresses is pulled. All optimism history is pulled and processed All optimism transaction history is decoded and transactions are shown in a human readable format. Optimism transactions are also taken into account in rotki’s accounting and PnL report.  This is still only in develop and we are in the very final stages of testing as this is all scheduled to be part of our next release, 1.27.0. Software takes … always a lot longer than you expect it to. I will post here again when 1.27.0 is ready! ",
                    "links": [
                        "https://twitter.com/LefterisJP/status/1619087411010478081",
                        "https://twitter.com/LefterisJP/status/1619087411010478081",
                        "https://twitter.com/LefterisJP/status/1619087411010478081",
                        "https://twitter.com/rotkiapp",
                        "https://twitter.com/optimismFND",
                        "https://t.co/cVzJFUh27t",
                        "https://twitter.com/LefterisJP/status/1619087411010478081",
                        "https://twitter.com/LefterisJP/status/1616046185130741760",
                        "https://twitter.com/LefterisJP/status/1616046185130741760",
                        "https://twitter.com/LefterisJP/status/1616046185130741760",
                        "https://twitter.com/rotkiapp",
                        "https://twitter.com/optimismFND",
                        "https://t.co/3BedEdBX7S",
                        "https://twitter.com/LefterisJP/status/1616046185130741760"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.806944444444444
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "57",
                    "likes": "8",
                    "time": "03/02/2023-19:12:53",
                    "content": "Just posting an update. Optimism support is now in production: Release Rotki v1.27.0 - Herbst Corpuscle · rotki/rotki · GitHub     ",
                    "links": [
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-rotki/5025"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "58",
                    "likes": "1",
                    "time": "23/02/2023-17:46:54",
                    "content": "Hey @lefterisjp wanted to direct you to a new piece Milestone Assessment . Aligning your milestones with these guidelines is not mandatory for cycle 10, but you can get a better score on the final review if you do implement it. These are intended to provide some more concrete tracking of this work. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.155303030303029
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "59",
                    "likes": "1",
                    "time": "23/02/2023-18:14:59",
                    "content": "Hey Jack did you mean to post this in [DRAFT][GF: Phase 1 Proposal] rotki? Since this one is finished and succesfully implemented. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.4375
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "60",
                    "likes": "1",
                    "time": "24/02/2023-01:37:18",
                    "content": "I did! Apologies – crossed wires there. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "106"
}