{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/draft-gf-phase-1-proposal-hashflow/2461",
            "title": "[DRAFT][GF: Phase 1 Proposal] Hashflow ",
            "index": 2461,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Governance Fund: Phase 1"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/gxmxni",
                    "index": "1",
                    "likes": "31",
                    "time": "04/06/2022-20:10:48",
                    "content": "Project Name: Hashflow Author Name: Victor Ionescu (@gxmxni) Number of OP tokens requested: 1,000,000 OP L2 Recipient Address: 0xE8bc44AE4bA6EDDB88C8c087fD9b479Dff729850 Relevant Usage Metrics: TVL: ~$750,000 on Optimism (~ $21M across all networks) Trading Volume: About $200K / day on Optimism, anywhere from $10M-$150M a day across all networks (depending on market conditions) Number of Trades: 100 / day on Optimism, 3,000 / day across all networks Monthly Trading Volume across all networks: 1B Optimism alignment (up to 200 word explanation): Hashflow is a DeFi-native protocol that enables bridgeless cross-chain swaps with guaranteed execution and MEV protection. Users can swap a variety of tokens on other EVM chains for Optimism tokens (ETH, USDC, USDT). This makes Hashflow a great way to “bridge” tokens of any kind into Optimism – think swapping BNB on BNB Chain for ETH on Optimism. Moreover, Hashflow offers the same MEV protection, 0 slippage trading experience intra-chain – users can swap their tokens within Optimism using Hashflow. Hashflow launched on Optimism a month ago, and debuted its Bridgeless Cross-Chain Swaps with Day 1 support for Optimism. Moreover, Hashflow is a great trading experience for intra-chain transactions as well (that is how Hashflow started). To sum up:  we want to build a great bridging experience into Optimism we want to build a great trading experience for users that are already on Optimism  For both cases, liquidity and fees are key, which is the main motivation behind this proposal. Proposal for token distribution (under 1000 words): How will the OP tokens be distributed? We propose that:  300,000 of the received tokens will be distributed as rebates to the users who bridged INTO Optimism from other chains, until they run out 700,000 of the received tokens will be distributed over the course of 12 months, in equal monthly batches, to users who deposit TVL into Optimism pools  Bridging rebates - 300,000 OP (30%) Hashflow uses LayerZero infrastructure to create a bridgeless cross-chain swap experience. This means that the users have to pay Oracle and Relayer fees when they execute the trades, on top of gas on both the source and destination chain. We propose that $OP tokens will be used as rebates, so that these fees are effectively reduced to 0, and users do not face cost roadblocks when trading their funds into Optimism. TVL on Optimism 700,000 OP (70%) Hashflow runs public pools that exhibit no Impermanent Loss. These pools contain funds provided by Hashflow users, and managed by Professional Market Makers (e.g. GSR, Wintermute, LedgerPrime). Hashflow is already incentivizing Optimism pools with $HFT tokens, but adding $OP token incentives would allow us to create more liquidity and have higher quote availability for trades within the Optimism network (e.g. ETH - USDC). It will also help us provide enough liquidity for the users looking to bridge into Optimism. How will this distribution incentivize usage and liquidity on Optimism? The $OP tokens are used to:  make it easier to bring funds to Optimism boost liquidity (TVL) in pools in order to create a good MEV-free trading experience  Why will the incentivized users and liquidity remain after incentives dry up? Hashflow Pools offer Impermanent Loss-free yields in the supplied tokens (single sided liquidity). We expect that the users will keep enjoying the yields which, as the OP network grows, will become more and more competitive. Essentially, the first year of incentives will be used to bootstrap the ecosystem to a point where it’s self sustainable. Over what period of time will the tokens be distributed?  Rebates: as long as the funds last TVL incentives: 1 year  How much will your project match in co-incentives? Hashflow will match $HFT 1-1 commensurate to the amount of $OP received. This will come on top of the already existent $HFT incentives. ",
                    "links": [],
                    "GPT-summary": "The post is a draft proposal for a DeFi-native protocol called Hashflow, which enables bridgeless cross-chain swaps with guaranteed execution and MEV protection. The proposal requests 1,000,000 OP tokens and outlines how they will be distributed to incentivize usage and liquidity on Optimism. The proposal also includes information on the project's TVL, trading volume, and number of trades. The post explains the proposal in detail and invites feedback and questions from third parties, while also expressing a willingness to collaborate.",
                    "GPT-proposal-categories": [
                        "Token economics",
                        "Interoperability and Scalability",
                        "Grants, Funding and resource allocation",
                        "Community and engagement"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 6.173319327731093
                },
                {
                    "author_link": "https://gov.optimism.io/u/parsasbr",
                    "index": "2",
                    "likes": "1",
                    "time": "05/06/2022-02:48:45",
                    "content": "LFG  OPTIMISM & HASHFLOW ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Mraadil",
                    "index": "3",
                    "likes": "1",
                    "time": "05/06/2022-03:38:19",
                    "content": "Best Dex i have ever seen! and for sure the compatiblity with all chain optimism as well with great liquidity glad to be user of it ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/mirmir",
                    "index": "4",
                    "likes": "0",
                    "time": "05/06/2022-05:04:45",
                    "content": "OPTIMISM & HASHFLOW this is the best cooperation I can imagine, So go on OP, give hashflow opportunity that needed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Fju_ry",
                    "index": "5",
                    "likes": "1",
                    "time": "06/06/2022-08:26:27",
                    "content": "I do support the proposal, because Hashflow contributes a lot to the growth of the OP ecosystem by its cross-chain swaps from and into Optimism. This incentive will boost the further usage of Optimism on Hashflow! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/MAMI",
                    "index": "6",
                    "likes": "0",
                    "time": "06/06/2022-18:07:44",
                    "content": "Best Dex, I will support the proposol. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Justin",
                    "index": "7",
                    "likes": "0",
                    "time": "13/06/2022-06:03:52",
                    "content": "Relative to others, the token request is very heavy - but the proposed use is a good use of the OP tokens.  I am wondering if some OP voters might reject it for the quantity of tokens requested even though it is a good proposal? I noticed that you only currently have 1 pool open on Optimism.  Would you need to allocate a portion of your TVL incentives to encouraging market makers to migrate over too? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.814285714285714
                },
                {
                    "author_link": "https://gov.optimism.io/u/gxmxni",
                    "index": "8",
                    "likes": "1",
                    "time": "13/06/2022-20:30:34",
                    "content": "Thanks for the feedback – I think the amount was chosen somewhat arbitrarily and would be curious to see what a better estimate should be. I am certainly amenable to changing it to something that is more reasonable – would love some feedback regarding what a better amount would be. Here’s some back of the envelope computation, assuming $OP is priced at $1 (currently it’s much less, sitting around 55c):  assuming cross-chain fees of $20, 15,000 users would be reimbursed for their trade into Optimism assuming 5MM is enough TVL to sustain blue chip trades (Hashflow is very capital efficient), the $OP tokens over a year would constitute a 14% APY boost  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.811111111111112
                },
                {
                    "author_link": "https://gov.optimism.io/u/Optimus",
                    "index": "9",
                    "likes": "1",
                    "time": "15/06/2022-12:58:57",
                    "content": "Interesting project and I agree with @gxmxni, I don’t know why 1M tokens was chosen. It seems chosen arbitrarily. Could you elaborate more on this? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/Cryptoz",
                    "index": "10",
                    "likes": "2",
                    "time": "19/06/2022-11:04:53",
                    "content": "I don’t see any concrete reason for the 1,000,000 OP or any actual reason of usage. There is no clear use of funds or reason why any of what will be done would even drive value. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.166666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/gxmxni",
                    "index": "11",
                    "likes": "0",
                    "time": "19/06/2022-14:15:23",
                    "content": "The 1M has been chosen arbitrarily. I shared some back-of-the-envelope calculation above, but the amount can be adjusted down. This would result in:  for bridging gas rebates: this does not get affected much, aside from the number of bridging transfers that would be covered for liquidity mining; APY could be lowered, in the idea that $OP will be worth more in the future OR total duration of the rewards could be lowered  Regarding the value: respectfully, your statement does not create constructive conversation, as it does not address any of the points in the proposal. However, I will try to answer this in the best way I can.   TVL – Optimism right now has very low TVL and almost no usage in terms of DeFi. This is problematic and creates a chicken and egg problem, particularly for AMMs, that are liquidity hungry. The benefit that Hashflow brings is that it can create markets via PMMs, in a much more capital efficient manner. For example, $5M of TVL can easily sustain trades up to $500K between the blue chips (ETH, USDC, USDT, DAI). This means that the TVL bootstrap cost for creating a good trading experience is much lower.   Bridging rebates for users who take their liquidity to $OP – this clearly benefits $OP users, as they can effectively take their funds into Optimism for free.   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.143217893217894
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "12",
                    "likes": "4",
                    "time": "19/06/2022-16:13:41",
                    "content": "    gxmxni:  assuming cross-chain fees of $20   which bridge is charging you this much? official bridge will cost you $5, unless gas is insanely high. Some points on the proposal:-  30% allocation is good. With 70% I dont agree, this will only bring artificial tvl to your platform looking to farm the token. Good to see that you are matching 1:1with your project token.   make it easier to bring funds to Optimism  what does this mean exactly ? 70% of 1M token asked is going to LP reward which will not work long term, is the current format, unfortunately, i would vote against this proposal. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.2488636363636365
                },
                {
                    "author_link": "https://gov.optimism.io/u/gxmxni",
                    "index": "13",
                    "likes": "1",
                    "time": "20/06/2022-20:06:50",
                    "content": "Thank you for the detailed response @OPUser. I want to brainstorm here a bit, if you may, as I think Hashflow could do great in the ecosystem, but at the same time, just like you, I don’t want to vest incentives on farmers. The way I see our trading environment, there are 3 components:  Trading (taking liquidity) Liquidity Provision Market Making between the two above  The way our LPs make money in the long run is by having Market Makers deposit fees into the pools, based on the generated trading volume. These fees generate Impermanent Loss-free yield on single-sided liquidity: you deposit 10ETH, you get 1ETH over a year. In general, trading volume follows liquidity, and liquidity follows trading volume → this results in a chicken / egg problem. In my opinion, the easiest way to break out of that problem is providing idle liquidity, then marketing that liquidity to attract trading volume, until the capital efficiency (turnover rate) reaches desired levels. The fear here is that simply promoting idle liquidity will no longer work once the incentives dry up, as the remaining incentives will not be enough to retain users, and those users will take money somewhere else: the next shiny incentive. That’s a well founded fear, and there is an alternative that I have in mind. Like I mentioned above, success looks like: LPs make money off yields posted by Market Makers back into the pools. Without trading volume, this 1ETH is hard to generate, as there is no turnover on the liquidity. One alternative scheme:   Incentivize the pools with a base $HFT APY. We already have plans to do this, and we can boost this in a 1-1 fashion with distributed $OP, as outlined in the proposal.   Award $OP yields 1-1 commensurate to Market Maker yields, with a ceiling. The ceiling could be 10%. A few examples: if the MM generates 1% yield, we match that with 1% yield in $OP. If they generate 7% yield, we match that with 3% in $OP. That is, once a Market Maker has reached enough turnover to generate up to 10% organic yields, $OP should not be needed to incentivize: we consider this Escape Velocity.   Market the product and generate enough demand and turnover over time, until both $OP and $HFT can be removed as incentives, and the system is self sustainable.   The reason I think this is better than what I originally proposed:  it requires less $OP to sustain – we can probably reduce this proposal from 1M $OP to something like 300K $OP (with 100K for gas and 200K for pool incentives) it does not distribute $OP unless the system shows organic traction – if only idle liquidity is provided and there is no (profitable) trading, no $OP gets distributed  The other main alternative would be to not incentive LPs at all with $OP and resort only to the Gas Rebates part. I still maintain that liquidity is super important to bootstrap a healthy trading system. Optimism TVL right now is very low compared to other chains. Regarding your comment on $20 – this was the price for swapping from Ethereum a while ago when ETH was high and gas was higher. A $20-$30 transaction on Ethereum is definitely not out of the ordinary. Our current swaps cost about $10 from Ethereum and $5 from other chains. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.226409774436091
                },
                {
                    "author_link": "https://gov.optimism.io/u/Deepdefi",
                    "index": "14",
                    "likes": "0",
                    "time": "20/06/2022-20:26:02",
                    "content": "Hashflow is going to be an important part of OP ecosystem so all the support now will make a difference later and in the next few years. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "15",
                    "likes": "1",
                    "time": "21/06/2022-14:37:25",
                    "content": "    gxmxni:  Optimism TVL right now is very low compared to other chains.   If you know this then you might also know that others chains does not even have a token and still they manage to build that TVL, which gives me a felling that either they are better chain or have better DApps. Airdrop and reward should be treated as welcome gift to the users already interested to come to chain or to motivate them to come not to hold them, holding the users is chain and/DApps job. One thing I do like is that you are matching 1:1 and 300K might seems reasonable amount of OP but its does not make it clear why a user would stay longer. On the gas rebate, i need to check, how many project proposal can submit for the same. HOP is giving complete rebate on gas, so as a user i can use hop and bridge my token to OP chain and now I am free to use any Dapps. At the time of writing:- hashflow will cost $28 to bridge from main chain to OP Official bridge $2.4 Hop is cost you $0 So giving rebate on your platform is not worth it when other cheaper option is available on chain. As of now, I am still uncertain but may be other users and delegates can provide their feedback and bring their input. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.021494708994709
                },
                {
                    "author_link": "https://gov.optimism.io/u/gxmxni",
                    "index": "16",
                    "likes": "1",
                    "time": "21/06/2022-15:01:45",
                    "content": "First off, I agree that TVL incentives are generally hard to translate into a long term usage funnel. My strategy, as outlined, would work well even if $OP was not on the table – so I’m not 100% sure we would need $OP for that – $HFT may be enough to try and play with it. However, when I think of $OP, I don’t think of it as a “welcome gift”, but a token that should be as decentralized as possible, and used for governance. The best way to decentralize IMO is by attracting new users and airdropping it to them → which is where I am a strong proponent of the bridging scheme. To shed a bit more light on the fees. At the time of writing:  Hashflow costs $22 Hop costs $11 Official OP bridge costs $11  These numbers all include gas. While Hashflow costs will be improved in further releases (via gas optimization mostly), one thing that you cannot do on either Hop, or the official OP bridge (or anywhere else really), is directly swap other currencies for OP ones. On Hashflow, you can swap $BNB on BNB Chain to $ETH on OP. Note that the gas rebates don’t have to be full rebates, but they can be limited to numbers that make sense and optimize for decentralization. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.06811815635345
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "17",
                    "likes": "1",
                    "time": "21/06/2022-15:27:16",
                    "content": "I agree with some of your points and disagree with others but I dont see we are not making any progress in right direction. One thing I would to correct is Hop fee, I was referring to rebate that they will give for birding hence the actual fee with 0, for other two, lets agree to disagree as only way to prove this is to do one swap on each which is not worth it. Anyway, I am still here and will be checking the proposal time-to-time but in current form I cant support it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.008928571428571
                },
                {
                    "author_link": "https://gov.optimism.io/u/gxmxni",
                    "index": "18",
                    "likes": "1",
                    "time": "21/06/2022-15:50:38",
                    "content": "I would actually be interested to hear a bit more about what legitimate uses of the $OP airdrop would be in your view (that would show long term use). Having those as baseline could probably facilitate better discussion. Without such feedback, it is hard for me to generate a new proposal or even withdraw this current one. RE Hop fees - I was not aware of rebates, I simply compared MetaMask estimates for the value sent to the contract, but that is not ultra relevant, as fees are not what I am trying to advertise. Actually $HFT rebates are a potentially good idea to tackle the differential between swap cost for popular pairs. Of course, our plan is to keep building and driving TVL / trading irrespective of these incentives. Our general strategy does not pivot at all on the $OP airdrop. However, we want to establish ourselves as one of the pieces of infrastructure on OP, and as such, it is our responsibility to do our best to have these discussions, for the long term benefit of the ecosystem and its users. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.005471380471381
                },
                {
                    "author_link": "https://gov.optimism.io/u/homelukai",
                    "index": "19",
                    "likes": "0",
                    "time": "06/07/2022-17:47:47",
                    "content": "I support Hashflow LFG ! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Evgeny",
                    "index": "20",
                    "likes": "1",
                    "time": "25/07/2022-06:17:06",
                    "content": "@OPUser There are plenty of proposals here that give out OP for LP’s. Some examples:  Stargate - [GF:Phase 0 Proposal] Stargate Finance  Clipper - [GF: Phase 0 Proposal] Clipper  Biconomy - (I can’t paste a new link since I’m a new user, but I’m sure you can find the proposal - its Phase 1)  All these proposals passed and they give out OP for LPs. What’s the difference here? ",
                    "links": [
                        "https://gov.optimism.io/t/gf-phase-0-proposal-clipper/1322"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.287878787878788
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "21",
                    "likes": "1",
                    "time": "25/07/2022-07:11:52",
                    "content": "Hi @Evgeny , that is a valid question but let show you something.  image780×1030 47.3 KB   image642×1091 37.9 KB  I took this screenshot just to show you the difference between the Hashflow bridge and official bridge, now you tell me, why would you support a bridge that need optimization, what special it has to offer ? ",
                    "links": [
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/c/ced90ff7f5128998345731a60f2fcea53a51886e.png"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.7857142857142865
                },
                {
                    "author_link": "https://gov.optimism.io/u/memento7mori",
                    "index": "22",
                    "likes": "1",
                    "time": "25/07/2022-13:44:03",
                    "content": "Let me ask you, why are you comparing technology solutions in the form of asset exchanges between networks? Any user tends to choose the product he likes and fits better. Hashflow is a fairly well-known project with its own audience. Doesn’t OP collaborate with projects to promote its solution and reach new audiences. Also, what can be tweaked in the main proposal to participate in the distribution As an active OP user, I will definitely vote - In favor! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.406926406926407
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "23",
                    "likes": "1",
                    "time": "25/07/2022-13:49:29",
                    "content": "Sure, thats the goal of gov, everyone can have their opinion and vote on their accord. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/gxmxni",
                    "index": "24",
                    "likes": "6",
                    "time": "25/07/2022-14:06:39",
                    "content": "@OPUser This proposal will be tweaked after the next version of our cross-chain swap product has been implemented, TVL has been improved, and fees have been lowered. However, I would like to show you something as well:  Screen Shot 2022-07-25 at 3.00.10 PM848×1450 69.5 KB  This is execution with no slippage or price impact, regardless of the duration of message passing. There’s no other protocol that does this right now. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.580357142857143
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "25",
                    "likes": "3",
                    "time": "25/07/2022-14:14:09",
                    "content": "Thanks, looking forward to updated proposal. Please highlight this, if its unique(I assume here you want to show that I can swap USDC directly to ETH on OP chain) to your application in new proposal.  This is execution with no slippage or price impact, regardless of the duration of message passing. There’s no other protocol that does this right now.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.784577922077922
                },
                {
                    "author_link": "https://gov.optimism.io/u/memento7mori",
                    "index": "26",
                    "likes": "1",
                    "time": "25/07/2022-14:23:22",
                    "content": "I’ve been watching Hashflow for quite some time And these guys always come up with something new in technical implementation and do not stand still So I am sure that they will take a worthy place on the DeFi pedestal So I am sure there will be a good collaboration between OP and Hashflow Looking forward to an updated proposal and the launch of voting   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 6.808080808080809
                },
                {
                    "author_link": "https://gov.optimism.io/u/Juggernaut",
                    "index": "27",
                    "likes": "0",
                    "time": "24/10/2022-11:20:36",
                    "content": "Nice, grow the ecosystem!  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/Mingyue",
                    "index": "28",
                    "likes": "1",
                    "time": "24/10/2022-14:43:46",
                    "content": "    gxmxni:  This proposal will be tweaked after the next version of our cross-chain swap product has been implemented, TVL has been improved, and fees have been lowered. However, I would like to show you something as well   I have some questions. If I want to swap 10000USDC on mainnet to ETH on optimism,why i don’t swap on mainnet first then bridge or just bridge the usdc to optimism first,then use uniswap to swap? The first cost more gas and the second one cost less gas,and uniswap should have less slippage than hashflow. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.476190476190476
                }
            ]
        }
    ],
    "group_index": "63"
}