{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/gf-phase-1-proposal-firn-protocol/5340",
            "title": "[GF: Phase 1 Proposal] Firn Protocol ",
            "index": 5340,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Governance Fund: Phase 1"
            ],
            "tags": [
                "growth",
                "cycle-11"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/firnprotocol",
                    "index": "1",
                    "likes": "8",
                    "time": "25/02/2023-14:57:33",
                    "content": "Basic Details Project name: Firn Protocol. Author name and contact info (please provide a reliable point of contact for the project.): Captain McAteer. firnprotocol@proton.me. L2 recipient address: Firn’s Optimism Safe: 0x0c1B55A93dFffa8021d0EaCc79874caD1bBB7d4b. Which Voting Cycle are you applying for?: Cycle 11. I confirm that I have read the landing pages for the Builders and Growth Experiments Sub-Committees and that I have determined my proposal is best suited to be reviewed by the Growth Experiments Sub-Committee: Yes. I understand that Growth Experiments grants are subject to a “no sale rule,” as explained in this post, and I have read the terms of the rule: Yes. Project Details What are you building?: Firn is a state-of-the-art, zero-knowledge privacy protocol for Ethereum, which overcomes certain critical efficiency bottlenecks that alternative approaches face. Firn’s browser-based front-end can retrieve and process its user’s account state using only a constant amount of bandwidth and computation; other approaches must inefficiently “synchronize”, expending computational effort proportional to the network activity processed since the last sync (as well as assistance from off-chain indexers, etc.). Firn’s client is stateless, never caches state on the device, and never communicates with off-chain services during sync; it can easily run on mobile and in Tor. Why do you believe what you are building is going to succeed?: Because of Firn’s unique architecture, it is massively more efficient, easy-to-use, and easy-to-engineer than alternatives. We believe that these differences will be decisive. More prosaically, Firn is the only privacy protocol currently deployed on Optimism. How many users does your project have currently? Please include how you arrived at this estimate: Not many yet: about 50. This was calculated by looking at the number of unique Firn accounts that have ever been created. How will receiving a grant enable you to further the mission of maximizing the number of users interacting with Optimism? Please include a step-by-step flow of how you imagine this grant can lead to a greater number of user interactions with Optimism: The main thing that we can do with grant funds is incentivize users who create Firn accounts, deposit ETH, and grow the anonymity pool. These acts will lead to interactions with Optimism for obvious reasons. Secondarily, we can also incentivize users who contribute to Firn’s art/design, as well as spread awareness of it. As a more indirect effect, by making more people aware of Firn, we will plausibly bring people to Optimism who wouldn’t have chosen it otherwise. (Firn is deployed on a few other networks, but Optimism is our largest.) Tell us about the users you plan to target with this grant. Include any defining characteristics that will help you identify and target them.: Firn targets generally savvy crypto/Optimism users who want funds privacy, as well as privacy in DeFi interactions. Our main social media presence is our Discord. Beyond this, we can use Twitter and word-of-mouth to seek out new users. How would these users interact with Optimism? For how long?: They would start by depositing ETH into Firn. These funds would then (ideally) persist long-term. Indeed, (like Tornado) Firn isn’t effective when used as a “pass-through” layer; you need to keep your funds there over time. Rather, Firn should be viewed as a “private wallet” where you keep all your funds, and use/withdraw them only as necessary. We will make this clear to users, and will not reward users who use Firn as a pass-through (this is typically obvious when it happens). rem Provide us with links to any of the following for the project:  Demo: Website: https://www.firn.cash, https://firn.eth.limo  Twitter: https://twitter.com/firnprotocol  Discord/Discourse/Community: Firn Protocol  Github: firnprotocol (Firn Protocol) · GitHub  Technical/Economic Documentation: Firn Protocol – Medium  Other:  Do you have any metrics on the project currently? (TVL, transactions, volume, unique addresses, etc. Optimism metrics preferred; please link to public sources such as Dune Analytics, etc.): TVL on Optimism is about 130 ETH right now; we have about 50 unique users, and roughly 1 transaction per week. Who are your competitors, and are they on Optimism?: Main competitor is Aztec Network; they are not on Optimism. Please link to code audits (if any): Team Who are your founders?: Captain McAteer (anonymous founder). What makes your team well-suited to carry out the project described in this proposal? Captain is an expert-level cryptographer and engineer. Is this your first Web3 project?: Yes. If not, what else have you built? (Share links, Github repository, or any other useful information.): Grant Request What is the size of the grant request? (250k OP max): 100,000 OP. How do you justify the size of the grant?: This is an appropriate size to incentivize significant (10x–100x) growth, targeting a minimum of 1,000 ETH TVL. Roadmap and Distribution Plan Describe in discrete steps how you will successfully implement your grant plan: How will the OP tokens be distributed? (please include % allocated to different initiatives such as user rewards/marketing/liquidity mining. Please also include a justification as to why each of these initiatives align with the problem statement this proposal is solving. Distribution should not include the sale of any tokens by the grantee or the use of tokens for compensation, protocol expenses, etc. See the no sale rule here: We plan to expend 50% of the grant on deposit incentives (i.e., rewarding users who deposit ETH into Firn on Optimism, and keep it there). This is the bare crucial metric to get Firn more established, and also directly translates to Optimism use. We plan to reserve the remaining 50% for partnerships with other protocols. Indeed, Firn offers pluggable privacy, in the sense that other protocols—via a minor, front-end-only integration with our MetaMask Snap (no new contracts need to be written or deployed, unlike the case of Aztec)—can plug Firn’s privacy into their project. Incentivizing other projects to use Firn simultaneously benefits the projects, Firn, and Optimism; indeed, it increases the feature-set and the userbase of the other projects, it increases the usage and TVL of Firn, and it increases activity on Optimism. We will use this space to moreover explain our disbursal procedure. Deposit incentives will be disbursed according to the following mechanism. We will first filter for and exclude deposits which were obviously immediately withdrawn. (Though the privacy properties of Firn are designed to prevent linking deposits and withdrawals, this linking can be performed under certain circumstances associated with obvious gaming; for example, these include cases in which the user withdraws immediately after depositing, the user withdraws back to the same address the deposit came from, or the user withdraws the exact same—and unique—amount deposited.) After excluding these deposits, we will reward deposits directly proportionally to the size deposited. (Barring the above scenarios, there is likewise no way to determine the length of time any given deposit is kept; for this reason, we can’t weight based on duration.) For example, we could reward 20 OP per ETH deposited (and not immediately withdrawn, see above). This would correspond to 50,000/20 = 2,500 total ETH incentivized. For partnership incentives, we will withhold the granting of the incentive until the project has demonstrated a complete and high-quality integration, as well as active and continuing user flow through the Firn partnership. Over what period of time will the tokens be distributed for each initiative?: A year is our target upper-bound for both distributions. For deposit incentives, we may immediately begin distributing to users who have already made significant deposits and shown commitment to the protocol; further disbursements can begin as appropriate. Please provide benchmark milestones for this project. These milestones should guide the Optimism community on the progress of your project throughout your work on the project. Do not use distribution of the grant itself as a milestone: TVL is, and will likely remain, the primary milestone for Firn. Specifically, we are targeting a minimum of 1,000 ETH TVL as our goal, say, attained by 8/8/23 (the 1-year anniversary of our launch); the more beyond this, the better. Our “reach” milestone is to exceed the (former) TVL of Aztec, of around $12M TVL (so around 7,000 ETH), say by 1 year from the date of our receipt of the grant. Secondary milestones are things like number of unique users; we are targeting ≥ 1,000 total unique users as of 8/8/23 (excluding wallets controlled by the team). We are also targeting transactions per week, say ≥ 100/week by 8/8/23. On the partnerships side, we are targeting 5 high-quality and active partnerships; with a reach goal fo 10. Please define critical milestones for this project. Critical milestones are meant to show good-faith efforts to accomplish the project. Non-completion of these milestones could lead to revocation of remaining grant rewards. Do not use distribution of the grant itself as a milestone: As a starting point, our critical milestones include a clear announcement of the receipt of the grant to the community, clear articulation of reward conditions, commencement of disbursement to existing users, and advertising efforts to make prospective users aware of the grant. Beyond this, our quantitative critical milestones are as follows. These include a more-than-doubling of our TVL on Optimism, to a total of ≥ 300 ETH, and an expansion of our userbase, to get ≥ 200 unique (non-team) users, all by 8/8/23. The attainment of at least 1 high-quality partnership should also be viewed as a critical milestone. If the OP tokens are for direct distribution to users, why will incentivized users and liquidity on Optimism remain after incentives dry up?: Ideally, yes, since Firn is providing a real, valuable service (privacy), which users have real reason to use. The key is just to make people aware. Please provide any additional information that will facilitate accountability (smart contracts addresses relevant to the proposal, relevant organizational wallet addresses, etc.): Main Firn contract on Optimism: 0x3c6c27072356016f05a4736faaba91d3c2b26e90 (note: recently upgraded). Firn Safe on Optimism: 0x0c1B55A93dFffa8021d0EaCc79874caD1bBB7d4b. Optimism Relationship Does your project solve a problem for the Optimism ecosystem? If so how?: Absolutely: the problem of lack of financial privacy. Why will this solution be a source of growth for the Optimism ecosystem?: Privacy is an essential ingredient in Ethereum, and creates significant positive-sum effects. Firn started on Optimism; a continued focus here will attract users. Is your project Optimism Native?: Yes, in these sense that Optimism was the first pool we deployed, and continues to be our largest and most active pool. We are also deployed on other networks (mainnet and Arbitrum). Confirmations I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: Yes. I understand that I will be expected to following the public grant reporting requirements outlined here: Yes. ",
                    "links": [
                        "https://foul-porch-0eb.notion.site/Builders-Sub-Committee-02ba9da5b4534fbf955e6e4c8fcf1aa3",
                        "https://foul-porch-0eb.notion.site/Growth-Experiments-Sub-Committee-270d2f75ff0f410a869b2ba6a8324006",
                        "https://www.firn.cash",
                        "https://firn.eth.limo",
                        "https://twitter.com/firnprotocol",
                        "http://discord.gg/2TPJE7CMdu",
                        "https://github.com/firnprotocol",
                        "https://medium.com/@firnprotocol/",
                        "http://calendar.google.com/calendar/u/0/r?tab=mc",
                        "https://www.npmjs.com/package/@firnprotocol/snap",
                        "https://optimistic.etherscan.io/address/0x3c6c27072356016f05a4736faaba91d3c2b26e90",
                        "https://optimistic.etherscan.io/address/0x0c1B55A93dFffa8021d0EaCc79874caD1bBB7d4b",
                        "https://gov.optimism.io/t/suggested-public-reporting-requirements-for-grantees/4176"
                    ],
                    "GPT-summary": "The post is a proposal for a project called Firn Protocol, which is a privacy protocol for Ethereum. The author provides details about the project, including its unique architecture and how it is more efficient than alternatives. The author also explains how the grant will be used to incentivize users to deposit ETH and grow the anonymity pool, as well as incentivize users who contribute to Firn's art/design and spread awareness of it. The post also includes information about the team, competitors, and critical milestones for the project.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Privacy, Security and risk management",
                        "Interoperability and Scaleability",
                        "Smart contract updates",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.679626030903403
                },
                {
                    "author_link": "https://gov.optimism.io/u/FractalVisions",
                    "index": "2",
                    "likes": "1",
                    "time": "25/02/2023-16:14:05",
                    "content": "Please refer to this milestone guidelines form.     Milestone Assessment Grants       The Council has added guidance on what it is looking for in articulating milestones for assessing the success of a project. The guidance can be used by Cycle 11 applicants to provide more specificity on benchmarks and critical milestones. The guidance will also be provided to Cycle 10 final review proposers in order to develop a suitable set of milestones for the Council and community to monitor for grant awards. The Milestone Assessment guidance is available on the Council’s landing page, here,…     ",
                    "links": [
                        "https://www.notion.so/Milestone-Assessment-6c1fd5e26d7448eb815e08c8b0aa080e"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.458333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/firnprotocol",
                    "index": "3",
                    "likes": "3",
                    "time": "25/02/2023-17:25:05",
                    "content": "i’ve added a bit of detail to the milestones section. was there something more specific you wanted me to change? thanks for looking this over. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.166666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/FractalVisions",
                    "index": "4",
                    "likes": "2",
                    "time": "25/02/2023-22:47:03",
                    "content": "I see your edits and it helps explain how many users it will reach much better. Thank you. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "5",
                    "likes": "7",
                    "time": "25/02/2023-23:11:20",
                    "content": "Hey @firnprotocol used your platform couple of time and really excited to see your proposal on this forum. I will leave the judgement of your proposal to the committee but I hope that your protocol could get some support from the collective as most users are not even aware of Firn, a privacy centered protocol. Might be a good idea to reach out to someone from OP team to be host on OP Radio or give a demo on Demo Day.  @lavande / @jrocki.eth might be able to help you with OP radio, I guess. For Demo day, reach out to @ vonnie610 on OP Discord. Keep an eye on any question or doubt that the collective might have related to your proposal, good luck. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.160714285714286
                },
                {
                    "author_link": "https://gov.optimism.io/u/Luckymonkey",
                    "index": "6",
                    "likes": "3",
                    "time": "25/02/2023-23:59:42",
                    "content": "Hope for more transparency and more details of this project! #BuildOnOP #OPTIMISTIC ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.8125
                },
                {
                    "author_link": "https://gov.optimism.io/u/jrocki.eth",
                    "index": "7",
                    "likes": "7",
                    "time": "26/02/2023-00:34:16",
                    "content": "For demo day check out: https://www.notion.so/oplabs/Optimism-Demo-Day-bf6acd03bde942dbbfc43eae91768764 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/WEALTHFILES",
                    "index": "8",
                    "likes": "2",
                    "time": "02/03/2023-14:41:20",
                    "content": "Well-done . Good to see transparency as the state of the art here! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.375
                },
                {
                    "author_link": "https://gov.optimism.io/u/MattL",
                    "index": "9",
                    "likes": "1",
                    "time": "16/03/2023-03:26:03",
                    "content": "Hello and thank you for your proposal! Throughout the application process, this forum thread will be one of the official means of communication. Please be sure to monitor it for updates over the course of the review period. At this stage, applications are mainly being reviewed for completeness, and nothing at this stage should be construed as support or opposition by any members of the Grants Council. Regarding completeness and compliance, here are the following notes:  The below is in violation of the no-sale rule, as it handles a direct expense of the protocol and could be reasonably understood that grant recipients would sell these funds upon receiving them for work completed. Please adjust the grant distribution plan to work within the no-sale rule.      firnprotocol:  We would like to reserve the remaining 50% to community members who go above and beyond to contributing to the project, especially in the areas of art/design and marketing. For example, I would consider it deserving of a reward if a user were to create a full new suite of art / brand identity for Firn, and (say) help to integrate this art into a new front-end.    The below is not an adequate critical milestone, as it is not specific to a target milestone. Please adjust this to target critical milestones that will show significant progress toward achieving the goals of the proposal. You’re free to use some of the benchmark milestones or adjust them to make them critical ones.      firnprotocol:  Critical milestones could include a clear announcement of the receipt of the grant to the community, clear articulation of reward conditions, the commencement of disbursement to existing users, and advertising efforts to make prospective users aware of the grant.   Outside of completeness/compliance, just had some other notes:  Would there be any possibilities to add support for additional projects with privacy support, similar to Aztec Connect (which is soon going to be closing down)  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.666763791763792
                },
                {
                    "author_link": "https://gov.optimism.io/u/MattL",
                    "index": "10",
                    "likes": "1",
                    "time": "16/03/2023-04:38:13",
                    "content": "Just a few more notes: Throughout the entire proposal it’s important to be very clear about the responses to each question, I would avoid the use of “I think” or “Maybe” or other non-clear terms that leave a bit of ambiguity for the proposal.     firnprotocol:  We roughly plan to expend 50% of the grant on deposit incentives (i.e., rewarding users who deposit ETH into Firn on Optimism, and keep it there). This is the bare crucial metric to get Firn more established, and also directly translates to Optimism use. We would like to reserve the remaining 50% to community members who go above and beyond to contributing to the project, especially in the areas of art/design and marketing. For example, I would consider it deserving of a reward if a user were to create a full new suite of art / brand identity for Firn, and (say) help to integrate this art into a new front-end.   It’d be really helpful to be more clear on what the requirements would be to receive the incentives would be, because as of right now it is not clear how this deposit incentive would be allocated.     firnprotocol:  Please provide benchmark milestones for this project. These milestones should guide the Optimism community on the progress of your project throughout your work on the project. Do not use distribution of the grant itself as a milestone: TVL is, and will likely remain, the primary milestone for Firn. Specifically, we are targeting a minimum of 1,000 ETH TVL as our goal, say, attained by 6/1/23; the more beyond this, the better. Secondary milestones are things like number of unique users (ideally, ≥ 1,000), and transactions per week (ideally, ≥ 100). Please define critical milestones for this project. Critical milestones are meant to show good-faith efforts to accomplish the project. Non-completion of these milestones could lead to revocation of remaining grant rewards. Do not use distribution of the grant itself as a milestone: Critical milestones could include a clear announcement of the receipt of the grant to the community, clear articulation of reward conditions, commencement of disbursement to existing users, and advertising efforts to make prospective users aware of the grant.   We recommend as much specificity as possible, as the community will judge the effectiveness of the grant plan on its ability to deliver on these.  Also - It’s important to include a few stepped up milestones so there the community can gauge continued growth over time. Possible improvements include - “Firn TVL will exceed x during timeframe x” or “Firn will be used by x new addresses by x date, none of which will be team wallets or smart contracts controlled by the core team”     firnprotocol:  What is the size of the grant request? (250k OP max): 150,000 OP. How do you justify the size of the grant?: This is an appropriate size to incentivize significant (10x–100x) growth, targeting a minimum of 1,000 ETH TVL.   Just a bit of a note here, this OP request seems very large for the number of users and TVL currently on Firn. How will Firn ensure that users plan to use the protocol for long periods of time (providing value to the protocol) and aren’t simply using it to farm OP rewards? Keep in mind, I am just one member of the grants council and my comments do not necessarily reflect the opinions of the other council members. Please ping me, another council member, or @GrantsOps for a speedier response to updates. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.910352147852148
                },
                {
                    "author_link": "https://gov.optimism.io/u/firnprotocol",
                    "index": "11",
                    "likes": "1",
                    "time": "17/03/2023-12:56:07",
                    "content": "hi @MattL. major thanks for your thorough and detailed feedback. i have gone ahead and edited the initial submission directly, following your input. In addition, below, to make things clearer, i have also listed the changes one-by-one, together with explanations and responses:     MattL:   The below is in violation of the no-sale rule, as it handles a direct expense of the protocol and could be reasonably understood that grant recipients would sell these funds upon receiving them for work completed. Please adjust the grant distribution plan to work within the no-sale rule.    I have completely eliminated the portion proposing funding for community contributors. I have replaced this with an incentive for privacy-plugging partnerships with other protocols.     MattL:  Would there be any possibilities to add support for additional projects with privacy support, similar to Aztec Connect (which is soon going to be closing down)   indeed, this is absolutely something we can do, and is a critical part of our roadmap. actually, our partnership mechanism is much more technically favorable than Aztec’s, in that ours only requires front-end changes on the part of the partnering project, and doesn’t require that we or they deploy any new contracts. see also the below excerpt from the now-edited proposal:     firnprotocol:  We plan to reserve the remaining 50% for partnerships with other protocols. Indeed, Firn offers pluggable privacy, in the sense that other protocols—via a minor, front-end-only integration with our MetaMask Snap (no new contracts need to be written or deployed, unlike the case of Aztec)—can plug Firn’s privacy into their project.       MattL:   The below is not an adequate critical milestone, as it is not specific to a target milestone. Please adjust this to target critical milestones that will show significant progress toward achieving the goals of the proposal. You’re free to use some of the benchmark milestones or adjust them to make them critical ones.    i have gone ahead and added quantitative critical milestones; see below:     firnprotocol:  a more-than-doubling of our TVL on Optimism, to a total of ≥ 300 ETH, and an expansion of our userbase, to get ≥ 200 unique (non-team) users, all by 8/8/23. The attainment of at least 1 high-quality partnership should also be viewed as a critical milestone.   let me know how the above looks.     MattL:  Throughout the entire proposal it’s important to be very clear about the responses to each question, I would avoid the use of “I think” or “Maybe” or other non-clear terms that leave a bit of ambiguity for the proposal.   i have edited the grant disbursal paragraph to be much more clear. i have also added a further paragraph, describing the mechanism of our disbursal (i.e., how we will calculate the rewards each given user is entitled to. see the paragraph beginning:     firnprotocol:  We will use this space to moreover explain our disbursal procedure.   let me know how the updated version looks!     MattL:  Just a bit of a note here, this OP request seems very large for the number of users and TVL currently on Firn. How will Firn ensure that users plan to use the protocol for long periods of time (providing value to the protocol) and aren’t simply using it to farm OP rewards?   there are two separate matters here: the size of the grant, and the disbursal procedure (designed to guarantee real value-adding users). the second question is addressed above. as for the first, I see your point—in addition to adding a lot of clarity on the disbursal procedure, I have also reduced the requested grant size to 100,000 OP. thanks again for your detailed feedback! happy to make multiple passes on this as you see fit. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.546163484333127
                },
                {
                    "author_link": "https://gov.optimism.io/u/MattL",
                    "index": "12",
                    "likes": "1",
                    "time": "20/03/2023-03:59:20",
                    "content": "Great, thanks for the updates. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                }
            ]
        }
    ],
    "group_index": "544"
}