{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/discussion-approved-proposal-appeal-process/712",
            "title": "(Discussion) Approved Proposal Appeal Process ",
            "index": 712,
            "category": [],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/Graciouseats",
                    "index": "1",
                    "likes": "6",
                    "time": "20/05/2022-16:40:25",
                    "content": "The Appeal Process could be leveraged for any Proposal Type. For now, the Appeals Process is based within the Forum. As OP grows and becomes the most decentralized and robust L2 chain (I’m OPtimistic), the Forums are going to get busy. I suggest:   Incorporating the OP network overtime. Especially as the OP Society develops and Proposals hit triple/quadruple digits, sifting through Forum text may not be the best solution in deciding if an appeal is necessary.   Include language in each approved Proposal stating if there is not enough votes or delegates for an appeal after X amount of time, the proposal will be implemented.   You could leverage the claiming website. Though, I’m not sure what that will look like.   Perhaps once a Proposal is approved and the appeal timeline has been met it can be minted as an NFT on Etherscan. Or something along these lines.   The Forums may not be able to handle the project as it scales up. We will soon see how the Citizens House plays a part (launching shortly). I am a firm believer in “t he idea that a decentralized ecosystem could reliably provide for basic human needs at scale may seem idealistic today, but it will seem commonplace tomorrow ” – OP Vision Thanks! ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.791666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "2",
                    "likes": "0",
                    "time": "13/09/2022-16:54:34",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "635"
}