{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/another-world-growth-experiments-cycle-11/5538",
            "title": "Another World - Growth Experiments - Cycle 11 ",
            "index": 5538,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Grants Council"
            ],
            "tags": [
                "growth",
                "cycle-11"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/jackie",
                    "index": "1",
                    "likes": "2",
                    "time": "08/03/2023-18:57:00",
                    "content": "Another World - Growth Experiments - Cycle 11 Basic Details Project name: Another World  awlogobanner41500×859 64.2 KB  Author name and forum name (please provide a reliable point of contact for the project): jackie.eth, jackie@anotherworld.gg, @jackie L2 recipient address: 0x93501FdDb36EA67fFa2C361B3Da035c142299D4f Which Voting Cycle are you applying for?: 11, Growth Experiments I confirm that I have read the landing pages for the Builders  and Growth Experiments  Sub-Committees and that I have determined my proposal is best suited to be reviewed by the Growth Experiments Sub-Committee: Yes Project Details What are you going to build?: Another World is a cross-NFT-community open-world game with playable L1/L2 (Optimism) NFTs. In Another World, you can be an NFT avatar to reconnect with web3 friends, hunt treasures, and experiment with how to live inside a digital world. We are currently having small-scale play tests with NFT holders from BAYC, Azuki, CloneX, and OnChainMonkey. Playable demo at https://anotherworld.gg  aw-screenshots028deck41920×1080 177 KB   aw-screenshots015azk51920×1080 150 KB   aw-screenshots002b1ape2clones1920×1080 86.1 KB  Why is what you are going to build going to succeed?: Building a metaverse is not easy. We focus on building a game-like place to bring NFT communities together (like a digital version of NFT NYC 2022) and providing extra in-game utilities to NFT holders. There are community zones equipped with enhanced visual experiences and interactive activities (like PVE/PVP mini-games) to engage their holders and their web2 friends (who do not have wallets but can still play the game to experience the NFT culture). We have a special in-game token gating mechanism so that we can provide extra utilities to token holders (and their +1s). How many users does your project have currently? Please include how you arrived at this estimate: We have around 1k users who accessed our game based on our in-game questionnaire (about 1k answers) on the main menu. Our game is playable from the web browser (limited preview) and the full game client can be downloaded from HyperPlay and from our website.  aw1sc001921×1080 131 KB  How will receiving a grant enable you to further the mission of maximizing the number of users interacting with Optimism? Please include a step-by-step flow of how you imagine this grant can lead to a greater number of user interactions with Optimism: OP’s Growth Experiments grant will enable us to launch a series of in-game NFT campaigns to establish retention and encourage existing users to bring peer holders and friends. These NFTs can ONLY be minted and airdropped to the player during the gameplay. Players need to get verified at our in-game tokenproof station (to reduce Sybil attacks).  aw-screenshots033tokenproof21920×1080 132 KB  Our in-game item airdrop campaigns include:   Treasure hunts (for 1-2k users): Players will collect in-game on-chain items to exchange them for another high-value item. A leaderboard will be published for top collectors. Our first campaign will be OP Hoodie Fragments (ERC1155 on Optimism). Players will be able to acquire these fragments in different parts of the open world. Some can only be accessed through gated areas (i.e., OP>=1). Treasure hunt activities will occur during the weekends.   ophoodie00a1312×960 130 KB    Airdrop Packages in the PVP zone (for 1-2k users): On top of the Aztec temple, there will be hourly airdrop packages (rare items with game abilities) for the PVP survivors. Players can team up with their peer holders (because the same collection cannot hurt each other). The more friends you have, the more likely you and your team can survive till the packages dropped. We estimate this will be a growth driver for more players who will bring in their friends.   image - 2023-01-01T003514.3671920×1079 162 KB   airdroppack001920×1116 165 KB    Loots in the PVP zone (for 4-6k users): In the PVP zone, NFT items will appear as loots after a player is down. This encourages more players to enter the PVP zone for drops from taking down other players.   awloot001920×1116 209 KB  Tell us about the users you plan to target with this grant. Include any defining characteristics that will help you identify and target them.: We are targeting NFT holders and their friends who will jump into a game to help them fight for rare items or help solve puzzles for treasures. Bluechip NFT holders (e.g., BAYC, Azuki, and CloneX…) will receive NFTs with traits that will have more OP token claimable amounts as their incentives to jump into this game. How would these users interact with Optimism? For how long?: They will receive OP in-game items and come back for more (we hope). Provide us with links to any of the following for the project:  Demo: https://anotherworld.gg/ (download the standalone game client or try a web-based preview) Website: https://anotherworld.gg/  Twitter: https://twitter.com/anotherworlddao  Discord/Discourse/Community: Discord  Github: Another World · GitHub  Technical/Economic Documentation: (in progress) in-game OP NFT airdrop video - Another World L2 NFT in-game airdrop + inventory clip (no edits) - YouTube  PVP video - Another World 2022 Year-End Party - YouTube   Do you have any metrics on the project currently? (TVL, transactions, volume, unique addresses, etc. Optimism metrics preferred; please link to public sources such as Dune Analytics, etc.): N/A (in progress). We are still at an early stage where we are finishing up community zones and game zones. Will share more when we are launching the in-game NFT campaign. Who are your competitors, and are they on Optimism?: Competitors are 3D game-like metaverse with communities such as Otherside, Sandbox, Decentraland, OnCyber, Spatial. They are not on Optimism. Please link to code audits (if any): N/A (we are working on them) Team Who are your founders?: jackie.eth, https://twitter.com/JackieLeeETH skvll.eth, https://twitter.com/skullapes What makes your team well-suited to carry out the project described in this proposal? jackie.eth (web3 metaverse integration) discord: jackie.eth#9152, working on Unreal Engine, server backend, and web3 integration. Jackie graduated from MIT Media Lab and has been building AR/VR and web3 apps using WebXR and Unreal Engine (as Epic Games’ MegaGrants recipient). skvll.eth (14yo game dev, avatar rigging) discord: X3R0#0722, working on game mechanics, avatar rigging, and animation in Unreal Engine. skvll.eth has been building and play-testing web3 games with his teen friends (and helped them install wallets, swap tokens, set up ENS, and create liquidity pairs). Is this your first Web3 project?: We received top prizes and grants by building 3D metaverse games using Unreal Engine and WebXR. At ETH Global Hackathon, they won top prizes from Apecoin, ENS, and Optimism. At Metaverse Hackathon hosted by Encode, they won top prizes from Optimism and top3 project overall. We were interviewed on OP Radio. If not, what else have you built? (Share links, Github repository, or any other useful information.): jackie.eth built VR science and history experiences at https://www.sciencevr.com/ Grant Request What is the size of the grant request? 100k OP How do you justify the size of the grant? This grant will be used for in-game NFT campaigns for acquiring 10k players. This is a growth experiment for providing metaverse-related utilities to NFT holders and having game mechanics to encourage existing players to bring their web3/web2 friends using OP NFTs and tokens as in-game items and rewards. Roadmap Describe in discrete steps your plan for accomplishing your project: There are many parts involved to build a web3 metaverse. We made initial progress on several of the following parts and we have been doing bi-weekly releases to build up Another World:  Core community zones development (3D assets, gated access) - completed  Avatar development (matching traits based on holder’s NFTs, badges/accessories, custom wearables) - in-progress  Multiplayer game mechanics development (PVP, looting) - near completion  In-game NFT item integration and airdrops for growth - to be funded by this proposal  NFT Leaderboard for OP token distribution - to be funded by this proposal   How will the OP tokens be distributed? (please include % allocated to different initiatives such as user rewards/marketing/liquidity mining. Please also include a justification as to why each of these initiatives align with the problem statement this proposal is solving. Distribution should not include the sale of any tokens by the grantee or the use of tokens for compensation, protocol expenses, etc. See the no sale rule here ): 100% OP tokens will be distributed based on a leaderboard of Another World NFTs calculated according to OP NFT balances and traits. Some rare OP NFTs with specific traits (e.g., a jade or crystal key) will grant extra OP token claiming quota. OP token distribution is based on players’ efforts (and luck) to acquire these OP NFTs in tournaments like PVP fights and in exploring the open world (to solve puzzles and hunt treasures). Players will claim OP tokens from a separate web page. OP tokens will not directly be airdropped to the players in the game. Over what period of time will the tokens be distributed for each initiative?: We plan to distribute OP tokens in the following schedule.  April - no distribution May - 10% (10k OP) June - 20% (20k OP) July - 30% (30k OP) Aug - 40% (40k OP)  Please provide benchmark milestones for this project. These milestones should guide the Optimism community on the progress of your project throughout your work on the project. Do not use distribution of the grant itself as a milestone: The goal of this project is to bring in more players for web3 activities in a game-like metaverse. Here are key features and milestones:  Attract 3k players to visit community zones by the end of April.  Have an OP claim webpage outside the game to allow leaderboard users to claim their OP rewards by mid-May.  Have a Dune page to show in-game analytics by mid-May.  Have 5k players access in-game gates based on token balance and L1/L2 NFTs by the end of May.  Launch treasure hunt campaigns in the open world where 5k players will find in-game item NFTs to be ranked on a leaderboard by the end of June.  Have PVP game zones that provide NFT items such as bounties, airdrop packages, and loots that contain special abilities and be ranked on a leaderboard by the end of June.   Please define critical milestones for this project. Critical milestones are meant to show good-faith efforts to accomplish the project. Non-completion of these milestones could lead to revocation of remaining grant rewards. Do not use distribution of the grant itself as a milestone: We aim to acquire 10k players based on 100k OP funding. Our critical milestones include:  Deploy, publish, and audit in-game NFT item and OP token claiming contracts by the end of April.  Launch treasure hunt campaign by mid May.  Attract 6k players to interact with in-game NFT contracts by the end of July.  Attract 10k players to interact with in-game NFT contracts by the end of Aug.   If the OP tokens are for direct distribution to users, why will incentivized users and liquidity on Optimism remain after incentives dry up?: OP tokens are distributed based on the acquisition of Another World’s NFTs during treasure hunts and PVP fights. These NFTs provide special game abilities and unique digital fashion that may be still in demand. We plan on recharging game abilities with OP tokens to route OP tokens back to the incentive pool. We may have our own ERC-20 tokens to keep the incentive program running. Please provide any additional information that will facilitate accountability (smart contracts addresses relevant to the proposal, relevant organizational wallet addresses, etc.): anotherworlddao.eth is our project ENS. Optimism Relationship Does your project solve a problem for the Optimism ecosystem? If so how? Another World expands OP ecosystem to a potential web3 gaming and metaverse usage. This proposal answers one of the Growth Experiments’ RFPs for engaging multiple NFT communities (starting with BAYC, Azuki, CloneX, and OnChainMonkey). Why will this solution be a source of growth for the Optimism ecosystem?: Another World may draw more NFT holders and web2 gamers to the OP ecosystem based on our social and gaming approach. Is your project Optimism Native?: Yes. All in-game NFT airdrops are on Optimism. Certain game elements are arranged dynamically based on L1 and L2 states. For web3 players (who verified their ETH address ownership), they can unlock gates in the game. These gates access (ready-only) onchain game states. For example, players need to own at least 1 $OP in their wallet to unlock the gate. While the gate is open, web2 players can tailgate in so that web2 and web3 players can have fun exploring together. Another example is that if a player owns a gate key OP NFT, this gate can be unlocked only by him/her. This enables players to own their private spaces in the game. In short, the game has ready-only access to ETH/OP chains for arranging game elements. For read/write game states (this is also related to OP token distribution), web3 players are eligible for picking up rare game items which will be airdropped immediately through Optimism Mainnet in this example. Some of these OP NFTs are hard to get because they are in PVP zones and players need to join forces for participating in tournaments to acquire rare items (like the movie Ready Player One). You can see our current progress here. Confirmations I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: Yes I understand that I will be expected to following the public grant reporting requirements outlined here: Yes ",
                    "links": [
                        "https://optimistic.etherscan.io/address/0x93501fddb36ea67ffa2c361b3da035c142299d4f",
                        "https://foul-porch-0eb.notion.site/Builders-Sub-Committee-02ba9da5b4534fbf955e6e4c8fcf1aa3",
                        "https://foul-porch-0eb.notion.site/Growth-Experiments-Sub-Committee-270d2f75ff0f410a869b2ba6a8324006",
                        "https://anotherworld.gg",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/2/25797ff159c4c9ad1081fa81e00fafc5f3c0d911.jpeg",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/6/6bb0132303a476469358f0b9ecc9149f97cc49cb.jpeg",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/d/dacf7b43719f208ece348e4ce9a91c4fe4d389b6.jpeg",
                        "https://hyperplay.xyz",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/8/8b864d6466367d39c065162991944508b0c4dc00.jpeg",
                        "https://tokenproof.xyz/",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/8/82787275374f107e1eae0a99a0850801a019ab4f.jpeg",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/0/07f20bd2e5c806102d1fc02920a9474001f20ca6.jpeg",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/e/ed50a1eca01f2532c775af71a205694634eb1919.jpeg",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/0/0cea5c40570952d700449be6b8e00d51611c6ede.jpeg",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/1/1977d5f9b942f0bb8e2c65a6a738663d17c2cb2a.jpeg",
                        "https://anotherworld.gg/",
                        "https://anotherworld.gg/",
                        "https://twitter.com/anotherworlddao",
                        "https://discord.gg/UFXcMTvN",
                        "https://github.com/AnotherWorldDAO",
                        "https://youtu.be/xDErhHv4PC0",
                        "https://youtu.be/3dBRfneDtUM",
                        "https://twitter.com/JackieLeeETH",
                        "https://twitter.com/skullapes",
                        "https://twitter.com/JackieLeeETH",
                        "https://twitter.com/skullapes",
                        "https://twitter.com/JackieLeeETH/status/1589661685698396160?s=20&t=0D5BMku9J4Fjuvf1cLnxcg",
                        "https://twitter.com/halina_eth/status/1589744097166004224?s=20&t=0D5BMku9J4Fjuvf1cLnxcg",
                        "https://ethglobal.com/showcase/another-world-4oy5f",
                        "https://youtu.be/Kwzf778YxtM",
                        "https://twitter.com/justsayuluvjo/status/1620816648897966081?s=20&t=41ydzIy9xk1CtXepL-iezg",
                        "https://youtu.be/e1lLQywmIHo",
                        "https://www.sciencevr.com/",
                        "https://github.com/AnotherWorldDAO/MultiplayerDemo",
                        "https://foul-porch-0eb.notion.site/Proposer-AMA-February-3-2023-279db2774af249a8b07797d3cb9b5ef3",
                        "https://twitter.com/JackieLeeETH/status/1604363250446979073?s=20",
                        "https://www.youtube.com/watch?v=xDErhHv4PC0",
                        "https://twitter.com/anotherworlddao/status/1636958412763463683?s=20",
                        "https://gov.optimism.io/t/suggested-public-reporting-requirements-for-grantees/4176"
                    ],
                    "GPT-summary": "The post is a proposal for a web3 metaverse game called Another World, which aims to bring NFT communities together and provide in-game utilities to NFT holders. The proposal requests a grant of 100k OP to fund in-game NFT campaigns to acquire 10k players. The post includes details on the project, the team, the grant request, and the roadmap. The post also provides links to the demo, website, and social media accounts of the project.",
                    "GPT-proposal-categories": [
                        "Community and engagement",
                        "Grants, Funding and resource allocation",
                        "Smart contract updates",
                        "Interoperability and Scaleability",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.195708297749114
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackie",
                    "index": "2",
                    "likes": "1",
                    "time": "09/03/2023-14:46:43",
                    "content": "Gm OP friends! Here is a footage for in-game OP NFT integration in Another World.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/FractalVisions",
                    "index": "3",
                    "likes": "1",
                    "time": "09/03/2023-15:06:19",
                    "content": "    jackie:  Please define critical milestones for this project. Critical milestones are meant to show good-faith efforts to accomplish the project. Non-completion of these milestones could lead to revocation of remaining grant rewards.   I am not seeing any milestones related to this grant proposal. Please follow the guidelines template to complete the project proposal. Be aware that the one year token lock prevents you from having access to the grant until the time period has passed. If you wish to give rewards to users over the course of the year you may want to apply for a growth experiments grant instead.     Milestone Assessment Grants       The Council has added guidance on what it is looking for in articulating milestones for assessing the success of a project. The guidance can be used by Cycle 11 applicants to provide more specificity on benchmarks and critical milestones. The guidance will also be provided to Cycle 10 final review proposers in order to develop a suitable set of milestones for the Council and community to monitor for grant awards. The Milestone Assessment guidance is available on the Council’s landing page, here,…     ",
                    "links": [
                        "https://www.notion.so/Milestone-Assessment-6c1fd5e26d7448eb815e08c8b0aa080e"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.954545454545455
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackie",
                    "index": "4",
                    "likes": "1",
                    "time": "09/03/2023-18:17:23",
                    "content": "Thanks for your inputs. I updated this proposal and added the milestones. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Bona001",
                    "index": "5",
                    "likes": "1",
                    "time": "09/03/2023-22:58:40",
                    "content": "This is nicee. Seeing decisions like this always tell me that more  is yet to come ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackie",
                    "index": "6",
                    "likes": "1",
                    "time": "12/03/2023-18:02:47",
                    "content": "Gm! If you have an Epic Games account, you are invited to join our Alpha Tester Program to build this web3 game metaverse with us. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/kaereste",
                    "index": "7",
                    "likes": "2",
                    "time": "14/03/2023-07:01:06",
                    "content": "Hey @jackie, giving you a heads up that this will be the formal comms channel with the grant council builders subcommittee, which consists of @Gonna.eth, @jackanorak, @danelund.eth, and myself. We’ll make sure we’re around to address any questions you have in this process. We might also be asking additional questions here during the review process so please check this thread for updates on a regular basis. One thing to be mindful of is that in the Cycle 11 we require the milestones to be precisely defined into two categories - critical milestones and benchmark milestones as described in Milestone Assessment . Could you please restructure your milestones description to follow this structure? Moreover, could you please elaborate more on the planned grant distribution and justification of grant size? You’ve noted that the grant will be used for bounties in order to acquire 5k players but could you share some more details of what exactly do you have in mind so that we can score it fairly during the grant assessment? Furthermore, as the main goal of this grant program is to maximise the number of builders, please focus on this aspect of your value proposition in the proposal as we will need to assess you proposal from this point of view. Btw, had you considered growth experiments program for you proposal? ",
                    "links": [
                        "https://gov.optimism.io/u/jackanorak",
                        "https://gov.optimism.io/u/danelund.eth",
                        "https://gov.optimism.io/t/milestone-assessment/5314"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.758333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackie",
                    "index": "8",
                    "likes": "0",
                    "time": "14/03/2023-15:55:23",
                    "content": "Thank you @kaereste for the detail feedback. As I look more closely for the grant assessment part, it does seem to me that Growth Experiments’ rubric scores and RFPs (NFT-based communities) is a better fit for my project. I will restructure it as a Growth Experiments grant. Thanks a lot!! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 7.140625
                },
                {
                    "author_link": "https://gov.optimism.io/u/FractalVisions",
                    "index": "9",
                    "likes": "1",
                    "time": "14/03/2023-16:12:52",
                    "content": "Is this a web3 app ? This game is not on chain correct? Only assets in the game are accessible from some sort of wearable NFT ? Can you please explain the technical details about the smart contracts and coding that was used to develop this game? Are the contracts fully audited? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.563775510204081
                },
                {
                    "author_link": "https://gov.optimism.io/u/FractalVisions",
                    "index": "10",
                    "likes": "1",
                    "time": "14/03/2023-16:16:05",
                    "content": "Also, what type of mechanism is in place to prevent Sybil attacks from happening? I know in the gaming world when it comes to rewards or bounties there is a massive issue with people who are attempting to find ways to work their way around the system and receive multiple benefits from the same project that is distributing tokens or a play to earn type of system. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackie",
                    "index": "11",
                    "likes": "1",
                    "time": "14/03/2023-18:23:56",
                    "content": "Gm! Thanks for the questions. The game mechanics integrate a number of web3 ingredients. Players do not need a wallet to play. If a player is verified using our in-game tokenproof station, s/he is now a web3 player who is eligible for in-game OP NFT airdrops (from a server wallet, currently capped at 2 mints per hour). The player’s username is now his/her primary ENS. There are also a number of in-game interactions related to players’ token balance. There are token gates where only players with enough balance unlock the gate (for themselves and others).  opgate000111921×1080 380 KB  Our current smart contract is ERC1155 standard from Openzepplin deployed on Optimism. Not audited yet but we are working on it. For Sybil attacks, our web3 players need to be verified from tokenproof. Current in-game airdrops are capped at 2 per wallet per hour (we may adjust this). We are considering only allowing players with primary ENS to receive airdrops. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.313186813186813
                },
                {
                    "author_link": "https://gov.optimism.io/u/Michael",
                    "index": "12",
                    "likes": "2",
                    "time": "18/03/2023-18:12:48",
                    "content": "Thank you for submitting this grant application! Throughout the application process, this forum thread will be one of the official means of communication. Please be sure to monitor it for updates over the course of the review period. At this stage, applications are mainly being reviewed for completeness, and nothing at this stage should be construed as support or opposition by any members of the Grants Council.     jackie:  Is your project Optimism Native?: Yes. All in-game NFT airdrops are on Optimism.   Could you go into a little bit more detail about how how the game interacts with Optimism? Is this an on-chain game with the state actually stored on Optimism or is it off-chain with NFT interactions on the Optimism Network? And currently what are the existing interactions with the Optimism network?     jackie:  How will the OP tokens be distributed? (please include % allocated to different initiatives such as user rewards/marketing/liquidity mining. Please also include a justification as to why each of these initiatives align with the problem statement this proposal is solving. Distribution should not include the sale of any tokens by the grantee or the use of tokens for compensation, protocol expenses, etc. See the no sale rule here ): 100% OP tokens will be distributed based on a leaderboard of Another World NFTs calculated according to NFT balances and traits. Players will claim OP tokens from a separate web page. OP tokens will not directly be airdropped to the players in game.   It would be great to see a little bit more detail on the distribution plan. I see you mention in-game drops as well as leaderboard based distribution. Also it’s worth noting that for metaverse/NFT projects we general have encouraged grants that directly lead to more community interaction such as contests or games. Directly airdropping OP rewards based on the NFT traits is probably not the strongest method for distribution. All that said, it’s great to see you building on Optimism! Hopefully some of that feedback is helpful and let me know if you have any questions. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.657196969696969
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackie",
                    "index": "13",
                    "likes": "1",
                    "time": "19/03/2023-15:52:30",
                    "content": "Hi Michael, Thanks for your questions! While we are keep working on more onchain integration with Unreal Engine, here is our rationale to integrate game states (ready-only and read/write) as well as OP token distribution: Another World is playable now for both web2 (no wallets) and web3 players. For web2 players, they are more like tourists and guests in the web3 world. Game states do not matter much to them. Currently, we do not have onchain game states for web2 players. However, if web2 players follow a web3 player, that’s where things get more interesting. This opens up a growth path to acquire both web2/3 players based on our game mechanics. For web3 players (who verified their ETH address ownership), they can unlock gates in the game. These gates are access (ready-only) onchain game states. For example, players need to own at least 1 $OP in their wallet to unlock the gate. While the gate is open, web2 players can tail gate in so that web2 and web3 players can have fun exploring together. Another example is that if a player owns a gate key OP NFT, this gate can be unlocked only by him/her. This enables players to own their private spaces in the game. In short, the game has ready-only access to ETH/OP chains for arranging game elements. For read/write game states (this is also related to OP token distribution), web3 players are eligible for picking up rare game items which will be airdropped immediately through Optimism Mainnet in this example. Some of these OP NFTs are hard to get because they are in PVP zones and players need to join force for participating tournaments to acquire rare items (like the movie Ready Player One). You can see our current progress here.  Those onchain items (OP NFTs) distribution will be formulated as a leaderboard for OP token distribution. Some rare OP NFTs with specific traits (like a jade or crystal key) will grant extra OP token claiming quota. OP token distribution is based on players’ efforts (and luck) to acquire these OP NFTs in tournament like PVP fight and in exploring the open world (to solve puzzles and hunt treasures). These OP NFTs can only be acquired in the game. Lastly, we are currently exploring using a custom chain (OP Stack/Superchain) to have a ledger of player activity records to ensure onchain item acquisition is fair and legit. We will need more help on this one so this is not in our milestones. Please let us know any thoughts and comments. I will update the proposal accordingly to add clarification. Thank you so much! ",
                    "links": [
                        "https://www.youtube.com/watch?v=xDErhHv4PC0",
                        "https://twitter.com/anotherworlddao/status/1636958412763463683?s=20"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.123148148148148
                },
                {
                    "author_link": "https://gov.optimism.io/u/FractalVisions",
                    "index": "14",
                    "likes": "1",
                    "time": "19/03/2023-16:01:17",
                    "content": "Here is a resource for building a game on OP stack if you wish for your game to be on chain. https://lattice.xyz/ ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.0
                }
            ]
        }
    ],
    "group_index": "591"
}