{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/media-proposal-gabriel-haines/3247",
            "title": "Media Proposal - Gabriel Haines ",
            "index": 3247,
            "category": [],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/gabriel",
                    "index": "1",
                    "likes": "0",
                    "time": "07/08/2022-19:50:42",
                    "content": " Project name: Optimism Content Author name and contact info (please provide a reliable point of contact for the project): Gabriel Haines I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: Yes L2 recipient address: 0xCFFE08BDf20918007f8Ab268C32f8756494fC8D8 Grant category: Media Project description (please explain how your project works): My goal for this project is to create a series of three videos explaining how to use optimism and to highlight the various ecosystem project. Example Videos: How to use the optimism chain, how to trade and earn using Velodrome, buying options Lyra, how to earn OP using AAVE Project links: I have already created a similar tutorial for synthetix - Mint, Stake and Earn using Synthetix - YouTube and also coverage of the OP airdrop Optimism Airdrop - YouTube    Additional team member info (please link): n/a Relevant usage metrics (TVL, transactions, volume, unique addresses, etc. Optimism metrics preferred; please link to public sources such as Dune Analytics, etc.): 29k followers on twitter. 8k subscribers on YouTube Competitors, peers, or similar projects (please link): n/a Is/will this project be open sourced? N/a Optimism native?: No Date of deployment/expected deployment on Optimism: n/a Ecosystem Value Proposition:  There are many crypto users who are not familiar with the Optimism ecosystem, lack the knowledge to use the chain or are unaware about the opportunities available. By creating media about this topic, we can educate users and bring awareness to the ecosystem The more people who are knowledgeable about this topic, the more people will be able to use Optimism and participate in the community.  Has your project previously applied for an OP grant? no Number of OP tokens requested: 7690 How much will your project match in co-incentives? none**:** Proposal for token distribution:  25% will be distributed upfront and then 25% with each subsequent video delivery The entire project can be completed in 6 weeks My goal is to have at least 1,000 views per video on Youtube     ",
                    "links": [
                        "https://youtu.be/20TQ7X54--g"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.680208333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/gabriel",
                    "index": "2",
                    "likes": "0",
                    "time": "07/08/2022-19:59:21",
                    "content": "  Twitter: https://twitter.com/gabrielhaines  Discord/Discourse/Community: discord.gg/5SPrmsKsNv  Please include all other relevant links below:   ",
                    "links": [
                        "https://t.co/EkN8BxIOWc"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6875
                },
                {
                    "author_link": "https://gov.optimism.io/u/Axel_T",
                    "index": "3",
                    "likes": "0",
                    "time": "09/08/2022-00:27:38",
                    "content": "Hi @gabriel I’m not passing judgement on your proposal either way, but I don’t think this is the most appropriate forum to post your proposal. If you are seeking an allocation from the Governance Fund to create Optimism based content, then you should make this post in the ‘Proposal Discussion’ forum and follow the guidelines & timelines outlined in Governance Update #3. Cheers, Axel ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "4",
                    "likes": "0",
                    "time": "13/09/2022-18:36:00",
                    "content": "If you would like to apply for a Gov Fund grant, please follow the procedures outlined in the Operating Manual and post your proposal in the Proposal Discussion channel. If you would like to connect with someone specific on the Optimism team, please reach out via Discord. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "196"
}