{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/gf-phase-1-proposal-defiedge-archived-original/4969",
            "title": "[GF: Phase 1 Proposal] DefiEdge [ARCHIVED ORIGINAL] ",
            "index": 4969,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Archive"
            ],
            "tags": [
                "season-3",
                "cycle-10"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/0xfast",
                    "index": "1",
                    "likes": "7",
                    "time": "31/01/2023-21:37:52",
                    "content": "Project name: DefiEdge Author name and contact info: 0xfast (Discord:0xfast#2306, Twitter:https://twitter.com/0xfast_) & DangerExploit (Discord:#DangerExp#3836, Twitter:https://twitter.com/0x_vd) L2 recipient address: 0xA7EEb1b719ef7b40F79D2056900ee3Ca904F28F9 Which Voting Cycle are you applying for?: Season 3 cycle 10 Grant category: Growth Experiments I understand that I will be expected to following the public grant reporting requirements outlined [here](Public Reporting Requirements for Grantees): [Yes] Which sub-committee should review your proposal? Growth Experiment Grants Project description: DefiEdge is a permissionless liquidity management solution for concentrated liquidity AMMs like UniswapV3. Liquidity providers can use it to seamlessly deploy their liquidity on UniV3 pools over multiple ranges, set limit orders, swap tokens, and much more in a single strategy. Passive investors who do not have the time and energy to rebalance liquidity into optimal ranges continuously can deploy tokens in public strategies managed by active strategy managers in exchange for a fee by looking at their historical performance.  1600×839 184 KB  Project links:    app.defiedge.io   DefiEdge Asset management protocol built on uniswap v3.      Additional team member info: https://twitter.com/0xtj1 https://twitter.com/0x_vd https://twitter.com/0xAirboom https://twitter.com/0xfast_ Relevant usage metrics: Usage statistics on Optimism since 15th January 2023:  TVL: $4.5M+ Total investors: 450+ Volume supported: $20M+ Total transactions: 1500+   1589×707 94.4 KB    DefiLlama    DefiLlama DefiLlama is a DeFi TVL aggregator. It is committed to providing accurate data without ads or sponsored content, as well as transparency.      Competitors, peers, or similar projects: https://www.tokensets.com/ https://enzyme.finance/ Is/will this project be open-sourced? Yes Optimism native?: No Date of deployment/expected deployment on Optimism: November 2022 Ecosystem Value Proposition: UniswapV3 offers a significant increase in capital efficiency, but liquidity providers often find the whole process difficult and time-consuming. At DefiEdge, we have created an alternate UI that makes LPing and trading on UniswapV3 simpler and more efficient. Passive users can deploy tokens in strategies managed efficiently by looking at their historical performance. On the other hand, strategy managers get access to all this passive liquidity and a host of features integrated into a simple UI. Liquidity mining rewards can be a good method to bootstrap liquidity, but this liquidity is predominantly passive and mercenary. We propose to generate passive broad-ranged liquidity and active trading by incentivizing the best-performing strategies over different periods, similar to how centralized exchanges like Binance often run trading competitions. This will bring fresh liquidity into the system and make the ecosystem much more vibrant, with efficient price discovery and generating dynamic trading and arbitrage opportunities. We are the only platform capable of incentivizing trading and dynamic liquidity provisioning, as we have created a decentralized and permissionless layer over concentrated liquidity DEXs.  1212×745 88.1 KB  The platform leverages the secure contracts built over UniswapV3 to make liquidity management efficient, easy, and intuitive. Users can track rebalances, fees APR and liquidity distributions at any point in time without hassle. Strategy managers get access to deep liquidity across the whole chain through our 1inch integration. They also have the ability to set limit orders through Chainlink-keepers or Guni, along with multiple ranges in the same pool (up to 20 different ranges). Bringing order books on chain Limit orders are a game changer in decentralized exchanges; they allow users to build an order book (while making fees) on the public ledger, thereby bringing order books on-chain. This will create the ecosystem needed to build an active trader community that is transacting over the blockchain in real time. We will use the OP rewards to bootstrap this trading activity and introduce a whole new method of market making. Strategies that generate the most fees will be awarded, as they have been the most active market makers. We have already created a leaderboard to facilitate this gamification. We have also created contracts where users can easily migrate their existing active liquidity from UniswapV3 to be managed through DefiEdge. The idea is to equip liquidity providers with our enhanced tools for providing concentrated liquidity. By integrating with a bridge like Multichain, we plan to extend this feature to allow users to bridge UniV3 liquidity from different chains as well. Eventually, users can migrate liquidity on a wBTC-wETH pool on the Mainnet to a UniswapV3 pool on Optimism.  1025×783 79.7 KB  Has your project previously applied for an OP grant? No Previous Grant Proposal: None Number of OP tokens requested: 185,000 Did the project apply for or receive OP tokens through the Foundation Partner Fund?: No How much will your project match in co-incentives? We do not currently have a token for DefiEdge. When we do launch the token, we will initiate liquidity mining rewards to support liquidity and grow the ecosystem. How will the OP tokens be distributed? We have created the following distribution guidelines:   25% of tokens will be distributed on blue-chip and legacy pools on UniswapV3, encouraging new user participation and introducing fresh liquidity.   25% tokens will be distributed to Optimism native token pools like KROM/wETH, THALES/wETH, rETH/wETH, etc. (subject to change, after guidance from governance) to incentivize strategies on DefiEdge to manage their pool on UniswapV3 natively. A part of the rewards will also be used to encourage new token pools to launch on UniV3.   50% tokens will be distributed through trading competitions to increase volume and make Optimism the venue of price discovery for these tokens as liquidity providers & traders use DefiEdge to create new strategies, rebalance, deposit, position transfers, and place buy or sell orders on their strategy.   Over what period of time will the tokens be distributed for each initiative? Three to six months. Please list the milestones/KPIs you expect to achieve for each initiative, considering how each relates to incentivizing sustainable usage and liquidity on Optimism. Please keep in mind that progress towards these milestones/KPIs should be trackable. Any two of the following milestone will be fulfilled:  Total TVL in DefiEdge strategy => 12M. Currently 4.5M TVL on Optimism. Total Volume on => 100M. Currently 20M volume on Optimism. Total number of investors => 1000+. Currently 450 investors on Optimism.  Why will incentivized users and liquidity on Optimism remain after incentives dry up? Many liquidity providers thronged to our platform to earn liquidity mining rewards when we were chosen by Uniswap governance to distribute OP tokens on select pools on the Optimism chain. Yet users chose to manage liquidity in the same pools through our platform, knowing very well that this liquidity will not receive any rewards.  1135×619 73.4 KB  UniswapV3 is an organic source of generating passive revenue. It is the primary source of real returns and active fee generation. Liquidity providers can choose to earn a low-risk passive yield by depositing liquidity in a wide range. DefiEdge will make this process simpler and easier to track because of our integrated webhooks. They can also choose to participate in strategies launched by active strategy managers that amplify their yields in exchange for a performance fee determined by a free and open market. Many liquidity providers will choose to stick around and use the platform purely because of the broad range of yield opportunities that UniswapV3 presents. Still, it is inaccessible due to the cumbersome and restrictive nature of LPing as it exists today. This makes the liquidity on our platform sticky and turbocharges liquidity provisioning in ways not yet imagined. ",
                    "links": [
                        "https://twitter.com/0x_vd",
                        "https://gov.optimism.io/t/suggested-public-reporting-requirements-for-grantees/4176",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/f/f97de65e3fe16b8ec690c1c02daa93504f5a4040.png",
                        "https://app.defiedge.io/",
                        "https://app.defiedge.io/",
                        "https://twitter.com/0xtj1",
                        "https://twitter.com/0x_vd",
                        "https://twitter.com/0xAirboom",
                        "https://twitter.com/0xfast_",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/0/06e37906068a9a5522595b44c19609419a9d0b77.png",
                        "https://defillama.com/protocol/defiedge",
                        "https://defillama.com/protocol/defiedge",
                        "https://www.tokensets.com/",
                        "https://enzyme.finance/",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/7/72d06825bd21743d44c17a84917c849c243e9bcb.png",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/8/8275f9ae5c42c409470db7995d12adb99d192f23.png",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/4/4392f28b2a3e801161c5859f51c2f0effa49e9de.png",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-defiedge/4985/2"
                    ],
                    "GPT-summary": "The post is a proposal for a permissionless liquidity management solution for concentrated liquidity AMMs like UniswapV3. The proposal explains how the platform works, its features, and how it will incentivize trading and dynamic liquidity provisioning. The post also includes usage metrics, team member info, and distribution guidelines for the tokens. A 3rd party gives entirely positive feedback on the proposal, while another 3rd party extends to the proposal and asks questions about it. The author is explaining the proposal and advertising it.",
                    "GPT-proposal-categories": [
                        "Token economics",
                        "Interoperability and Scalability",
                        "Smart contract updates",
                        "Grants, Funding and resource allocation",
                        "Community and engagement"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.395176686609271
                },
                {
                    "author_link": "https://gov.optimism.io/u/Cuaphan",
                    "index": "2",
                    "likes": "1",
                    "time": "01/02/2023-06:24:18",
                    "content": "This is amazing project on optimism ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "3",
                    "likes": "0",
                    "time": "01/02/2023-17:37:24",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "4",
                    "likes": "0",
                    "time": "01/02/2023-17:40:37",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "5",
                    "likes": "0",
                    "time": "01/02/2023-17:45:02",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "467"
}