{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/draft-gf-phase-1-proposal-clipper/5019",
            "title": "[DRAFT][GF: Phase 1 Proposal] Clipper ",
            "index": 5019,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Grants Council"
            ],
            "tags": [
                "cycle-10",
                "not-passed"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/GrantsOps",
                    "index": "1",
                    "likes": "3",
                    "time": "01/02/2023-23:00:45",
                    "content": "Project name: Clipper Author name and contact info (please provide a reliable point of contact for the project): Ariana Fariab. Email: ariana@shipyardsoftware.org, TG: @arianafariab I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: Yes I understand that I will be expected to following the public grant reporting requirements outlined here: Yes L2 recipient address: oeth:0x1Dd174bF2e090d0F1b1360Ac8905780429B2642B Which Voting Cycle are you applying for?: Cycle 10: February 1, 2023 Which sub-committee should review your proposal? (Builders Grants, Growth Experiment Grants): Growth Experiment Grants Project description (please explain how your project works): Clipper is a specialized DEX built for retail traders. It was specifically designed to give traders the lowest per-transaction costs (including fees, slippage, and gas) on trades under $50k.The vast majority of DEXs are structured in a way that prioritizes high dollar trading volume above all else. In practice, this model generates profit-scalping opportunities for bots and arbitrageurs, often to the detriment of retail traders. These exchanges were built to serve everyone, but their emphasis on volume makes it so that their benefits only actually accrue to whales, hedge funds, and market makers. Clipper is the antithesis of this approach.Clipper’s design is contrary to that of most DEXs in several ways. The most significant is that Clipper utilizes a unique AMM mechanism called the Formula Market Maker (FMM) (What is a Formula Market Maker (FMM)?), rather than the CPMM seen in most DEXs today. Clipper also employs a series of design trade-offs that sacrifice price competitiveness on large trades for better prices on smaller trades. These differences in design make it so that Clipper is able to provide users with the best possible prices on small trades and superior LP yields without any impermanent loss. Website: https://clipper.exchange/ Twitter: https://twitter.com/Clipper_DEX Discord/Discourse/Community: Clipper Other relevant links (including any demos): Additional team member info (please link): Mark Lurie (Co-founder, CEO): 2 VC-backed mktplace exits, investor at Bessemer, FJ Labs, HBS, Harvard AB (Economics) ‘07. https://www.linkedin.com/in/mlurie, TG: @marklurie Abe Othman, PhD (Co-founder, CTO): AngelList Head of Quant Fund, 2 VC-backed exits, Dissertation on Automated Market Making, CMU CS PhD, Harvard AB (Applied Math) ‘07. TG: @aothman47 Please link to any previous projects the team has meaningfully contributed to: https://augur.netFoundationfor.artMIDAO.org Relevant usage metrics (TVL, transactions, volume, unique addresses, etc. Optimism metrics preferred; please link to public sources such as Dune Analytics, etc.): Clipper data dashboard (toggle to Optimisim): Clipper DEX Dune: Clipper Key Metrics Competitors, peers, or similar projects (please link): There are no other DEXs tailored specifically to small trades/retail traders.Peers include: Uniswap (https://uniswap.org/), SushiSwap (https://www.sushi.com/), Hashflow (https://www.hashflow.com/), DODO (https://dodoex.io/), Balancer (https://balancer.fi/). Is/will this project be open sourced?: In the Future Optimism native?: Yes Date of deployment/expected deployment on Optimism: 2/14/2022 What is the problem statement this proposal hopes to solve for the Optimism ecosystem?: The Optimism ecosystem needs good trading prices on long-tail tokens in order to make Optimism attractive to new projects and users who must buy tokens to participate in projects within the ecosystem. The problem is that slippage on most DEXs is either quite high or requires an often prohibitive amount of liquidity to keep it low. High transaction costs deter users from buying tokens, which stunts volume, market depth, and ultimately usage. Large liquidity requirements deter projects from launching on Optimism. How does your proposal offer a value proposition solving the above problem?: Clipper Coves (Introducing Clipper Coves!) are an ecosystem of liquidity pools on Clipper that enable swaps between long-tail asset pairs. Our proposal entails using the OP tokens from the grant to incentivize liquidity into Clipper’s Optimism Coves to be used for pairings. We are trying to test how efficiently we can generate low-slippage pricing on new tokens when they come on Optimism for the first time. This will be a liquidity mining experiment to see how efficiently we can do so. Due to Clipper’s design, our hypothesis is that Coves can provide low-slippage pricing 5x more efficiently than traditional AMM DEXs on retail trade sizes, but we need to test this and write a case study on it. The results of this test should produce better prices (lower slippage) on tokens in the Optimism ecosystem, which will help with the problems stated above. Why will this solution be a source of growth for the Optimism ecosystem?: First, giving new projects a clear, quantifiable game plan to facilitate reasonable prices for trades in their tokens will help attract projects to Optimism. Second, better token trading prices attract more users to Optimism for the projects of the Coves we incentivize directly. We anticipate we can generate a playbook that allows for projects to invest 5x less liquidity to generate competitive trading prices for their tokens for retail trades. Has your project previously applied for an OP grant?: Yes. Proposal: [GF: Phase 0 Proposal] ClipperUpdate: Behold! Clipper’s OP Token Distribution Plan Number of OP tokens requested: 250k OP tokens Did the project apply for or receive OP tokens through the Foundation Partner Fund?: No If OP tokens were requested from the Foundation Partner Fund, what was the amount?: N/A - the only grant we have received was the phase 0 grant listed above. How much will your project match in co-incentives? (not required but recommended, when applicable): N/A - Clipper does not have a token so we are not able to do incentives ourselves. How will the OP tokens be distributed? (please include % allocated to different initiatives such as user rewards/marketing/liquidity mining. Please also include a justification as to why each of these initiatives align with the problem statement this proposal is solving.): 100% to liquidity mining incentives. Please see above answers for justification. We may add additional threshold requirements ad hoc, like having used the protocol associated with a target token or holding an NFT, like in the OP Galxe Quests. Over what period of time will the tokens be distributed for each initiative? Shorter timelines are preferable to longer timelines. Shorter timelines (on the order of weeks) allow teams to quickly demonstrate achievement of milestones, better facilitating additional grants via subsequent proposals: We will release the tokens in a structured liquidity mining program in several phases, each of several weeks. After each phase, we will evaluate the effectiveness and adjust the structure of the distribution until we have a/b tested several approaches and solidified a playbook that works. Clipper is integrated into 1inch, so prices will permeate the market instantly. Please clearly define the milestones you expect to achieve in order to receive milestone based installments. Please consider how each milestone relates to incentivizing sustainable usage and liquidity on Optimism. Progress towards each milestone must be trackable: Milestones will be centered around the successful reduction of slippage. Milestone 1: we reach diminishing marginal returns to trading volume from liquidity for one Cove.Milestone 2: we reach diminishing marginal returns to trading volume from liquidity for three coves.Milestone 3: we write a case study on the experiment—Optimism can use this case study to attract new projects.Milestone 4: We apply the playbook to as many coves as possible with remaining liquidity, prioritizing Optimism-native tokens. Why will incentivized users and liquidity on Optimism remain after incentives dry up?: Unlike other DEXs, Clipper pools are profitable for LPs even without token incentives - as proof, note that we don’t have a token and so have never used liquidity mining to date, and yet we have a successful DEX with market-leading yields.Rather, the liquidity mining is needed to overcome the initiation energy of contribution capital to a Clipper pool. Once it ends, liquidity will stay because its actually a profitable place to park capital. For context, here is the latest weekly comparison: Weekly WACC (Compound) - Google Docs Please provide any additional information that will facilitate accountability (smart contracts addresses relevant to the proposal, relevant organizational wallet addresses, etc.): Here is the DAO treasury Gnosis Multisig wallet that custodied the previous grant and will custody this grant: oeth:0x1Dd174bF2e090d0F1b1360Ac8905780429B2642BContracts are available here: FAQ - Clipper Confirm you have read and agree to the Eligibility Restrictions (here): I have read the Eligibility Restrictions and agree to abide by their conditions ",
                    "links": [
                        "https://www.shipyardsoftware.org/post/what-is-a-fmm",
                        "https://clipper.exchange/",
                        "https://twitter.com/Clipper_DEX",
                        "https://discord.com/invite/clipper",
                        "https://www.linkedin.com/in/mlurie",
                        "https://augur.net",
                        "http://MIDAO.org",
                        "https://clipper.exchange/data",
                        "https://dune.com/shipyard_software/clipper-key-metrics",
                        "https://uniswap.org/",
                        "https://www.sushi.com/",
                        "https://www.hashflow.com/",
                        "https://dodoex.io/",
                        "https://balancer.fi/",
                        "https://blog.clipper.exchange/clipper-coves/",
                        "https://gov.optimism.io/t/gf-phase-0-proposal-clipper/1322?page=19",
                        "https://blog.clipper.exchange/op-distribution/",
                        "https://bit.ly/3JswVuz",
                        "https://docs.clipper.exchange/faq",
                        "https://gov.optimism.io/t/grant-proposal-template/3233"
                    ],
                    "GPT-summary": "The post is a proposal for a specialized DEX called Clipper, designed for retail traders. The proposal explains how Clipper works, its unique features, and how it can solve the problem of high slippage on most DEXs. The author also requests a grant from the Optimism Foundation to incentivize liquidity into Clipper's Optimism Coves to be used for pairings. The post does not receive entirely positive or negative feedback, but rather constructive criticism and questions from third parties.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Interoperability and Scaleability",
                        "Smart contract updates",
                        "Community and engagement",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.739121667805879
                }
            ]
        }
    ],
    "group_index": "494"
}