{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/crown-for-delegates/3123",
            "title": "Crown for Delegates ",
            "index": 3123,
            "category": [],
            "tags": [
                "delegate-updates"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/diligit",
                    "index": "1",
                    "likes": "13",
                    "time": "26/07/2022-22:27:11",
                    "content": "Nothing special, but I propose that forum delegates who can approve proposals (voting power >0.5%) be highlighted on the forum so that proposal authors know who they need to get approval from before changing the label to [READY]. A forum group can be created for delegates, so that delegates have a name tag something like the moderator tag, or some other form of highlighting. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.720238095238095
                },
                {
                    "author_link": "https://gov.optimism.io/u/mastermojo",
                    "index": "2",
                    "likes": "2",
                    "time": "27/07/2022-00:50:18",
                    "content": "I support this and think a MOD should get this implemented. So many replys happening on these threads, and it would be nice to have a visual if that person has voting power >0.5%. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.625
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "3",
                    "likes": "2",
                    "time": "27/07/2022-01:04:09",
                    "content": "i love when a suggestion is simple and obviously beneficial. full support. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0625
                },
                {
                    "author_link": "https://gov.optimism.io/u/Bobbay_StableLab",
                    "index": "4",
                    "likes": "0",
                    "time": "27/07/2022-08:48:42",
                    "content": "Simple but effective! We like this idea. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://gov.optimism.io/u/MinimalGravitas",
                    "index": "5",
                    "likes": "6",
                    "time": "27/07/2022-09:32:07",
                    "content": "I can see the value in this, but I’m a little concerned that it would lead to a tiered structure of discussions, where proposal authors might only see it as necessary to reply to those of us who happen to have the most voting power. I assume the ‘crown’ idea is just an illustrative joke, but it we’re going to get a mark I would want it to be as subtle as possible so there is the least chance that it influences normal interactions… I understand why those of us with more share of the delegated OP are the ones with the power to change the status of a proposal, but considering this metric is probably more to do with recognition and popularity than any particular merit (in my case at least!) I would like to avoid the situation where it is seen as some kind of earned ‘honour’. I think Feynman’s view on this kind of thing is very healthy:  THE FEYNMAN SERIES - Honours - YouTube and we’d do well to try and avoid any unintended consequences of this idea (even though, I agree it would be useful). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.865885416666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/diligit",
                    "index": "6",
                    "likes": "3",
                    "time": "27/07/2022-09:59:07",
                    "content": "In the Operating Manual it is mentioned that the proposal must be approved by a delegate, and here on the forum there are thousands of users, and the authors of the proposals do not know who the delegate is, and any positive comment (e.g. I like the proposal. I support the proposal) from a single user causes the author of the proposal to consider that the proposal has been approved. And of course the “crown” was a metaphor, something simple that would highlight the delegates. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25974025974026
                },
                {
                    "author_link": "https://gov.optimism.io/u/MinimalGravitas",
                    "index": "7",
                    "likes": "3",
                    "time": "27/07/2022-10:07:52",
                    "content": "Oh don’t get me wrong, like I said I do think it would be a good idea, I’m just raising a concern that I think it’s worth being aware of when we implement it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9375
                },
                {
                    "author_link": "https://gov.optimism.io/u/Prometheus",
                    "index": "8",
                    "likes": "1",
                    "time": "27/07/2022-11:07:14",
                    "content": "    MinimalGravitas:  where proposal authors might only see it as necessary to reply to those of us who happen to have the most voting power.   This already happens (at least to some extent), it always happens because we don’t need “stickers”, “badges”, “crowns”, “titles”, whatever, to know who participates more and probably needs to be listen more than people that don’t participate much. From a transparency aspect I like this suggestion because new participants and “regular” participants get to know who are the more active and relevant delegates without reading much (assuming delegates with more voting power participate more, it’s not always the case as we know). Anyway, we can also use the profile details (about me in profile) for this. As example, I would like to see larger delegates using more links in their profile for things like this (instead of a “blank” profile):  polynya.eth - boardroom.io Polynya - Delegate Communication Thread   op-profile-details1121×352 125 KB  Notes: @polynya don’t take me wrong for using you as example. It’s a suggestion for everyone. The more transparent we are about this better it is for everyone. @diligit thanks for this interesting suggestion. With or without a “crown” we can improve our profiles and the way delegates give approval to proposals. ",
                    "links": [
                        "https://gov.optimism.io/t/polynya-delegate-communication-thread/3085",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/0/073b43f61b3e6fc2f7dd169ed5bff7a601e90692.jpeg"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.131093544137023
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "9",
                    "likes": "1",
                    "time": "27/07/2022-21:10:18",
                    "content": "    MinimalGravitas:  where proposal authors might only see it as necessary to reply to those of us who happen to have the most voting power   @Prometheus  is also right.  This already happens […]  Both are valid point but putting some kind of tag on user profile will make things more complicated. I agree that we need to make this more transparent with approval. One suggestion would be to create a delegate page /excel sheet (those holding 0.5% vote)  and link it to OP manual. Make it automated so that this excel is up to date all the time. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.178571428571429
                },
                {
                    "author_link": "https://gov.optimism.io/u/Prometheus",
                    "index": "10",
                    "likes": "0",
                    "time": "27/07/2022-21:22:23",
                    "content": "    OPUser:  One suggestion would be to create a delegate page   Boardroom.io Optimism Delegates already provides a list with voting power (not filtered but it can be sorted by vote power, if the view is switched from grid to list everything is easier to see/understand). Anyway, some filters would be nice considering voting power and votes cast. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "11",
                    "likes": "1",
                    "time": "27/07/2022-21:30:10",
                    "content": "Yes, it’s a really nice tool but I would love to see it mapped to OP manual, if foundation is treating that as official website. We also have Dune dashboard. Only thing missing is a link. Reason being, any one creating a proposal will read the manual so s/he/they knows where to look for delegates who can approve their proposal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.125
                },
                {
                    "author_link": "https://gov.optimism.io/u/diligit",
                    "index": "12",
                    "likes": "2",
                    "time": "27/07/2022-21:32:55",
                    "content": "    OPUser:  One suggestion would be to create a delegate page /excel sheet (those holding 0.5% vote) and link it to OP manual.   There is already a list of delegates and voting power.   dune.com    Dune Blockchain ecosystem analytics by and for the community. Explore and share data from Ethereum, xDai, Polygon, Optimism, BSC and Solana for free.       The purpose of the proposal is for the proposal authors to see that they have received approval from a delegate. Probably the optimal solution would be a delegate-badge visible only in profile… ",
                    "links": [
                        "https://dune.com/optimismpbc/optimism-op-token-house"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "13",
                    "likes": "1",
                    "time": "27/07/2022-21:35:26",
                    "content": "@diligit  delegate-badge visible only in profile  Yes please, I couldn’t agree more. This might work just fine. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.527777777777778
                },
                {
                    "author_link": "https://gov.optimism.io/u/diligit",
                    "index": "14",
                    "likes": "2",
                    "time": "27/07/2022-21:42:19",
                    "content": "    OPUser:  Yes please, I couldn’t agree more. This might work just fine.   Okay, I am not a delegate and have no personal interest in this proposal, but simply see the highlighting of delegates as a source of information based on the OPerating Manual. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.416666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "15",
                    "likes": "0",
                    "time": "27/07/2022-21:42:44",
                    "content": "idk whether this is doable with this forum software but could a delegate w privileges do something like flag a post to indicate approval? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "16",
                    "likes": "0",
                    "time": "27/07/2022-21:49:03",
                    "content": "In current form this forum software don’t have an option to flag a proposal as approved. Both suggestion need new release. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.340909090909091
                },
                {
                    "author_link": "https://gov.optimism.io/u/kohei",
                    "index": "17",
                    "likes": "2",
                    "time": "27/07/2022-23:49:57",
                    "content": "I agree that more visualization for who delegates are on the forum is important ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/bakgwei",
                    "index": "18",
                    "likes": "0",
                    "time": "02/09/2022-02:56:47",
                    "content": "I second that - more transperancy is a good thing in this matter. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                }
            ]
        }
    ],
    "group_index": "180"
}