{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/infinity-keys-build-grant-cycle-11/5635",
            "title": "Infinity Keys - Build Grant - Cycle 11 ",
            "index": 5635,
            "category": [
                "\\xf0\\x9f\\x8f\\x9b Governance",
                "Grants"
            ],
            "tags": [
                "builders",
                "cycle-11"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/andyboyan",
                    "index": "1",
                    "likes": "1",
                    "time": "15/03/2023-01:54:57",
                    "content": "Basic Details Project name: Infinity Keys Author name and forum name (please provide a reliable point of contact for the project): Andy Boyan, [andy@infinitykeys.io], @andyboyan, magic#4311 L2 recipient address: 0x37c752aA952CFb62cc403fd810F2a01801675Bcc Which Voting Cycle are you applying for?: Cycle 11 I confirm that I have read the landing pages for the Builders and Growth Experiments Sub-Committees and that I have determined my proposal is best suited to be reviewed by the Builders Sub-Committee: Yes, confirmed. Project Details What are you going to build?: Infinity Keys is a platform for fun, DaVinci Code-style challenges that create community engagement. There are 4 “Keys” to the platform.  A mystery puzzle game: Secret society-themed challenges, story, and community.   Play h ttps://www.infinitykeys.io/puzzle/the-society to advance to level 1 in IK Discord (claim reward NFT on Optimism). This build proposal is to create a number of Infinity Keys core quests that exclusively mint rewardable NFTs on Optimism with an aim to create gameplay specific to the Optimism, BASE, and Superchain ecosystem.   Creator Tools: Infinity Keys is a no-code, user-generated content platform for anyone to build casual/puzzle games with web3 validation and rewards. Combined with our OSS strategy, creator tooling and community are how Infinity Keys achieves network effects, and how we are positioning IK for massive growth.   We use this platform to build and feature challenges with partners across web3, and are in talks with Fortune 500 brands to use IK as a game engine for experiential games. This is how the core Infinity Keys business generates a majority of revenue. Example: Play live partner challenge from RaidBrood h ttps://www.infinitykeys.io/pack/raid-brood. This build proposal would aim to work with other Optimism ecosystem partners at a discounted rate in order to focus on retention in the Optimism ecosystem. The no-code, self-service component of Infinity Keys is not yet live. We will use this grant to assess how Infinity Keys and the Optimism and Superchain ecosystem are aligned as we build the platform and community.   Public Goods: Infinity Keys intends to release the game engine (validation and achievement logic) as an OSS package depending on public goods funding partnerships. This party of the project is not intended as part of this proposal.  Here is a video demo of the current Infinity Keys platform. h ttps://youtu.be/YiwDqrZGDLY We are proposing to modify the Infinity Keys application to be specific to Optimism. We currently allow players to mint rewardables to Avalanche, Ethereum, Polygon, or Optimism with Polygon mints taking up a significant majority of the mints. By moving the core gameplay to Optimism only, Infinity Keys is staking a claim on a home base within the Superchain ecosystem, and ideally bringing a significant number of players from other chains to Optimism. We are also proposing a focused partnership effort with projects across Optimism to help retain users after they have been enticed by OP growth grant rewards. Why is what you are going to build going to succeed?: It’s going to succeed because it already has, and we have done zero paid marketing. We have demonstrated success by building a number of initial partner challenges, demo MVP challenges, and the start of an Infinity Keys lore across the application and Discord community. As a scrappy team of builders we have achieved ~100,000 mints and our incentives have been under $300 worth of airdrops or giveaways. People are already playing the games just because they are fun games. They are described as addicting, fun, clever, and people report feeling like they need to complete them all. The core hypothesis of Infinity Keys is that there are additional effective incentives that can be used alongside bribery/token emissions. Games showcase many of these incentives, but to tap into gaming incentives you need to give players more than gamified achievements and leaderboards. You can’t just call a list of tasks a quest. You need actually fun games. DaVinci Code-style puzzle games provide these mechanics without demanding constant time spent farming in action games, and allow for a partnership model across a native game and various digital partners that result in authentically fun digital experiences. We are a passionate and experienced professional team with deep roots in web3. We’ve been involved web3 since 2017, working in the industry since 2018, building together since 2021 with dedicated focus on Infinity Keys since April of 2022. We have successfully deployed Infinity Keys challenges with mints on mainnet Ethereum, Polygon, Avalanche, and Optimism. The roots of our game design strategy and philosophy come from a decade+ of research in game mechanics and learning, which allows us to tap into a wide variety of alternate gaming motivations compared to typical web3 gaming projects. We are building towards an exponential number of community created and curated games, which will incentivize more creators and players to join, play, and create across the Infinity Keys network. Is your project likely to bring new builders to the Optimism ecosystem? If so, please describe how: Yes, creating stuff to do for users after OP emissions from growth grants is critical to the long term retention of users on Optimism. Infinity Keys is a system for creating long-term engagement. By using web3 assets as required game pieces, challenges can stay up indefinitely. This means that builders who come to Optimism have a native community of players that are ready to pursue new challenges leading to new projects. This is a long-term, native onboarding system with a focus on engagement and retention. Is your project likely to improve the quality of developers in the Optimism ecosystem? If so, please describe how: See below Is your project likely to improve the commitment of developers in the Optimism ecosystem? If so, please describe how: Yes, having native ecosystem games that feature genuine growth instead of token emissions will attract serious builders who want to create applications with curious and loyal users. Optimism already established a culture of curiosity with the Quests, but can now extend that beyond a few campaigns and into a focus on engagement and retention. Also in our anecdotal experience, the smartest developers like clever puzzles. Good developers want to participate in systems where there are many types of support, token emissions grants, good documentation, and also a clear growth and retention strategy. Provide us with links to any of the following for the project: Demo: h ttps://youtu.be/YiwDqrZGDLY Website: infinitykeys.io Twitter: h ttps://twitter.com/infinitykeys Discord/Discourse/Community: Infinity Keys Other: h ttps://lenster.xyz/u/infinitykeys Do you have any metrics on the project currently? (TVL, transactions, volume, unique addresses, etc. Optimism metrics preferred; please link to public sources such as Dune Analytics, etc.): Holders = unique wallets Transfers mostly = mints      mainnet polygon avalanche optimism totals     holders 2,305 14,780 146 1,141 18,372   total transfers 7,544 86,721 563 7,499 102,327    Who are your competitors?: Galaxe Premint.xyz Quest.xyz What differentiates you from your competitors?:  Actually fun games Players that play for the sake of fun, and not for airdrops Sybil protection Composable gates and rewardables Focus on community game development Open source game/questing engine  Will your project be composable with other projects on Optimism? If so, please explain: Yes, our technology follows the ERC-1155 standard. Team Who are your founders?: Andy Boyan, PhD. Former professor of Communication with research focus on digital game mechanics and effects. Formerly @ Status, Chainlink Labs, Ava Labs. What makes your founders well-positioned to accomplish your goals with this project (1-2 sentences on each)?: Demonstrated history of deep understanding of social, technical, and operation requirements for delivering a project that spans engineering, social dynamics, and game mechanics. Andy founded Infinity Keys because of a desire to see a platform for game creation and questing live in the world. His social science study into media effects with a focus on game effects informs the team’s data-centered approach to design and strategy, and his wealth of web3 experience with highly technical projects helps bring a thoughtful and sophisticated understanding of on- vs off-chain technical features and the structure of decentralized networks. This combined with his study into human social dynamics is a perfect storm for creating an ambitious platform like Infinity Keys. Tell us about the rest of your team (if there are more teammates): Our full team is here h ttps://docs.infinitykeys.io/infinity-keys-docs/team/team-members Is this your first Web3 project?: No If not, what else have you built? (Share links, Github repository, or any other useful information.): Founder and technical PM worked on Rainbow Rolls. Solidity lead was instrumental in building Velodrome on Optimism. Numerous investors and advisory roles are in highly technical roles. I understand that Builders grants are subject to a 1 year lock-up, as explained further in this post : Yes. Is your project funded? If so, provide an estimate of how many months of funding runway your project has: Yes funded, but runway depends on how we focus our efforts. We currently have revenue and can increase revenue to build more runway for ourselves. However, doing this would be a focus on building partnerships and business development instead of product and ecosystem development. We have between 3-6 months of runway for this, with a conservative strategy to move us into revenue neutral territory in that time. Our preference is to solicit additional investment and public goods funding to invest in team expansion and platform expansion in order to build upon our successes and prepare Infinity Keys for a significant impact in onboarding, retention, and network effects through the next cycle of web3 fascination. Grant Request What is the size of the grant request? (50k OP max): 35k OP How do you justify the size of the grant? This grant size aims to achieve two objectives.  Fund human resource needs in developing dedicated technical systems, UX, and game design for release on Optimism. We estimate approximately two months of total effort to deliver on all aspects of the proposed system featured solely on Optimism. The approximate team costs per month of this are ~35,000 USD/mo including all team areas. Assuming a $2.50 OP rate, 35,000 OP (above) = ~$87,500. If we subtract 2 months of $35,000 USD for HR compensation ($70,000). We are aware that this is not liquid OP for selling and using for payroll, however, using these funds to spark additional investment and revenue would be a significant help in securing additional funding to account for this. Provide a fund for 10-15 Optimism ecosystem partners to pay for Infinity Keys premium challenge design services. Right now, IK charges $2500 for designed premium services (1ETH for a build-your-own). $17,500 (leftover from approx $70,000 from payroll portion of grant) for Infinity Keys to use towards partnerships at a bulk discount. This allows Infinity Keys to continue to build premium relationships with ecosystem partners, but also provide projects with a low cost incentive to work with IK and kickstart the broader gaming ecosystem on Optimism.  Infinity Keys has relationships with many existing projects through networking in the industry. These are some initial partner targets, some of which we are already in conversation with. 1. Aave 2. Alchemix 3. Galaxe-Optimism Onboarding Quests 4. Gelato 5. Gnosis SAFE 6. Granary 7. Guild 8. JokeDAO 9. PoolTogether 10. Synthetix 11. Thales 12. Velodrome  We are also working with Gelato on a grant for gasless transactions on Optimism using their automation. The partners listed above are those that the Infinity Keys team already has some contact with, but would be interested in working with the OP Foundation to refine the list and develop a cohort of first games with strategic alignment. Roadmap Describe in discrete steps your plan for accomplishing your project:  Redesign the Infinity Keys UI/UX to guide new players to mint Infinity Keys rewardables on Optimism. Update account abstraction systems (magiclink, but converting to keyp) to default to Optimism. Migrate existing Infinity Keys NFTs to Optimism. (This requires a deeper scope to understand best practices on how to handle NFTs for game logic). Design and launch new Infinity Keys core games exclusive to Optimism Launch a self-service/create-your-own challenge MVP with default settings to mint on Optimism Recruit 10-15 Optimism ecosystem partners for discounted game development and design Develop challenges for/with each partner Launch partner challenges in a strategic rollout  Does your plan depend on the receipt of OP tokens?: Sort of? Infinity Keys is looking for ecosystem alignment. We are currently chain-agnostic, and Optimism Foundation taking a funded and dedicated interest in Infinity Keys would allow IK to build in a more exclusive manner. Without funding support, we will continue to generate revenue from across ecosystems. We are currently most successful on polygon with both mints and paid partnership relationships, so we anticipate that without focusing efforts on Optimism and mainnet, we will end up focused on side chains. The partnership-focused grants also support this effort, as this helps both partners and IK to work together and expand the footprint of games on Optimism instead of splintering our efforts in negotiating pricing and delivery. Along with this grant we would also seek Optimism friendly funding vehicles such as funds, angels, or public goods funding to help keep our lights on as we expand. What is your plan for the use of the OP token after the 1 year lock-up?: Ideal scenario: Infinity Keys is a long-term partner voting or delegating to continue sustaining the Optimism and Superchain ecosystem. We see a path for Infinity Keys to run gameplay and governance across Base or Optimism or a dedicated IK Superchain. As a long-term partner these OP will help establish IK as a dedicated partner. Since IK is predicated on succeeding via network effects, it makes the most sense to maintain aligned interests. Less ideal: Use the OP in DeFi to create yield for the team to continue operations. Please provide benchmark milestones for this project. These milestones should guide the Optimism community on the progress of your project during the 1-year lock-up period.  3 months: Dedicated Optimism onramping for new players - keyp login 4 months: Multiple dedicated game pathways to level up in the core IK game using Optimism as the main mint rails 5 months: Launched 4 Optimism ecosystem partners with Infinity keys challenges 6 months: 2 Additional IK Core challenges 7 Months: Additional 4 Optimism ecosystem partner challenges 8 Months: 2 Additional IK Core challenges 9 Months: Additional 4 Optimism ecosystem partner challenges 10 Months: 2 Additional IK Core challenges 12 Months: Additional 4-8 Optimism ecosystem partner challenges  Please define critical milestones for this project. Critical milestones are meant to show good-faith efforts to accomplish the project. Non-completion of these milestones could lead to revocation of remaining grant rewards. 1 - 3 months: Infinity Keys Login Onboarding with keyp (converted from magic.link) 2 - 4 months: 2 Core IK Games that feature Optimism-only minting for rewardables 3 - 6 months: 4 Optimism ecosystem partners Total time to achieve critical milestones: 4-6 months Optimism Relationship Does your project solve a problem for the Optimism ecosystem?: Yes. New user retention. How does your proposal offer a value proposition solving the above problem?: As shown in the foundation governance call on 3/14/23, retention from OP growth grants is struggling. Achievements and quests and yield programs offer the prospect of initial user excitement, followed by token dumping or hodling. Instead, by using a game format, Infinity Keys proposes to unite the dapp ecosystem on Optimism, and give users a reason to return and transact frequently. This is a first step in building goodwill among players for games and engagement instead of bribery incentives. This is a key step, however, because emotional connection and satisfaction of gaming builds loyalty and brand connection to the optimism community and ethos. It will not be 100% of players that stay, but we have seen evidence that the number of far greater than zero, and that is with a small sample of games created as an MVP across Infinity Keys and various partner projects. Why will this solution be a source of growth for the Optimism ecosystem?: As Infinity Keys launches new games across various partner dapps and blockchains, a significant percentage of players will stay and complete additional games on the platform. This is the case in our metrics thus far. Wallets that mint an NFT from one project on Infinity Keys tend to mint from multiple projects on Infinity Keys, including the IK Core challenges. This gives us reason to believe that as thousands of players from Aavegotchi and the surrounding Polygon ecosystem come play IK challenges, they will stay and play on Optimism. This would make IK an onboarding vehicle that can then direct players to more growth grants partners so that players can begin earning OP and feeling valued across Optimism. How committed are you (and your team) to building on Optimism?: It is our preferred L2 and home base. This is where we want to build. Optimism is a real L2 that has clear mainnet validation. We are highly aligned with the Ethereum roadmap and L2 thesis, and it is our preference to build on Optimism, Base, Superchains, and maintain our home on Ethereum. However, given our funding needs, we will build where we need to in order to survive and prove out the expanded capabilities of Infinity Keys. If other ecosystems value the network effects that Infinity Keys is building we will make the best decision for our team to continue building. Is your project Optimism Native?: Governance and gameplay home base can be Optimism native. Confirmations I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: Yes I understand that I will be expected to following the public grant reporting requirements outlined here Yes ",
                    "links": [
                        "https://discord.gg/infinitykeys"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.413657900971334
                }
            ]
        }
    ],
    "group_index": "619"
}