{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/ready-gf-phase-1-kyberswap/3302",
            "title": "[READY] [GF: Phase 1] KyberSwap ",
            "index": 3302,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Governance Fund: Phase 1"
            ],
            "tags": [
                "cycle-6"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/shaneMkt",
                    "index": "1",
                    "likes": "11",
                    "time": "15/08/2022-04:50:50",
                    "content": "NOTE: This is an outdated proposal. Resubmission under the new proposal format can be found here: [REVIEW] [GF: Phase 1 Proposal] KyberSwap  Project Name: KyberSwap by Kyber Network Author Name: @shaneMkt | Twitter: shaneMkt Grant category: DeFi  Number of OP tokens requested: 900,000  L2 Recipient address: 0x5891be896ed4a79ed928c55b17fbbecdb46f8a00  Relevant Usage Metrics:  Over $11.6 Billion worth of lifetime trading volume 577K web visits (Average last 3 months - similarweb) 616K cumulative lifetime unique users on Ethereum (New + Legacy KyberSwap - pro.nansen.ai) 6,000 average DAU 15,000 average daily transactions Current TVL on KyberSwap: $90M (concentrated liquidity at $18B equivalent) Total TVL accounting for aggregated DEXes: $24B Deployed on 13 chains including Optimism, with 70+ total DEX integrations. Current DEX integrations on Optimism: Velodrome, Uniswap, Curve, BeethovenX, Synapse, and Zipswap. Synthetix is in the pipeline. More KyberSwap liquidity pool stats can be found on our analytics dashboard   1600×1068 276 KB   Optimism alignment (up to 200 word explanation): KyberSwap is a DEX aggregator and liquidity platform that aims to provide the best rates for traders, while enabling liquidity providers to maximize earnings through capital efficiency. Kyber is an Ethereum and DeFi pioneer and was the most used DeFi protocol in 2019. KyberSwap is deployed on Optimism and shares its motivation for a collaborative cyberspace. OP incentives would be used by KyberSwap to drive user, liquidity, and ecosystem growth. Chainlink is also supporting KNC price feeds on Optimism so KNC can be used as collateral on lending platforms. KyberSwap brings substantial benefits to Optimism users:   For Traders: KyberSwap aggregates liquidity from different DEX pools (including KyberSwap’s), getting the optimal trade route and best price. Traders can identify tokens that are ‘Trending’ or ‘Trending Soon’ using a detection algorithm that tracks on-chain metrics as volume and market cap.   For Liquidity Providers: LPs deposit tokens into pools and earn compounding fees. Pools are flexible and have features such as anti-sniping and concentrated liquidity, mimicking higher levels of liquidity and achieving better capital efficiency, volume, and returns.   For developers: Optimism Dapps can integrate with KyberSwap pools and aggregation API to provide the best rates for their own users, saving time and resources.    Proposal for token distribution (under 1000 words):  How will the OP tokens be distributed? KyberSwap will use the OP grants to bootstrap and deepen liquidity for popular pairs on Optimism. This is achieved by incentivizing liquidity providers to deposit liquidity (and yield farm) into KyberSwap’s concentrated liquidity pools, which would enable much more efficient use of their precious capital. KyberSwap would endeavor to utilize the OP grants in a sustainable manner so that liquidity is retained beyond the yield farming period. ALL OP grants will be distributed to Optimism users for their benefit. The Kyber team or KyberDAO will not be receiving any of the funds. Grants would be allocated as incentives for popular token pairs that have the highest potential for usage and trade volume on Optimism. This is especially pertinent for pairs that currently lack concentrated liquidity support and are capital inefficient. The following pairs are being considered for incentives (subject to change; will be further discussed with the Optimism team):  USDC / USDT USDC / WETH OP / WETH DAI / WETH DAI / USDC USDC / SUSD USDT / WETH WBTC / WETH USDC / WETH OP / USDC DAI / USDT  OP incentives may be allocated evenly between the pools or according to specific criteria such as the historical trading volume of the token pair and the liquidity level on Optimism etc. Roughly $2M+ worth of KNC would also be given to Optimism users for liquidity mining, with additional rewards for ancillary marketing and community activities. We are also in final discussions with QiDAO and Lido Finance to facilitate deeper liquidity for their relevant token pairs on Optimism.  How will this distribution incentivize usage and liquidity on Optimism? 1. Bringing users and developers to Optimism   KyberSwap has multi-chain exposure; 12 chains including Optimism (already deployed), Ethereum, Polygon, BNB Chain, Avalanche, Fantom, Cronos, Arbitrum, Velas, Aurora, Oasis and BitTorrent, with more to come. With incentives, users and developers from other networks would be highly motivated to bridge to Optimism. This would be the case for popular DeFi projects as well e.g. QiDAO and Lido Finance.   Farming incentives, along with KyberSwap’s concentrated liquidity, auto-compounding LP fee, and anti-sniping features, will increase TVL and volume, driving higher yields and attracting more LPs. We ran a similar campaign on Polygon last year and hit an ATH TVL of $145M.   KyberSwap’s concentrated liquidity (through Elastic Pools) enables trades to have much better slippage for a given level of TVL when compared to a typical Uni v2 AMM DEX.   2. Deeper liquidity: Swap with better slippage and at the best rates  KyberSwap Elastic’s concentrated liquidity pools enable high capital efficiency for LPs; similar to the Uni v3 tick-based AMM but with compounded fees for LPs in a full price range pool and anti-sniping/JIT that protects earnings. Unique NFT liquidity position farming mechanism (the first in DeFi to our knowledge) which can account for both time of active liquidity provided and target trading volume of the pool. As a DEX aggregator, KyberSwap users always enjoy the best rates, and this indirectly brings volume to other DEXes on Optimism e.g. Curve, BeethovenX, Synapse, Zipswap, Uniswap. Developers can integrate KyberSwap’s aggregator API to enable the best rates for their own Dapp users on Optimism. E.g. KyberSwap was integrated by DEXTools.  3. Additional KNC marketing rewards  KyberSwap will provide additional KNC rewards on top of liquidity mining incentives through various marketing activities including referral campaigns, trading contests, lotteries, and airdrops etc., which would help attract more users to Optimism.  4. Media coverage of Optimism  KyberSwap will be spending resources for owned, earned, and paid PR/Media to promote the liquidity mining campaign and other activities, bringing further attention to the Optimism brand.  5. Investments in the Optimism Ecosystem and Community   Kyber Ventures actively invests in DeFi/GameFi Dapps and builders and this would apply to Optimism-based projects too. This would help to grow Optimism’s Dapp ecosystem, which would in turn result in a rise in users, volume, and liquidity.   Pre-Covid, Kyber ran the largest monthly Ethereum meet-up events in Vietnam and is an active member of the Ethereum community in Singapore. We have the experience to invest in and grow the Optimism community at the local grassroots level, especially in Southeast Asia.    Why will the incentivized users and liquidity remain after incentives dry up? KyberSwap has devised a strategy for sustainable liquidity mining on Optimism through: 1. Active optimization of the liquidity pools and incentives  KyberDAO funds (already approved by KyberDAO earlier) would be used to seed liquidity on concentrated liquidity pools on Optimism. Depending on market conditions, the LP fee tier and price range of the pools can be customized and liquidity reallocated to ensure better rates and volume, which in turn increases organic yield APR% for LPs. Moreover, OP and KNC incentives can be capped for each farm once the optimal TVL (to achieve best rates) is reached, to ensure more efficient use of incentives.  2. New volume-based yield farming mechanism  Apart from the typical yield farming model based on the time period of an active liquidity position, KyberSwap introduced a new type of farm for tick-based AMMs (that have NFTs representing the liquidity position). This type of farm distributes incentives based on both the time period AND the target trading volume that the liquidity position is supporting. As such, liquidity incentives will be used efficiently for better performing farms that generate higher volume (and fees for LPs).  When the OP incentives end, TVL and user adoption are expected to have already hit the required threshold to capture sufficient trading volume and fee APY%, thus retaining existing liquidity providers and attracting new ones. Moreover, there will still be KNC incentives allocated for other activities on Optimism beyond just liquidity mining. KyberSwap plans to have a close, positive, and long-term collaboration with the Optimism team to bring more users, liquidity, and growth to the ecosystem.  Over what period of time will the tokens be distributed? Over 6-12 months, with ample time for more users to be aware of the campaign and bridge assets to Optimism. This also gives KyberSwap the flexibility to continually optimize our liquidity mining campaign and marketing efforts for the best possible outcome.  Has your project previously received an OP token grant? If yes, what’s the status of these tokens? No  How much will your project match in co-incentives? Roughly $2M+ worth of KNC for liquidity mining, with additional rewards for ancillary marketing and community activities. More can be considered depending on the success of the initial campaign.  Other information Social channels Twitter: 233K followers Telegram: 15K members Discord: 18.7K members Forum: 580 members Youtube: 3.3K subscribers Facebook: 23K followers Reddit: 12.7K members Developer Documentation  https://docs.kyberswap.com  Smart Contract Audits  KyberDAO and KNC audit by Hacken KyberSwap audit by ChainSecurity  Founders/Advisors  Victor Tran: CEO | Forbes 30 under 30 Loi Luu: Heading Kyber Ventures | Forbes 30 under 30 Yaron Velner: Founder of B.Protocol Vitalik Buterin: Advisor, Kyber’s launch  KyberSwap smart contracts have been audited by ChainSecurity and KNC and KyberDAO contracts by Hacken. Kyber is a mature project that is a pioneer in the Ethereum and DeFi space and has been operational for 4+ years without facing any major vulnerability. Kyber initiated and co-launched Wrapped Bitcoin (WBTC), the most used wrapped version of BTC in the DeFi space today, and we aim to bring similarly innovative initiatives to the Optimism space. Note: A maximum of 2 links are allowed by the forum. More relevant links can be included on request. We will also add the links to the post later when possible. ",
                    "links": [
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/3/3c192f7374941d6df8666afbe4f26da51e1d096a.jpeg",
                        "http://kyberswap.com",
                        "https://docs.kyberswap.com"
                    ],
                    "GPT-summary": "The post is an explanation of the KyberSwap project by Kyber Network, a DEX aggregator and liquidity platform that aims to provide the best rates for traders while enabling liquidity providers to maximize earnings through capital efficiency. The proposal outlines how the OP tokens will be distributed to incentivize usage and liquidity on Optimism, including through farming incentives, concentrated liquidity pools, and marketing activities. The post also includes relevant usage metrics, information on Optimism alignment, and details on the team and smart contract audits. The post receives entirely positive feedback and extends to the Optimism team and users.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Interoperability and Scaleability",
                        "Token economics",
                        "Smart contract updates",
                        "Community and engagement"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 6.035105748771004
                },
                {
                    "author_link": "https://gov.optimism.io/u/Rinrin",
                    "index": "2",
                    "likes": "1",
                    "time": "16/08/2022-21:29:56",
                    "content": "I support this proposal. Kyber is an innovative project and contributed a lot to the Ethereum ecosystem since day 1. It’s great to have Kyber on Optimism too. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 8.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/krixi",
                    "index": "3",
                    "likes": "1",
                    "time": "16/08/2022-21:37:09",
                    "content": "Nice to see Kyber here. I like the focus on bringing value to the ecosystem by incentivizing major token pairs, especially the ones that lack existing concentrated liquidity options. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.104166666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/Lybui05",
                    "index": "4",
                    "likes": "3",
                    "time": "17/08/2022-06:35:07",
                    "content": "Kyber is one of my favourite projects from the early stage, a solid product and dedicated team ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/Dchasser",
                    "index": "5",
                    "likes": "1",
                    "time": "17/08/2022-06:40:47",
                    "content": "Happy to see this. Would love to combine forces for OP airdrops, OP projects, Kyber liquidity here. Would be very interesting and probably new to market. lfg ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party wants to collaborate on proposal",
                        "3rd party extending to proposal",
                        "3rd party giving entirely positive feedback on proposal"
                    ],
                    "Sentiment": 7.607954545454545
                },
                {
                    "author_link": "https://gov.optimism.io/u/Jeffma",
                    "index": "6",
                    "likes": "0",
                    "time": "17/08/2022-07:28:44",
                    "content": "This proposal sounds great and I think it will have a positive impact on both sides. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.568181818181818
                },
                {
                    "author_link": "https://gov.optimism.io/u/Luke.D",
                    "index": "7",
                    "likes": "0",
                    "time": "17/08/2022-08:41:30",
                    "content": "Yes its good to see Kyber here. They can bring a lot of benefits to the Optimism ecosystem especially after they launched their Elastic protocol. Believe this partnership will bring Op to the next level  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving entirely positive feedback on proposal"
                    ],
                    "Sentiment": 6.166666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/Thomasdjoel",
                    "index": "8",
                    "likes": "0",
                    "time": "17/08/2022-08:43:47",
                    "content": "10/10 will support this proposal  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/kjk",
                    "index": "9",
                    "likes": "0",
                    "time": "17/08/2022-08:49:33",
                    "content": "This is a great proposal, would be a great and interesting collaboration for OP and Kyber to work on together and further jointly develop the ecosystem through this endeavour. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 7.625
                },
                {
                    "author_link": "https://gov.optimism.io/u/Yonglio",
                    "index": "10",
                    "likes": "0",
                    "time": "17/08/2022-09:30:00",
                    "content": "Why not? KyberSwap seems like a best DEX now, and Kyber on Optimism seems really juicy. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/AlexGB",
                    "index": "11",
                    "likes": "0",
                    "time": "17/08/2022-09:39:41",
                    "content": "Out of the blue , KyberSwap appeares here. This is one and the only DEX that I completely believe in putting all my crypto investment in, certainly support to this proposal 🫶🏻 ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.392857142857142
                },
                {
                    "author_link": "https://gov.optimism.io/u/MinimalGravitas",
                    "index": "12",
                    "likes": "0",
                    "time": "17/08/2022-09:47:34",
                    "content": "Hi @shaneMkt, Before we get around to reviewing this please can you ask your community not to brigade the thread. Every comment before mine is from a newly signed up forum member who has never commented on anything else. If this enthusiastic spam continues it will be very difficult for delegates to discuss your proposal as questions and answers will be hidden in the flood of low-content replies. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal."
                    ],
                    "Sentiment": 4.899621212121212
                },
                {
                    "author_link": "https://gov.optimism.io/u/shaneMkt",
                    "index": "13",
                    "likes": "1",
                    "time": "17/08/2022-10:03:01",
                    "content": "Hey @MinimalGravitas apologies! We did invite our community members to join the Optimism community and discuss the proposal so for many of them it’ll be the first time on this forum. We’ll send a reminder not to spam their views. Thanks  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.583333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/Jay",
                    "index": "14",
                    "likes": "0",
                    "time": "17/08/2022-15:06:13",
                    "content": "Love to see it! I think this would benefit both parties a lot. No reason not to push this through. Kyber has been contributing to ecosystems like Ethereum for some time. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 8.125
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "15",
                    "likes": "0",
                    "time": "13/09/2022-00:03:38",
                    "content": "Thanks for the proposal! If you plan to have this reviewed in Voting Cycle 6, can you please specify which committee should review your proposal (NFTs and Gaming, Tooling, or DeFi) under the grant category field in the updated proposal template for Cycle 6? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/MoneyManDoug",
                    "index": "16",
                    "likes": "0",
                    "time": "12/11/2022-18:14:48",
                    "content": "As an Optimism delegate with voting power above the required threshold I believe this proposal is ready. Delegate Commitments - #71 by MoneyManDoug ",
                    "links": [
                        "https://gov.optimism.io/t/archive-kyberswap/4978",
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-kyberswap/4068"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/mteoptimism",
                    "index": "17",
                    "likes": "0",
                    "time": "13/11/2022-09:05:30",
                    "content": "    Rinrin:  I support this proposal. Kyber is an innovative project and contributed a lot to the Ethereum ecosystem since day 1. It’s great to have Kyber on Optimism too.   I support this proposal. Kyber is an innovative project and contributed a lot to the Ethereum ecosystem since day 1. It’s great to have Kyber on Optimism too. ",
                    "links": [
                        "https://gov.optimism.io/t/archive-kyberswap/4978"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 8.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/shaneMkt",
                    "index": "18",
                    "likes": "0",
                    "time": "21/11/2022-03:38:29",
                    "content": "NOTE: Resubmission under the new proposal format can be found here: [REVIEW] [GF: Phase 1 Proposal] KyberSwap ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.465909090909091
                },
                {
                    "author_link": "https://gov.optimism.io/u/acermacrophyll",
                    "index": "19",
                    "likes": "0",
                    "time": "21/11/2022-15:41:19",
                    "content": "Very dangerous frien we all hope that this is not true ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 2.6125
                }
            ]
        }
    ],
    "group_index": "207"
}