{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/optimism-community-calls-should-be-moved-to-discord-stages/5306",
            "title": "Optimism Community Calls should be moved to Discord Stages ",
            "index": 5306,
            "category": [],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/MattL",
                    "index": "1",
                    "likes": "9",
                    "time": "20/02/2023-06:14:11",
                    "content": "I’d like to suggest a change regarding where community calls are hosted. Currently, community calls are being hosted on Zoom, which is a great platform. However, it requires people to go to a separate platform to listen in, which is inconvenient and leads to many people not knowing/missing the calls. For a community of hundreds of thousands, I’d hope that the weekly community call could be an event with much larger attendance. Therefore, I suggest that we start hosting our community calls on Discord’s stage channels instead. The most significant benefit of using Discord stages is the ability to promote them through the Discord events feature on the Optimism Discord. Calls would be highlighted in the top left corner of the screen for OP Discord users, allowing users to RSVP for them as well. Discord has recently allowed stage channels to share screens, something that I initially thought would be an inconvenience for moving to Discord, but the Discord gods have heard my prayers and have changed this! This means that we can continue to present forum posts and such so people can easily follow along with the speakers. There are solutions for recording on Discord as well, including the Craig bot, which works really well and can bring over audio for the calls. I believe that using Discord’s stage channels for our community calls would be a great step towards making our community more accessible and inclusive. So, I’d love to hear others’ thoughts on this one. Thanks! CCing a few people I discussed this with: @Michael @mastermojo ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.174603174603175
                },
                {
                    "author_link": "https://gov.optimism.io/u/hait",
                    "index": "2",
                    "likes": "1",
                    "time": "20/02/2023-12:11:08",
                    "content": "I also think using discord or twitter is better.  There are too many inconveniences to use zoom. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/CryptoKachu",
                    "index": "3",
                    "likes": "1",
                    "time": "20/02/2023-14:18:22",
                    "content": "I agree with you. Zoom is not a good medium in terms of accessibility. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/FractalVisions",
                    "index": "4",
                    "likes": "3",
                    "time": "20/02/2023-15:14:42",
                    "content": "That was actually discussed in the last community call. We spoke about this. You can listen in here.    Recap: 15th OP Community Governance Call (February 14th) Community Calls       Call recording: February 14th Optimism Community Governance Call.mp4 - Google Drive  Recap:   This meeting was a little bit shorter but still some great discussion. Check out the new Agora interface (vote.optimism.io), cast your test vote, and drop some feedback!  This is the place for new delegates to register and for existing delgates to cast votes   New partner fund post  Same restrictions for no sale / lockup. Generally targeted at larger projects that have already achieved product-market fi…     ",
                    "links": [
                        "https://drive.google.com/file/d/1fsnGGSBXJeRoB2hCS68Aqpi8cLGvEXUb/view?usp=sharing",
                        "https://vote.optimism.io"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.552840909090909
                },
                {
                    "author_link": "https://gov.optimism.io/u/Axel_T",
                    "index": "5",
                    "likes": "5",
                    "time": "20/02/2023-23:36:14",
                    "content": "EDIT: I just watched the Recap of the 15th Op Community Governance Call (February 14th) via the link posted above… I think @Michael and @katie in that call best summed up how I feel about the calls. Their feelings, as well as my own below help explain why I personally think an open Zoom format might be better than a permissioned Discord format, or a lower-quality-conversation Twitter format. ORIGINAL REPLY: This had previously been discussed in a Community Call late last year (on top of what was discussed in the Feb 14th call which I haven’t watched, yet). The push back against Discord at that 2022 meeting was that Discord led to a centralisation of voices being heard. That is, it would requires ‘bosses’ to allow people to speak up, via the functionality of Discord and the platform-determined ‘passing of the mic’ or ‘holding the conch shell’. Zoom was thus preferred as anyone could speak up at anytime, and allowed more free flow of ideas and thoughts. So while Discord could be seen as more accessible, the last time this was discussed it was seen as far less inclusive and hindered open, transparent communication. As for accessibility:  You don’t need the Zoom app installed to watch the recordings. My personal opinion on increasing accessibility would be to rotate the Community Call times. The current time slot has a timezone that is very west coast USA-centric and can make attendance prohibitive in Europe, Africa and Asia.   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.916666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/Michael",
                    "index": "6",
                    "likes": "3",
                    "time": "22/02/2023-19:48:04",
                    "content": "Thanks for the post @MattL. I think there are some good points on both sides of the debate. One thing to note is that for the last call, @lavande was able to put the zoom link into the discord events modal. As far as screen sharing, that definitely is a big plus that it is now a possibility. Why don’t we do this: On the next off-week (March 7th) assuming we can get everything set up in time, we can have a community call on discord to discuss a special topic in governance. This will allow to test out Discord as a medium for the calls and see if we want to switch going forward. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.1607142857142865
                },
                {
                    "author_link": "https://gov.optimism.io/u/Michael",
                    "index": "7",
                    "likes": "2",
                    "time": "22/02/2023-19:48:43",
                    "content": "    Axel_T:  My personal opinion on increasing accessibility would be to rotate the Community Call times. The current time slot has a timezone that is very west coast USA-centric and can make attendance prohibitive in Europe, Africa and Asia.   This is an interesting suggestion, what time do you think would be best to make it easier on these regions? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.699999999999999
                },
                {
                    "author_link": "https://gov.optimism.io/u/mastermojo",
                    "index": "8",
                    "likes": "2",
                    "time": "24/02/2023-02:49:32",
                    "content": "I agree with Matt here. The easy of use is night and day. Would be great if we move towards that with Optimism. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.083333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/mastermojo",
                    "index": "9",
                    "likes": "2",
                    "time": "24/02/2023-02:50:49",
                    "content": "Sounds good with me. Who is going to create the discord event for March 7th? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/Axel_T",
                    "index": "10",
                    "likes": "1",
                    "time": "24/02/2023-15:59:05",
                    "content": "Hi @Michael thanks for your reply. As a quick suggestion, since the Community Call is currently held at 10am Pacific time, why not rotate it around at:   10am Central European Time (CET) or 10am UTC/GMT  10am in the ‘UTC/GMT + 8 Timezone’ (which is kind of a catch-all for a large part of Asia).  I’m not 100% up to speed with everything Optimism, and definitely not a subject matter expert, but I could assist MC’ing the Asian meeting if you or others, who are better qualified to host, can’t make those hours. Just let me know. BIG EDIT: Sorry, I’ve got lost in the timezones! (I just know it’s at bloody 5am where I live, lol). I’ve made changes to the post from 7pm to 10am. My original post had the current meeting times wrong. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.365921115921116
                }
            ]
        }
    ],
    "group_index": "534"
}