{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/nominations-for-retropgf2/4636",
            "title": "Nominations for RetroPGF2 ",
            "index": 4636,
            "category": [
                "\\xf0\\x9f\\x94\\xb4 RetroPGF"
            ],
            "tags": [
                "rpgf2"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/system",
                    "index": "1",
                    "likes": "124",
                    "time": "17/01/2023-20:31:04",
                    "content": " Nominations for RetroPGF round 2  image1440×720 320 KB  This is the kick-off for the project nominations of the recently announced RetroPGF round 2. Optimism’s vision is to build a global system where positive impact to the Collective is rewarded by profit to the individual. RetroPGF is an experimental mechanism to realize this goal of “impact = profit”. For more information, read the announcement post or visit our governance documentation. Anyone may nominate a project for the second round of Retroactive Public Goods Funding!   Overview of Timelines  Project nominations: Jan 17 19:00 GMT - Jan 31 19:00 GMT Final project opt-in deadline: Feb 21 Voting: Mar 7 - Mar 21   image1920×960 32.1 KB    Scope of this round RetroPGF round 2 will distribute 10 million OP tokens to public goods that support development and usage of the OP Stack. Work may be nominated in one of three categories:   Infrastructure + Dependencies: software used to build or deploy the OP Stack; contributions to protocols or standards upon which the OP Stack runs; experiments that support future development of the core OP Stack protocol.   Tooling + Utilities: work that helps builders create applications on Optimism mainnet, build on the OP Stack, interact with governance of the Collective, or use applications built on Optimism.   Education: work to spread awareness and knowledge of how Optimism works, whether technically or socially.   Note: The OP Stack refers to the OSS code powering Optimism. Today, this means the Optimism monorepo and its dependencies. Eligible projects need not be exclusive to the Optimism ecosystem, but there should be a connection. For example,   go-ethereum is an important dependency of the OP Stack, but is not Optimism-specific.  Ethereum L2 explorer pages which give stats on various L2s provide educational impact for the OP Stack, but are not Optimism-specific    How to Nominate a Project You can nominate projects by category on the below forum posts:   Nominations for Infrastructure + Dependencies   Nominations for Tooling + Utilities   Nominations for Education   Note: These threads will be moderated to only include nominations for projects. Comments that show support or hype for a project will be removed to keep the thread clean. If you want to show your excitement for a nomination, smash the  reaction! If you’re interested in more conversations around the nomination process jump into the Discord Channel. Things to consider when nominating a project:   Try to describe as best as you can how this project has delivered impact relating to the scope of this round.   Make sure to nominate projects in the relevant category   Before nominating a project please see if this project has been nominated already, so we can avoid duplication.   For Projects:   If you’re a project looking to participate in this round please have a read of the Project Manual, it has an overview of the process and an FAQ section to answer questions that might come up.   For your project to be eligible you will need to opt into the round and complete a project profile in the RetroPGF application manager by Feb 21 - 19:00 GMT. This will include providing more information about your project and verifying your Github or Twitter account. The application manager will be launched by end of Jan, more details to follow on this soon!   Any project without a correctly verified GitHub or Twitter account, any project impersonating another team, any project not relating to the scope of the round, or any project without a complete profile may be hidden from the voting round at the Foundation’s discretion.   Projects are allowed to nominate themselves.   Here the term “project” can describe work that has been done by both an individual or a group.   Collections, a term used to describe projects without a single person or entity that can be verified via GitHub or Twitter, may only be nominated by the Optimism Foundation.   RetroPGF is an experiment that Optimism plans to iterate on regularly. Community feedback is key to helping the process improve with each round. We welcome your notes, reflections, and feedback at any step. Please use this forum post to submit feedback! The Foundation will run a public community retrospective after the round ends. Project Nominations will close by Jan 31 19:00 GMT ",
                    "links": [
                        "https://community.optimism.io/docs/governance/retropgf-2/#",
                        "https://optimism.mirror.xyz/wqk1Yeyn2OhV9paDzbRXvQ0m0JYDu2npbSkMClwk1rY",
                        "https://community.optimism.io/docs/governance/retropgf-2/#",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/9/92641e36df38e211a100c529eb4a756c9d3001d6.png",
                        "https://gov.optimism.io/t/infrastructure-dependencies-nominations-for-rpgf2/4637",
                        "https://gov.optimism.io/t/tooling-utilities-nominations-for-rpgf2/4639",
                        "https://gov.optimism.io/t/education-nominations-for-rpgf2/4640",
                        "https://discord.gg/3UZeg3cY",
                        "https://www.notion.so/oplabs/Optimism-RetroPGF-2-Project-Manual-0a2e741133cd49b0b005ff759934b998",
                        "https://app.optimism.io/retropgf-manager",
                        "https://gov.optimism.io/t/community-feedback-on-retropgf2/4641",
                        "https://gov.optimism.io/t/infrastructure-dependencies-nominations-for-rpgf2/4637",
                        "https://gov.optimism.io/t/tooling-utilities-nominations-for-rpgf2/4639",
                        "https://gov.optimism.io/t/education-nominations-for-rpgf2/4640",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/35",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/32"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.468026538678712
                },
                {
                    "author_link": "https://gov.optimism.io/u/Jonas",
                    "index": "2",
                    "likes": "0",
                    "time": "17/01/2023-20:31:18",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Jonas",
                    "index": "3",
                    "likes": "0",
                    "time": "17/01/2023-21:02:52",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "423"
}