{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/delegate-rebalance-debate/4408",
            "title": "Delegate rebalance debate ",
            "index": 4408,
            "category": [
                "\\xf0\\x9f\\x8f\\x9b Governance"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "1",
                    "likes": "12",
                    "time": "27/12/2022-21:08:25",
                    "content": "I want to tinker with the idea of limiting delegates voting power to avoid centralization and promote new delegate inclusion and more diverse forum activity. To avoid redelegation apathy from token holders this could be a Delegate activity instead. Simple example: Delegate voting cap: 500.000 OP This means “Linda Xie”, who has 2,071,535 OP delegated, can redelegate 1,571,535 to uncapped delegates. This can be easily implemented on this tool:  https://optimism.showkarma.xyz/  And even set up a forum email inviting caped delegates to redelegate the excedent of their voting power. Does this sound like a good or terrible idea? ",
                    "links": [
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/25"
                    ],
                    "GPT-summary": "The author is proposing to limit delegates' voting power to avoid centralization and promote new delegate inclusion. The proposal suggests a delegate voting cap and provides an example of how it could be implemented. The author is asking for feedback on the idea.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.835497835497836
                },
                {
                    "author_link": "https://gov.optimism.io/u/blairdrop.eth",
                    "index": "2",
                    "likes": "3",
                    "time": "28/12/2022-04:55:15",
                    "content": "I think it’s a great idea with multiple pros and no cons. Would appreciate any rebuttals however. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/diligit",
                    "index": "3",
                    "likes": "3",
                    "time": "28/12/2022-10:35:45",
                    "content": "Voting power is the result of the work of each delegate (directly or indirectly). Plus recently Token House voted the ‘Protocol Delegation Program’ proposal which will introduce new entities that will hold 5M or no more than 1/3 of the total votable supply, which will contribute to decentralization. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.986363636363636
                },
                {
                    "author_link": "https://gov.optimism.io/u/hastings8",
                    "index": "4",
                    "likes": "0",
                    "time": "04/01/2023-00:08:07",
                    "content": "I 100% agree! I don’t know this person! Do you know this person? Here’s my my concern is they more op. Cool mad props! However luck plays a larger role with that. Being at the right place at the right time. So my argument is what make he or she’s  input more valuable than mine or vs versa! I’m not saying everyone one should be equal by no means. However limiting that power to give a few 1000 new voices a chance to be heard would a heck of a lot more valuable to me. Because  everyone’s voice or opinion obviously means absolutely nothing if they have no equal power to voice there opinion on a serious level. It’s a community everyone apart of it should be able to contribute opinions equally and fairly! Kind of like freedom of speech. Or it is no better than centralized exchanges!! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.599364177489178
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "5",
                    "likes": "3",
                    "time": "04/01/2023-02:28:48",
                    "content": "    diligit:  Voting power is the result of the work of each delegate (directly or indirectly).   I agree on this statement. But at the same time some of this huge delegates don’t have the time to catch up with the forum. What they can do is trust some of their voting power to delegates of their choosing and create a more diverse community and point of view. At the same time watching 5 to 7 delegates on snapshot “whaling” their votes to approve proposals or seeing someone on the top 10 badgeholders with 3.9M votes where 65% of the votes are given by himself it’s not that apealing for a decentralized advocate community. As I said this is a post to tinker with the idea, not a formal proposal, I would love to read a strong case against it to understand why am I wrong. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 6.074074074074074
                },
                {
                    "author_link": "https://gov.optimism.io/u/devenmatthews.eth",
                    "index": "6",
                    "likes": "2",
                    "time": "04/01/2023-06:27:05",
                    "content": "Just want to mention it would be v easy for a large delegate to reroute this “extra” voting power to other addresses they control. There isn’t strong social pressure to not do this. Not saying this will happen, but a possibility. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.989285714285715
                },
                {
                    "author_link": "https://gov.optimism.io/u/diligit",
                    "index": "7",
                    "likes": "1",
                    "time": "04/01/2023-10:30:35",
                    "content": "I love discussing ideas.     Gonna.eth:  But   The current voting power of each delegate is not the result of one day, it is the result of years. Delegates are active, and each person has delegated OP tokens to a delegate for their vision, knowledge, experience. And each delegate has my admiration and respect for the trust they have received from hundreds and thousands of people. And regarding Citizens House badges, likewise, if people have delegated OP tokens to a particular delegate, they agree and trust that in the first retroPGF iterations their delegates will vote rationally and in the best interests of the Optimism Collective.     Gonna.eth:  a strong case against   The best argument is math (and experience)) We can look at this idea in perspective, any delegate who redistributes voting power to other people will discredit themselves. And there are many people writing on the OP server, in support, who want to delegate to a particular delegate.     Gonna.eth:  to understand why am I wrong.   Why not, I love ideas, research and experiments: each delegate, regardless of voting power, 1M, 100k or 10k, can determine the effect of this idea on himself, as many people do not have either 10k or 1k voting power OP, as an idea, Dhannte you have 80k+ voting power, redelegate 70k to 7 people who do not have this voting power, as you mentioned, ‘to create a more diverse community and point of view’ and based on this experience each delegate will personally decide if it is an idea that can be implemented. ***But consider that there were people who wrote in support, and wanted to delegate their tokens specifically to you. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.252604166666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "8",
                    "likes": "2",
                    "time": "04/01/2023-11:48:23",
                    "content": "Thank you @diligit for taking the time to contradict me. I think this summarizes it perfectly:     diligit:  each delegate has my admiration and respect for the trust they have received from hundreds and thousands of people   Any voting power modification we do has to respect the token holder delegation or we will end up delegitimizing the whole governance process. I’ll have to tinker with new ideas with this as a fixed variable. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 6.795454545454546
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "9",
                    "likes": "0",
                    "time": "04/01/2023-11:51:57",
                    "content": "Well, they have to create a whole new delegate (commitment, Twitter account, etc), but yeah this is 100% possible and we will end up looking for ways to avoid it and add complexity layers we don’t need. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5606060606060606
                },
                {
                    "author_link": "https://gov.optimism.io/u/diligit",
                    "index": "10",
                    "likes": "1",
                    "time": "04/01/2023-17:17:37",
                    "content": "This is not a contradiction, this is a constructive discussion in which you have come to a summary:     Gonna.eth:  Any voting power modification we do has to respect the token holder delegation or we will end up delegitimizing the whole governance process.   You are welcome!  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Oxytocin",
                    "index": "11",
                    "likes": "2",
                    "time": "04/01/2023-23:14:32",
                    "content": "I like the idea of encouraging delegate diversification, but I feel that delegates sub-delegating might not be the best way to go. People select a delegate for their experience and opinions, and while we expect the sub-delegate to be someone with views aligned with them, this alignment most likely won’t be for 100% of issues (if it is, then in the end it’s not really helping with diversification). Also, if the delegate handpicks their sub-delegate, even if they don’t sub-delegate to themselves it’s likely that they will delegate someone close to their circle, thus really not solving the decentralisation issue. However, as @diligit already mentioned, Programmes like the Protocol Delegates are an interesting idea, and perhaps the Token House could have a diverse set of delegates by having similar  specific delegate positions for other niches. Maybe we could use a delegate’s ‘Voting surplus’ to delegate towards these niche delegators? This however contradicts the ongoing discussion of respecting the token holder’s delegation, so I don’t think it could work. Another idea (although probably not the best) could be removing/filtering delegates above a threshold from the delegates frontend page. This threshold can be higher than what the ideal delegated amount is to avoid people being barely filtered out and then undelegated (so for example, the ‘soft cap’ is 500k OP, but to be filtered out you’d need more than 600k). I feel this idea could work to limit the growth of delegates with too much voting power, but it’ll need a considerable amount more of delegating activity to fix itself over time. Really interested to see what other ideas come up here, I feel this issue is common in most governance with delegates so I wanna see how this goes  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.195652173913043
                },
                {
                    "author_link": "https://gov.optimism.io/u/blairdrop.eth",
                    "index": "12",
                    "likes": "1",
                    "time": "06/01/2023-07:13:51",
                    "content": "Thank you for all of your replies in this thread. I still can’t get my head around how a 33% voting power cap could be considered anywhere near good enough. I have no doubts that the top delegates are good actors and are positive driving forces, but if one person makes up 33% of the work out of the entire community, that community doesn’t sound very healthy. Long term, I don’t think I’d feel comfortable with anyone holding more than 10-15%. Any more than that feels like it would defeat the purpose of this all. I hope I’m not misunderstanding anything here. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.779720279720279
                },
                {
                    "author_link": "https://gov.optimism.io/u/diligit",
                    "index": "13",
                    "likes": "1",
                    "time": "06/01/2023-13:12:34",
                    "content": "At the moment no delegate has more than 10% voting power.   dune.com    Optimism | OP Token House - Delegate Voting Weight Tracker 🔴🏛 Blockchain ecosystem analytics by and for the community. Explore and share data from Ethereum, xDai, Polygon, Optimism, BSC and Solana for free.      ",
                    "links": [
                        "https://dune.com/optimismfnd/optimism-op-token-house"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 7.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/diligit",
                    "index": "14",
                    "likes": "2",
                    "time": "06/01/2023-13:16:19",
                    "content": "And if a delegate will have 33% I am sure that Token House and the Optimism Foundation will not accept such a situation. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/blairdrop.eth",
                    "index": "15",
                    "likes": "3",
                    "time": "07/01/2023-22:02:58",
                    "content": "Oh good, I didn’t realize that. Maybe it would be easier to implement a lower voting power ceiling now compared to if/when it gets more centralized. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/piliajumar1",
                    "index": "16",
                    "likes": "0",
                    "time": "09/01/2023-13:41:02",
                    "content": "I think it is a great idea. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/AkmBrahim",
                    "index": "17",
                    "likes": "0",
                    "time": "10/01/2023-11:42:30",
                    "content": "yes I totally agree and this is the basis of decentralization … ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "400"
}