{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/draft-gf-phase-1-proposal-search-finance/5076",
            "title": "[DRAFT][GF: Phase 1 Proposal] Search Finance ",
            "index": 5076,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Grants Council"
            ],
            "tags": [
                "cycle-10",
                "not-passed"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/GrantsOps",
                    "index": "1",
                    "likes": "1",
                    "time": "03/02/2023-01:36:28",
                    "content": "Project name: Search Finance Author name and contact info (please provide a reliable point of contact for the project): George Beall george.philip.beall@gmail.com I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: Yes I understand that I will be expected to following the public grant reporting requirements outlined here: Yes L2 recipient address: 0x22aA1F4173b826451763EbfCE22cf54A0603163c Which Voting Cycle are you applying for?: Cycle 10 Which sub-committee should review your proposal? (Builders Grants, Growth Experiment Grants): Builders Grants Project description (please explain how your project works): We are building on-chain lending markets for small and medium businesses.Businesses mint equity tokens which have real legal recourse over the business and its assets via legal wrappers and contracts. Auditors get access to necessary financial data feeds and issue live feeds of verifiable credentials for the business’s financial statements. A DAO votes on underwriting parameters for valuing the equity tokens (P/E ratio, liquidity discount, approved/required financial data points). This then determines what the DAO believes they could liquidate the business for in a short-term sale.These equity tokens now have a live, verifiable, risk-adjusted, on-chain value. Business owners can then lock these tokens as collateral in a lending pool and begin to accept lenders via an overcollateralized lending mechanism.For example: I buy a business at $1M, the DAO determines I correctly valued the business at $1M based on the financials, but applies a 30% liquidity discount to ensure in the case of default they can sell the asset and keep lenders whole. From there my risk-adjusted collateral value is $700K. If the collateralization ratio is 2X, I can get $350K of debt for my business. Website: none Twitter: none Discord/Discourse/Community: none Other relevant links (including any demos): Additional team member info (please link): https://twitter.com/0xfuturistichttps://twitter.com/sachit_sachdev Please link to any previous projects the team has meaningfully contributed to: Everipedia, Commonwealth, Gradient Relevant usage metrics (TVL, transactions, volume, unique addresses, etc. Optimism metrics preferred; please link to public sources such as Dune Analytics, etc.): none Competitors, peers, or similar projects (please link): Maple Finance, Lending Club, Goldfinch, Pipe Is/will this project be open sourced?: In the Future Optimism native?: No Date of deployment/expected deployment on Optimism: 7/31/2023 What is the problem statement this proposal hopes to solve for the Optimism ecosystem?: We want to create a DeFi project that solves real borrower problems and creates sustainable yield for lenders. High, sustainable yields are the backbone for a strong DeFi ecosystem. How does your proposal offer a value proposition solving the above problem?: Sustainable DeFi yields are currently 1-4% across all ecosystems. We are able to deliver 6-15% yields backed by tangible, profitable businesses. Why will this solution be a source of growth for the Optimism ecosystem?: DeFi has been one of the largest drivers of on-chain activity over the last few years and is one of the clearest sources of PMF for crypto. Optimism’s DeFi ecosystem is currently lagging behind that of its competitors. We can help drive bringing TVL onto Optimism and build a DeFi ecosystem around our lending markets. Has your project previously applied for an OP grant?: no Number of OP tokens requested: 50000 Did the project apply for or receive OP tokens through the Foundation Partner Fund?: No If OP tokens were requested from the Foundation Partner Fund, what was the amount?: N/A How much will your project match in co-incentives? (not required but recommended, when applicable): N/A How will the OP tokens be distributed? (please include % allocated to different initiatives such as user rewards/marketing/liquidity mining. Please also include a justification as to why each of these initiatives align with the problem statement this proposal is solving.): We will use 100% of the tokens to boost the yields for lenders. We anticipate having an MVP launched in 6-9 months. Tokens will be offered to lenders who locked their capital in specific lending pools for 1+ years. Tokens will begin to be vested once they unlock after 1 year. Over what period of time will the tokens be distributed for each initiative? Shorter timelines are preferable to longer timelines. Shorter timelines (on the order of weeks) allow teams to quickly demonstrate achievement of milestones, better facilitating additional grants via subsequent proposals: Our goal will be to allocate the full grant in our first month of launch. The tokens will slowly vest to lenders over the course of the loan. Please clearly define the milestones you expect to achieve in order to receive milestone based installments. Please consider how each milestone relates to incentivizing sustainable usage and liquidity on Optimism. Progress towards each milestone must be trackable: We will launch an MVP of our product in 6-9 months. Once launched we will onboard 1-3 businesses for an initial demonstration of the lending product. Once these businesses launch their credit pools, we will look to receive the token grant. Why will incentivized users and liquidity on Optimism remain after incentives dry up?: Even our base case yield is higher and more sustainable than traditional DeFi (and even much of tradfi). The token incentives will allow us to grow a bit quicker and helps solve the cold start problem, but the fundamental value of the product does not rely on incentive schemes. Please provide any additional information that will facilitate accountability (smart contracts addresses relevant to the proposal, relevant organizational wallet addresses, etc.): N/A Confirm you have read and agree to the Eligibility Restrictions (here): I have read the Eligibility Restrictions and agree to abide by their conditions ",
                    "links": [
                        "https://twitter.com/0xfuturistic",
                        "https://twitter.com/sachit_sachdev",
                        "https://gov.optimism.io/t/grant-proposal-template/3233"
                    ],
                    "GPT-summary": "The post is a draft proposal for a DeFi project called Search Finance, which aims to create on-chain lending markets for small and medium businesses. The proposal explains how the project works, its value proposition, and how it can help drive growth for the Optimism ecosystem. The post also includes information about the author, team members, and previous projects, as well as details about the grant requested and how the tokens will be distributed. The post may benefit from constructive criticism and auditing by third parties, and it may also prompt questions about the project.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Token economics",
                        "Interoperability and Scaleability",
                        "Law and regulations",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.320144797731005
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "2",
                    "likes": "1",
                    "time": "14/02/2023-01:35:31",
                    "content": "As planned, this squarely falls under growth experiments; you’re offering liquidity mining incentives in an effort to boost users. It also would suffer under the one-year lockup rule, as you would not have access to the grant until well into your planned launch. My suggestion is to resubmit this for the next cycle and to substantiate the proposal somewhat with more materials underlying the go-to-market plan here - there are a lot of questions that need answering when you’re dealing with RWAs in particular, given, at minimum, the legal realities such protocols face. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.866666666666667
                }
            ]
        }
    ],
    "group_index": "515"
}