{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/token-house-badgeholder-election-information/4195",
            "title": "Token House Badgeholder Election Information ",
            "index": 4195,
            "category": [
                "\\xf0\\x9f\\x8f\\x9b Governance",
                "Elections"
            ],
            "tags": [
                "rpgf"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/system",
                    "index": "1",
                    "likes": "27",
                    "time": "06/12/2022-19:10:18",
                    "content": " Please refer to the Badgeholder Nominations Roundup for the final list of valid nominations  As part of the recently announced retroPGF 2, voting badges will be distributed to a set of 90 community members. One voting badge will be given to 10 Token House delegates. The post below outlines what this means for Token House delegates. From December 8th - December 14th:  Each delegate with greater than >0.5% voting power may nominate 2 Token House delegates to be badgeholders for rPGF 2. Each of the 10 elected Token House delegates will be able to distribute an additional badge to an individual of their choosing If you have >0.5% votable supply and would like to nominate a delegate, please complete the template below and post to this forum thread by December 14th at 7pm GMT There is no voting power requirement for nominees, but nominees must have posted a delegate commitment by 12/5/2022. Delegates may not nominate themselves Please note that holding a voting badge for one round does not guarantee voting rights in subsequent rounds; Citizenship criteria are subject to change going forward If an elected Token House delegate is or becomes ineligible to receive a badge (ie. if they will receive a badge based on other criteria or become a member of the Optimism team), the elected badgeholder will select a replacement to receive their badge instead.  From December 15th - December 21st:  The Token House will vote to select 10 badgeholders from the full list of nominees. This vote will occur via approval voting on Snapshot. Voting is set up such that you can place a vote for any number of nominees. The 10 nominees with the most votes will receive voting badges for rPGF2. This is approval voting, not ranked choice, meaning each selected choice will receive equal voting power.  From January 3rd - Jan 17th:  Anyone can nominate a project or person for funding in rPGF 2, following the process outlined here   From January 31st - February 10th:  Token House delegate badgeholders will vote on which projects receive rPGF in round 2   Token House Badgeholder Nomination Template  Nominating delegate: Link to delegate commitment: Link to verify delegation of >0.5% of the votable supply: Name of delegate you’d like to nominate: Link to nominee’s delegate commitment: Why do you believe this delegate should receive an rPGF 2 voting badge?  ",
                    "links": [
                        "https://optimism.mirror.xyz/wqk1Yeyn2OhV9paDzbRXvQ0m0JYDu2npbSkMClwk1rY",
                        "https://gov.optimism.io/t/token-house-badgeholder-nominations/4196",
                        "https://gov.optimism.io/t/delegate-commitments",
                        "https://docs.snapshot.org/proposals/voting-types",
                        "https://optimism.mirror.xyz/wqk1Yeyn2OhV9paDzbRXvQ0m0JYDu2npbSkMClwk1rY",
                        "https://gov.optimism.io/t/token-house-badgeholder-nominations/4196",
                        "https://gov.optimism.io/t/badgeholder-nomination-roundup/4315",
                        "https://gov.optimism.io/t/special-voting-cycle-9a-grants-council/4198",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/23"
                    ],
                    "GPT-summary": "The post explains the process for selecting badgeholders for the Token House in the upcoming retroPGF 2. It outlines the timeline for nominations, voting, and the selection of projects for funding. The post also provides a template for delegates to nominate other delegates for badgeholder positions. There is no entirely positive or negative feedback given, but there is constructive criticism in the form of eligibility requirements and the possibility of changes to citizenship criteria. The post does not advertise the proposal, nor does it suggest collaboration.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.349537037037038
                },
                {
                    "author_link": "https://gov.optimism.io/u/MinimalGravitas",
                    "index": "2",
                    "likes": "12",
                    "time": "07/12/2022-07:55:56",
                    "content": "How exciting, it’s great to see the Citizen House starting to come together! I think that it was this unique feature of Optimism’s governance that made it seem so interesting to so many of us! As a quick question, if the people who were involved in RPGF1 automatically get membership, could we get a list of who is in that category? I’ve got a couple of ideas for who to nominate, but don’t want to ‘waste’ my votes if they’re in already! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.154761904761905
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "4",
                    "likes": "9",
                    "time": "07/12/2022-22:56:24",
                    "content": "List of rPGF1 badgeholder is linked in Review of Optimism retro funding round 1: Optimism RPGF 1 Results - Google Sheets ",
                    "links": [
                        "https://docs.google.com/spreadsheets/d/1g4ilAByMNQsmlBC8cskQip7Ojd_qK6IhozJCyoVfU9k/edit#gid=0"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/MinimalGravitas",
                    "index": "5",
                    "likes": "2",
                    "time": "08/12/2022-06:24:34",
                    "content": "Amazing, thanks for that! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.125
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "6",
                    "likes": "5",
                    "time": "15/12/2022-17:31:37",
                    "content": "Updated to account for possible edge case:  If an elected Token House delegate is or becomes ineligible to receive a badge (ie. if they will receive a badge based on other criteria or become a member of the Optimism team), the elected badgeholder will select a replacement to receive their badge instead.  Updated to include clarification on approval voting:  Voting is set up such that you can place a vote for any number of nominees. The 10 nominees with the most votes will receive voting badges for rPGF2. This is approval voting, not ranked choice, meaning each selected choice will receive equal voting power.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.375
                },
                {
                    "author_link": "https://gov.optimism.io/u/katie",
                    "index": "7",
                    "likes": "8",
                    "time": "16/12/2022-06:05:28",
                    "content": "I wasn’t entirely sure how to proceed here so I voted for my top 10 nominees. This was difficult because every single nominee really is a stellar candidate, so limiting it to 10 was tough. On the other hand, having so many excellent candidates is a great problem to have and I’m so grateful to be surrounded by some of the best minds in the space . ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.5748556998557
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "8",
                    "likes": "7",
                    "time": "18/12/2022-01:02:15",
                    "content": "Okay so this was a tough one. Since there is so many awesome candidates, and I myself am also a candidate  I opted to not vote for myself (though some of my delegators told me otherwise). I kept it simple and voted for the people I nominated. I intended to also nominate Joxes and as such I also voted for him. So I voted for @jackanorak, @krzkaczor and @SEED_LATAM_Joxes ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.3425925925925934
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "9",
                    "likes": "7",
                    "time": "18/12/2022-03:16:27",
                    "content": "Choosing top 10 was a tough one, few are already quite known in public good space, working, supporting, preserving and motivating others to contribute. So to give everyone a fair chance, I read there delegation pitch and gone through their profile/comment history on this forum. If they have mentioned Public Good funding in their delegate pitch, I put them on top of list, followed by their interaction with Public Goods related topic/post on this forum in past season(s) and lastly there interest (giving preference to DAOs and Social Impact). Voted for:- Kris, Linda, SJP, MinimalGravitas, Dhante, Joxes, Bobby, Jrocki, Polynya and Scott. (as I am also nominated, opted not to vote for myself) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.848148148148148
                },
                {
                    "author_link": "https://gov.optimism.io/u/polynya",
                    "index": "10",
                    "likes": "9",
                    "time": "18/12/2022-04:20:05",
                    "content": "I was initially choosing to Abstain as I’m nominated. Even though I’d never vote for myself, I can still reshuffle the order somewhat to benefit me. However, I’ll be voting for who I feel are the most engaged community members who are being undervalued. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/Tbattish",
                    "index": "12",
                    "likes": "1",
                    "time": "19/12/2022-23:17:31",
                    "content": "Amazing, Thanks for that. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/SEED_LATAM_Joxes",
                    "index": "13",
                    "likes": "5",
                    "time": "21/12/2022-15:41:07",
                    "content": "I want to share here from our communication thread what is our vision, approach and wishes about Citizen House and the next round of RPGF:  Citizen House, Public Goods, why LATAM and Optimism  And, the current voting round:  About Badgeholder Nomination Voting  ",
                    "links": [
                        "https://gov.optimism.io/t/defi-latam-delegate-communication-thread/2950/17"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.6000000000000005
                },
                {
                    "author_link": "https://gov.optimism.io/u/rosolnilsent",
                    "index": "14",
                    "likes": "0",
                    "time": "08/01/2023-15:43:04",
                    "content": "Amazing, thanks for all. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                }
            ]
        }
    ],
    "group_index": "366"
}