{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/builders-cycle-11-acurast-universal-interoperability/5599",
            "title": "[Builders, Cycle 11]: Acurast - Universal Interoperability ",
            "index": 5599,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Grants Council"
            ],
            "tags": [
                "builders",
                "cycle-11"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/Pascuin",
                    "index": "1",
                    "likes": "2",
                    "time": "14/03/2023-10:28:12",
                    "content": " Basic Details  Project name:  Acurast - Universal Interoperability  Author name and contact info (please provide a reliable point of contact for the project.): Pascal Brun, Co-Founder of Acurast (Discord: Pascal#2765, Telegram: @Pascuin)  L2 recipient address: 0xb045920bb6d93CAF8aA8b2B712579d9D27cC1B5a  Which Voting Cycle are you applying for?: Season 3, Cycle 11  I confirm that I have read the landing pages for the Builders 8 and Growth Experiments 10 Sub-Committees and that I have determined my proposal is best suited to be reviewed by the Builders Sub-Committee: [Yes/No]: Yes  Project Details  What are you going to build?:  acurast-header1500×500 15.2 KB  The Universe in Web3 - Universal Interoperability Acurast is ultimately connecting worlds with its interoperability layer. By providing a trustless approach at interoperability between Web2 and Optimism and Web3 and Optimism. Enabling projects to get access to off-chain data, cross-chain data and computation and cross chain execution. Tapping into the resources of the web2 world for unlimited use cases and giving them to ability to trustlessly interact across chains with EVM and non-EVM ecosystems such as Polkadot, Tezos or Cosmos and others. With the launch of Acurast on Optimism, the Optimism ecosystem gets access to this powerful interoperability layer and gains the ability to become the home for entirely new use cases. Built on Optimism, powered by Acurast.  Acurast’s Interoperability Acurast is developing four main interoperability modules, with the first two under active development:  1 - Enterprise Giving access to the Web2 world, through Acurast’s confidential computing. Enabling use cases for Web2 <> Web2 and Web2 <> Web3 such as privacy preserving data sharing between two Web2 enterprise with bi-directional execution and giving Web3 projects access to off-chain data and computation.  2 - Hyperdrive Empower seamless cross chain communication, not focused on asset bridging but allowing any developer from any chain build with Acurast and bring multiple ecosystems together while building on Optimism.  3 - Singularity Leveraging the decentralized infrastructure of Acurast for confidential computing of AI inference models and training without exposing crucial data points.  4 - Mesh Utilize the capabilities of the Acurast Processors, based on mobile devices, to interact with IoT devices for collecting and bringing IoT data to the Web3 world.  How Acurast can enable interoperability in these areas By leveraging Trusted Execution Environments (TEEs) in Android mobile devices, Acurast is a completely decentralized computing environment where anyone can participate. Infrastructure providers in Acurast, can offer their computational resources and earn rewards from Data Consumers, that pay for computation of their use cases. Through this infrastructure layer, each computation is completely verifiable on-chain as Processors create a Proof of Execution in addition to their provided output. Through the dedicated Acurast Marketplace protocol, Consumers and Processors are brought together in a completely self-service and trustless way. Empowering developers to define their use cases in the accessible Javascript language, for example fetching data from APIs, one enterprise sharing data in a privacy preserving way with another enterprise or giving non-Optimism users the ability to interact with applications built on Optimism. With the universal generic approach that Acurast offers, the use cases that can be supported are endless and only limited by the imagination of builders.  Acurast’s architecture  The flow of a Consumer requesting resources on the Marketplace and being matched with Processors that then provide the verifiable output on Optimism, ready for the application.1500×500 13.2 KB  The flow of a Consumer requesting resources on the Marketplace and being matched with Processors that then provide the verifiable output on Optimism, ready for the application. Consumers Projects that have a need for computation to utilize the universal interoperability for any use case. Processors The Processors are the core infrastructure providers of Acurast, utilizing dedicated Android devices, these network participants provide their computational resources for a reward. Acurast Marketplace The Acurast Marketplace is a purpose built protocol, for bringing Consumers and Processors together in a self-service way.  Consumers can create Acurast Jobs, with their Javascript written instruction, additional parameters such as Service Level Agreement components like uptime etc. Consumers pay Processors for the execution of their Acurast Jobs Processors can onboard themselves within 5min or less to the Acurast Marketplace and start providing their infrastructure A Job create by Consumers are automatically matched with Processors based on parameters both have defined The Marketplace has its own reputation system that ensures availability of the Processor devices and punishes offline devices  Optimism Destination and Proxy The Destination smart contract on Optimism is used to provide the verifiable outputs of Acurast Jobs by the Processors. Consumers can either use this contract as a destination or implement the same logic in their own smart contract suite to get a response by the Processor within their environment. The Proxy smart contract on Optimism is used to, natively on Optimism, gives consumers the ability to create jobs on the Acurast Marketplace.  Why is what you are going to build going to succeed?: Acurast grew out of the need for a DeFi platform that required access to index price data, the first version of Acurast was built as a bespoke solution to address this problem. It became clear that access to verifiable and trustless off-chain data and computation as well as seamless interoperability between various ecosystems was not only relevant for this specific platform. After numerous conversations with teams that communicated the dire need for such a solution, we set out to build Acurast with interoperability at its core and to enable developers to gain access to a true and universal interoperability layer, connecting worlds. Acurast is already today being used by various projects that leverage the generic approach at getting access to off-chain data, computation, and cross chain communication.  Is your project likely to bring new builders to the Optimism ecosystem? If so, please describe how: Yes, through Acurast, completely new use cases can be developed that previously were not possible due to the fact that web2 data, computation or interactions with another ecosystem become possible.  Is your project likely to improve the quality of developers in the Optimism ecosystem? If so, please describe how: Yes, developers will have an easy way to get access to off-chain computation that they can tailor to their usecase, without any centralized party having to become involved. Giving them the ability to create new computational jobs within minutes and completely self-serviced on the Acurast Marketplace, that then are automatically matched with Processors and executed.  Is your project likely to improve the commitment of developers in the Optimism ecosystem? If so, please describe how: Yes, developers can profit from Optimism’s fast and low-cost value propositions, while utilizing known tools for their applications such as Solidity and profiting from Acurast’s flexibility. Allowing them to build applications on Optimism for entirely new use cases, empowered through Acurast’s interoperability layer.  Provide us with links to any of the following for the project: Website: https://acurast.com/ Github: Acurast · GitHub Twitter: http://twitter.com/Acurast Discord: Acurast Telegram: Telegram: Contact @acurastnetwork Youtube: Acurast - YouTube  Do you have any metrics on the project currently? (TVL, transactions, volume, unique addresses, etc. Optimism metrics preferred; please link to public sources such as Dune Analytics, etc.): As it is still an early stage for Acurast where we are focusing on building up the supporting layer to enable developers. The current focus is on onboarding a smaller community that can help us with a short feedback loop of refining Acurast, before ramping up business development. Acurast currently has around 40 active Data Transmitter devices, run by individuals but also entities such as Taurus, Mayhem Nodes or Iceberg Nodes. For the Data Consumers side, there are around 10 projects that are actively building on top of Acurast at this stage, one example would be the largest DeFi platform on Tezos with a TVL of USD 40M.  Who are your competitors?:  When using the use case point of view focused on price data (oracle): Chainlink, Band Protocol, Switchboard When using the computational resources point of view (confidential computing): Phala, Integritee, Super Protocol When using the interoperability point of view (asset transfer): Axelar, Wormhole  Overall, as these competitors are focused on certain areas that Acurast excels in, we see Acurast’s main competitors in Google Cloud and AWS.  What differentiates you from your competitors?: Acruast builds on a trustless infrastructure, powered by a decentralized network of computational power that is enabled by technology and cryptography without relying on a centralized party. Through its generic approach Acurast can enable numerous use cases, without the need to interact with anything else than Acurast’s Marketplace, bringing demand and supply for computational tasks seamlessly together in a completely self-serviced fashion. Acurast’s universal interoperability layer empowers anyone to truly connect worlds and build completely new use cases. Enabling inter-directional interoperability between:  Web2 <> Web2/Web3/AI/IOT Web3 <> Web3/Web2/AI/IOT AI <> Web2/Web3/IOT IoT <> Web2/Web3/AI  Ultimately connecting the legacy web2 world, connecting various ecosystems across chain and even be leveraged for AI or IoT devices.  Will your project be composable with other projects on Optimism? If so, please explain: Yes, Acurast will enable projects built on Optimism to get access to the Web2 and the Web3 world and leverage universal interoperability.  Team  Who are your founders?: Alessandro De Carli and Pascal Brun, Acurast is a project kick-started by Papers AG, a Swiss web3 venture studio. Alessandro completed a Master of Science of the University of Zurich in Management Information Systems and Services during that time he worked together with Dr. Christian Decker on what would become later known as the Bitcoin Lightning Network. After his studies and internships, Alessandro went to Credit Suisse as a Software Engineer where he led the Android team with a strong focus on mobile security frameworks. He Co-founded Papers with the focus on mobile security that then later transitioned into the Blockchain space. Pascal has a technical background in System Engineering at a Fortune 500 company, before Co-Founding Papers with a focus on User Experience before taking on a more operational role such as Business Development and Project Management. He has built up a large network in the Web3 space over the last few years.  What makes your founders well-positioned to accomplish your goals with this project (1-2 sentences on each)?:  Alessandro has the ability to have a clear vision for a solution to a problem, which combined with his vast technical knowledge creates immense value. Pascal has the ability to support Alessandro’s vision and make them more accessible to others through communication and leading teams to build usable products and applications for end users.   Tell us about the rest of your team (if there are more teammates):  Mike: The Mastermind. Background as a mobile security framework engineer at Credit Suisse and Suisse Re. Mastered the art of engineering perfect and secure software solutions. The sparring partner for all engineers. Rodrigo: The Doer. The veteran software engineer in all walks of software engineering. Tackles a problem headlong and develops the perfect solution. Simon: The Thoughtful. Defining software architecture that considers all circumstances, implementing and testing them with a focus on highest quality. Markus: The Salesman. Worked for Microsoft and Coresystems and successfully grew and exited his own company. Connects customer needs with developer talent.   Is this your first Web3 project?: No, we have vast experience in different Web3 projects on EVM and non-EVM chains alike. Papers AG, the team behind Acurast, was involved in development of various projects, smart contract auditing, developer tooling and built the following projects, which are daily used by thousands of users:   AirGap, a secure self custody wallet solution comprising of AirGap Vault and AirGap Wallet. The Vault securely stores your private keys on a spare offline phone and the Wallet interacts with the online world. Communication between the two apps are made vie QR code scanning.  Beacon, a customizable method to connect to multiple wallets over a decentralized network. Beacon currently powers most dApps on Tezos.  Youves, the biggest DeFi platform on Tezos, with more than USD 40M TVL.  E-Seal, a solution to electronically seal digital documents, leveraging blockchain technology to guarantee the authenticity of electronic documents. Currently running on NEAR and with upcoming multichain support.  Ecoo, a platform that enables anyone to create and control their own payment systems and loyalty programs, built on Tezos.   If not, what else have you built? (Share links, Github repository, or any other useful information.): As stated above we did build many Web3 projects, but we also build non Web3 projects like Hypergate, a fast, secure, and accessible Kerberos Single Sign On (SSO) solution for Android.  I understand that Builders grants are subject to a 1 year lock-up, as explained further in this post 2: [Yes/No]: Yes.  Is your project funded? If so, provide an estimate of how many months of funding runway your project has: Acurast has received grants from the Web3 Foundation and the Tezos Foundation and a commitment from Papers, giving the project a current runway of six months. We are also in the midst of raising a Seed round, upon closing, considerably stretching out the runway and giving us the ability to scale up the team and its efforts on all fronts.  Grant Request  What is the size of the grant request? (50k OP max): 42’000 OP  How do you justify the size of the grant? The efforts to be done can be divided in:  Requirements engineering, deployment and testing, rollout and initial marketing Business development, onboarding of Optimism projects   Roadmap  Describe in discrete steps your plan for accomplishing your project:  After successful grant acceptance, we will start with the requirement engineering process Development of the destination smart contracts and capability for Processors to interact with Optimism Development and deployment of the proxy smart contract with the capability to create Jobs from Optimism on the Acurast Marketplace Final accountability report can be expected to be delivered 2 weeks after the successful launch of Acurast on Optimism   Please provide any additional information that will facilitate accountability:(smart contracts addresses relevant to the proposal, relevant organizational wallet addresses, etc.)  Acurast’s GitHub organization Smart contracts addresses after deployment   Does your plan depend on the receipt of OP tokens?: We see a huge potential that Acurast can bring to Optimism but the priority for supporting the Optimism ecosystem depends on the receipt of this grant as we have to focus our resources at this stage in Acurast’s live cycle.  What is your plan for the use of the OP token after the 1 year lock-up?: The team behind Acurast has been historically involved in selected ecosystems, always with the goal to participate within these ecosystems with having something at stake. Exploring it’s potential for future innovations and for building products where we see a fit for our knowledge. We engage in a community and follow the community’s standards and ethics, which includes participation in staking, DeFi, governance or project funding.  Please provide benchmark milestones for this project. These milestones should guide the Optimism community on the progress of your project during the 1-year lock-up period.     Milestone Type Milestone Source of Truth     Benchmark 24 projects utilizing Acurast Acurast Marketplace    We expect at least 24 projects will build on Acurast within the first year and leverage Acurast’s interoperability layer for various projects, bringing new use cases to Optimism and further solidifying the foundation of existing projects. Within this year Acurast will invest in gaining brand recognition and push to become on top of mind for existing and new developers in the Optimism ecosystem. As the Acurast Marketplace is completely transparent and open, it can be used as the source of truth for anyone, to evaluate how many projects are actively building on Optimism and utilizing Acurast for their use cases.  Please define critical milestones for this project. Critical milestones are meant to show good-faith efforts to accomplish the project. Non-completion of these milestones could lead to revocation of remaining grant rewards.  Development     Milestone Type Milestone Source of Truth Deadline*     Critical Add Optimism support to the Acurast Processor Android mobile application.  GitHub & on-chain Month 2   Critical Develop, test and deploy Optimism Proxy contract, to receive verifiable outputs from Processors.  GitHub & on-chain Month 3   Critical Add Optimism support to the Acurast Marketplace, giving the ability to create Jobs with Optimism as the destination.  GitHub & on-chain Month 4   Critical Add Optimism Proxy support to the Acurast Marketplace. Giving developers the ability to create Jobs on Optimism and relaying them to the Acurast Marketplace, where they are matched and dispatched to Processors.  GitHub & on-chain Month 4    Deadline*: start time based on proposal acceptance  Marketing & Communication     Milestone Type Milestone Source of Truth Deadline     Critical Posts on all Acurast channels upon app store of the with Optimism support. Acurast Twitter, Telegram, Discord and Medium Month 4   Optional Joint marketing activities shortly ahead or after Optimism support. Ideally announced or held via/on Optimism channels (e.g. Twitter space on interoperability with Acurast and Optimism) TBD TBD     Optimism Relationship  Does your project solve a problem for the Optimism ecosystem?: Yes, with Acurast the Optimism ecosystem gets access to universal interoperability, giving developers in the Optimism ecosystem the ability to interact with the Web2 world, the Web3 world and leverage it for Artificial Intelligence or Internet of Things devices.  How does your proposal offer a value proposition solving the above problem?: By providing a ready to use solution for developers to seamlessly interact with the Acurast Marketplace and enabling them to create computational jobs for interoperability use cases.  Why will this solution be a source of growth for the Optimism ecosystem?: Because developers will be able to create solutions for completely new use cases by leveraging Acurast’s interoperability layer.  How committed are you (and your team) to building on Optimism?: We have closely followed the project since its inception, and we see the value proposition of Optimism with its fast and low-cost transaction as the perfect starting point for Acurast to become active in EVM environments. We know that Optimism has proven to be a future proof ecosystem with an impressive self-governance structure.  Is your project Optimism Native?: The Acurast Proxy and destination smart contracts are native on Optimism and the Processors are able to communicate directly with these smart contracts. But with Acurast’s core focus on interoperability and its way to enable projects to interconnect with each other to get access to off-chain data and computation within various ecosystems, the Marketplace itself is not native to Optimism. In the end each ecosystem where Acurast is active does not only profit from the developer tooling made available but can leverage the ever growing infrastructure of Processors and getting access to a vast amount of computational power. Whereas if this would be siloed and focused on one specific ecosystem, the available tools and infrastructure would only be a subset. Acurast can be used in the Polkadot and Tezos ecosystems and in the near future as well in Cosmos, NEAR and with other ecosystems on the long-term roadmap. We want Optimism to be the first EVM based chain, outside of the Dotsama ecosystem where Acurast is supported.  Confirmations  I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: [Yes/No]: Yes  I understand that I will be expected to following the public grant reporting requirements outlined here: [Yes/No]: Yes ",
                    "links": [
                        "https://acurast.com/",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/6/66aeb2f0b58befa5998a3dba8fcfabae54e03c2e.png",
                        "https://acurast.com/",
                        "http://github.com/Acurast",
                        "http://twitter.com/Acurast",
                        "https://discord.gg/wqgC6b6aKe",
                        "https://t.me/acurastnetwork",
                        "https://www.youtube.com/@acurast",
                        "https://airgap.it/",
                        "https://www.walletbeacon.io/",
                        "https://youves.com/",
                        "https://e-seal.ch/",
                        "https://www.ecoo.ch/",
                        "https://hypergate.com/",
                        "http://github.com/Acurast",
                        "https://github.com/Acuras",
                        "https://github.com/Acurast",
                        "https://github.com/Acurast",
                        "https://github.com/Acurast"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.571363263173607
                },
                {
                    "author_link": "https://gov.optimism.io/u/FractalVisions",
                    "index": "2",
                    "likes": "0",
                    "time": "14/03/2023-14:53:39",
                    "content": "I’m curious as to why a builders grant is needed if your project is not already deployed on Optimism. I also do not see any specific dates in the milestones for this proposal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/Pascuin",
                    "index": "3",
                    "likes": "1",
                    "time": "14/03/2023-15:20:22",
                    "content": "Appreciate your time for going through the proposal.  I’m curious as to why a builders grant is needed if your project is not already deployed on Optimism.  I’m not sure I entirely follow your question. Acurast does currently not have any capabilities to interact with Optimism. What we need to first to to make this happen:  Develop destination contract for Optimism Develop Processor functionality to communicate with Optimism Develop marketplace capabilities for Optimism based jobs Develop proxy contract for Optimism for job creation on the marketplace  Does that answer your question?  I also do not see any specific dates in the milestones for this proposal.  You’re right. I’ve added more details on milestones, let me know if that makes sense for you. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.428571428571428
                },
                {
                    "author_link": "https://gov.optimism.io/u/FractalVisions",
                    "index": "4",
                    "likes": "1",
                    "time": "14/03/2023-15:39:54",
                    "content": "Yes it does. From my understanding the builder grants are intended for teams that have already established a product on Optimism and are continuing to show their commitment to building on the network over the course of the time lock. We will have to wait for the designated council members to provide more feedback on behalf of this subject for clarification on this topic. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/Pascuin",
                    "index": "5",
                    "likes": "0",
                    "time": "14/03/2023-15:47:58",
                    "content": "From what I can read on Optimism Grants Council Notion page builders grants focus on:  … builders category are applications, tools, SDKs, hackathons, technical content, etc.  Couldn’t find any mention of existing products, but happy to wait on guidance from the council members on this. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/FractalVisions",
                    "index": "6",
                    "likes": "1",
                    "time": "14/03/2023-16:06:30",
                    "content": "I know that the money is in escrow and if the applicant doesn’t do what they say they are going to do then the funds will be clawed back. I’m imagining having a product on optimism to be able to receive one of these builder grants would increase the chances of approval as the Governance seeks highly dedicated and committed teams to help expand on top of the ethos that already exists. Incentivizing high level developers who are willing to invest in the ecosystem knowing that they receive the money after the time lock. I’d like to think lots of people are willing to build a product and make this commitment prior to applying for funding as well. Whether a project receives funding that is not native to optimism is completely up to the decision of the governance team who is in charge of this category. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.066666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/Pascuin",
                    "index": "7",
                    "likes": "0",
                    "time": "14/03/2023-16:25:32",
                    "content": "That makes sense and we really want to be able to provide value with Acurast in the Optimism ecosystem, that’s why we also took the time to write-up this proposal as we have been following the progress of Optimism for a long time an really see the value the low-cost and speed. Looking forward to hear more on this from the governance team! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.229166666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/opti.domains",
                    "index": "8",
                    "likes": "1",
                    "time": "14/03/2023-18:10:20",
                    "content": "Can I write an EVM smart contract to pass messages between Optimism and Ethereum using your protocol now at the current state? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5357142857142865
                },
                {
                    "author_link": "https://gov.optimism.io/u/Pascuin",
                    "index": "9",
                    "likes": "0",
                    "time": "14/03/2023-18:46:09",
                    "content": "Currently that’s not possible, there are some requirements to make this happen. First the Processors need to be able to interact with Optimism and Ethereum and the proxy contracts need to be developed and deployed and the Acurast protocol needs to be capable to interact with both of these proxies. Then passing messages between these two chains is one of the many use cases that Acurast can be used for. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.107142857142858
                },
                {
                    "author_link": "https://gov.optimism.io/u/Pascuin",
                    "index": "10",
                    "likes": "0",
                    "time": "20/03/2023-15:44:59",
                    "content": "Hey @kaereste @Gonna.eth @jackanorak @danelund.eth, just wanted to check if you would need anything else on this from our side. Looking forward to receive feedback! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "607"
}