{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/draft-gf-phase-1-proposal-apetimism-launchpad/3843",
            "title": "[DRAFT] [GF: Phase 1 Proposal] Apetimism Launchpad ",
            "index": 3843,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Governance Fund: Phase 1"
            ],
            "tags": [
                "cycle-8"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/nuuneoi",
                    "index": "1",
                    "likes": "0",
                    "time": "30/10/2022-14:47:38",
                    "content": "(topic deleted by author) ",
                    "links": [],
                    "GPT-summary": "The post is a draft proposal for the Apetimism Launchpad, with the author explaining the proposal. There is no feedback or collaboration mentioned in the post.",
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal",
                        "None"
                    ],
                    "Sentiment": 1.25
                }
            ]
        },
        {
            "thread_link": "https://gov.optimism.io/t/re-draft-gf-phase-1-proposal-apetimism-launchpad/3930",
            "title": "RE: [DRAFT][GF: Phase 1 Proposal] Apetimism Launchpad ",
            "index": 3930,
            "category": [],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/CryptVibez1",
                    "index": "1",
                    "likes": "0",
                    "time": "07/11/2022-06:04:35",
                    "content": "    [DRAFT][GF: Phase 1 Proposal] Apetimism Launchpad Governance Fund: Phase 1       Thank you for this proposal. We do need some boost in NFT and Metaverse domain.  Few point from my side:-   Do you have any dashboard/record on past project created using launchpad. I would suggest reduce the distribution time to 4-6 months. Hopefully by next season we will have more info on dev support, if not then please provide more info on 30% use. Are you also including dev work, buying new infra, if server cost then for how many months ? Would you able to provide a cost analysis for this i…     ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.053977272727273
                }
            ]
        },
        {
            "thread_link": "https://gov.optimism.io/t/draft-gf-phase-1-proposal-apetimism-launchpad/3852",
            "title": "[DRAFT][GF: Phase 1 Proposal] Apetimism Launchpad ",
            "index": 3852,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Grants Council"
            ],
            "tags": [
                "season-3",
                "cycle-10",
                "not-passed"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/nuuneoi",
                    "index": "1",
                    "likes": "36",
                    "time": "31/10/2022-07:55:15",
                    "content": "Project name: Apetimism Launchpad Author name and contact info: Sittiphol (nuuneoi#3790) (@nuuneoi) I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: Yes L2 recipient address: 0xCA29F50c585b8dB702c9728D7B2b7F54F8ffA8bB Which Voting Cycle are you applying for?: Phase 1, Cycle 9 Grant category: NFT Tools Is this proposal applicable to a specific committee? No Project description:  Screen Shot 2022-10-30 at 9.29.03 PM1018×1376 207 KB   Screen Shot 2022-10-30 at 9.29.48 PM2418×1314 317 KB  Apetimism Launchpad is a no-code NFT launchpad enabling NFT creators to launch their NFT project with ease along with the following capabilities:  Dedicated smart contract Highly tweakable Intuitive user experience Bot prevention Heavy load handling Zero down time Support for both free-mint and paid mint projects  Some add-ons are also planned to be built in the future around the launchpad, eg. “Burn NFT for WL”, which has already been used in one of our NFT project launched. Project links:  Website: Apetimism Launchpad  Twitter: https://twitter.com/apetimism  Discord/Discourse/Community: Apetimism  Please include all other relevant links below: Apetimism & Apebitrum | Twitter, Facebook | Linktree   Additional team member info (please link): - Please link to any previous projects the team has meaningfully contributed to: - Relevant usage metrics:   21 NFT projects launched so far during the close beta phase (even without a public launch yet).   30,000+ NFTs minted from our platform to date.   Got roughly about 3 requests a week to launch their NFT projects on our launchpad.   Competitors, peers, or similar projects (please link): https://speedboat.studio/, https://niftykit.com/ Is/will this project be open sourced? No Optimism native?: Yes Date of deployment/expected deployment on Optimism: Jul 29, 2022 Ecosystem Value Proposition:   What is the problem statement this proposal hopes to solve for the Optimism ecosystem? NFT is one of the major key factors that drive the growth of a blockchain. Anyway, given that majority of the NFT creators are an artist, the main barrier that block this kind of growth is; they don’t know how to smoothly launch their project. If we can eliminate this roadblock, it will definitely result in a positive side of blockchain growth.   How does your proposal offer a value proposition solving the above problem? We offer an exceptional tool enabling an artist to launch their NFT art project with zero knowledge on the coding side. Let’s say they just need to work on what they are good at, which is art, and let the rest be handled by us.   Why will this solution be a source of growth for the Optimism ecosystem? There is a tremendous demand to launch an NFT project on Optimism, but most artists are now blocked by tools that let them launch their projects with ease. We believe that we can help on this part and would drive the growth of Optimism ecosystem dramatically.   Has your project previously applied for an OP grant? No Number of OP tokens requested: 300,000 OP Did the project apply for or receive OP tokens through the Foundation Partner Fund?: No If OP tokens were requested from the Foundation Partner Fund, what was the amount?: N/A How much will your project match in co-incentives?: The fee to use Apetimism Launchpad is totally free for the free-mint project and 5% for the paid-mint one. We plan to reduce the fee just on Optimism to 4% once the incentive program has been kicked off. Proposal for token distribution:   How will the OP tokens be distributed?   210,000 OP (70%) would go to the incentive program to fund the paid-mint project. We would reduce the fee from 5% to 4% for an NFT project on Optimism and will provide a 1% cash back in OP to the project owner. This basically means that the net total fee the NFT project owner would be collected is just 3%. We believe that this key factor alone will encourage tons of artists to launch their projects on Optimism rather than on the other chain.   90,000 OP (30%) would be used to fund the development, including the operation cost, for example, server expense. We are a small team and do not have any funding source. Hence this part of fund is very important to us to make everything possible as planned.     Over what period of time will the tokens be distributed for each initiative? We expect 40 paid-mint projects to be launched through our Apetimism Launchpad each month. From our projection, each project will generate roughly 1.2 ETH revenue on the platform. As illustrated above, one-fourth will be cashed back to the project owner in OP; by calculation, it would be around 400 OP per project. As a result, 210000 OP would last about 12-18 months which is perfect timing to ignite the organic growth in the NFT space on Optimism.   Please list the milestones/KPIs you expect to achieve for each initiative, considering how each relates to incentivizing sustainable usage and liquidity on Optimism. Please keep in mind that progress towards these milestones/KPIs should be trackable.  We expect 1000 free-mint projects and 500 paid-mint projects to be launched by the next 12 months. We expect at least 3 million NFT to be minted from our platform by the next 12 months. We expect NFT creators to earn at least $1M in the primary sale from selling their NFTs on our platform by the next 12 months.    Why will incentivized users and liquidity on Optimism remain after incentives dry up? The incentive program is more like fuel to ignite the organic growth in the NFT space. We believe the incentive will not be needed anymore when the market is mature enough, which could happen by some help from the incentive program.   Product Status: Apetimism Launchpad is working perfectly on the production on a managed-service basis, as 21 projects have already been launched in the past 2 months. “Zero” major issues have been found so far. In the meantime, the self-serve version is now 90% done and will be released to let everyone deliver their NFT projects through our launchpad by themselves with ease very shortly. We believe this would be the perfect stage for the product for funding requests since the self-server version of the product is about to be publicly launched in a matter of weeks, and the incentive program would be a perfect match for the product launch that would ignite the growth of the NFT project on Optimism vastly. Please provide any additional information that will facilitate accountability:  Contract Address 0xBd574d99ca2adB02E83Fbd4730AEd59dbA09f01E | Optimism Contract Address 0xCBB9f019C217f4b36a10277eDd4CD6dd086f1408 | Optimism  ",
                    "links": [
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/c/c8cc92c53afd390de2061592c32a382ed8acf3c3.jpeg",
                        "https://apetimism.com/launchpad",
                        "https://twitter.com/apetimism",
                        "https://discord.gg/apetimism",
                        "https://linktr.ee/apetimism",
                        "https://speedboat.studio/",
                        "https://niftykit.com/",
                        "https://optimistic.etherscan.io/address/0xBd574d99ca2adB02E83Fbd4730AEd59dbA09f01E#code",
                        "https://optimistic.etherscan.io/address/0xCBB9f019C217f4b36a10277eDd4CD6dd086f1408#code"
                    ],
                    "GPT-summary": "The post is a proposal for a no-code NFT launchpad called Apetimism Launchpad, which aims to enable NFT creators to launch their projects with ease. The proposal includes details on the project, its features, and its value proposition for the Optimism ecosystem. The author also provides information on the team, relevant usage metrics, and competitors. The proposal requests 300,000 OP tokens to fund the project and outlines how the tokens will be distributed. The post also includes links to the project's website, Twitter, and other relevant links.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Smart contract updates",
                        "Interoperability and Scaleability",
                        "Token economics",
                        "Community and engagement"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.665974580974581
                },
                {
                    "author_link": "https://gov.optimism.io/u/Candy",
                    "index": "2",
                    "likes": "7",
                    "time": "31/10/2022-11:09:12",
                    "content": "Did have a good experience with Apetimism Launchpad during Justbanana NFTs Launch. 10,000 NFTs were minted in the same time smoothly. Should be a good Launchpad requiring certain conditions during minting i.e. several mint phases, Burnt NFT WL or Holder wallets finding for big collections. However, could you elaborate more on your plan on the funding for incentive program.  As we awared that free-mint projects become key players especially during the Bear market when NFT market is quiet. It would be nice if incentive program is included the free mint project too. Besides, the 1% cash back for paid mint project may not be too attractive if other competitors considers the same funding idea. Is there other options are considered for paid mint project incentive program? Anyways, nice to see good Launchpad promoted here ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.396258503401361
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "3",
                    "likes": "5",
                    "time": "31/10/2022-22:41:17",
                    "content": "Thank you for this proposal. We do need some boost in NFT and Metaverse domain. Few point from my side:-  Do you have any dashboard/record on past project created using launchpad. I would suggest reduce the distribution time to 4-6 months. Hopefully by next season we will have more info on dev support, if not then please provide more info on 30% use. Are you also including dev work, buying new infra, if server cost then for how many months ? Would you able to provide a cost analysis for this if asked by committee/ foundation ?  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.053977272727273
                },
                {
                    "author_link": "https://gov.optimism.io/u/nuuneoi",
                    "index": "4",
                    "likes": "0",
                    "time": "02/11/2022-03:06:03",
                    "content": "Thanks for the feedback! I also have been thinking about the incentive program for free-mint project but I am afraid that it might open a loophole for malicious act to create a random collection just to drain the fund. And only cost they need to pay to use the launchpad is – smart contract deployment gas fee which is pretty optimal on Optimism. Hence I don’t include the free-mint project on our incentive program just yet. Anyway I also have a plan to refund the smart contract deployment cost in OP but still thinking about it to make sure there would be no loophole for an attacker. Regarding to the competitor, I got your point but I think it might be a good thing for overall Optimism ecosystem to have this kind of competition. At the final of the day, every single launchpad can have the same price point / promotion, but the rest is more about how to make it stand out from others which gives the project founders a reason why they should use our product instead of our competitors’. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.642857142857142
                },
                {
                    "author_link": "https://gov.optimism.io/u/Cardo",
                    "index": "5",
                    "likes": "1",
                    "time": "02/11/2022-07:23:26",
                    "content": "I like the allocation. I hope the community passes your proposal ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Sunfire",
                    "index": "6",
                    "likes": "2",
                    "time": "07/11/2022-05:05:31",
                    "content": "yeah? you think a legit NFT/gamefi/metaverse project would be welcomed openly? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/CryptVibez1",
                    "index": "7",
                    "likes": "0",
                    "time": "07/11/2022-06:01:34",
                    "content": "I really to like the way all of this is allocated and proposal as a whole in which there accept your man really nice idea ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.666666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "8",
                    "likes": "1",
                    "time": "07/11/2022-07:45:23",
                    "content": "Yes, please submit your proposal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/LeoRedKD",
                    "index": "9",
                    "likes": "0",
                    "time": "10/11/2022-06:38:51",
                    "content": "With my exp after use Apetimism launchpad. This is the best LP. So fast, so smooth, no problem even in stress test. I think Apetimism LP will grow with Optimism together and make Optimism growing up in the future. There are many project will launch by Apetimism LP. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 7.1
                },
                {
                    "author_link": "https://gov.optimism.io/u/mteoptimism",
                    "index": "11",
                    "likes": "1",
                    "time": "13/11/2022-09:33:04",
                    "content": "As Apetimism is proposing   to incentivize the paid mint program with a hefty 210k OP   90,000 OP (30%) would be used to fund the development,   where is community who supported apetimism earlier? so i oppose this. The poposal should include a fair distribution of 300k op requested or to lower the amount requested . Optimism has provided 50k OP to Optichads so apetimism should comeup with similar number of OP requested and a fair distribution system. OP should put a cap of 2.5 % fee to the developers too. This will reflect that OP is different than other L1’s. If apetimism need grants they need to offer something to community as well. For their proposed distribution they seems interested in benefitting from the token allocation only. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.953125
                },
                {
                    "author_link": "https://gov.optimism.io/u/nuuneoi",
                    "index": "12",
                    "likes": "1",
                    "time": "13/11/2022-10:13:27",
                    "content": "Those who support Apetimism earlier will grow along with the product though since some real use case of the NFT will be kicked in along with the launch of Apetimism Launchpad. By the way I think the main objective of OP Funding is “to boost the usage/growth of Optimism” while to distribute the fund to those who is holding the NFT directly would not answer that. That’s why we don’t allocate any token to the holder since the funding does not work that way. And I truly believe that the proposal will not pass the vote if we do that since it does not benefit the Optimism ecosystem. We are trying to do in the traditional way: develop real product, boost up the real adoption and benefit those who support of project in some way or another from the growing market cap of the product. It is much more sustainable this way. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.7592592592592595
                },
                {
                    "author_link": "https://gov.optimism.io/u/jrocki.eth",
                    "index": "13",
                    "likes": "1",
                    "time": "17/11/2022-21:55:03",
                    "content": "Thanks for submitting the proposal.   Can you describe how your launchpad differentiate itself from existing Launchpads on Optimism such as Quix?   Curious why this project is not open source and does not plan to become open source in the future?   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.083333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/Urban_Raccoon",
                    "index": "14",
                    "likes": "0",
                    "time": "06/01/2023-08:53:04",
                    "content": "@jrocki.eth did they ever answer you? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/jrocki.eth",
                    "index": "15",
                    "likes": "0",
                    "time": "09/01/2023-22:43:37",
                    "content": "Not yet but they still have time before the next voting season start for these proposals ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/teaser",
                    "index": "16",
                    "likes": "1",
                    "time": "10/01/2023-21:30:11",
                    "content": "I’ve used Apetimism Launchpad before. It offers convenience for NFT projects. I support the suggestion. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/FractalVisions",
                    "index": "17",
                    "likes": "1",
                    "time": "23/01/2023-19:25:58",
                    "content": "@nuuneoi perhaps you can update the grant prior to the cycle starting? I know you have made many amazing advancements for the new Zonic NFT platform from Apetimism community and have enjoyed watching the progress. The Thailand community is very strong here on Optimism and I am very excited to see what this team brings to the table as they have always had a very clean product from their development team! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 6.87946127946128
                },
                {
                    "author_link": "https://gov.optimism.io/u/GrantsOps",
                    "index": "18",
                    "likes": "1",
                    "time": "31/01/2023-21:47:08",
                    "content": "Please note that the form for Season 3 has requirements that have not been filled out here. Feel free to update this form to include the questions in the Season 3 proposal template or to submit a new application here. Please also consider which sub-committee should review your application and make sure that you have reviewed the parameters relevant to that sub-committee. ",
                    "links": [
                        "https://foul-porch-0eb.notion.site/Application-2d47da131a004e94a74e56af9438026b"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.836363636363636
                },
                {
                    "author_link": "https://gov.optimism.io/u/GrantsOps",
                    "index": "19",
                    "likes": "0",
                    "time": "05/02/2023-21:50:57",
                    "content": "Please note the above comment and the fact that the current proposal exceeds the maximum requested OP tokens for Cycle 10. The Feb 3 AMA notes may be a useful reference. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.5
                }
            ]
        }
    ],
    "group_index": "317"
}