{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/proposal-to-include-liquidity-providers-in-governance-process/2879",
            "title": "Proposal to Include Liquidity Providers in Governance Process ",
            "index": 2879,
            "category": [
                "\\xf0\\x9f\\x8f\\x9b Governance"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/angyts.eth",
                    "index": "1",
                    "likes": "11",
                    "time": "04/07/2022-20:31:54",
                    "content": "Summary: Liquidity Providers to the Optimism $OP token should have voting power Currently, only $OP Optimism tokens are recognised to have voting power and can be delegated. Over time, there will be a drop in governance participation from what we observe in other DAOs. It is crucial to include liquidity providers (LPs) in the governance process from the start. Liquidity providing is an important part of the ecosystem to allow a liquid market for the token to trade in. Liquidity Providers also tend to be vested in the community and would love to see the collective succeed. Benefits we can see out from this proposal would be: increased token participation and ability to meet voting quorum as time goes on. LPs would also be more incentivised to participate in the governance process and contribute ideas to the ecosystem. Cons are that the developers need to upgrade the snapshot mechanism. Thanks for reading this. Happy to receive criticisms and feedback. ",
                    "links": [],
                    "GPT-summary": "The author proposes to include liquidity providers in the governance process of the Optimism $OP token. Currently, only $OP tokens have voting power, and the author argues that including LPs would increase token participation and incentivize them to contribute ideas to the ecosystem. The proposal would require an upgrade to the snapshot mechanism. The author welcomes criticisms and feedback.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.421875
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackgale.eth",
                    "index": "2",
                    "likes": "1",
                    "time": "04/07/2022-20:45:25",
                    "content": "Strongly agree with this. If we don’t include LPs in governance over the long term, we’ll force a hard distinction for holders between governance and liquidity. Hopefully both will be stronger if we allow them to be implemented at the same time. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.114583333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/briguy",
                    "index": "3",
                    "likes": "0",
                    "time": "11/07/2022-16:15:06",
                    "content": "Strongly agree with this as well. LPs provide a great amount of token utility, enable new dao members and have a vested interest in the token. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.282828282828283
                },
                {
                    "author_link": "https://gov.optimism.io/u/Netrim",
                    "index": "4",
                    "likes": "1",
                    "time": "16/07/2022-02:06:41",
                    "content": "Agreed 100%, because having only OP on your wallet to be delegated takes away composability than can be garnered from OP being an ERC-20 token standard ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "5",
                    "likes": "1",
                    "time": "19/07/2022-19:47:47",
                    "content": "I’m in agreement with this for the above reasons - but also for the reason that it lends a key incentive for the token swap initiative Velodrome have outlined for the ecosystem, detailed here. LPs are absolutely stakeholders, and enabling governance rights provides a compelling additional value to those weighing the risks of providing liquidity in the first place. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving entirely positive feedback on proposal"
                    ],
                    "Sentiment": 5.958333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/Nelli",
                    "index": "6",
                    "likes": "0",
                    "time": "19/01/2023-08:34:24",
                    "content": "I totally agree, it will be as a new use case for op tokens. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.340909090909091
                },
                {
                    "author_link": "https://gov.optimism.io/u/Oxytocin",
                    "index": "7",
                    "likes": "0",
                    "time": "19/01/2023-15:13:15",
                    "content": "Including representation of liquidity providers is something I agree with, recently at the ParaSwap DAO we’ve gone as far as to propose to users who stake an LP token with 2x vote power + long-term holding Social Escrowed boost, so it  makes sense I would suggest something similar here. The only challenge of this idea  would be how to trustlessly whitelist all LPs as opposed to only the most common liquidity pools for OP. We’d want every liquidity source to be counted ideally, which would mean whitelisting dozens of tokens (and with Uni V3 positions I’m not even sure if this is easily possible). Some ideas on how to address this:   Allow protocols to whitelist a ‘governance pool’ where the OP in pool is counted: It keeps control for the owner, but limits pool variety. Would probably need to be paired only with ETH/USDC to avoid volatile tokens. Some TVL floor for the DEX would be required. DEXes with unusual strategies (Uni v3 for instance) might not be counted.   Delegate voting power to DEXes relative to OP TVL: Assumes that pooling assets in that DEX counts as a soft delegation. Less whitelisting required. Maximum pool variety ensured. Might be biased towards DEXes that received grants.   Onboard liquidity providers to the Citizens house in the future : I admit this is the most hands-off solution, but since governance is bicameral, users that want to pool all their OP could simply become a citizen and not have to worry?   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.513541666666667
                }
            ]
        }
    ],
    "group_index": "134"
}