{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/review-gf-phase-1-proposal-domani-protocol/3410",
            "title": "[REVIEW][GF: Phase 1 Proposal] DOMANI Protocol ",
            "index": 3410,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Governance Fund: Phase 1"
            ],
            "tags": [
                "cycle-6"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/DOMANIMike",
                    "index": "1",
                    "likes": "1",
                    "time": "05/09/2022-12:37:34",
                    "content": " DOMANI Protocol Incentive Proposal Project Name: DOMANI Protocol Author name and contact info (please provide a reliable point of contact for the project): DOMANIMike (Telegram: @michaelfeld) Number of OP tokens requested: 550,000 OP L2 Recipient Address: 0xE2aB0c3AF51c71dbC5b9eE3b4bF2f6Fe8E86b07B Grant category: DeFi Relevant Usage Metrics: TVL - $165k (ATH $20M on Ethereum / 5500 - unique addresses). Project links:  Website: https://domani.finance/  Twitter: https://twitter.com/DomaniProtocol  Discord: https://discord.gg/B3U2dr5vpQ   Additional team member info (please link): Team - DOMANI (formerly DEXTF) Documentation Is/will this project be open sourced? In Future Optimism native?: Yes  Optimism alignment (up to 200 word explanation): DOMANI Protocol is a cross-chain digital asset management infrastructure that allows oracle-minimized portfolio tokenization and portfolio management. The dApp is deployed today on Ethereum, Avalanche, Algorand testnet, zkSync testnet, and Klaytn testnet. Each has its distinctive community. We believe that the DeFi fervor in Optimism justifies a safe and flexible portfolio management protocol. DOMANI Protocol was the first project that successfully created and sold structured products in the form of DEXST (Decentralized Structured Tokens). Optimism has all the suitable characteristics to build on a suite of digital asset management tools to accelerate the DeFi users’ safe nesting. We are proposing an initial allocation of:  OP allocation of 550k tokens.  DOMANI Protocol is a project developed by Memento Blockchain Pte Ltd based in Singapore. Memento is building proof of concepts under the supervision of the Monetary Authority of Singapore. The current proof of concept we are working on involves a tier-1 financial institution. It explores how the platform can achieve interoperability and streamline the fund management process end-to-end. The Optimism network was selected to be appropriate from both a scalability and cost perspective. Deploying on Optimism is also part of our broader strategy to become the leading cross-chain asset management protocol. Allowing users to tokenize and manage their digital assets portfolio trustlessly and flexibly onchain. With onchain being synonymous of internet today.  Proposal for token distribution (under 1000 words):  How will the OP tokens be distributed? How will this distribution incentivize usage and liquidity on Optimism? The OP tokens will be used to seed the DOMANI DAO (60%), aggregating the value of the DOMANI deployments. The remaining 40% is split between the development of options and structured tokens to enhance the digital asset management tooling on Optimism and liquidity provision for the DOMANI DAO token.  How will this distribution incentivize usage and liquidity on Optimism? The OP incentives will create the first protocol-owned digital asset manager, where holders of DOMANI DAO are directly exposed to the treasury’s underlying assets. DOMANI DAO holders will also vote on initiatives that foster growth in the DeFi portfolio management category by deliberating on grants, legal aid, and liquidity provisioning, among other operations.  Why will the incentivized users and liquidity remain after incentives dry up? After the OP incentives have dried up, the protocol will still own the liquidity and the assets it has acquired. The ultimate objective is for it to be able to dispense incentives to other fledgling projects focused on augmenting the digital asset management space or projects that are additive to the DOMANI Protocol suite of tools for digital asset management.  Over what period of time will the tokens be distributed? The plan is to run a 12-month incentives program.  How much will your project match in co-incentives? DOMANI Protocol will provide DOMANI DAO token incentives that are locked for 6 months to ensure alignment around the ultimate objective of creating a sustainable DAO that can foster and grow the digital asset management space on Optimism. ",
                    "links": [
                        "https://twitter.com/DomaniProtocol",
                        "https://discord.gg/B3U2dr5vpQ",
                        "https://docs.domani.finance/other/team"
                    ],
                    "GPT-summary": "The post is a proposal for the DOMANI Protocol, a cross-chain digital asset management infrastructure that allows oracle-minimized portfolio tokenization and portfolio management. The proposal explains the project, its usage metrics, and the proposed token distribution. The post also includes links to the project's website, Twitter, and Discord. A 3rd party gives entirely positive feedback on the proposal, extends to the proposal, and may want to collaborate on the project. Additionally, the post may answer some questions about the proposal.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Interoperability and Scaleability",
                        "Token economics",
                        "Smart contract updates",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.593201754385965
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "2",
                    "likes": "2",
                    "time": "12/09/2022-23:59:20",
                    "content": "Thanks for the proposal! If you plan to have this reviewed in Voting Cycle 6, can you please specify which committee should review your proposal (NFTs and Gaming, Tooling, or DeFi) under the grant category field in the updated proposal template for Cycle 6? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/DOMANIMike",
                    "index": "3",
                    "likes": "0",
                    "time": "13/09/2022-02:32:29",
                    "content": "@lavande Thanks for taking the time to go through the proposal. We have added “DeFi” under the grant category field as per the updated proposal template. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/ScaleWeb3",
                    "index": "4",
                    "likes": "1",
                    "time": "14/10/2022-11:40:24",
                    "content": "The core Dextf/Domani asset management product is a Set Protocol Fork. Initial traction on Ethereum was not sustained as the core protocol & product was not meaningfully developed since early 2021 while you deployed on Algorand, Avalanche for grant funding - yet did not achieve significant traction. The amount asked is extremely high for the size of the Domani project. The distribution to your internal development & the DAO for aggregating deployments will likely not help Optimism grow. Some of the strucutured products are indeed very interesting and we’d welcome your move to Optimism and making this your DeFi innovation hub. We’d like to see a deployment & first traction on Optimism before requesting Op incentives and look forward to an improved proposal  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.1425
                }
            ]
        }
    ],
    "group_index": "232"
}