{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/web3-packs-charged-particles-builders-grant-for-cycle-11/5486",
            "title": "Web3 Packs (Charged Particles): Builders Grant for Cycle 11 ",
            "index": 5486,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Grants Council"
            ],
            "tags": [
                "builders",
                "cycle-11"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/Rafael",
                    "index": "1",
                    "likes": "5",
                    "time": "07/03/2023-20:48:58",
                    "content": "Basic Details Project name: Web3 Packs Author name and forum name (please provide a reliable point of contact for the project): Steve Neigut, steve@charged.fi, Steve | Charged Particles#4476 L2 recipient address: Proxy | Address 0xbd4707B67d362A0172036b41bA07D2ff18871711 | Etherscan Which Voting Cycle are you applying for?: Cycle 11 I confirm that I have read the landing pages for the Builders  and Growth Experiments  Sub-Committees and that I have determined my proposal is best suited to be reviewed by the Builders Sub-Committee: Yes, confirmed. Project Details What are you going to build?:  We–Charged Particles team, will build “Web3 Packs” on Optimism network. Web3 Packs are the simplest way to onboard new people directly into Web3, DeFi, and NFTs. This empowers new users to go straight from fiat to Optimism–no bridges required. Technically, a Web3 Pack is an ERC-721 NFT, with ERC-20, ERC-721, and ERC-1155 tokens “Energized” inside (meaning the tokens are owned by the ‘outer’ NFT). This unique functionality of “Energizing” uses the Charged Particles protocol.  Here is a video demo of Web3 Packs Importantly, we are proposing to build a specific application on Optimism. However, in order to do this, we will need to deploy the full Charged Particles protocol to the network–this means that from then on, NFTs on Optimism will have the option to be “Energizable”. Please note, that these are standard NFTs–for example, they can be traded on OpenSea etcetera, they simply have additional functionality. Why is what you are going to build going to succeed?:   We are a professional team, that has been building together since 2019. We have successfully deployed Charged Particles protocol to Ethereum Mainnet and Polygon networks, and Web3 Packs to Mumbai testnet (in development). The technology is battle tested over 3 years, 0 vulnerabilities found, and tens of millions of dollars of value locked/energized inside. Web3 Packs will be a unique pathway for frictionless onboarding of new people into the Web3 ecosystem–directly into Optimism  Is your project likely to bring new builders to the Optimism ecosystem? If so, please describe how: Yes, Web3 Packs are designed to bring new users directly onto Optimism network. Furthermore, deploying Charged Particles protocol to do this would make Optimism the first Layer 2 network to have the unique functionality of “Energizing” NFTs. For example, OP tokens can be “Energized” inside NFTs. Is your project likely to improve the quality of developers in the Optimism ecosystem? If so, please describe how: Yes, Charged Particles protocol will bring a new functionality to NFTs and DeFi on Optimism, that is unavailable on any other Layer 2 network. Our SDK with zero fees, and permissionless access to build opens this technology for both existing developers on Optimism, as well as attracting new developers to build on Optimism. Is your project likely to improve the commitment of developers in the Optimism ecosystem? If so, please describe how: Provide us with links to any of the following for the project:  Demo: Loom | Free Screen & Video Recording Software | Loom  Website: Web3Packs.com (mumbai network) and Charged.Fi  Twitter: https://twitter.com/DefiNft  Discord/Discourse/Community: Charged Particles  Github: Charged Particles · GitHub  Other:  Do you have any metrics on the project currently? (TVL, transactions, volume, unique addresses, etc. Optimism metrics preferred; please link to public sources such as Dune Analytics, etc.): Who are your competitors?: Nested is the most comparable project. What differentiates you from your competitors?: The Nested.fi technology is specific to financial portfolios. By contract, Charged Particles protocol is open to a myriad of applications with permissionless access to our SDK. Various use cases can be seen here Will your project be composable with other projects on Optimism? If so, please explain: Yes, our technology follows the ERC-721 standard. Also, we are composable with Aave–any aToken (e.g. aUSDC) can be Energized inside an NFT such as Web3 Packs, and will accrue interest inside the NFT/Web3 Pack. Team Who are your founders?:   ​Rob Secord​. Founder, Visionary, Technical Lead; Ethereum Smart Contract, Solidity & Full-stack Engineer. 20+ years Engineering, 5+ years in Fintech.   ​Ben Lakoff, CFA​. Co-Founder, Business Lead. Experienced Founder & Finance Professional. >$50M raised for early-stage startups.   What makes your founders well-positioned to accomplish your goals with this project (1-2 sentences on each)?: Demonstrated history of accomplishment in the complementary aspects of technical and business. Furthermore, extensive networks within Web3 industry. Tell us about the rest of your team (if there are more teammates): Our full team is here. Working specifically on Web3 Packs, are Steve Neigut (Head of Marketing); Santiago Cammi (Software engineer), Madison Fries (Software Engineer), and Rafael Hoekstra (Project Management). Is this your first Web3 project?: The team is working on Charged Particles for 3 years now. Our CTO was previously at PoolTogether. If not, what else have you built? (Share links, Github repository, or any other useful information.):   PoolTogether    PoolTogether Win by saving with PoolTogether. The more you save, the more you win!       Projects on Charged Particles: Projects + Use Cases - Charged Particles I understand that Builders grants are subject to a 1 year lock-up, as explained further in this post : Yes. Is your project funded? If so, provide an estimate of how many months of funding runway your project has: Yes, our current runway extends > 6 months. Grant Request What is the size of the grant request? (50k OP max): 50k OP How do you justify the size of the grant? To build Web3 Packs on Optimism, we will need to direct our team’s time and focus to this for up to 6 months. This will be the core Web3 Packs team, as well as the overall engineering team, which will deploy, and test the Charged Particles protocol on Optimism. Going forward, our team will continue committing resources to maintaining and upgrading the protocol and SDK. The absolute cost of human resources for this exceeds 50k OP in the short-term. In the long-term, however, our vision is aligned with Optimism–we aim for Charged Particles to be available on multi-chain with low fees. Optimism is a perfectly aligned partner for long-term future growth. Roadmap Describe in discrete steps your plan for accomplishing your project:  Our core engineering team will work to deploy Charged Particles contracts to Optimism Goerli. And test extensively. We will use The Graph, sub-graphs to index data. We will deploy to Optimism. We will create Web3 Packs on Optimism, and customize them (OP tokens market-bought and “Energized” into every pack, along with other DeFi tokens, bluechips, and NFTs). We will market these (hopefully, co-market with Optimism) via all our channels, including Twitter   Please provide any additional information that will facilitate accountability:(smart contracts addresses relevant to the proposal, relevant organizational wallet addresses, etc.) Our documentation gives an overview of Charged Particles. This page gives an introduction to Web3 Packs. Does your plan depend on the receipt of OP tokens?: No. However, this would show the support of Optimism towards our plan, and align us. What is your plan for the use of the OP token after the 1 year lock-up?: As we’d like to see community projects building with Charged Particles on Optimism, we anticipate using the granted tokens to vote on proposals benefiting such proposals, supporting our corner of the Optimism ecosystem. Please provide benchmark milestones for this project. These milestones should guide the Optimism community on the progress of your project during the 1-year lock-up period. Testnet release. Mainnet release. SDK release. Web3 Packs release and announcement. Subsequently: supporting builder using SDK on Optimism, and actively voting with OP to support meritorious proposals. Please define critical milestones for this project. Critical milestones are meant to show good-faith efforts to accomplish the project. Non-completion of these milestones could lead to revocation of remaining grant rewards. 1- Charged Particles contracts deployed to Optimism Goerli 2- Sub-graph created for these contracts 3- Charged Particles deployed to Optimism 4- Sub-graph deployed to Goerli 5- Our documentation and app updated to reflect this 6- Web3 Packs on Optimism released 7- Web3 Packs promoted to Optimism and Charged Particles communities 8- Releasing SDK for CPs on Optimism Total time to achieve all milestones: 4-6 months Optimism Relationship Does your project solve a problem for the Optimism ecosystem?: Yes. How does your proposal offer a value proposition solving the above problem?: Our proposal both adds functionality to NFTs on Optimism, as well as offering a low-friction avenue for people to on-board directly into Optimism, avoiding the many steps of exchanges and bridges. Why will this solution be a source of growth for the Optimism ecosystem?: New technology to attract builders. New avenue to new people to enter Optimism universe. How committed are you (and your team) to building on Optimism?: We wish to build and maintain Charged Particles protocol on Optimism indefinitely, and support builders to use our SDK. Is your project Optimism Native?: No. Our vision is multi-chain. We are currently on Ethereum mainnet and Polygon. Confirmations I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: Yes I understand that I will be expected to following the public grant reporting requirements outlined here Yes ",
                    "links": [
                        "https://foul-porch-0eb.notion.site/Builders-Sub-Committee-02ba9da5b4534fbf955e6e4c8fcf1aa3",
                        "https://foul-porch-0eb.notion.site/Growth-Experiments-Sub-Committee-270d2f75ff0f410a869b2ba6a8324006",
                        "https://charged.fi",
                        "https://docs.charged.fi/other/glossary-of-terms#energizing",
                        "https://charged.fi",
                        "https://www.loom.com/share/3e5c509f2ec04a16a7cd8a5c38134b0e",
                        "https://docs.charged.fi/other/glossary-of-terms#energizing",
                        "https://docs.charged.fi/charged-particles-protocol/team",
                        "https://www.loom.com/share/3e5c509f2ec04a16a7cd8a5c38134b0e",
                        "https://web3packs.com",
                        "https://Charged.Fi",
                        "https://twitter.com/DefiNft",
                        "https://discord.com/invite/HdRx4SBMDv",
                        "https://github.com/Charged-Particles",
                        "https://nested.fi/",
                        "http://Nested.fi",
                        "https://docs.charged.fi/charged-particles-protocol/projects-+-use-cases",
                        "https://www.linkedin.com/in/robsecord/",
                        "https://www.linkedin.com/in/benlakoff/",
                        "https://docs.charged.fi/charged-particles-protocol/team",
                        "https://pooltogether.com/",
                        "https://pooltogether.com/",
                        "https://docs.charged.fi/charged-particles-protocol/projects-+-use-cases",
                        "https://gov.optimism.io/t/grant-token-lock-explainer/5060",
                        "https://docs.charged.fi/charged-particles-protocol/developing-on-the-protocol/smart-contracts",
                        "https://twitter.com/DefiNft",
                        "https://docs.charged.fi/",
                        "https://www.notion.so/defi-nft/Web3-Packs-a85094f8bb7a480a9065397b6fca6f84",
                        "https://gov.optimism.io/t/suggested-public-reporting-requirements-for-grantees/4176"
                    ],
                    "GPT-summary": "The author, Steve Neigut, proposes to build \"Web3 Packs\" on the Optimism network, which are ERC-721 NFTs with ERC-20, ERC-721, and ERC-1155 tokens \"Energized\" inside. The proposal aims to onboard new users directly into Web3, DeFi, and NFTs, and bring new users to the Optimism ecosystem. The proposal is likely to improve the quality of developers in the Optimism ecosystem and improve the commitment of developers in the Optimism ecosystem. The proposal requests a grant of 50k OP to deploy the full Charged Particles protocol to the network.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Interoperability and Scaleability",
                        "Smart contract updates",
                        "Community and engagement",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.840658893078247
                },
                {
                    "author_link": "https://gov.optimism.io/u/FractalVisions",
                    "index": "2",
                    "likes": "3",
                    "time": "08/03/2023-14:47:00",
                    "content": "Very nice !!! I love this project and have been a big fan of charged particles ever since the old days on Clubhouse being in rooms with Rob and Ben who submitted the proposal I assume ? It’s great to see you here on optimism. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.4
                },
                {
                    "author_link": "https://gov.optimism.io/u/Mango",
                    "index": "3",
                    "likes": "3",
                    "time": "08/03/2023-18:28:48",
                    "content": "That’s us, yeah! Mango here too if you ever made it into any of my Clubhouse Rooms around that same time! We’re super stoked to be in consideration for this ecosystem move. Would be huge to see Optimism projects unlocking some new use-cases together with us  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 6.087121212121213
                },
                {
                    "author_link": "https://gov.optimism.io/u/FractalVisions",
                    "index": "4",
                    "likes": "3",
                    "time": "08/03/2023-20:01:56",
                    "content": "Of course we remember you. Thanks for the reminder!! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5625
                },
                {
                    "author_link": "https://gov.optimism.io/u/steveospirals",
                    "index": "5",
                    "likes": "3",
                    "time": "08/03/2023-20:30:07",
                    "content": "Hey @FractalVisions glad to see an OG supporter here! This is Steve Neigut the CMO of Charged Particles. Those early clubhouse days were the best. We are really excited at the idea of deploying on Optimism, feels like the perfect chain to bring all the functionality of the protocol and the products us and others are building. Here is a link to an article of what we accomplished in 2022. 2022: We Came, We Built, We Shipped | by Steve Neigut | Charged Particles | Medium ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party advertising proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/marklar",
                    "index": "6",
                    "likes": "4",
                    "time": "08/03/2023-21:27:18",
                    "content": "I support this proposal and would love to see Charged Particles building on Optimism. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "7",
                    "likes": "4",
                    "time": "10/03/2023-01:53:31",
                    "content": "Hey @Rafael giving a heads up that all formal comms w us will be in this thread. Had just a clarifying question to start – how should I understand this product in relation to something like Revest/Resonate, which similarly creates fNFTs and enables varied yield strategies? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "8",
                    "likes": "3",
                    "time": "10/03/2023-02:57:15",
                    "content": "One comment I have is on milestones. The critical milestones look good, but I’d like to see some benchmark milestones that track the success of this project, not just deployments. What do you use to measure your own success, and what will be good ways to demonstrate that to the community here? Benchmark milestones are not necessary to meet to get the grant, to be clear - it’s really for tracking. For more information on milestones here’s a link: Milestone Assessment ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.7
                },
                {
                    "author_link": "https://gov.optimism.io/u/Mango",
                    "index": "9",
                    "likes": "3",
                    "time": "10/03/2023-16:26:27",
                    "content": "Hi there @jackanorak - Mango here from the Charged Particles team. I can speak to your question. Just took a look through the Resonate site and docs, and it looks like they’re approaching a pretty different set of problems. A lot of DeFi protocols use a variety of vaults, NFT redemptions, clever liquidity pooling mechanics, etc. Our protocol does something very unique in that we assign NFTs their own Smart Wallets which allow those NFTs to own their own tokens. This means you can deposit ERC-20s, 721s, 1155s inside that NFT. If it’s sold, transferred, burned, those tokens go along for the ride. On a fundamental level, this composability is very different than a smart contract holding a bunch of tokens in some sort of a vault mechanism that someone can then come redeem. In the case of fNFT this is like a key to a timeshare. Charged Particles is turning every NFT into a house. Our focus is also much broader than a single DeFi use-case. We can retroactively enable this functionality for NFTs across the ecosystem. Meaning, for example, Board Apes are now Charged Particles; so are Mona, Voxel, and Sandbox Parcels; so are all the NFTs minted on SuperRare, Rarible; so are Cortex domain addresses; etc. Now, holders of these NFTs can store tokens inside those NFTs enabling things like bundled collections, token indexes, trusts, token vesting, digital identity use-cases, governance and dao accounting tools, and so so much more. It’s a fairly deep infrastructural concept that changes NFTs from a square into a cube. Charged Particles does have an integration with Aave which allows for interest-bearing tokens which would open some DeFi doors similar to Resonate, but it’s much more than that also. Web 3 Packs is one particularly scalable onboarding product from the deep use-case list that the Charged Particles Protocol makes possible. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.962603519668738
                },
                {
                    "author_link": "https://gov.optimism.io/u/Rafael",
                    "index": "10",
                    "likes": "2",
                    "time": "12/03/2023-08:35:11",
                    "content": "Hi Jack, Thanks for engaging with this proposal. Yes, we share some similarity with the projects you mention. The overall difference is that they focus on purely financial NFTs, while Charged Particles is a generalized protocol that can service many use cases from art to finance. Here are over a dozen! That’s on the protocol side. For the specific application of Web3 Packs–these are again different, as rather than financial, they are a ‘gateway product’ into Web3–specifically into Web3 on Optimism! Hope that helps. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.765625
                },
                {
                    "author_link": "https://gov.optimism.io/u/Rafael",
                    "index": "11",
                    "likes": "2",
                    "time": "12/03/2023-08:37:58",
                    "content": "Good question on Benchmark Milestones. I think a healthy metric would be 100 people minting Web3 Packs on Optimism within 1 month of release. Very open to suggestions on any other Benchmark Milestones that would feel suitable. Still considering this carefully. Thank you. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.270833333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/Matt_IMT",
                    "index": "12",
                    "likes": "3",
                    "time": "15/03/2023-02:56:40",
                    "content": "As one of the co-founders of Unchained Music, I support this. I’ve seen the progress that CP has made since their launch, and I’d love to see the protocol continue to expand and open up other avenues to composability with NFTs. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "13",
                    "likes": "0",
                    "time": "16/03/2023-20:46:14",
                    "content": "Wanted to check in to see whether you had any other potential benchmark milestones. Certainly you have other means of gauging success in addition to 100 wallets minting in a month, yes? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.264285714285714
                }
            ]
        }
    ],
    "group_index": "574"
}