{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/unique-custom-smart-contract-art-project-for-optimism/2456",
            "title": "Unique custom smart contract Art project for Optimism ",
            "index": 2456,
            "category": [],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/bardionson",
                    "index": "1",
                    "likes": "0",
                    "time": "04/06/2022-15:16:08",
                    "content": "Hi I am Bård Ionson an artist creating cryptoArt since 2018. Is OP interested in funding artists and art for the public as a public good? I was wondering if OP would help fund and promote an art installation smart contract on chain art project I am building. Do I submit this as a proposal or is OP interested in this sort of thing at all? It is a custom contract I wrote with some innovative interactive features. It is able to generate on chain NFT art pieces that are SVG files written to the blockchain. It has an allow list of people who are allowed to create their own content if they pay dues. The creators of the content will get 95% of the sales proceeds. The content is about 35 words. The person purchasing the NFT will select the number of times they want the words read aloud and pay a fee based on the number of times it will be read. They will receive an on-chain NFT image of the words. The words will be printed out on a strip of paper and then read by a computer out loud. I have documented more of the concept on my website https://collect.bardionson.com/soul-scroll-testing/ It is a prayer machine. I cannot decide if I want to create it on OP Poly or Ethereum L1 at the moment. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.642857142857142
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "2",
                    "likes": "1",
                    "time": "04/06/2022-22:42:18",
                    "content": "Please go through this . Submit a first version of proposal on discord and depending the response, decide the next step. Welcome to OP Ecosystem. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "3",
                    "likes": "0",
                    "time": "13/09/2022-18:45:55",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "60"
}