{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/phase-1-committee-formation-proposal-template/3281",
            "title": "Phase 1 Committee Formation Proposal Template ",
            "index": 3281,
            "category": [
                "\\xf0\\x9f\\x8f\\x9b Governance",
                "Metagovernance"
            ],
            "tags": [
                "season-2"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/system",
                    "index": "1",
                    "likes": "14",
                    "time": "11/08/2022-15:27:25",
                    "content": " Phase 1 Committee Formation Proposal Template Hey folks! This thread contains a draft of a new committee formation proposal template. We look forward to hearing your feedback! *Please comment on the template below. If you have general comments about committees, please contribute to the conversation here. Thank you for your feedback, we will consider this template finalized (as of 8.18.22) so that teams may move forward with posting draft proposals for feedback.  What are Committees? Committees are an attempt to segment the work of assessing proposals among smaller, focused groups. These committees will primarily perform information filtering and synthesis so that delegates aren’t overloaded with information. Delegates that specialize in a particular topic can defer to the recommendation of relevant committees on topics outside their area of expertise/interest. By approving a committee, delegates are entering a social contract to entrust and delegate the bulk of decision-making to the committee. They are expected to follow the recommendation of committees, except in extreme circumstances. The conversation regarding the introduction of committees is taking place here. Committees will operate primarily via social contract and, apart from governance-approved OP rewards for committee participation, will not directly manage tokens. Instead, committees will vet, research, and discuss proposals, then make highly visible recommendations to non-committee delegates at the time of voting. Committee members will receive OP rewards to incentivize this work. Please note that all committee members that will receive compensation will be required to complete basic KYC with the Optimism Foundation. his information will be collected privately. Creation of a new committee requires completion of the below proposal template and adherence to the proposal process outlined in the operating manual. Quorum is 30% and the approval threshold is 51%. This proposal type may be officially added to the operating manual in Season 3. Phase 1 Committee Formation Proposals for Season 2 should be posted for feedback 1 week in advance of the start of Voting Cycle #5. This means proposals should be posted for feedback by August 18th, at 7pm GMT. Please use the following title format: [DRAFT][S02 Committee Proposal: Category: Group Letter.] An example would be [SO2 Committee Proposal: DeFi: Group A]. Group letter should be alphabetical by category, based on time of original submission.  Committee Proposal Template   Committee category: (Please define what this category means in the context of Optimism and Token House governance. Please link to 1-3 example proposals that would fall under this category, if applicable):  Proposed number of committee members (up to 5):   Who will be the committee lead? (please link to bio and explain their involvement in optimism to date.)  Who will be the committee reviewers? (please link to bio and explain their involvement in Optimism to date.) Please provide the voting participation rate and % of votable supply held by each committee member: Please disclose any and all conflicts of interest committee members may have: Please link to the voting history (with rationale) of each committee member:  Please outline the decision making framework the committee plans to use to make recommendations: (this may include proposal scoring metrics and/or other frameworks)  Please describe how the committee will operate: (general workflow, communication channels, expected outputs, etc.)  ",
                    "links": [
                        "https://gov.optimism.io/t/introducing-governance-committees/3238",
                        "https://github.com/ethereum-optimism/OPerating-manual/blob/main/manual.md",
                        "https://gov.optimism.io/t/draft-s02-committee-proposal-decentralized-finance-governance-committee/3286/8",
                        "https://gov.optimism.io/t/introducing-governance-committees/3238/23",
                        "https://gov.optimism.io/t/draft-s02-committee-proposal-tooling-governance-committee/3333/29",
                        "https://gov.optimism.io/t/draft-s02-committee-proposal-category-defi-group-b/3318",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/2",
                        "https://gov.optimism.io/t/introducing-governance-committees/3238/76",
                        "https://gov.optimism.io/t/introducing-governance-committees/3238/32"
                    ],
                    "GPT-summary": "The post is a proposal template for the formation of committees in the context of Optimism and Token House governance. The author is asking for feedback on the template and explaining the purpose of committees. The post also includes details on the proposed number of committee members, their roles, and the decision-making framework the committee plans to use. A 3rd party could give constructive criticism or ask questions about the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 4.810213243546578
                },
                {
                    "author_link": "https://gov.optimism.io/u/Ovetta",
                    "index": "2",
                    "likes": "2",
                    "time": "11/08/2022-18:24:08",
                    "content": "If a project/proposal is multifaceted (ie. a protocol has defi, gaming and nft offerings), it seems logical that there would be multiple specialized committees, assigned to vetting the proposal. What happens if the committee for defi thinks the project passes muster, but the committees for gaming and nft find some major flaws? There should be a mechanism for the multiple committees to come to consensus on their recommendation before sharing their recommendation for how delegates should cast their vote, considering this expectation:     lavande:  They are expected to follow the recommendation of committees, except in extreme circumstances.   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.072916666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "3",
                    "likes": "7",
                    "time": "11/08/2022-21:12:47",
                    "content": "    lavande:  Phase 1 Committee Formation Proposals for Season 2 should be posted for feedback 1 week in advance of the start of Voting Cycle #5   This will start on 25th August, so the proposal must be submitted before 18th, right ? We are repeating the same mistake we did in Phase 1 proposal by not mentioning the time explicitly , please provide exact date and time (GMT/CET etc)  Optimism to date  thank you focusing on Optimism  except in extreme circumstances  extreme might be strong word here,  delegate going against the committee recommendation must provide their reasoning. Why they are going against the recommendation and what changes they expect to see in future. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.513605442176871
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "4",
                    "likes": "1",
                    "time": "18/08/2022-13:58:30",
                    "content": "Thank you for your feedback on this template, we will consider this template finalized (as of 8.18.22) so that teams may move forward with posting draft proposals for feedback. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/krzkaczor",
                    "index": "5",
                    "likes": "1",
                    "time": "18/08/2022-14:33:34",
                    "content": "What should be the source for:  Please provide the voting participation rate and % of votable supply held by each committee member:  Is there a dune dashboard or something? This dashboard provides similar data but not precisely the same. This is what we will use at the beginning and update data later. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/Butterbum",
                    "index": "6",
                    "likes": "1",
                    "time": "19/08/2022-16:17:40",
                    "content": "Use Boardroom they have the data you are looking for. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "7",
                    "likes": "1",
                    "time": "23/08/2022-21:57:16",
                    "content": "Updated language in the template to reflect more specific proposal naming: Please use the following title format: [DRAFT][S02 Committee Proposal: Category: Group Letter.] An example would be [SO2 Committee Proposal: DeFi: Group A]. Group letter should be alphabetical by category, based on time of original submission. This template can be considered finalized for Season 2. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.125
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "8",
                    "likes": "0",
                    "time": "25/08/2022-22:18:36",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "9",
                    "likes": "0",
                    "time": "25/08/2022-22:19:25",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "10",
                    "likes": "0",
                    "time": "13/09/2022-20:00:10",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "203"
}