{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/draft-gf-phase-1-proposal-metronomo/5021",
            "title": "[DRAFT][GF: Phase 1 Proposal] Metronomo ",
            "index": 5021,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Grants Council"
            ],
            "tags": [
                "cycle-10",
                "passed"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/GrantsOps",
                    "index": "1",
                    "likes": "1",
                    "time": "01/02/2023-23:09:06",
                    "content": "Project name: Metronomo Author name and contact info (please provide a reliable point of contact for the project): Vladimir Gusev vladimir@metronomo.xyz I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: Yes I understand that I will be expected to following the public grant reporting requirements outlined here: Yes L2 recipient address: 0x1A44AE850933Cc7B3bb464Da6D500dF1745dF0Ba Which Voting Cycle are you applying for?: Cycle 10 Which sub-committee should review your proposal? (Builders Grants, Growth Experiment Grants): Builders Grants Project description (please explain how your project works): We are building Web3-native Programmatic Ad Network. And as a part of it, we want to create and share with community an open-source user growth tool to help web3 startups acquire and retain users with high efficiency.This product will allow accomplish 3 main things:- track power users (the most valuable users) of a smart contract (by mapping smart contract methods and arguments to an engagement scoring model)- create vectors, describing all Optimism network users in the user activity space- find users, who are similar to the most valuable users of a smart contract to perform targeted communicationsIt will help dApps:- Find potential power users to (for example) provide them with target airdrops for growing new users;- Define existing power users to incentivize them according to their value for growing loyalty;- Discover new partnership opportunities, acquisition channels, and influencers for growing new users via user similarity feature- Personalize interface (with their front-end solution so far) according to user segment and grow onboarding efficiency## Detailed description##We will deliver easy-to-use API, which allows functional integration in different products (ex., dApp UI, Telegram Bot, and others)- API specification: https://www.notion.so/metronomo/Projects-with-potential-power-users-7982033da4424787993fed3001a7f54aSome details:1. For now, we consider that the primary method to find power users (most valuable users) will be RFM segmentation https://en.wikipedia.org/wiki/RFM_(market_research)2. We created basic projects and user similarity analysis tools. We found out that it’s possible to compute on not very expensive servers and in a reasonable time for creating a product.3. There are several user-similarity techniques described in the papers, which we will test and implement. For example (but not limited to): 1. https://link.springer.com/article/10.1007/s10115-021-01651-8 2. https://ieeexplore.ieee.org/abstract/document/904471 3. https://link.springer.com/chapter/10.1007/978-981-19-1018-0_424. Technology stack to be used: Google Cloud Functions, Google Cloud Storage, Python Website: https://metronomo.xyz/ Twitter: https://twitter.com/metronomo_xyz/ Discord/Discourse/Community: Other relevant links (including any demos): Metronomo Product demo - YouTube Additional team member info (please link): Metronomo Team Intro - YouTubehttps://www.notion.so/metronomo/Metronomo-Team-Info-8eb37937feb648cc974b1948db98ebc3 Please link to any previous projects the team has meaningfully contributed to: Metronomo is a cross-chain user growth infrastructure by iarickbondarchuk · Pull Request #51 · Mintbase/Grants-Program · GitHub Relevant usage metrics (TVL, transactions, volume, unique addresses, etc. Optimism metrics preferred; please link to public sources such as Dune Analytics, etc.): We are on a prototype stage. Currently we have over 60 companies in our waiting list.Our telegram bot is regularly used by Near and BNB dApps Telegram: Contact @metronomo_bot Competitors, peers, or similar projects (please link): Most of the existing similar web3 products cover a few aspects of user growth and are not open-source infrastructure. Unlike them, we are open-source and in the long term, we are building protocol focused on solving most of the user growth issues.There are also products like The Graph, Dune Analytics, Bitquery, etc. that can look like our competitors in the long run, but actually, they are not. Here is why:- They solve mostly indexing and querying issues, while we will provide data analysis/algorithms services- They are finance-focused on retail traders and financial institutions but do not cover marketers’ and community builders’ needs. Is/will this project be open sourced?: Yes Optimism native?: Yes Date of deployment/expected deployment on Optimism: 5/1/2023 What is the problem statement this proposal hopes to solve for the Optimism ecosystem?: We asked a bunch of web3 projects about their biggest challenges. All of them mentioned user acquisition as an urgent issue. As we dived deeper, we realized that there are:1. Lack of user acquisition tools2. Lack of tools for targeted communication with users3. Lack of tools for building personalized experiences for users How does your proposal offer a value proposition solving the above problem?: It will help dApps:- Find potential power users to (for example) provide them with target airdrops for growing new users;- Define existing power users to incentivize them according to their value for growing loyalty;- Discover new partnership opportunities, acquisition channels, and influencers for growing new users via user similarity feature- Personalize interface (with their front-end solution so far) according to user segment and grow onboarding efficiency Why will this solution be a source of growth for the Optimism ecosystem?: Our open-source product will help Optimism dApps grow users and their loyalty: - Find potential power users to provide them with target airdrops for growing new users; - Define existing power users to incentivize them according to their value for growing loyalty; - Discover new partnership opportunities, acquisition channels, and influencers for growing new users - Personalize interface (with their front-end solution so far) according to user segment and grow onboarding efficiency - In the next iteration, it will be able to become a part of traffic exchange tool, allowing non-competing dApps with intersecting user bases to grow their audience Has your project previously applied for an OP grant?: No Number of OP tokens requested: 22,5k Did the project apply for or receive OP tokens through the Foundation Partner Fund?: No If OP tokens were requested from the Foundation Partner Fund, what was the amount?: - How much will your project match in co-incentives? (not required but recommended, when applicable): We will support for at least 2 years all the infrastructure for API How will the OP tokens be distributed? (please include % allocated to different initiatives such as user rewards/marketing/liquidity mining. Please also include a justification as to why each of these initiatives align with the problem statement this proposal is solving.): 100% to pay for development team Over what period of time will the tokens be distributed for each initiative? Shorter timelines are preferable to longer timelines. Shorter timelines (on the order of weeks) allow teams to quickly demonstrate achievement of milestones, better facilitating additional grants via subsequent proposals: during 3 month Please clearly define the milestones you expect to achieve in order to receive milestone based installments. Please consider how each milestone relates to incentivizing sustainable usage and liquidity on Optimism. Progress towards each milestone must be trackable: ### Overview- Milestone 1 - Implement power-users search module- Milestone 2 - Implement look-a-like module- Milestone 3 - Implement the users’ similarity module and the users’ activity module### Milestone 1 - Implement power-users search moduleWe will create a module that will search for power users of a smart contract, given the indexed blockchain data in described format.### Milestone 2 - Implement look-a-like moduleWe will create a module that will create a look-a-like (embedded vector) representation of power users in user space### Milestone 3 - Implement the users’ similarity module and the users’ activity module- Users similarity module: We will create a module that will find the most similar users in the whole blockchain given a specific set of look-a-likes- Similar contracts search module : We will create a module that will find and count how many potential similar to look-a-like users interacted with each smart contract (with at least one interaction during a given past period)- API setup : We will run an API, which can be used or integrate into projects UI Why will incentivized users and liquidity on Optimism remain after incentives dry up?: not applicable Please provide any additional information that will facilitate accountability (smart contracts addresses relevant to the proposal, relevant organizational wallet addresses, etc.): Metronomo-xyz · GitHub Confirm you have read and agree to the Eligibility Restrictions (here): I have read the Eligibility Restrictions and agree to abide by their conditions ",
                    "links": [
                        "https://www.notion.so/Projects-with-potential-power-users-7982033da4424787993fed3001a7f54a",
                        "https://en.wikipedia.org/wiki/RFM_(market_research)",
                        "https://link.springer.com/article/10.1007/s10115-021-01651-8",
                        "https://ieeexplore.ieee.org/abstract/document/904471",
                        "https://link.springer.com/chapter/10.1007/978-981-19-1018-0_42",
                        "https://metronomo.xyz/",
                        "https://twitter.com/metronomo_xyz/",
                        "https://youtu.be/CHBXonrO3d8",
                        "https://youtu.be/k5C72GKBNeE",
                        "https://www.notion.so/metronomo/Metronomo-Team-Info-8eb37937feb648cc974b1948db98ebc3",
                        "https://github.com/Mintbase/Grants-Program/pull/51",
                        "https://t.me/metronomo_bot",
                        "https://github.com/Metronomo-xyz",
                        "https://gov.optimism.io/t/grant-proposal-template/3233",
                        "https://gov.optimism.io/t/cycle-10-final-grants-roundup/5418",
                        "https://gov.optimism.io/t/cycle-10-grant-review-roundup/5284"
                    ],
                    "GPT-summary": "The post is a draft proposal for a project called Metronomo, which aims to build a Web3-native Programmatic Ad Network and create an open-source user growth tool to help web3 startups acquire and retain users with high efficiency. The proposal explains the project's goals, methodology, technology stack, and expected impact on the Optimism ecosystem. The post also includes links to relevant resources and previous projects by the team. The proposal invites feedback, questions, and collaboration from third parties.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Smart contract updates",
                        "Interoperability and Scaleability",
                        "Token economics"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.5891384477591375
                },
                {
                    "author_link": "https://gov.optimism.io/u/Vladimir",
                    "index": "2",
                    "likes": "1",
                    "time": "06/02/2023-11:58:15",
                    "content": "Important addition to our proposal:  all incentives would be granted to the developers retroactively for work performed  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "3",
                    "likes": "1",
                    "time": "23/02/2023-17:47:58",
                    "content": "Hey @Vladimir wanted to direct you to a new piece Milestone Assessment . Aligning your milestones with these guidelines is not mandatory for cycle 10, but you can get a better score on the final review if you do implement it. These are intended to provide some more concrete tracking of this work. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.155303030303029
                },
                {
                    "author_link": "https://gov.optimism.io/u/Vladimir",
                    "index": "4",
                    "likes": "0",
                    "time": "24/02/2023-17:46:58",
                    "content": "Thank you @jackanorak! We’ll do our best  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "5",
                    "likes": "1",
                    "time": "05/03/2023-19:38:19",
                    "content": "Hi @Vladimir! Can you provide a Telegram handle or other contact method so the Optimism team can get in touch about paying out this grant! Feel free to DM or email lavande@optimism.io ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.609375
                },
                {
                    "author_link": "https://gov.optimism.io/u/Vladimir",
                    "index": "6",
                    "likes": "1",
                    "time": "05/03/2023-20:09:28",
                    "content": "Hi @lavande! Sent you an email with my contacts ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "495"
}