{
    "poll_list": [
        {
            "id": "0x2102ea7e303e9ed17a64a6b159cd12416338106be6c449b36a89051a83b76b88",
            "title": "Proposal I: Governance Phase 1 - Qi Dao",
            "discussion": "https://gov.optimism.io/t/ready-gf-phase-1-proposal-qidao-protocol/2863/1",
            "body": "This Governance Fund Phase 1 proposal has been marked ready and as such is eligible for voting in Cycle 4. This proposal HAS been approved as ready for vote by a delegate. For more info, check out Voting Cycle 4 Roundup: https://gov.optimism.io/t/voting-cycle-4-roundup/3055",
            "choices": [
                "For",
                "Against",
                "Abstain"
            ],
            "scores": [
                15032308.253404628,
                990802.7358526275,
                1566021.9373283228
            ],
            "start": 1658757824,
            "end": 1659553424,
            "snapshot": "15734289",
            "state": "closed",
            "author": "0x47C88bb92B409fF25F6587EA611fac4e55f76007",
            "space": {
                "id": "opcollective.eth",
                "name": "Optimism Collective"
            }
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/ready-gf-phase-1-proposal-qidao-protocol/2863",
            "title": "[READY] [GF: Phase 1 Proposal] QiDao Protocol ",
            "index": 2863,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Governance Fund: Phase 1"
            ],
            "tags": [
                "cycle-4",
                "passed"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/Benjamin.lens",
                    "index": "1",
                    "likes": "28",
                    "time": "02/07/2022-17:20:17",
                    "content": "Project Name: Qi Dao Author Name: @geekvine and @benjaminqidao Number of OP tokens to claim: 750,000 OP L2 Recipient Address: 0xB1a8D1D6Dc07ca0e1E78a0004aa0bB034Fa73d60 DefiLlama TVL on Optimism: $3.61M Proposal for token distribution: Distribute OP tokens to QiDao to grow the protocol on Optimism.  Rationale: QiDao is a decentralized collateralized debt position stablecoin protocol where users can deposit tokens as collateral to issue MAI, the protocol’s decentralized stablecoin. It is the largest stablecoin protocol on Polygon, Fantom, Gnosis Chain, Moonbeam, and Moonriver. QiDao was deployed on Optimism two months ago and has seen explosive growth in relation to other chains the protocol is operating on. The goal of this proposal is to explain how to use this grant to increase the growth of QiDao and the Optimism Ecosystem. QiDao is well integrated into the Optimism DeFi ecosystem, having sizeable liquidity on all major DEXs and bridges. MAI has also been accepted into Aave V3. Future integrations include Beefy, with whom QiDao has a multichain strategy with, Arrakis, and Optimism token (adding OP as collateral for MAI). Additionally, QiDao has a community within its DAO that is committed to growth on Optimism. They call themselves the Optimism Alliance. They have been bribing QI voters weekly to vote in favor of Optimism vaults to receive borrow incentives. That has earned Optimism an added $10,000 of incentives per week!  How will the OP tokens be distributed? 20% for bounties on teams building on top of QiDao on Optimism 20% for borrow incentives 60% for MAI liquidity on Optimism (spread between Velodrome and Curve over the course of a year) Breakdown on incentives QiDao is currently providing to Optimism users:  Beethoven/Balancer pool: 15,000 QI per week Curve pool: 3,000 QI per week Borrowing incentives: 40,590 QI per week  Total QI incentives: 3,046,680 QI annualized ($761,644). Total OP incentives requested: 750,000 OP annualized ($457,844). Not only is QiDao matching incentives, we’re exceeding proposed incentives on Optimism by 1.7x. Supporting MAI liquidity on Optimism will encourage users to lock value on Optimism in the form of collaterals. Since MAI charges a repayment fee and no interest, locked value has a longer lifespan than it does on other lending and stablecoin platforms. This is due to users being incentivized to keep their debt positions open.  How will this distribution incentivize usage and liquidity on Optimism? QiDao has voted to add OP as collateral for MAI (for 0% interest loans). This will allow OP hodlers to mint stablecoins against their OP instead of selling. If Optimism supports MAI liquidity, then more users will choose to borrow against OP rather than selling it. MAI has consistently been a top volume provider for Curve on Fantom and Polygon, where MAI is the largest stablecoin protocol. This is because MAI pools have a higher volume to TVL ratio than most native stablecoins outside of Ethereum. Growing MAI’s liquidity will allow more users to bridge value from other chains. MAI is currently one of the most crosschain tokens in crypto, with 20 chains available. As a result, it functions as an effective transfer of value across chains. MAI’s 0% interest and repayment fee model encourages users to lock tokens on their home chain and keep loans open. This creates a resilient TVL for Optimism.  Why will the incentivized users and liquidity remain after incentives dry up? For the past few months, QiDao has operated on a net profit (revenue has exceeded emissions). This shows that QiDao has built a durable model that can thrive without outsized emissions. After OP incentives end, QiDao will continue to incentive usage on Optimism as it has for the past several weeks.  Over what period of time will the tokens be distributed?  Liquidity Incentives : 6 to 12 months depending on OP token price. Borrow Incentives: 6 to 12 months depending on OP token price. Grants Incentives: 3 to 6 months depending on the OP token price.   How much will your project match in co-incentives? All incentives will be exceed by our emissions to Optimism users. Currently, QiDao will give $1.7 for every $1 of OP incentives. OP token vaults will receive borrow incentives based on a bi-weekly community gauge. ",
                    "links": [
                        "https://gov.optimism.io/t/voting-cycle-4-roundup/3055",
                        "https://gov.optimism.io/t/review-gf-phase-1-proposal-overnight-fi/3536/26",
                        "https://gov.optimism.io/t/review-gf-phase-1-proposal-overnight-fi/3536/27",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-abracadabra-money-cycle-8/2918",
                        "https://gov.optimism.io/t/gfx-labs-delegate-communication-thread/2728/14",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-mai-finance-qi-dao-protocol/2854/2",
                        "https://gov.optimism.io/t/gf-phase-1-proposal-mai-finance-qi-dao-protocol/2870/5",
                        "https://gov.optimism.io/t/gf-phase-1-proposal-mai-finance-qi-dao-protocol/2870/2"
                    ],
                    "GPT-summary": "The post is a proposal for distributing OP tokens to QiDao to grow the protocol on Optimism. The proposal explains how the grant will be used to increase the growth of QiDao and the Optimism Ecosystem. The proposal includes a breakdown of how the OP tokens will be distributed and how they will incentivize usage and liquidity on Optimism. The post also mentions the community within QiDao's DAO that is committed to growth on Optimism and how they have been incentivizing QI voters weekly to vote in favor of Optimism vaults to receive borrow incentives.",
                    "GPT-proposal-categories": [
                        "Token economics",
                        "Grants, Funding and resource allocation",
                        "Interoperability and Scaleability",
                        "Community and engagement"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.5332207207207205
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "2",
                    "likes": "5",
                    "time": "02/07/2022-21:31:07",
                    "content": "    Benjamin.lens:  Qi Dao   Dumb feedback, you should add Optimism to your web page.  image671×651 34.7 KB  I did not know about this project I’ll dig into it. Nice to see new projects focused on stablecoins. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.602272727272727
                },
                {
                    "author_link": "https://gov.optimism.io/u/millie",
                    "index": "3",
                    "likes": "2",
                    "time": "02/07/2022-23:53:04",
                    "content": "hey @Benjamin.lens do you mind elaborating on how the liquidity incentives distribution will look like, as in which pools will be incentivized? Thanks. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/hamid_dezfuli",
                    "index": "4",
                    "likes": "3",
                    "time": "03/07/2022-08:33:18",
                    "content": "    Benjamin.lens:  Qi Dao   Good idea to improve the ecosystem ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "5",
                    "likes": "1",
                    "time": "03/07/2022-20:56:23",
                    "content": "Its good that incentives are matched but I am reading this     Benjamin.lens:  For the past few months, QiDao has operated on a net profit (revenue has exceeded emissions). This shows that QiDao has built a durable model that can thrive without outsized emissions.   and total number of OP requested. Why are you requesting 1M if you are confident that your platform is self-sufficient to hold the users. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://gov.optimism.io/u/Benjamin.lens",
                    "index": "6",
                    "likes": "3",
                    "time": "04/07/2022-04:59:44",
                    "content": "The pools to be incentivized are likely the MAI pools you see today. MAI is on the major DEXs on Optimism: Velodrome, Beethoven, and Curve. I think deepening that liquidity should be the goal. That being said, QiDao is community-run, so final say goes to the DAO. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.104166666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/Benjamin.lens",
                    "index": "7",
                    "likes": "3",
                    "time": "04/07/2022-05:05:50",
                    "content": "QiDao is stable at the moment. These incentives are meant to help catalyze further growth on Optimism. Aside from that, having official support from the Optimism community will help divert more QiDao resources into building on Optimism. This will result in more QiDao products on Optimism, like QI staking and adding OP as collateral for MAI. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.666666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/UncutGems",
                    "index": "8",
                    "likes": "1",
                    "time": "04/07/2022-19:10:45",
                    "content": "Please make this happen, QiDAO has been one of the OG stablecoin/defi protocol, battle tested. I have been enjoying OP defi yields during the past month or so, this partnership will make OP defi opportunities more attractive. Im all for it! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 7.1875
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "9",
                    "likes": "1",
                    "time": "04/07/2022-21:20:55",
                    "content": "Hey hello. Two things.  1m $OP sounds like a bit too much considering this is for LP incentives of a protocol and your TVL Can you rename the title to Phase 2 since this proposal is too late to be included in Phase 1 which is just now concluding?  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/fewol",
                    "index": "10",
                    "likes": "0",
                    "time": "04/07/2022-22:24:12",
                    "content": "The amount asked is way to much for the metrics of the project ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Benjamin.lens",
                    "index": "11",
                    "likes": "0",
                    "time": "05/07/2022-17:09:26",
                    "content": "Thank you for your support! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Benjamin.lens",
                    "index": "12",
                    "likes": "0",
                    "time": "05/07/2022-17:11:44",
                    "content": " would love to hear your suggestion on this. I think this would be great for the OP token, as less people would be pushed to sell it. Afaik Phase 1 started on June 23rd. Is there an announcement to it ending already?  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 6.888888888888889
                },
                {
                    "author_link": "https://gov.optimism.io/u/Benjamin.lens",
                    "index": "13",
                    "likes": "0",
                    "time": "05/07/2022-17:30:43",
                    "content": "As alluded to on the proposal, QiDao is currently voting on accepting OP as collateral for 0% interest loans. link to vote: Snapshot The benefits to OP are tremendous. Users will be able to hodl OP long term while using its value. In contrast to other protocols with similar functionalities, QiDao does not charge any interest- only a small repayment fee. This incentivizing people to keep their OP locked. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.255208333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "14",
                    "likes": "1",
                    "time": "05/07/2022-17:36:53",
                    "content": "One input on Phase 1, there wont be any Phase2/3 or 4, Phase 1 is continuous activity as long as all fund are not distributed. Source On the proposal, I dont think using 1M OP token on just LP incentives is right move as it will only bring artificial liquidity. Unfortunately, I dont have any other suggestion. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party giving entirely negative feedback on proposal"
                    ],
                    "Sentiment": 4.175595238095238
                },
                {
                    "author_link": "https://gov.optimism.io/u/ScaleWeb3",
                    "index": "15",
                    "likes": "0",
                    "time": "05/07/2022-17:54:15",
                    "content": "QiDao is an interesting project for Optimism but it’s growth through basic liquidity incentives is not the optimal use of Op tokens. We prefer to fund long-term growth initiatives. For starters, some part may be good for liquidity initiatives to move users over to Optimism, establish long-term, deep enough liquidity pools and get users to lock funds and mint Mai. We look forward to see most of the incentives targeted towards growing an ecosystem around QiDao/Mai on Optimism or in a way that utilizes Optimism (ecosystem) well. You could incentivize builders, integrations, partners - even leverage success tokens to help your partner projects onboard to Optimism too. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.428571428571428
                },
                {
                    "author_link": "https://gov.optimism.io/u/Benjamin.lens",
                    "index": "16",
                    "likes": "3",
                    "time": "05/07/2022-21:11:16",
                    "content": "    ScaleWeb3:  For starters, some part may be good for liquidity initiatives to move users over to Optimism, establish long-term, deep enough liquidity pools and get users to lock funds and mint Mai.   Thank you for your feedback. The liquidity incentives for MAI on Optimism are geared towards intaking the high demand for borrowing MAI that we currently see in that chain. Debt ceilings are currently 0. We slowly increase that debt ceiling based on the peg and the available liquidity for MAI on that chain. In terms of levering other protocols, Beefy just launched on Optimism. We have a long standing partnership with Beefy and adding their interest-bearing tokens as collateral for MAI. In order to allow users to freely lever those assets, we also need deeper liquidity for MAI (aside from the liquidity that we are already incentivizing on Optimism). As you can see, a lot of growth does depend on liquidity mining. We, as QiDao, can’t allocate more incentives to grow liquidity on Optimism without some support from Optimism itself. As we see that support, we can increase our activity on Optimism.     Benjamin.lens:  10% of tokens will be distributed in the form of grants to users and developers building tools and partnerships to help the protocol grow its presence on Optimism.   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.801923076923076
                },
                {
                    "author_link": "https://gov.optimism.io/u/fierydev",
                    "index": "17",
                    "likes": "1",
                    "time": "06/07/2022-05:05:20",
                    "content": "LFG! Looking forward to this! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "18",
                    "likes": "0",
                    "time": "06/07/2022-09:20:19",
                    "content": "After giving some thought, I think 900K OP token for LP incentives are not aligned to our long term sustainable growth. This will only encourage short term artificial liquidity and I wont be supporting this proposal in the current form. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party giving negative feedback on proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.666666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/fig",
                    "index": "19",
                    "likes": "0",
                    "time": "06/07/2022-14:45:03",
                    "content": "I am appreciative of two things in this proposal:   the candidness with distribution   the 1:1 (100%) match with QI       Benjamin.lens:  Over what period of time will the tokens be distributed?   Liquidity Incentives : 6 to 12 months depending on OP token price.   Grants Incentives: 3 to 6 months depending on the OP token price.     Lots of projects promise 6 months, or 9 months of runway - however it is not reflective of how a DAO is truly run and how runway is calculated. USD price is still the standard for accounting and budgeting. More money = more grants = more months. It is my understanding that the team can still apply if there are funds remaining GF: Phase 1 after voting cycle 2 concludes. Thursday 3 pm ET Voting Cycle 3 will begin for the recent projects which have progressed into the [FINAL] stage. As for the merit of liquidity mining - yes it can be artificial volume. But is it lucrative enough to attract users to Optimism from other chains? If the answer is yes, then the program may be worth it. Question for the @Benjamin.lens team: would you consider matching incentives in $MAI? QI is better than nothing but still an inflationary token. A more stable asset leads to more retention. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.2250000000000005
                },
                {
                    "author_link": "https://gov.optimism.io/u/EMELA",
                    "index": "20",
                    "likes": "1",
                    "time": "06/07/2022-14:52:45",
                    "content": "A great proposal. Lets see what others feel about it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Benjamin.lens",
                    "index": "21",
                    "likes": "1",
                    "time": "06/07/2022-15:48:36",
                    "content": "Thank you for your support! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/bakgwei",
                    "index": "22",
                    "likes": "1",
                    "time": "07/07/2022-12:17:15",
                    "content": "I have been using QiDao for a long time - good proposal considering their strong ecosystem. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.805555555555555
                },
                {
                    "author_link": "https://gov.optimism.io/u/porguitar",
                    "index": "23",
                    "likes": "1",
                    "time": "08/07/2022-08:37:50",
                    "content": "I join QiDAO on polygon chain and quite impress on their Mai token and it would be great if the platform also come to Opmimism. Looking forward to. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/shridhar.eth",
                    "index": "24",
                    "likes": "1",
                    "time": "09/07/2022-01:53:32",
                    "content": "Good idea,it will help to improve optimism ecosystem. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "25",
                    "likes": "3",
                    "time": "09/07/2022-10:07:16",
                    "content": "just notice your comment on MakerDao proposal, care to provide some more info why you are supporting MakerDao proposal when they are not even offering a co-incentives and here you are requesting them to consider matching with $MAI ? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://gov.optimism.io/u/panukresko",
                    "index": "26",
                    "likes": "1",
                    "time": "09/07/2022-15:23:16",
                    "content": "Happily vouching for this proposal. If you are not familiar with the protocol they are trusted - having a combined TVL north of 200m before this downswing - dont remember exact figures. There is also a lot of collaborative effort in their Gauge votes and community engagement overall. MAI the stablecoin - the main product - is definitely battle tested and has liquidity everywhere. Also, QiDao just passed a governance vote adding vault for the OP-token. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.857638888888888
                },
                {
                    "author_link": "https://gov.optimism.io/u/geekvine",
                    "index": "27",
                    "likes": "1",
                    "time": "09/07/2022-17:56:34",
                    "content": "As coauthor of the proposal and a briber of Optimism vaults, I can say that we are aligned with long term growth on the network @ScaleWeb3. We have a group of strong Optimism supporters that have lead to much of the TVL growth of QiDao on Optimism without liquidity for the governance token, and before there were even incentives to deposit minted MAI anywhere. We will continue to push growth on the platform with or without an $OP grant, but I want to make it clear that we plan on continuing the protocol’s expansion into Optimism regardless. I certainly hope we can align those goals with those of the long term growth of Optimism. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.706349206349206
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "28",
                    "likes": "0",
                    "time": "09/07/2022-23:29:50",
                    "content": "    Benjamin.lens:  Afaik Phase 1 started on June 23rd. Is there an announcement to it ending already?   Yeah my bad. I meant to say round 2 of phase 1, but that is not needed for the proposal. Disregard my comment. Still I think that 900k $OP (90% of requested amount) for a project of your side distributes as incentives over 6 to 12 months is too much and not optimal. And generally 1 million $OP is a big ask imo. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party giving entirely negative feedback on proposal"
                    ],
                    "Sentiment": 4.35
                },
                {
                    "author_link": "https://gov.optimism.io/u/Benjamin.lens",
                    "index": "29",
                    "likes": "2",
                    "time": "11/07/2022-01:09:50",
                    "content": "Hi everyone, thank you for all the support messages! We’re excited to be a part of the Optimism community and wish to continue allocating resources to our deployment here. For those that still have some reservations, we want to address your concerns with some updates to our proposal.  Incentive amount new amount: 750k OP Breakdown on incentives QiDao is currently providing to Optimism users:  Beethoven/Balancer pool: 15,000 QI per week Curve pool: 3,000 QI per week Borrowing incentives: 40,590 QI per week  Total QI incentives: 3,046,680 QI annualized ($761,644). Total OP incentives requested: 750,000 OP annualized ($457,844). Not only is QiDao matching incentives, we’re exceeding proposed incentives on Optimism by 1.7x. Currently, demand for borrowing MAI on Optimism has been overwhelming - debt ceilings on our vaults don’t last more than a few seconds. Added liquidity onchain will allow us to increase debt ceilings and provide for more locked tokens on Optimism via lending.  Allocation of incentives 20% for bounties on teams building on top of QiDao on Optimism 20% for borrow incentives 60% for MAI liquidity on Optimism (spread between Velodrome and Curve over the course of a year)  Plans for use cases of MAI on Optimism Lending MAI has been approved into Aave by its governance and its listing is imminent. DEXs MAI is already present on all major DEXs on Optimism thanks to QiDao’s incentives program and partnerships on the chain. Derivatives QiDao will look to partner with derivatives platforms on Optimism, such as Lyra. Bridges MAI is already listed on cBridge and Multichain. We will work with Hop to get listed on their bridge as well to provide more avenues for bridging MAI into Optimism from its 20 chains.  Other partnerships coming for QiDao on Optimism Beefy QiDao has a long-standing relationship with Beefy. We will continue to add their interest-bearing assets as collateral for MAI as this market grows on Optimism. Arrakis The QiDao community has approved the use of GUNI positions on Uniswap V3 as collateral for MAI. As GUNI liquidity grows on Optimism, we will be able to use them as collateral for MAI. Optimism Our DAO recently approved OP as collateral for MAI. This will provide a major use case for OP holders. They will be able to mint MAI at 0% interest, thereby allowing them to use the value of their OP without having to sell it.  Optimism Alliance We have a community within our DAO that is committed to our growth on Optimism. They call themselves the Optimism Alliance. They have been bribing our voters weekly to vote in favor of Optimism vaults to receive borrow incentives. That has earned Optimism an added $10,000 of incentives per week! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.907272727272728
                },
                {
                    "author_link": "https://gov.optimism.io/u/Benjamin.lens",
                    "index": "30",
                    "likes": "1",
                    "time": "11/07/2022-01:18:33",
                    "content": "UPDATED PROPOSAL Project Name: Qi Dao Author Name: @geekvine and @benjaminqidao Number of OP tokens to claim: 750,000 OP L2 Recipient Address: 0xB1a8D1D6Dc07ca0e1E78a0004aa0bB034Fa73d60 DefiLlama TVL on Optimism: $3.61M Proposal for token distribution: Distribute OP tokens to QiDao to grow the protocol on Optimism.  Rationale: QiDao is a decentralized collateralized debt position stablecoin protocol where users can deposit tokens as collateral to issue MAI, the protocol’s decentralized stablecoin. It is the largest stablecoin protocol on Polygon, Fantom, Gnosis Chain, Moonbeam, and Moonriver. QiDao was deployed on Optimism two months ago and has seen explosive growth in relation to other chains the protocol is operating on. The goal of this proposal is to explain how to use this grant to increase the growth of QiDao and the Optimism Ecosystem. QiDao is well integrated into the Optimism DeFi ecosystem, having sizeable liquidity on all major DEXs and bridges. MAI has also been accepted into Aave V3. Future integrations include Beefy, with whom QiDao has a multichain strategy with, Arrakis, and Optimism token (adding OP as collateral for MAI). Additionally, QiDao has a community within its DAO that is committed to growth on Optimism. They call themselves the Optimism Alliance. They have been bribing QI voters weekly to vote in favor of Optimism vaults to receive borrow incentives. That has earned Optimism an added $10,000 of incentives per week!  How will the OP tokens be distributed? 20% for bounties on teams building on top of QiDao on Optimism 20% for borrow incentives 60% for MAI liquidity on Optimism (spread between Velodrome and Curve over the course of a year) Breakdown on incentives QiDao is currently providing to Optimism users:  Beethoven/Balancer pool: 15,000 QI per week Curve pool: 3,000 QI per week Borrowing incentives: 40,590 QI per week  Total QI incentives: 3,046,680 QI annualized ($761,644). Total OP incentives requested: 750,000 OP annualized ($457,844). Not only is QiDao matching incentives, we’re exceeding proposed incentives on Optimism by 1.7x. Supporting MAI liquidity on Optimism will encourage users to lock value on Optimism in the form of collaterals. Since MAI charges a repayment fee and no interest, locked value has a longer lifespan than it does on other lending and stablecoin platforms. This is due to users being incentivized to keep their debt positions open.  How will this distribution incentivize usage and liquidity on Optimism? QiDao has voted to add OP as collateral for MAI (for 0% interest loans). This will allow OP hodlers to mint stablecoins against their OP instead of selling. If Optimism supports MAI liquidity, then more users will choose to borrow against OP rather than selling it. MAI has consistently been a top volume provider for Curve on Fantom and Polygon, where MAI is the largest stablecoin protocol. This is because MAI pools have a higher volume to TVL ratio than most native stablecoins outside of Ethereum. Growing MAI’s liquidity will allow more users to bridge value from other chains. MAI is currently one of the most crosschain tokens in crypto, with 20 chains available. As a result, it functions as an effective transfer of value across chains. MAI’s 0% interest and repayment fee model encourages users to lock tokens on their home chain and keep loans open. This creates a resilient TVL for Optimism.  Why will the incentivized users and liquidity remain after incentives dry up? For the past few months, QiDao has operated on a net profit (revenue has exceeded emissions). This shows that QiDao has built a durable model that can thrive without outsized emissions. After OP incentives end, QiDao will continue to incentive usage on Optimism as it has for the past several weeks.  Over what period of time will the tokens be distributed?  Liquidity Incentives : 6 to 12 months depending on OP token price. Borrow Incentives: 6 to 12 months depending on OP token price. Grants Incentives: 3 to 6 months depending on the OP token price.   How much will your project match in co-incentives? All incentives will be exceed by our emissions to Optimism users. Currently, QiDao will give $1.7 for every $1 of OP incentives. OP token vaults will receive borrow incentives based on a bi-weekly community gauge. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.642261904761905
                },
                {
                    "author_link": "https://gov.optimism.io/u/fig",
                    "index": "31",
                    "likes": "0",
                    "time": "11/07/2022-13:58:33",
                    "content": "Hey! Good question - For Maker, it is a proven protocol, with clear market fit for both DAI and other product lines. QiDAO is a bit more nascent. For Maker to match - let alone pursue this proposal - is very bureaucratic. By partnering with Maker, the benefit seems to be twofold - unparalleled marketing, encouraging the largest DeFi protocol by TVL to integrate with Optimism. For $MAI - AFAIK there are much less strict minting requirements compared to DAI and is a great way to spread adoption and liquidity across the ecosystem. Disclaimer: We are also a MakerDAO delegate. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.505208333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/Benjamin.lens",
                    "index": "33",
                    "likes": "0",
                    "time": "11/07/2022-18:37:08",
                    "content": "Just want to note that we have very strict requirements to be added as collateral - more comparable to Aave. So I don’t agree with your last point. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.166666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/fig",
                    "index": "34",
                    "likes": "1",
                    "time": "11/07/2022-19:00:06",
                    "content": "Thanks for the correction here - seems the summer heat is getting to me. Advocating for $MAI as match both to benefit users and the growth of the stablecoin. Supportive of your proposal revision. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/Defi_LATAM_axlvaz",
                    "index": "35",
                    "likes": "2",
                    "time": "12/07/2022-13:53:46",
                    "content": "I like the correctness of the requested funds, the distribution of incentives and the timing. They also include great co-incentives. TVL and QiDAO’s work in my opinion is very good. Great job! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 9.516666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/Bobbay_StableLab",
                    "index": "36",
                    "likes": "1",
                    "time": "13/07/2022-09:58:39",
                    "content": "The updated proposal creates a win-win for both parties so we are in favor of supporting it. ",
                    "links": [
                        "https://gov.optimism.io/t/voting-cycle-4-roundup/3055/13"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/Benjamin.lens",
                    "index": "37",
                    "likes": "5",
                    "time": "13/07/2022-19:19:44",
                    "content": "We’ve switched the proposal to “ready”! Thank you to everyone for your support and thoughtful commentary. The proposal that we have today has been amended to account for the feedback given in the forum and elsewhere. I believe it is a fair proposal and will benefit the Optimism community greatly. Looking forward to continuing our work! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "38",
                    "likes": "0",
                    "time": "25/07/2022-20:01:44",
                    "content": "Voted: Yes Pros:  Co-incentives matched by 170% Can use OP as a collateral- Thank you for doing this. Distribution seems fair. Project has liquidity on other chain.  Cons  Token distribution gap of 6months is quite big  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party giving entirely positive feedback on proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.958333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "39",
                    "likes": "0",
                    "time": "26/07/2022-15:31:11",
                    "content": "I actually met someone from your team in ETHBarcelona … or was it ETHCC … I ehm … don’t remember! We talked a bit about the protocol and how it works which helped me understand a bit more about your protocol. Thank you for adjusting the proposal to our comments. I am a bit reluctant here, but will vote a reluctant yes: PROS  took feedback from us and adjusted proposal matching incentives and higher than the amount requested (considering OP price at time of proposal), 1.7x!  CONS  requested OP is a bit high in my opinion  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.215625
                },
                {
                    "author_link": "https://gov.optimism.io/u/katie",
                    "index": "40",
                    "likes": "0",
                    "time": "26/07/2022-18:29:38",
                    "content": "Voted yes - Awesome incentives and updating the proposal based on feedback. Thank you for a well thought out proposal! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/linda",
                    "index": "41",
                    "likes": "0",
                    "time": "26/07/2022-23:15:40",
                    "content": "I am a weak yes on this proposal. The amount requested is high but it’s good to see the amount of usage so far on Optimism and other chains. I also like that QiDao will give $1.7 for every $1 of OP incentives. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party giving entirely positive feedback on proposal"
                    ],
                    "Sentiment": 5.460000000000001
                },
                {
                    "author_link": "https://gov.optimism.io/u/quix",
                    "index": "42",
                    "likes": "0",
                    "time": "27/07/2022-00:41:13",
                    "content": "We voted yes on this proposal. Although the amount requested is high compared to Optimism TVL, the team has a strong track record & significant TVL on other chains, and the incentive structure seems well designed for growth on Optimism. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.054166666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/lazeeeerlin",
                    "index": "43",
                    "likes": "0",
                    "time": "27/07/2022-06:00:40",
                    "content": "support it, because chinese items is so rare. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/ScaleWeb3",
                    "index": "44",
                    "likes": "0",
                    "time": "27/07/2022-15:12:55",
                    "content": "Voting Yes this time as QiDao can contribute meaningful value with this proposal. Value-add: Good (Size of project, Ecosystem involvement) Amount: High Op distribution: Okay-Good Co-incentives: Good Feedback was incorporated, the proposal is slightly more detailed and Op gets distributed slightly better. The incentive design is possibly lasting and positive for Optimism and the good co-incentives justify the high Ask. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party giving entirely positive feedback on proposal"
                    ],
                    "Sentiment": 7.06694214876033
                },
                {
                    "author_link": "https://gov.optimism.io/u/Crypto_A_S",
                    "index": "45",
                    "likes": "0",
                    "time": "27/07/2022-18:25:14",
                    "content": "Big fan of the QiDao team. They have a proven track record on multiple chains and it’s reflected in this proposal. Value Added to Optimism: High OP Requested: Good Co-incentives: Great OP Distribution Plan: Good ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.966666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/zengjiajun.eth",
                    "index": "46",
                    "likes": "0",
                    "time": "27/07/2022-23:09:19",
                    "content": "Nice Maker fork. Proven success in Polygon. I have voted for it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/polynya",
                    "index": "47",
                    "likes": "0",
                    "time": "28/07/2022-03:47:00",
                    "content": "Voted For - I see you’re popular on Polygon PoS, I hope you’ll communicate to your audiences the benefits of rollups and Optimism specifically. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Benjamin.lens",
                    "index": "48",
                    "likes": "0",
                    "time": "29/07/2022-04:25:26",
                    "content": "Thank you to everyone that has voted thus far! At QiDao, we’re hard at work to deliver on our promise to bring value to Optimism. We’ve just launched OP as collateral for MAI. This means users will be able to mint MAI at 0% interest against OP tokens. On top of that, we’ll be providing a heavy incentives package to those that borrow MAI against OP. These incentives will be live on Sunday. Borrow incentives for BTC vault are already live. If you have any questions/comments/suggestions, please come to our Discord. Will be happy to chat  Launch announcement: https://twitter.com/QiDaoProtocol/status/1552845396740898816?s=20&t=8usqlzc5fnRi_an3xcWEmw ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.066287878787879
                },
                {
                    "author_link": "https://gov.optimism.io/u/arabianhorses",
                    "index": "49",
                    "likes": "0",
                    "time": "29/07/2022-07:00:30",
                    "content": "    Benjamin.lens:  , then more users will choose to borrow against OP rather than selling it.   make sense my vote is for ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/SEED_LATAM_Joxes",
                    "index": "50",
                    "likes": "3",
                    "time": "30/07/2022-21:44:40",
                    "content": "[Final] Voting: Yes Qi Dao is a well-known protocol in our communities, providing benefits to those interested in taking out a loan. Amount of incentives in different strategies + co incentives is welcome, in addition to allocating for builders.  Contribution: Positive  OP distribution: Appropriate  Co-incentives: Yes  Impact in LATAM: Positive   Tips: Please keep the community informed about all this progress and new features added. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.338068181818182
                },
                {
                    "author_link": "https://gov.optimism.io/u/lvlojei",
                    "index": "51",
                    "likes": "0",
                    "time": "03/08/2022-06:29:39",
                    "content": "Hi fam Thank you for your support  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/krzkaczor",
                    "index": "52",
                    "likes": "0",
                    "time": "03/08/2022-17:01:18",
                    "content": "Abstain due to the conflict of interest (I am involved in MakerDAO) Project quality: Mid - not too well-known project / just one open source repo Team quality: Mid - mostly anon Amount requested: Reasonable/High - 750k - for a year OP distribution - GOOD - matching incentives with own issuance, provides cheap loans for OP users. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party giving entirely positive feedback on proposal"
                    ],
                    "Sentiment": 6.296875
                },
                {
                    "author_link": "https://gov.optimism.io/u/vonnie610",
                    "index": "53",
                    "likes": "0",
                    "time": "04/08/2022-12:54:44",
                    "content": "Snapshot vote - passed ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "54",
                    "likes": "0",
                    "time": "04/08/2022-17:07:55",
                    "content": "@geekvine and @Benjamin.lens, can you provide a Telegram handle or other contact method so the Optimism team can get in touch about paying out this grant! Feel free to comment on this thread, DM, or email justine@optimism.io ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.609375
                },
                {
                    "author_link": "https://gov.optimism.io/u/Benjamin.lens",
                    "index": "55",
                    "likes": "0",
                    "time": "05/08/2022-02:05:10",
                    "content": "We have a chat with the Optimism team. Please ask your team members to add you @justine_hy ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "56",
                    "likes": "0",
                    "time": "13/09/2022-19:55:25",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "57",
                    "likes": "0",
                    "time": "09/01/2023-15:17:06",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "58",
                    "likes": "0",
                    "time": "09/01/2023-15:17:42",
                    "content": "HI @Benjamin.lens! It’s been a few months since the OP grant distribution, do you have a grant update you could share with the community here? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/f10tn",
                    "index": "59",
                    "likes": "0",
                    "time": "16/01/2023-12:33:07",
                    "content": "QiDao very stranght project ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Floyd11",
                    "index": "60",
                    "likes": "2",
                    "time": "16/01/2023-12:44:38",
                    "content": "Currently, QiDao is stable. These incentives are intended to stimulate additional growth on Optimism. Furthermore, receiving official support from the Optimism community will allow for more QiDao resources to be directed towards building on Optimism. This will lead to more QiDao offerings on Optimism, such as staking for QI and using OP as collateral for MAI. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.25
                }
            ]
        }
    ],
    "group_index": "129"
}