{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/draft-gf-phase-1-proposal-attestation-station-interface/4827",
            "title": "[DRAFT] [GF: Phase 1 Proposal] Attestation Station Interface ",
            "index": 4827,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Grants Council"
            ],
            "tags": [
                "season-3",
                "cycle-10",
                "passed"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/soyboy",
                    "index": "1",
                    "likes": "4",
                    "time": "26/01/2023-16:52:03",
                    "content": "Project name: Attestation Station Interface Author name and contact info (please provide a reliable point of contact for the project):  Soyboy Vegan sbvegan@protonmail.com  I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: Yes I understand that I will be expected to following the public grant reporting requirements outlined here: Yes L2 recipient address: 0x5EfF4B8c042AA6003cBDA6E32C4aA23657d3b6AF Which Voting Cycle are you applying for?: 10 Which sub-committee should review your proposal? Builders Grants Project description (please explain how your project works):  For context: The AttestationStation is an attestation smart contract deployed on Optimism. The goal of the AttestationStation is to provide a permissionless and accessible data source for builders creating reputation-based applications. By enabling anyone to make arbitrary attestations about other addresses, we can create a rich library of qualitative and quantitative data that can be used across the ecosystem. This project provides a no-code solution for builders and community members to directly interact with the AttestationStation  smart contract. This means anyone can read or write to the contract using this tool. It is already live for community use and has already been put to use for the distribution of the RPGF voting badges. I would like to extend this tool to allow users to make multiple attestations with a single transaction, allow users to view attestations they’ve made and attestations made about them.  Project links:  Website: https://attestationstation.xyz/  Github: GitHub - sbvegan/attestation-station-interface: An open source interface for Optimism's AttestationStation -- a data primative for making arbitrary attestations about Ethereum addresses.   Additional team member info (please link): n/a Please link to any previous projects the team has meaningfully contributed to: Only minor open source contributions made in the past. Relevant usage metrics (TVL, transactions, volume, unique addresses, etc. Optimism metrics preferred; please link to public sources such as Dune Analytics, etc.):  ~1,500 unique visitors in the past 30 days Used as a tool for RPGF badge distribution  Competitors, peers, or similar projects (please link): n/a Is/will this project be open sourced? Yes (currently is) Optimism native?: Yes Date of deployment/expected deployment on Optimism: It’s been deployed since November 2022, but it isn’t a smart contract project. Ecosystem Value Proposition:  What is the problem statement this proposal hopes to solve for the Optimism ecosystem? The Attestation Station is new. There is very little awareness around it, what it does, and how it can be utlized. How does your proposal offer a value proposition solving the above problem? Extending the Attestation Station Interface will provide builders and community members a no-code solution for interacting with the Attestation Station and viewing a historical record of attestations made. Why will this solution be a source of growth for the Optimism ecosystem? As more builders gain awareness around the AttestationStation there will be more individuals who can build the reputation related applications that it was meant for. This means we can see a new class of applications emerge on Optimism.  Has your project previously applied for an OP grant? No. Number of OP tokens requested: 20,000 OP Did the project apply for or receive OP tokens through the Foundation Partner Fund?: No If OP tokens were requested from the Foundation Partner Fund, what was the amount?: n/a How much will your project match in co-incentives? n/a Proposal for token distribution: I acknowledge and will comply with the 1-year lockup rule for Builder’s Grants. Milestones This a proposed timeline for feature completion based on the new milestone assessment, so these will be determined by the builders sub-comittee. These are the milestones:   My Attestations [critical]: a new feature and section on the interface that will allow users to view attestations they have made and attestations made about them. The source of truth: this feature will be deployed to: https://attestationstation.xyz/. Estimated time of completion: Mid-Late Q2.  Batch Attestations [critical]: a new feature that will allow users to make batch attestations with a single on-chain transaction. The source of truth: this feature will be deployed to: https://attestationstation.xyz/. Estimated time of completion: Mid-Late Q3.  Note: I currently don’t have any benchmark milestones. The data analytics I can see at the moment are the numbers of visitors to the web application over the last 30 days. Note: After these milestones are completed I plan to continue work on the project by making UX improvements and start work on a second iteration of the project. The plan is to create an AttestationStation explorer, something akin to etherscan, but for attestations (and schemas when they’re implemented). Please provide any additional information that will facilitate accountability: Anyone can track my progress on github: GitHub - sbvegan/attestation-station-interface: An open source interface for Optimism's AttestationStation -- a data primative for making arbitrary attestations about Ethereum addresses. New features will be released to production as they’re ready. ",
                    "links": [
                        "https://community.optimism.io/docs/governance/attestation-station/#general-faq",
                        "https://attestationstation.xyz/",
                        "https://github.com/sbvegan/attestation-station-interface",
                        "https://gov.optimism.io/t/milestone-assessment/5314",
                        "https://attestationstation.xyz/",
                        "https://attestationstation.xyz/",
                        "https://github.com/sbvegan/attestation-station-interface",
                        "https://gov.optimism.io/t/cycle-10-grant-review-roundup/5284",
                        "https://gov.optimism.io/t/cycle-10-final-grants-roundup/5418"
                    ],
                    "GPT-summary": "The author of the proposal, Soyboy Vegan, is requesting a grant from the Optimism Foundation for the Attestation Station Interface project. The project aims to provide a permissionless and accessible data source for builders creating reputation-based applications. The proposal outlines the features of the project and provides a timeline for completion. The proposal also includes relevant usage metrics and information about the team. The post includes constructive criticism and questions from third parties, and the author is open to collaboration.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Smart contract updates",
                        "Community and engagement",
                        "Token economics",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.26840564738292
                },
                {
                    "author_link": "https://gov.optimism.io/u/Ovetta",
                    "index": "2",
                    "likes": "1",
                    "time": "26/01/2023-17:45:02",
                    "content": "Hello Soyboy, I’m curious as to how inaccurate or blatantly false attestations (by clerical error or trolls) are corrected.  Is there a system moderator or a change-log to ensure the attestatations are correct?   Thank you. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 3.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/soyboy",
                    "index": "3",
                    "likes": "1",
                    "time": "26/01/2023-18:12:07",
                    "content": "The smart contract that the interface is interacting with is permissionless by design. So there is no way to moderate it, but anyone is able to make or read the attestations. It would be mainly community regulated to identify good and bad actors. The goal of the system is to have reputation based applications built on top of it. Its the jumping off point for other applications to be built. This digital primitive can serve as the foundation of a web of trust that can be built on blockchains. If a reputable address (for example: OP Labs, Gitcoin, ETHGlobal, etc.) makes an attestation, individuals and applications can take their word for it. For example, say I’ve completed a few grants for different organizations. If I did a good job, each organization can make an attestation about my quality of work and now I have on-chain attestations claiming I’m good for this type of work. So the reputation has to be built up over time. Of course it can be gamed but behaving as a bad actor will most likely result in punishment by others not willing to play with you when you break the rules. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.730820105820106
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "4",
                    "likes": "0",
                    "time": "30/01/2023-21:31:00",
                    "content": "Hi, @soyboy Thanks for applying to the Builders Grant program. I would love to talk more about your app, I’ve tried to use it in the past, and looks great. Is there a way to connect with you outside the forum and set up a call? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 6.458333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/soyboy",
                    "index": "5",
                    "likes": "1",
                    "time": "30/01/2023-21:33:56",
                    "content": "Yes of course! You can reach me at sbvegan@protonmail.com or twitter and we can set up a zoom or google meet. My schedule is rather open at the moment. If you just let me know a few times that work for you, I’m sure I can make it work. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/fig",
                    "index": "6",
                    "likes": "0",
                    "time": "31/01/2023-15:07:04",
                    "content": "Hi @soyboy  - I notice you also self-nominated for Tooling & Utilities which is great. We too have been building a similar tool for attestations which is live and being discussed here. My question for the community - is it reasonable to apply for a Grant and retroactive funding? Would be great to have some sort of guidelines here so teams like @soyboy and ours can better understand! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 7.134469696969697
                },
                {
                    "author_link": "https://gov.optimism.io/u/FractalVisions",
                    "index": "7",
                    "likes": "0",
                    "time": "31/01/2023-15:44:55",
                    "content": "You could always apply for a grant with the intention to pay it back in full to the foundation if nominated for RPGF and receive funding. It’s up to the Citizens house to approve of course so it’s at the discretion of the governance. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.875
                },
                {
                    "author_link": "https://gov.optimism.io/u/fig",
                    "index": "8",
                    "likes": "1",
                    "time": "31/01/2023-16:07:12",
                    "content": "Good point! Didn’t think of this model. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.375
                },
                {
                    "author_link": "https://gov.optimism.io/u/soyboy",
                    "index": "9",
                    "likes": "1",
                    "time": "31/01/2023-16:34:10",
                    "content": "The way that I looked at it was the RPGF nomination is for what I’ve already built. This grant is looking for compensation to add more features to the project and keep the momentum going. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/FractalVisions",
                    "index": "10",
                    "likes": "2",
                    "time": "31/01/2023-17:32:23",
                    "content": "It was a suggestion by @Michael in one of the community calls… Waiting until this round of RPGF is over to apply for such a thing may be more appropriate at this point though seeing as how the time for nominations is about to lapse over grant submissions. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "11",
                    "likes": "2",
                    "time": "23/02/2023-17:44:10",
                    "content": "hey @soyboy wanted to point you to Milestone Assessment . Aligning milestones with this is not mandatory for cycle 10 but you can get a better score on the final review if you implement it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/soyboy",
                    "index": "12",
                    "likes": "3",
                    "time": "23/02/2023-23:24:48",
                    "content": "Thank you for the heads up. I edited the OP to add a milestone section with the new milestone assessment y’all have outlined. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.681818181818182
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "13",
                    "likes": "1",
                    "time": "26/02/2023-12:48:33",
                    "content": "Hey, @soyboy do you have an approximate date for critical milestone delivery? It could be something like Q2 or Q4 2023. Do you mind adding this to the milestones if possible? thank you! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.333333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/soyboy",
                    "index": "14",
                    "likes": "2",
                    "time": "26/02/2023-17:02:25",
                    "content": "Updated! These are estimated timelines and will probably be delivered before hand. I’m just giving myself a little buffer because I have a full time job and a newborn, so my bandwidth is tight at the moment. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.973214285714286
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "15",
                    "likes": "1",
                    "time": "26/02/2023-22:28:04",
                    "content": "Is there a way to see onchain evidence of the use of this interface or perhaps some other API that could register when an attestation is made or dapp enabled through this tool? Think that could be a useful benchmark. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.4375
                },
                {
                    "author_link": "https://gov.optimism.io/u/soyboy",
                    "index": "16",
                    "likes": "1",
                    "time": "26/02/2023-22:52:33",
                    "content": "I’m sure there is something out there, but I don’t know of any tools off the top of my head. I need to do some research first and then work on getting that implemented. In terms of priority, would the analytics functionality come before or after the functionality outlined in the grant so far? Note: it would have to be an api or something custom built. The app goes directly through the deployed smart contract so there’s not an accurate way to track it on-chain. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 6.474489795918368
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "17",
                    "likes": "1",
                    "time": "27/02/2023-20:10:59",
                    "content": "also – have you seen this? [DRAFT] [GF: Phase 1 Proposal] Attestation Station Interface - #16 by soyboy ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/soyboy",
                    "index": "18",
                    "likes": "1",
                    "time": "27/02/2023-20:56:15",
                    "content": "I think this might have been meant for someone/where else, just pinging to make sure it goes to the right person(s). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.9642857142857135
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "19",
                    "likes": "3",
                    "time": "27/02/2023-21:04:13",
                    "content": "it was intended for you but was the wrong link! meant to post this - [DRAFT][GF: Phase 1 Proposal] Clique wanted to get your thoughts on complementarity / differences this isn’t a competition, tbc – we believe in backing multiple good approaches. but helps to get a lay of things ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.125
                },
                {
                    "author_link": "https://gov.optimism.io/u/soyboy",
                    "index": "20",
                    "likes": "3",
                    "time": "27/02/2023-22:07:46",
                    "content": "I think the main differentiation is that Clique is building out more specific identity applications with ZK proving system and the Attestation Station Interface is more of a general purpose attestation explorer. Atm, my project is pretty basic, but the vision is it to become an “etherscan like explorer” for the AttestationStation smart contract. With a backend application for indexing, it has the potential to feature Clique social applications. The optimism team is also working on a schema system, and my project has the potential to aggregate these schemas to mapping this complex attestation ecosystem that may emerge. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.589285714285714
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "21",
                    "likes": "2",
                    "time": "27/02/2023-22:35:29",
                    "content": "thanks for the thoughtful and helpful response! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/kvny2046",
                    "index": "22",
                    "likes": "3",
                    "time": "27/02/2023-23:40:10",
                    "content": "Absolutely! We’d love to see ways to collaborate there – currently, we are using Dune & Flipside for visualization of the attestations made. Arguably many other indexers can be used to access the attested on-chain data for composable usage, but it would be nice to have a uniform & optimized interface! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.5625
                },
                {
                    "author_link": "https://gov.optimism.io/u/soyboy",
                    "index": "23",
                    "likes": "2",
                    "time": "28/02/2023-01:34:25",
                    "content": "Yeah I checked out the nxyz API that was posted in the AttestationStation telegram chat but it’s kind of limited. I need to research the other options you listed! But the “uniform & optimized interface” is the idea. I think it would be nice to have dedicated AttestationStation infrastructure. I think what you guys are doing is very cool! I need some more free time so I can take a deeper dive. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 6.7436224489795915
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "24",
                    "likes": "2",
                    "time": "05/03/2023-19:28:27",
                    "content": "Hi @soyboy! Can you provide a Telegram handle or other contact method so the Optimism team can get in touch about paying out this grant! Feel free to DM or email lavande@optimism.io ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.609375
                },
                {
                    "author_link": "https://gov.optimism.io/u/soyboy",
                    "index": "25",
                    "likes": "1",
                    "time": "05/03/2023-20:00:59",
                    "content": "Hey @lavande, I went ahead and emailed you with my contact information. Thank you! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "439"
}