{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/ready-builders-cycle-11-integration-of-optimism-into-airgap-vault-airgap-wallet-and-airgap-coin-lib/5402",
            "title": "[READY][Builders, Cycle 11]: Integration of Optimism into AirGap Vault, AirGap Wallet and airgap-coin-lib ",
            "index": 5402,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Grants Council"
            ],
            "tags": [
                "builders",
                "cycle-11"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/mlaeng",
                    "index": "1",
                    "likes": "5",
                    "time": "03/03/2023-13:06:52",
                    "content": " Basic Details  Project name: AirGap Wallet / AirGap Vault / airgap-coin-lib: native support for Optimism  Author name and contact info (please provide a reliable point of contact for the project.): Markus Laeng, @mlaeng, project manager (Discord: djangobits#3957, Telegram: @djangobits) Pascal Brun @pascuin, COO of Papers AG (Discord: Pascal#2765, Telegram: @Pascuin)  L2 recipient address: 0x276dcbb22b41F272F626C6D7348e93618C0ec5B4  Which Voting Cycle are you applying for?: Season 3, Cycle 11  I confirm that I have read the landing pages for the Builders 8 and Growth Experiments 10 Sub-Committees and that I have determined my proposal is best suited to be reviewed by the Builders Sub-Committee: [Yes/No]: Yes  Project Details  What are you going to build?: We will integrate Optimism into the AirGap solution and it’s open source library airgap-coin-lib.   MicrosoftTeams-image (3).jpg1600×1600 284 KB    Introduction: AirGap is an secure and airgapped self-custody wallet solution which is completely open source and free to use. The solution is comprising of two applications: AirGap Vault, installed on any mobile phone that is disconnected from the network (LTE, NFC, Bluetooth or WLAN) and hence transforms a dedicated or spare mobile device into an airgapped cold wallet. The Vault allows for random private key generation, secret storage, secret recovery and continuous check for connectivity root access and screenshot detection to prevent the device from being compromised. The second app is the AirGap Wallet, installed on any connected mobile device to facilitate transactions or broadcast transactions. Through the two-way approach, it guarantees higher security, protecting the users from any potential risks. Communications and signing of transactions are done seamlessly without the use of cables, thanks to verifiable QR-codes. To ensure top security, AirGap has a unique approach to creating a secure key by utilising various sources of entropy such as video, sound, gyroscope, and touch (optionally, dice roll and coin flip). This ensures maximum randomness and therefore results in a secure key generation. This illustrates the signing process using the two apps (click to enlarge):  AirGap_Signing_Process1806×486 139 KB  For managing smaller funds, AirGap allows users to run both apps on a single device, which still guarantees better security than using one single app. However, we recommend the approach with two devices. AirGap has currently more than 100 currencies and tokens integrated, see: Supported Currencies – AirGap. The code of AirGap Vault, AirGap Wallet and AirGap coin-lib is open sourced and the app builds are reproducible, means the app you download from the play store matches the code published on AirGap’s Github.  What we are going to build for Optimism: Our proposal includes:  1. We will integrate native OP into AirGap Vault and Wallet We will integrate the native OP token into AirGap Vault and Wallet: The Vault integration will allow users to generate and store the secrets, from which addresses for Optimism are derived, inside AirGap Vault. Secrets can be generated by using our battle proof methods of entropy collection (device sensors, coin flips, dice rolls) and features like Shamir’s Secret Sharing. The Vault can be used either with AirGap Wallet, Metamask or Rabby Wallet. More compatible wallets might be added in the future. In the AirGap Wallet Optimism users will be able to manage their Optimism addresses. They can receive or send native OP funds, see a balance incl. USD equivalent price as well as a transaction history.  2. We will include the Top-10 ERC-20 tokens (by market cap) The AirGap Wallet integration will include the most popular ERC-20 tokens on Optimism. We propose to integrate the Top-10 (by mcap) ERC-20 tokens which are currently used on Optimism. This will include Tether (USDT), USD Coin (USDC), DAI Stablecoin (DAI), Wrapped BTC (WBTC), ChainLink Token (LINK), Lido DAO Token (LDO), Frax (FRAX), Decentralized USD (USDD) and TerraUSD (UST). Additionally, we can agree to include the tokens of the most popular native Optimism projects.  3. We will add a function to import and use any ERC-20 token from Optimism Optimism users will also be able to manage any other Optimism based ERC-20 token inside AirGap Wallet, by adding it using it’s contract address. This is an additional feature we currently only support for Tezos.  4. We will integrate WalletConnect to be used to connect AirGap to Optimism dApps Using AirGap Wallet, users will be able to connect to any dAPP that offers a connection via WalletConnect. This unlocks the AirGap Wallet as one of the easy to use airgapped self custody wallets for the growing ecosystem of Optimism dApps. Currently we have a basic WalletConnect integration for Ethereum, but it needs refactoring and a possible migration to WalletConnect V2.  5. We will include Optimism in open-source developer tooling: airgap-coin-lib airgap-coin-lib is an open-sourced library that allows easy handling of the most important tasks relating to cryptocurrencies and blockchains. It implements operations such as preparing, signing and broadcasting transactions for a range of protocols. Developers can use the airgap-coin-lib to develop wallet solutions or wallet integrations. It is already used within the AirGap solution and actively maintained by Papers AG.  6. We will do marketing, documentation and community onboarding upon launch We will use our marketing and community channels to advertise the integration of Optimism tokens into AirGap. We will also support joint marketing efforts to the extent the Optimism community is open to do (e.g Twitter Space with the AirGap lead developer about the topic of self custody). AirGap users always find support in our community channels on Discord and Telegram or on Github. We have dedicated community managers taking care of these requests and who make sure to have a short response time. Optimism will also be included in our documentation, to the necessary extent, so Optimism users can find help and documentation on our pages.  7. We pledge to do continuous maintenance, testing and community support for years to come Once a protocol or token is integrated, we make sure that users can always manage their tokens using AirGap Vault and/or AirGap Wallet. Therefore we do regular maintenance (e.g. on self-hosted nodes, after protocol upgrades etc.). Testing is not only done on the initial integration, but every time new versions of our apps are shipped to the app stores and GitHub.  Why is what you are going to build going to succeed?: AirGap is an existing battle proof self custody wallet existing since more than 5 years. We already have numerous requests from Optimism users to integrate Optimism into the AirGap solution. Our developers are experienced and skilled to integrate new protocols, EVM and non-EVM alike. Our latest integrations, among others, are: Internet Computer (ICP), Astar & Shiden, Moonbeam & Moonriver, Kusama & Polkadot as well as numerous tokens on Ethereum, Tezos and other integrated protocols. Our capacity planning allows us to do new integrations within a specified timeframe.  Is your project likely to bring new builders to the Optimism ecosystem? If so, please describe how: Builders also have a need for accessible and secure wallets. On top of that, builders can choose to use the open source airgap-coin-lib to build their own wallet integrations.  Is your project likely to improve the quality of developers in the Optimism ecosystem? If so, please describe how: Offering open-sourced code and documentation can help developers to do their own proper integrations of wallet-like solutions. Our developers are accessible, ready to help and willing to improve our solution if someone decides to build on our code, eg. on the airgap-coin-lib.  Is your project likely to improve the commitment of developers in the Optimism ecosystem? If so, please describe how: Having solid tools at hand can harden the commitment of developers. The points outlined above can help to retain developers on Optimism.  Provide us with links to any of the following for the project: Demo: See productive apps in app stores: iOS App: Wallet: https://apps.apple.com/ch/app/airgap-wallet/id1420996542 iOS App: Vault: ‎AirGap Vault - Secure Secrets im App Store Android App: Wallet: https://play.google.com/store/apps/details?id=it.airgap.wallet Android App: Vault: https://play.google.com/store/apps/details?id=it.airgap.vault Android APK from GitHub: Releases · airgap-it/airgap-vault · GitHub Website: https://www.airgap.it Github: AirGap · GitHub Twitter: https://twitter.com/AirGap_it Discord: AirGap Telegram: Telegram: Contact @AirGap Youtube: AirGap.it - YouTube Instagram: https://www.instagram.com/airgap_wallet Email: hi@airgap.it  Do you have any metrics on the project currently? (TVL, transactions, volume, unique addresses, etc. Optimism metrics preferred; please link to public sources such as Dune Analytics, etc.): Active addresses managed via AirGap Wallet: 50k+ active addresses are managed through AirGap Wallet instances. This number does not include addresses which are interacting with supported wallets like MetaMask, Rabby Wallet, Sparrow Wallet, BlueWallet or Specter Wallet and which are only managed via the AirGap Vault (which cannot be tracked in any means by design). Downloads: More than 135K Downloads from Apple Store, Google Play Store and direct downloads from Github. Supported currencies/tokens: more than 100. Find the full list here: Supported Currencies – AirGap Supported wallets: six supported wallets, of which Metamask and Rabby already support Optimism, see: Supported Wallets – AirGap. After our integration users can use the offline Vault to interact with AirGap Wallet, Metamask and Rabby.  Who are your competitors?: Main competitors to AirGap are secure and airgapped self custody solutions like Ledger, Trezor, Keystone, BitBox, Coldcard and similar.  What differentiates you from your competitors?: Availability and affordability: Most of the current airgapped self custody solutions rely on hardware devices. First, these devices might be highly priced or unaffordable for some users. Second, their purpose is unique, which can pose a risk because they are easily identified by attackers, like burglars. And last, depending on the country users live in, hardware devices might be hard or impossible to order. Hundreds of millions of users around the globe simply cannot order a Ledger because their countries are excluded. Ordering a hardware device can as well pose serious privacy issues, see the breach of Ledger’s customer data in 2020. Mobile phones on the other hand are widely available and affordable (used and new) and they are not immediately identified as cryptocurrency key vaults for attackers. All an AirGap user needs is a dedicated offline smartphone to manage their keys with AirGap. The AirGap apps are completely free to use and therefore the most accessible cold wallet solution out there. As with all cold wallets, recovery keys need to be safely stored too. AirGap offers to do this via Shamir’s Secret Sharing. With this method a secret recovery key can be split up in shards and each shard can be kept in a different safe place. The user sets the minimum amount of shards necessary to reconstruct the recovery key. This is only supported in a few cold wallets like Trezor, but eg. not in Ledger. AirGap is completely open source and is one of just a handful wallet solutions for Android that is labelled as “Reproducible’’ on Wallet Scrutiny. So people around the globe can build the solution by themself and verify if the published app matches their build. Most cold wallet solutions can only store one secret and do not often allow to import existing secrets. With AirGap vault, a user can generate or import multiple secrets and derive multiple addresses.  Will your project be composable with other projects on Optimism? If so, please explain: We propose to add support for the most used ERC-20 tokens from the Optimism ecosystem and users will be able to manage custom ERC-20 tokens of their favourite Optimism project. If we see a substantial user base on a certain ERC-20 token, we can add it easily to the list of supported tokens.  Team  Who are your founders?: AirGap is developed with  since 2018 by Papers AG, a web3 venture studio in Zug, Switzerland. Papers AG was founded in 2009 by Alessandro De Carli (CEO), Lukas Schoenbachler, Niklaus Knecht (CMO) and Pascal Brun (COO). Later on joined by Mike Godenzi (CTO) and Markus Staedler (Head of Sales). Together with a team of 24 skilled developers, marketing and community managers as well as sales people, we have vast experience in mobile security applications and blockchain powered applications.  What makes your founders well-positioned to accomplish your goals with this project (1-2 sentences on each)?: Alessandro: Has a background in mobile security in a financial environment. Vast experience in blockchain applications. Pushes his team to new heights. Pascal: Makes sure projects are in time and on budget. Strong network building skills and with a focus on UI/UX. Lukas: Strong focus on mobile security. Always there to help and meet deadlines. Vast blockchain experience and knowledge. Nik: Marketing powerhouse and skilled graphical designer. Also chief community builder. Mike: Background as a security framework engineer with some of the top 5 swiss financial companies. Vast experience in building secure mobile applications. The sparring partner for all engineers. Markus: The Salesman. Worked for Microsoft and Coresystems and his own company. Connects customer needs with developer talent.  Tell us about the rest of your team (if there are more teammates): Please meet all of our team members here: Team - Papers  Is this your first Web3 project?: No, we have vast experience in different Web3 projects on EVM and non-EVM chains alike. Besides custom projects for customers and smaller projects, we also build the following projects, which are daily used by thousands of users (combined): Acurast, a multichain oracle solution, which allows developers to bring off-chain data and computation on-chain, without the need of centralized parties. Supports EVM and non EVM chains like Substrate Chains, Tezos, Cosmos and more to come. Beacon, a customizable method to connect to multiple wallets over a decentralized network. Beacon currently powers most dApps on Tezos. Youves, the biggest DeFi platform on Tezos, with more than 40M TVL at this moment. E-Seal, a solution to electronically seal digital documents, leveraging blockchain technology to guarantee the authenticity of electronic documents. Currently running on NEAR but Multichain support is being planned. Ecoo, a platform that enables anyone to create and control their own payment systems and loyalty programs, built on Tezos.  If not, what else have you built? (Share links, Github repository, or any other useful information.): As stated above we did build many Web3 projects, but we also built non Web3 projects like Hypergate, a fast, secure and accessible Kerberos Single Sign On (SSO) solution for Android.  I understand that Builders grants are subject to a 1 year lock-up, as explained further in this post 2: [Yes/No]: Yes.  Is your project funded? If so, provide an estimate of how many months of funding runway your project has: AirGap is self-funded. We try to fund AirGap on the base of protocol integrations.  Grant Request  What is the size of the grant request? (50k OP max): For the proposed integration development, the outlined marketing efforts and continuous maintenance and community support, we request a grant of 18’000 OP.  How do you justify the size of the grant? The efforts to be done can be divided in 1) initial cost of development, testing, rollout and initial marketing and 2) ongoing cost of maintenance and community support over the coming years. By considering not only the initial costs, but also the ongoing costs, we consider this to be a fair proposal.  Roadmap  Describe in discrete steps your plan for accomplishing your project:  After a successful grant acceptance, we pledge to pick up integration work within 4 weeks Three months after the successful grant acceptance, the integration will be completed and both iOS and Android versions will be available for users to be downloaded from the official app stores and from Github (Android APKs). Final accountability report can be expected to be delivered 1 month after the successful app store submission   Please provide any additional information that will facilitate accountability:(smart contracts addresses relevant to the proposal, relevant organizational wallet addresses, etc.) We suppose you to have a look at our release page to see the pace of releases and integrations in the past: Releases · airgap-it/airgap-wallet · GitHub  Does your plan depend on the receipt of OP tokens?: Yes, to some extent: We fund our development works through integration grants and we are in talks with various protocols. A grant would guarantee a timely integration and a guaranteed spot in our pipeline.  What is your plan for the use of the OP token after the 1 year lock-up?: We accepted tokens for integrations in the past, but we did not immediately sell these tokens after lock ups ended. We still hold most of the received tokens, even years after reception. Being owned by the funders only, our company is solidly financed and aims for sustainable growth. Currently we are fully able to pay our salaries with various customer projects and are not forced to market sell tokens received in grants. But as a company we would like to leave that possibility open for possible times of need. If we feel comfortable in a open-minded community, we use to explore it’s potential for future innovations and for building products which is our passion. And once we commit ourselves to engage in a community, we follow the communities standards and ethics, which includes participation in governance or project funding, if those projects align with our own ideas. As company, we are also investors in third party projects, see the Investment section of our project portfolio here: Portfolio - Papers.  Please provide benchmark milestones for this project. These milestones should guide the Optimism community on the progress of your project during the 1-year lock-up period.     Milestone Type Milestone Source of Truth     Benchmark a minimum of 1000 Optimism wallets in use on Airgap Wallet after 365 days after the successful store submission Airgap Transaction Backend Analytics    We expect at least 1000 Optimism wallets to be created / managed on AirGap Wallet within the first year after store launch. Users who use Airgap Vault to interact with Metamask or Rabby wallet, are not included here, because those cannot be tracked. The AirGap transaction backend which is used to inject blockchain operations, allows us to collect the addresses from which funds are sent to ther wallets. We do not have any ability to link these addresses to any user identity and we do not publish any addresses. The sum of all addresses is only used for analytics like these. Due to privacy issues we will not be able to disclose any address, but we will happily show and explain the source and methodology applied in a private call. The proposed benchmark milestone is based on other integrations in the past and can totally vary, dependent on 1.) The (joint) marketing efforts, 2.) The size of the Optimism user base 3.) The activity of this user base. We know that joint marketing campaigns will increase the number of new users a lot. If Optimism is open for this, we are convinced that actual numbers can be much higher.  Please define critical milestones for this project. Critical milestones are meant to show good-faith efforts to accomplish the project. Non-completion of these milestones could lead to revocation of remaining grant rewards.  AirGap Vault     Milestone Type Milestone Source of Truth     Critical  iOS AirGap Vault app with Optimism integration* is available in the Apple App Store, within max 3 months after application acceptance. Apple storeAirGap Vault   Critical  Android AirGap Vault app with Optimism integration* is available in the Google Play Store, within max 3 months after application acceptance  Google Play StoreAirGap Vault   Critical  Android AirGap Vault app with Optimism integration* is available as Android APK on AirGap Vault GitHub, within max 3 months after application acceptance  AirGap Vault GitHub    * As outlined in What we are going to build for Optimism - Section 1 - 4  AirGap Wallet     Milestone Type Milestone Source of Truth     Critical  iOS AirGap Wallet app with Optimism integration* is available in the Apple App Store, within max 3 months after application acceptance. Apple storeAirgap Wallet    Critical  Android AirGap Wallet app with Optimism integration* is available in the Google Play Store, within max 3 months after application acceptance  Google Play StoreAirgap Wallet   Critical  Android AirGap Wallet app with Optimism integration* is available as Android APK on AirGap Wallet GitHub, within max 3 months after application acceptance  AirGap Wallet GitHub    * As outlined in What we are going to build for Optimism - Section 1 - 4  airgap-coin-lib     Milestone Type Milestone Source of Truth     Critical  airgap-coin-lib with Optimism integration** is available on airgap-coin-lib GitHub, within max 3 months after application acceptance  airgap-coin-lib GitHub    ** As outlined in What we are going to build for Optimism - Section 5  Marketing & Communication     Milestone Type Milestone Source of Truth     Critical  Posts on all AirGap channels upon app store availability*** of the app with Optimism integration, which are Twitter, Telegram, Discord and Medium   TwitterTelegramDiscordMedium    Optional  Joint marketing activities*** shortly ahead or after the app store avalability. Ideally announced or held via/on Optimism channels (e.g. Twitter space about secure self custody with AirGap lead dev) TBD    *** As outlined in What we are going to build for Optimism - Section 6 Our past experience and staff planning allows us to guarantee the completion of these milestones within the pledged timespan of 3 months after the grant application acceptance.  Optimism Relationship  Does your project solve a problem for the Optimism ecosystem?: Secure self custody made available for everyone is a real challenge for every blockchain ecosystem, so yes, this is a problem that also Optimism users face. By enabling this integration Optmimism enables their users to have a safe and battle hardened solution, independent of where in the world they are.  How does your proposal offer a value proposition solving the above problem?: As outlined above, AirGap Wallet and Vault is a secure, open-source and easy to use solution that is affordable and available to all cryptocurrency users independent of their budget, their geolocation and their previous experiences.  Why will this solution be a source of growth for the Optimism ecosystem?: We believe that offering users secure self custody solutions will not only retain users, but will also attact new users which define secure self custody as a precondition to interact with an ecosystem. AirGap has a solid and loyal user base and we believe that it’s a valuable user base to gain additional exposure in.  How committed are you (and your team) to building on Optimism?: While as a company we strive to be chain agnostic, we think Optimism has proven to be a future proof ecosystem with an impressive self-governance structure. With our project Acurast (see above), we consider Optimism also to be a project worthwhile to be supported by Acurast Oracles in the future.  Is your project Optimism Native?: No, we currently support more than 100 currencies and tokens (see above).  Confirmations  I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: [Yes/No]: Yes  I understand that I will be expected to following the public grant reporting requirements outlined here: [Yes/No]: Yes   Appendix  How to use AirGap Vault & Wallet - A Step-by-Step guide       How to use AirGap Vault with Metamask       AirGap Website    AirGap    AirGap - Self custody made simple and secure for all your crypto assets With the AirGap two device approach secure key handling becomes more accessible. The AirGap Vault is installed on a dedicated or old smartphone that has no connection to any network, thus is air gapped. The AirGap Wallet is installed on a every-day...  Est. reading time: 6 minutes       ",
                    "links": [
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/c/c133e227d8bb4eb546572b425778a5ea0aa371a9.png",
                        "https://airgap.it/supported-currencies",
                        "https://support.airgap.it/FAQ/#reproducible-builds",
                        "https://github.com/airgap-it",
                        "https://github.com/airgap-it/airgap-coin-lib",
                        "https://discord.gg/MG4jUEAJMr",
                        "https://t.me/AirGap",
                        "https://github.com/airgap-it/airgap-wallet",
                        "https://apps.apple.com/ch/app/airgap-wallet/id1420996542",
                        "https://apps.apple.com/ch/app/airgap-vault-secure-secrets/id1417126841",
                        "https://play.google.com/store/apps/details?id=it.airgap.wallet",
                        "https://play.google.com/store/apps/details?id=it.airgap.vault",
                        "https://github.com/airgap-it/airgap-vault/releases",
                        "https://www.airgap.it",
                        "https://github.com/airgap-it",
                        "https://twitter.com/AirGap_it",
                        "https://discord.gg/MG4jUEAJMr",
                        "https://t.me/AirGap",
                        "https://www.youtube.com/channel/UCV2_m3sCXtxLeRWrQo8uvxg",
                        "https://www.instagram.com/airgap_wallet",
                        "https://airgap.it/supported-currencies",
                        "https://airgap.it/supported-wallet",
                        "https://en.wikipedia.org/wiki/Shamir%27s_secret_sharing",
                        "https://walletscrutiny.com/",
                        "https://papers.ch/team",
                        "https://acurast.com/",
                        "https://www.walletbeacon.io/",
                        "https://youves.com/",
                        "https://e-seal.ch/",
                        "https://www.ecoo.ch/",
                        "https://hypergate.com/",
                        "https://github.com/airgap-it/airgap-wallet/releases",
                        "https://papers.ch/portfolio",
                        "https://apps.apple.com/ch/app/airgap-vault-secure-secrets/id1417126841",
                        "https://play.google.com/store/apps/details?id=it.airgap.vault",
                        "https://github.com/airgap-it/airgap-vault/releases",
                        "https://apps.apple.com/ch/app/airgap-wallet/id1420996542",
                        "https://play.google.com/store/apps/details?id=it.airgap.wallet",
                        "https://github.com/airgap-it/airgap-wallet/releases",
                        "https://github.com/airgap-it/airgap-coin-lib",
                        "https://twitter.com/AirGap_it",
                        "https://t.me/AirGap",
                        "https://discord.gg/MG4jUEAJMr",
                        "https://medium.com/airgap-it",
                        "https://www.youtube.com/watch?v=M9ICKaLxuwQ",
                        "https://www.youtube.com/watch?v=HIKJh0h7QiU",
                        "https://airgap.it/",
                        "https://airgap.it/"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6561786698150325
                },
                {
                    "author_link": "https://gov.optimism.io/u/mlaeng",
                    "index": "2",
                    "likes": "2",
                    "time": "06/03/2023-14:55:22",
                    "content": "Hey @lavande, May I ask you to transfer ownership of the above post to me, so I can do amendments on it? Will improve the Milestone section and add some images. Also tagged you on Discord. Thanks in advance! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://gov.optimism.io/u/mlaeng",
                    "index": "3",
                    "likes": "2",
                    "time": "08/03/2023-07:30:42",
                    "content": "Our application is finalised. We’ll be happy to address feedback and answer questions. Thank you for the opportunity! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/FractalVisions",
                    "index": "4",
                    "likes": "2",
                    "time": "08/03/2023-13:42:32",
                    "content": "Very nice app. I am wondering if other tokens are launched on the super chain with a similar ERC 20 standard to OP would they also be eligible for use with air gap ? If there is any plans to integrate with BASE after the recent announcement of the OP stack? That may be another opportunity to increase the amount of native Optimism users at the same time. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.117708333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/mlaeng",
                    "index": "5",
                    "likes": "2",
                    "time": "08/03/2023-19:30:38",
                    "content": "Hey @FractalVisions, As far as I understand the superchain development is still in an early state, with Bedrock being a preparational step towards it. As currently ERC-20 tokens from L1 (Ethereum) e.g DAI can only be bridged into L2 (currently Optimism Mainnet) and the mapping between token contracts is essentially done via the bridge contracts, these are currently two different implementations from an AirGap perspective. But in a possible superchain future, cross chain messaging protocols and especially the tools sketched here could enable cross L2 chain transactions and token management with similar ease as in todays siloed chains. It will depend on the available tooling or the efforts needed to develop such, if AirGap can grow along and integrate the new possibilities. AirGap is already adapting to protocol changes of the protocols it currently supports. An example here is Tezos, where we see 3-monthly protocol upgrades which from time to time result in major upgrades on AirgGap and the airgap-coin-lib in order to maintain compatibility and ongoing protocol support. Concerning BASE I think it’s also too early to tell. Before we would integrate it we need to be sure there’s a user base to be served. I could imagine that it starts as a single L2 chain, before eventually it could be attached to the superchain. But maybe they are the first to solve the L2 cross chain token management, who knows. This is all mindblowing on a conceptual level, but I see a lot of challenges to overcome before we can or should decide on how AirGap fits in there. But were definitely open for the journey. We’re not developing for the Web3 because it’s easy, but because it’s not. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.073351499690785
                },
                {
                    "author_link": "https://gov.optimism.io/u/kaereste",
                    "index": "6",
                    "likes": "3",
                    "time": "10/03/2023-17:32:02",
                    "content": "Hey @mlaeng, giving you a heads up that this will be the formal comms channel with the grant council builders subcommittee, which consists of @Gonna.eth @jackanorak @danelund.eth, and myself. We’ll make sure we’re around to address any questions you have in this process. We might also be asking additional questions here during the review process so please check this thread for updates on a regular basis. One thing to be mindful of is that in the Cycle 11 we require the milestones to be precisely defined into two categories - critical milestones and benchmark milestones as described in Milestone Assessment. Could you please restructure your milestones description to follow this structure? ",
                    "links": [
                        "https://gov.optimism.io/u/gonna.eth",
                        "https://gov.optimism.io/u/jackanorak",
                        "https://gov.optimism.io/u/danelund.eth",
                        "https://gov.optimism.io/t/milestone-assessment/5314"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.125
                },
                {
                    "author_link": "https://gov.optimism.io/u/0xairboom",
                    "index": "7",
                    "likes": "3",
                    "time": "10/03/2023-23:22:18",
                    "content": "I think the use case is clearly explained and the grant requested is small too. I would like to do more digging into the security aspect and get back to you with a more detailed feedback. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.041666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/mlaeng",
                    "index": "8",
                    "likes": "1",
                    "time": "11/03/2023-22:02:14",
                    "content": "Hey @kaereste, Thank you for your time and feedback. Will do so and will update the post with more precise information concerning both categories of milestones. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/mlaeng",
                    "index": "9",
                    "likes": "1",
                    "time": "11/03/2023-22:11:54",
                    "content": "Hey @0xairboom, thanks for the feedback. If you want to know more about it, you’ll find additional information here: docs: Security Introduction | AirGap Support docs: Security Considerations | AirGap Support docs: FAQ | AirGap Support And there’s also the security audit we did with an external company in 2020: after audit comments: AirGap Third Party Security Audit | by AirGap | AirGap | Medium audit report: airgap-coin-lib/report_85096_mobile_app_security_v1.0.pdf at master · airgap-it/airgap-coin-lib · GitHub If you have specific questions, please let us know. ",
                    "links": [
                        "https://support.airgap.it/airgap-vault/security/considerations",
                        "https://support.airgap.it/FAQ#supply-chain-attacks",
                        "https://medium.com/airgap-it/airgap-third-party-security-audit-bcb18deb9ca9",
                        "https://github.com/airgap-it/airgap-coin-lib/blob/master/docs/audits/report_85096_mobile_app_security_v1.0.pdf"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.699999999999999
                },
                {
                    "author_link": "https://gov.optimism.io/u/mlaeng",
                    "index": "10",
                    "likes": "2",
                    "time": "13/03/2023-15:28:28",
                    "content": "Hey @kaereste, I updated the milestones sections with more detailed information, so it can be easily checked upon completion. I hope this adds more precision. Thank you for your time, regards! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.447916666666668
                }
            ]
        }
    ],
    "group_index": "554"
}