{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/gf-phase-2-growth-proposal-shapeshift-dao/5568",
            "title": "[GF: Phase 2 Growth Proposal] ShapeShift DAO ",
            "index": 5568,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Grants Council"
            ],
            "tags": [
                "cycle-11"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/twells",
                    "index": "1",
                    "likes": "5",
                    "time": "10/03/2023-18:41:12",
                    "content": "Project name: ShapeShift DAO Author name(s) and contact info: @twells (Discord: T Wells#9070) @willy (Discord: willyfox#1178) L2 recipient address: 0x6268d07327f4fb7380732dc6d63d95F88c0E083b Which Voting Cycle are you applying for?: Cycle 11 I confirm that I have read the landing pages for the Builders 9 and Growth Experiments 11 Sub-Committees and that I have determined my proposal is best suited to be reviewed by the Growth Experiments Sub-Committee: Yes I understand that Growth Experiments grants are subject to a “no sale rule,” as explained in this post 5, and I have read the terms of the rule: Yes  Project Details  What are you building? Vision: We envision a borderless financial system built on open, decentralized protocols. Mission: We shall be the pathway into this borderless financial system; an open-source, multi-chain, self-custody crypto platform enabling billions to achieve financial sovereignty. The roadmap for ShapeShift DAO’s product is ultimately driven by the community of FOX Token holders; an in-progress version is live at app.shapeshift.com . This multi-wallet, multi-chain app is architected for complete decentralization, and is powered by an open-source stack including HDWallet, Unchained, Chain Adapters, Swapper , and Web repositories, will enable completely decentralized access to DeFi protocols across any chain. Additionally, the upcoming Arkeo project will provide backend node infrastructure for ShapeShift, as well as any interface that wants to be truly decentralized (more info ). Through integrations with DEX and DEX aggregator protocols such as 0x, CowSwap, THORChain, and Osmosis, ShapeShift enables users to seamlessly move crypto assets across chains with no KYC, custody, or added fees. We believe a decentralized interface and blockchain data infrastructure are imperative to bringing DeFi to the masses, and the ShapeShift community is actively coordinating to build this. Finally, we would like to emphasize a strong sense of alignment with Optimism on the principles of decentralization, self-custody, and trustless finance. As one of the first centralized crypto companies to DAO-it starting in 2021, ShapeShift spent the better part of a year decentralizing our operations and open-sourcing our codebase. We draw on a wealth of industry experience from inside and outside the Ethereum ecosystem and aim to help expand the reach and appeal of the Optimism ecosystem. Here’s a peek at ShapeShift’s beautiful, cross-chain UI for Portfolio View, Fiat Ramps, Assets, DeFi Yield, and Trading:  Why do you believe what you are building is going to succeed?: We believe a comprehensive, multichain interface is one of the killer apps for crypto. Users need a way to track their portfolio, trade and earn, without giving up their private keys to a centralized exchange. ShapeShift is perfectly positioned to provide this experience and is actively building to make it a reality. How many users does your project have currently? Please include how you arrived at this estimate: ~20,000 MAUs; the DAO uses Pendo used for app data tracking. How will receiving a grant enable you to further the mission of maximizing the number of users interacting with Optimism? Please include a step-by-step flow of how you imagine this grant can lead to a greater number of user interactions with Optimism: Our proposal will maximize the number of users interacting with Optimism by focusing incentives on three central features: fiat ramps, swaps, and bridges. This approach will enable us to target a wide range of crypto users, all of whom require these features to interact with the network via our interface. We believe L2s such as Optimism provide the best balance between security and transaction costs, creating a sticky user experience. Tell us about the users you plan to target with this grant. Include any defining characteristics that will help you identify and target them: We plan to target new and intermediate DeFi users with this grant. We define new users as both crypto-curious (no-coiners) and those with basic knowledge of web3. They are most interested in using their fiat to buy crypto and swap between assets. Intermediate users can be defined as those with at least six months of experience in DeFi, who are interested in yield and asset bridging. Our three-feature incentive focus provides a way for these target user demographics to discover, use, and remain on Optimism. How would these users interact with Optimism? For how long?: This grant would incentivize new and intermediate users to do the following on Optimism  Onramp fresh capital Swap between assets Bridge assets from other chains  The grant distribution will be structured in such a way as to attract these users to Optimism, discover the ecosystem, and remain on the network as it provides a balance of security and transaction costs. Provide us with links to any of the following for the project:  Dapp: app.shapeshift.com  Website: www.shapeshift.com  GitHub: ShapeShift · GitHub  Twitter: twitter.com/shapeshift  Discord: discord.gg/shapeshift  Android: play.google.com/store/apps/details?id=com.shapeshift.droid_shapeshift  iPhone: apps.apple.com/us/app/shapeshift-crypto-platform/id996569075   Do you have any metrics on the project currently?:  ~$4m trading volume across CowSwap, 0x, and THORChain $250k monthly onramp volume ~$200k vault deposits since THORChain Savers launch in Jan, ‘23 Optimism integration completed early Feb, ‘23 (send, receive, trade)  Who are your competitors, and are they on Optimism?: Zerion (Yes) Zapper (Yes) Please link to code audits (if any): N/A  Team    Willy Fox (Fox Foundation)  0xdef1cafe (Engineering WS Lead)  Diggy (Product WS Lead)  T Wells (Marketing & BD)  Who are your founders?: ShapeShift was originally founded by Erik Voorhees in 2014, but transitioned from a centralized company to DAO in 2021. We adopted a governance and operational framework illustrated below:  WS_Chart_31439×756 159 KB  Detailed description of the FOX Governance Process What makes your team well-suited to carry out the project described in this proposal? As mentioned above, ShapeShift DAO is composed of builders who have been in the industry for multiple cycles. Our app has already integrated Optimism Network and is therefore positioned to implement the distribution plan immediately. Is this your first Web3 project?: No. If not, what else have you built?: KeepKey CoinCap Portis Giveth  Grant Request  What is the size of the grant request?: 200k OP How do you justify the size of the grant?: Our grant request is intended to maximize the longevity of our distribution experiment according to the phases and corresponding milestones below. Should the Growth Committee feel a different grant size is appropriate, we can adjust milestones accordingly.  Roadmap and Distribution Plan  Describe in discrete steps how you will successfully implement your grant plan: The incentive program we propose is made possible by our partnership with DappBack; a Web3 rewards platform. In collaboration with their team, we will design and deploy user quests around on-ramping, swapping, and bridging, with OP token rewards available upon completion. Below is a draft UI:  DappBack-WireframeUI (3)1296×651 72.3 KB  In order to protect these quests from sybil attack, we will require users to have adopted Gitcoin Passport with a score of 21.76 or higher. ShapeShift has experience distributing millions of dollars worth of crypto rewards as user incentives and defending against the resulting attacks. We have a high level of confidence in Gitcoin Passport, and believe its implementation in this experiment could help solidify its place as an industry standard for sybil resistance. Any user with who has adopted Passport, and completed all three feature quests is a unique, valuable target user successfully onboarded to Optimism. How will the OP tokens be distributed? On-chain Task Rewards (82.5%, 165k OP) Rewards will be provided for all three features (fiat ramps, swapping, and bridging) via quests on Dappback. Liquidity Mining (10%, 20k OP) In an effort to firmly establish the ShapeShift DAO on Optimism, we intend to create a FOX/wstETH pool on Velodrome and offer access to farming rewards directly within the ShapeShift app, similar to our existing program on Mainnet. This opportunity will be easily accessible to our existing liquidity providers, many of whom may choose to migrate to Optimism.  Marketing/Co-marketing (7.5%, 15k OP) We will pursue and measure a variety of marketing initiatives ranging from targeted airdrops to in-person learning experiences at conferences such as F3ST. Should this proposal pass, we would love to explore creative co-marking ideas focused on growing the Optimism network. Over what period of time will the tokens be distributed for each initiative?: 6 months. Please provide benchmark milestones for this project. These milestones should guide the Optimism community on the progress of your project throughout your work on the project. Do not use distribution of the grant itself as a milestone: Since April 2022, Optimism network has maintained a monthly average of ~394,000 transacting addresses making ~23 transactions apiece. Although we’re missing the exact historical figure, it’s safe to say over 10m OP has been awarded since the grants program began, which indicates ~25 OP spent to acquire a monthly transacting address. Through the proposed experiment, ShapeShift aims to onboard 10k+ monthly transacting addresses to the Optimism network at a substantially reduced cost of 16.5 OP/TA. Monthly target milestones can be seen in the table below.  Should this proposal pass our team will commit to bimonthly reporting on the milestones above, as well as fiat on ramping data. Please define critical milestones for this project. Critical milestones are meant to show good-faith efforts to accomplish the project. Non-completion of these milestones could lead to revocation of remaining grant rewards. Do not use distribution of the grant itself as a milestone: As fiat ramps and swapping are already live, the remaining critical milestones are bridging and LP features; we are on track to launch both of these next month.     Critical Milestone Timeframe for Completion     Fiat ramps to Optimism Complete   Swapping to Optimism Complete   Bridging to Optimism Mid April   FOX/wstETH Farming Late April    If the OP tokens are for direct distribution to users, why will incentivized users and liquidity on Optimism remain after incentives dry up?: OP token incentives will help bring users into the Optimism ecosystem and discover their favorite apps. Once onboarded, these users will want to stay for cheap, fast, and secure transactions. The ShapeShift app will always function as a means to expose new users to Optimism and the variety of dapps it has to offer. Please provide any additional information that will facilitate accountability:  ShapeShift DAO Treasury wallet  The DAOshboard used by our Treasury Management & Diversification Committee   Optimism Relationship  Does your project solve a problem for the Optimism ecosystem? If so how?: Optimism’s goal of empowering the next billion users to experience web3 through the security of L2s requires constant experimentation around incentive distribution. Nearly three years have passed since DeFi summer, and although liquidity mining is still commonplace, alternative methods of attracting and retaining capital and community are now possible. Furthermore, when considering the next billion users, there are a few fundamental features likely to be the most critical to their journey in DeFi:  Fiat On-ramps Swapping Cross-chain bridging  However, there are two main problems associated with current efforts to incentivize these actions:  Fragmentation - these features are often spread across multiple dapps. Sybil Resistance - offering significant incentives for features such as swapping/bridging can lead to abuse and sell pressure.  Why will this solution be a source of growth for the Optimism ecosystem?: ShapeShift proposes to solve both of the problems above through a new incentive experiment that:  Unifies all three features in the ShapeShift interface for the Optimism Network. Implements a sybil resistance layer that balances UX friction with incentives offered.  Is your project Optimism Native?: No  Confirmations  I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: Yes. I understand that I will be expected to following the public grant reporting requirements outlined here: Yes ",
                    "links": [
                        "https://foul-porch-0eb.notion.site/Growth-Experiments-Sub-Committee-270d2f75ff0f410a869b2ba6a8324006",
                        "https://gov.optimism.io/t/grant-proposal-template/3233",
                        "http://app.shapeshift.com/",
                        "https://github.com/shapeshift/hdwallet",
                        "https://github.com/shapeshift/unchained",
                        "https://github.com/shapeshift/lib/tree/main/packages/chain-adapters",
                        "https://github.com/shapeshift/lib/tree/main/packages/swapper",
                        "https://github.com/shapeshift/web",
                        "https://github.com/ArkeoNetwork/arkeo-protocol",
                        "https://snapshot.org/#/shapeshiftdao.eth/proposal/0xcc1e83822fc7668a9d9e9136e5bd8973b7dc1ed766c2a0826d3e89d624e8b1c5",
                        "http://app.shapeshift.com",
                        "http://www.shapeshift.com",
                        "http://github.com/shapeshift",
                        "http://twitter.com/shapeshift",
                        "https://t.co/JR3P3gqI5k",
                        "http://play.google.com/store/apps/details?id=com.shapeshift.droid_shapeshift",
                        "http://apps.apple.com/us/app/shapeshift-crypto-platform/id996569075",
                        "https://zerion.io/",
                        "https://zapper.fi/",
                        "https://twitter.com/willyogo",
                        "https://twitter.com/0xdef1cafe",
                        "https://github.com/DiggyDiggy2",
                        "https://twitter.com/twells_eth",
                        "https://twitter.com/ErikVoorhees/status/1415339998740508674?s=20&t=504FNDqvLSM5CC3lQGvarw",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/8/898bb5457af28c333d9faa4a7ea172e9de168976.png",
                        "https://forum.shapeshift.com/thread/fox-governance-process-40188",
                        "http://keepkey.com",
                        "http://coincap.io",
                        "http://portis.io",
                        "http://giveth.io",
                        "https://dappback.com/",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/a/a0a109cf493a8103c093fd324c0eac478c21c0e0.png",
                        "https://passport.gitcoin.co/#/",
                        "https://support.gitcoin.co/gitcoin-knowledge-base/gitcoin-passport/common-questions/how-is-gitcoin-passports-score-calculated",
                        "https://v2.info.uniswap.org/pair/0x470e8de2ebaef52014a47cb5e6af86884947f08c",
                        "https://www.f3vc.com/",
                        "https://dune.com/queries/865428/1507901",
                        "https://dune.com/queries/865428/1507900",
                        "https://etherscan.io/address/0x90a48d5cf7343b08da12e067680b4c6dbfe551be",
                        "https://docs.google.com/spreadsheets/d/1nxIMNGUJKyPGSmmaZ4415KBKwJS6EROFWu9qQZY4y2g/edit?usp=sharing",
                        "https://gov.optimism.io/t/suggested-public-reporting-requirements-for-grantees/4176"
                    ],
                    "GPT-summary": "The post is a proposal for a grant from the Growth Experiments Sub-Committee for the ShapeShift DAO project. The proposal explains the vision and mission of the project, the team behind it, and how the grant will be used to maximize the number of users interacting with Optimism. The post also includes details on the target users, the distribution plan, and the critical milestones for the project. There is no negative feedback or advertising of the proposal, and no collaboration or auditing is mentioned.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Interoperability and Scaleability",
                        "Smart contract updates",
                        "Community and engagement",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.694472265023113
                },
                {
                    "author_link": "https://gov.optimism.io/u/0xairboom",
                    "index": "2",
                    "likes": "3",
                    "time": "10/03/2023-23:30:34",
                    "content": "I think the idea that it focuses on Optimism Ecosystem Growth isn’t highlighted at all in this proposal. It addresses generic problems, not saying it solves them, but is trying to address those problems. I don’t know how this will bring long-term growth on Optimism. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/twells",
                    "index": "3",
                    "likes": "4",
                    "time": "11/03/2023-01:39:49",
                    "content": "Thanks for the feedback @0xairboomm  You’re right, we are addressing a generic problem. That’s because fixing feature fragmentation and reducing UX friction can unlock new growth, particularly for the user demos we have targeted in our proposal. In the spirit of the committee’s name, ShapeShift DAO has proposed a well-scoped scoped experiment around critical user features, that includes a novel implementation of Gitcoin Passport (proof of uniqueness), tokenized CAC tracking at distribution levels 30% lower than historical averages for the network. Our previous proposal included a second phase based around ecosystem integrations and replication of the incentive experiment for added stickiness over the mid-long term. This section was removed for the sake of simplifying our approach, but we could roll it back in without issue! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.31103896103896
                },
                {
                    "author_link": "https://gov.optimism.io/u/katie",
                    "index": "4",
                    "likes": "3",
                    "time": "13/03/2023-23:02:42",
                    "content": "Hello and thank you for your proposal! Throughout the application process, this forum thread will be one of the official means of communication. Please be sure to monitor it for updates over the course of the review period. At this stage, applications are mainly being reviewed for completeness, and nothing at this stage should be construed as support or opposition by any members of the Grants Council.     twells:  Marketing/Co-marketing (7.5%, 15k OP) We will pursue and measure a variety of marketing initiatives ranging from targeted airdrops to in-person learning experiences at conferences such as F3ST. Should this proposal pass, we would love to explore creative co-marking ideas focused on growing the Optimism network.   This is vague, can you please elaborate more on you use of the marketing allocation? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.354166666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/twells",
                    "index": "5",
                    "likes": "1",
                    "time": "14/03/2023-14:10:47",
                    "content": "Glad you asked Katie! One of the most exciting recent integrations we’ve made is with Wherever, built on Push Protocol, which enables us to offer direct-to-wallet notifications via our dapp! All opt-in wallets are highly qualified leads, and we have over 2k unique addresses enrolled since launch at the end of February. We’d love to experiment with this tool for OP distribution in a way that synergizes with the network’s communication needs. For example, we could send notifications to all opt-in addresses with the latest news and CTAs from Optimism, and incentivize enrollment via DappBack in the same fashion as the three main features in our proposal. If this is of interest to the committee, we can add specific milestones to track distribution of OP info and tokens to these engaged DeFi users (ex: 3 OP per wallet with 10k target would equal the total marketing allocation). Addition (Mar 17): We just hit 2500 subs on our EPNS (Push Prot) channel which puts us third overall after ENS and Coindesk. ",
                    "links": [
                        "https://push.org/"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.133333333333333
                }
            ]
        },
        {
            "thread_link": "https://gov.optimism.io/t/draft-gf-phase-1-proposal-shapeshift-dao/4968",
            "title": "[DRAFT] [GF: Phase 1 Proposal] ShapeShift DAO ",
            "index": 4968,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Grants Council"
            ],
            "tags": [
                "cycle-10",
                "not-passed"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/twells",
                    "index": "1",
                    "likes": "10",
                    "time": "31/01/2023-19:55:49",
                    "content": "Project name: ShapeShift DAO attn: @danelund.eth, @Gonna.eth  - we are posting here to include graphics/tables. Author name(s) and contact info: Primary: T Wells (Discord: T Wells#9070) Secondary: @willy (Discord: willyfox#1178) I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: Yes I understand that I will be expected to following the public grant reporting requirements outlined here : Yes L2 recipient address: 0x6268d07327f4fb7380732dc6d63d95F88c0E083b Which Voting Cycle are you applying for?: Cycle 10 Grant Committee: Growth Experiments Project description: The roadmap for the ShapeShift DAO is ultimately driven by our community of FOX Token holders. Currently, we are aligned on the following vision and mission: Vision: We envision a borderless financial system built on open, decentralized protocols. Mission: We shall be the pathway into this borderless financial system; an open-source, multi-chain, self-custody crypto platform enabling billions to achieve financial sovereignty. An in-progress version of the new ShapeShift is live at app.shapeshift.com. This version is open-source, supports multiple wallets, and multiple blockchains (not limited to EVM-compatible networks), and is architected for complete decentralization. The new ShapeShift app, powered by an open-source stack including HDWallet, Unchained, Chain Adapters, Swapper, and Web repositories, will enable completely decentralized access to DeFi protocols across any chain. Additionally, the upcoming Arkeo will provide backend node infrastructure for any interface that wants to be truly decentralized, including ShapeShift’s (more info). Through integrations with DEX and DEX aggregator protocols such as 0x, CowSwap, THORChain, and Osmosis (in-progress), ShapeShift enables users to seamlessly move crypto assets across chains with no KYC, custody, or added fees. We believe a decentralized interface and blockchain data infrastructure are imperative to bringing DeFi to the masses, and the ShapeShift community is actively coordinating to build this. Finally, we would like to emphasize a strong sense of alignment with Optimism on the principles of decentralization, self-custody, and trustless finance. As one of the first centralized crypto companies to DAO-it starting in 2021, ShapeShift spent the better part of a year decentralizing our operations and open-sourcing our codebase. We draw on a wealth of industry experience from inside and outside the Ethereum ecosystem and aim to help expand the reach and appeal of the Optimism ecosystem. Here’s a sneak peek of ShapeShift’s beautiful, cross-chain UI for Portfolio View, Fiat Ramps, Assets, DeFi Yield, and Trading:  Popular native swaps in our app made possible by our THORchain integration:    Project links:  Dapp: app.shapeshift.com  Website: www.shapeshift.com  GitHub: ShapeShift · GitHub  Twitter: twitter.com/shapeshift  Discord: discord.gg/shapeshift  Android: play.google.com/store/apps/details?id=com.shapeshift.droid_shapeshift  iPhone: ‎ShapeShift: Crypto Platform on the App Store   As some of you might be aware, ShapeShift transitioned from a centralized company to DAO in 2021. We adopted a governance and operational framework illustrated below:  WS_Chart_31439×756 159 KB  Additional team member info: The ShapeShift team includes OG builders from pre-DAO ShapeShift, as well as seasoned web3 operators:   Willy Fox (Fox Foundation)  0xdef1cafe (Engineering WS Lead)  Diggy (Product WS Lead)  T Wells (Marketing & BD)  Previous projects the team has meaningfully contributed to: Giveth KeepKey CoinCap Portis Competitors, peers, or similar projects: Zerion Zapper Is/will this project be open sourced? Yes, we are open-source (GitHub) Optimism native?: No Date of deployment/expected deployment on Optimism: Network support for Optimism is currently online, with fiat-on ramps available immediately. Further feature deployment details below.  Ecosystem Value Proposition:  What is the problem statement this proposal hopes to solve for the Optimism ecosystem? Optimism’s goal of empowering the next billion users to experience web3 through the security of L2s requires constant experimentation around incentive distribution. Nearly three years have passed since DeFi summer, and although liquidity mining is still commonplace, alternative methods of attracting and retaining capital and community are possible. Furthermore, when considering the next billion users, there are a few fundamental features likely to be the most important to their journey in DeFi:  Fiat On-ramps Swapping Cross-chain bridging  However, there are two main problems associated with current efforts to incentivize these actions:  Fragmentation - these features are often spread across multiple dapps. Sybil Resistance - offering significant incentives for features such as swapping/bridging can lead to abuse.  How does your proposal solve the problem above, and offer a source of growth for the Optimism ecosystem? ShapeShift proposes to solve both of the problems above through a new incentive experiment that:  Unifies all three features in the ShapeShift interface for the Optimism Network. Implements a sybil resistance layer that balances UX friction with incentives offered.  We recently shipped support for fiat ramps and swapping on Optimism, and would begin the incentive program with these features. Specific details on the proposed program and sybil resistance options can be found in the token distribution section below. In addition, we have added Optimism to our native wallet with 20k monthly active users. They are only a click away from exploring the ecosystem, and we are confident in our ability to convert many of them to Optimism users via the proposed rewards program! Has your project previously applied for an OP grant? No. Number of OP tokens requested: 250k Did the project apply for or receive OP tokens through the Foundation Partner Fund?: No. How much will your project match in co-incentives? ShapeShift is open to discussing FOX co-incentives for Phase 1 of the proposed distribution schedule below.  Proposal for Token Distribution  How will the OP tokens be distributed? The incentive program we propose is made possible by our partnership with DappBack; a web3 rewards platform. In collaboration with their team, we can design and deploy custom user quests around each of the three core features that reward OP tokens for completion. Below is a UI mockup:  DappBack-WireframeUI (3)1296×651 72.3 KB  In order to protect these quests from sybil attack, we will require users to have adopted Gitcoin Passport with a score of 21.76 or higher. ShapeShift has experience distributing millions of dollars worth of crypto rewards as user incentives and defending against the resulting attacks. We have a high level of confidence in Gitcoin Passport, and believe its implementation in this experiment could help solidify its place as an industry standard for sybil resistance. Any user with who has adopted Passport and completed all three feature quests is a unique, valuable target user successfully onboarded to Optimism. If selected for a grant allocation, ShapeShift would distribute OP tokens in two phases:  OP Prop Phases (2)1920×1080 30.8 KB  Phase 1 (60% of OP) This phase would begin with incentivization of all three features as they roll out on our interface (fiat ramps, swapping, and bridging), and continue for the duration of the program. Since April 2022, Optimism network has maintained a monthly average of ~394,000 transacting addresses making ~23 transactions apiece. Although we’re missing the exact historical figure, it’s safe to say over 10m OP has been awarded since the grants program began, which indicates ~25 OP spent to acquire a monthly transacting address. For the purposes of Phase 1, we will aim to substantially reduce this cost to ~15 OP/TA and target the monthly milestones below.  TA Targets1377×441 44.6 KB  Phase 2 (15% of OP) The second phase will begin after all three features are deployed, and serve to incentivize Optimism-native dapps to integrate with the ShapeShift interface by offering new reward tasks via DappBack upon completion. These tasks could closely mirror those previously deployed on Optimism with the exception that users would be expected to complete tasks via the ShapeShift interface, and receive OP tokens rather than NFTs. FOX/wstETH Liquidity Mining (15%) In addition to the incentive phases above, ShapeShift proposes a modest liquidity mining program for a FOX/wstETH pair on Velodrome. Unlike the features in Phase 1, liquidity mining is inherently sybil-resistant, and could therefore be implemented directly within the ShapeShift app, similar to our existing program on Ethereum Mainnet. This opportunity could be easily accessible to our existing liquidity providers on mainnet, many of whom may choose to migrate to Optimism. We are excited to work with Velodrome and Lido Finance on this liquidity experiment and look forward to feedback from the Committee on how we can collaborate on incentivizing FOX/stETH in a sustainable way.  Marketing/Co-marketing (10%) We have a number of creative options in mind here and are open to suggestions. A few examples would be small, targeted airdrops to incentivize our current Cosmos and THORchain users to migrate to Optimism as well as in-person learning experiences at ETH Denver and F3ST. Over what period of time will the tokens be distributed for each initiative? Token incentives would be distributed over six months (see figure above). Two months for our feature ramp-up, followed by three to four months of continuous rewards for Phase 1 quests, with an additional layer of incentives for new partner projects. What are the key milestones/KPIs you expect to achieve for this initiative? ShapeShift aims to onboard 20k+ MAU to the Optimism network, providing a free, easy, and open-source interface to buy, sell, trade, bridge, and interact directly with Optimism protocols. We will report data for:  Total fiat on/off ramp volume on Optimism via ShapeShift Total trading volume on Optimism via ShapeShift Total bridging volume on Optimism via ShapeShift Number of unique accounts onboarded to Optimism  Why will incentivized users and liquidity on Optimism remain after incentives dry up? OP token incentives will help bring users into the Optimism ecosystem and discover their favourite apps. Once onboarded, these users will want to stay for cheap, fast, and secure transactions. The ShapeShift app will always function as a means to expose new users to Optimism and the variety of dapps it has to offer. Please provide any additional information that will facilitate accountability: Our interface does not include custom smart contracts; all project code can be viewed on our GitHub. Confirm you have read and agree to the Eligibility Restrictions (here ): We have read the Eligibility Restrictions and agree to abide by their conditions ",
                    "links": [
                        "http://app.shapeshift.com",
                        "https://github.com/shapeshift/hdwallet",
                        "https://github.com/shapeshift/unchained",
                        "https://github.com/shapeshift/lib/tree/main/packages/chain-adapters",
                        "https://github.com/shapeshift/lib/tree/main/packages/swapper",
                        "https://github.com/shapeshift/web",
                        "https://github.com/ArkeoNetwork/arkeo-protocol",
                        "https://snapshot.org/#/shapeshiftdao.eth/proposal/0xcc1e83822fc7668a9d9e9136e5bd8973b7dc1ed766c2a0826d3e89d624e8b1c5",
                        "http://app.shapeshift.com",
                        "http://www.shapeshift.com",
                        "http://github.com/shapeshift",
                        "http://twitter.com/shapeshift",
                        "https://t.co/JR3P3gqI5k",
                        "http://play.google.com/store/apps/details?id=com.shapeshift.droid_shapeshift",
                        "http://apps.apple.com/us/app/shapeshift-crypto-platform/id996569075",
                        "https://twitter.com/ErikVoorhees/status/1415339998740508674?s=20&t=504FNDqvLSM5CC3lQGvarw",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/8/898bb5457af28c333d9faa4a7ea172e9de168976.png",
                        "https://twitter.com/willyogo",
                        "https://twitter.com/0xdef1cafe",
                        "https://github.com/DiggyDiggy2",
                        "https://twitter.com/twells_eth",
                        "http://giveth.io",
                        "http://keepkey.com",
                        "http://coincap.io",
                        "http://portis.io",
                        "https://zerion.io/",
                        "https://zapper.fi/",
                        "https://github.com/shapeshift",
                        "https://dappback.com/",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/a/a0a109cf493a8103c093fd324c0eac478c21c0e0.png",
                        "https://passport.gitcoin.co/#/",
                        "https://support.gitcoin.co/gitcoin-knowledge-base/gitcoin-passport/common-questions/how-is-gitcoin-passports-score-calculated",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/e/ed50a53660e805839777c1e0ab9489a47797a0f8.png",
                        "https://dune.com/queries/865428/1507901",
                        "https://dune.com/queries/865428/1507900",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/3/32eb6fc4071d069578510e1db9adb18885db0be4.png",
                        "https://app.optimism.io/quests",
                        "https://v2.info.uniswap.org/pair/0x470e8de2ebaef52014a47cb5e6af86884947f08c",
                        "https://www.f3vc.com/",
                        "https://github.com/shapeshift",
                        "https://gov.optimism.io/t/grant-proposal-template/3233",
                        "https://gov.optimism.io/t/gf-phase-2-growth-proposal-shapeshift-dao/5568/3"
                    ],
                    "GPT-summary": "The post is a proposal for a grant from the Optimism Foundation for the ShapeShift DAO project. The proposal outlines the vision and mission of the project, which is to build a borderless financial system on open, decentralized protocols. The proposal also explains how the project will solve the problems of fragmentation and sybil resistance associated with incentivizing fiat on-ramps, swapping, and cross-chain bridging. The post includes a detailed token distribution plan and key milestones/KPIs for the initiative.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Interoperability and Scaleability",
                        "Community and engagement",
                        "Smart contract updates",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.562587412587413
                }
            ]
        }
    ],
    "group_index": "466"
}