{
    "poll_list": [
        {
            "id": "0x8ef075d11b27be16304a97956e821bb34468556b6221990c67aa8c805e8c96a2",
            "title": "Proposal Q: Governance Fund Phase 1 - Candide",
            "discussion": "https://gov.optimism.io/t/ready-gf-phase-1-proposal-candide-wallet/2656",
            "body": "This Governance Fund Phase 1 proposal has been marked ready and as such is eligible for voting in Cycle 2. This proposal HAS been approved as ready for vote by a delegate. For more info, check out Voting Cycle 2 Roundup: [https://gov.optimism.io/t/voting-cycle-2-roundup/2754](https://gov.optimism.io/t/voting-cycle-2-roundup/2754)\n\nLink to proposal: https://gov.optimism.io/t/ready-gf-phase-1-proposal-candide-wallet/2656",
            "choices": [
                "Yes",
                "No",
                "Abstain"
            ],
            "scores": [
                10004605.458958285,
                7997161.872977558,
                49459.80042037245
            ],
            "start": 1656093767,
            "end": 1657134167,
            "snapshot": "12949806",
            "state": "closed",
            "author": "0x47C88bb92B409fF25F6587EA611fac4e55f76007",
            "space": {
                "id": "opcollective.eth",
                "name": "Optimism Collective"
            }
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/ready-gf-phase-1-proposal-candide-wallet/2656",
            "title": "[READY] [GF: Phase 1 Proposal] Candide Wallet ",
            "index": 2656,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Governance Fund: Phase 1"
            ],
            "tags": [
                "cycle-2",
                "passed"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/marc",
                    "index": "1",
                    "likes": "13",
                    "time": "11/06/2022-10:43:33",
                    "content": "Project Name: Candide Author Name: @marc Number of OP tokens requested: OP 190k L2 Recipient Address: 0xA60b3402051eC75B17abb81b4c92BF88d5e49Aa8 Relevant Usage Metrics: (TVL, transactions, volume, unique addresses, etc.) N/A new product   Introduction Token management across different networks is a cumbersome process. Although many bridges have emerged to offer connectivity across networks, the manual process of bridging assets can be quite laborious. If Ethereum were to scale and to become powerful enough to have a widespread impact on humanity, interconnectivity between its decentralized scaling solutions needs to be intuitive to use. To solve this problem, we are building Candide: an open source self-custodial wallet that enables cross-rollup transactions. Users can spend their funds seamlessly across networks. As an EOA, Candide Alpha currently achieves this by having a bridge built within the wallet. With the help of Hop Protocol, Candide can securely communicate across several networks by proposing a pre-transaction to move the assets to the destination chain. The feasibility of our proposed solution is supported by a product demo that is currently live, with ETH transfers between Arbitrum and Optimism. Allowing for interactions with any contract on any rollups is expected to ease the burden of using the multiple scaling solutions built on top of Ethereum. Building accessible wallets will standardize Ethereum’s Layer2, resulting in consistent use of the network at low fees.  Our Story Candide originally started as CrossCash at ETHGlobal hackathon; an idea of a zk-bridge on top of Azdek Network that connected rollups through liquidity transfers. To me, that was the first exposure to development on Ethereum, and I was blow away by the endless possibilities of programmable money. We somehow became finalist at Unicode, and this is where I have decided to give Ethereum a shot by pursing crypto full-time. A few iterations later, we quickly understood that bridges are a competitive space, and we had to bring something new to the table. We noticed that Layer 2s were being developed quicker that expected, but its adoption and migration hasn’t reached its full potential yet. We understood that there was a learning gap of using bridges for many users. The average crypto native could quickly navigate both worlds, but on-boarding less tech-savy users was the burden to the success of Ethereum’s scaling solutions. On my second ETHGlobal hackathon, I knew I wanted to focus my effort on a wallet that abstracts away the bridging part, so that Ethereum users can easily use rollups without going into the rabbit hole of transfers. PiggyCross was met with a wide acceptance that validated this idea. I later spend the next few months building a working prototype that became what is known today as Candide Alpha. Today, Candide represents an idea that Etheruem is relying not only in the short-term on Layer 2 like previously expected, but also on the long-term. The road of making truly decentralized self-custodial wallet on Layer 2 is not yet build, and we are here to for it. The team consists of myself along with a few other contributors.  Optimism alignment  Candide is first and foremost an idea that wallets are general purpose public goods. It is the first point of contact for most crypto users. It is the bridge to the digital world of decentralized applications. We believe in exposing the broadest set of users to self-custody wallets on Ethereum, educating them on self-sovereignty & privacy, and giving them access to digital money and data-friendly services.  Candide is aligned with Optimism values of experimentation  Candide is currently experimenting with EOA wallets with built-in bridge transfers for cross-rollup transactions: to see how wallets can be used in the most user-friendly way possible. These experiments will help us understand how users interact with Ethereum from its core place and allows us to define how wallets should evolve and grow iteratively over time.   Candide is aligned with Optimism values of Impact = Profit  We align with Optimism on dispelling the myth that public goods cannot be profitable. Candide is considering different paths to profitability so that the project can be sustainable in the long term in order to yield profit for the Collective and cycle to invest back in public goods.   Proposal for token distribution  How will the tokens be distributed? Candide works as a collective of individuals that cares about building accessible Layer2s wallets. For this grant, we will setup a program to invite contributors who would like to collaborate on working on new features, design and communication. We estimate that a single contributor that we will onboard will be paid for his time around 3k a month, averaging between a developer, a designer and a content creator.     Budget Category Description & Assumptions Amt USD     Fundamentals Build fundamental wallet components to properly support Rollups like Optimism $20,000   Ecosystem integration Add wallet integrations that augments and encourage the use of the network $20,000   Interface Design and implement accessible interfaces that are designed for Layer2s $20,000   Educational Create a space to learn about Ethereum scaling solutions and self-custodial wallets $10,000   Incentives Subsidies fiat-on-ramp fees that are deposited to Optimism $15,000   New Beta Experiment with interfaces on top of Account Abstraction  $4,000    Total Budget: $89,000 At current price of ~$0.468 per OP at the time of writing this proposal, this amounts to ~190k OP.  To breakdown further some of the tasks in each category:   Fundamentals: this includes to the basic features that are supported in mainstream wallets. Examples includes displaying account balances and estimating gas on contract interactions.  Ecosystem integration: this includes integrations that are vital for users to deposit and interact with Optimism network. Examples are fiat-on-ramp integration and in-app bridging support.  Interface: this includes studies on how to properly design easy to use wallets that are native to Optimism and Layer2s and that includes design interfaces and front-end work.  Educational: this will be considered our marketing strategy, fostering not only an awareness of Candide but also Ethereum’s decentralized values and Layer2s purposes. Example includes blog posts and community engagement.  Incentives: Candide plans to offset the fees required to deposit to on-ramp operators; making it essential free to get on-boarded Optimism without going through Layer 1.  New Beta: As the tech mature, Candide would like to experiment with Account Abstractions that is direclty built on top of Layer2s. We would use that budget specifically to research around that topic.  Note: I have added a denomination in dollar amount to be prioritized in this budget proposal over OP – as the the spot price assumed at the time of posting was much higher. If this price changes between then and when the budget gets proposed on-chain, the OP amount will be readjusted to reflect the dollar amount above. OP are rounded values.  How will this distribution incentivize usage and liquidity on Optimism?    Candide will bring in more liquidity to Optimism by making it attractive and easy for users to bridge to Optimism Network. Users will be incentivized to sign a transaction on Optimism even if they didn’t have enough funds on the network, and without passing by an external front-end to bridge their assets.   By on-boarding users with some of the best fiat-on-ramps directly onto Optimism, users will find it attractive to spend the deposited funds directly on projects built on Optimism. Candide will help onboard them by creating a Portal with a curated list of projects that have been selected in Phase 0 to help users discover the Optimism Collective.    Why will the incentivized users and liquidity remain after incentives dry up?   Candide enables access to the Optimism World. Connecting to dapps on Optimism should work flawlessly. Our Portal will continue to be updated as a means of discovery for users looking to use applications on Optimism. In addition, the bridges that Candide will integrate will continue to exist and be useful for users who want to move their assets onto Optimism, keeping the liquidity flowing to the network.   Over what period of time will the tokens be distributed?  We estimate that we would be spending this amount in a time frame of 8 months.  How much will your project match in co-incentives?  Candide is a new project with no sufficient capital to currently match in co-incentives.  Resources:   Candide is completely open source and the source code can be found on Github.   Watch us during Optimism demo day on how to do a cross-roll transaction swap from Arbitrum to Optimism here.   The team consists of myself along with a few other contributors. Candide was inspired by building on multiple hackathon ideas at ETHGlobal:   CrossCash: UniCode Finalists, Uniswap Best Innovation Hack, Best use AZTEC Protocol PiggyCross: Polygon - Best Tooling/Infrastructure StroopWallet: Best use of ERC-4626 and Optimism Just Deploy    If you would like to get involved using or building Candide, we highly recommend that you reach out to us so we can onboard you. Candide Alpha is currently live.   ",
                    "links": [
                        "https://showcase.ethglobal.com/unicode/crosscash",
                        "https://showcase.ethglobal.com/roadtoweb3/piggycross",
                        "https://app.candidewallet.com",
                        "https://github.com/Sednaoui/Candide/graphs/contributors",
                        "https://medium.com/infinitism/erc-4337-account-abstraction-without-ethereum-protocol-changes-d75c9d94dc4a",
                        "https://github.com/Sednaoui/Candide",
                        "https://youtu.be/LrVEmCdJFao?t=1677",
                        "https://github.com/Sednaoui/Candide/graphs/contributors",
                        "https://ethglobal.com/",
                        "https://showcase.ethglobal.com/unicode/crosscash",
                        "https://showcase.ethglobal.com/roadtoweb3/piggycross",
                        "https://showcase.ethglobal.com/ethamsterdam/stroopwallet-9r2pj",
                        "https://app.candidewallet.com",
                        "https://gov.optimism.io/t/what-is-public-good-to-you/2875",
                        "https://gov.optimism.io/t/gfx-labs-delegate-communication-thread/2728/3",
                        "https://gov.optimism.io/t/review-gf-phase-1-proposal-optimism-rainbow/3564",
                        "https://gov.optimism.io/t/review-gf-phase-1-proposal-optimism-rainbow/3564/13",
                        "https://gov.optimism.io/t/review-gf-phase-1-proposal-optimism-tally-ho/3517/41",
                        "https://gov.optimism.io/t/draft-gf-phase-1-scratch-crypto/3476",
                        "https://gov.optimism.io/t/draft-s02-committee-proposal-tooling-governance-committee/3333",
                        "https://gov.optimism.io/t/voting-cycle-2-roundup/2754",
                        "https://gov.optimism.io/t/voting-cycle-2-roundup/2754/28"
                    ],
                    "GPT-summary": "The post is a proposal for a grant for the development of Candide, an open-source self-custodial wallet that enables cross-rollup transactions. The proposal explains the problem it aims to solve, the team's background, and the alignment with Optimism's values. It also includes a breakdown of the budget and the tasks to be accomplished, as well as the distribution of tokens and how the project will incentivize usage and liquidity on Optimism. The post invites contributors to collaborate and provides resources for those interested in the project.",
                    "GPT-proposal-categories": [
                        "Interoperability and Scalability",
                        "Grants, Funding and Resource Allocation",
                        "Smart Contract Updates",
                        "Community and Engagement",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.834637781097958
                },
                {
                    "author_link": "https://gov.optimism.io/u/Justin",
                    "index": "2",
                    "likes": "1",
                    "time": "13/06/2022-00:31:05",
                    "content": "This sounds like an interesting project that is described as a public good, making it eligible for retroactive public goods funding in the future.  My read is that the spirit of the governance fund is to incentivize usage and liquidity on Optimism - at present this proposal does not lay out a compelling argument for incentivizing usage or liquidity.  How can it be adjusted in order to do that? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.071428571428571
                },
                {
                    "author_link": "https://gov.optimism.io/u/marc",
                    "index": "3",
                    "likes": "2",
                    "time": "13/06/2022-11:54:41",
                    "content": "Thank you, and this is a good feedback. To clarify: Candide will be aiming to attract usage on Optimism from two categories of users: The first category are Ethereum natives on Mainnet. Building a 2 click solution to interact with any contract on Optimism from Mainnet will encourage users to transact on Optimism without thinking too much about bridging their assets first. Liquidity and usage will come from Mainnet and other rollups. The second category will be a path towards seeing real adoption beyond crypto natives. We aim to build the rails to connect to applications on Optimism. Getting users to understand public addresses, smart contract interactions, and let alone rollups is a huge liability on the application side. Making better wallets with great Portals to the decentralized world is the first step to bring new users that will use and bring liquidity. Subsidizing fiat-to-on ramp, which currently sits at around 3-5% for each deposit, will encourage new users to deposit fiat and increase liquidity on Optimism. Optimism was born out of a necessity for Ethereum to scale by offering lower transaction fees, and Candide aims to incentives that early phase in the user journey by breaking the high fee wall during the on-boarding phase. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.158892496392497
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "5",
                    "likes": "4",
                    "time": "20/06/2022-11:19:45",
                    "content": "Pro:  open source Doxxed team Amount of token requested is reasonable  Cons:-  I dont a niche for this, I can do the same with MM with same number of steps. 100% is going to product development No matching incentives.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/Cryptoz",
                    "index": "6",
                    "likes": "0",
                    "time": "20/06/2022-11:24:02",
                    "content": "This proposal seems to be looking to use 100% of the funds for the development of your venture. There is also already larger projects doing what you have so why would the funds delegated to you help drive OP adoption over other larger projects that are well known? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.791666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/marc",
                    "index": "7",
                    "likes": "1",
                    "time": "20/06/2022-21:34:46",
                    "content": "Hi @OPUser, thank you for your comment. Before I attempt to work out the three points that you have listed, just wanted to say that you are one of few delegates that actively engages in proposal feedback and you are doing a great job in it. Please continue doing so as you definitely set a high standard in governance and do represent well Optimism’s values. To discuss the three points that you mentioned:     OPUser:  I dont a niche for this, I can do the same with MM with same number of steps.     I challenge your assumption that you can do a cross roll-up transaction in an equal number of steps with Candide and MetaMask. We are looking at   +10 clicks and inputs on a front-end bridge and MetaMask VS   2 click transaction signing on Candide   That’s assuming knowledge of bridges and remembering to transfer some ETH for gas. I remember that you were present during Optimism day, but I invite you to re-watch our demo to see how easy it was to setup a wallet and do a cross-rollup transaction between Arbitrum and Optimism, all in less than 4 mins. We are redefining how wallets are designed, and we are looking to iterate on Candide to make Ethereum accessible, not only for crypto natives, but for next billion users on Layer 2.       OPUser:  100% is going to product development    To clarify, 20% is allocated for incentives      marc:    Fiat-on-Ramp 20%   Candide plans to offset the fees required to deposit to on-ramp operators; making it essential free to get on-boarded Optimism without going through Layer 1.    We followed the guidelines set by Optimism on phase 0 that no more than 20% should be distributed as incentives.     OPUser:  No matching incentives.    Candide is launching as a public good and we don’t plan to issue a toke. However we do plan to become profitable. If the collective thinks that matching in co-incentives is indispensable to bring liquidity and usage to Optimism, we can pledge that we set aside 10% of profits each month to match 1:1 the incentives allocated for fiat-on-ramp fees.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.572348484848485
                },
                {
                    "author_link": "https://gov.optimism.io/u/marc",
                    "index": "8",
                    "likes": "0",
                    "time": "20/06/2022-21:46:26",
                    "content": "Hi @Cryptoz and thank you for your feedback. To answer your concerns:     Cryptoz:  100% of the funds for the development   To clarify, 20% of allocations are set aside for fiat-on-ramp incentives     marc:    Fiat-on-Ramp 20%   Candide plans to onboard users directly onto Optimism with some of the best fiat-on-ramps. An on-ramp essentially allows you to convert fiat money into cryptocurrencies. Candide plans to offset the fees required to deposit to on-ramp operators; making it essential free to get on-boarded Optimism without going through Layer 1.        Cryptoz:  There is also already larger projects doing what you have so why would the funds delegated to you help drive OP adoption over other larger projects that are well known?   Indeed, the current wallet space is dominated by a single large player and we think that should change. We believe that Optimism should fund Candide because funding open source accessible wallets fosters a collaborative culture that will make Ethereum Layer 2 accessible for all. Candide is an opportunity to deliver a wallet built on openness through its product, culture, code, and community. A the current stage, larges companies are offering wallets that are heavily replied on centralized API services that connects to Ethereum, although of the premise of Ethereum is decentralized. We are already seeing issues in the wallet space; where several instance of Public RPCs going down for millions of users.  Encouraging independent small players to enter the space is not only healthy for competition but also will move us closer to properly authenticated decentralized wallets. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.450479497354497
                },
                {
                    "author_link": "https://gov.optimism.io/u/William",
                    "index": "9",
                    "likes": "0",
                    "time": "21/06/2022-08:28:01",
                    "content": "Your wallet idea sounds cool, though the name is terrible – it sounds like candida infection (sorry). I think the L2 wallet idea is good. I’ll be following this. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.55
                },
                {
                    "author_link": "https://gov.optimism.io/u/marc",
                    "index": "10",
                    "likes": "1",
                    "time": "21/06/2022-16:45:49",
                    "content": "hey @William, excited that you would be following our journey! As part for the our wallet’s name, it comes from the work of the French 18th century writer and philosopher Voltaire. From his legendary novel CANDIDE, which means Optimism. We have a good story to tell, and I am glad you will stick around to know it. For now, I will leave you with this twitter thread  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.145833333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "11",
                    "likes": "0",
                    "time": "21/06/2022-21:01:26",
                    "content": "Hey @marc Thank you for this proposal. Since most of the funds are requested for the development purposes of the wallet which is opensource software could you maybe add a budget proposal? 160k OP ~= $86k USD. How do you plan to spend those? How many people will be paid and for how long? What salaries etc.? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.583333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/marc",
                    "index": "12",
                    "likes": "2",
                    "time": "22/06/2022-22:44:52",
                    "content": "Hi @lefterisjp and thank you for your feedback. The initial draft wasn’t clear enough in the budget spending and I will attempt to breakdown the budget proposal that Candide is requesting. Candide works as a collective of individuals that cares about building accessible Layer2s wallets. For this grant, we will setup a program to invite contributors who would like to collaborate on working on new features, design and communication. We estimate that a single contributor that we will onboard will be paid for his time around 3k a month, averaging between a developer, a designer and a content creator.     Budget Category Description & Assumptions Amt USD     Fundamentals Build fundamental wallet components to properly support Rollups like Optimism $20,000   Ecosystem integration Add wallet integrations that augments and encourage the use of the network $20,000   Interface Design and implement accessible interfaces that are designed for Layer2s $20,000   Educational Create a space to learn about Ethereum scaling solutions and self-custodial wallets $10,000   Incentives Subsidie fiat-on-ramp fees that are deposited to Optimism $15,000   New Beta Experiment with interfaces on top of Account Abstraction  $4,000    Total Budget: $89,000 At current price of ~$0.468 per OP at the time of writing this proposal, this amounts to ~190k OP. We estimate that we would be spending this amount in a time frame of 8 months, averaging ~$11k per month.  To breakdown further some of the tasks in each category:   Fundamentals: this includes to the basic features that are supported in mainstream wallets. Examples includes displaying account balances and estimating gas on contract interactions.  Ecosystem integration: this includes integrations that are vital for users to deposit and interact with Optimism network. Examples are fiat-on-ramp integration and in-app bridging support.  Interface: this includes studies on how to properly design easy to use wallets that are native to Optimism and Layer2s and that includes design interfaces and front-end work.  Educational: this will be considered our marketing strategy, fostering not only an awareness of Candide but also Ethereum’s decentralized values and Layer2s purposes. Example includes blog posts community engagement.  Incentives: Candide plans to offset the fees required to deposit to on-ramp operators; making it essential free to get on-boarded Optimism without going through Layer 1.  New Beta: As the tech mature, Candide would like to experiment with Account Abstractions that is directly built on top of Layer2s. We would use that budget specifically to research around that topic.  Note: I have added a denomination in dollar amount to be prioritized in this budget proposal over OP – as the the spot price assumed at the time of posting was much higher. If this price changes between then and when the budget gets proposed on-chain, the OP amount will be readjusted to reflect the dollar amount above. OP are rounded values. I will be updating the current draft with the new detailed changes. ",
                    "links": [
                        "https://gov.optimism.io/t/accountability-of-phase-0-1-funds-given-to-projects/2762/3"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.74312246892892
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "13",
                    "likes": "1",
                    "time": "22/06/2022-22:58:27",
                    "content": "Thank you for this, with proper funding allocation, you proposal is more clear. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/William",
                    "index": "14",
                    "likes": "0",
                    "time": "23/06/2022-04:51:07",
                    "content": "Have to echo @Cryptoz here, I’m not seeing any real benefit of this proposal to OP holders ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "15",
                    "likes": "1",
                    "time": "23/06/2022-11:21:24",
                    "content": "Thank you marc. This is helpful. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/jacob",
                    "index": "16",
                    "likes": "2",
                    "time": "23/06/2022-20:54:30",
                    "content": "Thanks for putting this together @marc and for updating the proposal based on community feedback. Excited to see that ETHGlobal was able to be part of your journey and both the value proposition for Optimism and proposal budget makes sense in my mind. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.791666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/jjlee710",
                    "index": "17",
                    "likes": "0",
                    "time": "24/06/2022-04:10:27",
                    "content": "i an happy to hear the news that you, candide wallet takes part in op eco. i support you ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/0x000",
                    "index": "18",
                    "likes": "1",
                    "time": "24/06/2022-23:23:23",
                    "content": "It’s an interesting idea, and any project which will help onboard more users to Optimism in simpler ways is a welcome addition. I know this does not affect the tech, but the name sounds like candida, the yeast that causes infections. Branding is very important to the success of a project, so please consider this feedback. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 7.62
                },
                {
                    "author_link": "https://gov.optimism.io/u/polynya",
                    "index": "19",
                    "likes": "2",
                    "time": "26/06/2022-05:25:59",
                    "content": "I’m voting Yes - wallet UX definitely has tons of room for improvement, and I like your rollup-centric approach, though I’m skeptical about adoption as you haven’t highlighted a convincing plan to gain users from well-established incumbents like MM. Would definitely like to see account abstraction on Optimism asap. Another thing I’d like to see is support for BLS signatures in your wallet, this has long been a bottleneck for rollups. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.95
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "20",
                    "likes": "1",
                    "time": "26/06/2022-08:39:29",
                    "content": "Voted: Yes Pros:  Open source i.e public good Excellent fund distribution plan Amount of token requested is reasonable POC exist Have seen a working demo of the project  Cons:  Wallet market is crowded, bringing users to use the wallet will be a challenge  Now, Its your time to provide feedback,  I request you to share your view on these two of my idea/suggestion.     Proposal to stop Phase 0 Projects to submit new proposal in Phase 1 💌 Ideas & Feedback       There were 20+ projects in Phase 0, some of them has a good plan to distribute the token while other does not. Here is an excellent summary by @MinimalGravitas .  Phase 0 officially concluded yesterday and soon OP will distribute 36M token between Phase 0 projects. Announcement  With this proposal, I want to share my idea and seeking your feedback on whether to allow Phase 0 projects to submit another funding proposal in phase 1 or not .  In my opinion, as long as previous funds are not exhauste…         Accountability of Phase 0/1 Funds given to projects 💌 Ideas & Feedback   Phase 0 has officially ended and soon team will unlock 36M OP token and distribute it to the Phase 0 projects.  Same steps will happen for Phase 1 projects when voting will end for Phase 1. Similar to Phase 0 proposals, I have gone through all the Phase 1 Proposals, I have followed them, suggested them something and learned something from them.  Now, I will cast my vote and would like to know how the project(s) are spending those token given to them.  Some are saying I can follow the token recip…   ",
                    "links": [
                        "https://gov.optimism.io/t/voting-cycle-1-roundup/2619/34",
                        "https://twitter.com/OptimismGov/status/1540049300025114624?s=20&t=76-46b_Z3VdB9yBPrLU1UQ",
                        "https://gov.optimism.io/t/accountability-of-phase-0-1-funds-given-to-projects/2762",
                        "https://twitter.com/OptimismGov/status/1540049300025114624",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-kromatika/2650/16",
                        "https://gov.optimism.io/t/voting-cycle-2-roundup/2754/45",
                        "https://gov.optimism.io/t/opuser-delegate-communication-thread/2777/5"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.30565268065268
                },
                {
                    "author_link": "https://gov.optimism.io/u/Axel_T",
                    "index": "21",
                    "likes": "2",
                    "time": "26/06/2022-09:49:25",
                    "content": "Congrats on convincing two of the ‘delegate whales’ @marc  That’s great news for you, and hopefully (or eventually) the OP Community! It’s uplifting seeing a new(ish) project take a strong lead in the voting count. …Now I’d get onto replying to @OPUser’s requests for feedback, pronto!  Cheers! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 8.628472222222221
                },
                {
                    "author_link": "https://gov.optimism.io/u/marc",
                    "index": "22",
                    "likes": "1",
                    "time": "26/06/2022-20:21:00",
                    "content": "thank you for your support! @jacob @jjlee710 @polynya @0x000 @OPUser @Axel_T OPUser, Thanks for being active in governance. I have given feedback on both of your proposals that you have come forward with. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is thanking for support and feedback",
                        "3rd party giving feedback on proposal"
                    ],
                    "Sentiment": 5.166666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/ScaleWeb3",
                    "index": "23",
                    "likes": "0",
                    "time": "27/06/2022-08:52:28",
                    "content": "This proposal fits into Gov Fund Phase 1 but the value-add to Optimism is small: Voting No Value-add: Short-term little. Long-term potentially interesting Amount: Reasonable Op distribution: Okayish - building the product Co-incentives: none We see this funding round’s goal primarily in increasing liquidity and users on Optimism. The project vision sounds interesting but has a very long way to go until it can potentially add something to this goal. You listed a couple of interesting features and incentives that we’d like to see from bigger wallets with existing user bases. Maybe it would be a good idea to raise some funds for your venture, to collaborate with existing wallets or focus on tools that others can implement too (Which could be eligible for funding too). Definitely hope to see you around & look forward to your product. ",
                    "links": [
                        "https://gov.optimism.io/t/stablenode-delegate-thread/2973/3"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.957291666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/tipecrpto",
                    "index": "24",
                    "likes": "0",
                    "time": "27/06/2022-10:18:41",
                    "content": "not heard of candide wallet before so cant really give my opinion but i dont think funding your project to launch is what the goal of these funding rounds are ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "25",
                    "likes": "2",
                    "time": "27/06/2022-12:38:18",
                    "content": "So marc I wanted to provide some more feedback. I am a big fan of opensource and public goods and believe development work should be funded and new projects, like Candide should be given a chance to thrive. The funding amount ask is very reasonable imo. I want to see your project succeed and thrive and I believe it has potential to help the optimism ecosystem so I will be voting yes. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.746969696969697
                },
                {
                    "author_link": "https://gov.optimism.io/u/marc",
                    "index": "26",
                    "likes": "0",
                    "time": "27/06/2022-21:06:05",
                    "content": "Hello @ScaleWeb3, thank you for the consideration and your thoughtful feedback. We do recognize that the project is its early form, but we are well aligned with Optimism two houses’ mission as they are tasked with balancing long-term vision with short-term incentives. We see value in the common good, and that’s why we don’t want to raise venture fund. We are pursing open source for a sustainable future and an open internet, and we see Optimism as mechanism in rewarding public goods a step towards that future. Thank you again for your well though feedback and I look forward in seeing you around as well. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.699999999999999
                },
                {
                    "author_link": "https://gov.optimism.io/u/marc",
                    "index": "27",
                    "likes": "0",
                    "time": "27/06/2022-21:10:10",
                    "content": "Hello @lefterisjp, thank you again for your initial feedback early on as it helped formulate the initial draft. We appreciate your voice in advocating for open source as public goods. Thank you for your support. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.1
                },
                {
                    "author_link": "https://gov.optimism.io/u/yoavw",
                    "index": "28",
                    "likes": "2",
                    "time": "01/07/2022-22:39:53",
                    "content": "Voting YES.  We need better cross-chain wallet support.  And +1 on ERC 4337 support! Re BLS (mentioned by @polynya ), the next iteration of ERC 4337 will support aggregation as part of the protocol.  BLS will be the first aggregator to be implemented after the API is finalized.  ERC 4337 wallets with BLS support will be quite efficient on rollups. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.458333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/fewol",
                    "index": "29",
                    "likes": "0",
                    "time": "04/07/2022-22:45:06",
                    "content": "My main concern is that when funding the development of a new project how will it drive adoption? It’s all well developing something opensource, but to drive value to Optimism in terms of use or adoption it means you need to drive users and for that you need capital to market. Funding development of open source projects is really a public good, because most open source projects never really get off the ground unlike private projects. Its why I am not a big believer in funding open source projects as the majority never bring short or long term value or a return on the amount funded. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.520396270396271
                },
                {
                    "author_link": "https://gov.optimism.io/u/SEED_LATAM_Joxes",
                    "index": "30",
                    "likes": "1",
                    "time": "05/07/2022-17:47:27",
                    "content": "We are voting yes on this proposal. Reasons are: an easy use of Layer 2 is welcome, and new features like account abstraction are interesting to look at. The status of the project is experimental I guess, we are OK to take the risk for its approach. We will follow it closely. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 7.058080808080808
                },
                {
                    "author_link": "https://gov.optimism.io/u/krzkaczor",
                    "index": "31",
                    "likes": "1",
                    "time": "05/07/2022-19:11:15",
                    "content": "I’ll vote Weak YES  Project quality: Mid-High - Wallets for cross-chain world seem to be important but it seems to early to tell if the team will be able to deliver Team quality: Mid - doxxed, I can’t find any track record. Code is open source on gh. Amount requested: Reasonable OP distribution: Bad - dump to cover operational costs ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party giving entirely positive feedback on proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.078125
                },
                {
                    "author_link": "https://gov.optimism.io/u/linda",
                    "index": "32",
                    "likes": "0",
                    "time": "06/07/2022-15:23:48",
                    "content": "Thank you for your proposal and it’s awesome to see that Candide originally started at an ETHGlobal hackathon and that it is open source. I was also impressed with your response to feedback/questions. The amount requested is reasonable but the wallet space is crowded and since there isn’t traction to go off of yet it’s not clear to me this is the best use of funds to grow the Optimism ecosystem and in my opinion could be a better fit for the Citizen House that will be live soon and specifically supports public goods funding so I am voting no for this phase. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 7.073347107438018
                },
                {
                    "author_link": "https://gov.optimism.io/u/vonnie610",
                    "index": "33",
                    "likes": "0",
                    "time": "07/07/2022-18:51:28",
                    "content": "Snapshot vote - Passed ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/marc",
                    "index": "34",
                    "likes": "2",
                    "time": "26/07/2022-09:23:54",
                    "content": "Thank you all for your feedback and your support. We will be working in public and are starting with our experiment to build on top of ERC-4337 Account Abstraction.  We detailed our rational in this article. We wrote our plan and opened our collaboration document for everyone to see, and contribute. In this document you will find feature development, contributor roles, communication posts, and progress reports.  If you are excited to try out our future beta, join the conversation on discord to give feedback and help shape the next wave of wallet development. ",
                    "links": [
                        "https://coda.io/d/_dlTu117DFeB/Contributors_su49c",
                        "https://discord.gg/NM5HakA9nC"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.910714285714286
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "35",
                    "likes": "1",
                    "time": "26/07/2022-09:59:55",
                    "content": "Hi @marc , Thank you for keeping us in loop. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/bobby",
                    "index": "36",
                    "likes": "0",
                    "time": "26/07/2022-23:13:22",
                    "content": "Hello @marc! Can you provide a Telegram handle or other contact method so the Optimism team can get in touch about paying out this grant  Feel free to comment on this thread, DM, or email bobby@optimism.io. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.6875
                },
                {
                    "author_link": "https://gov.optimism.io/u/marc",
                    "index": "37",
                    "likes": "0",
                    "time": "27/07/2022-08:19:02",
                    "content": "Hello @bobby, I am sending you an email from sed@protonmail.com ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "38",
                    "likes": "0",
                    "time": "13/09/2022-19:54:36",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "39",
                    "likes": "1",
                    "time": "05/01/2023-19:14:43",
                    "content": "Hi @marc! It’s been a few months since your OP grant distribution, checking in to see if there is a grant update you can share with the community? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "40",
                    "likes": "0",
                    "time": "09/01/2023-15:14:28",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/marc",
                    "index": "41",
                    "likes": "3",
                    "time": "16/01/2023-18:52:09",
                    "content": "Hello @lavande , Here’s the links to our progress updates that we have published: Progress #0 Progress #1 Progress #2 Progress #3 Thus far, CANDIDE have spent a total of ~37,400 OP tokens. With each update published, the amount of expenses is accounted for in the same document, on the expenses page. Updates are published  each ~month on our public working page and on Optimism Discord gov channel. I will be following up with future new updates here ",
                    "links": [
                        "https://coda.io/@candide/contributors/progress-1-25",
                        "https://coda.io/@candide/contributors/progress-2-27",
                        "https://coda.io/@candide/contributors/progress-3-36",
                        "https://coda.io/@candide/contributors/expenses-6"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party giving information on project progress",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.085227272727273
                },
                {
                    "author_link": "https://gov.optimism.io/u/petzoliver",
                    "index": "42",
                    "likes": "0",
                    "time": "17/01/2023-09:38:14",
                    "content": "Amazing sir         ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                }
            ]
        }
    ],
    "group_index": "88"
}