{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/recap-community-governance-call-9-november-22th/4072",
            "title": "Recap: Community Governance Call #9 (November 22th) ",
            "index": 4072,
            "category": [
                "\\xf0\\x9f\\x93\\xa2 Updates and Announcements",
                "Community Calls"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/Michael",
                    "index": "1",
                    "likes": "12",
                    "time": "22/11/2022-20:12:38",
                    "content": "Hey Optimists! Thanks for participating in this weeks governance call. The slides for the call can be found here. The recording can be found here. Summary of discussion:  More information coming on Grants Council Lead application and on Grants Council Membership Nomination soon. This information will be available before the end of voting cycle #9a so that people will be able to work on them before the voting ends for the grants council proposal. RE: Code of Conduct. Offboarding will start out as a one-season suspension. It might be time to make a post on our current point on the path towards decentralization (@bobby). The proposed grants committee will technically not be distributing funds themselves, but instead make recommendations to the foundation who will distribute the funds. Suggestion that one of the Optimism “nerds” should be on the grants council. Response that we’d love to see them nominated. Idea floated to distributed some voting power to top NFT projects in addition to protocols. RE: Role of delegates if grants council is passed. Non-council delegates will provide oversite and accountability to council and grant recipients. In future seasons, there will be important non-council related roles as well. More info coming soon. As far as this season goes, there will be other proposal types to be voted on such as protocol upgrades. No requirements to be nominated to the grants council, other than one spot reserved on each sub-committee for a previous committee member. Details coming on elected committee member roles. Grants committee lead is through an application process with the foundation (not an elected role). If grants council proposal is rejected, voting cycle 9b will likely be for alternative proposals. Protocol Delegation program would last for 2 seasons total. Discussion on accountability of foundation given that votes are non-binding. What happens if a vote to remove a director goes through? Foundation will honor votes to remove a director. In cases of a governance attack, this should be obvious and the foundation has the authority to protect against this. In general, we’d like to see more documentation around the decision making process of the Optimism Foundation Board.  The next call will be Dec 6th. - Michael   ",
                    "links": [
                        "https://drive.google.com/file/d/1MwWHAxl-XIm8slHz5KArcPlHiFoxAaDh/view?usp=share_link",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/19",
                        "https://gov.optimism.io/t/op-community-governance-call-december-6th-at-10am-pt-1pm-et-7pm-cet/4112"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.777777777777777
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "2",
                    "likes": "1",
                    "time": "22/11/2022-21:55:24",
                    "content": "Thank you! Such a good call I’m so sad I missed it! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.125
                },
                {
                    "author_link": "https://gov.optimism.io/u/Boardroom",
                    "index": "3",
                    "likes": "1",
                    "time": "23/11/2022-14:26:41",
                    "content": "Many thanks Michael! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://gov.optimism.io/u/danki",
                    "index": "4",
                    "likes": "1",
                    "time": "23/11/2022-17:08:24",
                    "content": "Thank you for the recording! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/polynya",
                    "index": "5",
                    "likes": "2",
                    "time": "24/11/2022-04:16:31",
                    "content": "    Michael:   It might be time to make a post on our current point on the path towards decentralization (@bobby).    About time [filler chars] ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/kinglee",
                    "index": "6",
                    "likes": "0",
                    "time": "27/11/2022-08:11:31",
                    "content": "Thank you for your call，I’m so sad I missed it! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 1.875
                },
                {
                    "author_link": "https://gov.optimism.io/u/Ikpeamarom",
                    "index": "7",
                    "likes": "0",
                    "time": "30/11/2022-12:41:12",
                    "content": "please what time and on what platform will the next call hold ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "350"
}