{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/draft-gf-unmarshal-grant-cycle-11/5414",
            "title": "[DRAFT] [GF: Unmarshal GRANT CYCLE 11 ",
            "index": 5414,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Grants Council"
            ],
            "tags": [
                "growth",
                "cycle-11"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/Deepti_GN",
                    "index": "1",
                    "likes": "4",
                    "time": "03/03/2023-15:24:58",
                    "content": "Project name: Unmarshal Author name and contact info (please provide a reliable point of contact for the project.):Deepti Gn - (Telegram- deepti_gn, Ph: 9066309163) L2 recipient address: 0x1fd32485fB32c4849BE7757eFAFebC3DA5E4CC61 Which Voting Cycle are you applying for?: Cycle 11 I confirm that I have read the landing pages for the Builders 7 and Growth Experiments 10 Sub-Committees and that I have determined my proposal is best suited to be reviewed by the Growth Experiments Sub-Committee: [Yes/No]: Yes I understand that Growth Experiments grants are subject to a “no sale rule,” as explained in this post 5, and I have read the terms of the rule: [Yes/No]:Yes Project Details: Unmarshal is a multi-chain data infrastructure provider which enables Web 3.0 projects to speed up their development through auto-indexing of blockchain networks, dashboard analytics & visualisation, and also enabling personalised experience through notifications & alerts services. Unmarshal Product Suite   Defi APIs- Along with providing the transactions and wallet balances details as APIs, Unmarshal will also support DeFi users by allowing them to view their wallet balances, asset holdings, DeFi positions (such as LP positions, staking etc) transactions and NFTs and much more.   NFT APIs- Unmarshal also supports the data requirements for NFTs.    NFT Holders by ID Transactions by Address with pagination NFT Contract Transactions NFT details of all tokenIds of a contract Provides all token ids available for a nft contract NFT assets by Address with offset based pagination   Notifications- Unmarshal has already built the notifications for the following transactions:   Send Receive Add liquidity Remove liquidity Approve Stake UnStake Exchange   Parser- No Code Smart Contract Indexer allows users to index events and functions relating to any smart contract to a relational database. Unmarshal Parser supports all EVM based chains. Once decoded and indexed, the data is made accessible through   Metabase Dashboards GraphQL APIs  We cater both macro & micro level data, and innovating the on-chain data computation industry with our Parser services which serves 70% of customised use cases of smart contract developers. What are you building?: We have built the user friendly and required products for the Dapp developers to use it ready. Why do you believe what you are building is going to succeed?: Developers look for easy way to access data, Web3 is still in its infancy, but in the previous two years, there have been more apps developed on various Blockchains, including Optimism. We still think of ourselves as pioneers, and in the next few days, we want to dominate the market as the leading data provider with your team support. Our founders previously served as consultants for a well-known Dapp aggregator before founding Unmarshal. None of the options they sought to use to solve the issues could precisely meet their needs. That’s when unmarshal was found and is making an effort to solve the data accessibility issue. Unmarshal would like to index the entire Optimism chain and provide meaningful on-chain data that will enable the Optimism ecosystem of developers to utilise the data End points for their convenience. Indexing Optimism Chain can be useful for multiple Stakeholders in various ways. Our Solution will be helpful for Optimism Team: To Provide defi users dynamics and business intelligence, mapping out the next growth sector. How many users does your project have currently? Please include how you arrived at this estimate: Unmarshal currently supports over 20 different chains namely Ethereum, BSC, Solana, Polygon. Most of our clients are Multi chain clients and we have a track record of bringing multiple clients to the newer ecosystem we support. We have 2k+ users and we do track of all the user flow on the dashboard analytics created by us to see the performance. How will receiving a grant enable you to further the mission of maximising the number of users interacting with Optimism? Please include a step-by-step flow of how you imagine this grant can lead to a greater number of user interactions with Optimism: Unmarshal indexes the blocks on a specified blockchain and provides:   Simple, easy to use data for DeFi apps or for anybody who requires on-chain data.   A plug and play smart customized notification (mobile and browser) service for Dapp users and developers   Integration of chain into a multichain explorer xscan, where Hedera users can track their portfolio along with 5 different chains   Integration to revolutionary no-code smart contract indexer - Parser   Tell us about the users you plan to target with this grant. Include any defining characteristics that will help you identify and target them.: Dapp developers make up the majority of our users, and we adapt to their demands as needed. Our developer community is growing, and 1500+ Dapps use Unmarshal services focused on user friendliness. The APIs we provide are very userfriendly and way faster compared to other competitors. We have a separate search engine blockchain explorer which can fetch all the details pertaining to any wallet address. How would these users interact with Optimism? For how long?: Any of the users needs to sign up on the console to get permanent access to API keys. Post which they will be able to hit APIs. Provide us with links to any of the following for the project:  Demo: https://console.unmarshal.io/  Website:https://unmarshal.io  Twitter: twitter.com/unmarshal  Discord/Discourse/Community: discord.gg/SqhYdGYtEr Github: Unmarshal · GitHub  Technical/Economic Documentation: https://docs.unmarshal.io  Other: Unmarshal Product Suite Walkthrough | DeFi APIs | NFT APIs | Notifications | Parser - YouTube        Do you have any metrics on the project currently? (TVL, transactions, volume, unique addresses, etc. Optimism metrics preferred; please link to public sources such as Dune Analytics, etc.): We are multi hain infra providers and not a protocol.  More than 25+ chains have been indexed by us since December 2021. Unmarshal has served more than 801 Million API requests in the preceding month. Uptime: 99.3% (Q3, 2022) Latency: 193 ms Exclusive partnerships with leading Clients in Web 3 Space - 80 Total Dapps using Unmarshal services: 1500+ Total Analytical Dashboards built - 300+  Who are your competitors, and are they on Optimism?:  The Graph- The Graph  Moralis- https://moralis.io/   Please link to code audits (if any): No Team: Manohar Kolagondanahalli(Full Time) - CEO & Founder - https://www.linkedin.com/in/manoharak/ Shivakumar HG (Full Time)- CTO & Co - Founder - https://www.linkedin.com/in/shivhg/ Yogesh Talurmath (Full Time)- CMO - https://www.linkedin.com/in/yogeshtm/ Chetan Kashetti (Full Time) - Tech Lead - https://www.linkedin.com/in/chetan-kashetti-0972317a/ Senior Engineers: Pujith(Full Time) - https://www.linkedin.com/in/pujith-m/ Engineers Anusha(Full Time)- https://www.linkedin.com/in/anusha-sridhar-9a5a93191/ Suyog (Full Time)- https://www.linkedin.com/in/sygbht/ Abbas (Full Time)- https://www.linkedin.com/in/abbas-travadi-8460b4194/ Marketing & BD Chiranth (Full Time)- https://www.linkedin.com/in/chiranthv/ Deepti GN (Full Time)- https://www.linkedin.com/in/deepti-g-n-666b0b93/ Saarika Velayudhapani (Full Time)- https://www.linkedin.com/in/saarika-velayudhapani-b62836184/ Who are your founders?: Manohar Kolagondanahalli - CEO & Founder What makes your team well-suited to carry out the project described in this proposal? Unmarshal has successfully thrived in the Blockchain Data market for over 2 years and we have integrated over 25+ chains so far. The core team is deep into understanding the blockchain data and hence the widespread reach in the data field. Our Team has rigorously targeted the Non EVM chains and would be more than happy to include Hedera to our Arsenal.We’re a team of 10+ engineers collectively with more than 40yrs of engineering experience trying to make blockchain data accessible. Is this your first Web3 project?: Yes If not, what else have you built? (Share links, Github repository, or any other useful information.): Grant Request What is the size of the grant request? (250k OP max): 75k OP tokens How do you justify the size of the grant?: The grant taken would be utilised for product creation and ecosystem expansion. Roadmap and Distribution Plan Future Plans- Leveraging the data that we’ve indexed for multi-chains, innovative products and ideas such as wallet score, copy trading, and wallet based ads can be built. Timeline and Milestones ( Cost in OP) Milestone 1 — Indexing The Node  Estimated Tech Work - 12 days Time to Sync data - 7-14 days (depends on the volume of data) Number of resources - 4 Approximate Estimated Cost - 15,000  Milestone 2 — Decoding Data  Estimated Duration - 18 days Number of resources - 2 Approximate Estimated Cost - 10,000  Milestone 3 — API services  Estimated Duration - 14 days Number of resources - 2 Approximate Estimated Cost - 10,000  Milestone 4 — Explorer Integration (Xscan.io)  Estimated Duration - 14 days Number of resources - 3 Approximate Estimated Cost - 5,000  Milestone 5 — Notification Services  Estimated Duration - 14 days Number of resources - 3 Approximate Estimated Cost - 10,000  Milestone 6 — Parser Services  Estimated Duration - 21 days Number of resources - 2 Approximate Estimated Cost - 15,000  Milestone 7 — Enabling Analytics Framework  Estimated Duration - 14 days Number of resources - 2 Approximate Estimated Cost - 10,000  Describe in discrete steps how you will successfully implement your grant plan: infra maintenance. Besides revenue we would like to evolve as an ecosystem , where we build a strong web3 developer community who can help each other as peers. we would like your support rendered for us to emerge as the top most data providers. We have a handful of developers who are supporting us in our Unmarshal journey.     Priority Deliverable Specification     0 Indexing the Node Reading through the entire chain and procuring all on chain data   1 Decoding the Data Understanding the technical on chain data and converting them to human readable format but in a raw shape   2 Constructing Optimism API Services Making meaningful endpoints for quick Integration into Dapps   3 Explorer Integration Integrating Optimism with Unmarshal’s xscan.io    4 Building the Notification Framework Creating the notifications framework for Optimism that allows Dapps to notify the users of any onchain activities   5 Creating Parser Framework Parser framework allows users to index any contract and use the data as they wish.   6 Enabling Analytics for Optimism chain With the data indexed on parser users will be able to create their own analytics charts per their wish   7 Testing & Verification Data Verification and Validation   8 GTM Go to market strategy and release including hackathons   9 On going Integration & Guidance Support network upgrades as well as future launchpad    How will the OP tokens be distributed? (please include % allocated to different initiatives such as user rewards/marketing/liquidity mining. Please also include a justification as to why each of these initiatives align with the problem statement this proposal is solving. Distribution should not include the sale of any tokens by the grantee or the use of tokens for compensation, protocol expenses, etc. See the no sale rule here 5):  A majority of the raised capital, i.e., 35%, will be used to upscale the team with new hires. 20% for international expansion, including hiring, company registration, and setting up an office. A quarter of the funds will be used for new user acquisitions and growing our ecosystem The remaining 20% will be used to upkeep & maintain infrastructure costs and any additional operational costs.  Over what period of time will the tokens be distributed for each initiative?: The received tokens will be utilised within the period of 1 year Please provide benchmark milestones for this project. These milestones should guide the Optimism community on the progress of your project throughout your work on the project. Do not use distribution of the grant itself as a milestone: It is estimated that Unmarshal integration will expedite the Dapp development by 40% by giving all the necessary developer tools for indexing and analytics.  Unmarshal can introduce 1300+ multichain dapps into Optimism ecosystem Unmarshal’s Xscan can act as a wallet explorer similar to etherscan, bsc scan.    Adapt the Unmarshal framework to incorporate the optimismChain.   The Optimism community will have access to all onchain data by using our services. We will explore opportunities to promode No code indexer parser, so that anyone can use Parser to build analytical dashboards based on smart contracts if they want their own data to be indexed.   Please define critical milestones for this project. Critical milestones are meant to show good-faith efforts to accomplish the project. Non-completion of these milestones could lead to revocation of remaining grant rewards. Do not use distribution of the grant itself as a milestone: 1.By the end of Q4 2022, or three months after the revenue stream begins, we hope to increase partnerships with Dapps and Blockchain. Improve Unmarshal’s product features to expand its user base. 2.Through a variety of marketing initiatives, email campaigns, and hosting hackathons, we raise brand recognition.  With the aim of significantly exceeding prior quarters by over 50%, we will leverage social media marketing to encourage sign-ups and boost API users.  If the OP tokens are for direct distribution to users, why will incentivized users and liquidity on Optimism remain after incentives dry up?: Comparing the performance of Unmarshal’s deployment on the CELO chain.Throughout the first 3 days, we got 1M+ API calls. Thus, we are sure that optimism may be held to the same standard.Additionally, we would be doing a lot of marketing strategies to increase total user base. Even once the incentive programme ends, we are confident that usage will not decline. Please provide any additional information that will facilitate accountability (smart contracts addresses relevant to the proposal, relevant organisational wallet addresses, etc.): Marsh Token Contract Address- 0x2fa5daf6fe0708fbd63b1a7d1592577284f52256 Optimism Relationship Does your project solve a problem for the Optimism ecosystem? If so how?: Data accessibility Issue. Our founders previously served as consultants for a well-known Dapp aggregator before founding Unmarshal. None of the options they sought to use to solve the issues could precisely meet their needs. That’s when unmarshal was found and is making an effort to solve the data accessibility issue. Why will this solution be a source of growth for the Optimism ecosystem?: Though Blockchain Data is public, its inconsistent and not readily accessible.Accessing the data from blockchain is difficult because of complex data processing needs. We are providing Reliable blockchain data infrastructure that’s composable and easily accessible to Clients( Dapp developers). Therefore solving the accessibility issue increases the user growth. Is your project Optimism Native?: No Confirmations I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: [Yes/No]: Yes I understand that I will be expected to following the public grant reporting requirements outlined here: [Yes/No]: Yes ",
                    "links": [
                        "https://foul-porch-0eb.notion.site/Growth-Experiments-Sub-Committee-270d2f75ff0f410a869b2ba6a8324006",
                        "https://gov.optimism.io/t/grant-proposal-template/3233",
                        "https://console.unmarshal.io/",
                        "https://unmarshal.io",
                        "http://twitter.com/unmarshal",
                        "https://github.com/eucrypt/",
                        "https://docs.unmarshal.io",
                        "https://www.youtube.com/watch?v=Jaz96LzRiPw",
                        "https://www.youtube.com/watch?v=nNjgY-It7wc",
                        "https://thegraph.com/en/",
                        "https://moralis.io/",
                        "https://www.linkedin.com/in/manoharak/",
                        "https://www.linkedin.com/in/shivhg/",
                        "https://www.linkedin.com/in/yogeshtm/",
                        "https://www.linkedin.com/in/chetan-kashetti-0972317a/",
                        "https://www.linkedin.com/in/pujith-m/",
                        "https://www.linkedin.com/in/anusha-sridhar-9a5a93191/",
                        "https://www.linkedin.com/in/sygbht/",
                        "https://www.linkedin.com/in/abbas-travadi-8460b4194/",
                        "https://www.linkedin.com/in/chiranthv/",
                        "https://www.linkedin.com/in/deepti-g-n-666b0b93/",
                        "https://www.linkedin.com/in/saarika-velayudhapani-b62836184/",
                        "http://xscan.io/",
                        "http://xscan.io",
                        "http://calendar.google.com/calendar/u/0/r?tab=mc",
                        "https://gov.optimism.io/t/suggested-public-reporting-requirements-for-grantees/4176"
                    ],
                    "GPT-summary": "The post is a proposal for a grant cycle for a project called Unmarshal, which is a multi-chain data infrastructure provider. The author explains the project's features, target audience, and how the grant will be used. The post also includes links to the project's website, social media, and technical documentation. A 3rd party could give entirely positive feedback on the proposal, extend to the proposal, ask questions about the proposal, or audit and review the proposal.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Interoperability and Scaleability",
                        "Smart contract updates",
                        "Community and engagement",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.549829397655484
                },
                {
                    "author_link": "https://gov.optimism.io/u/Michael",
                    "index": "2",
                    "likes": "1",
                    "time": "13/03/2023-19:07:34",
                    "content": "Thank you for submitting this grant application! Throughout the application process, this forum thread will be one of the official means of communication. Please be sure to monitor it for updates over the course of the review period. At this stage, applications are mainly being reviewed for completeness, and nothing at this stage should be construed as support or opposition by any members of the Grants Council. The current distribution plan of this grant falls afoul of the no-sale rule as described in this post:    Season 2 Grant Proposal Template 📌 Policies and Templates   Phase 1 Proposal Template v2 All Governance Fund grant proposals will be processed by a Grants Council in Season 3. Please submit your application to the Grants Council here following the process outlined here.   ALL CYCLE 11 GRANT PROPOSALS SHOULD USE THE UPDATED TEMPLATE HERE.   Key information about Governance Fund grants 5.4% of the total initial token supply (231,928,234 OP) will be distributed to Optimism projects and communities via the Governance Fund.  A portion of the Governance Fund …     Please read this post and, if desired, re-structure the grant in a way that follows those guidelines. It may also be worth noting that your grants appears to be more in-line with the “builders subcommittee” category. You can see more information about the builders category here and the growth experiments category here in order to decide which is best. Feel free to let me know if you have any questions. Michael ",
                    "links": [
                        "https://foul-porch-0eb.notion.site/Optimism-Grants-Council-090bb648d1854136b9630c608da7a8bc",
                        "https://foul-porch-0eb.notion.site/Grants-Council-Internal-Procedures-504521342ee0402980321c56f1488542",
                        "https://gov.optimism.io/t/grants-proposal-template-cycle-11/5291",
                        "https://foul-porch-0eb.notion.site/Builders-Sub-Committee-02ba9da5b4534fbf955e6e4c8fcf1aa3",
                        "https://foul-porch-0eb.notion.site/Growth-Experiments-Sub-Committee-270d2f75ff0f410a869b2ba6a8324006"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 6.402777777777777
                },
                {
                    "author_link": "https://gov.optimism.io/u/Deepti_GN",
                    "index": "3",
                    "likes": "1",
                    "time": "16/03/2023-08:01:20",
                    "content": "Hi Micahel, We appreciate your suggestion regarding grants. We reevaluated the “builders subcommittee” category in light of the email below, and we’d want to lower the award amount as a result. I am unable to access the filed proposal and make modifications, though. I request for your assistance in updating this. Deepti GN Business Developer, Unmarshal 9066309163 | unmarshal.io | deepti@unmarshal.io https://calendly.com/deepti-22 | deepti_gn   ",
                    "links": [
                        "https://maps.google.com/?q=https://calendly.com/deepti-22",
                        "https://msng.link/o/?deepti_gn=tg",
                        "https://www.linkedin.com/in/deepti-g-n-666b0b93/",
                        "https://twitter.com/deeptiGN2"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/Deepti_GN",
                    "index": "4",
                    "likes": "0",
                    "time": "20/03/2023-16:08:37",
                    "content": "Hi Team, Any updates on how to reduce the grant amount and fill in under “builders subcommittee” category as I am unable to edit the grants proposal submitted. Deepti GN Business Developer, Unmarshal 9066309163 | unmarshal.io | deepti@unmarshal.io https://calendly.com/deepti-22 | deepti_gn   ",
                    "links": [
                        "https://maps.google.com/?q=https://calendly.com/deepti-22",
                        "https://msng.link/o/?deepti_gn=tg",
                        "https://www.linkedin.com/in/deepti-g-n-666b0b93/",
                        "https://twitter.com/deeptiGN2"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 2.5
                }
            ]
        }
    ],
    "group_index": "556"
}