{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/review-gf-phase-1-l2-planet-optimism-tr/3012",
            "title": "[Review] [GF: Phase 1] L2 Planet & Optimism TR ",
            "index": 3012,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Governance Fund: Phase 1"
            ],
            "tags": [
                "cycle-7",
                "cycle-8"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/arabianhorses",
                    "index": "1",
                    "likes": "7",
                    "time": "17/07/2022-20:07:26",
                    "content": "Project Name: L2 Planet & Optimism TR Author Name: @arabianhorses, @0xemre, @layer2planet I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: Yes, We understood. L2 Recipient Address: l2planet.eth Which Voting Cycle are you applying for :  Voting cycle #6 Grant category: Governance Funding Is this proposal applicable to a specific committee? Might be Tooling Committee Project description: L2 Planet is a community project run by volunteers, researchers, developers, designers, and more. The main goal is to accelerate Layer-2 adaptation and educate the community about it. We are running a biweekly L2 newsletter in both English and Turkish. We have 895 e-mail subscribers on Substack and 608 followers on Twitter(EN), 3481 followers on Twitter(TR). Also, we are building an L2 Hub to track L2 projects across all networks. We want to increase our speed on Optimism and introduce more Optimism native projects to our audiences. Since most of our team members are from Turkey, some of our content is in Turkish but we don’t see this situation as a disadvantage. Turkey has a lot of young crypto enthusiasts and some of them, unfortunately, don’t know English. We have recorded a video that explains how to run a node on Optimism and currently running OptimismTR account on Twitter, we have also published an article about Quix, started a video series for telling Turkish people ‘How to jump into Optimism Summer’, Sharing weekly holders status for $OP, these are what have we done until today. If this proposal pass we are going to increase our work’s quality by using the grant. Most of the people in the web3 space are here to make some quick profits. We are all human and seeking profit is just natural, but there is much more thing behind money. Layer2planet believes that we (as web3 lovers) can build a different perspective for the future. We must teach people how things work in web2 and web3, people even don’t know what decentralization means. They have no idea to what extent ‘big data’ can control humanity and what harm it can do. They do not understand why we need decentralization. Most people who are aware of this do not know exactly how Ethereum and the projects under its wings achieve this decentralization. With this vision, On the one hand, we are trying to tell people how to use web3 applications, and on the other hand, we are trying to explain why we should use them. Project links:   L2 Hub   Substack   Discord   Youtube   Twitter EN   Twitter TR   l2planet.lens   OptimismTR   Additional team member info: 0xInvy, Hitasyurek.eth Competitors or similar projects: Messari, Layer 3, GCR, Finematics Optimism native?: This question might be irrelevant for us because we are not an On-Chain project, and are focused on generally Layer2s however we are considering building a dapp, of course, we are going to work on Optimism when this happens. Ecosystem Value Proposition: The technical basement of Optimism can be too complex for ordinary users. We are planning to make it more understandable for everyone. When we achieve this goal more people are going to start understanding how Optimistic Rollups keep funds safe and how Optimism is different from other ORs, with this process more people will bring their funds into the ecosystem. It is the best way of natural growth. Has your project previously applied for an OP grant?: No Number of OP tokens requested: 30,000 Did the project apply for or receive OP tokens through the Foundation Partner Fund?: No Proposal for token distribution: We are going to use all OP tokens to stimulate our contributors to Optimism projects. Optimism TR account, L2 Planet accounts, and team members’ accounts will be combined for the marketing activities of all the works mentioned below. Phase 1 - Project Reviews: We will prepare detailed research reports in Turkish and English for Optimism projects each week(10 weeks total). Turkish reports will be published on Optimism TR and English on L2 Planet. 5000 amount of OP tokens will be used in this phase. After each report, 500 OP tokens will be unlocked and shared among the work contributors. All tokens in these phases will be unlocked total of 10 weeks. Phase 2 - Optimism Newsletter(Turkish): We will publish the weekly Turkish Optimistic Newsletter to convey Optimism’s latest developments and news. 20000 amount of OP tokens will be used in this phase. After each issue, 384 OP tokens will be unlocked and shared among the work contributors. All tokens in these phases will be unlocked total of 52 weeks. Phase 3 - Organizing Events: We will organize AMA and educational events with Optimism projects to introduce projects to the community. 4000 OP tokens will be used in this phase. Details of token distribution for this phase are unclear. Some of the released tokens can be used to organize events or for event contributors. Phase 4 - Creating an NFT Collection: This collection will have different characters and the theme of the design will reflect the Love of the layer2planet for Optimism. It will be free mint but going to have %10 royalties and the royalty address is going to be ‘retropgf.eth’. We are going to use 1000 OP to hire a qualified designer. We will not base the OP’s dollar equivalent. OPs will remain as OPs during this process. Has your project previously received an OP token grant? If yes, what’s the status of these tokens? Nope, but we have taken grants in GR13 and GR14. Check out the L2 Planet Gitcoin page. We have created a contribution-reward model for incentive contributors. Grant tokens are distributed according to this model. L2 Planet treasury holds and manages remaining tokens. Please provide any additional information that will facilitate accountability: We are already working for Optimism Ecosystem so our previous works can be considered as proof that we will keep our promises. ",
                    "links": [
                        "https://twitter.com/layer2planet",
                        "https://twitter.com/layer2planettr",
                        "https://l2planet.pages.dev/",
                        "https://www.youtube.com/watch?v=PkzRgth-Wzo",
                        "https://twitter.com/OptimismTR",
                        "https://medium.com/@optimismTR/i%CC%87ki-rakip-l2de-birden-%C3%A7al%C4%B1%C5%9Fan-i%CC%87kiz-platformlar-3acf4c9818f6",
                        "https://l2planet.xyz",
                        "https://layer2planet.substack.com/",
                        "https://discord.com/invite/trSb3WqzFJ",
                        "https://www.youtube.com/c/l2planet",
                        "https://twitter.com/layer2planet",
                        "https://twitter.com/layer2planettr",
                        "https://lenster.xyz/u/l2planet.lens",
                        "https://twitter.com/OptimismTR",
                        "https://twitter.com/0xInvy",
                        "https://twitter.com/hitasyurek",
                        "https://gitcoin.co/grants/4450/layer2-planet",
                        "https://layer2planet.notion.site/Katk-d-l-Modeli-3d9c89bfacbc4e5cb2531b2e3e8746a8",
                        "https://docs.google.com/spreadsheets/d/17vok0LOXuFz_tfShwVLcoHE0bF0iZ-7rC1NMD-4bsLg/edit?usp=sharing",
                        "https://etherscan.io/address/0x2d9d84f4d8a4254ea23fe18825193cbd1b21b749"
                    ],
                    "GPT-summary": "The post is a proposal for a grant from the Optimism Foundation for the L2 Planet project. The proposal explains the project's goals, current activities, and plans for using the grant. The proposal includes four phases, including project reviews, an Optimism newsletter, organizing events, and creating an NFT collection. The post also provides information about the team members and links to the project's social media accounts. The post does not receive entirely positive or negative feedback, but rather constructive criticism and questions from third parties.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Interoperability and Scaleability",
                        "Smart contract updates",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal",
                        "None"
                    ],
                    "Sentiment": 5.599056603773585
                },
                {
                    "author_link": "https://gov.optimism.io/u/haldizenli",
                    "index": "2",
                    "likes": "1",
                    "time": "18/07/2022-11:38:14",
                    "content": "Developers should be supported. My vote is yes. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/ngincrypt",
                    "index": "3",
                    "likes": "2",
                    "time": "18/07/2022-11:45:11",
                    "content": "I support this proposal because I follow Optimism TR and there is a lot of useful content published by this team. L2 Planet and OptimismTR run by volunteers. I think public goods are necessary and should be incentivized. So the volunteers will be fully motivated when they incentived and they can keep going create the useful content for people.  Also, kindly note that the Turkish crypto community are too crowded and have so many active people in Turkiye. There is can be win/win relationship between Optimism and Optimism TR. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.1190476190476195
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "4",
                    "likes": "5",
                    "time": "18/07/2022-15:14:07",
                    "content": "Thank you for the proposal. I have been though all the links you have shared here and after reading the content, I am thinking this is more suited towards RPGF.  Guideline from foundation is not clear on RPGF but here is my reasoning.  This a community driven project focused on teaching and knowledge sharing in regional language. You are already a git grant receiver which is focus on public good funding. You can show past impact of your project from e-mail subscribers and community engagement. (impact = profit) Fund distribution can be verified on-chain, which is a huge plus.  Would love to see this proposal in RPGF. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.285714285714286
                },
                {
                    "author_link": "https://gov.optimism.io/u/arabianhorses",
                    "index": "5",
                    "likes": "2",
                    "time": "18/07/2022-15:41:14",
                    "content": "thanks for the feedback, let’s keep this proposal here and see what delegates think. as we mentioned in the proposal we will keep going in anyway but if we can take this allocation things will increase another level ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/SAYIN",
                    "index": "6",
                    "likes": "1",
                    "time": "19/07/2022-14:28:12",
                    "content": "I am one of the members of the team from different branches. I am confident that this proposal will lead to positive results. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.212121212121212
                },
                {
                    "author_link": "https://gov.optimism.io/u/Bobbay_StableLab",
                    "index": "7",
                    "likes": "3",
                    "time": "24/07/2022-12:19:15",
                    "content": "It’s much different from the other proposals since this is more education-based, a key resource. However, I agree with @OPUser as this might be suited more for RPGF. With a small grants committee, it would be easy to support a project like this retroactively since we can see the impact you have had. Understandably, it is also a privilege to be paid retroactively, so I would like to hear further thoughts from the community. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.661458333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/arabianhorses",
                    "index": "8",
                    "likes": "0",
                    "time": "25/07/2022-14:12:26",
                    "content": "thanks for your feedback we are still considering withdrawing our proposal, and applying for RPGF, ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "9",
                    "likes": "1",
                    "time": "29/09/2022-02:13:28",
                    "content": "pinging, want to gauge whether there’s still interest here - if not, maybe set this to [draft] ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/0xemre",
                    "index": "10",
                    "likes": "1",
                    "time": "29/09/2022-15:06:19",
                    "content": "We still keep going on this proposal and wanna hear more feedbacks from delegates. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/arabianhorses",
                    "index": "11",
                    "likes": "0",
                    "time": "30/09/2022-21:38:43",
                    "content": "    jackanorak:  want to gauge whether there’s still interest her   you have %0.86 of the Voting Power, you might speed up the process. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "12",
                    "likes": "1",
                    "time": "30/09/2022-22:18:44",
                    "content": "Sure, dm me if you’d like to have a discussion on it ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                }
            ]
        }
    ],
    "group_index": "166"
}