{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/decentralized-sequencer-in-superchain-questions-from-espresso-systems/5474",
            "title": "Decentralized Sequencer in Superchain: Questions from Espresso Systems ",
            "index": 5474,
            "category": [],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/minsi_espresso",
                    "index": "1",
                    "likes": "2",
                    "time": "06/03/2023-23:51:12",
                    "content": "Overview Optimism’s Superchain envisions a network of chains that share security, a communication layer, and an open-source technology stack. Espresso Systems is building a decentralized, shared sequencer to support arbitrary rollups and could contribute to the architecture of this Superchain future. A shared sequencer streamlines cross-chain interoperability with (i) security (no need to worry that one chain will reorg), (ii) savings (cross-chain consensus verification is now free, allowing resources to concentrate on verifying only execution), and (iii) simplicity (reduced attack surface, less up-front cost to add a new Optimism chain). We at Espresso Systems would like to better understand Optimism’s approach to decentralized sequencing and explore how Espresso’s sequencer network can support the OP’s ecosystem.   Accordingly, we have a few questions regarding the Superchain design that we would like to discuss with the Optimism community. About the Espresso Sequencer Currently, Layer-2 rollups mainly rely on a centralized service operated by the core protocol teams for transaction sequencing. The centralization of this core function represents a security and operational risk to the L2 rollup ecosystems and misses opportunities for greater interoperability and efficiency. Espresso is working to accelerate the decentralization process of rollups by eliminating the centralized chokepoint of sequencing. To that end, we are building the Espresso Sequencer, a decentralized sequencing service for rollups with robust throughput and fast finality, secure transaction ordering, and data availability guarantees. We envision the Espresso Sequencer as a credibly neutral shared public good for both optimistic and ZK-rollups, which will not only allow rollups to decentralize, but also to benefit from the interoperability advantages of a shared sequencing layer. We will be releasing much more about how this works, our goals, and architecture soon, but happy to answer questions here in the meantime. Our Questions about Superchain:  Can an Optimism node deal with invalid transactions being passed to it from a sequencer? (The Espresso sequencers do not check for invalid transactions in the current design).** Can you share more information on what you call ‘modular sequencing’? Could an OP Chain decide they want to use an external shared sequencer(i.e Espresso’s sequencer)? Is there any information on how the Superchain bridge will work? It seems like OP nodes and Optimism fraud proofs need to deal with invalid transactions and differentiate between arbitrary and intentional differences in state between the sequencer and the L1. Is this correct, and is any of this implemented already? How are you thinking about incentive alignment within the Superchain?  **In theory, we think this should be easier with optimistic rollup than with zk rollup. Whereas in zk rollup the prover needs to prove invalidity (i.e., that a transaction throws an error) explicitly, in optimistic rollup the node can simply skip ‘invalid’ transactions when computing the state change to be posted to the L1 (i.e., Ethereum). This should have no impact on fraud proofs, which already need to handle any incorrect computation of state from a committed list of transactions, including exclusion of any valid transaction in the list or incorrect handling of invalid transactions. ",
                    "links": [
                        "https://www.espressosys.com/blog/espresso-hotshot-consensus-designed-for-rollups"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.965909090909091
                }
            ]
        }
    ],
    "group_index": "567"
}