{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/footprint-analytics-optimism-builders-grant-cycle-11/5603",
            "title": "Footprint Analytics - Optimism Builders Grant - Cycle 11 ",
            "index": 5603,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Grants Council"
            ],
            "tags": [
                "growth",
                "cycle-11"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/Lynn",
                    "index": "1",
                    "likes": "0",
                    "time": "14/03/2023-11:35:33",
                    "content": "Basic Details Project name: Footprint Analytics Author name and contact info (please provide a reliable point of contact for the project.): Lynn Tsang, Telegram: Telegram: Contact @LynnZeng01, Discord: LynnTsang#4102, Email: lynn@footprint.network L2 recipient address: 0x1f0A4eb02d9BEfBd1538E8D230699d4e434CDbEE Which Voting Cycle are you applying for?: Cycle 11 I confirm that I have read the landing pages for the Builders 29 and Growth Experiments 29 Sub-Committees and that I have determined my proposal is best suited to be reviewed by the Growth Experiments Sub-Committee: Yes Project Details What are you building?: Footprint Analytics is a data platform blending web2 and web3 data with abstractions. We help analysts, builders, and investors turn blockchain data into insights with accessible visualization tools and a powerful multi-chain API across 20+ chains for NFTs, GameFi and DeFi. We also provide Footprint Growth Analytics to help with effective growth in GameFi and any web3 projects. Why do you believe what you are building is going to succeed?: Blockchain is still a new technology. It’s fair to say that we are just beginning to understand and explore the value of the data it provides. At this early stage, being able to collect, summarize and visualize data effectively is critical. Currently, most blockchain analytics tools focus on cryptocurrency quotes and compliance analysis. Why? Up to now, several roadblocks hinder creating powerful, easy-to-use analytics platforms for blockchain.  Difficult to process data Hard to import incremental data Platforms are incomplete Lack of data applications Poor analysis experiences  Footprint makes blockchain analytics possible for anyone. Built by a team of internet serial entrepreneurs, it is a one-stop analytics platform that helps you visualize your blockchain data exploration results with an effortless, easy-to-use, and user-friendly interface. How we solve the problem we identified  Data processing: we not only provide raw on-chain data, but also structured data in specific domains such as NFT transactions, gamefi transactions, dex trades, etc. This makes on-chain data analysis simpler and reduces a lot of repetitive work. Simple data analysis tools: you can create dashboards and charts without writing code. Structured data: using cross-chain data as an example, we process data from different chains so that users can easily analyze the development of projects on different chains. Multi-chain development is a trend and cross-chain analysis is an important user need.  Is your project likely to bring new builders to the Optimism ecosystem? If so, please describe how: Yes. Brand awareness improvement: Data can show the strength and development of Optimism and attract more developers and users   With dashboards and reports, we can spread the word around about Optimism’s progress.   Footprint can provide support on media channels: Columns on several million-level media sites: Cryptoslate and CoinMarketCap. Our content could be reprinted by yahoo finance and many other media. Also other tens of social media platforms.   Is your project likely to improve the quality of developers in the Optimism ecosystem? If so, please describe how: Yes. Providing data solutions for the developers on Optimism   Help them understand project data so that they can better operate the project   Attract more developers to build.   Is your project likely to improve the commitment of developers in the Optimism ecosystem? If so, please describe how: Yes. We can provide the Optimism team with data on the ecosystem in order to monitor its development of the ecosystem.   Data on user and developer participation, number of users, activity level, etc. This is good for discovering potential projects, monitoring the condition of the ecosystem, and providing support and backing for the developers on the chain.   Comparison between the Optimism chain and other chains to understand the situation of competing chains.   Provide us with links to any of the following for the project:  Demo: / Website: https://www.footprint.network/  Twitter: https://twitter.com/Footprint_Data  Discord/Discourse/Community: Footprint Official  Github: Footprint Analytics · GitHub  Technical/Economic Documentation: Get started  Other: /  Do you have any metrics on the project currently? (TVL, transactions, volume, unique addresses, etc. Optimism metrics preferred; please link to public sources such as Dune Analytics, etc.): Footprint metrics: We have almost 8000 members in our discord and 20,000 followers in our Twitter Data coverage: https://www.footprint.network/@Footprint/Footprint-Data-Overview Who are your competitors?: Dune Analytics What differentiates you from your competitors?:  On the surface: easy to use and free to customize  no-coding for normal analysts drag and drop Ten-of-thousands dashboards built by the community - collective intelligence   Under the hook:  abstraction, domain logic  labeling transaction: swap, LP, lending, buying NFT, interest, deposit into a gamefi，…, normal transfer   Multiple domains   Powerful  SQL analyst/operation API for developers/product   Web 2 and web 3 data connector  Off-chain data, such as VC investment data and social data   If you compare Footprint to other data analytics products:  If we can use preparing a meal  Dune is like every time you go back to the farm, to pick your raw materials, and go through the whole food preparation processing to cook your dishes Nansen is like giving you a set manual, a fixed combination of dishes Footprint is more like buffet, you can ala carte, with an open farm and kitchen      Will your project be composable with other projects on Optimism? If so, please explain: Yes. We can decode all the project data on Optimism, and all the projects can use Footprint data to analyze and build their dapps. Team Who are your founders?: ● Tony: https://www.linkedin.com/in/tzhang88/ What makes your founders well-positioned to accomplish your goals with this project (1-2 sentences on each)?: Tony is heading up the enterprise products and sales. Tony has worked in investment banks, including Goldman Sachs, Bank of America and Merrill Lynch. As the head of Global Credit Market Trading Technologies at BoA and Merrill Lynch, Tony was instrumental in credit derivatives quantitative modeling for pricing and risk management, and real-time pricing architecture for over 300,000 corporate bonds and CDS. He has worked with a wide range of 3rd party enterprise vendors closely, selecting and picking the best of breed of technology and piecing their offersing together, including price feeds, modeling analytics, rating agencies, reference data, cloud platforms. Prior to that, Tony was wearing a different hat as a co-founder of FinPortfolio for 3 years, a startup that offers portfolio analysis tools to banks and asset managers with the B2B2C model. Tell us about the rest of your team (if there are more teammates): When it comes to how I got into this business, I have to tell you how I joined the team and formed the current team together. Together with my two co-founders, I am in my 11th year of working together. I have been with the team since my first year as a graduate intern. In these 10+ years, our team has done e-commerce applications with 10 million users, and fintech applications including trading/risk management/credit models. Most of these projects, which made it to the top of the industry, could not continue to scale up due to some industry policies. Interestingly, even after changing many different projects, our core team has been able to keep learning and keep moving forward together. In 17 years, our team started to contact blockchain and was one of the early miners. 18~19 years we tried to apply our experience in quantitative trading to blockchain and did some quantitative trading in CeFi for a while, and in 20 years I led the team to develop a few Dapps. so our team has actually been following the blockchain track and trying some projects. 21 years the team went through a few intense After some heated discussions, we decided to find a track that was worth investing in for 10 years. Since our team had rich project experience in web2 data and models as well as web3 in the previous years, we made a combination of these experiences in web2 and web3 and started from the web3 data track, which was the origin of Footprint. Is this your first Web3 project?: No If not, what else have you built? (Share links, Github repository, or any other useful information.): https://www.bigwin.finance/ I understand that Builders grants are subject to a 1 year lock-up, as explained further in this post 3: [Yes/No]: Yes Is your project funded? If so, provide an estimate of how many months of funding runway your project has: Footprint has closed a $4.15 million Seed round led by Matrix Partners and IOSG joined by Redpoint, A&T Capital, Hash Global, Waterdrip Capital, Lancer Capital, NGC, Arkstream, Youbi, SevenX Ventures, Puzzle, and other partners. And now we open a new round of funding. Grant Request What is the size of the grant request? (250k OP max): $50k-100k How do you justify the size of the grant?: Mainly by judging the cost of technology development investment Roadmap Describe in discrete steps your plan for accomplishing your project: 2022 - Footprint as a Service - Help GameFi & NFT developers and guilds make better decisions based on key operational metrics for players, investors, tokens and financial performance. 2023 - Footprint as a Platform - Realize Footprint’s value with vertical solutions for marketing and user growth. Grow the Footprint community to build better applications across Web2 & Web3. 2024 - Footprint as an Ecosystem - Build an app marketplace and data marketplace with the power of the community. Give back the value of the Footprint ecosystem to creators in the Footprint community. Provide an incentive system to reward analysts/KOLs for their indeed analysis. 2025 - Footprint as a Decentralized Data Platform - Build a decentralized data service network and a data exchange protocol for greater privacy protection and more data-driven innovations. Please provide any additional information that will facilitate accountability:(smart contracts addresses relevant to the proposal, relevant organizational wallet addresses, etc.) I think we don’t have any Does your plan depend on the receipt of OP tokens?: No What is your plan for the use of the OP token after the 1 year lock-up?: We are planning to use them as Hackathon bouns or Analytics Bounty for the Optimism chain. Please provide benchmark milestones for this project. These milestones should guide the Optimism community on the progress of your project during the 1-year lock-up period.     Milestone Deliverables Timeline Risks     1- Adoption - Optimism chain NFT data on Footprint Optimism chain NFT overview dashboard & structured table 1 month    2- Adoption - Optimism chain marketplace domain data in Footprint Optimism chain Marketplace overview dashboard & structured table 1 month    3 - Adoption - Optimism chain GameFi data on Footprint Optimism chain GameFi overview dashboard & structured table 1 month    4 - Adoption All the data are available on Data API 1 month    5 - Maintenance Resolving issues and fixing bugs 6-month Contracts are missed, need Optimism team to help contact developers   6 - Hackathon Event Co-organize an online hackathon to attract analysts, developers contribute to Optimism 1 month     Please define critical milestones for this project. Critical milestones are meant to show good-faith efforts to accomplish the project. Non-completion of these milestones could lead to revocation of remaining grant rewards. I think each milestone above are very important. Optimism Relationship Does your project solve a problem for the Optimism ecosystem?: Yes How does your proposal offer a value proposition for solving the above problem?: Our data coverage is much broader (24 chains). We provide domain-specific structured data, like NFT, and GameFi. And Dune, which provides mostly raw data, which has a high threshold for business understanding. Our product has a lower user barrier, users don’t need to write SQL. This allows us to have a larger user base and serve more users. We provide API services to our users, which will help us generate more revenue. We have a more powerful technical architecture with 10 times the performance of competitors. Why will this solution be a source of growth for the Optimism ecosystem?: We will provide more data for the Optimism ecosystem. We will hold Hackathons to attract developers and community users. We have exposure to millions of media partnerships. How committed are you (and your team) to building on Optimism?: It is hard to understand the question. Shall we have a call to talk about it? Is your project Optimism Native?: No Confirmations I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: [Yes/No]: Yes I understand that I will be expected to following the public grant reporting requirements outlined here: [Yes/No]: Yes ",
                    "links": [
                        "https://foul-porch-0eb.notion.site/Builders-Sub-Committee-02ba9da5b4534fbf955e6e4c8fcf1aa3",
                        "https://foul-porch-0eb.notion.site/Growth-Experiments-Sub-Committee-270d2f75ff0f410a869b2ba6a8324006",
                        "https://cryptoslate.com/author/footprint-analytics/",
                        "https://coinmarketcap.com/alexandria/author/footprint-analytics",
                        "https://www.footprint.network/",
                        "https://twitter.com/Footprint_Data",
                        "https://discord.gg/3HYaR6USM7",
                        "https://github.com/footprintanalytics",
                        "https://docs.footprint.network/docs",
                        "https://www.footprint.network/@Footprint/Footprint-Data-Overview",
                        "https://www.linkedin.com/in/tzhang88/",
                        "https://www.bigwin.finance/",
                        "https://gov.optimism.io/t/suggested-public-reporting-requirements-for-grantees/4176"
                    ],
                    "GPT-summary": "The post is a proposal for a grant for a data platform called Footprint Analytics. The author explains the project, its goals, and how it will benefit the Optimism ecosystem. The post also includes metrics, a roadmap, and critical milestones. A 3rd party gives entirely positive feedback on the proposal, extending to the proposal, and advertising it. There are no negative feedback or constructive criticism, and no collaboration or auditing/reviewing of the proposal.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Interoperability and Scaleability",
                        "Privacy, Security and risk management",
                        "Community and engagement",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.541848104614062
                },
                {
                    "author_link": "https://gov.optimism.io/u/FractalVisions",
                    "index": "2",
                    "likes": "0",
                    "time": "14/03/2023-14:46:55",
                    "content": "    Lynn:  Is your project Optimism Native?: No   When exactly does this project plan on deployment on the Optimism network? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/Lynn",
                    "index": "3",
                    "likes": "0",
                    "time": "15/03/2023-01:49:44",
                    "content": "Thanks for asking this good question. We are a platform for on-chain data analysis and services, and our underlying technical architecture is based on a big data system. So we are not Optimism native. As a data analysis tool, we currently support 24 blockchain networks, including Optimism, Ethereum, and other EVM-compatible chains. We also offer coverage for some non-EVM-compatible networks, such as Solana, providing users with the ability to analyze their data and make more informed decisions. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party is advertising proposal",
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.796875
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "4",
                    "likes": "1",
                    "time": "18/03/2023-00:41:14",
                    "content": "Hey @Lynn , giving you a heads up that this will be the formal comms channel with the grant council builders subcommittee, which consists of @jackanorak @kaereste @danelund.eth, and myself. We’ll make sure we’re around to address any questions you have in this process. A few things to verify:     Lynn:  What is the size of the grant request? (250k OP max): $50k-100k   Max Builders grant size it’s 50k OP tokens. These are governance tokens the project can’t sell but only distribute after the 1 year lock period. Benchmark and Critical milestones have different concepts. Benchmark are things the project aspire to accomplish like “having 100 developers on a hackathon”. They don’t need to be accomplished to get the grant, but it shows progress towards the project objective. Critical milestones are mandatory, they need to be trackable (date), have a source of truth, and should be accomplished to unlock OP tokens. All your “Adoption” milestones look critical.     Lynn:  How committed are you (and your team) to building on Optimism?: It is hard to understand the question. Shall we have a call to talk about it?   From your proposal, you plan to be here until 2025 so that’s a long-term commitment. You don’t need these funds and you are deploying all this even if you don’t get the grant, which shows non-mercenary commitment. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.1856060606060606
                },
                {
                    "author_link": "https://gov.optimism.io/u/Lynn",
                    "index": "5",
                    "likes": "1",
                    "time": "20/03/2023-11:16:50",
                    "content": "Hey Gonna.eth, thanks for your reply. I revised the answers to these questions based on your suggestions.  Looking forward to the next step. What is the size of the grant request? (250k OP max): 50k OP tokens Please provide benchmark milestones for this project. These milestones should guide the Optimism community on the progress of your project during the 1-year lock-up period.  Bringing 50+ dashboards on Optimism ecosystem or projects Bringing 100 developers on Hackathon event  Please define critical milestones for this project. Critical milestones are meant to show good-faith efforts to accomplish the project. Non-completion of these milestones could lead to revocation of remaining grant rewards.     Milestone Deliverables Timeline Risks     Adoption - Optimism chain GameFi data on Footprint Optimism chain GameFi overview dashboard & structured table 1 month    API Adoption - Optimism chain GameFi data on Data API All the GameFi data are available on Data API 2 weeks    Adoption - Optimism chain NFT data on Footprint Optimism chain NFT overview dashboard & structured table 1 month    API Adoption - Optimism chain NFT data on Data API All the NFT data are available on Data API 2 weeks    Adoption - Optimism chain NFT Marketplace data in Footprint Optimism chain NFT Marketplace overview dashboard & structured table 1 month    API Adoption - Optimism chain NFT Marketplace on Data API All the NFT Marketplace data are available on Data API 2 weeks    Maintenance Resolving issues and fixing bugs 6-month Contracts are missed, need Optimism team to help contact developers   Hackathon Event Co-organize an online hackathon to attract analysts, developers contribute to Optimism 1 month     How committed are you (and your team) to building on Optimism?: Footprint as a data infra aims to provide accessible visualization tools and a powerful multi-chain API across 20+ chains for NFTs, GameFi and DeFi. We believe that Optimism is an essential layer 2 solution for builders. We have indexed Optimism and we shall use the grant to build abstraction layers and data API for GameFi/NFT domains. With the leverage of data platform, anyone can build projects or tools helping with the growth of the ecosystem. The commitment period of cooperation shall be 24 months, subject to the progress and result of the partnership, which shall be renewable upon mutual agreement. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party advertising proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.867424242424242
                }
            ]
        }
    ],
    "group_index": "608"
}