{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/are-competitions-better/4318",
            "title": "Are Competitions Better? ",
            "index": 4318,
            "category": [
                "\\xf0\\x9f\\x8f\\x9b Governance",
                "Grants"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/Michael",
                    "index": "1",
                    "likes": "13",
                    "time": "15/12/2022-00:30:21",
                    "content": "Last season as a community we had a realization that the grants we’ve been distributing from the community governance fund have had somewhat disappointing results in terms of user stickiness and TVL. The goal of this thread is to examine why this is and how we can improve on this for next season. Specifically, thinking about competitions as a better use of grant funds. Background: Starting from first principles, why are we even spending this $OP on grants on the first place? The whole point of anything we do at this stage in Optimism’s growth is to push us closer to the Optimistic Vision and it’s flywheel.  Just as a reminder, the optimism flywheel looks something like this:  Make the Optimism network a valuable place for users to transact Create sequencer revenue from those transactions Apply this sequencer revenue back towards [a] in the form of RPGF   It’s important to know that the value generated in [b] is directly tied to the value that users are getting from their transactions which inherently comes from the value Optimism itself provides. In math form that looks like this:  Sequencer Revenue = Value of Transactions to Users = f(value of optimism network)  Grants: Luckily we have a tool to accelerate this flywheel in the form of the grants fund. In an ideal world the makes our flywheel look like this:   But so far, the majority of grants have gone towards liquidity incentives on DeFi protocols. How do these juicy yields affect the flywheel? The good:  Brand new users may come for the yield but stay because of the ecosystem Fledgling protocols can get their first initial bumps of users and liquidity to become viable on their own  The bad:  As we saw in the analytics, the majority of these grants are really just transfer payments from the OP Foundation to users  While there’s nothing wrong with free money, these kind of incentives are not actually accomplishing our goal of getting the flywheel going. In fact, liquidity incentives are creating a short-circuit in the flywheel by directly giving value to users [b] without boosting the value of Optimism itself [a].  And our equation for B becomes:  Sequencer Revenue = Value of Transactions to User = f(value of optimism network, value of liquidity incentives to users)  Yes, the value of transactions to users does go up in the short term but this value isn’t coming from the ecosystem itself and will dry up as soon as the incentives do. This appears to be exactly how the results are playing out in the data. So what can we do?  I believe that part of course correcting is to shift grant focus to make SURE that we are target [a], the value of the optimism network, directly with grant funds. One effective way that I believe we can do that is competitions. Competitions have long been used as a way to leverage dollars to encourage innovation in a space. They are especially useful when the answer to the problem is not known. Can you predict what the most popular app on Optimism will be 3 years from now? We might have some ideas, but as of now we really don’t know what the killer app of the future will be. Well-crafted competitions allow us to move closer to the killer apps of the future as well as increase the utility and usage of the apps we currently have on Optimism. Examples of competitions to draw from:  DARPA (autonomous cars, robotics challenge, launch challenge) X-Prize Foundation ETHGlobal Hackathons  Value Just to add in a little bit of perspective as far as bang-for-the-buck goes, OP Season 2 was capped off with a $4million OP grant to Velodrome for liquidity incentives (not mad about this, Velodrome and their team is great).  EthGlobal had a recent hackathon in Bogota with a total prize pool of ~$500k USD which included all prizes contributed by technology sponsors. That hackathon brought together 900 hackers and 212 project submissions. With the funds from that one liquidity incentive grant, we could have funded 10 massive hackathons. By scaling back the prize pool to $100k, we could have used those funds to run 50 individual hackathons. That’s one hackathon with a juicy $100K prize pool for every single weekend of an entire year. Extrapolating numbers, that could have brought 9,000 developers and 2,000+ new projects to Optimism. Other Competitions Competitions don’t have to be just hackathons either. Here are some ideas for the many types of competitions that Optimism could run in order to make the ecosystem more valuable:   Hackathons  Public goods ZK-dapps Bedrock Hacks DeFi Tooling NFT    Social/awareness  Most viral optimism-themed TikTok Meme competitions Best Optimism Rap competition    Business Dev  Business plan competition “Build a business” competition  Cross between hackathon & incubator   Interactive NFT competition    Education/onboarding  Best educational “what is optimism” video Best Optimism coding tutorial Best “getting started with optimism” tutorial    All of these competitions can be directly tailored to directly increase the value of the optimism ecosystem for the long term, accelerating our flywheel and moving us closer to the optimistic vision. Conclusion While the OP Foundation might host their own competitions, I think the option should be open for community members or community governance to run it’s own. The design space is really large for these, and funding multiple attempts might be a good idea until we find what is most effective.  If you made it this far, thank you for taking the time to read. I’ll leave you with a few open questions that might be useful topics of discussion:  How would a community-run competition work? Could anyone apply to create and host a competition? Would these organizers be compensated for their work? How do we prevent the gaming of the system (i.e. hosting a sham competition and pocketing the prizes)? What kinds of competitions would you most like to see?  Stay Optimistic, -Michael   ",
                    "links": [
                        "https://www.xprize.org/past-prizes",
                        "https://ethglobal.com/",
                        "https://gov.optimism.io/t/11th-op-community-governance-call-december-20th-at-10am-pt-1pm-et-7pm-cet/4317/2",
                        "https://gov.optimism.io/t/grant-council-reviewer-nominations/4372/12"
                    ],
                    "GPT-summary": "The author of the post is proposing a shift in grant focus towards competitions to increase the value of the Optimism network. The post explains the current issue with liquidity incentives and how competitions can be an effective way to encourage innovation and increase the utility and usage of apps on Optimism. The post also provides examples of competitions and their potential impact. The author invites discussion on the topic and raises questions about community-run competitions.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Smart contract updates",
                        "Token economics",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 6.154405553795797
                },
                {
                    "author_link": "https://gov.optimism.io/u/jrocki.eth",
                    "index": "2",
                    "likes": "7",
                    "time": "15/12/2022-01:21:27",
                    "content": "[quote=“Michael, post:1, topic:4318”]   Hackathons   Social/awareness   Business Dev   Education/onboarding   I think this is a really great idea! Competitions especially within the educational category would increase the quantity and more importantly the quality of the Optimism related content out there. Which I believe fills quite a large gap. The network is growing so fast with so many new products being developed, the educational content to go along with those products tends to lag. My suggestion would be to start small and iterate. Maybe start with a trusted sub-set of OP community members to run these competitions. I think a great place to start would be with Optimism Ambassadors maybe? They are out there and plugged in so know what competitions may be of the most value and can really get the word out. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.500202922077922
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "3",
                    "likes": "8",
                    "time": "15/12/2022-02:50:32",
                    "content": "I think the Optimism Foundation knows this is the next step, which is why part of the future council has 3 members dedicated to approving developer events like hackathons. Quote from:    [Special Voting Cycle #9a]: Grants Council 🏛 Governance       As outlined in Guide to Season 3: Course Correcting, the current Governance Fund grants process faces significant challenges. Luckily, there is a lot of room for optimization. Some goals for Season 3 include:   creating a more streamlined and consistent process for proposers setting a pace for grant distributions defining a clear scope, with clear differentiation from Partner Fund creating accountability via smaller grant sizes and milestone-based distributions reducing the workload on delegates…       Builders Sub-Committee:  Goal: maximize the number of developers building on Optimism Non-goal: retroactive funding Possible RPFs: prospective builder grants for new projects, hackathons, technical content Format: proposers receive grants, suggested to be <50k OP, which are locked for a period of 1-year. If access to upfront capital is a blocker for applicants, Optimism may put them in touch with alternative resources to support teams in this position. Budget: 850k OP / Season Reviewers: 3 (see below) Consensus: 2/3 vote required to fund a grant        Michael:  How would a community-run competition work?   There are already plenty of DAOs and developer organizations we should reach out to. For example, Secureum makes a developer race every month:   Ventral Digital    RACE #12 of the Secureum Bootcamp Epoch∞ • Ventral Digital This is a Write-Up of RACE-12, Quiz of the Secureum Bootcamp for Ethereum Smart Contract Auditors. I once again had the honor of designing it and gave my best to find something that is both challenging and interesting.      This is already happening we just have to incentivize moving it to Optimism.     Michael:  Could anyone apply to create and host a competition?   Yes but I think either the competition should be ready so we can verify how it works, or the hosts already have some background in doing this kind of thing.     Michael:  Would these organizers be compensated for their work?   This one it’s tricky because they are promoting their own brand with OP prices so this is mostly a win-win situation without payment. If they charge for any other service then $OP prices are good marketing for their brand and they attract more clients. If the host it’s a nonprofit living on donations then this is the same case, OP used as prices will create marketing enough to bring in more donations. I think this will have to be examined on each proposal.     Michael:  How do we prevent the gaming of the system (i.e. hosting a sham competition and pocketing the prizes)?   Clear rules from the beginning Well-known organizations with hackathon history can have bigger prices but they should apply full transparency New hosts can have an OP request limit for their first event and earn trust step by step All hosts would post a thread for accountability like grants approved from season 2     Michael:  What kinds of competitions would you most like to see?    I would love to see EIP implementations tryouts. Like grab EIP 4844 and see who can implement it better in a given time. This could save some time from real EIP teams and even bring some new ideas to them. EVM gas optimization (Gas Golfer) like https://optimizor.club/  A Zachtronics | TIS-100 made with solidity language The IAmTheOptimzer NFT it’s another great example: https://twitter.com/NoahCitron/status/1580359718341484544  Compilation of challenges to solve: https://www.damnvulnerabledefi.xyz/ or https://ethernaut.openzeppelin.com/   good times are ahead! ",
                    "links": [
                        "https://gov.optimism.io/t/guide-to-season-3-course-correcting/3942",
                        "https://ventral.digital/posts/2022/12/6/race-12-of-the-secureum-bootcamp-epoch",
                        "https://ventral.digital/posts/2022/12/6/race-12-of-the-secureum-bootcamp-epoch",
                        "https://optimizor.club/",
                        "https://www.zachtronics.com/tis-100/",
                        "https://twitter.com/NoahCitron/status/1580359718341484544",
                        "https://www.damnvulnerabledefi.xyz/",
                        "https://ethernaut.openzeppelin.com/"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 6.3043169793169795
                },
                {
                    "author_link": "https://gov.optimism.io/u/Michael",
                    "index": "4",
                    "likes": "5",
                    "time": "16/12/2022-21:43:08",
                    "content": "    jrocki.eth:  Maybe start with a trusted sub-set of OP community members to run these competitions.   Not a bad idea! Theoretically trusted community members would be more likely to have a grant request approved so maybe this is baked into the system a little bit already. The other thing we could do is set things up to be milestone-based. We can only distribute the $OP needed to run the competition and let the grants council distribute the prizes. I think one step would be to encourage anyone that want’s to put on a competition to do it once we have an idea of what that looks like. The OP Ambassadors might be a great place to start for this. I also totally agree, the new apps/protocols are growing much faster than the educational content! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.864109848484849
                },
                {
                    "author_link": "https://gov.optimism.io/u/Michael",
                    "index": "5",
                    "likes": "7",
                    "time": "16/12/2022-21:53:41",
                    "content": "    Gonna.eth:  This one it’s tricky because they are promoting their own brand with OP prices so this is mostly a win-win situation without payment. If they charge for any other service then $OP prices are good marketing for their brand and they attract more clients. If the host it’s a nonprofit living on donations then this is the same case, OP used as prices will create marketing enough to bring in more donations. I think this will have to be examined on each proposal.   It’s interesting, in my mind when I was making this post I was picture community members that wanted to randomly organize a competition (for example some community member decides to set up the rules, infrastructure, and marketing for a “best OP memes” competition) rather than companies/protocols that wanted to do a competition directly with their tech. I actually think both are interesting but you’re right, it does come down to evaluating case-by-case.     Gonna.eth:   I would love to see EIP implementations tryouts. Like grab EIP 4844 and see who can implement it better in a given time. This could save some time from real EIP teams and even bring some new ideas to them. EVM gas optimization (Gas Golfer) like https://optimizor.club/  A Zachtronics | TIS-100 made with solidity language The IAmTheOptimzer NFT it’s another great example: https://twitter.com/NoahCitron/status/1580359718341484544  Compilation of challenges to solve: https://www.damnvulnerabledefi.xyz/ or https://ethernaut.openzeppelin.com/     I love seeing these ideas because they are some things that I never would have even thought of in the first place. The IAmTheOptimizer one seems really cool. I think one goal for next season would be to try and get a lot of these going but with smaller budgets of OP. It would let us experiment with what works and then the following season we could repeat the successful ones but at a bigger scale. ",
                    "links": [
                        "https://www.zachtronics.com/tis-100/",
                        "https://twitter.com/NoahCitron/status/1580359718341484544",
                        "https://www.damnvulnerabledefi.xyz/",
                        "https://ethernaut.openzeppelin.com/"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.319914708307566
                }
            ]
        }
    ],
    "group_index": "382"
}