{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/recap-community-call-5-september-27th/3572",
            "title": "Recap: Community Call #5 (September 27th) ",
            "index": 3572,
            "category": [
                "\\xf0\\x9f\\x93\\xa2 Updates and Announcements",
                "Community Calls"
            ],
            "tags": [
                "season-2"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/Michael",
                    "index": "1",
                    "likes": "12",
                    "time": "28/09/2022-16:27:41",
                    "content": "Great and productive call this week as usual! A recording of the meeting can be found here, and the recap is below: Messari put out a great post on OP governance here. On new Optimism Governance Docs:  Adding a flow chart might be a good idea. What are some examples of flow charts / guides in other governance communities?   On confusion about which proposals are eligble for review by delegates:  We will have a Voting Round 7 Review Roundup thread where proposals will need to be posted at the end of the review week.  On accountability for Season 1 grants that have not yet been deployed:  We want some kind of accountability/pressure coming from the community! One future option is an accountability committee, but this would need some more discussion/thought. Non-recommendation based committees are a great topic for season 2 reflection period Traver from Messari mentioned that they in the early stages of an on-chain accountability system for grants For now, a public thread tracking these things and applying some friendly community pressure may be the best route To do: Make post on this topic.  On delegate approvals for projects:  Approvals are not necessarily an endorsement We want to keep the overhead low for these, so a simple “I approve” is good enough, no reasoning necessary  On proposals not getting enough early feedback (this took up the bulk of the discussion):  Resolutions and continued discussion can be found on this thread: Update to Committee Operations  @Gonna.eth suggested flipping the delegate approval and feedback phases so that delegate approval would be the last step Proposers should know which committee will be reviewing their proposal at the feedback phase to prevent them from implementing unrelated feedback and then still getting rejected  Committee proposal assignments happen only a few days before the proposals goes to snapshot which made it difficult to run a feedback process. It would be useful to have more clarity earlier on assignments. - @linda  This should happen on this first Thursday of delegate review week, 10 days before assignments are due and 7 days before snapshot. It may not have happened this round but should for the next one. -@lavande  Proposals submitters should have a clear understanding that this is a rolling process, and all is not lost if they don’t get their proposal through in a specific voting round. The stakes are actually quite high and it takes a lot for a vote to go against a committees recommendation. - @jackanorak  Important for committees to raise concerns in the feedback stage of the process. - @alexcutlerdoteth  While we may not need hard guidelines to start, committees should be generally encouraged to actively participate in the feedback phase of proposals they will eventually review Should committee recommendations be due at the start of snapshot, or three days after like it is now?  On the topic of guidance on funding development through a proposal:  Stay tuned, this is being worked on by the foundation! - @ben-chain   Still looking for a host for next community call! Feel free to put your name on the sheet here. Let’s meet up at Devcon! Coordination on this thread: Devcon Community Governance Meetup! Thanks for tuning in everyone! As always, if I missed anything or if you have any feedback for the ways the calls are run, please let me know! Stay Optimistic   ",
                    "links": [
                        "https://messari.io/report/state-of-optimism-governance",
                        "https://community.optimism.io/docs/governance/",
                        "https://gov.optimism.io/t/update-to-committee-operations/3571",
                        "https://docs.google.com/spreadsheets/d/1-r1X2gNtP4UqbnJ9ELlHf0lVHeXdXUy5_JMAxP9lERs/edit?usp=sharing",
                        "https://gov.optimism.io/t/devcon-community-governance-meetup/3573",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/10"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.746288684719536
                }
            ]
        }
    ],
    "group_index": "275"
}