{
    "poll_list": [
        {
            "id": "0xc8d4c55645e133bb66f480f4f1a17307f73aedd99b0d64f796f4749ce355d7a5",
            "title": "Season 2: Cycle 8: Overnight",
            "discussion": "https://gov.optimism.io/t/review-gf-phase-1-proposal-overnight-fi-v2/3772/",
            "body": "This Governance Fund Phase 1 proposal is eligible for voting in Cycle 8. This is the last Voting Cycle of Season 2. \n\nThis proposal was reviewed by [DeFi Committee C.](https://gov.optimism.io/t/defi-committee-c-season-2-recommendations/3437/15?u=lavande) You can find committee recommendations below:\n[DeFi Committee C Recommendations](https://gov.optimism.io/t/defi-committee-c-season-2-recommendations/3437/15?u=lavande)\n\nShadow DeFi Committee B is not an official committee but posts their own recommendations here: [https://gov.optimism.io/t/defi-shadow-committee-season-2-recommendations/3549/11](https://gov.optimism.io/t/defi-shadow-committee-season-2-recommendations/3549/11)\n    \n By approving committees, the Token House entered a social contract to entrust and delegate the bulk of decision-making to official committees. However, delegates may vote against the recommendation of official committees but should provide a justification to the community as to why they voted differently.",
            "choices": [
                "For",
                "Against",
                "Abstain"
            ],
            "scores": [
                15318215.501050493,
                96777.1194534307,
                45821.42738496934
            ],
            "start": 1667513545,
            "end": 1668111145,
            "snapshot": "30456637",
            "state": "closed",
            "author": "0x83E54889754e737Fb3CdF07BAaCC0eB9699B6Bdd",
            "space": {
                "id": "opcollective.eth",
                "name": "Optimism Collective"
            }
        },
        {
            "id": "0xeabcaf98f6cc84a8b3a244d66c44823149712569432877bb89c0b66c5bd00b39",
            "title": "Season 2: Cycle 7: Overnight.fi ",
            "discussion": "https://gov.optimism.io/t/review-gf-phase-1-proposal-overnight-fi/3536",
            "body": "This Governance Fund Phase 1 proposal is eligible for voting in Cycle 7. \n\nThis proposal is was reviewed by [DeFi Committee C](https://gov.optimism.io/t/defi-committee-c-season-2-recommendations/3437/7). You can find committee recommendations below:\n\n[DeFi Committee C recommendations]([https://gov.optimism.io/t/defi-committee-c-season-2-recommendations/3437/6](https://gov.optimism.io/t/defi-committee-c-season-2-recommendations/3437/6))\n\nShadow DeFi Committee B is not an official committee but has posted their own recommendations here: [https://gov.optimism.io/t/defi-shadow-committee-season-2-recommendations/3549/11](https://gov.optimism.io/t/defi-shadow-committee-season-2-recommendations/3549/11)\n\nBy approving committees, the Token House entered a social contract to entrust and delegate the bulk of decision-making to official committees. However, delegates may vote against the recommendation of official committees but should provide a justification to the community as to why they voted differently.\n\n",
            "choices": [
                "For",
                "Against",
                "Abstain"
            ],
            "scores": [
                2277676.574127183,
                8641760.078760602,
                151165.01960446758
            ],
            "start": 1665691587,
            "end": 1666292787,
            "snapshot": "29190970",
            "state": "closed",
            "author": "0x47C88bb92B409fF25F6587EA611fac4e55f76007",
            "space": {
                "id": "opcollective.eth",
                "name": "Optimism Collective"
            }
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/review-gf-phase-1-proposal-overnight-fi/3536",
            "title": "[REVIEW] [GF: Phase 1 Proposal] Overnight.fi ",
            "index": 3536,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Governance Fund: Phase 1"
            ],
            "tags": [
                "cycle-7",
                "not-passed"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/_Max_plus",
                    "index": "1",
                    "likes": "4",
                    "time": "23/09/2022-09:31:35",
                    "content": "This is the GF Phase 1 Proposal from the Overnight.fi Protocol. The goal is to help push the adoption of Overnight.fi innovative product line (yield generating stablecoin USD+ and delta-neutral ETS strategies) on the Optimism network. Project name: Overnight.fi Author name and contact info: Maxim Ermilov @wmermus, can be contacted through Telegram I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: Yes L2 recipient address: 0xe497285e466227F4E8648209E34B465dAA1F90a0 Grant category: Governance Fund Phase 1 Is this proposal applicable to a specific committee? [y/n, link to committee] Yes, DeFi Committee Project description (please explain how your project works): Overnight.fi is the company behind stablecoin USD+. USD+ is USDC that pays you yield via daily rebase. It is 100% collaterized with high-quality stables (USDC, BUSD, USDT, DAI etc.) that are invested onchain into lowest risk no IL stable-to-stable strategies. The yield from farming is passed over to USD+ holders via rebase. The superpower of USD+ is its ability to pay yield in liquidity pools, thus maximizing capital efficiency of LP provision. Core usecases:  Treasury management Liquidity provision on Dexes (e.g. currently USDC/USD+ on Velodrome) Maximizing yield on projects’ own liquidity on DEXes (e.g. Sphere, OtterClam, Tetu, Parrotly, MDB etc paired against USD+ to receive yield from liquidity they maintain at DEXes)  In addition to USD+, Overnight is offering ETS (“exchange traded strategies” product line). ETS is a quasi-stable (some call it ‘delta-neutral’ strategy packaged inside a rebase token) that accepts USD+, uses it as collateral to borrow (hedge) a crypto asset on AAVE (or Granary), then farms crypto-to-stable pool. Currently, on OP there is already ETS ETH/USDC via Velodrome/AAVE and ETS OP/USDC via Velodrome/Granary in process of release. Overnight intends to make Optimism its ‘innovation hub’, i.e. the chain where all new products/approaches are developed, tried and launched ahead of other chains. The pipeline includes:  ‘Self-bribing’ LP on Velodrome: USD+ yield from Velodrome LP pools automatically directed towards bribes on Velo Insurance: Users will be able to exchange risky asset, e.g. a Velodrome LP of two risky stables, for a combination of insured and uninsured tokens (tranches), with insured - redeemable for USD+ and uninsured - for OVN, Overnight’s governance token yet to be released -Additional ‘+’ products: DAI+, Eur+ (once agEur available on Aave), but also experimenting with BTC+ and a few others Additional ETS, in particular, OP-to-stable ETSes as OP borrowing limits increase on Granary and appear on Aave  Project links:  Website: Overnight.fi   Twitter: Overnight_fi  Discord Community: Discord   Additional team member info (please link): Telegram: @wmermus LinkedIn: https://www.linkedin.com/in/maxim-ermilov/ Please link to any previous projects the team has meaningfully contributed to: N/A Relevant usage metrics (TVL, transactions, volume, unique addresses, etc. Optimism metrics preferred; please link to public sources such as Dune Analytics, etc.): Overnight went into open beta around May 1st, 2022 and, despite the timing coinciding with the UST crash, has been having great momentum, largely helped by increased risk aversion:  TVL has exceeded 5.5 M USD, x11 growth since UST crash in May (USD+ finalized closed beta and launched open beta on May 1st) number of users has exceeded 2,8K, i.e. x6 growth since May USD+ daily trading volumes have fluctuated in the range of 0.5-1M per day depending on market volatility, on average exceeding 14.5% of TVL, putting USD+ b/w BUSD and USDC on this metric, far ahead of most CDP stablecoins  The growth has been driven by:  Partnerships with Dexes, in particular, Dystopia/Penrose and Cone/Unknown, Velodrome Partnerships with other projects that chose to establish trading pairs with USD+: Lido (stMatic), Sphere, Tetu, OtterClam, MDB, Parrotly Finance etc. Launch of highly attractive (and profitable) product - ETS, a quasi-stable high-yield strategy product on top of USD+/wMatic and USD+/wBNB pools (with hedged crypto price-risk) Expansion to BSC and Optimism chains  Overnight entered Optimism about 2.5 weeks ago with the launch of USDC/USD+ pool on Velodrome. Since then TVL has exceeded 1.5M with 133 users. Total ‘bribing’ amount has been just 7K USD+, of which 4K from came from ‘self-bribing’ described above. Is/will this project be open sourced? Yes, however, we intend the keep portfolio rebalancing algorithms behind ETS closed until at least public sale of OVN governance token Optimism native?: Overnight looks to make OP its innovation hub, i.e. develop all its new innovative products and approaches first on OP, then deploy most successful ones to other chains. It is not our first chain, but will become native to most of our innovation Date of deployment/expected deployment on Optimism: Technical deployment - August 2022, commercial launch - first week of September 2022 Ecosystem Value Proposition:   What is the problem statement this proposal hopes to solve for the Optimism ecosystem? Building ideal DeFi product suite for crypto-winter and beyond: trustworthy, low-risk, decentralised asset management solution for passive stablecoin investors with minimum risk appetite in a convenient ‘stablecoin’ form factor   How does your proposal offer a value proposition solving the above problem? Overnight’s vision is to build ‘Vanguard of DeFi’ with (1) USD+ as a lowest risk product (equivalent of traditional money-market funds) and (2) ETF as a medium risk product (equivalent of ETF). Insurance product being built will play the central role in de-risking Overnight’s ecosystem of the structural DeFi risks   Why will this solution be a source of growth for the Optimism ecosystem? Overnight is targeting risk-averse segment of DeFI (both individuals and treasuries), somewhat underserved segment, which, we believe, over time will overtake ‘degen’ segment of DeFI in volumes and revenue. Over time risk-consious investing always wins. This will be even more pronounced through crypto-winter   Has your project previously applied for an OP grant? Yes Number of OP tokens requested: 400,000 OP Did the project apply for or receive OP tokens through the Foundation Partner Fund?: No If OP tokens were requested from the Foundation Partner Fund, what was the amount?: NA How much will your project match in co-incentives? (not required but recommended, when applicable): USD+ will match 100% of the liquidity mining incentives by (1) channelling USD+ yield from liquidity pools with USD+ on Velodrome and Balancer to self-bribing and (2) allocating 50K USD worth of BAL received from Balancer for building boosted pool with USD+ on an L2 towards Beethoven’s USDC/DAI boosted pool. Proposal for token distribution:   How will the OP tokens be distributed? 50% for Overnight products liquidity mining on Optimism (spread between Velodrome and Balancer). → This would grow USD+ and ETS liquidity on Optimism, but also increase liquidity for the protocols and pairs USD+ and ETS collateral is invested into (100% is invested on the same chain) 25% for expansion of \"+\"and ETS product lines: ETS based on OP/USDC in particular, as well as DAI+, potentially, BTC+ and/or Eur+ etc. → This would attract users with corresponding risk appetite 25% for building insurance product → This would derisk entire Overnight ecosystem: both USD+ and ETS  Over what period of time will the tokens be distributed for each initiative? 3-6 months  Please list the milestones/KPIs you expect to achieve for each initiative, considering how each relates to incentivizing sustainable usage and liquidity on Optimism. First KPI will be exceeding 10M in TVL and 2000 users for Overnight overall Second KPI - exceeding 1M in TVL and 100 users for ETS products Third KPI - the launch of Insurance  Stablecoins like USD+ have considerable network effects. By reaching critical mass of TVL and users, powered by low risk, USD+ and Overnight will realize network effects and make Overnight sustainable on Optimism   Why will incentivized users and liquidity on Optimism remain after incentives dry up? Our overall approach is that Overnight products should be attractive without rewards (with rewards used essentially for promotion/marketing only):   USD+ relies on natural yield on the chain to generate yield for its users USD+ model we are deploying on Optimisme is ‘self-bribing’, i.e. natural yield from USD+ in Velodrome and Beets core pools will be support bribes beyond incentives ETS also has a ‘natural source of yield’; we will use part of the funds allocated to developing ETS product line on Optimism, towards developing ETS based on Uni-V3 non-incentivized pools, ultimately sustainable source of natural yield  Please provide any additional information that will facilitate accountability:(smart contracts addresses relevant to the proposal, relevant organizational wallet addresses, etc.) All Overnight smart contract addresses on Optimism can be found here: Contract Addresses - Overnight Finance Docs (Beta))  We hope the Optimism community will help Overnight not just grow TVL, but push DeFI innovation forward and beyond. Optimism is ideal chain for building things that had not been tried before. Let us know if you have any feedback on the proposal! ",
                    "links": [
                        "http://Overnight.fi",
                        "http://Overnight.fi",
                        "https://optimistic.etherscan.io/address/0xe497285e466227F4E8648209E34B465dAA1F90a0",
                        "http://Overnight.fi",
                        "https://overnight.fi/",
                        "https://twitter.com/overnight_fi",
                        "https://discord.gg/fNZmqdrM2F",
                        "https://www.linkedin.com/in/maxim-ermilov/",
                        "https://docs.overnight.fi/advanced/contract-addresses",
                        "https://gov.optimism.io/t/review-gf-phase-1-voting-cycle-7-overtime-markets/3579/35",
                        "https://gov.optimism.io/t/voting-cycle-7-roundup/3586/19",
                        "https://gov.optimism.io/t/gfx-labs-delegate-communication-thread/2728/17",
                        "https://gov.optimism.io/t/defi-committee-c-season-2-recommendations/3437/7",
                        "https://gov.optimism.io/t/defi-shadow-committee-b-season-2-recommendations/3549/14"
                    ],
                    "GPT-summary": "The post is a Phase 1 Proposal from Overnight.fi Protocol, explaining their goal to push the adoption of their innovative product line on the Optimism network. The proposal includes details about their product line, partnerships, usage metrics, and token distribution plan. The author is seeking feedback and collaboration from the Optimism community. A 3rd party could give constructive criticism, extend to the proposal, ask questions, or audit and review the proposal.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Interoperability and Scaleability",
                        "Token economics",
                        "Community and engagement",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.735540622168529
                },
                {
                    "author_link": "https://gov.optimism.io/u/StevenSchrembeck",
                    "index": "2",
                    "likes": "2",
                    "time": "03/10/2022-17:28:08",
                    "content": "I read through the contracts, docs, and dug into the yield strategies and position sizes before commenting. Correct me if I’m wrong on this summary: What Optimism stands to gain:  Liquidity and support for the USD+ stablecoin token Some cross-polination of defi users from your dapps on other chains Verbal promise to use Optimism as a test bed for new features before other chains  What Optimism must give up:  400,000 OP, most of which will be liquidated for other stables behind the scenes for funding and yield rewards  On the face of it, this is a critical comment. I’m still not a fan of mercenary incentives, but it DOES bring users. I’m just not convinced it’s users that anyone actually wants or gets to keep in the long-term. I always prefer incentives that bring in users who are doing something. This does look like a repackaging of existing value – but you’re hardly alone in that! A money market fund is actually somewhat useful. I would be more receptive to this proposal if USD+ innovated more on the backing / stability side. We really need stablecoin innovators If this were just a safe play to get people into your ecosystem so that you can later convert them into your really exciting product ideas, that would also be more enticing. Could you share some of the experiments you’re considering trying on optimism? Thanks for submitting and deploying on Optimism. Congratulations on the launch. This network is special. I just want to see our dapps mirroring that ethos too ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.608076942898371
                },
                {
                    "author_link": "https://gov.optimism.io/u/_Max_plus",
                    "index": "3",
                    "likes": "0",
                    "time": "03/10/2022-17:48:03",
                    "content": "I would point to ETS, a delta neutral quasi stable strategy,  as a truly innovative product - we deployed it already on OP, in particular, OP/USDC ETS (it is live on our dapp and you can try investing in it). The vision is to build ETS that’s sustainable long term, independent of rewards. That can only be accomplished on Uni V3. We have deployed 4 prototypes on OP and are collecting performance data - contrasting various liquidity mining strategies. So it is not just a promise, but proper R&D. Surely, getting both Gamma and Arrakis very nervous:) What we look to do is to bring from prototype to production the quasi-stable ETS based on UNI-V3, then build insurance for it, then have insured parts of ETS underlie USD+. This way we would arrive to a stablecoin that has sustainable, native source of yield, low-risk and insured. That’s what we have been building on Polygon, but could be much more exciting to accomplish on OP. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 6.05465367965368
                },
                {
                    "author_link": "https://gov.optimism.io/u/_Max_plus",
                    "index": "4",
                    "likes": "0",
                    "time": "03/10/2022-17:53:23",
                    "content": "Last but not least: once OP is available on Aave, we will build a truly scalable ETS based on OP/USDC (we are currently limited by Granary’s very shallow liquidity) and potentially OP+ in case there is demand for it. So that certainly would create more demand for OP than we ever dump. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.474702380952381
                },
                {
                    "author_link": "https://gov.optimism.io/u/StevenSchrembeck",
                    "index": "5",
                    "likes": "1",
                    "time": "03/10/2022-19:16:24",
                    "content": "Ah. I didn’t really look into ETS. That’s on me. I’ll go back through the docs in a bit ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/tytytytytytyverymuch",
                    "index": "6",
                    "likes": "0",
                    "time": "05/10/2022-02:30:52",
                    "content": "I like that this will attract users to OP that are looking for high yield on stable coins and then the collateral will be invested in other protocols on OP like Pika and Rubicon. Win-Win-Win ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving positive feedback on proposal",
                        "3rd party extending to proposal",
                        "None"
                    ],
                    "Sentiment": 5.0875
                },
                {
                    "author_link": "https://gov.optimism.io/u/solarcurve",
                    "index": "7",
                    "likes": "1",
                    "time": "05/10/2022-13:48:11",
                    "content": "I am an Optimism delegate [Delegate Commitments - #42 by solarcurve ] with sufficient voting power and I believe this proposal is ready to move to a vote. ",
                    "links": [
                        "https://gov.optimism.io/t/voting-cycle-7-roundup/3586/19"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party auditing and reviewing proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "8",
                    "likes": "1",
                    "time": "05/10/2022-14:19:12",
                    "content": "I am an Optimism delegate [Delegate Commitments - #136 by jackanorak ] with sufficient voting power. I believe this proposal is ready to be reviewed and voted on. ",
                    "links": [
                        "https://gov.optimism.io/t/voting-cycle-7-roundup/3586/19"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party auditing and reviewing proposal",
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/_Max_plus",
                    "index": "9",
                    "likes": "0",
                    "time": "05/10/2022-14:48:33",
                    "content": "@jackanorak @solarcurve thank you so much for supporting! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.28125
                },
                {
                    "author_link": "https://gov.optimism.io/u/_Max_plus",
                    "index": "10",
                    "likes": "1",
                    "time": "07/10/2022-10:39:52",
                    "content": "An update on Overnight metrics since proposal submission:  USD+  has reached 3,83M in TVL, 281 users ETS OP/USDC has reached its maximum cap of 100K, provoking the OP borrowing rates on Granary to exceed 52% APY, attracting meaningful deposits into granary Overnight has provided close to 4M of Liquidity to various OP protocols: Pika, Rubicon, Beethoven, Velodrome (most in OP/USDC pool), Granary  @OPUser @jackanorak @solarcurve @StevenSchrembeck ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.666666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "11",
                    "likes": "0",
                    "time": "07/10/2022-11:05:01",
                    "content": "Hi @_Max_plus , Thank you for tag tag and update.  I just notice that your proposal is there on the roundup thread. Did you add it after the deadline ? When I collected all proposal assigned to DeFi committee, your proposal was not there hence its not assigned to any defi committee. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/_Max_plus",
                    "index": "12",
                    "likes": "0",
                    "time": "07/10/2022-11:19:03",
                    "content": "I published the proposal more than a week prior to the deadline, also submitted it via discord. I added the proposal to the thread Maybe, 1-2 hours after deadline - the process has changed vs. what was there before so there is some confusion with how to move it forward. Is it possible to assign it please? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPGovWatch",
                    "index": "13",
                    "likes": "0",
                    "time": "07/10/2022-15:31:32",
                    "content": "Given this is a new / confusing process and DeFi Committee B has 1-2 open slots it does not feel unreasonable to extend a grace period to projects like Overnight and Abracadabra. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.7272727272727275
                },
                {
                    "author_link": "https://gov.optimism.io/u/_Max_plus",
                    "index": "14",
                    "likes": "0",
                    "time": "07/10/2022-15:55:31",
                    "content": "Thank you so much. Really appreciate it. The process is totally fine - I got confused as I had not clarified the changes to the previous one upfront ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0625
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "15",
                    "likes": "1",
                    "time": "07/10/2022-16:16:01",
                    "content": "I totally understand your position but rules and process should apply to each proposal equally and including a proposal now will not be a good idea. My suggestion is to wait for next cycle which will start in just 2 weeks. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.875
                },
                {
                    "author_link": "https://gov.optimism.io/u/_Max_plus",
                    "index": "16",
                    "likes": "0",
                    "time": "07/10/2022-16:43:48",
                    "content": "I submitted proposal 2 weeks ago, submitted to discord 10 days ago, wrote to multiple committee members 1 week ago asking what I was doing wrong -  I was pointed to cycle 7 thread only 1 hour after deadline, and submitted it 1 hour after… I know it is my fault, but maybe, some moderator on the forum, or in discord could have commented that I had been following the old process, as well as point to this critical deadline ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.666666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/Defi_LATAM_axlvaz",
                    "index": "17",
                    "likes": "0",
                    "time": "07/10/2022-17:07:35",
                    "content": "You can send in the next cycle. We must understand as governance that we must be orderly and fair to all equally. I understand that some delegates have an interest in moving some projects to cycle 7, but this can bring disorder to governance. As we move forward the processes will be more fluid. Changes or exceptions should be for everyone equally, we should not mix our own interests whether delegate or protocol with governance. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 6.285714285714286
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPGovWatch",
                    "index": "18",
                    "likes": "0",
                    "time": "07/10/2022-17:14:14",
                    "content": "I am not the proposer. I am an advocate for effective OP governance. Everyone who has weighed in on Discord so far does not see an issue in allowing them to proceed. Please join the conversation there. We are here to support builders and grow Optimism, not recreate a rigid bureaucratic state. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/Defi_LATAM_axlvaz",
                    "index": "19",
                    "likes": "0",
                    "time": "07/10/2022-17:25:00",
                    "content": "I am in discord and follow the conversations. I always support the builders so I think it has to be equal for everyone at all times. I think if you think order and neatness is bureaucracy you are wrong.    Discord   Discord - A New Way to Chat with Friends & Communities Discord is the easiest way to communicate over voice, video, and text.  Chat, hang out, and stay close with your friends and communities.      You can check that not everyone has given their opinion yet. ",
                    "links": [
                        "https://discord.com/channels/667044843901681675/968498307913637919/1027730371158216715"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 4.393939393939394
                },
                {
                    "author_link": "https://gov.optimism.io/u/_Max_plus",
                    "index": "20",
                    "likes": "2",
                    "time": "07/10/2022-18:37:40",
                    "content": " Screenshot 2022-10-07 at 21.32.261920×1340 149 KB  this was posted on the 22nd of september, on the 26th i asked for feedback, when noone answered - i followed up with 4 different delegates in direct messages, including @OPUser, asking what i was doing wrong and why discussion of our proposal was not taking place. i was not aware the process changed so much but indeed, rules are rules and we will wait 2 more weeks - thank you ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.145833333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPGovWatch",
                    "index": "21",
                    "likes": "0",
                    "time": "08/10/2022-13:36:12",
                    "content": "It seems as if there is popular support for moving your proposal forward amongst delegates. Your project should not be punished for a governance system that is still working out the kinks. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/_Max_plus",
                    "index": "22",
                    "likes": "0",
                    "time": "08/10/2022-19:06:48",
                    "content": "Thank you, much appreciated. I think the system is totally fine. The confusion is on me, as I understood too late that the process changed vs. our first request. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.708333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/ScaleWeb3",
                    "index": "23",
                    "likes": "0",
                    "time": "08/10/2022-22:35:56",
                    "content": "We just went through the proposal, website, docs, analytics as we didn’t know of Overnight before. Based on the proposal, we assumed your OVN token is already live but we couldn’t find it on Coingecko and your docs show some preOVN token and future IDO with tokenomics under development and missing links (for example to ovnstable.io). According to DeFiLLama & Coingecko the USD+ token has 2.5M marketcap (TVL). According to website & proposal, Overnight offers a USDC wrapper (USD+) & exchange-traded strategies (ETS) that achieve supreme yield from  Stablecoin deposits into lending protocols Stable-to-stable liquidity pools Protocol-owned liquidity  First thoughts:  Appreciate your proposal, deployment to Optimism, first pools on Velo, and consideration of Optimism as your innovation hub. Communication focuses on “high yield”, “passive investment”, “low risk investment” as well as big roadmap & ideas. So far, there is little traction (6 &15 users in ETS strategies) though and the product, Op deployment & community look very early stage. The Vanguard approach of simple investing has some merit. Other DeFi projects such as Yaxis also went for this at some point but mainly focused on creating a meta-aggregator of yield strategies. PoL for stablecoin pairs can be a solid yield source (See Alpha Homora). Probability of loss seems small but total value at risk could be all AUM in a pool with one asset moving away from 1 aka going to 0. In our opinion, the USDC wrapper offers little additional value to spur Optimism growth and incentivizing its use at this stage might be a risk to Op users. The ETS product looks interesting but the daily payment if profitable seems strange - would like to see some more traction. Having another stablecoin and potentially more innovative products on Optimism is worth a shot.  Possible improvement:  Ask is very high for size & stage of the project. You can compare it to a recent proposal for 31K OP tokens from Interest Protocol which was approved to speed up deployment on Optimism. A second Interest Protocol proposal over 240K OP for post-deployment is also on the forum but it seems too early to fund at this point in time. We believe an approach with a similar Ask amount to Interest Protocol Proposal 1 might be more suitable at this stage. Potentially also funding from another source in Optimism (or externally) makes more sense to advance development? Token distribution plan should be more detailed & focus on ready products. You can submit a second proposal later-on.  We’d appreciate some insights to learn more about the project & proposal:  Can you explain point 3 in relevant usage metrics? USD+ trading volume? Who is trading it? Why (is it between BUSD & USDC)? What is the current strategy for USD+ to achieve 10% APR. (See overnight.fi) How is risk hedged in ETS Ruby (weth-usdc pool, 14% APY, 2k TVL) or ETH Garnet (USDC-OP, 29% APY, 100K TVL) strategy? How did you come up with the 400,000 OP request? Can you share more about the co-incentives?  ",
                    "links": [
                        "https://defillama.com/protocol/usd+",
                        "https://www.coingecko.com/en/coins/usdplus",
                        "https://gov.optimism.io/t/review-gf-phase-1-interest-protocol-development-deployment-to-optimism/2951",
                        "https://gov.optimism.io/t/review-gf-phase-1-interest-protocol-post-deployment/2968",
                        "https://app.overnight.fi/market"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None"
                    ],
                    "Sentiment": 5.765670033670034
                },
                {
                    "author_link": "https://gov.optimism.io/u/_Max_plus",
                    "index": "24",
                    "likes": "0",
                    "time": "09/10/2022-13:57:51",
                    "content": "thank you for the feedback and comments. Overnight is VC funded, we have not issued the OVN token yet as it would limit our VC funding options. We are graduating from Berkley’s Xcelerator around 2nd of Novemeber and will then take the decision about the OVN-token public sale, which is likely to take place at the end of November. We need to work better with DeFIlama, as the numbers you mention are obviously wrong. The metrics on Optimism as of this morning are ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/_Max_plus",
                    "index": "25",
                    "likes": "0",
                    "time": "09/10/2022-15:04:45",
                    "content": "thank you for the feedback and comments. I am amswering below in the order of your comments/questions: Overnight is VC funded, we have not issued the OVN token yet as it would limit our VC funding options. We also very much believe that the product should make sense without rewards (which USD+ has demonstrated), then rewards can be used temporarily to promote and scale it. We are graduating from Berkley’s Xcelerator around 2nd of Novemeber and will then take the decision about the OVN-token public sale, which is likely to take place at the end of November. USD+ is not a USDC wrapper, it is a stablecoin that’s 100% collaterized by yield-generating strategies, made of the best quality stables deposited in high-quality protocols (mostly, not lending pools). USD+ magic power is its ability to generate yield in liquidity pools, e.g. inside Velodrome, thus making liquidity mining way more capital efficient. In a traditional pool you get fees and rewards, in a pool with USD+ you get fees, rewards and yield by USD+. USD+ is a rebase token, so we indeed provide a wrapper over USD+ that some people use for tax purposes, and is used by some protocols for integration purposes (e.g. wrapper is used inside Balancer’s boosted pools) ) We need to work better with DeFIama, as the numbers you mention are obviously wrong. The metrics on Optimism alone largely exceed what you mention and as of this morning are: (a) TVL - 4.36M for USD+, 4,47M total (b) Total number of active users - 287 for USD+, 307 total Overall TVL 8.1M, total active users (hard to exclude duplicates) - roughly 3200, discord community 4,06K. It is a little weird that OP is now our largest chain… what has happened is that once we launched, our power users from Polygon and BNB have moved, in some cases completely, to Optimism - due to much more attractive performance and rates (see below). we have cannibalised at least 3M of our TVL from other chains As far as trading volumes are concerned, in crypto-pairs USD+ is able to achieve same trading volumes as USDC. For example, wMatic/USD+ on polygon generates same trading volume as wMatic/USDC (as % of TVL). This is due to the ease of arbitrage of USD+ to USDC (in case of price discrepancy, an arbitrageur can take a flash loan in USDC, mint USD+, arbitrage wMatic, pay back flashloan;). On polygon we run our own arbitrage bots and generate b/w 10-15% of the volume. The rest is market volume. we look to achieve the same on OP, once ETH/USD+ and OP/USD+ pairs are established On OP we have been generating way more than 10%.  Screenshot 2022-10-09 at 17.17.241920×928 46.3 KB  The current portfolio is below  Screenshot 2022-10-09 at 17.18.561920×1029 75 KB  The risk in ETS is hedged 2 ways: (1) Basis risk: the crypto asset is borrowed on AAVE (ETH) or Granary (OP) using USDC as the collateral. (2) Impermanent loss: we run bots that rebalance the portfolio once there is discrepancy b/w the amount of OP borrowed and OP invested You can see the current positions on ETS OP/USDC below  Screenshot 2022-10-09 at 17.35.511618×726 121 KB  Please note that we had to limit the maximum on ETS OP/USDC to 100K because of limited liquidity to borrow OP. The cap filled in within 24 hours. Once OP borrowing is available on AAVE, we will eliminate the cap. ETH/USDC is small as it was only announced/launched yesterday; it is designed to yield 15-20% sustainably, but kind made no sense to promote while USD+ itself was yielding 20% average; Overall, ETS is a well-established product for us on other chains, with clear demand and traction 400K OP request is made of 2 parts: (a) Liquidity mining program - based on the incentives we look to generate from our side over the next 6 months (b) Development time required (and honestly, a lot of it already spent) on the deployment and new product development on OP Current level of bribing is 3.5K USD+ (mostly on Velo); this is a sustainable level of bribes, meaning, these are bribes generated by USD+ organically, based on the current size of operation on OP, and they are sufficient to sustain the business. As we expect the business to grow by at least x5 and the yields on OP to go down to more sustainable levels by at least x2, USD+ will be generating about 8K USD+ of bribes per week; we are asking OP to match the bribes we will provide (8K per week) for the next 25 weeks - a total of 200K USD worth of liquidity mining rewards. I understand the other part of the grant, dedicated to the development and R&D work, is hard to evaluate and control. we can discuss if it is valuable to be deployed on OP, adjust the ask or move the development elsewhere. On liquidity mining we are asking to match the bribes we will provide, so hope, that part you will find to be fair. ",
                    "links": [
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/8/8002249e74254ad81dea8da3bf5fa4b4c08be309.jpeg",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/6/628e228d2d844b3b56efc4561ef42dce55d17549.jpeg"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.258532762229945
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPGovWatch",
                    "index": "26",
                    "likes": "1",
                    "time": "09/10/2022-15:53:14",
                    "content": "Wouldn’t something like QiDAO be a much better reference for the appropriate level of grant than Interest Protocol? At the time of proposing, they had $3.61m in Optimism TVL and it sounds like USD+ has $4.36m.     [READY] [GF: Phase 1 Proposal] QiDao Protocol Governance Fund: Phase 1       Project Name: Qi Dao  Author Name: @geekvine and @Benjamin.lens  Number of OP tokens to claim: 750,000 OP  L2 Recipient Address: 0xB1a8D1D6Dc07ca0e1E78a0004aa0bB034Fa73d60  DefiLlama TVL on Optimism: $3.61M  Proposal for token distribution: Distribute OP tokens to QiDao to grow the protocol on Optimism.   Rationale: QiDao is a decentralized collateralized debt position stablecoin protocol where users can deposit tokens as collateral to issue MAI, the protocol’s decentralized stablecoin. It is th…     ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/ScaleWeb3",
                    "index": "27",
                    "likes": "0",
                    "time": "09/10/2022-22:03:28",
                    "content": "@OPGovWatch We picked Interest protocol as they are also a relatively unproven stable at an early development stage. Overnight differs in being deployed already but similarly lacks meaningful traction & proven durability. In our opinion, TVL is a key metric for an ecosystem to enable traders & other projects but not the north star KPI to look at and not good to single out as a couple of $M USD can quickly move in and out. Ultimately, we all want to focus more on effective liquidity, value-add, sustainable growth. For us, the main differentiator to QiDao is the previous track record & our perceived value-add to Optimism at the time of the proposal. We knew QiDao, their risk management & ecosystem involvement from Polygon. The proposal from QiDao had a large Ask compared to their market cap but the incentive design & distribution, and especially their strong co-incentives lead delegates incl. us to vote yes. (I’d personally expect the same proposal to get at least a 30% haircut today though.) Thank you @_Max_plus for your detailed answer and weighing into each of the mentioned critical points. First of, have to say the communication from the website (focus on profits) and initially rather broad proposal with lack of focus on current products was a big turnoff - almost a red flag. Your reply gives us a much more detailed and positive picture. While still inclined to call it an “USDC wrapper” or “top stable wrapper”, and having some doubts about long-term utility of USD+ & success of the products (yields drop, increased smart contract/operational risk vs. holding underlying, etc.), there is value in stables, efficiency & real yield in the current bearish environment - this explains also the uptick in delta-neutral on-chain yield strategies & new stable models. Hence to summarize, the stablecoin/yield generation area is an interesting space, the Overnight products are early stage and might add value but traction & contribution to spur Optimism growth is still unproven & not fully clear. Potentially, a smaller grant than originally proposed but larger than Interest protocol 1 proposal could be “fair” to get going IF good co-incentives are also available & more detail on LM, OP distribution is added. (Note to self: It would be good to have a better overview than this distribution doc over previous grants, their success as well as current projects and their functionalities on Optimism incl. stablecoins, possibilities to lend and borrow Op, etc. to assess new proposals) ",
                    "links": [
                        "https://docs.google.com/spreadsheets/d/1eaHOlWB34ij1KGsXdaNyTQg4tt1Pu2JurJsElBb6a8k/edit#gid=0"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.849964985994398
                },
                {
                    "author_link": "https://gov.optimism.io/u/_Max_plus",
                    "index": "28",
                    "likes": "0",
                    "time": "10/10/2022-05:14:12",
                    "content": "thanks for the doc: what i see is that our request is below average in all cycles except cycle 6. the median is about 300 K in the others, except cycle 0 and 6, which is probably the appropriate amount to revise our proposal down to - by eliminating the request for grant to build insurance/tranching. Maybe i would like wider feedback from the committee, but thats certainly a possibility On co-incentives, as I said: we are already bribing about 3,500 USD+ per week on Velo, we will increase that to 8,000 if our request is approved. within 10 days we will be allocating 50K over 16 weeks in BAL incentives towards launching a USD+/DAI+ boosted pool on Beets. That’s a total of 250K USD+ in. cash incentives in stables, not in gov tokens. At current rates, thats 295K OP. We are asking the committee to match those co-incentives for the next 25 weeks to be used as bribes at Velodrome and Beets. Importantly, the significant part of those incentives will stay after OP grant expires because of natural yield USD+ generates and uses for incentives ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.674422799422799
                },
                {
                    "author_link": "https://gov.optimism.io/u/_Max_plus",
                    "index": "29",
                    "likes": "0",
                    "time": "10/10/2022-05:38:10",
                    "content": "btw, it turns out defilama has 2 links for USD+, one of them is outdated. the right one is here - it shows USD+ at 7.7 M across all chains (ETS not included) USD+: Circulating and stats - DefiLlama the growth on OP over the last month has been 1105%. I hope it can be classified as more than ‘limited traction’ ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.482142857142857
                },
                {
                    "author_link": "https://gov.optimism.io/u/Netrim",
                    "index": "30",
                    "likes": "2",
                    "time": "10/10/2022-12:04:31",
                    "content": "The median across many protocols is not a good way to compare. You need to compare Overnight with similar protocolos, at the same stage and/or development. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.1875
                },
                {
                    "author_link": "https://gov.optimism.io/u/_Max_plus",
                    "index": "31",
                    "likes": "1",
                    "time": "10/10/2022-12:32:48",
                    "content": "this logic is highly flawed - favours incumbents at the expense of innovators, regardless of the fundamentals. not to mention, that 1OP in the previous epochs was more than 1OP today. ultimately, we commit to provide 250K USD of incentives from our side. thats the only objective benchmark that should influence the size of the grant. the rest is not as objective, can always be argued as comparing ‘apples and oranges’ ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 4.8809523809523805
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "32",
                    "likes": "3",
                    "time": "10/10/2022-13:10:52",
                    "content": "Recommendation from DeFi committee C Details The proposal describes broad potential value-adds to Optimism and the Op distribution lacks some specifics. It was a late submission and the latest discussion & incorporation of feedback seems to lead to some positive changes. Value-Add Overnight is developing the USD+ stablecoin. USD+ is USD that pays you a return through a daily rebase. It is 100% collateralized with other stablecoins (USDC, BUSD, USDT, USDT, DAI, etc.) that are invested on-chain in “low-risk strategies” such as LPing on stables, lending & more. The integration of a yield-generating stable in the Optimism ecosystem can have benefits for Optimism users. Whether Overnight can help with better liquidity & trade efficiency on top stables is still unclear at this point in time. Traction Overnight is an early stage project that intends to make Optimism its ‘innovation hub’. It has gathered a total TVL of more than $7+ Mio, and since its launch on Optimism in early September there is a clear trend towards Optimism (55% of TVL). The yield strategies have decent APYs but one is capped at 100K (133 users; cap due to liquidity of underlying protocol), and others have attracted only a few 1K$ and users; and strategies will likely not offer 10%+ APYs with larger TVL amounts. With this funding they also want to work on extending their ETS product line (currently 16 users on Op) along other “+” features. Overnight does not have all the contracts public, it has closed open source portfolio rebalancing algorithms behind ETS until at least the public sale of the OVN governance token. Amount 50% for Overnight products liquidity mining on Optimism. Approx 8K $OP/week for 6 months. 25% for expansion of “”+\"\"and ETS product lines 25% for building insurance product: this would de-risk entire Overnight ecosystem: both USD+ and ETS 200K $OP for LP reward and 200K for product and feature development. Co-incentives Willing to match 100% of liquidity mining incentives along with llocating 50K USD worth of BAL received from Balancer for building boosted pool with USD+ on an L2 towards Beethoven’s USDC/DAI boosted pool. Alignment Overnight is a protocol that is in its early stages. In the future we can evaluate if they are aligned to the Optismim ecosystem. Reccomendation No The protocol has not published its contracts and is in its initial stages. It is in an experimental stage, we are waiting for a bit more maturation, organic traction of the protocol where a better evaluation of product-market-fit can be made before incentivizing growth. The co-incentives are solid, the trend towards building on Optimism and attracting TVL is also positive. Despite that, the positive impact on the Optimism ecosystem is still to be seen, for example whether incentives for Overnight and USD+ would cannibalize organic liquidity on Optimism DEXs and the success of the different yield strategies. We recommend to possibly create two proposals: one for protocol incentives and another for development funding. A focus on the slightly more mature “+” product with a lower Ask, similarly good co-incentives & a clearly detailed LP / bribe distribution plan in a subsequent proposal could be a good starting point for spurring additional growth on Optimism for Overnight & Optimism. Note :- This proposal was also an edge case at it was included in the cycle round up thread after the defined deadline. As there is no rule or process defined for such scenario, committee is considering this an exception. cc @_Max_plus Our past recommendation is available on committee recommendation thread. ",
                    "links": [
                        "https://gov.optimism.io/t/defi-committee-c-season-2-recommendations/3437",
                        "https://gov.optimism.io/t/defi-committee-c-season-2-recommendations/3437/7",
                        "https://gov.optimism.io/t/gfx-labs-delegate-communication-thread/2728/17"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.574641504329004
                },
                {
                    "author_link": "https://gov.optimism.io/u/ScaleWeb3",
                    "index": "33",
                    "likes": "1",
                    "time": "10/10/2022-13:41:38",
                    "content": "   Committees: Next Steps for Season 2   Committees should consider whether proposals are aligned with the near term goals of the Governance Fund: Target L1 applications with PMF: To the extent that people use crypto applications, they should be using those apps on Optimism. The Governance Fund should support the migration of trusted, proven applications currently deployed on L1s. Grow population of values-aligned builders: To be the home for the next wave of novel applications, the Governance Fund should support developers launching novel applications that will draw new users to Optimism. If the grant does not help the Governance Fund achieve either of the above goals, delegates should provide that feedback to proposers and consider not approving the proposal.   We’re truly looking forward to get the best projects, teams on Optimism and to support new projects and innovative applications that can bring new users, liquidity or open up verticals for the Op ecosystem. A larger project that has been around for some time, has 100s of Mio in marketcap and in assets under management, is likely to have a bigger impact in the near-term and give a better return on large co-incentives invested. On the other side, we don’t think you require millions in grant funding to launch an app and get initial traction to prove yourself - before co-incentivizing additional growth. A comprehensive look at track record, AUM, active users, marginal value-add seems to make most sense.     _Max_plus:  On co-incentives, as I said: we are already bribing about 3,500 USD+ per week on Velo, we will increase that to 8,000 if our request is approved. within 10 days we will be allocating 50K over 16 weeks in BAL incentives towards launching a USD+/DAI+ boosted pool on Beets. That’s a total of 250K USD+ in. cash incentives in stables, not in gov tokens. At current rates, thats 295K OP. We are asking the committee to match those co-incentives for the next 25 weeks to be used as bribes at Velodrome and Beets. Importantly, the significant part of those incentives will stay after OP grant expires because of natural yield USD+ generates and uses for incentives   These co-incentives look juicy. Hope to see a slightly adjusted proposal if you don’t get a YES this round. Good luck! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.749720107478728
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "34",
                    "likes": "3",
                    "time": "12/10/2022-18:57:51",
                    "content": "The defi shadow committee  – which is not an official committee – supports this proposal. Overnight have achieved strong organic growth by any measure on Optimism ($4.5M in a single month, several thousands of wallets, trading volume way above their weight), which is likely to continue as they launch their next wave of products across multiple partner protocols. Their proposal is among the only ones to identify a target user segment, one that does indeed happen to remain active: the risk-averse stablecoin yield maximizer. We think there is plenty of meat on the bone here and see an opportunity to siphon a lot of interest from Mainnet. More broadly, this is a killer team that’s hit the ground running on Optimism with little help, and they’re going after a user segment that remains active in crypto while promising to make more use of a range of DeFi protocols. Their core ask is one that we know lends enduring value-add to Optimism’s DeFi eco, and supporting ETS (i.e., increasing the headroom available) seems like a likely winner as well considering the consistent uptake. They say they want to make Optimism an “innovation hub” — we take them at their word. We’ve seen an extraordinary amount of energy and engagement from them in the past month, seemingly everyone’s been hit up for a partnership, and they have a lot of ideas. Sometimes it’s up to Optimism to show these standout teams that we’re open for business. ",
                    "links": [
                        "https://gov.optimism.io/t/defi-shadow-committee-b-season-2-recommendations/3549/14"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.4894480519480515
                },
                {
                    "author_link": "https://gov.optimism.io/u/katie",
                    "index": "35",
                    "likes": "3",
                    "time": "13/10/2022-20:37:17",
                    "content": "Voted yes - Although this is against the Defi Committee C recommendation, the co incentives and the token distribution look really good and would definitely drive OP growth.  I don’t see a downside so I’m in support of this proposal. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/alexcutlerdoteth",
                    "index": "36",
                    "likes": "2",
                    "time": "14/10/2022-13:37:16",
                    "content": "I encourage delegates to follow @katie’s lead here in voting for the proposal, despite the official recommendation of committee b. Overnight is a project that we helped attract away from Polygon and is definitely one we want to retain. They genuinely seem to have an innovative product on their hands and are a super sharp team. The “self-bribing” aspect of USD+ pairs on Velodrome is very impressive and will reduce the need in the long term for $OP or other incentives in order to attract significant stable TVL from L1 and competitive L2s. If you haven’t already check out the shadow committee’s review here: DeFi Shadow Committee: Season 2 Recommendations - #14 by jackanorak cc: @quix @linda @polynya @lefterisjp ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party auditing and reviewing proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.282407407407407
                },
                {
                    "author_link": "https://gov.optimism.io/u/ScaleWeb3",
                    "index": "37",
                    "likes": "2",
                    "time": "14/10/2022-14:54:15",
                    "content": "We at ScaleWeb3 would like to share a bit more insight to our reasoning - especially as @katie mentions there is no downside. We’ll just briefly focus on Op distribution:  50% for Overnight products liquidity mining on Optimism (spread between Velodrome and Balancer)   → one can discuss the value of liquidity mining but we are largely supportive of this part for a product that is currently gaining traction.  25% for expansion of \"+\"and ETS product lines:   → these products are very new & we’d like to see more traction before potentially incentivising products that may loose users money.  25% for building insurance product   → this is very abstract so far, probably makes more sense to resubmit in a follow-up proposal. We felt strongly about this proposal not being at the standard of other proposals when reviewed. Part of this distribution is for products not well-specified and 400K Op is a very large Ask for a new project. Meanwhile we joined a Discord AMA of Overnight which gave us more confidence in the team and we are sure a resubmission for the next cycle focusing on the first product & LM campaign somewhere in the region of 200K OP and future proposals re other products will be better for Overnight and Optimism. That said, good seeing these discussions when they focus on the contents, seeing delegates not blindly following committee decisions and seeing generally support for Overnight from other builders in the ecosystem. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.9595746515389365
                },
                {
                    "author_link": "https://gov.optimism.io/u/_Max_plus",
                    "index": "38",
                    "likes": "1",
                    "time": "14/10/2022-15:25:11",
                    "content": "Thanks. Great that you joined the community - we would welcome more people to our Ama on - it is every Monday at 3 pm UTC. Also would be glad to conduct the Ama for OP collective in OP discord One point why considering why voting now could be an option is, unfortunately, OP price decline. We are offering 250k USD+ in coincentives and requested 400 OP, when it was very close to 400K USD. With current OP price, 400k OP grant just slightly exceeds the amount of coincentives. With the market ‘reducing our appetite’, maybe, you can see it as request which has already been downsized by >25%. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.296296296296297
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "39",
                    "likes": "0",
                    "time": "14/10/2022-16:34:42",
                    "content": "Thank you for doing the gatekeeping. I want to mention that 100K on ETS was filled in a single day with just 16 address, all the rewards dedicated for ETS will go to them. 100K OP distributed to just 16 addresses . We request that ETS need some maturity. 50% or 200K OP is going towards development, to teams pocket without any plan of accountability. This was discussed with Max and he agreed to provide more information but as of now it will be major mistake to approve 200K OP going directly towards Team and 16 addresses getting 100K OP. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.991071428571429
                },
                {
                    "author_link": "https://gov.optimism.io/u/_Max_plus",
                    "index": "40",
                    "likes": "1",
                    "time": "14/10/2022-18:01:43",
                    "content": "I don’t mind resubmitting, but just for the record: you are referring to OP/USDC ETS, which had to be capped to 100k.because of lack of borrowing options for OP (Granary has major liquidity constraints, creating very serious interest rate risk if we alleviate the cap and/or promote that ETS). It is so high yielding, that it needs no promotion and won’t be promoted. we have multiple ETSes, including ETH/USDC based, with no caps at all. The plan is to promote those. For ETS, as it is a rebase token, we will establish pools of USD+/ETS on Velodrome, with no limitations to participate, and will promote ETS via bribing those pools. No club deals and no limitations. All will be super transparent and in your full control ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.393749999999999
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPGovWatch",
                    "index": "41",
                    "likes": "0",
                    "time": "14/10/2022-19:53:16",
                    "content": "I have now counted six times in this thread that you or members of your committee have misunderstood or misrepresented details of the protocol or proposal and have had to be corrected by the proposing team. This makes it difficult to take your objections at face value or trust in the wisdom of your recommendation, even as I too believe more details in a few areas would be beneficial. @_Max_plus would you be willing to speak in a bit more detail to @OPUser’s suggestion that over half of the grant is going directly to the team and 16 wallets? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.345238095238095
                },
                {
                    "author_link": "https://gov.optimism.io/u/_Max_plus",
                    "index": "42",
                    "likes": "0",
                    "time": "14/10/2022-20:10:19",
                    "content": "Nono-Opuser looked in-depth at USD+ and ETS and understands it deeply and greatly. I had not specified ETS would go to Velodrome and be incentivized via bribes. That’s the best way, but not obvious to figure unless I’m specific about it - that’s on me. We are in direct contact with Nono ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 6.583333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPGovWatch",
                    "index": "43",
                    "likes": "0",
                    "time": "14/10/2022-20:15:42",
                    "content": "    OPUser:  now it will be major mistake to approve 200K OP going directly towards Team and 16 addresses getting 100K OP.   @_Max_plus  I’m referring to this portion. Delegates are actively voting right now and I’m trying to understand if you believe this is accurate as it is why he is recommending a no vote. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.714880952380953
                },
                {
                    "author_link": "https://gov.optimism.io/u/_Max_plus",
                    "index": "44",
                    "likes": "0",
                    "time": "14/10/2022-20:33:16",
                    "content": "As I understood, the biggest issue was our ask for grant for development activities. Overall, I have been encouraged to reapply for LM incentives. Although, obviously not waiting is better than waiting ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "45",
                    "likes": "1",
                    "time": "14/10/2022-20:43:57",
                    "content": "Thank you, Max. Like discussed, with words changed and few additional information we will be at better position. Its just sad that others are trying to drag you and your proposal in mud just to bring me down. Alex expressed his view and I expressed mine. I have seen your LinkedIn profile and you are in business for some time, think of this a office politics just more worse and sadly they are using your shoulder. Anyway best of luck with the voting, I am seeing gatekeeping by Velo team and i pointed it out but now I will stay away from commenting further. If you get approval, stay with us and participate in gov as we we are in dire need of support from community and if not, tty in 8 days. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.072222222222223
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPGovWatch",
                    "index": "46",
                    "likes": "0",
                    "time": "14/10/2022-20:55:03",
                    "content": "The proposal as written is currently being voted on in Snapshot and could still potentially pass. As we are seeing with the Overtime and Dope War proposals looking likely to pass, the delegates are the final say and not the committees. Your proposal has earned the support of both the Shadow Committee and at least one major member of DeFi Committee A. They did not share same point-of-view as Committee B rejection. That is why I’m encouraging you to clarify if you think OPUsers statement is accurate.  Voters will no doubt check this thread before casting a vote, so if they read that it may inform their decision. You are also free to simply concede the committee’s recommendation and resubmit if that is your preference. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.28125
                },
                {
                    "author_link": "https://gov.optimism.io/u/_Max_plus",
                    "index": "47",
                    "likes": "0",
                    "time": "14/10/2022-20:55:53",
                    "content": "I must say I sent the review by Jack and Alex to our VCs:) I am very flattered, but also share key points. Feel we will get there in due course ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.71875
                },
                {
                    "author_link": "https://gov.optimism.io/u/_Max_plus",
                    "index": "48",
                    "likes": "0",
                    "time": "14/10/2022-20:59:43",
                    "content": "I obviously prefer to get support in this round and willing to clarify key points. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0625
                },
                {
                    "author_link": "https://gov.optimism.io/u/alexcutlerdoteth",
                    "index": "49",
                    "likes": "0",
                    "time": "14/10/2022-21:09:57",
                    "content": "    OPUser:  Its just sad that others are trying to drag you and your proposal in mud just to bring me down.   Who is doing this and how? I was not playing office politics. I voiced my support for their proposal. Just like Katie did. Why are you making me the subject of the conversation?     OPUser:  I am seeing gatekeeping by Velo team and i pointed it out but now I will stay away from commenting further.   If you are going to use another protocol’s thread to attack us, at least have the courage to back it up. Innuendo is cowardice. I intentionally didn’t reply to your first jab as I didn’t want to pile on, but by all means find a place to air your grievances. This is insanely immature behavior. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 3.9043209876543212
                },
                {
                    "author_link": "https://gov.optimism.io/u/alexcutlerdoteth",
                    "index": "50",
                    "likes": "1",
                    "time": "14/10/2022-21:12:32",
                    "content": "For the record, Max that review came from the Shadow Committee which includes a bunch of folks (none of which are me).  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPGovWatch",
                    "index": "51",
                    "likes": "0",
                    "time": "14/10/2022-21:18:05",
                    "content": "    OPUser:  50% or 200K OP is going towards development, to teams pocket without any plan of accountability. This was discussed with Max and he agreed to provide more information but as of now it will be major mistake to approve 200K OP going directly towards Team and 16 addresses getting 100K OP.   If you do want the proposal to have a chance at passing this cycle, you should address this directly. Is 200k OP going directly to the team? Are 16 addresses getting 100k OP? If it is accurate, it does sound like a reason for concern. But, if it is not, that will be good for delegates to know before voting. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.4765625
                },
                {
                    "author_link": "https://gov.optimism.io/u/_Max_plus",
                    "index": "52",
                    "likes": "1",
                    "time": "14/10/2022-21:37:09",
                    "content": "We had asked for 200k of development funding The ETS incentives are not going to just 16 addresses. We look to distribute all coincentives via DEXes, primarily Velo and Balancer With OP falling, I feel our request has been 'downsized by the market’s; with 250 k USD+ of coincentives our original request is now appropriately sized 1:1 grant/coincentives ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.125
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPGovWatch",
                    "index": "53",
                    "likes": "0",
                    "time": "14/10/2022-22:09:13",
                    "content": "Thank you for that clarity. So in a way, the grant going to help development costs for the new products is helping you all to divert funds to match incentives on a 1:1 basis (which most proposals do not do). That makes sense to me and I can see why others have been willing to support it even if every detail of it is not perfectly defined. It is also good to hear that OPuser was mistaken about the 16 wallets. I would like to see him be more careful with such statements in the future as that misinformation being floated while voting is underway could’ve impacted the outcome. I have no votes, but wish you luck and thank you for your patience with this process. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.825757575757575
                },
                {
                    "author_link": "https://gov.optimism.io/u/polynya",
                    "index": "54",
                    "likes": "2",
                    "time": "15/10/2022-02:48:42",
                    "content": "Since I’ve been tagged - I’m happy to go against committee recommendation (see: Overtime) but I don’t see an exceptionally compelling proposal here and find committee’s recommendation well-reasoned. Beyond that, I don’t have the bandwidth to keep up with the 53 replies here and Discord chats and whatnot for nuances, sorry - which is why committees were created in the first place. I hope to support a future proposal by Overnight - being a few weeks late isn’t a big deal. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.21875
                },
                {
                    "author_link": "https://gov.optimism.io/u/daoism",
                    "index": "55",
                    "likes": "0",
                    "time": "15/10/2022-12:25:00",
                    "content": "Hardly surprising when the totality of their DeFi “experience” amounts to zero. This thread is a perfect example of why more robust selection processes should be in place for committees; the grownups support the proposal, whilst the “hallpass monitors” recommend against, mostly to maintain relevancy (and thus continue their grift for multiple salaries from multiple committees). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 7.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/alexcutlerdoteth",
                    "index": "56",
                    "likes": "0",
                    "time": "15/10/2022-14:34:32",
                    "content": "FWIW I actually suggested the committee seek to bring on some DeFi expertise prior to the vote. It seemed like it would be trivial to find folks in the ecosystem to join them. Rather than entertaining it, they launched a series blistering and inaccurate series of attacks on my project. Something that seems to be becoming a bit of a pattern for them as seen above.  x1560×398 47.5 KB  ",
                    "links": [
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/4/493432dd2f8e4886392e06c4db091c66afb5f25a.png"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.949999999999999
                },
                {
                    "author_link": "https://gov.optimism.io/u/Miroooooo",
                    "index": "57",
                    "likes": "0",
                    "time": "15/10/2022-17:36:58",
                    "content": "Is 200k OP going directly to the team? Are 16 addresses getting 100k OP? I guess that’s not your reason for supporting it ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.875
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPGovWatch",
                    "index": "58",
                    "likes": "0",
                    "time": "15/10/2022-17:49:07",
                    "content": "I’m sorry. I don’t follow. @_Max_plus clarified above that 200,000 OP is going to support development costs, but that the team is matching the same value in direct incentives. He also clarified that @OPUser was incorrect when he stated 16 addresses were getting 100,000 OP. That OP will be used for incentives on DEXs like Velodrome. That helped me understand why some delegates from the Shadow Committee and Committee A supported it over the despite the official recommendation. I wanted to clear the confusion. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.699999999999999
                },
                {
                    "author_link": "https://gov.optimism.io/u/Miroooooo",
                    "index": "59",
                    "likes": "1",
                    "time": "15/10/2022-18:16:41",
                    "content": "Parts of the grants are earmarked for development and R&D work and are difficult to assess and control. Makes people think this team, eeeeee, you know ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 2.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/theenlightened",
                    "index": "60",
                    "likes": "3",
                    "time": "15/10/2022-18:42:28",
                    "content": "My understanding of @OPUser’s position; he is saying 200k OP for development is like giving the project team free money to use at their discretion as they have full control as to how it will be used. And there is possibility of not using it for development. @OPGovWatch I hope you agree that that possibility exist? Well, this proposal is already on snapshot and most delegates would have voted, so the argument ‘could’ be medicine after death. General note: If I may ask, Is it possible that the community revisit the idea of allowing projects/proposals  the use of GF for development, maintenance and all that? I see it as giving free money to projects to use as they like and I believe there is that possibility for them using it for something other than development; my opinion though. Advice: I think Optimism Foundation or any other unit within Optimism should co-control any GF going for development/maintenance/audit etc. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.90625
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPGovWatch",
                    "index": "61",
                    "likes": "0",
                    "time": "15/10/2022-19:49:48",
                    "content": "I think every grant at our current stage requires a lot of trust in the grantees as insofar as I know there is no real monitoring or accountability mechanisms in place. Development funds aren’t unique in my eyes in terms of the risks of them being diverted or misused. That is just the inherent risk of our current system. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.34375
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "62",
                    "likes": "0",
                    "time": "15/10/2022-19:57:13",
                    "content": "to me the simple part of the answer is to make sure the dev grant is for a specific deliverable outlined in the proposal the more complicated part entails potentially staging funding for milestones or reducing asks to where the r/r on taking a risk on a team’s stewardship of funds is favorable (i.e., a known team gets more leeway than a less known one). we haven’t gotten there yet as a community but it’s a good one to review ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.851851851851851
                },
                {
                    "author_link": "https://gov.optimism.io/u/StrategicReserve",
                    "index": "63",
                    "likes": "0",
                    "time": "15/10/2022-20:17:40",
                    "content": "I do not see how you explaining you have a personal feud with Committee C gives you any credibility when disputing their recommendations. This is getting seriously tiresome. This absurd PVP power struggle between the “Shadow Committee” and Committee C is now using proposals as political footballs, as I predicted.  image1070×128 22.4 KB  Now it’s being dragged onto the forums in topics where a snapshot has already happened. Enough of this. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 4.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/alexcutlerdoteth",
                    "index": "64",
                    "likes": "0",
                    "time": "15/10/2022-21:12:54",
                    "content": "Ser - You seem to be the only person in these conversations not even trying to engage on the substance of the reviews and proposals. I haven’t seen you offer any feedback this round or actually detail what you like or don’t like the various proposals or recommendations. It’s like you are projecting this idea of a PVP power struggle because that is how you see the world while the rest of us are just trying (vigorously ofc) discuss the matters at hand. My advice would be to stop focusing on who is talking and start engaging with the substance of what they are saying. If you think TSC (officially coining that for the shadow committee) is writing biased reviews to win points for uh reasons (?), write your own review or a detailed response to theirs. That will go a much longer way in helping people see your POV than your endless innuendos of maleficence. I thought the note @jackanorak just posted on the Overtime proposal was a great example of that, detailing where he thought the official review missed things without once attributing any ill-intent to it’s authors. That is how you disagree in a constructive and positive-sum way. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.306818181818182
                },
                {
                    "author_link": "https://gov.optimism.io/u/StrategicReserve",
                    "index": "65",
                    "likes": "0",
                    "time": "15/10/2022-21:20:42",
                    "content": " I haven’t seen you offer any feedback this round or detail what you like or don’t like the various proposals or recommendations.  This has nothing to do with you being unprofessional and detrimental to the governance process. Trying to make it about “me” doesn’t change you engaging in a personal feud with Committee C, inappropriately.  My advice would be to stop focusing on who is talking and start engaging with the substance of what they are saying.  I just did. The substance of what you’re saying is awful. You should delete it and learn to live in a world where you can disagree with people respectfully.  image817×146 11.5 KB   I thought the note @jackanorak just posted on the Overtime proposal was a great example of that, detailing where he thought the official review missed things without attributing any ill-intent to its authors. That is how you disagree in a constructive and positive-sum way.  If you feel that way, then you should probably write that kinda stuff, too, rather than attempting to attack a committee’s credibility on a unrelated thread. You’re out of line. Stop posting your personal problems with Committee C. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5181818181818185
                },
                {
                    "author_link": "https://gov.optimism.io/u/alexcutlerdoteth",
                    "index": "66",
                    "likes": "0",
                    "time": "15/10/2022-21:38:56",
                    "content": "So even after all that, you’re just going to remain laser focused on attacking me rather than say using that energy engage in any ways substantively with the proposal here? Cool cool cool. I offered my perspective on the proposal (just as Katie did), responded only when OPUser twice attacked me for “gatekeeping” (still no idea what he meant), and then responded to @daoism suggestion that a lack of DeFi knowledge might be to blame for all the earlier misstatements. Until you actually start contributing something of substance to governance, I’m just going to assume you are the PVP troll you seem to accuse everyone else of being and do my best to ignore you. If I remain such a big trigger for you, I encourage you to do the same. I think people will appreciate not having to see garbage like this. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 6.025
                },
                {
                    "author_link": "https://gov.optimism.io/u/StrategicReserve",
                    "index": "67",
                    "likes": "0",
                    "time": "15/10/2022-21:48:30",
                    "content": " I think people will appreciate not having to see garbage like this.  You should probably just delete the post where you were out of line and get over it. I’m not asking for your diary. No one wants to see that. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPenthusiast",
                    "index": "68",
                    "likes": "1",
                    "time": "16/10/2022-07:46:23",
                    "content": "I support their proposal. Overnight has been a very transparent protocol with on chain tracking of their funds. The protocol has been launched on Optimism with a steady increase in TVL while incorporating many OP protocols. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.444444444444445
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "70",
                    "likes": "0",
                    "time": "20/10/2022-11:10:40",
                    "content": "I am voting against the proposal following the DeFi committee C recommendation. Especially strong push to no is closed source contracts. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.277777777777778
                },
                {
                    "author_link": "https://gov.optimism.io/u/_Max_plus",
                    "index": "71",
                    "likes": "0",
                    "time": "20/10/2022-11:34:45",
                    "content": "I will respond not to argue but for our reputation purposes: this point is where what I had written was profoundly misunderstood - I assume noone looked at the contracts per se. All contracts are verified, so open! There is one math-library that includes our proprietary methods for ETS portfolio rebalancing which we intend to keep confidential. Those are pure mathematical methods not affecting security of user funds. No portfolio manager (e.g. Gamma.xyz) would disclose their rebalancing algorithms; thats industry practice @lefterisjp ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.372023809523809
                },
                {
                    "author_link": "https://gov.optimism.io/u/SEED_LATAM_Joxes",
                    "index": "72",
                    "likes": "0",
                    "time": "21/10/2022-03:15:36",
                    "content": "[Final] Voting: Against Following our own DeFi C committee recommendation, we’re aware of the current status of Overnight, current usage and more. Also, we aren’t sure that 25% to build an insurance product for protocol itself is something that Phase 1 funds must do (100K) or would glad to read more details hereinafter. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.425000000000001
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "73",
                    "likes": "0",
                    "time": "21/10/2022-13:08:54",
                    "content": "Snapshot vote - not passed ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "74",
                    "likes": "0",
                    "time": "21/10/2022-13:08:57",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        },
        {
            "thread_link": "https://gov.optimism.io/t/review-gf-phase-1-proposal-overnight-fi-v2/3772",
            "title": "[REVIEW] [GF: Phase 1 Proposal] Overnight.fi V2 ",
            "index": 3772,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Governance Fund: Phase 1"
            ],
            "tags": [
                "season-2",
                "passed",
                "cycle-8"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/_Max_plus",
                    "index": "1",
                    "likes": "3",
                    "time": "23/10/2022-13:31:48",
                    "content": "This is the GF Phase 1 Proposal from the Overnight.fi  Protocol. The goal is to help push the adoption of Overnight.fi  innovative product line (yield generating stablecoin USD+ and delta-neutral ETS strategies) on the Optimism network. We took into account the community’s feedback from the previous voting cycle:  Grant funding not meant for development - development request excluded Clarity about co-incentives - 300K USD+ of co-incentives will be provided (10K USD+ per week over approximately 25 weeks on Velodrome, and additional 3.1K USD+ per week over 16 weeks of Balancer grant for Beets boosted pool) Clarity about ETS product promotion - Commitment to promote only uncapped ETS, starting with ETS ETH/USDC, will be incentivized by means of establishing and incentivizing a liquidity pool on Velodrome, thus making opportunity available to the entire community Grant amount request has been reduced from ˜370 USD to about 300K, the amount commensurate with co-incentives amount provided; The amount in OP -  400K OP total has been kept constant; Clarity about verification of contracts - all contracts are verified and by consequence open-source; 1 math-library, not relating to security of user funds, kept confidential in line with industry-practice not to disclose algorithms related to balancing delta-neutral strategies (e.g. Gamma.xyz)  Project name: Overnight.fi  Author name and contact info: Maxim Ermilov @wmermus, can be contacted through Telegram I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: Yes L2 recipient address: 0xe497285e466227F4E8648209E34B465dAA1F90a0 Grant category: Governance Fund Phase 1 Is this proposal applicable to a specific committee? [y/n, link to committee] Yes, DeFi Committee Project description (please explain how your project works): Overnight.fi  is the company behind stablecoin USD+. USD+ is USDC that pays you yield via daily rebase. It is 100% collaterized with high-quality stables (USDC, BUSD, USDT, DAI etc.) that are invested onchain into lowest risk no IL stable-to-stable strategies. The yield from farming is passed over to USD+ holders via rebase. The superpower of USD+ is its ability to pay yield in liquidity pools, thus maximizing capital efficiency of LP provision. Core usecases:  Treasury management Liquidity provision on Dexes (e.g. currently USDC/USD+ on Velodrome) Maximizing yield on projects’ own liquidity on DEXes (e.g. Sphere, OtterClam, Tetu, Parrotly, MDB etc paired against USD+ to receive yield from liquidity they maintain at DEXes)  In addition to USD+, Overnight is offering ETS (“exchange traded strategies” product line). ETS is a quasi-stable (some call it ‘delta-neutral’ strategy packaged inside a rebase token) that accepts USD+/USDC, uses it as collateral to borrow (hedge) a crypto asset on AAVE (or Granary), then farms crypto-to-stable pools. Currently, on OP there is already ETS ETH/USDC via Velodrome/AAVE and ETS OP/USDC via Velodrome/Granary in process of release. Overnight intends to make Optimism its ‘innovation hub’, i.e. the chain where all new products/approaches are developed, tried and launched ahead of other chains. Innovative products already implemented include:  ‘Self-bribing’ LP on Velodrome: USD+ yield from Velodrome LP pools automatically directed towards bribes on Velo Insurance (closed beta): Users are able to exchange risky asset, e.g. ETS ETH/USDC, for a combination of insured and uninsured tokens (tranches), with insured - redeemable for USD+ and uninsured - for OVN, Overnight’s governance token yet to be released -Additional ‘+’ products: DAI+  There is more in the pipeline. Project links:  Website: Overnight.fi   Twitter: Overnight_fi   Discord Community: Discord   Additional team member info (please link): Telegram: @wmermus LinkedIn: https://www.linkedin.com/in/maxim-ermilov/  Please link to any previous projects the team has meaningfully contributed to: N/A Relevant usage metrics (TVL, transactions, volume, unique addresses, etc. Optimism metrics preferred; please link to public sources such as Dune Analytics, etc.): Overnight went into open beta around May 1st, 2022 and, despite the timing coinciding with the UST crash, has been having great momentum, largely helped by increased risk aversion:  TVL has exceeded 8.5 M USD, x17 growth since UST crash in May (USD+ finalized closed beta and launched open beta on May 1st) number of users has exceeded 3.6K, i.e. x9 growth since May USD+ daily trading volumes have fluctuated in the range of 0.5-1M per day depending on market volatility, on average exceeding 14.5% of TVL, putting USD+ b/w BUSD and USDC on this metric, far ahead of most CDP stablecoins  The growth has been driven by:  Partnerships with Dexes, in particular, Dystopia/Penrose and Cone/Unknown, Velodrome Partnerships with other projects that chose to establish trading pairs with USD+: Lido (stMatic), Sphere, Tetu, OtterClam, MDB, Parrotly Finance etc. Launch of highly attractive (and profitable) product - ETS, a quasi-stable high-yield strategy product on top of USDC/ETH, USD+/wMatic and USD+/wBNB pools (with hedged crypto price-risk) Expansion to BSC and Optimism chains  Overnight entered Optimism about 2 months ago with the launch of USDC/USD+ and USD+/LUSD pools on Velodrome. Since then TVL has exceeded 4.6M with approximately 400 users. Total ‘bribing’ amount has been 3.5K USD+ per week, most from ‘self-bribing’ described above. Is/will this project be open sourced? Yes, all contracts are verified and by consequence open-source; 1 math-library, not relating to security of user funds, kept confidential in line with industry-practice not to disclose algorithms related to balancing delta-neutral strategies on Uni V3 (e.g. Gamma.xyz) Optimism native?: Overnight is Polygon native, however, most active part of Overnight community and TVL have migrated to Optimism already once we launched given better product terms on OP. Date of deployment/expected deployment on Optimism: Technical deployment - August 2022, commercial launch - first week of September 2022 Ecosystem Value Proposition:   What is the problem statement this proposal hopes to solve for the Optimism ecosystem? Building ideal DeFi product suite for crypto-winter and beyond: trustworthy, low-risk, decentralised asset management solution for passive stablecoin investors with minimum risk appetite in a convenient ‘stablecoin’ form factor  How does your proposal offer a value proposition solving the above problem? Overnight’s vision is to build ‘Vanguard of DeFi’ with (1) USD+ as a lowest risk product (equivalent of traditional money-market funds) and (2) ETF as a medium risk product (equivalent of ETF). Insurance product will play the central role in de-risking Overnight’s ecosystem of the structural DeFi risks Why will this solution be a source of growth for the Optimism ecosystem? Overnight is targeting risk-averse segment of DeFI (both individuals and treasuries), somewhat underserved segment, which, we believe, over time will overtake crypto-native segment of DeFI in volumes and revenue.  Has your project previously applied for an OP grant? Yes Number of OP tokens requested: 400,000 OP Did the project apply for or receive OP tokens through the Foundation Partner Fund?: No If OP tokens were requested from the Foundation Partner Fund, what was the amount?: NA How much will your project match in co-incentives? (not required but recommended, when applicable): USD+ will provide at least 300K USD+ in co-incentives by (1) channelling USD+ yield from liquidity pools with USD+ and ETS on Velodrome and Balancer to self-bribing and (2) allocating 50K USD worth of BAL received from Balancer for building boosted pool with USD+ on an L2 towards Beethoven’s USDC/DAI boosted pool. Proposal for token distribution:   How will the OP tokens be distributed? 250K for USD+  liquidity mining on Optimism (spread between Velodrome and Balancer). → This would grow USD+ liquidity on Optimism, but also increase liquidity for the protocols and pairs USD+ collateral is invested into (100% is invested on the same chain). Additional stablecoin yield maximizers with low risk appetite will join Optimism chain 150K for ETS liquidity mining on Optimism (via Velodrome) → This would grow ETS liquidity on Optimism, but also increase liquidity trading pairs underlying our ETS products, in particular, ETH/USDC and OP/USDC (100% is invested on the same chain). Additional stablecoin yield maximizers with low risk appetite will join Optimism chain   Over what period of time will the tokens be distributed for each initiative? approximately 25 weeks   Please list the milestones/KPIs you expect to achieve for each initiative, considering how each relates to incentivizing sustainable usage and liquidity on Optimism. First KPI will be exceeding 15M in TVL and 2000 users for Overnight overall Second KPI - exceeding 2M in TVL and 100 users for ETS products   Stablecoins like USD+ have considerable network effects. By reaching critical mass of TVL and users, powered by low risk, USD+ and Overnight will realize network effects and make Overnight sustainable on Optimism. Importantly, Overnight generates 'natural yield from its operations, which is partially directed towards USD+ and ETS pool incentives - this combination will make Overnight operation sustainable after rewards expire   Why will incentivized users and liquidity on Optimism remain after incentives dry up? Our overall approach is that Overnight products should be attractive without rewards (with rewards used essentially for promotion/marketing only):   USD+ and ETS rely on natural yield on the chain to generate yield for its users   USD+ model we are deploying on Optimisme is ‘self-bribing’, i.e. natural yield from USD+ and ETS in Velodrome and Beets core pools will support bribes beyond incentives   Please provide any additional information that will facilitate accountability:(smart contracts addresses relevant to the proposal, relevant organizational wallet addresses, etc.) All Overnight smart contract addresses on Optimism can be found here: Contract Addresses - Overnight Finance Docs (Beta))  We hope the Optimism community will help Overnight not just grow TVL, but push DeFI innovation forward and beyond. Optimism is ideal chain for building things that had not been tried before. Let us know if you have any feedback on the proposal! ",
                    "links": [
                        "http://overnight.fi/",
                        "http://overnight.fi/",
                        "https://optimistic.etherscan.io/address/0xe497285e466227F4E8648209E34B465dAA1F90a0",
                        "http://overnight.fi/",
                        "https://overnight.fi/",
                        "https://twitter.com/overnight_fi",
                        "https://discord.gg/fNZmqdrM2F",
                        "https://www.linkedin.com/in/maxim-ermilov/",
                        "https://docs.overnight.fi/advanced/contract-addresses",
                        "https://gov.optimism.io/t/defi-committee-c-season-2-recommendations/3437/15",
                        "https://gov.optimism.io/t/voting-cycle-8-roundup/3742/6"
                    ],
                    "GPT-summary": "The post is a proposal for the Governance Fund Phase 1 from Overnight.fi Protocol. The proposal aims to push the adoption of Overnight.fi's innovative product line on the Optimism network. The proposal includes details about the product line, usage metrics, and the value proposition for the Optimism ecosystem. The author explains the proposal in detail and invites feedback from the Optimism community. A 3rd party gives constructive criticism and extends to the proposal, while another 3rd party asks questions about the proposal.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Interoperability and Scaleability",
                        "Token economics",
                        "Community and engagement",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.602430808891484
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "2",
                    "likes": "0",
                    "time": "23/10/2022-18:39:45",
                    "content": " audit expense compensation  with your past experience, how many audit we are talking here? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://gov.optimism.io/u/_Max_plus",
                    "index": "3",
                    "likes": "0",
                    "time": "23/10/2022-18:43:23",
                    "content": "as requested, I was thinking 75K OP (our latest audit cost us 58K USD). But thats what I would like to discuss with you and other prior to the re-submission. this is not dev funding and easy to control, but I am not sure how that fits into the policy ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.558333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "4",
                    "likes": "1",
                    "time": "25/10/2022-12:43:02",
                    "content": "I’m a delegate w sufficient voting power Delegate Commitments - #136 by jackanorak and i think this is ready for a vote. My endorsement remains valid in the case of any sort of change (esp refinement) concerning dev costs. ",
                    "links": [
                        "https://gov.optimism.io/t/voting-cycle-8-roundup/3742/6"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/solarcurve",
                    "index": "5",
                    "likes": "1",
                    "time": "25/10/2022-15:35:51",
                    "content": "I am an Optimism delegate [Delegate Commitments - #42 by solarcurve ] with sufficient voting power and I believe this proposal is ready to move to a vote.  ",
                    "links": [
                        "https://gov.optimism.io/t/voting-cycle-8-roundup/3742/6"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Armads",
                    "index": "6",
                    "likes": "1",
                    "time": "01/11/2022-01:07:45",
                    "content": "Proposal looks solid to me. Overnight has incorporated their prior feedback and they have already launched and been operating smoothly on Optimism. Their contracts are transparent on chain for how funds are used and have a sustainable bribing mechanism on velodrome for multiple weeks already. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/ScaleWeb3",
                    "index": "7",
                    "likes": "0",
                    "time": "01/11/2022-10:22:44",
                    "content": "The Ask looks still quite large with 400K Op for a rather new project - ofc matched with good co-incentives. Distribution is much better w/ more specific liquidity incentives instead of funding internal development. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.4647495361781075
                },
                {
                    "author_link": "https://gov.optimism.io/u/_Max_plus",
                    "index": "8",
                    "likes": "0",
                    "time": "01/11/2022-11:02:47",
                    "content": "i know what you mean. we sized it the request to be 1:1 grant : co-incentives - which i believe is fair. OP has pumped since very nicely. i don’t know how to request it in a way that we achieve 1:1 match given our rewards are in stables and OP is volatile. Open to suggestions ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.4593750000000005
                },
                {
                    "author_link": "https://gov.optimism.io/u/ScaleWeb3",
                    "index": "9",
                    "likes": "1",
                    "time": "01/11/2022-11:56:43",
                    "content": "Ultimately agree and def would be more supportive of a 1:1 grant → 300K Op Ask. Generally been thinking about OP price & mcap in the following way (napkin math, very simplified)  Large sell pressure from all the incentives and potential future airdrops given out Growth of ecosystem, OP usage & investor mindshare will offset some-most of the sell pressure There is a bottom price that larger investors may pick up based on interesting FDV (0.5$?) Tech expansion & economics advances, overall move to l2, short-term narratives can lead to (deserved?) price breakouts to 2-5$ but will be sold off by Op recipients so that price fluctuates around ≈1$ while marketcap grows towards FDV.  For proposals, we’d expect to follow more or less the following template  Current Price  30-day TWAP should be pretty fair, updated when it moves to voting 7-day TWAP at payout day would be better; but would require Ask in USD & Foundation input   Comparable Proposals / Project Size / Return for the Optimism ecosystem  -10K USD: Instant grants for small tools, bounty work, etc. 10K-50K USD: Small grants for teams/startups/dev funding 50-300K USD: Growth program for early-stage, smallcap project with significant value-add 300K-1M USD: Onboarding top teams/projects, co-initiatives w/ significant growth expectations 1M+ USD: Exceptional growth opportunities    Obv would be great to judge proposals purely by outcomes but many are early stage, public goods, nice-to-have tools and outcomes will be multi-dimensional (team, liquidity, user, building block onboarding, etc.). Really looking forward to more data like this, this and this for learnings from past initiatives but you’d need to control again for all the projects (Galxe’s temporary OP Quest boost, Internal Settlement TXs, etc.) ",
                    "links": [
                        "https://dune.com/optimismfnd/optimism-project-deep-dive",
                        "https://dune.com/optimismfnd/Optimism",
                        "https://gov.optimism.io/t/scaleweb3-delegate-communication-thread/3314/15"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.03265306122449
                },
                {
                    "author_link": "https://gov.optimism.io/u/_Max_plus",
                    "index": "10",
                    "likes": "2",
                    "time": "01/11/2022-12:49:28",
                    "content": "@OPUser @ScaleWeb3 We were targeting the 300K USD as amount of grant with 1:1 co-incentives. With the recent OP pump we would be willing to bring the grant amount down to 300K OP and keep the same co-incentives. % allocation b/w initiatives would stay the same. It is a 1 minor change caused by the market. it would be great for the proposal still be considered in this cycle. From recent gov-channel discussions, I think the committee has the power to act of its own accord in such a matter. @solarcurve @jackanorak Gentlemen, would you be willing to endorse the change? thank you ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.77020202020202
                },
                {
                    "author_link": "https://gov.optimism.io/u/solarcurve",
                    "index": "11",
                    "likes": "3",
                    "time": "01/11/2022-13:18:53",
                    "content": "As a delegate in the Optimism Collective, I endorse it  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "12",
                    "likes": "3",
                    "time": "01/11/2022-14:07:51",
                    "content": "endorsement still stands. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "13",
                    "likes": "1",
                    "time": "01/11/2022-18:21:48",
                    "content": "Hey guys I love this project I just have one concern about this. As of today, you have 3 ETS distributing OP tokens. All 3 ETS have 33 users in total. I’m concerned this ETS distribution will end up in a few addresses contrary to what I think it’s healthy. Is asking for an APY % distribution where the user count is considered too much? Something like: 10 users 5% APY 20 uses 10% APY If not (which is totally understandable) can we lower this to 2 months and come back with some metrics? It won’t look good if we finish this 6 months period and see all these OP tokens distributed to 33 addresses only. I love the project and I want to see it thrive I’m just concerned about user/distribution ratio. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.1
                },
                {
                    "author_link": "https://gov.optimism.io/u/_Max_plus",
                    "index": "14",
                    "likes": "0",
                    "time": "01/11/2022-19:19:32",
                    "content": "thank you for the question. we are just launching ETSes on OP and expect the # of users in the 100s. The biggest constraints to growth so far, have been, actually, the performance of USD+ itself, which has outperformed ETS in yield (which is not normal and will change as OP ecosystem matures) and depth of liquidity for relevant attractive underlying pairs. we are solving both issues by launching today the ETS based on Uni V3 (via Arrakis) -  “Night over arrakis”. It is delta-neutral strategy aimed at providing liquidity to ETH/USDC 0.05% pool with rewards by Arrakis/Uni/OP. It is quasi-stable strategy with target 15-20% yield, which people are already queuing for. it is deep and long enough for the ETS to acquire 100s of happy users. We have no doubt there will be major demand (enough to ask people in our discord). There is also a ‘waiting list’ of 40+ addresses. Next week, we will launch another Arrakis-based ETS for ETH/DAI liquidity provision. We can guarantee that everyone will have access to this product and rewards: we have established a stable pool on Velo: USD+/ETS that will (1) use the yield to self-bribe (2) will be the only channel used to distribute grant rewards. So everyone will be guaranteed access and it wont become an ínsider deal’. Responding to your questions more specifically: linking APY and # of users can be done, but incentives via pool on Velo would, imho, be more effective and natural way to balance supply and demand; Regarding metrics, we have put in the proposal ‘Second KPI - exceeding 2M in TVL and 100 users for ETS products’. if we dont exceed 1M TVL and 100 users within 2 months, we would be happy to stop the grant program and return the remaining part of the grant related to ETS. But i am certain that wont happen. Hope i have addressed your questions. if not, please let me know ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.187946428571429
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "15",
                    "likes": "0",
                    "time": "01/11/2022-19:30:41",
                    "content": "    _Max_plus:  we would be happy to stop the grant program and return the remaining part of the grant related to ETS   Can you add this condition to the proposal? you have my full support. Nonrelated: Have you considered ETH/OP pool as a quasi-stable strategy? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.916666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/_Max_plus",
                    "index": "16",
                    "likes": "1",
                    "time": "01/11/2022-20:08:59",
                    "content": "I think the committee has the power to integrate that in the decision. It would be horrible if we had to go to another voting cycle because of this modification Eth/OP is actually not a quasi-stable. It is a very volatile pair. Also OP’s liquidity (and consequently opportunity to hedge, cost of impermanent loss ) are not good, to put mildly. All this makes a delta-neutral product based on this pair uncompetitive. I honestly think some of the grants should be put forward to  improve OP’s liquidity: how could aave have received the grant and not accept OP as collateral… Or Uni V3 be incentivizing pools with ETH and not OP… This really escapes me. Once the prerequisites are in place we would love to do the ETSes based on OP pairs ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.302083333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "17",
                    "likes": "1",
                    "time": "01/11/2022-20:21:38",
                    "content": "    _Max_plus:  I think the committee has the power to integrate that in the decision. It would be horrible if we had to go to another voting cycle because of this modification   This is fair. (I feel you on the horrible feeling about going to another cycle)     _Max_plus:  Eth/OP is actually not a quasi-stable. It is a very volatile pair.   I assume you are considering this pair volatile against USD right? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.321428571428571
                },
                {
                    "author_link": "https://gov.optimism.io/u/_Max_plus",
                    "index": "18",
                    "likes": "1",
                    "time": "01/11/2022-20:34:18",
                    "content": "Against each other as well. There is certainly quite a bit of IL in that pair. It is correlated, but not closely enough. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.148809523809524
                },
                {
                    "author_link": "https://gov.optimism.io/u/_Max_plus",
                    "index": "19",
                    "likes": "1",
                    "time": "02/11/2022-06:19:54",
                    "content": "@OPUser For the sake of record:  The grant request is 300K OP Co-incentives match - 300K USD    How will the OP tokens be distributed? 175K for USD+ liquidity mining on Optimism (spread between Velodrome and Balancer). → This would grow USD+ liquidity on Optimism, but also increase liquidity for the protocols and pairs USD+ collateral is invested into (100% is invested on the same chain). Additional stablecoin yield maximizers with low risk appetite will join Optimism chain 125K for ETS liquidity mining on Optimism (via Velodrome) → This would grow ETS liquidity on Optimism, but also increase liquidity trading pairs underlying our ETS products, in particular, ETH/USDC and OP/USDC (100% is invested on the same chain). Additional stablecoin yield maximizers with low risk appetite will join Optimism chain  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.166666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "20",
                    "likes": "1",
                    "time": "02/11/2022-13:55:00",
                    "content": "Given that two delegate(s) are on-board with updated token ask and distributed plan. We would like to consider this proposal in current cycle, please share your thoughts if you think otherwise. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "21",
                    "likes": "2",
                    "time": "03/11/2022-14:10:00",
                    "content": "Recommendation from DeFi committee C Details The proposal describes Overnight’s yield-bearing stablecoin and yield strategies. The re-submitted proposal focuses more clearly on liquidity for the existing products. Value-Add The USD+ stablecoin is 100% collateralized with other stablecoins that are invested on-chain in “low-risk strategies” such as LPing on stables, lending & more. The integration of another yield-generating stable in the Optimism ecosystem can have benefits for Optimism users. With additional incentives, Overnight can add liquidity to key pairs on Optimism and improve efficiency - long-term effectivity & sustainability are yet to be seen for this relatively new project. Traction Overnight is an early stage project that initially attracted liquidity on Polygon and BSC but moved most liquidity to Optimism. It has gathered a total TVL of more than $8+ Mio since its launch on Optimism in early September. The yield strategies have decent APYs but they are so far capped at 100K and have only a few users. Yields will likely go down with higher TVL amounts. Overnight does not have all the contracts public, it has closed open source portfolio rebalancing algorithms behind ETS until at least the public sale of the OVN governance token. Amount 300K OP : Okay for a relatively new project with value-add where long-term functionality & efficiency is yet to be proven:  175K OP for liquidity mining of USD+ (stables) 125K OP for liquidity mining of ETS+ (USDC-ETH, OP-USDC)  Co-incentives 300K USD+ Alignment Overnight has moved towards Optimism and is integrating with Op projects. KPIs Reasonable KPIs but Optimism should also look at the value-added from the additional TVL TVL = 15m USD Users = 2000 Recommendation : YES Our past recommendation is available on committee recommendation thread ",
                    "links": [
                        "https://gov.optimism.io/t/defi-committee-c-season-2-recommendations/3437",
                        "https://gov.optimism.io/t/defi-committee-c-season-2-recommendations/3437/15"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.428844900619094
                },
                {
                    "author_link": "https://gov.optimism.io/u/_Max_plus",
                    "index": "22",
                    "likes": "1",
                    "time": "03/11/2022-14:28:01",
                    "content": "Thank you for the review and recommendation ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "23",
                    "likes": "0",
                    "time": "03/11/2022-20:13:42",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "24",
                    "likes": "0",
                    "time": "03/11/2022-20:48:33",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/katie",
                    "index": "25",
                    "likes": "0",
                    "time": "06/11/2022-02:27:49",
                    "content": "Voted yes - I voted yes for this proposal in the previous round and I’m happy to support it again.  Thank you to the Overnight team for resubmitting. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.722222222222221
                },
                {
                    "author_link": "https://gov.optimism.io/u/_Max_plus",
                    "index": "26",
                    "likes": "3",
                    "time": "06/11/2022-11:59:35",
                    "content": "Thank you, Katie, for both votes! Afterwards, I will try to structure my feedback on the process. As with any process there are many ways to improve, but one thing I must stress: it has been way more transparent and predictable than anything we had experienced across many other chains so far ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.482142857142858
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "27",
                    "likes": "1",
                    "time": "09/11/2022-13:19:54",
                    "content": "Voting YES following committee recommendation. Happy to see the updated proposal and happy to finally vote YES here!     OPUser:  The proposal describes Overnight’s yield-bearing stablecoin and yield strategies. The re-submitted proposal focuses more clearly on liquidity for the existing products. Value-Add The USD+ stablecoin is 100% collateralized with other stablecoins that are invested on-chain in “low-risk strategies” such as LPing on stables, lending & more. The integration of another yield-generating stable in the Optimism ecosystem can have benefits for Optimism users. With additional incentives, Overnight can add liquidity to key pairs on Optimism and improve efficiency - long-term effectivity & sustainability are yet to be seen for this relatively new project. Traction Overnight is an early stage project that initially attracted liquidity on Polygon and BSC but moved most liquidity to Optimism. It has gathered a total TVL of more than $8+ Mio since its launch on Optimism in early September. The yield strategies have decent APYs but they are so far capped at 100K and have only a few users. Yields will likely go down with higher TVL amounts. Overnight does not have all the contracts public, it has closed open source portfolio rebalancing algorithms behind ETS until at least the public sale of the OVN governance token. Amount 300K OP : Okay for a relatively new project with value-add where long-term functionality & efficiency is yet to be proven:  175K OP for liquidity mining of USD+ (stables) 125K OP for liquidity mining of ETS+ (USDC-ETH, OP-USDC)  Co-incentives 300K USD+ Alignment Overnight has moved towards Optimism and is integrating with Op projects. KPIs Reasonable KPIs but Optimism should also look at the value-added from the additional TVL TVL = 15m USD Users = 2000 Recommendation : YES   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.622551270278543
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "28",
                    "likes": "0",
                    "time": "14/11/2022-17:02:58",
                    "content": "Snapshot vote - passed ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "29",
                    "likes": "0",
                    "time": "14/11/2022-17:03:11",
                    "content": "@_Max_plus can you provide a Telegram handle or other contact method so the Optimism team can get in touch about paying out this grant! Feel free to comment on this thread, DM, or email palash@optimism.io ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.609375
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "30",
                    "likes": "0",
                    "time": "14/11/2022-17:03:13",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "267"
}