{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/draft-gf-phase-1-proposal-izumi-finance/3303",
            "title": "[DRAFT] [GF: Phase 1 Proposal] iZUMi Finance ",
            "index": 3303,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Governance Fund: Phase 1"
            ],
            "tags": [
                "cycle-6"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/iZUMi",
                    "index": "1",
                    "likes": "14",
                    "time": "15/08/2022-07:05:19",
                    "content": "Project Name: iZUMi Finance Author Name: Eco Team (iZUMi Finance community member) Number of OP tokens requested: 300,000 L2 Recipient Address: 0x4D9EB5BE0aE58D5a6c32A816702d89af8AE7a096 Relevant Usage Metrics  Screenshot 2022-08-16 at 9.26.12 AM1218×368 16.4 KB  Over time, iZUMi Finance has accumulated more than ten million levels of TVL across the four chains. It is worth mentioning that through the double mining activities, iZUMI Finance brought 80% of the USDC/USDT pool on Uniswap V3@Polygon, and LiquidBox on Arbitrum hit $16M TVL in 24 hours. Optimism alignment iZUMi Finance is a multi-chain DeFi protocol providing One-Stop Liquidity as a Service (LaaS), with innovatively designed liquidity mining modules of the “Concentrated liquidity mining” model for stable assets with a fixed price and “Dynamic Range” model for non-stable tokens. These structured models would support any blockchain project to better implement liquidity incentives with much higher capital efficiency and enable liquidity providers to earn extra rewards. Optimism effectively reduces costs and increases accessibility as one of the largest Layer 2 protocols. It brings convenience to users, and this concept is well integrated with iZUMi Finance. We want to integrate Layer 2 and at the same time, we can help optimistic accumulate more TVL by using double rewards liquidity mining campaigns. As the largest liquidity mining platform in the Uniswap V3 ecosystem, iZUMi Finance already accounts for up to 80% of the USDC/USDT pool on Uniswap V3@Polygon. LiquidBox on Arbitrum hits $16M TVL in 24 hours. Therefore Optimism can also leverage its partnership with the iZUMi Finance platform to open trading pairs like ETH-USDC, and USDT-related stable trading pairs on Uniswap V3@Optimism. We can build a faithful community to sustainably boost Optimism and run with a good level of liquidity in the future. ##Proposal for token distribution How will the OP tokens be distributed? Liquidbox of iZUMi Finance will distribute OP tokens to liquidity providers to incentivize liquidity and usage of Optimism How will this distribution incentivize usage and liquidity on Optimism? OP tokens will be 100% allocated to liquidity providers as mining incentives to help boost APR and abstract TVL. Why will the incentivized users and liquidity remain after incentives dry up? Due to the feature of the high capital efficiency of UniswapV3, liquidity providers can still obtain more commission income even without incentives compared to the V2 model. In addition to that, Izumi Finance has experienced no security issues. Several institutions also audit it. Users can still retain the money without security issues. Over what period of time will the tokens be distributed? iZUMi Finance will seek to incentivize growth on Optimism sustainably. The double rewards incentive mining campaign is expected to run for eight to twelve months. The exact period of distribution will depend on when the proposal gets passed. How much will your project match in co-incentives? iZUMi Finance is targeting to migrate 20 million TVL to Optimism in order to expand the ecosystem. Besides, iZUMi Finance will provide iZi as incentives to help OP boost APR. In this case, the pool becomes more attractive for the liquidity provider. iZUMi Finance Docs: https://docs.izumi.finance/ ",
                    "links": [
                        "https://docs.izumi.finance/"
                    ],
                    "GPT-summary": "The post is a draft proposal for iZUMi Finance, a multi-chain DeFi protocol providing One-Stop Liquidity as a Service (LaaS). The proposal explains how the project plans to distribute OP tokens to incentivize liquidity and usage of Optimism, a Layer 2 protocol. The post also mentions the success of iZUMi Finance in accumulating TVL and its partnership with Optimism. A 3rd party could give entirely positive feedback on the proposal, extend to the proposal, or ask questions about it.",
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Token economics",
                        "Interoperability and Scalability",
                        "Community and engagement",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 6.051344086021505
                },
                {
                    "author_link": "https://gov.optimism.io/u/MinimalGravitas",
                    "index": "2",
                    "likes": "0",
                    "time": "15/08/2022-07:33:30",
                    "content": "Looking at your page on DeFiLlama (iZUMi Finance: TVL and stats - DefiLlama) the useage of your dApp on both Polygon and Arbitrum rose quickly but then dropped back to very little. Why do you think this was and why would the patturn be different on Optimism? Also, can you confirm where you are with regards to deploying on Optimism, are you live here yet? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.688289141414141
                },
                {
                    "author_link": "https://gov.optimism.io/u/iZUMi",
                    "index": "3",
                    "likes": "1",
                    "time": "16/08/2022-02:39:03",
                    "content": "Hey MinimalGravitas! Thanks for your attention. The data source comes form DefiLIama (iZUMi Finance: TVL and stats - DefiLlama) and iZUMi Finance (iZiSwap Analytics). Firstly, the time of liquidity mining campaign conducted on Polygon and Arbitrum is too short to maintain the LPs. Therefore, we have adjusted the duration to 8 - 12 months for Optimism for this time. In this case, we can bring more lasting TVL to Optimism. Secondly, pools on Polygon and Arbitrum are dominated by stablecoins which have low yield. The proposal will also adjust it on Optimism. ",
                    "links": [
                        "https://analytics.izumi.finance/dashboard"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.678571428571429
                },
                {
                    "author_link": "https://gov.optimism.io/u/0xSilence",
                    "index": "4",
                    "likes": "0",
                    "time": "22/08/2022-12:52:53",
                    "content": "Nice to see iZUMi finance will do something on Optimism. I ues iZUMi Finance for few month, I am very impressed with its LiquidBox model, maybe this means iZUMi is about to start supporting the OP network? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.0625
                },
                {
                    "author_link": "https://gov.optimism.io/u/BaboBit",
                    "index": "5",
                    "likes": "0",
                    "time": "22/08/2022-13:03:29",
                    "content": "I did some research about iZUMi, and I wanna say its a good thing about a decent protocol such as iZUMi wanna get in touch with the optimism, I would like to see it happen. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.444444444444444
                },
                {
                    "author_link": "https://gov.optimism.io/u/Willson",
                    "index": "6",
                    "likes": "0",
                    "time": "22/08/2022-13:10:40",
                    "content": "I think this proposal will bring optimism get into more promising dapp ecosystem, and get more potential Defi users. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/ArthurLee",
                    "index": "7",
                    "likes": "0",
                    "time": "22/08/2022-13:21:04",
                    "content": "Will you bring more liquidity mining pools on optimism? If this proposal successful, I just wanna have more choice on optimism network. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.916666666666668
                },
                {
                    "author_link": "https://gov.optimism.io/u/iZUMi",
                    "index": "8",
                    "likes": "0",
                    "time": "23/08/2022-09:12:35",
                    "content": "Cool! Thank you for the compliment on LiquidBox! We are working hard to improve our products, and there will be more activities in the early OP. Stay tuned! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 6.100260416666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/iZUMi",
                    "index": "9",
                    "likes": "0",
                    "time": "23/08/2022-09:19:19",
                    "content": "Sure, we want to bring more liquidity on optimism by dual reward farming. Welcome to be the liquidity provider! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.333333333333332
                },
                {
                    "author_link": "https://gov.optimism.io/u/Jack_CC",
                    "index": "10",
                    "likes": "0",
                    "time": "23/08/2022-09:31:51",
                    "content": "A good news in this bear market, I really interested in the combination of izumi and optimism. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.375
                },
                {
                    "author_link": "https://gov.optimism.io/u/MarcoB",
                    "index": "11",
                    "likes": "0",
                    "time": "23/08/2022-09:36:41",
                    "content": "Had a Great and splendid experience while using the iZUMi, It’ll be great if thier request is granted, I believe they’ve a whole lot of positive contribution to make in the space. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.860606060606061
                },
                {
                    "author_link": "https://gov.optimism.io/u/0xSilence",
                    "index": "12",
                    "likes": "0",
                    "time": "23/08/2022-09:40:41",
                    "content": "Thanks for reply, I am very much looking forward to the passage of this proposal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.15
                },
                {
                    "author_link": "https://gov.optimism.io/u/Elena102",
                    "index": "13",
                    "likes": "0",
                    "time": "24/08/2022-07:58:08",
                    "content": "I kind of think innovative Defi protocol like iZUMi can bring long term value to Optimism, maybe its time to find out. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/Ghada",
                    "index": "14",
                    "likes": "0",
                    "time": "24/08/2022-08:07:46",
                    "content": "I saw izumi’s TVL and volume remain stable and growing in the bear market, maybe the cooperation with OP is a good attempt.  44970×135 10.3 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/TinaJohnson",
                    "index": "15",
                    "likes": "0",
                    "time": "24/08/2022-08:24:48",
                    "content": "Have read izumi’s docs, their LaaS and DL-AMM model is very different from other dex. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.6875
                },
                {
                    "author_link": "https://gov.optimism.io/u/Alisson",
                    "index": "16",
                    "likes": "0",
                    "time": "26/08/2022-08:44:12",
                    "content": "LiquidBox, interesting, I gonna try it in other network first ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.041666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/Shawki",
                    "index": "17",
                    "likes": "0",
                    "time": "27/08/2022-14:22:57",
                    "content": "If izumi support optimism and launch stablecoin farming on op network, that would be great. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Netrim",
                    "index": "18",
                    "likes": "3",
                    "time": "27/08/2022-14:37:47",
                    "content": "So many new accounts that simply give empty praise and no questions. Feels like the clipper thread all over again. Update your main post to include period of distribution, method of distribution and a clear cut answer of matching incentives. ETH pairs are fine, will you be reserving some of the OP to incentivize OP pairs? Since distribution is going to happen overtime, are you aware that you should not self delegate under the new Operating Manual V.2? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.892255892255892
                },
                {
                    "author_link": "https://gov.optimism.io/u/iZUMi",
                    "index": "19",
                    "likes": "1",
                    "time": "06/09/2022-03:56:21",
                    "content": "Hi Netrim, thanks for your reply. Our period of distribution is 8-12 months, and OP tokens will be given out as incentives during the dual rewards farming program, which are mentioned in the proposal. Because we want to contribute to OP ecosystem, we will also incentive OP pairs. We would be grateful if there are delegates recommend our project  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "20",
                    "likes": "0",
                    "time": "12/09/2022-23:59:09",
                    "content": "Thanks for the proposal! If you plan to have this reviewed in Voting Cycle 6, can you please specify which committee should review your proposal (NFTs and Gaming, Tooling, or DeFi) under the grant category field in the updated proposal template for Cycle 6? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/iZUMi",
                    "index": "21",
                    "likes": "0",
                    "time": "14/10/2022-07:53:03",
                    "content": "Hi Lavande, our proposal belongs to DeFi～ ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "22",
                    "likes": "1",
                    "time": "14/10/2022-13:28:52",
                    "content": "Great! There is a new proposal template here that you’ll need to use which will have you specify DeFi as your committee. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.840909090909091
                }
            ]
        }
    ],
    "group_index": "208"
}