{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/draft-gf-phase-1-proposal-via-protocol-via-exchange/3811",
            "title": "[DRAFT] [GF: Phase 1 Proposal] Via Protocol / Via Exchange ",
            "index": 3811,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Governance Fund: Phase 1"
            ],
            "tags": [
                "cycle-8"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/Alpha_Omega_Cat",
                    "index": "1",
                    "likes": "14",
                    "time": "26/10/2022-11:56:40",
                    "content": "Project Name: Via Protocol Author name and contact info: Matt | Via Protocol (Discord), Alpha_Omega_Cat (Telegram) I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: Yes. L2 Recipient Address: 0x1A27cdf069F2E8cc5b77b72BeA43851086aF5D83 Which Voting Cycle are you applying for? cycle-8 Grant category: Tooling / DeFi Is this proposal applicable to a specific committee? Tooling Project description: Via is a cross-chain liquidity aggregator that aims at solving much of the complexity of living in a multichain world by providing cheap, fast, and seamless any-to-any token swaps with a polished and intuitive interface with all info about built routes in one modal menu. Via Protocol is composed of two products: Via Router, Via SDK. Via Router Via performs any-to-any swaps within 30 seconds after automatically scanning over 70 DEXs across 25 networks and 25 of the most popular cross-chain bridges. Unlike other aggregators, Via can automatically detect the fastest and cheapest swap routes, as well as let users sort swapping solutions by various criteria, including security. Finally, Via integrates Refuel for gas transfers across chains, which can further smoothen cross-chain operations. Via SDK Via has an SDK with plenty of ready-to-go and in-development phase integrations. Examples are Safe (ex-Gnosis Safe), Rubic, XY Finance, Rango, Pillar, Frontier, Trust Wallet, etc. Thanks to the Via SDK, these dApps enable their users to swap tokens effortlessly without having to use third-party solutions and interfaces. Via Protocol is a cross-chain solution that stands out from the crowd thanks to the many measures taken to improve transparency and security. While Via’s security ultimately depends on the underlying bridges it carefully selects, there are some proactive measures that the team is taking to minimize risk for their users:  Active surveillance. Via employs watchdogs who monitor the transactions of all aggregated bridges and automatically disable those victims of hacks and those whose liquidity has dried up. Track record. In the Via interface, users can see, for each swapping solution and related bridge, the success rate for the last ten transactions, as well as information about previous hacks or lack of liquidity. Transparency. Via interface shows, for each available swapping solution and bridge, the degree of decentralization (fully centralized, semi-centralized, centralized), the number of audits that the bridge has undergone, and the presence of a centralized relayer in the route. Smart sorting. All the security metrics that Via collects and displays are grouped together and used as criteria to filter among all available routing solutions, for an advanced sorting system that prioritizes security while guaranteeing a trouble-free user experience.  Project links: Discord [Via Protocol] Twitter [https://twitter.com/via_protocol] GitHub [Via Protocol · GitHub] Main Website [https://via.exchange/] Medium [Via Protocol] Gitcoin [Via - UX-first one-stop DEX & Bridges aggregator | Grants | Gitcoin] Additional team member info (please link): Serafim Korablev (CEO) [https://twitter.com/SerafimCloud] Daniil Okhlopkov (CTO) [https://twitter.com/danokhlopkov] Please link to any previous projects the team has meaningfully contributed to: Via team members have worked at or on some of these projects: Lido, zkSync, ClearPool, Polkadot, and Eywa. Relevant Usage Metrics: (TVL, transactions, volume, unique addresses, etc.) https://metabase.via.exchange/public/dashboard/eb85d5b6-6e03-4784-929d-a6ab1729a963 Only Optimism Stats: November → January  16,000 Unique Optimism Users → 30,000 32,000 Optimism txs → 100,000 $158,000,000 Optimism Total Volume → 440,000,000  All Stats (all networks):  ~50,000 Unique Users → >80,000 ~100,000 Tx → 300,000 Bridges supported: 25 Networks / Chains: 25 DEXs: 70 → 72 Providers: 5 → 6  Competitors, peers, or similar projects: LiFi, Socket, Rango. Is/will this project be open-sourced? Yes, the Cross-Chain Router (B2C app), the router SDK, are all open-source and available at [Via Protocol · GitHub] Optimism native? Not, but OP users already account for almost a third of the total unique users on Via router. Date of deployment/expected deployment on Optimism: September 2021 Ecosystem Value Proposition: What is the problem statement this proposal hopes to solve for the Optimism ecosystem? Despite its exceptional technical performance, Optimism still lacks behind some L2s and other scaling solutions for the number of users, transaction volumes, and TVL. Of course, those numbers are steadily growing, but we think the root cause of this is the lack of an easy, fast, and cheap swapping solution between Optimism and other blockchains. Via can help Optimism reach mass adoption faster by providing a user-friendly entry point. How does your proposal offer a value proposition for solving the above problem? Thanks to its suite of cross-chain solutions, Via Protocol can support Optimism’s push to mass adoption by making it easy for individual users and dApps to connect to Optimism and its vibrant ecosystem:  Router. Since Optimism is already supported by the router, Via is already contributing to providing a top-notch swapping solution for individual users who want to access, and interact with, the Optimism ecosystem. Router SDK. By integrating the SDK directly, Optimism can further push adoption by being a great tool for integration into your dApp for a better UX  Why will this solution be a source of growth for the Optimism ecosystem? Overall, Via can help Optimism’s push for mass adoption by providing cheap, fast, and intuitive swapping solutions from any chain with any token, thus ensuring a superior user experience and lowering barriers to entry in the Optimism ecosystem for any user and dApp in a short time. Thanks to its SDK, Via is uniquely well-positioned to connect OP to other protocols and dApps directly, making the onboarding of users even faster. Has your project previously applied for an OP grant? No Number of OP tokens requested: 250,000 Did the project apply for or receive OP tokens through the Foundation Partner Fund? No If OP tokens were requested from the Foundation Partner Fund, what was the amount? N/A How much will your project match in co-incentives? Via will start our own campaign and will add ~20% of the requested money in USDC. And an additional 10% to 90% of the value of the rewards to users for initiative number two. How will the OP tokens be distributed? Via will distribute 100% of the incentives to users. All incentives will be airdropped at the end of each month, and will be distributed through the following two initiatives: 1- 30% (75,000 $OP) - Swap Gas refunds for trades on Via router, for as long as there is money. 2- 70% (175,000 $OP) - Long-term stimulation for users to bridge to Optimism. Will be only available for bridging to Optimism ETH, Stable Coins, or OP (should be discussed). Over what period of time will the tokens be distributed for each initiative? 1 - Based on the number of swaps on the Router, and will be distributed every month at the end of the month, ~28-30th. It will last as long as OP incentives are available. 2 - Will be released at the same time as initiative number 1, and will last as long as OP incentives are available. Please list the milestones/KPIs you expect to achieve for each initiative, considering how each relates to incentivizing sustainable usage and liquidity on Optimism. #1 Gas Refunds  Amount of Gas Refunds (users): >50,000  #2 Long-Term Plan  Users bridged: 50,000 Volume of bridged asset: 50,000,000 Number of new users tried/ used/ deposited on Optimism: 25K Connect our SDK to at least 3 projects and bridge them to OP  Why will incentivized users and liquidity on Optimism remain after incentives dry up? ‘Come for the incentive. Stay for the network.’ This is what we think will happen. Thanks to Optimism’s grants, Via will be able to attract a lot of new users to Optimism and the amazing projects in its vibrant ecosystem, as the incentives it provides will let users try Optimism nearly for free. Optimism offers a fast-pace growing ecosystem of apps, most of which are already tested and trusted on Ethereum, for a fraction of the fees. All this, while inheriting the security of Ethereum itself. Via, for its part, provides users with the best routes in terms of speed, fees, and security. Also, Optimism can be used in Advanced Routes as a cheap and high-liquidity transit to other chains (this function is currently available only on Polygon and BNB). According to our data and research, providing an easy onboarding is effective in driving stable adoption, and these are some of the projects that users became accustomed to use after trying them through Via suite of products: Stargate, Aave aUSDC, Pika v2 and v3, SNX Pools and Dept, Rubicon, Uniswap pools (USDC-DAI), Clipper Exchange Pool, Across Protocol Pool, Velodrome Pool, Sonne, Quiotix. Once discovered the endless possibilities of Optimism, and supported by Via’s suite of swapping tools, users will choose to stay. ",
                    "links": [
                        "https://twitter.com/via_protocol",
                        "https://github.com/viaprotocol",
                        "https://via.exchange/",
                        "https://medium.com/via-exchange",
                        "https://gitcoin.co/grants/4665/via-protocol",
                        "https://twitter.com/SerafimCloud",
                        "https://twitter.com/danokhlopkov",
                        "https://metabase.via.exchange/public/dashboard/eb85d5b6-6e03-4784-929d-a6ab1729a963",
                        "https://github.com/viaprotocol"
                    ],
                    "GPT-summary": "The post is a proposal for a cross-chain liquidity aggregator called Via Protocol. The author explains the project's features, including Via Router and Via SDK, and how it can help the Optimism ecosystem reach mass adoption faster. The post also includes relevant usage metrics, competitors, and milestones/KPIs. A 3rd party gives entirely positive feedback on the proposal, extending to it, and advertising it. The author does not ask for feedback or collaboration explicitly.",
                    "GPT-proposal-categories": [
                        "Interoperability and Scalability",
                        "Token economics",
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party is advertising proposal"
                    ],
                    "Sentiment": 5.898869097263592
                },
                {
                    "author_link": "https://gov.optimism.io/u/Alpha_Omega_Cat",
                    "index": "2",
                    "likes": "0",
                    "time": "29/10/2022-18:22:40",
                    "content": "I hope to receive some comments about the proposal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/serafim",
                    "index": "3",
                    "likes": "4",
                    "time": "31/10/2022-14:59:00",
                    "content": "Hello everyone. I’m the CEO of Via Protocol. We love this idea of funding all infrastructure to help a whole chain to be friendly. I think our approach in the proposal will significantly push bridging to Optimism in the next couple of months. We will do our best to make OP the most UX-friendly. We are live on 25 networks, but OP has the most significant volume, and we want to push this number even further up with your help, guys. We are open to any questions regarding the proposal. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.650568181818182
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "4",
                    "likes": "1",
                    "time": "02/11/2022-11:02:16",
                    "content": "Is it possible to promote only transaction bridging into Optimism and not those going out? I’ll try the product and come with more feedback but if we want this:     Alpha_Omega_Cat:  Come for the incentive. Stay for the network   Then incentivizing only one way bridge could be good? Did you try this aproach before? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party advertising proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.2
                },
                {
                    "author_link": "https://gov.optimism.io/u/SEGSGSG",
                    "index": "5",
                    "likes": "0",
                    "time": "02/11/2022-11:03:39",
                    "content": "Great proposal, go go go go ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Alpha_Omega_Cat",
                    "index": "6",
                    "likes": "2",
                    "time": "02/11/2022-11:36:32",
                    "content": "    Gonna.eth:  Then incentivizing only one way bridge could be good? Did you try this aproach before?   1 - Yup, but I think it is better to have a new user who could possibly stay in the op, not those who will leave the op with some liquidity from it. 2 - The one-way bridge incentivizing is the only way we can do it. But, I did mention in the proposal that we will support some op native apps, with which we will have some connections in future campaigns. So it is not just “bridge for the reward” campaign, more like “bridge, try ecosystem, decide to stay”. It will work only for those who will use op for the first time and will do some activity in those new apps. And nope, I did not try this before. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.010330578512397
                },
                {
                    "author_link": "https://gov.optimism.io/u/Nikky",
                    "index": "7",
                    "likes": "0",
                    "time": "02/11/2022-11:36:38",
                    "content": "I give this 3 word smooth fast easy ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.722222222222223
                },
                {
                    "author_link": "https://gov.optimism.io/u/calman",
                    "index": "8",
                    "likes": "1",
                    "time": "02/11/2022-11:52:52",
                    "content": "Via is the best aggregation bridge I have ever used, both in terms of speed and cost, compared to other bridges or bridge aggregations, it has great advantages. I hope that Via can join Op’s incentive plan and receive corresponding token rewards, so as to bring more subsidies to our users, such as gas cost subsidies in the cross-chain process. I am looking forward to good news. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party or author is advertising proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.395833333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/VinsonQAQ01",
                    "index": "9",
                    "likes": "0",
                    "time": "02/11/2022-12:33:21",
                    "content": "    calman:  Via is the best aggregation bridge I have ever used, both in terms of speed and cost, compared to other bridges or bridge aggregations, it has great advantages.   Via is the best aggregation bridge I have ever used, both in terms of speed and cost, compared to other bridges or bridge aggregations, it has great advantages.I wish you a good news. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party is advertising proposal"
                    ],
                    "Sentiment": 7.892857142857142
                },
                {
                    "author_link": "https://gov.optimism.io/u/xiaoh",
                    "index": "10",
                    "likes": "0",
                    "time": "02/11/2022-13:32:41",
                    "content": "love users, users will love you too! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.8125
                },
                {
                    "author_link": "https://gov.optimism.io/u/susine",
                    "index": "11",
                    "likes": "0",
                    "time": "02/11/2022-14:42:02",
                    "content": "Great idea！I’m with you ! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/zakili",
                    "index": "12",
                    "likes": "0",
                    "time": "06/11/2022-08:48:06",
                    "content": "Via is a good aggregation bridge; ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/Mazzy",
                    "index": "13",
                    "likes": "0",
                    "time": "28/11/2022-02:56:49",
                    "content": "Yes, VIA is one of my most used bridges. no doubt it’s worth it ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Boomer",
                    "index": "14",
                    "likes": "0",
                    "time": "28/11/2022-02:56:50",
                    "content": "A great proposition, via is one of the best bridges i use. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/Alpha_Omega_Cat",
                    "index": "15",
                    "likes": "0",
                    "time": "27/01/2023-12:39:52",
                    "content": "I hope to receive some comments about the proposal in the new Season. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.681818181818182
                }
            ]
        }
    ],
    "group_index": "311"
}