{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/draft-gf-phase-1-proposal-cycle-8-optimism-merch-shop/3828",
            "title": "[Draft] [GF: Phase 1 Proposal Cycle 8] Optimism Merch Shop ",
            "index": 3828,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Governance Fund: Phase 1"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/Zeptimus",
                    "index": "1",
                    "likes": "3",
                    "time": "28/10/2022-17:41:30",
                    "content": " Project name Optimism Merch Shop  Author name and contact info Zeptimus - DAO Advocate - | Zeptimus#3359 | Telegram: @ZeptimusQ Tomislav Mamić - PM | Discord: tomo#9038 | Telegram: @tomislavmamic Griff Green - Founder - griff@giveth.io | Discord: griff (, )#8888 | Telegram: @griffgreen  I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: Yes  L2 recipient address 0xc8d65e1bd67f16522e3117b980e1c9d2caeb9dc3 (generalmagic.eth)  Which Voting Cycle are you applying for? 8  Grant category  Is this proposal applicable to a specific committee? Tooling committee  Project description General Magic will create and maintain an online portal that allows for the sale of officially branded Optimism DAO and/or Optimism merchandise for public purchase and global fulfillment. We’ll design your merch shop to be in-line with your brand guidelines, and work with you to decide exactly what types of merch you would like to offer. Shop will accept fiat and crypto payments. Bank cards will be accepted through Stripe, which complies with Payment Card Industry Data Security Standards (PCI-DSS). Purchases in ERC20 tokens on the Optimism chain (or any other EVM chain) are possible directly from the customer’s wallet (Metamask, Trust wallet, WalletConnect). The shop will offer only high quality merchandise for both sexes and/or unisex in sizes S through 2XL, when possible and applicable. Merchandise will be sourced through Printful. Eco-friendly merchandise from sustainable sources will be prioritized. Our team can either help train anyone from Optimism to run the store, or we can manage day-to-day operations and customer service ourselves. Scope & Design In the first phase of the project, we’ll define detailed project requirements, including: visual requirements, branding, types and designs of merchandise, fulfillment, legal and administration, sourcing, supported payment methods and currencies, customer support needs, and additional features and integrations. General Magic will then design the shop according to requirements, and work with you to decide exactly what types of merchandise you would like to offer. Development In the development phase, we’ll build and deploy the Optimism Merch Store. The deployment will include integrations with our merch fulfillment partner, and payment gateway integration. General Magic will build the website using a CMS (Wordpress), up to the design specifications of Optimism, and host using a third party Wordpress hosting provider. The shop will include all types of merch that your team requires and will be fulfilled by a dropshipping provider (eg. Printful). We will allow customers to pay with fiat or crypto, and we can even have a special custom “merch token” created just for ordering swag (if desired). Launch In the launch phase, we’ll do a final QA test (both internally and with members of Optimism community), leading up to the launch of the Optimism Merch Store. General Magic will test various payment methods; (including “merch tokens” if required, fiat payments and test orders). General Magiccan also potentially promote your products on our other swag stores e.g. Commons Stack & Giveth. Ongoing support General Magic offers two options for ongoing support. 1) We can train a team from the Optimism community to run the store on their own. 2) We will continue ongoing maintenance and support for the Optimism Merch Store. Ongoing maintenance will have an extra cost that can be covered by a maintenance fee and shared profits. Ongoing maintenance includes ensuring there are no issues with the website, and customers are satisfied with their orders. We will integrate a Live Chat platform (so that users can reach out directly), and this will create a ticket in our system that our team will follow up with in a timely manner (within 24/hours). General Magic offers full- service product, governance, and crypto-economic systems design for Impact DAOs. We’ve helped build and grow public goods projects such as Giveth, Commons Stack, Token Engineering Commons, clrFund, DAppNode, Ethereum Name Service (ENS) and more. With deep roots in the Ethereum ecosystem, the General Magic team has Web3 professionals for virtually any need your DAO has! Project links:  Website: https://www.generalmagic.io/  Twitter: https://twitter.com/Generalmagicio  Discord/Discourse/Community: General Magic    Ecosystem Value Proposition We believe that creating different economic agents around a community drives its value. This will create a convenient and comfortable method to support Optimism by buying merch and carrying swag in your day-to-day life or at conferences.  Please link to any previous projects the team has meaningfully contributed to: Aragon 1hive xDai - now Gnosis Chain Commons Stack Token Engineering Commons ENS  Relevant usage metrics (TVL, transactions, volume, unique addresses, etc. Optimism metrics preferred; please link to public sources such as Dune Analytics, etc.) We are not a protocol, so we can not share such information. However, here’s a link for some of the swag shops we have already created. General Magic Giveth Commons Stack ENS  Is/will this project be open sourced? Yes we are radically open source.  Optimism native? General Magic will deploy the merch shop on Optimism.  Date of deployment/expected deployment on Optimism: Three months after this grant passes,we will share updates of each deliverable on this thread for accountability during the process.  Has your project previously applied for an OP grant? No  Number of OP tokens requested 40,000 $OP  Did the project apply for or receive OP tokens through the Foundation Partner Fund? No  If OP tokens were requested from the Foundation Partner Fund, what was the amount? 0  How much will your project match in co-incentives? (not required but recommended, when applicable) N/A  Proposal for token distribution We will convert the token to stablecoins as soon as the grant is received as we need to pay for salaries. The profits generated by the store will go back to the community treasury. ",
                    "links": [
                        "https://twitter.com/Generalmagicio",
                        "https://discord.gg/YDzmCC2qhJ",
                        "https://aragon.org/",
                        "https://1hive.org/",
                        "https://www.gnosischain.com/",
                        "https://commonsstack.org/",
                        "https://tecommons.org/",
                        "https://ens.domains/es/",
                        "https://swag.generalmagic.io/",
                        "https://swag.giveth.io/",
                        "https://shop.commonsstack.org/#/",
                        "https://ensmerchshop.xyz/"
                    ],
                    "GPT-summary": "The proposal is for General Magic to create and maintain an online portal for the sale of officially branded Optimism DAO and/or Optimism merchandise for public purchase and global fulfillment. The post provides details on the project description, scope and design, development, launch, and ongoing support. The proposal has not previously applied for an OP grant and is requesting 40,000 $OP tokens. The post also includes links to previous projects the team has contributed to and mentions that the project will be open-sourced.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Privacy, Security and risk management",
                        "Token economics",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.734039802789804
                },
                {
                    "author_link": "https://gov.optimism.io/u/tomislav",
                    "index": "2",
                    "likes": "3",
                    "time": "02/11/2022-13:42:58",
                    "content": "Hey, Optimism Collective! We are excited to propose building a merch shop for Optimism. Branded merch is in high demand in web3 space. It’s a way to engage and grow your community. Good merch is a great conversation starter and motivation for outsiders to start learning about what you do. We think Optimism is worth learning about. It has a cool tech, and should have cool swag. This is why we propose building customised merch shop for Optimism that would make it possible for Optimism to:  design and create cool and interesting merch sell merch to those that want to buy it give away merch to those that want it make special merch, claimable under specific conditions deliver merch to anyone anywhere showcase how capable Optimism is to handle modern ecommerce and much more.  We would build your shop with attention to your ecosystem and potential for integrations and collaboration. Your community is welcome to participate in managing the shop and proposing cool features, integrations or merch campaigns. We are looking forward to hearing from you! General Magic team ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.732410714285715
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "3",
                    "likes": "2",
                    "time": "08/11/2022-22:43:25",
                    "content": "Hey guys. Thank you for the proposal. So if I understand correctly your proposal is to create a merch shop for optimism like you have done for ENS and others, right? And you are asking for $40,000 OP to do that? Can you please provide a breakdown of how these funds will be spent? This would be really important to evaluate the grant. Also I guess the Optimism foundation itself has a lot of swag already and perhaps they got their own ideas about a merch shop so they probably should also be consulted. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.482142857142858
                },
                {
                    "author_link": "https://gov.optimism.io/u/tomislav",
                    "index": "4",
                    "likes": "4",
                    "time": "10/11/2022-19:59:00",
                    "content": "Thanks for your questions @lefterisjp! We tried to answer as concise as possible:     lefterisjp:  So if I understand correctly your proposal is to create a merch shop for optimism like you have done for ENS and others, right?   Yes! You got it right, in the design and the scope we will work with the optimism community and the optimism foundation as you are recommending. We would create the OP shop with all the features that we have already built for others and with additional customizations specifically made for OP. We would work with the Foundation to make the merch shop go hand in hand with their efforts to promote OP. In our planning we would take in broader plans and activities of the Foundation to propose and build features to the shop that would compound those activities or make them easier to do. Such as making it possible to claim OP merch if you have OP POAPs. Such features could be:  To make the shop only work with Optimism (users have to bridge to Optimism to get swag) Users could only buy swag with the Optimism token or a custom token Users could claim or buy swag when completing Optimism quests (maybe users get an NFT first and then they get access to get swag or at least list getting swag as a quest) We could also customize the merch itself to be NFTs from quests or any other Optimism native project Users could claim or buy swag if they hold OP Foundation issued POAP at the event  Our proposal is also not a one time transaction. We would update the shop throughout the first year, whenever we develop a fitting new feature for any of our shops. We can train Foundation staff for managing the shop or, if desired, take on this task ourself, relieving the Foundation of the burden of managing the merch shop successfully. Whether the goal is set as profitability, quantity of merch claimed, or something else. Managing the shop entails assigning a shop manager to manage the day-to-day operation of the shop potentially including:  customer inquiries, reporting bugs and issues bulk orders suppliers and fulfillment managing existing products and adding new products finding and testing new types of merchandise, materials and suppliers curation and pricing payments, cancellations and reimbursements onboarding new sellers managing merch approvals by DAO checking artwork submissions for plagiarism managing disputes representing customers in front of service providers      lefterisjp:  And you are asking for $40,000 OP to do that?   As mentioned, we don’t expect to deliver the final product once, and be done with it. If we want to get people to use the shop, we need to bi intentionaly responsive to their requests and changes in the environment. For example, we launched ENS Merch Shop with just one item that was personalized for each individual as this was expected to be the most sought item. Then we plan to introduce more drops that will be integral with their participation in different events, or will be related to special ENS occasions. This means that the “the shop creation” is actually more of a “shop lifecycle” that requires continuous care and effort.     lefterisjp:  Also I guess the Optimism foundation itself has a lot of swag already and perhaps they got their own ideas about a merch shop so they probably should also be consulted.   That is correct. The Optimism Foundation does a great job with the merch, and we would love to help their efforts. With our help, the Foundation could focus on making decisions, and leave the implementation to us.     lefterisjp:  Can you please provide a breakdown of how these funds will be spent? This would be really important to evaluate the grant.   Here is our cost breakdown:     Deliverable Estimated work quantity Cost $OP     Detailed product requirements documentation including rough mockups, launch plan for the first version, and a plan of merch drops 5 person-days $2,400   Branding and other visual assets, Figma prototypes and high fidelity designs, for mobile and desktop 10 person-days $4,800   Development 20 person-days $9,600   3rd party integrations 5 person-days $2,400   QA, fixes and improvements 10 person-days $4,800   Launch with combined marketing effort at a major event (eg. ETH Denver) 10 person-days $3,600   Monthly support (ongoing shop management, customer service, order fulfillment and technical support) for 6 months 12 person-days $4,320   New features implementation over 6 months 17 person-days $8,160        Subtotal product development 66 person-days $32,160   Subtotal support and marketing 22 person-days $7,920   TOTAL  $40,080     ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.826556324110673
                }
            ]
        }
    ],
    "group_index": "316"
}