{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/draft-gf-phase-1-proposal-pacoca/3514",
            "title": "[DRAFT] [GF: Phase 1 Proposal] Pa\\xc3\\xa7oca ",
            "index": 3514,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Governance Fund: Phase 1"
            ],
            "tags": [
                "cycle-6"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/deejay",
                    "index": "1",
                    "likes": "2",
                    "time": "21/09/2022-06:08:19",
                    "content": "Project name: Paçoca Author name and contact info: Deejay: General Manager | @deejay I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: Yes. L2 recipient address: 0x0552e3a7BFAe95F1aE7Ceb1BEd4d7d5Eec38AE2A Grant category: Tooling Is this proposal applicable to a specific committee? Yes, Tooling Committee ([DRAFT] S02 Committee Proposal: Tooling Governance Committee) Project description: Paçoca is a DeFi one-stop service. We provide a multi-chain portfolio manager to track users’ assets staked in different DeFi projects in EVM-based blockchains such as Ethereum, BNB Chain, Fantom, Polygon, Avalanche, and Optimism. Our portfolio manager provides a broad and centralized view of DeFi assets across all chains. Users can track their vaults staking, LP details, borrowing- lending status, odd to win a lottery, NFT, tokens, and asset allocation within a single page. Aside from a portfolio manager, Paçoca has an automated yield optimizer on the BNB chain and a multi-chain DEX, where users can trade with these best deals and rates across all markets. Additional team member info: Salt: BD and Marketing Director | Telegram: Contact @PacocaSalt Relevant usage metrics: Defillama Stats TVL: $4.3M Transactions: 2,293,315 Unique Addresses: 11,191 Integrations so far: 147 platforms across 6 blockchains Competitors, peers, or similar projects: Apeboard (Ape Board | Multi-chain DeFi Dashboard) Debank (https://debank.com/) Zapper (https://zapper.fi/) Zerion (https://zerion.io/) Is/will this project be open-sourced? The project is partially open source. Optimism native?: No Date of deployment/expected deployment on Optimism: We have already begun platform integrations. Ecosystem Value Proposition: Optimism has grown in the DeFi and NFT space, mainly thanks to its last phases of funding. With over 60 DeFi protocols and nearly $1bn in TVL, It lacks the choices in tooling options. That’s where Paçoca comes in. We’re a free portfolio tracker that fosters partnerships with projects to optimize integration for their users. This BD-focused variation results in us working with all-scale projects. Whereas most portfolio trackers offer nothing to smaller projects, purely focusing on what’s the most popular and often not having the capacity or focus on Partnerships for more meaningful integrations. Paçoca boasts a strong Business Development team allowing for over 140+ partnerships so far.  1200×630 183 KB  For Moonpot, a DeFi no-loss lottery that provides APY, Paçoca shows your earnings waiting to collect and your odds of winning each lottery.  1600×1288 179 KB  For Venus Protocol, Paçoca shows your portfolio and position so that you can check your liquidation status, borrow balance, and supply balance summarized on our dashboard. We enrich the space. Having Paçoca on your chain is a positive synergistic element. We start by giving DeFi projects a quality partnership they can explore, resulting in more refined marketing opportunities and a helpful tool their community can use and dig. Working together, Paçoca creates a foundation for deeper collaborations such as collaborating to build new tools such as with Apeswap to build their Apestats page (ApeSwap Partners with Paçoca to Launch New ApeStats Page | by ApeSwap.finance | Aug, 2022 | Medium) or providing introductions to other projects. With this approach, Paçoca is an aggregator of all DeFi projects on your chain and builds a network. This network acts as leverage to intro projects we’ve worked on in the past, facilitating partnerships that prolong the longevity of projects in the Optimism space. Initially, a partnership starts by integrating the DeFi protocol into our Portfolio Tracking. Through our app, the project’s DeFi users can easily invest in multiple protocols without the hassle of having to go to each staking. On our website, you can review a holistic view of his portfolio, tracking even staked assets, staked NFTs, and many custom products such as Treasury Bills and others. This custom and personal attention to detail allow unparalleled tracking with built-in tools at 0 of the developer costs. Paçoca will also be the source of growth for Optimism through its approach with the proposed Optimism grant. Instead of distributing free tokens as an incentive for staking, which often sees a lack in throughput of conversions to long-term and loyal users, Paçoca suggests an alternate solution. We plan on selling Optimism coins for PACOCA-BNB LP, meaning the tokens given to us will be bought by users, not given away for free, introducing more BNB users to Optimism through Paçoca. The Optimism coins will be offered at a discount but vested over time, providing a real opportunity for users to commit funds to explore the optimism chain. With this introduction, we will also primarily focus on Optimism integrations. Using the foundational partnerships proposed, our socials will be full of DeFi protocols on the newly-tracked Optimism chain. These integrations are paired with AMAs in our community, exposure on socials such as our Twitter, and teasers. With the introductions of other platforms, we can convert BNB chain users to Optimism more successfully.   Incentivizing them to buy Optimism coins at a discount rate   Exposing them to many DeFi protocols on the Optimism chain, providing them with a list of potential opportunities to invest in   Inviting Projects to come to our community and speak about their protocol, providing them with a stage for OP-rich users looking to invest their new Optimism coins.   Number of OP tokens requested: 150,000 How much will your project match in co-incentives? Not Applicable as our coin is on the BNB chain, and we will give rewards on the Optimism chain. Proposal for token distribution:  30% (45k) will go to subsidizing integrations into our Portfolio tracker for projects, covering developer and BD efforts that go into these partnerships that the project partner usually burdens. Instead, the grant will subsidize the development costs and allow them to happen faster and on a bigger scale. 70% (105k) will be sold as treasury bills to BNB users. Treasury bills are purchased by swapping LP tokens on the BNB chain to receive discounted vested OP. These will unlock over time. Purchasers of these tokens are a more loyal audience to Optimism.  Over what period of time will the tokens be distributed for each initiative?  30% will be distributed over 8 weeks 70% will be distributed over 6 months  Please list the milestones/KPIs you expect to achieve for each initiative, considering how each relates to incentivizing sustainable usage and liquidity on Optimism.   Paçoca’s first KPI will be based on its integrations. We plan on integrating the top 30 DeFi protocols on Optimism and continue beyond the proposal to include as many as possible, including maintaining the database as these protocols evolve and staying up to date with the latest projects launching. We will then provide co-marketing for each integration and exposure to our community.   Paçoca’s second KPI is based on treasury bills sold. We plan on selling all 70% of Optimism coins to BNB users, easily to be tracked by how many treasury bills have been minted. By selling OP at a discount over a vested period, we’re offering an attractive offer to our existing LP stakers. They have an opportunity to earn more than their current APY by trading in their LP for these tokens. By buying them from Paçoca, they retain their perceived value; whereas incentivizing a vault would typically provide free tokens, the discounted tokens are included in the vesting period. It is assumed that users purchasing OP tokens this way are more likely to explore opportunities on the OP chain.   Why will incentivized users and liquidity on Optimism remain after incentives dry up? Paçoca is effectively targeting users from two angles: The first is the attractive offer of trading in LP tokens that they’ve been staking on our protocol for a chance to earn faster. We’ll sell OP tokens in a product called Treasury bills. These treasury bills will provide its holders with OP tokens over a vesting period. Purchasers of these represent an audience of primarily veteran DeFi users that explore liquidity providing rather than single asset staking. Additionally, by vesting OP tokens, purchasers spend a longer time on the Optimism chain. This is where we take advantage and lean on our educational mechanics to convert them. These educational mechanics are our second vector for conversion. Part of the proposed tokens is subsidizing integrations into our portfolio tracking, done by partnering with projects. These integrations are followed by teasers, social media takeovers, giveaways, and AMAs, introducing a laundry list of DeFi Optimism projects that users can explore with their vested OP tokens as they become unlocked. Projects will be invited to speak about their opportunities to this highly segmented user base through AMAs and introduced to them through our social media. Even after incentives finish, Paçoca will continue integrating more projects and maintaining the previous integrations, meaning that we’re here to stay with Optimism. As for treasury bills, this is an endeavor we can continue providing, given that the Optimism team is keen to continue. Project links:  Website: https://pacoca.io  Twitter: https://twitter.com/pacoca_io  Telegram: Telegram: Contact @pacoca_io  Docs: https://docs.pacoca.io/   ",
                    "links": [
                        "https://t.me/PacocaSalt",
                        "https://defillama.com/protocol/pacoca",
                        "https://apeboard.finance/dashboard",
                        "https://debank.com/",
                        "https://zapper.fi/",
                        "https://zerion.io/",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/b/b5b2aed826bc2209be7626ef4ebbea769cd06fbf.png",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/0/0691b6cce1433fd6a6be73df99d194635015fb04.jpeg",
                        "https://ape-swap.medium.com/apeswap-partners-with-pa%C3%A7oca-to-launch-new-apestats-page-4c0a2023cfc8",
                        "https://pacoca.io",
                        "https://twitter.com/pacoca_io",
                        "https://t.me/pacoca_io",
                        "https://docs.pacoca.io/"
                    ],
                    "GPT-summary": "The post is a proposal for a DeFi one-stop service called Paçoca. The author explains the project, its features, and its benefits for the Optimism ecosystem. The post also includes relevant usage metrics, information about competitors, and a proposal for token distribution. A 3rd party gives entirely positive feedback on the proposal, extending to the proposal, and advertising it. There are no negative feedback or constructive criticism in the post.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Interoperability and Scaleability",
                        "Board composition",
                        "Community and engagement",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 6.049567681422521
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "2",
                    "likes": "3",
                    "time": "23/09/2022-21:30:19",
                    "content": "Hello, I got some initial questions on the project:  It seems you have a token. Why does a portoflio tracking tool need a token? How does it work? What does partially open source mean? Please point us to your github where the source code is. Seems you have a strong BD focus? Why does an opensource (partially or not) portfolio tracker need a BD focus?  Questions on distribution:  we plan on selling Optimism coins for PACOCA-BNB LP, meaning the tokens given to us will be bought by users, not given away for free,  So you plan to get the OP tokens from the grant, and sell 70% of them to buy your token’s LP? This does not seem like it benefits optimism in any way.  30% (45k) will go to subsidizing integrations into our Portfolio tracker for projects, covering developer and BD efforts that go into these partnerships that the project partner usually burdens. Instead, the grant will subsidize the development costs and allow them to happen faster and on a bigger scale.  How will paying for integrations into your product help optimism? I don’t currently see it.  These educational mechanics are our second vector for conversion. Part of the proposed tokens is subsidizing integrations into our portfolio tracking, done by partnering with projects. These integrations are followed by teasers, social media takeovers, giveaways, and AMAs, introducing a laundry list of DeFi Optimism projects that users can explore with their vested OP tokens as they become unlocked. Projects will be invited to speak about their opportunities to this highly segmented user base through AMAs and introduced to them through our social media.  This sounds like a lot of bla bla for “marketing”, something which I am not convinced will work for such a project in the optimism ecosystem. Looking forward to your reply to clear up my questions. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.028676470588235
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "3",
                    "likes": "2",
                    "time": "24/09/2022-09:45:09",
                    "content": "Thank you this detailed proposal. I agree the one-stop staking service does have a use case. Please help me with few points.     deejay:  We plan on selling Optimism coins for PACOCA-BNB LP, meaning the tokens given to us will be bought by users, not given away for free, introducing more BNB users to Optimism through Paçoca   So if i understood it correctly, my LP pair will stay on BNB chain but I can buy $OP on OP chain on a discounted price, right ? Why is this limited to your native token pair ? What about stable or eth pair ?     deejay:  Incentivizing them to buy Optimism coins at a discount rate   How this will work out ? Will it be fixed discount or depend on value of your LP pair ?     deejay:  Not Applicable as our coin is on the BNB chain, and we will give rewards on the Optimism chain.   Will it be possible to give reward on both chain ? As long as I hold the LP pair, during this campaign, instead of giving 10% discount on $OP, give 5% on $OP and other 5% on BNB. Amount of token bought is still same, but distribution will be longer with matching co-incentives from your side. Those number are just an example. and echoing @lefterisjp comment on “partial open source” ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5163690476190474
                },
                {
                    "author_link": "https://gov.optimism.io/u/Bobbay_StableLab",
                    "index": "4",
                    "likes": "2",
                    "time": "26/09/2022-02:30:23",
                    "content": "I echo the comments made above. It sounds like much fluff that ultimately favours your project more than it supports your project and the Optimism Ecosystem.  You could match co-incentives in another manner no? How will payment for your BD team reduce the burden on the project partner? Do you have examples of previous grants you have applied for?  The token distribution is skewed and needs a revamp IMO. Apeboard is now called Nansen portfolio too. New features aren’t added to the former.     deejay:  We will then provide co-marketing for each integration   Will this come from the op token distribution? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.264069264069264
                },
                {
                    "author_link": "https://gov.optimism.io/u/deejay",
                    "index": "5",
                    "likes": "1",
                    "time": "28/09/2022-16:38:56",
                    "content": "Hey Left, I hope that this clears up your questions: Q: It seems you have a token. Why does a portoflio tracking tool need a token? How does it work? As we are not backed by any VCs, we initially created our token as a way to incentivize users’ deposits on $PACOCA vaults, naturally generating performance fees, increasing the overall health and the runway of the project. $PACOCA token works in a standard way; it’s an ERC-20 token on the BSC chain, feeless, where users can trade using regular slippage (0.1-0.5-1.0%). Q: What does partially open source mean? Please point us to your github where the source code is. We use the expression partially open source as we’ve a public github repository, where we share our contracts, APIs, features being developed, public subgraphs, and more, but our back and front-end are private. Here is our public repo: Pacoca.io · GitHub Q: Seems you have a strong BD focus? Why does an opensource (partially or not) portfolio tracker need a BD focus? A strong BD focus allows us to build relationships with the projects we integrate. This lets us understand their product at a deeper level and integrate all of their solutions rather than just their staking vaults which is what other portfolio trackers do at the moment. Meaning the most unique and innovative DeFi products don’t get tracked from your typical portfolio trackers. It also allows us to build a network of DeFi projects, provide introductions, and make greater relations. Q: So you plan to get the OP tokens from the grant, and sell 70% of them to buy your token’s LP? This does not seem like it benefits optimism in any way. We are effectively a salesman for Optimism. We’re directly selling OP coins to our BSC community, this directly benefits Optimism by introducing stakers and new lifeblood into the blockchain which is ultimately the goal of any blockchains. We can sell the OP tokens for anything using treasury bills, it doesn’t have to be Liquidity providers, we however chose liquidity providers because they are an essential piece in having a liquid chain. By targeting this segment of our community we can bring quality users that ultimately have a higher conversion to providing liquidity on Optimism. I disagree with the statement that this doesn’t benefit Optimism in any way, we’re bringing in new users that aren’t familiar with the chain. Unlike simply boosting a vault with free coins we’re selling OP coins to our community rather than giving them away, which means in the long run they’ll retain their value better because users had to buy them. Q: How will paying for integrations into your product help optimism? I don’t currently see it. Portfolio trackers are an essential tool for Defi. As you grow the DeFi sector of Optimism, one of the blockers or rather discouraging factors for investors for staking and exploring multiple protocols is that it becomes difficult to track your assets as they are scattered. By subsidizing integrations we can spend the dev efforts required to track even the most intensive protocols. We currently have 25,601 unique addresses of users that already use our tracker because they find it valuable, and this is just from May 2022 to now. If DeFi users find our tool valuable that means it’s beneficial to have as a tool for Optimism users. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.631546442687747
                },
                {
                    "author_link": "https://gov.optimism.io/u/deejay",
                    "index": "6",
                    "likes": "1",
                    "time": "28/09/2022-16:42:02",
                    "content": "Hey OP, appreciate your feedback. We’re more than glad to help. Q: So if i understood it correctly, my LP pair will stay on BNB chain but I can buy $OP on OP chain on a discounted price, right ? Why is this limited to your native token pair ? What about stable or eth pair ? We initially plan to sell $OP to our community for PACOCA-BNB, since we’re trying to convert as many of our users into Optimism users, our LP is the easiest way to target a high quality group of DeFi audience that is closely in-tune with what we do. However, that doesn’t restrict us to introduce new LPs if the community wishes for other assets as well. The smart-contract that we will use for these bills allow us to buy any token from the community. Q: Incentivizing them to buy Optimism coins at a discount rate How this will work out ? Will it be fixed discount or depend on value of your LP pair ? No fixed discounts. We will use a decay algorithm that will dynamically change the price of a bill based on a few variables: - bill price = control variable * (current debt / total supply of OP) - control variable is a policy team defined value that will tell how rapidly the price of a given bill will change, if you’re familiar with Olympus DAO, it’s the Bond Control Variable (BCV). This value is tuned every time a user buys a new bill, which will make the discount increases or decreases, as the policy team wishes - current debt is the current amount of tokens due by the contract Q: Not Applicable as our coin is on the BNB chain, and we will give rewards on the Optimism chain. Will it be possible to give reward on both chain ? As long as I hold the LP pair, during this campaign, instead of giving 10% discount on $OP, give 5% on $OP and other 5% on BNB. Amount of token bought is still same, but distribution will be longer with matching co-incentives from your side. Those number are just an example. and echoing @lefterisjp comment on “partial open source” As the discount is not based on fixed rate, but live calculated by a smart contract, I’m afraid that’s not possible. Let me know if these answers are what you were looking for! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.309941782355575
                },
                {
                    "author_link": "https://gov.optimism.io/u/deejay",
                    "index": "7",
                    "likes": "1",
                    "time": "28/09/2022-16:45:28",
                    "content": "Hey Bobbay, that’s not what we’re looking for with this proposal. I hope that these answers clears you up a bit about this: Q: You could match co-incentives in another manner no? We are matching incentives with development efforts in this sense. We’re happy to discuss other ways to match it but we’re already agreeing with this proposal to create a Treasury Bill feature and create new integrations with Optimism as our focus rather than other chains. For your knowledge, one of the tougher integrations such as integrating Curve protocol takes a week of work (and we’ve been doing this for over a year now, so we’re not slow by any means). It’s also worth noting that we are matching some of the incentives with our own token in comarketing events to promote the integrations. Q: How will payment for your BD team reduce the burden on the project partner? Usually we take a fee for deeper integrations which allows us to build cool unique features for different projects, the payment would go to our developers to cover the development efforts required to provide integrations. We would not require any fees from project partners, and provide all integrations for free if the project is on Optimism. Q: Do you have examples of previous grants you have applied for? We do not. This is the first grant that we’re applying for. We’re excited with what Optimism has been building during these hard times. Optimism seems to be the perfect ecosystem for us to start developing on top of it, so we saw this as an opportunity to focus on a growing chain. Q: Will comarketing come from the op token distribution? We usually use our own token to incentivize comarketing when a token giveaway is needed. However we prefer more organic events rather than simple giveaways of tokens as this tends to attract lower quality users who are just hunting airdrops. We do comarketing through educational pieces, such as our learn and earn event which we host often where users can answer questions on telegram and earn $PACOCA. We can use part of the distribution for comarketing and sponsoring these events if that’s preferred. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.07560606060606
                }
            ]
        }
    ],
    "group_index": "263"
}