{
    "poll_list": [
        {
            "id": "0x8d9f64ad44887ec43ecba44ca605912ab541ccff49012691f4a1e0c1b7ec9b05",
            "title": "Season 2: Cycle 7: Tarot",
            "discussion": "https://gov.optimism.io/t/review-gf-phase-1-voting-cycle-7-tarot/3567",
            "body": "This Governance Fund Phase 1 proposal is eligible for voting in Cycle 7. \n\nThis proposal is was reviewed by [DeFi Committee A](https://gov.optimism.io/t/defi-committee-a-season-2-recommendations/3522/8). You can find committee recommendations below:\n\n[DeFi Committee A recommendations]([https://gov.optimism.io/t/defi-committee-a-season-2-recommendations/3522/8](https://gov.optimism.io/t/defi-committee-a-season-2-recommendations/3522/8))\n\nShadow DeFi Committee B is not an official committee but has posted their own recommendations here: [https://gov.optimism.io/t/defi-shadow-committee-season-2-recommendations/3549/11](https://gov.optimism.io/t/defi-shadow-committee-season-2-recommendations/3549/11)\n\nBy approving committees, the Token House entered a social contract to entrust and delegate the bulk of decision-making to official committees. However, delegates may vote against the recommendation of official committees but should provide a justification to the community as to why they voted differently.",
            "choices": [
                "For",
                "Against",
                "Abstain"
            ],
            "scores": [
                11871864.040982207,
                204972.31671790424,
                62406.99369003058
            ],
            "start": 1665691747,
            "end": 1666292947,
            "snapshot": "29191194",
            "state": "closed",
            "author": "0x47C88bb92B409fF25F6587EA611fac4e55f76007",
            "space": {
                "id": "opcollective.eth",
                "name": "Optimism Collective"
            }
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/review-gf-phase-1-voting-cycle-7-tarot/3567",
            "title": "[REVIEW] [GF: Phase 1, Voting Cycle 7] Tarot ",
            "index": 3567,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Governance Fund: Phase 1"
            ],
            "tags": [
                "cycle-7",
                "passed"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/TigrisOfGaul",
                    "index": "1",
                    "likes": "7",
                    "time": "27/09/2022-20:44:55",
                    "content": "Project Name: Tarot Author Name: @TigrisOfGaul Number of OP Tokens Requested: 540,000 L2 Recipient Address: 0x63D5554b748598C191aB0cBd0E0e1C638FFEBEe6 I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: Yes. Voting Cycle: Voting Cycle 7 Grant Category: Phase 1 (Governance Fund) / DeFi Is this proposal applicable to a specific committee?: This proposal may fall under the remit of various DeFi committees. Project Description, Optimism Alignment, and Ecosystem Value Proposition:  Tarot Lending Pools1920×1080 108 KB  Tarot is a decentralized lending protocol where users can participate as lenders or borrowers in isolated lending pools. Lenders can supply tokens to earn single-sided passive yield without impermanent loss, while borrowers can leverage their LP tokens as collateral to borrow tokens supplied by lenders. Tarot is also a popular LP auto-compounder with some of the lowest reinvest fees in all of DeFi (1%). With a complete suite of liquidity solutions and yield opportunities, Tarot encourages liquidity provision on DEXs, particularly for long-tail assets, by offering traditional LP auto-compounding and transferring risk and reward among lenders and borrowers. Since launching in May 2022, Tarot has become one of the top protocols to single stake OP and earn yield on Optimism. Tarot has several OP-based lending pools, with Supply APRs of up to ~30% for single-sided OP lending with no impermanent loss, and leveraged LP APRs (5x) for OP-based pairs exceeding 200-250%. These pools offer long-term OP holders a source of sustainable yields without selling, ultimately driven by the trading fees and DEX rewards earned by LPs. Supply APRs for ETH and stablecoin lending on Tarot regularly exceed 5-10%.  DefiLlama Top Yields on Optimism1030×800 146 KB  Tarot consistently delivers the highest single-exposure yields on Optimism: Yield Rankings - DefiLlama Tarot is proud to be part of the OP ecosystem. Beyond the many technical merits of the OP ecosystem for an advanced DeFi protocol like Tarot, we believe the core tenets of Tarot DAO are fully aligned with the Optimistic Vision. Relevant Usage Metrics: Currently on Optimism: ~$2.75M TVL Total TVL on all chains: ~$17M TVL with ~$7M in borrowing activity Transactions on Optimism: 30,000+ account transactions (e.g. borrow, repay, leverage, deleverage, etc.) via router contracts since launch, as well as ~7,000+ vault transactions per week. Open Sourced?: Yes. Tarot is open sourced. Optimism Native?: No. Tarot launched on Fantom in June 2021 and on Optimism in May 2022. Date of Deployment on Optimism: Tarot has been live on Optimism since May 6, 2022. Has your project previously applied for an OP grant?: Yes. Our proposal has incorporated significant changes in response to committee and delegate feedback. In particular, this proposal now focuses exclusively on targeted incentives for borrowing activity and lending in Tarot, for OP-based and other Optimism pairs. The distribution period for OP token incentives has been reduced to 24 weeks. The allocation of OP tokens to the core team for initial OP-TAROT liquidity has been removed entirely. The requested OP token amount has been reduced from 600,000 OP to 540,000 OP. Previous grant proposal: [REVIEW] [GF: Phase 1 Proposal] Tarot Did the project apply for or receive OP tokens through the Foundation Partner Fund?: No. How much will your project match in co-incentives?: 3,000,000 TAROT has been allocated towards matching co-incentives, following the adoption of TIP-018: Tarot Co-Incentivization on Optimism. This TAROT allocation is flexible and can be used to incentivize any pair. Furthermore, this allocation is broad in scope, and is not limited to DEX liquidity incentives. One such use of this allocation is via Tarot’s own single-token TAROT farming rewards mechanism, which tracks and rewards borrowing activity in the protocol. TAROT co-incentives, in the form of liquidity bribes and other DEX liquidity incentives, will be combined with OP token incentives to reward borrowing activity and lending, which benefits the entire Optimism ecosystem and the DeFi space as a whole. Additionally, pools may be co-incentivized by partner protocols such as Velodrome and Beethoven X. Proposal for Token Distribution: OP token incentives will be used to incentivize borrowing activity and lending in Tarot on Optimism. How will the OP tokens be distributed?: 540,000 OP is allocated to an incentives program that rewards users (i.e. suppliers, borrowers, and leveraged yield farmers) who actively participate in lending pools. 45,000 OP will be distributed per 2-week epoch over a total of 24 weeks. Borrow and supply incentives are categorized as follows:  Tarot OP Incentives Distribution1976×1515 229 KB  Borrow incentives for OP-based pairs and other Optimism pairs (60%):  30% → OP-based pairs (e.g. ETH-OP, OP-TAROT, OP-USDC) 30% → Other Optimism pairs (e.g. BTC-ETH, ETH-USDC, TAROT-USDC)  Supply incentives for supplying OP, ETH, and USDC (40%):  20% → Lending OP 10% → Lending ETH 10% → Lending USDC  OP token incentives will be distributed at a fixed rate of 22,500 OP per week, with the distribution as follows:  6,750 OP / week → Borrow incentives for OP-based pairs 6,750 OP / week → Borrow incentives for other Optimism pairs 4,500 OP / week → Supply incentives for lending OP 2,250 OP / week → Supply incentives for lending ETH 2,250 OP / week → Supply incentives for lending USDC  Eligible pairs for borrow incentives shall be comprised of at least one of the following tokens, and no single pair shall be allocated more than 10% of the total allocation:  OP ETH USDC  Additionally, only the following TAROT-based pairs are eligible for borrow incentives:  OP-TAROT TAROT-USDC  Tarot supports a wide variety of lending pools and long-tail assets. This structure for borrow incentives helps to ensure the flexibility to allocate OP token rewards to high volume pairs, while providing reassurance that the incentives will be widely distributed to best serve the Optimism ecosystem. Over what period of time will the tokens be distributed?: OP token incentives will be distributed over 24 weeks (~5.6 months). Please list the milestones/KPIs you expect to achieve for each initiative, considering how each relates to incentivizing sustainable usage and liquidity on Optimism. Please keep in mind that progress towards these milestones/KPIs should be trackable.: Our early liquidity incentivization program with Velodrome has already yielded strong results with unprecedented capital efficiency. Since launching incentives in August, over 7,000,000 TAROT has been bridged to Optimism and over $560,000 in TAROT-USDC liquidity has been provided on Velodrome. This includes a significant amount of protocol-owned liquidity (POL) bridged over to Optimism following the adoption of TIP-019: Velodrome Liquidity. Milestones will be structured around sustainable liquidity for OP-based and Optimism pairs, as well as increased lending and borrowing activity in Tarot’s lending pools: If we assume $20,000 in cumulative weekly incentives across all incentivized pools (which includes OP incentives), over a 24-week period, and a long-term target of 20-40% APR for volatile pairs, we would expect ~$2.6M to ~$5.25M of liquidity depth. Liquidity for supply positions is expected to be even more impactful in terms of total value locked (TVL), with long-term target APRs of 5-15% for lending OP, ETH, and USDC. All borrowing/lending activity in Tarot is eminently trackable, and can be monitored (e.g., via DeFiLlama, Dune Analytics, and within the Tarot UI). How will this distribution incentivize usage and liquidity on Optimism?: In practice, the increase of borrowing activity in Tarot’s lending pools creates a flywheel effect and, in response to higher pool APRs, lenders are incentivized to supply additional tokens, thus increasing TVL and liquidity across the ecosystem. Borrow incentives combined with supply incentives will create even more pronounced increases in usage and liquidity on Optimism. Furthermore, the allocation of OP token incentives to lending OP will bolster what is already one of the top yield opportunities for single-staking OP on the Optimism network. This distribution helps Tarot to continue to offer competitive yields, generated by supply and demand for loans in isolated lending pools, to users on Optimism, and will facilitate the creation and expansion of additional lending pools with attractive leveraged APRs. Why will incentivized users and liquidity on Optimism remain after incentives dry up?: On Fantom, Tarot lending pools have continued to see strong demand and competitive yields, in the form of single-sided lending, auto-compounding LP, and borrowing and leveraged yield farming, even following the sunsetting of the Tarot Farming Rewards program. Tarot will continue to attract users and liquidity to the OP ecosystem from other chains, and further development of future products and yield opportunities on Optimism will continue, even after the conclusion of OP token incentives. Project Links:  Website: tarot.to  Twitter: @TarotFinance  Discord: Tarot   ",
                    "links": [
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/1/1db747d4cd4ffdd2acb51d9ff3bfbd9ed70eeb8e.png",
                        "https://defillama.com/yields?chain=Optimism&attribute=single_exposure",
                        "https://gov.optimism.io/t/review-gf-phase-1-proposal-tarot/3002",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/e/e6d3c5c663b85f2aa065a80a8ecf0cf6d015b157.jpeg",
                        "https://www.tarot.to/",
                        "https://twitter.com/TarotFinance",
                        "https://discord.gg/tarot",
                        "https://gov.optimism.io/t/voting-cycle-7-roundup/3586/6",
                        "https://gov.optimism.io/t/defi-latam-delegate-communication-thread/2950/8",
                        "https://gov.optimism.io/t/defi-shadow-committee-b-season-2-recommendations/3549/11",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-abracadabra-money-cycle-8/2918",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-velodrome-finance/3736/104",
                        "https://gov.optimism.io/t/defi-committee-a-season-2-recommendations/3522/8"
                    ],
                    "GPT-summary": "The post is a proposal for a grant from the Optimism Foundation for the Tarot lending protocol. The author explains the project's features, alignment with the Optimistic Vision, and usage metrics. The proposal requests OP tokens to incentivize borrowing and lending activity in Tarot's lending pools on Optimism. The post includes details on the distribution of the tokens and milestones/KPIs to achieve. A 3rd party gives entirely positive feedback on the proposal, and the author provides links to the project's website, Twitter, and Discord.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Interoperability and Scaleability",
                        "Token economics",
                        "Privacy, Security and risk management",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.5730863833136555
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "2",
                    "likes": "0",
                    "time": "03/10/2022-16:12:27",
                    "content": "I am an Optimism delegate [Delegate Commitments - #136 by jackanorak ] with sufficient voting power and I believe this proposal is ready to move to a vote. ",
                    "links": [
                        "https://gov.optimism.io/t/voting-cycle-7-roundup/3586/6"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/MoneyManDoug",
                    "index": "3",
                    "likes": "0",
                    "time": "03/10/2022-16:34:02",
                    "content": "As an Optimism delegate with voting power above the required threshold I believe this proposal is ready. Delegate Commitments - #71 by MoneyManDoug ",
                    "links": [
                        "https://gov.optimism.io/t/voting-cycle-7-roundup/3586/6"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "4",
                    "likes": "0",
                    "time": "03/10/2022-22:43:08",
                    "content": "Thank you for updated proposal.     TigrisOfGaul:  3,000,000 TAROT has been allocated towards […]this allocation is broad in scope, and is not limited to DEX liquidity incentives.   Will it possible to keep a dedicated number of Tarot token aside for co-incentives, as of now there are many assumption.     TigrisOfGaul:  OP token incentives will be distributed at a fixed rate of 22,500 OP per week   Imo, this is a huge amount of $OP/week with respect to protocol TVL and would suggest reducing it to circa 3K/week. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.915178571428572
                },
                {
                    "author_link": "https://gov.optimism.io/u/linda",
                    "index": "5",
                    "likes": "1",
                    "time": "03/10/2022-22:55:06",
                    "content": "I can only speak for myself since our DeFi Committee A has not met yet for this new cycle (planned for next week) but it appears this updated proposal factored in our feedback so I would be comfortable approving personally. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.536363636363636
                },
                {
                    "author_link": "https://gov.optimism.io/u/Exosphere",
                    "index": "6",
                    "likes": "0",
                    "time": "04/10/2022-17:43:38",
                    "content": "Thanks for the modifications to the proposal. I look forward to seeing it up for vote in round 7. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "7",
                    "likes": "2",
                    "time": "12/10/2022-14:26:51",
                    "content": "The defi shadow committee  – which is not an official committee – supports this proposal. We are in support of the proposal and respect the creative reworking since last round. We’re beginning to take the view that liquidity mining and usage rewards are generally -EV activities to fund unless they amplify activity that is already sticky or promise to improve the function or use of protocols through composability or network effects. This proposal offers both. It’s not clear to us that the changes made here are more cost-efficient than the original proposal made (as they’re direct incentives), but the emphasis on central tokens — wholly constructed by Tigris with little direction — speaks to the creativity and capability of this team. ",
                    "links": [
                        "https://gov.optimism.io/t/defi-shadow-committee-b-season-2-recommendations/3549/11"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.539772727272727
                },
                {
                    "author_link": "https://gov.optimism.io/u/katie",
                    "index": "8",
                    "likes": "2",
                    "time": "12/10/2022-16:14:31",
                    "content": " Defi Committee A Recommendation Voting recommendation: Yes Rationale: The proposal team incorporated previous feedback and focused on OP based pairs and removed operational costs. We are happy to support the updated proposal. Previous recommendation can be found here. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.777777777777779
                },
                {
                    "author_link": "https://gov.optimism.io/u/katie",
                    "index": "9",
                    "likes": "2",
                    "time": "13/10/2022-20:26:23",
                    "content": "Voted yes - Thank you to the Tarot team for incorporating feedback and resubmitting! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "10",
                    "likes": "1",
                    "time": "15/10/2022-18:47:51",
                    "content": "Voted Against Going against committee decision. Glad to see feedback from last cycle in this proposal but 22,500 OP/week is too much. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.166666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/katie",
                    "index": "11",
                    "likes": "2",
                    "time": "15/10/2022-19:09:37",
                    "content": "We are very glad to see delegates considering our recommendation and ultimately making their own decision regarding proposals. This is how a healthy governance system should function in my opinion. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal"
                    ],
                    "Sentiment": 7.1875
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPenthusiast",
                    "index": "12",
                    "likes": "0",
                    "time": "16/10/2022-07:52:33",
                    "content": "Glad to see some feedback was included but the requested amount seems too much as mentioned by other contributors. Tarot has launched on OP but the TVL has remained very low since launch and has not grown so I believe a lower requested amount would be better. As mentioned by other members, the reward rate would be way too high so either the requested amount should decrease or the duration of rewards should increase to have a more reasonable emission rate so I am voting for this current iteration. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.905
                },
                {
                    "author_link": "https://gov.optimism.io/u/tao",
                    "index": "13",
                    "likes": "0",
                    "time": "18/10/2022-20:17:49",
                    "content": "Tarot is backed by an excellent team. Glad to see this proposal gain support. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "14",
                    "likes": "0",
                    "time": "20/10/2022-11:21:52",
                    "content": "I am voting FOR the Tarot proposal, following DeFi committee A’s recommendation. The proposal has nice elements and cool to see the team come back with previous feedback incorporated. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.783333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/SEED_LATAM_Joxes",
                    "index": "15",
                    "likes": "0",
                    "time": "21/10/2022-02:43:07",
                    "content": "[Final] Voting: For Following the DeFi A committee recommendation, we’re happy to see how the project was moving faster to incorporate feedback and suggestions, for example, prioritizing assets that are essential to the Optimism ecosystem. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "16",
                    "likes": "0",
                    "time": "21/10/2022-13:13:50",
                    "content": "Snapshot vote - passed ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "17",
                    "likes": "0",
                    "time": "21/10/2022-13:14:09",
                    "content": "@TigrisOfGaul can you provide a Telegram handle or other contact method so the Optimism team can get in touch about paying out this grant! Feel free to DM or email palash@optimism.io ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.609375
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "18",
                    "likes": "0",
                    "time": "21/10/2022-13:14:13",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "273"
}