{
    "poll_list": [
        {
            "id": "0xa37475924ddd3a55b875da4f852b3498176cc590f6776440ab1225e63fe2e25f",
            "title": "Proposal C: Governance Fund Phase 0 - 0x",
            "discussion": "https://gov.optimism.io/t/voting-cycle-1-roundup/2619#proposals-2",
            "body": "This individual allocates 100% towards grants. We’re big fans of public goods funding, but since this does not fit the batch guidelines for phase 0, it is up to the Token House to determine whether it should be accepted as a standalone vote.\n\nFor more info, check out Voting Cycle 1 Roundup: https://gov.optimism.io/t/voting-cycle-1-roundup/2619#proposals-2 ",
            "choices": [
                "For",
                "Against"
            ],
            "scores": [
                16655818.708388228,
                4523491.835677791
            ],
            "start": 1654803404,
            "end": 1655926604,
            "snapshot": "11081523",
            "state": "closed",
            "author": "0x47C88bb92B409fF25F6587EA611fac4e55f76007",
            "space": {
                "id": "opcollective.eth",
                "name": "Optimism Collective"
            }
        },
        {
            "id": "0x37b4b290553e80575b7ca6bb44a82ec9c0b67427e9c0b5056849b8c1b9251f1f",
            "title": "Proposal B: Governance Fund Phase 0 - Uniswap",
            "discussion": "https://gov.optimism.io/t/voting-cycle-1-roundup/2619#proposals-2",
            "body": "This individual vote was submitted after the May 27 deadline. It is up to the Token House to determine whether it should be accepted.\n\nFor more info, check out Voting Cycle 1 Roundup: https://gov.optimism.io/t/voting-cycle-1-roundup/2619#proposals-2",
            "choices": [
                "For",
                "Against"
            ],
            "scores": [
                17750223.018807404,
                6207406.269874819
            ],
            "start": 1654803362,
            "end": 1655926562,
            "snapshot": "11081504",
            "state": "closed",
            "author": "0x47C88bb92B409fF25F6587EA611fac4e55f76007",
            "space": {
                "id": "opcollective.eth",
                "name": "Optimism Collective"
            }
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/governance-fund-observations/3257",
            "title": "Governance Fund Observations ",
            "index": 3257,
            "category": [
                "\\xf0\\x9f\\x8f\\x9b Governance"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/raho",
                    "index": "1",
                    "likes": "29",
                    "time": "08/08/2022-20:02:39",
                    "content": "Hello Optimism Community! @tnorm and I are two analysts on the Messari Governor team, and we’ve been covering Optimism governance as part of our daily workflow since the DAO launched. (Disclaimer: The thoughts, ideas, and reflections highlighted in this post are our own, and not representative of Messari, or the Messari brand in any way.) Given Optimism’s robust delegate network and active community, we wanted to share some of our findings from our limited research with the community to both gauge interest in these types of transparency reports and highlight some opportunities for Optimism to continue to develop its governance fund and delegation infrastructure.  Delegates The distribution of Governance power remains a contentious topic in DAO governance. Many DAOs agree that it is better to have a central group of individuals making decisions than a larger distribution of individuals potentially not participating in decision-making. Regardless, participation becomes paramount if voting power is to be assigned to delegates. Pictured below is the distribution of voter participation among the top fifty delegates and each address’s voting participation to date.  1600×910 190 KB  While there are outliers, many top delegates actively participate in most of the votes. Linda Xie, Polynya, Quixotic, and Lefteris have all had exemplary participation, which we’d expect from the community’s most prominent delegates. For those who failed to participate, an explanation for some of the behavior could be technical issues with Gnosis Safe and Snapshot support. The fact that Linda Xie and Quixotic (two of the DAO’s largest delegates) represent such a large group of delegators is also an encouraging signal for decentralization. Looking forward, we’d expect greater participation from top delegates who have not participated. With more consistent reporting and visibility, we’d like to see smaller and more active delegates absorb some of the voting power from apathetic delegates.  1600×910 164 KB  To better understand the power dynamics of OP governance, we used the Boardroom and Snapshot APIs to analyze individual vote data for each Optimism proposal to date. To date, governance power has been concentrated within the DAO’s largest delegates. The top 5 delegates accounted for nearly 50% of the total votes cast throughout the Governance Fund’s four Phases.  The Scope of the Governance Fund On multiple occasions (Aave, Velodrome), there have been examples of projects applying for the Governance Fund as well as the Partner Fund. With current examples of Governance Funding and Partner Funding both going towards liquidity mining incentives, there becomes a need to define the scope of both Governance and Partner Funding. An alternative to publicly listing Partner Funding recipients (with amounts) could be the immediate blacklisting of projects to ensure projects are not receiving funding from both sources. The community should work alongside the Optimism Foundation to create suitable guidelines for this issue. In addition to resolving the overlap in Partner and Governance Funding, the community needs to have a solid understanding of the scope of Governance Funding. On more than one occasion, applications lacked a concrete timeline due to the complexity of calculating liquidity mining rewards. Possible Solution: Set clear guidelines on what should be going through the Governance Fund and what should be going through the Partner Fund.  1600×910 202 KB  A rough interpretation of the Optimism Docs shows that liquidity mining campaigns fit better within the scope of the Partner fund than the Governance Fund. As liquidity mining campaigns have consumed an estimated 63% (27M OP Source) of Governance Funding, it would be productive to have an outline stating more precise funding objectives and determine if liquidity mining falls within those. Partner Fund: “An allocation of 5.4% of the OP token supply will be dedicated to the Partner Fund. These funds will be distributed strategically by the Optimism Foundation to grow the Optimism ecosystem for the benefit of the entire Collective.” Governance Fund: “An allocation of 5.4% of the OP token supply will be dedicated to the first Governance Fund. All projects demonstrating usage on Optimism can request tokens from this fund at gov.optimism.io” (Source: Optimism Docs)  Potential Vulnerability in Governance Funding With the OP token’s primary utility being the governance power behind the funding of projects and initiatives, it has become clear that the current model is not highlighting the potential for exploitation. Following Airdrop #1, the only way to obtain the OP token is to either receive funding or participate in one of the (few) liquidity mining campaigns hosted by projects (who have received funding through the Governance Fund or the Partner Fund). With the limited ability to obtain OP, the Optimism community trusts that the delegates are voting in the users’ best interest and the Optimism Collective’s longevity when voting for or against Governance Funding proposals. While we support Optimism’s goal to fund projects within its native ecosystem, the lack of accountability for using funds following their distribution is worrisome to some community members. To emphasize the importance of these votes, we would like to provide an example of a potential exploit that has luckily not yet transpired. In Governance Funding Phase 0, two separate protocols (Perpetual Protocol, and Synthetix) received 9,000,000 OP in funding. Hypothetically speaking, with this amount of OP, it would be shockingly easy to self-delegate the OP and vote on behalf of future self-funding proposals. By obtaining this amount, the minimum quorum would be easily reached on any proposal we saw during governance funding Phase 0 or Phase 1.  Minimum Quorum: 10% of ‘Votable OP’: 25,751,126 OP * 0.1 = 2,575,112.6 OP (Source: Dune) The average vote count per proposal was 17,974,761.68 OP. With the addition of 9M OP to the total Votable OP, the total Votable OP would be 34,751,126, with a minimum quorum of 3,475,112.6 OP. Assuming the average number of OP used to vote remains, the addition of 9M OP would give a malicious project nearly 35% of the voting power. ((9,000,000 OP / (17,974,761.68 OP + 9,000,000 OP))*100 = 33.36452091%) To our knowledge, no failsafe exists to stop a project that has received funding from self-delegating their OP and voting on behalf of future self-funding.  Potential Risk Mitigation: This topic has been touched on in the Grant Proposal Template V2, but a clear path towards accountability would be ideal.    Grant Proposal Template   The expectation is that token grants will not be self-delegated for use in governance. The primary purpose of these token grants is to incentivize sustainable usage and growth of the Optimism ecosystem. Applicants should disclose whether they plan to increase their voting power by delegating a portion of grant tokens to themself or a closely affiliated party.   There are a few ways to mitigate this risk as a community and ensure that the funding remains in the hands of projects that contribute to the longevity of the Optimism Collective. Increased Quorum (and/or Approval Threshold): The current quorum does not reflect the emissions distributed to the Governance Fund and Partner fund, opening up room for governance manipulation.  1600×910 149 KB  The current Votable OP quorum represents around 1.1% of the total circulating supply. Comparatively, this is a notably lower threshold than many DeFi DAOs w/ significant TVL - i.e., Uniswap (4%) or Compound (5.5%). Observing the results of Voting Cycle 4, it is clear that based on current delegate participation, raising the quorum can increase governance security without the risk of stifling the progress of future governance proposals. Every vote to date has been comfortably above the quorum. Delegates Ensuring Accountability: Projects receiving Governance Funding are subject to a ¾ multisig (two Delegates and two project team members). With this model, delegates could hold funding recipients accountable directly. Accountability Committee: Following the model that the Optimism Foundation has introduced, an accountability committee could be formed to ensure funding recipients are adhering to the proposed use of funding outlined in their initial proposal. Open-Sourced Funds Mapping: This model would require the development of an open-sourced dashboard mapping the trail of tokens but would allow the community to self-regulate and halt funding to projects that are not adhering to their proposed use of funding. (Note: This model would assume that funding was distributed via streams, and Optimism could halt the funding stream at the community’s discretion. This model would also potentially incur development costs)  Conclusion Our goal in outlining these observations is to catalyze productive discourse within the community to solve complex governance challenges. All solutions posted are topics we think the community may find beneficial to discuss and are not meant to be considered suggestions. Congratulations on the successful completion of Governance Fund Phase 1, and we look forward to hearing your thoughts! ",
                    "links": [
                        "https://messari.io/dao/optimism/proposals",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/9/93233686d6bdbea4bd7a414f7770c11f610e67b3.jpeg",
                        "https://gov.optimism.io/t/gfx-labs-delegate-communication-thread/2728/12",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/b/be95e787774ed87614f7de77f475a2f23edf6728.jpeg",
                        "https://twitter.com/AaveAave/status/1555230478394966018?s=20&t=DDOZTVpenl1IFg7SwwBHUg",
                        "https://twitter.com/VelodromeFi/status/1545434763951017986?s=20&t=By9CVeuOw-AVOu9lgauDng",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/d/de4cee3c9ad18a6517e160fdc59e74cfbc490b73.png",
                        "https://docs.google.com/spreadsheets/d/1VZp7x8YdNTY1dYHOu-u8zmu5_YQL_tHP1bYw7mTults/edit?usp=sharing",
                        "http://gov.optimism.io",
                        "https://community.optimism.io/docs/governance/allocations/#ecosystem-fund",
                        "https://gov.optimism.io/t/perpetual-protocol-optimism-governances-first-failure/3029",
                        "https://dune.com/queries/872016/1521063",
                        "https://gov.optimism.io/t/grant-proposal-template-v2/3233",
                        "https://gov.optimism.io/t/grant-proposal-template/3233/1",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/3/3e6d0f3abd8ca6013057199533294df8cb33afac.png",
                        "https://gov.optimism.io/t/introducing-governance-committees/3238",
                        "https://gov.optimism.io/t/state-of-optimism-governance/3489",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/2",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-messari/3739/7",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-defillama-reports/3848/2",
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-messari/3739/26"
                    ],
                    "GPT-summary": "The post discusses the findings of the Messari Governor team's research on Optimism governance. The post highlights the distribution of governance power among delegates, the scope of the governance fund, and potential vulnerabilities in governance funding. The post suggests solutions to mitigate risks and ensure accountability. The post aims to initiate productive discourse within the community to solve complex governance challenges.",
                    "GPT-proposal-categories": [
                        "Governance Fund",
                        "Delegates",
                        "Partner Fund",
                        "Risk Mitigation",
                        "Accountability Committee"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.8140341188021605
                },
                {
                    "author_link": "https://gov.optimism.io/u/Bobbay_StableLab",
                    "index": "2",
                    "likes": "4",
                    "time": "09/08/2022-17:37:09",
                    "content": "This provides an excellent overview in understanding the activities of delegates and can help determine future committees and committee members. I’m intrigued to know how many delegates/voters achieved a 100% voter rate.     raho:  The top 5 delegates accounted for nearly 50% of the total votes cast throughout the Governance Fund’s four Phases.   This is an extremely high number for only five delegates; even with their high participation, is it fair for only five individuals to have such a high amount of power? Governance fund & Partner fund An ideal recommendation that has been mentioned in the grant application v2 forum  to bring transparency to token holders. Accountability committee: For the three proposed committees, each can be held accountable for the grants they recommend. We expect committee’s to have a strong insight into each grant they recommend so it makes more sense to have these committees be responsible for tracking and following up rather than having an accountability committee. Open-Sourced Funds Mapping: Agree with this. A dashboard would provide transparency for each grant, especially since the current setup isn’t too ideal. Closing thoughts: Voter Participation I think it is worth considering using Karma to help build a reputation-based system within optimism. As important as metrics are, we should also care about a voter’s participation within the forums. ",
                    "links": [
                        "https://gov.optimism.io/t/introducing-governance-committees/3238",
                        "https://docs.google.com/spreadsheets/d/1eaHOlWB34ij1KGsXdaNyTQg4tt1Pu2JurJsElBb6a8k/edit#gid=0",
                        "https://showkarma.xyz/"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.502898550724638
                },
                {
                    "author_link": "https://gov.optimism.io/u/raho",
                    "index": "3",
                    "likes": "3",
                    "time": "09/08/2022-18:07:53",
                    "content": "    Bobbay_StableLab:  I’m intrigued to know how many delegates/voters achieved a 100% voter rate.   We made a spreadsheet outlining the top 50 delegates here  To answer your question, it shows that 7/50 of the top delegates achieved a 100% voter rate. (Note: we did not count the very first ‘test’ vote for this sheet, so this is displaying results from the first 39 proposals.) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.075
                },
                {
                    "author_link": "https://gov.optimism.io/u/Bobbay_StableLab",
                    "index": "4",
                    "likes": "1",
                    "time": "09/08/2022-18:22:01",
                    "content": "Amazing mate, appreciate the spreadsheet. I think it is 39 proposals, including the test proposal btw. So it should based on 38 votes, excluding the first one right? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.892857142857142
                },
                {
                    "author_link": "https://gov.optimism.io/u/tnorm",
                    "index": "5",
                    "likes": "7",
                    "time": "09/08/2022-18:36:35",
                    "content": "Yep! We need to update that sheet Ryan shared but I removed the test data and used 38 for the backend on charts. From the Data I have around 516 voters hitting all of the proposals? Obviously there’s a long tail here of small independent voters. Larger doxxed accounts I have as hitting 100% include:  Quixotic (Optimism NFT Marketplace) Polynya Lefteris Karapetsas Olimpio Solarcurve Joxes | DeFi LATAM MinimalGravitas Penn Blockchain L222 Pat LaVecchia (OP: LAVEP) Butterbum StableNode Katie Garcia  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.916666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/linda",
                    "index": "6",
                    "likes": "3",
                    "time": "09/08/2022-19:47:56",
                    "content": "Thanks for sharing! These are really interesting and helpful visualizations. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://gov.optimism.io/u/Sony",
                    "index": "7",
                    "likes": "2",
                    "time": "10/08/2022-04:34:12",
                    "content": "Thanks for sharing! I think more factors should be considered ! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.1875
                },
                {
                    "author_link": "https://gov.optimism.io/u/Karo",
                    "index": "8",
                    "likes": "2",
                    "time": "10/08/2022-08:05:57",
                    "content": "This is a very detailed post with great visuals. Well done! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.8
                },
                {
                    "author_link": "https://gov.optimism.io/u/Netrim",
                    "index": "9",
                    "likes": "3",
                    "time": "10/08/2022-13:02:39",
                    "content": "There is something so pleasing in seeing this kind of data analytics. The points you raise are something that have been on everyone’s mind, specifically concentration of voting power AND voter participation. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/TheDoctor",
                    "index": "10",
                    "likes": "2",
                    "time": "13/08/2022-23:40:56",
                    "content": "Thanks for sharing, Happy to see my delegate voted 100% of the proposals. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/Teno",
                    "index": "11",
                    "likes": "2",
                    "time": "17/08/2022-15:23:02",
                    "content": "It is an interesting analysis and detailed explanation of what is happening with the votes and support of proposals in the DAO of Optimism, something really important when it comes to knowing how voting power is handled and what concerns the governance and development of the DAO. OP system. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.166666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/raho",
                    "index": "12",
                    "likes": "2",
                    "time": "16/09/2022-19:34:24",
                    "content": "We have posted a follow-up to this forum post here. Our updated post contains a link to the State of Optimism Governance report that has been published on Messari.  ",
                    "links": [
                        "https://messari.io/report/state-of-optimism-governance",
                        "https://messari.io/"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is providing an update",
                        "3rd party sharing a resource related to proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "198"
}