{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/governance-update-4/3435",
            "title": "Governance Update #4 ",
            "index": 3435,
            "category": [
                "\\xf0\\x9f\\x93\\xa2 Updates and Announcements",
                "Governance Updates"
            ],
            "tags": [
                "season-2"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/ben-chain",
                    "index": "1",
                    "likes": "20",
                    "time": "09/09/2022-20:55:55",
                    "content": " Gov Update #4: Kicking off Season 2 After taking some valuable time to reflect on Season 1, we’re refreshed and ready to kick off a new and improved Season 2! This governance update includes a summary of updates from the Reflection Period, a recap of Voting Cycle #5, and all the information you’ll need to contribute in Season 2.  What’s New?: Reflection Period Recap After wrapping up Season 1, we took two weeks to reflect and make improvements to the OP governance process. This iterative feedback process resulted in the following governance updates for Season 2:  an updated Operating Manual v2  an updated Grant Proposal Template (including additional guidance on the purpose and use of grant funding) Introducing Committees a new Committee Formation Template (only applicable for Special Voting Cycle #5; committee formation proposals cannot be submitted during Season 2.)  Season 2 will operate according to the policies outlined in the above documents, which will be re-evaluated in the next Reflection Period in November. While we provided some additional clarification as to the purpose of the Governance Fund during the Reflection Period, we’ve received additional feedback requesting more guidance on the goals of the Governance Fund. Purpose: “The purpose of the Governance Fund is to incentivize sustainable growth of projects and communities in the Optimism ecosystem. This does not mean that all grants must be incentive programs. The Token House is welcome to consider any and all proposals which would drive growth or address a gap in the Optimism ecosystem, including public goods projects. However, it does mean that funding should come with an expectation of growth-related deliverables. It is not the intended purpose of the governance fund to retroactively fund public goods without an expectation of future work—there is a distinct OP allocation dedicated to this, which will be distributed via the Citizens House at a later date.” Near Term Goals: Target L1 applications with PMF: To the extent that Ethereum has legitimate usage on L1, we should seek to migrate that usage to Optimism. The Governance Fund should support the migration of trusted, proven applications currently deployed on L1s. Grow population of values-aligned builders: To be the home for the next wave of novel applications, the Governance Fund should support developers launching novel applications that will draw new users to Optimism.  Introducing Committees Reflection Periods culminate with a Special Voting Cycle. Special Voting Cycle #5 focused on establishing a set of experimental committees for Season 2. We’re excited to announce the implementation of 4 new committees:  Tooling NFTs and Gaming DeFi Committee A DeFi Committee C  Committees aim to alleviate the amount of work required of delegates by segmenting proposals among smaller, focused groups. These committees will primarily perform information filtering and synthesis, making non-binding recommendations to other delegates. Delegates that specialize in a particular topic can defer to the recommendation of relevant committees on topics outside their area of expertise/interest. Delegates may also choose to vote against the recommendation of any committee, provided they provide their reasoning for doing so. Committees will post their recommendations in Forum threads for reference by other delegates no later than 3 days after Week 3 of the Voting Cycle begins. Committees are experimental and will be implemented throughout Season 2. They will be re-evaluated during the next Reflection Period and any committees that continue on in Season 3 will need to be re-approved during Special Voting Cycle #9. You can read more about committees here.  Kicking off Season 2: Voting Cycle #6  Season 2 has officially begun with the kick off of Voting Cycle #6, which will run from September 8th - September 28th at 7pm GMT. Voting Cycle #6 will follow the new three-week voting cycle: Week 1: Community feedback (← we are here at time of posting!) Week 2: Delegate feedback Week 3: Voting This Season, Committees will make recommendations on proposals. Proposers should specify which committee they want to review their proposal in their grant proposal. Delegates should consider the recommendations of committees but are not obligated to vote according to their recommendations. Delegates that choose to vote against the recommendation of committees should provide their reasoning for doing so.  Up Next: What to Expect in Season 2  Season 2 will run from September 8th - November 9th at 7pm GMT Season 2 will be followed by a 1 week Off-Season, during which time Committees will create reports on their activity throughout the Season and allocate the retroactive component of their compensation The 3 week Reflection Period will run from November 17th - December 7th at 7pm GMT A Special Voting Cycle #9 will begin after the Reflection Period and will run for 13 days, from Dec 8th until Dec 21st at 7p GMT. This voting cycle will only include process improvements and will not include grant proposals Season 3 will begin on December 22nd with Voting Cycle #10, which will resume all proposals. The governance process will follow any new processes introduced and approved during the Reflection Period and subsequent Special Voting Cycle.  Thank you to our community for your feedback, consistent engagement, and commitment to iterating with us to make OP governance better each Season. As always, Stay Optimistic! ",
                    "links": [
                        "https://gov.optimism.io/t/grant-proposal-template/3233/15",
                        "https://gov.optimism.io/t/introducing-governance-committees/3238/60",
                        "https://gov.optimism.io/t/phase-1-committee-formation-proposal-template/3281/9",
                        "https://gov.optimism.io/t/draft-s02-committee-proposal-tooling-governance-committee/3333/32",
                        "https://gov.optimism.io/t/draft-so2-committee-proposal-nfts-gaming-group-a/3364/27",
                        "https://gov.optimism.io/t/s02-committee-proposal-decentralized-finance-governance-committee-group-a/3286/29",
                        "https://gov.optimism.io/t/draft-so2-committee-proposal-defi-group-c/3320",
                        "https://gov.optimism.io/c/proposals/38",
                        "https://gov.optimism.io/t/introducing-governance-committees/3238/60",
                        "https://gov.optimism.io/t/grant-proposal-template/3233/15",
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-bankless-academy-v2/3353/38",
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-bankless-academy-v2/3353/41",
                        "https://gov.optimism.io/t/guide-to-season-3-course-correcting/3942",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-curve/3089/110",
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-messari/3739/29",
                        "https://gov.optimism.io/t/review-gf-phase-1-proposal-defillama/3562/23",
                        "https://gov.optimism.io/t/proposal-execution-implementation-life-cycle-tooling/4058/2",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/7",
                        "https://gov.optimism.io/t/defi-committee-c-season-2-recommendations/3437/4"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.773061334923579
                },
                {
                    "author_link": "https://gov.optimism.io/u/arabianhorses",
                    "index": "2",
                    "likes": "2",
                    "time": "09/09/2022-21:51:12",
                    "content": "feeling excited about the next season,  IDK is this the actual place to write this but I think committee members should serve with a maximum season limit for example 3 seasons can be good ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.34375
                }
            ]
        },
        {
            "thread_link": "https://gov.optimism.io/t/governance-update-3/3232",
            "title": "Governance Update #3 ",
            "index": 3232,
            "category": [
                "\\xf0\\x9f\\x93\\xa2 Updates and Announcements",
                "Governance Updates"
            ],
            "tags": [
                "season-1"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/ben-chain",
                    "index": "1",
                    "likes": "36",
                    "time": "05/08/2022-16:49:03",
                    "content": " Governance Update #3: Time to Reflect  Wow–it feels like the past two months have absolutely flown by! This governance update includes a brief recap of Season 1, and a collection of documents which the Optimism Foundation has prepared for Season 2. If you want to shape how Season 2 of OP governance works, now’s your chance – please come contribute to the discussions!  Season 1 Voting Recap  With the conclusion of Voting Cycle #4, Season 1 of Token House governance has officially wrapped! For the past eight weeks, Token House delegates have been reviewing and voting on Governance Fund grant proposals from projects spanning the Optimism ecosystem. In the first four voting cycles, the Token House approved 41 project grants and rejected 18 proposals. 42.6mm OP has been approved for Governance Fund grants and 30.6 mm OP has been distributed to projects already. You can track grant distributions here. For a summary of these cycles, see the Cycle #1, Cycle #2, or Cycle #3, and Cycle #4 roundup threads. We will briefly pause Voting Cycles to allow for a Reflection Period as we prepare for Season 2 of governance. Delegates will have a three-week period to reflect on Season 1 and provide feedback on our proposed changes for Season 2. Proposal authors should expect a new structure and updated process for Voting Cycle #6 (the next grant voting cycle), so please stay tuned for more information on a new and improved governance process! Proposers are welcome to draft grant proposals during the Reflection Period and Voting Cycle #5, but those proposals won’t be voted on until Voting Cycle #6.  What to Expect   The Reflection Period will last from August 4th - August 24th, during which time there will be no active votes During the Reflection Period, we are welcoming community feedback on the v0.2 Operating Manual and other governance proposals aimed at improving Season 2 (linked below) A Special Voting Cycle #5 will begin after the Reflection Period and will run for 13 days, from Aug 25 at 7p GMT until Sept 7 at 7p GMT. This voting cycle will only include process improvements and will not include grant proposals Season 2 will begin on September 8 with Voting Cycle #6, which will resume all proposals. The governance process will follow the v0.2 Operating Manual and any new processes approved in Special Voting Cycle #5.   Time to Reflect  Eight weeks ago, the Optimism Collective launched with a minimal governance framework and an intention to iterate. In our last Governance update, we highlighted key feedback from delegates and community members regarding improvements that could be made for Season 2. Below are a series of proposed updates that take this feedback into account. While changes to the Operating Manual don’t require a formal vote, feedback during the Reflection Period from delegates and the broader community is a crucial input towards making the next season the best it can be. Any proposals that fall outside the scope of the Operating Manual will be put up for Token House vote, as indicated below. Here are the documents we’re asking for community feedback on as we gear up for Season 2:  A draft of Operating Manual v0.2!  Forum thread for discussion Pull request   Committee Proposals Proposal Template v2  Collecting feedback on these documents will constitute the majority of the Reflection Period. Once feedback is incorporated and Special Voting Cycle #5 has concluded, these documents will form the basis of Season 2 governance. We’re so grateful to our community for taking part in our first governance experiment. Given your active participation, constructive feedback, and thoughtful reflection, you can probably guess how we’re feeling about Season 2.  And, as always, Stay Optimistic!  ",
                    "links": [
                        "https://gov.optimism.io/t/voting-cycle-1-roundup/2619",
                        "https://gov.optimism.io/t/voting-cycle-2-roundup/2754",
                        "https://gov.optimism.io/t/voting-cycle-3-roundup/2923/11",
                        "https://gov.optimism.io/t/voting-cycle-4-roundup/3055",
                        "https://optimism.mirror.xyz/r888e4B5iiNQi-3_mO26ixgv-plQ099XWgqEOv9iWKA",
                        "https://gov.optimism.io/t/governance-update-2/3056",
                        "https://gov.optimism.io/t/draft-operating-manual-v0-2/3234",
                        "https://github.com/ethereum-optimism/OPerating-manual/pull/5",
                        "https://gov.optimism.io/t/introducing-governance-committees/3238",
                        "https://gov.optimism.io/t/grant-proposal-template-v2/3233",
                        "https://gov.optimism.io/t/make-governance-participation-more-accessible-where-is-the-governance-voting/3332/3",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/2",
                        "https://gov.optimism.io/t/another-case-of-self-delegation-of-op-tokens-received-in-grants/3372"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.736714434990297
                },
                {
                    "author_link": "https://gov.optimism.io/u/ben-chain",
                    "index": "2",
                    "likes": "0",
                    "time": "05/08/2022-19:55:12",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/sam92",
                    "index": "4",
                    "likes": "4",
                    "time": "06/08/2022-01:24:14",
                    "content": "such a large distribution for a project that is very less innovative, your team should encourage the issuance of new tokens in projects that use your network, such as rubicon, kwenta and others, have a look at the experience that has happened to the velodrome protocol, see they are so fast growing, better encourage that instead of giving out free op tokens, use your op tokens to create new tokens in new projects ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9121408894136165
                },
                {
                    "author_link": "https://gov.optimism.io/u/0x5959.eth",
                    "index": "5",
                    "likes": "1",
                    "time": "08/08/2022-15:47:02",
                    "content": "Love what team is doing. Stay Optimistic with Optimism. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/mattbtc",
                    "index": "6",
                    "likes": "0",
                    "time": "09/08/2022-07:12:50",
                    "content": "Reflection can make the project go further ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/dxpher",
                    "index": "7",
                    "likes": "1",
                    "time": "07/11/2022-12:17:18",
                    "content": "Wow this Collective is on point ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                }
            ]
        },
        {
            "thread_link": "https://gov.optimism.io/t/governance-update-2/3056",
            "title": "Governance Update #2 ",
            "index": 3056,
            "category": [
                "\\xf0\\x9f\\x93\\xa2 Updates and Announcements",
                "Governance Updates"
            ],
            "tags": [
                "season-1"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/ben-chain",
                    "index": "1",
                    "likes": "35",
                    "time": "21/07/2022-18:43:50",
                    "content": " Voting Underway  Optimism’s Token House is up and running! For the past six weeks, Token House delegates have been reviewing and voting on Governance Fund grant proposals from projects across the Optimism ecosystem. In the first three voting cycles, the Token House approved 36 project grants and rejected 14 proposals. 19.3mm OP has been distributed to projects already. OP Summer is officially in full swing — keep your eyes peeled for news on incentive programs, community funding, and more. For a summary of the first three voting cycles, see the Cycle #1, Cycle #2, or Cycle #3 roundup threads. Voting Cycle 4 is begins today and ends on Wednesday, August 3 at 12p PST. See proposals current up for vote on Snapshot, or in the Cycle #4 roundup thread.  What We’re Learning The Optimism Collective launched with a minimal governance framework and an intention to iterate. To understand what’s working and what’s not, we’ve been collecting feedback from proposal authors, delegates, and other members of our community. We’ve heard a few common themes: There are too many proposals to review. In our current governance structure, every project proposal is put up for a vote by the entire Token House. The Governance Fund received dozens of proposals in the first two voting cycles alone. Ideally, each proposal gets feedback before voting begins; with so many individual votes, this is hard to make happen. There’s no time between voting cycles. Voting cycles run every two weeks. Cycles begin on Thursday at 7p GMT and end 13 days later on Wednesday at 7p GMT. Our hypothesis was that proposal authors would leave their submissions in “draft” mode until they’d received feedback, then submit to a voting cycle when ready. Instead, we’re learning that authors submit to a voting cycle even if they’re received minimal feedback – there are no guidelines suggesting otherwise! This means many delegates both review and vote within the same two week period and don’t have time to get to the incoming “draft” proposals. Some proposals don’t have enough background info. Delegates aren’t familiar with every project submitting a proposal. While some proposals come from well-known crypto projects, others come from smaller or more specific projects unknown to many delegates. In order to evaluate proposals well, delegates have expressed the need for better context-setting and background info, or more time for research. Communication channels are challenging. Our governance process spans Discord, Discourse, and Snapshot. Community members have expressed confusion or frustration at having to track conversations across multiple platforms  Some parts of the governance process are underspecified. v0.1 governance process as defined in the Operating Manual lacks clear instructions on a few situations that have come up in the first two voting cycles: how to re-submit a proposal which previously passed, rules around conflicts of interest, and precise submission deadlines. Lack of alignment on Governance Fund scope. Our governance documentation says the Governance Fund exists to encourage the “proactive growth of the Optimism ecosystem,” and there is a distinct allocation of OP for public goods funding. Nevertheless, there’s still plenty of room for interpretation of “proactive growth.” Should the GovFund be used to compensate development teams? Can closed-source projects apply for funding? Can some public goods be considered as promoting proactive growth despite the separate bucket? There’s been good discussion on these and similar questions in the Discord.  Gov Fund Guidelines As Governance Fund grants are approved are distributed, our community has raised questions about individual projects’ use of the tokens they receive. Teams who receive grants from the Governance Fund must be able to account for all transactions that touch any portion of their grant funds. And while this may be obvious, we expect no self-dealing. If any expenditure can be construed as self-dealing, we expect the team to be clear about this in advance and include why it’s not self-dealing. Withdrawals of the grant from the Optimism network should also be clearly stated and justified. We’re grateful to our community for holding projects accountable to their proposals. Accountability will be a core focus of future governance process iterations.  What’s Next Season 1 of Optimism Collective governance is coming to a close. What does this mean? The Optimism Foundation is working with delegates and community members to shape a set of process upgrades that improve our governance based on the feedback above. We promised this would be an iterative experiment, and we mean it! The next iteration will be considered Season 2. Here’s what to expect:   Season 1 will end after Voting Cycle #4 closes (at 7p GMT on August 3). After Voting Cycle #4, the governance process will take a three-week Reflection Period with no active votes (Aug 4 — Sept 1) During the Reflection Period, the Optimism Foundation will publish (a) a proposed changelog for the v0.2 OPerating Manual, and (b) a set of governance proposals aimed at addressing the feedback we’ve received so far.  While changes to the OPerating Manual don’t require a formal vote, we request that delegates and the broader community provide feedback during the Reflection Period to make this next season the best it can be. Any proposals that require more than a change to the Operating Manual will be put up for Token House vote (e.g. establishing a standalone committee with an up-front budget).    Special Voting Cycle #5 will begin after the Reflection Period and will run for 13 days, from Aug 25 at 7p GMT until Sept 7 at 7p GMT. This voting cycle will include only the process improvements mentioned in (b) above.  Season 2 will begin on September 8 with Voting Cycle #6. The governance process will follow the v0.2 Operating Manual and any new processes approved in Special Voting Cycle #5.  What this means for proposal authors:  The current Voting Cycle #4 is the last set of proposals that will be reviewed until Voting Cycle #6 begins on September 8. Season 2 (beginning with Voting Cycle #6) will include new structure and process. Stay tuned for more information on the new governance flow.  Thank you to our community for their participation, feedback, grace, and humor. And, as always, Stay Optimistic  ",
                    "links": [
                        "https://gov.optimism.io/t/voting-cycle-2-roundup/2754",
                        "https://gov.optimism.io/t/voting-cycle-3-roundup/2923/11",
                        "https://snapshot.org/#/opcollective.eth",
                        "https://gov.optimism.io/t/voting-cycle-4-roundup/3055",
                        "https://community.optimism.io/docs/governance/allocations/",
                        "https://optimism.mirror.xyz/r888e4B5iiNQi-3_mO26ixgv-plQ099XWgqEOv9iWKA",
                        "https://gov.optimism.io/t/voting-cycle-4-roundup/3055/6",
                        "https://gov.optimism.io/t/governance-update-3/3232",
                        "https://gov.optimism.io/t/proposal-pause-phase-1-and-start-a-discussion-round-to-improve-the-governance-process/2858",
                        "https://gov.optimism.io/t/polynya-delegate-communication-thread/3085",
                        "https://gov.optimism.io/t/we-need-to-address-aelin-protocl-gf-phase-0-token-distribution/3484",
                        "https://gov.optimism.io/t/draft-operating-manual-v0-2/3234",
                        "https://gov.optimism.io/t/stablenode-delegate-communication-thread/2973/8"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.750252461740137
                },
                {
                    "author_link": "https://gov.optimism.io/u/NicoEsp",
                    "index": "2",
                    "likes": "2",
                    "time": "21/07/2022-19:01:33",
                    "content": "    ben-chain:  Voting Cycle 4 is begins today and ends on Wednesday, July 20 at 12p PST. See proposals current up for vote on Snapshot , or in the Cycle #4 roundup thread .   Hey @ben-chain date for the Voting Cycle 4 is wrong. I thik you wanted to say August 20 right?  ",
                    "links": [
                        "https://gov.optimism.io/t/voting-cycle-4-roundup/3055"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.642857142857143
                },
                {
                    "author_link": "https://gov.optimism.io/u/katie",
                    "index": "3",
                    "likes": "2",
                    "time": "21/07/2022-19:15:07",
                    "content": "Thank you for the update, looking forward to iterations and improvements on the current governance process! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Axel_T",
                    "index": "4",
                    "likes": "3",
                    "time": "21/07/2022-19:17:16",
                    "content": "Hi @ben-chain It’s good to see things are always a work in progress  I found these stats very interesting, though:     ben-chain:  In the first three voting cycles, the Token House approved 36 project grants and rejected 14 proposals. 19.3mm OP has been distributed to projects already.   How would these break down between Phase 0 and Phase 1, though? I.e. How many successful projects and how much of the 19.33mm OP formed part of Phase 0 which was essentially a batch vote? My line of questioning comes from a position as a prior author of a Proposal, while a lot of your feedback (and issues you want to address) appears to come from the position of delegates. Is this correct? If it is, then my concern is that you are only seeing half the picture. My constructive criticism is if you only address the concerns of delegates then you may end up driving away high quality teams and individuals from participating with and building on Optimism. For example, have you checked the Activity stats of Proposal authors once their votes have been voted down? Are they going to pop up eventually on other L2s or other chains, with their ideas there? My still hopefully constructive criticism is that if you are again only addressing delegator concerns, then Optimism may fall victim to ulterior motives. I don’t want to appear accusatory, but many of the more powerful delegates are not exclusively tied to Optimism, like the OP team is. They may have histories and financial interests across a variety of projects, L2s and other blockchains. This isn’t necessarily bad, but based on the success rate & OP distributions of Phase 1, people are being stamped out at a much faster rate than being let in/lifted up, and this may be leading to cynicism in the builder or entrepreneur community when they engage with the Optimism Governance Fund. Thanks for letting me have my say. Yes I’m biased, too. But I’m just keeping you on your toes and making sure you listen to more of the 360 degrees of biases, and not only ‘time poor’ or ‘confused’ volunteer delegates …who DON’T wish to not un-volunteer & decentralise themselves   My TLDR Feedback: More people should vote Yes/For and let’s see some things f’n go!  Cheers, Axel EDIT: I shouldn’t only have a crack at delegates having ulterior motives. As was seen with that Perpetual Protocol/GrantDAO/Airdrop shemozzle, some people and projects asking for ‘free money’ and incentives don’t always have OP at the top of their list either. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.737114197530864
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "5",
                    "likes": "8",
                    "time": "21/07/2022-19:19:57",
                    "content": "Hi Ben, Thank you for saying this out loud.     ben-chain:  Governance Fund must be able to account for all transactions that touch any portion of their grant funds   I have one more request, not sure if its already planned or not but can we get a dashboard where we can track distributed fund and remaining fund(read only excel will be enough), find info related to delegates(voting power and so on), past proposal(approved and rejected) and other information related to gov. We already have everything but distributed, a simple dashboard with hyperlink to all this pages would help us a lot. On the fund distribution this might be an overkill but it would be great if we can which domain got how much fund, for example, bridging fund, LP fund, dev fund and so on…this will help us in judging the proposal. And we were bugging the whole team with wen OP token, I want to know wen OP Citizen ? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.598214285714286
                },
                {
                    "author_link": "https://gov.optimism.io/u/bobby",
                    "index": "6",
                    "likes": "4",
                    "time": "23/07/2022-19:57:30",
                    "content": "    OPUser:  I have one more request, not sure if its already planned or not but can we get a dashboard where we can track distributed fund and remaining fund(read only excel will be enough), find info related to delegates(voting power and so on), past proposal(approved and rejected) and other information related to gov. We already have everything but distributed, a simple dashboard with hyperlink to all this pages would help us a lot.   We’re working on a public spreadsheet to help with account from governance fund. We don’t plan to maintain a visualization of delegate voting power – doing this in a sheet would get out of date very quickly. Would recommend you use some of the existing tooling on dune or boardroom. Longer-term we’re thinking about the best way to centralize this info to make things eaiser for delegates, grant authors, and other community members. Thank you for the suggestions! ",
                    "links": [
                        "https://boardroom.io/optimism/delegates"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4431089743589745
                },
                {
                    "author_link": "https://gov.optimism.io/u/bobby",
                    "index": "7",
                    "likes": "1",
                    "time": "23/07/2022-19:59:13",
                    "content": " Hey @ben-chain date for the Voting Cycle 4 is wrong. I thik you wanted to say August 20 right?   You’re right, thanks for the shout. Updated the original post  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.646428571428571
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "8",
                    "likes": "4",
                    "time": "28/07/2022-20:53:43",
                    "content": "It will be nice if proposals that stayed in DRAFT waiting for feedback and did not move to READY have some consideration for the next cycle if we are limiting the scope.     ben-chain:  Communication channels are challenging. Our governance process spans Discord, Discourse, and Snapshot. Community members have expressed confusion or frustration at having to track conversations across multiple platforms    Yes please, at least set a gov specific announcement channel in OP discord and tag delegates.     ben-chain:  there’s still plenty of room for interpretation of “proactive growth.”   This is something we need to consider as a community and I’ll be happy to assist any debate proposed for this.     ben-chain:  Teams who receive grants from the Governance Fund must be able to account for all transactions that touch any portion of their grant funds.   If proposals have a roadmap and intended and clear use of OP asked, then OP transfers can be scheduled and there’s no need for OP to transfer the whole batch in just 1 transaction. Consider a committee creation with their own multisig if this is to much work for the foundation.     ben-chain:  The current Voting Cycle #4 is the last set of proposals that will be reviewed until Voting Cycle #6 begins on September 8.   Sorry where is voting Cycle #5 ? Thanks for the hard work! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.759837962962964
                },
                {
                    "author_link": "https://gov.optimism.io/u/NicoEsp",
                    "index": "9",
                    "likes": "4",
                    "time": "28/07/2022-21:19:17",
                    "content": "    Gonna.eth:  Sorry where is voting Cycle #5 ?   I think the date is here      ben-chain:  Special Voting Cycle #5 will begin after the Reflection Period and will run for 13 days, from Aug 25 at 7p GMT until Sept 7 at 7p GMT. This voting cycle will include only the process improvements mentioned in (b) above.   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.821428571428571
                },
                {
                    "author_link": "https://gov.optimism.io/u/homelukai",
                    "index": "10",
                    "likes": "0",
                    "time": "30/07/2022-04:47:24",
                    "content": "Thanks for the informations and updates keep improve more and moe in Governance  !! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.453125
                },
                {
                    "author_link": "https://gov.optimism.io/u/woj.eth",
                    "index": "11",
                    "likes": "1",
                    "time": "31/07/2022-15:35:56",
                    "content": "    ben-chain:  Lack of alignment on Governance Fund scope. Our governance documentation  says the Governance Fund exists to encourage the “proactive growth of the Optimism ecosystem,” and there is a distinct allocation of OP for public goods funding. Nevertheless, there’s still plenty of room for interpretation of “proactive growth.” Should the GovFund be used to compensate development teams? Can closed-source projects apply for funding? Can some public goods be considered as promoting proactive growth despite the separate bucket? There’s been good discussion on these and similar questions in the Discord.   thanks for addressing this! I was definitely confused by this at the start. What discord channel is the right one to follow the discussion?     ben-chain:  Teams who receive grants from the Governance Fund must be able to account for all transactions that touch any portion of their grant funds . And while this may be obvious, we expect no self-dealing. If any expenditure can be construed as self-dealing, we expect the team to be clear about this in advance and include why it’s not self-dealing. Withdrawals of the grant from the Optimism network should also be clearly stated and justified.   this is also a valuable note, i was concerned about sending such large funds to wallets without known identity and only based on promises. thanks for everything and i’m excited for season 2! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.866319444444445
                },
                {
                    "author_link": "https://gov.optimism.io/u/Bobbay_StableLab",
                    "index": "12",
                    "likes": "2",
                    "time": "01/08/2022-08:50:12",
                    "content": "We posted our reflection of season 1 in our Delegate Communication Thread  It touches on a few of the topics based on this post. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Axel_T",
                    "index": "13",
                    "likes": "0",
                    "time": "04/08/2022-03:41:31",
                    "content": "I was a rather bit negative in my earlier reply. So I wanted to say that this section…     ben-chain:    Special Voting Cycle #5 will begin after the Reflection Period and will run for 13 days, from Aug 25 at 7p GMT until Sept 7 at 7p GMT. This voting cycle will include only the process improvements mentioned in (b) above.  Season 2 will begin on September 8 with Voting Cycle #6. The governance process will follow the v0.2 Operating Manual and any new processes approved in Special Voting Cycle #5.    …is very positive. It’s good to know that there are people who are regularly trying to improve things. The activity on this forum is large, and if there is a bit of order to all our opinions, and regular incremental improvements in processes (that is confirmed by community voting), then I think things are very positive over the long term for the Collective and OP. Thanks again for your time, Axel ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.814326298701299
                },
                {
                    "author_link": "https://gov.optimism.io/u/Miso",
                    "index": "14",
                    "likes": "0",
                    "time": "04/08/2022-09:48:53",
                    "content": "Happy to hear that you don’t stop trying to improve. I’m looking forward to the next cycle! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Ixkillax",
                    "index": "15",
                    "likes": "0",
                    "time": "31/12/2022-05:39:36",
                    "content": "Lfg!  Let’s be in unison for the best of Collective Optimism! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                }
            ]
        }
    ],
    "group_index": "174"
}