{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/draft-gf-phase-1-proposal-elk-finance/4981",
            "title": "[DRAFT][GF: Phase 1 Proposal] Elk Finance ",
            "index": 4981,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Grants Council"
            ],
            "tags": [
                "cycle-10",
                "not-passed"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/LtSnakePlissken",
                    "index": "1",
                    "likes": "1",
                    "time": "01/02/2023-03:54:04",
                    "content": "Project name: Elk Finance Author name and contact info (please provide a reliable point of contact for the project): Shylo Cliffe (Telegram: Contact @LtSnakePlissken) I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: Yes I understand that I will be expected to following the public grant reporting requirements outlined here: Yes L2 recipient address: 0x997eBEeE6E89dE030880Cad6d604465549277CC9 Which Voting Cycle are you applying for?: 10 Which sub-committee should review your proposal? (Builders Grants, Growth Experiment Grants): Growth Experiment Grant Project description: Elk Finance is a cross-chain infrastructure project. ElkNet, the heart of the protocol, is responsible for enabling cross-chain communication, value transfer between blockchains, as well as custom secure bridging solutions to and from multiple chains. $ELK, our utility token on which the ecosystem relies, is used for transfers, fee collection, and a route for cross-chain swaps. Elk is a fully composable blockchain interoperability protocol. The ElkNet is currently on 21 chains. On each chain is the ElkDex, which includes an exchange, farms, and staking. Currently running on Uniswap v2 logic, our future plans include concentrated solutions and also adjusted token economics. In the simplest terms, Elk is building infrastructure that enables chain agnostic communication, interoperability, and value transfer for end users - permissionless cross-chain bridging that is easy and accessible to developers and Web3 natives. While not a blockchain, ElkNet validators will be required to stake ELK in order to operate nodes, allowing trustless and decentralized cross-chain solutions managed by unlimited numbers of projects built on top of ElkNet. $ELK is needed to secure and maintain custom bridging solutions created with our ElkNet SDK, what we are calling Bridging-as-a-Service (BaaS). As a major Ethereum Layer 2, Optimism is an important blockchain for the ElkNet to include. In order to sustain the level of interoperability between Optimism and the other chains we are currently deployed on, it is imperative to grow deep liquidity for the ELK/OP pair. This reduces the friction for users moving to Optimism and swapping for the OP token. Farming-as-a-Service (FaaS) will provide projects and protocols the opportunity to build a fully customizable farming solution with no smart-contract knowledge. Our FaaS contracts will be audited and tested thoroughly to ensure safety, security, and reliability. We aim to have a release date for this permissionless liquidity provision in the near future. Cross-chain swaps (CCS) enable real time trustless bridging transactions between all supported blockchains; it’s enabled by an oracle built by Elk Finance for this particular purpose, utilizing the unlimited potential of the ElkNet. Obstacles to the development of a safe CCS system through the ElkNet are being surmounted by our engineering team. With BaaS, FaaS, CCS, and Elk Finance’s other upcoming products, we aim to connect all of DeFi. These products can attract more users to Optimism and expand on-chain use cases, ensuring that Optimism continues to be a central player in the Elk Ecosystem. It won’t be a case of building using ElkNet, but building on ElkNet; the blockchains welcoming Elk’s fragmentation-free cross-chain tech will find themselves on the radar of the next wave of blockchain activity with no borders. Website: https://elk.finance Twitter: @elk_finance Discord/Discourse/Community: http://discord.link/elk_finance Other relevant links (including any demos): dApp: https://app.elk.finance Docs: https://docs.elk.finance Additional team member info (please link):  Team - Elk.Finance Docs Please link to any previous projects the team has meaningfully contributed to: Elk has launched on many chains, but this is the teams only project. Relevant usage metrics (TVL, transactions, volume, unique addresses, etc. Optimism metrics preferred; please link to public sources such as Dune Analytics, etc.): Elk Finance | Cross-chain DEX Analytics Elk: TVL and Stats - DefiLlama Competitors, peers, or similar projects (please link): https://www.Multichain.org routerprotocol.com  Router Protocol | Communicate between blockchain networks  Router Protocol is a Cross Chain Bridge. Currently live on Ethereum, Polygon, and more. Building an interoperable cross chain future of the blockchain ecosystem. Is/will this project be open sourced?: Yes Optimism native?: No Date of deployment/expected deployment on Optimism: 4/30/2022 What is the problem statement this proposal hopes to solve for the Optimism ecosystem?: Optimism is already a blockchain connected to Elk Finance’s Elknet, but with BaaS, FaaS, cross chain swaps, and Elk Finance’s other upcoming products on the horizon, there is a need to direct efforts to deepen liquidity on Elk and improve the experience for OP users. More options for bridging are laudable, but more opportunities for Optimism ecosystem developers to benefit from exciting new technologies from Elk is just good manners. Builders and existing protocols alike will be able to gain cross chain market exposure, drawing engagement with their products without fragmenting their liquidity and keeping transactions on Optimism. How does your proposal offer a value proposition solving the above problem?: The incoming products, SDKs and development incentives will attract more builders, and in-turn, users, to Optimism and expand on-chain usage, ensuring that Optimism continues to be a central player in the Elk Ecosystem and the Ethereum ecosystem at large Why will this solution be a source of growth for the Optimism ecosystem?: We expect this proposal to encourage new builders, as well as those building on other blockchains, to build using our infrastructure on Optimism. This should user interactions for the $ELK, $OP, and BaaS bridged tokens on the Optimistic Ethereum L2. This will, in turn help both Elk and builders deepen liquidity in important LP pools. Has your project previously applied for an OP grant?: [DRAFT] [GF: Phase 1 Proposal] Elk.Finance A majority of the feedback pointed out that the original incentive was not designed to cater for development costs, therefore we have redesigned the entire proposal to be more focused on Optimism builders, and prospective OP users channeled into your ecosystem through our end-user bridge. Those using our Farming-as-a-Service and Bridging-as-a-Service infrastructure will be able to incentivize their users by offering incentives, making Optimism the obvious choice to try these products. The developer opportunities in the future, although indistinct now, should be a major reason to support Elk early in our journey. Number of OP tokens requested: 50000 OP Did the project apply for or receive OP tokens through the Foundation Partner Fund?: No If OP tokens were requested from the Foundation Partner Fund, what was the amount?: N/A How much will your project match in co-incentives? (not required but recommended, when applicable): Elk will increase liquidity mining incentives by 50-100% on applicable farms or distribution channels, as well as allocate extra marketing efforts to Optimism. How will the OP tokens be distributed? (please include % allocated to different initiatives such as user rewards/marketing/liquidity mining. Please also include a justification as to why each of these initiatives align with the problem statement this proposal is solving.): The tokens will be distributed in the ELK-OP, ELK-ETH, and ELK-VELO farms, or any other farm created by FaaS builders that best serves the interest of Optimism Ecosystem and Elk Finance. The ELK-OP farm will get a larger percentage of the rewards. BaaS builders building a bridge to Optimism for their own tokens will be eligible to reward some OP to their users, depending on eligibility. The liquidity incentive distribution will last for 5 weeks: Elk will increase mining incentives on eligble farms built using FaaS by 50-100%. Elk will also incentivise builders who build an eligible custom bridging solution using ElkNet to Optimism by rewarding their users. A great deal of incentivized liquidity and volume on Optimism will trigger our internal mechanisms designed to result in an increase in ELK distribution to Optimism compared to our other blockchains. Sustaining activity and volume on-chain is the goal here. To attract new builders from other chains/ecosystems and showcase Optimisim projects, a portion of the the OP incentives will incentivize the farms created by new and innovative projects using our FaaS, as well as those who deploy a custom bridge to the Optimism chain. We will also showcase up to 14 Optimisim Native partner projects with our new FaaS Farms. The showcased projects will encourage more projects to build, lead to more AMA’s and co-marketing, as well as drawing in both Elk users and 3rd party users of projects utilizing our infrastructure that may have not visited the Optimisim ecosystem yet. This will draw increased volume, encourage interest in Optimism projects, and motivate users to purchase the OP token for farming and other functions. Finally, it should be noted that Elk provides Impermanent Loss Protection to Elk farms, thus OP and other Elk farms will be protected against market fluctuation if the builders so choose to implement this feature. During the distribution of the incentives and beyond; 100% increase in TVL on ElkDex 100% increase in volume on ElkDex Targeted marketing efforts for Optimism across all our social media and community channels, as well as additional marketing from builders using our infrastructure and the OP incentives we will be able to reward. Over what period of time will the tokens be distributed for each initiative? Shorter timelines are preferable to longer timelines. Shorter timelines (on the order of weeks) allow teams to quickly demonstrate achievement of milestones, better facilitating additional grants via subsequent proposals: The liquidity incentive distribution will last for 5 weeks: Elk will increase mining incentives on applicable builder created farms by 50-100% and incentivize the building of bridges into the Optimism Ecosystem. Please clearly define the milestones you expect to achieve in order to receive milestone based installments. Please consider how each milestone relates to incentivizing sustainable usage and liquidity on Optimism. Progress towards each milestone must be trackable: We hope to receive the reward to immediately incentivise liquidity on Optimism farms once FaaS is available, but are willing to take/reward them in small milestones and boost FaaS and non-FaaS farms based on their TVL/emissions. Why will incentivized users and liquidity on Optimism remain after incentives dry up?: Once builders are able to build bridges into the Optimism Ecosystem, most will remain, as it is affordable and easy to maintain. Users and liquidity providers will be sufficiently incentivized to keep their LP on Optimism following the continued product development by our engineers, as well as other builders. Products such as Farming-as-a-Service and Bridging-as-a-Service will provide more utility to Optimism, helping incentivize users to keep their liquidity with Elk’s LP pairs on the Optimism chain. Please provide any additional information that will facilitate accountability (smart contracts addresses relevant to the proposal, relevant organizational wallet addresses, etc.): Deployed Optimism Contract Addresses: Optimism - Elk.Finance Docs Organizational Wallet Addresses: Community Wallet: 0xE1c0e5AC8aB0Dab88E682B9a8653Bc7a943fB80F Expenses Wallet: 0x997eBEeE6E89dE030880Cad6d604465549277CC9 Confirm you have read and agree to the Eligibility Restrictions (here): I have read the Eligibility Restrictions and agree to abide by their conditions. Elk Finance will comply with the 1 year lockup rule for Builder’s Grants, as the OP will only be distributed to builders for their LP farmers and custom bridge users in the Optimism Ecosystem to facilitate growth of volume and total value. ",
                    "links": [
                        "https://gov.optimism.io/t/suggested-public-reporting-requirements-for-grantees/4176",
                        "https://elk.finance/",
                        "http://discord.link/elk_finance",
                        "https://app.elk.finance/",
                        "https://docs.elk.finance/",
                        "https://docs.elk.finance/team",
                        "https://info.elk.finance/optimism/home",
                        "https://defillama.com/protocol/elk",
                        "https://www.multichain.org/",
                        "https://www.routerprotocol.com/",
                        "https://www.routerprotocol.com/",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-elk-finance/2895",
                        "https://docs.elk.finance/addresses/optimism",
                        "https://gov.optimism.io/t/grant-proposal-template/3233"
                    ],
                    "GPT-summary": "The post is a draft proposal for Elk Finance, a cross-chain infrastructure project that enables chain agnostic communication, interoperability, and value transfer for end-users. The proposal aims to deepen liquidity on Elk and improve the experience for OP users by providing more options for bridging and opportunities for Optimism ecosystem developers to benefit from exciting new technologies from Elk. The proposal also includes details on the project's products, SDKs, and development incentives. The post does not include any negative feedback or constructive criticism.",
                    "GPT-proposal-categories": [
                        "Interoperability and Scaleability",
                        "Token economics",
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Law and regulations"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.7839567457336045
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "2",
                    "likes": "0",
                    "time": "01/02/2023-17:47:21",
                    "content": "Original proposal archived here: [DRAFT][GF: Phase 1] Elk Finance [ARCHIVED ORIGINAL - #9 by LtSnakePlissken ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/LtSnakePlissken",
                    "index": "3",
                    "likes": "1",
                    "time": "06/02/2023-04:01:11",
                    "content": "@lavande I’d like to add a comment to the proposal, as @danelund.eth kindly reached out to me about this fact. Would we be able to add the following comment please? Elk Finance will comply with the 1 year lockup rule for Builder’s Grants, as the OP will only be distributed to LP farmers in the Optimism Ecosystem to facilitate growth of volume and total value. Thank you very much! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.1875
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "4",
                    "likes": "1",
                    "time": "06/02/2023-11:34:37",
                    "content": "Hi @LtSnakePlissken thank you for making this proposal! You applied for the Builders subcommittee whose finality is to “maximize the number of developers building on Optimism”** After reading carefully I feel this proposal is more suited for Growth Subcommittee  whose finality is to “maximize the number of users interacting with applications on Optimism” @danelund.eth can help you out transitioning from one committee to the other. I leave here a few quotes that lead to this conclusion:     LtSnakePlissken:  How does your proposal offer a value proposition solving the above problem?: The incoming products, SDKs and end-user benefits will attract more users to Optimism       LtSnakePlissken:  we have redesigned the entire proposal to be more focussed on OP users, and prospective OP users channeled into your ecosystem       LtSnakePlissken:  To attract new users from other chains and showcase Optimisim projects, a portion of the the OP incentives will incentivize the ELK-OP and/or OP-ETH pairing.   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.543181818181818
                },
                {
                    "author_link": "https://gov.optimism.io/u/LtSnakePlissken",
                    "index": "5",
                    "likes": "1",
                    "time": "06/02/2023-17:18:41",
                    "content": "Hi @Gonna.eth, thank you very much for pointing this out. I think we can revise the proposal here for BaaS and FaaS, rewarding builders for building using our SDK, and users using those products to incentivize growth. So I think we’ll stay in this category, but I will post a revised version of this proposal shortly. Again, thank you so much for taking the time and effort to provide the feedback and read the proposal. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.2
                },
                {
                    "author_link": "https://gov.optimism.io/u/LtSnakePlissken",
                    "index": "6",
                    "likes": "1",
                    "time": "06/02/2023-17:34:12",
                    "content": "Project name: Elk Finance Author name and contact info (please provide a reliable point of contact for the project): Shylo Cliffe (Telegram: Contact @LtSnakePlissken) I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: Yes I understand that I will be expected to following the public grant reporting requirements outlined here: Yes L2 recipient address: 0x997eBEeE6E89dE030880Cad6d604465549277CC9 Which Voting Cycle are you applying for?: 10 Which sub-committee should review your proposal? (Builders Grants, Growth Experiment Grants): Builders Grants Project description: Elk Finance is a cross-chain infrastructure project. ElkNet, the heart of the protocol, is responsible for enabling cross-chain communication, value transfer between blockchains, as well as custom secure bridging solutions to and from multiple chains. $ELK, our utility token on which the ecosystem relies, is used for transfers, fee collection, and a route for cross-chain swaps. The ElkNet is currently on 21 chains. On each chain is the ElkDex, which includes an exchange, farms, and staking. Currently running on Uniswap v2 logic, our future plans include concentrated solutions and also adjusted token economics. In the simplest terms, Elk is building infrastructure that enables chain agnostic communication, interoperability, and value transfer for end users - permissionless cross-chain bridging that is easy and accessible to developers and Web3 natives. While not a blockchain, ElkNet validators will be required to stake ELK in order to operate nodes, allowing trustless and decentralized cross-chain solutions managed by unlimited numbers of projects built on top of ElkNet. $ELK is needed to secure and maintain custom bridging solutions created with our ElkNet SDK, what we are calling Bridging-as-a-Service (BaaS). As a major Ethereum Layer 2, Optimism is an important blockchain for the ElkNet to include. In order to sustain the level of interoperability between Optimism and the other chains we are currently deployed on, it is imperative to grow deep liquidity for the ELK/OP pair. This reduces the friction for users moving to Optimism and swapping for the OP token. Farming-as-a-Service (FaaS) will provide projects and protocols the opportunity to build a fully customizable farming solution with no smart-contract knowledge. Our FaaS contracts will be audited and tested thoroughly to ensure safety, security, and reliability. We aim to have a release date for this permissionless liquidity provision in the near future. Cross-chain swaps (CCS) enable real time trustless bridging transactions between all supported blockchains; it’s enabled by an oracle built by Elk Finance for this particular purpose, utilizing the unlimited potential of the ElkNet. Obstacles to the development of a safe CCS system through the ElkNet are being surmounted by our engineering team. With BaaS, FaaS, CCS, and Elk Finance’s other upcoming products, we aim to connect all of DeFi. These products can attract more users to Optimism and expand on-chain use cases, ensuring that Optimism continues to be a central player in the Elk Ecosystem. It won’t be a case of building using ElkNet, but building on ElkNet; the blockchains welcoming Elk’s fragmentation-free cross-chain tech will find themselves on the radar of the next wave of blockchain activity with no borders. Website: https://elk.finance Twitter: @elk_finance Discord/Discourse/Community: http://discord.link/elk_finance Other relevant links (including any demos): dApp: https://app.elk.finance Docs: https://docs.elk.finance Additional team member info (please link):  Team - Elk.Finance Docs Please link to any previous projects the team has meaningfully contributed to: Elk has launched on many chains, but this is the teams only project. Relevant usage metrics (TVL, transactions, volume, unique addresses, etc. Optimism metrics preferred; please link to public sources such as Dune Analytics, etc.): Elk Finance | Cross-chain DEX Analytics Elk: TVL and Stats - DefiLlama Competitors, peers, or similar projects (please link): https://www.Multichain.org   routerprotocol.com   Router Protocol | Communicate between blockchain networks Router Protocol is a Cross Chain Bridge. Currently live on Ethereum, Polygon, and more. Building an interoperable cross chain future of the blockchain ecosystem.      Is/will this project be open sourced?: Yes Optimism native?: No Date of deployment/expected deployment on Optimism: 4/30/2022 What is the problem statement this proposal hopes to solve for the Optimism ecosystem?: Optimism is already a blockchain connected to Elk Finance’s Elknet, but with BaaS, FaaS, cross chain swaps, and Elk Finance’s other upcoming products on the horizon, there is a need to direct efforts to deepen liquidity on Elk and improve the experience for OP users. More options for bridging are laudable, but more opportunities for OP ecosystem developers to benefit from exciting new technologies from Elk is just good manners. . How does your proposal offer a value proposition solving the above problem?: The incoming products, SDKs and development incentives will attract more builders, and in-turn, users, to Optimism and expand on-chain usage, ensuring that Optimism continues to be a central player in the Elk Ecosystem and the Ethereum ecosystem at large Why will this solution be a source of growth for the Optimism ecosystem?: We expect this proposal to encourage new builders, as well as those building on other blockchains, to build using our infrastructure on Optimism. This should user interactions for the $ELK, $OP, and BaaS bridged tokens on the Optimistic Ethereum L2. This will, in turn help both Elk and builders deepen liquidity in important LP pools. Has your project previously applied for an OP grant?: [DRAFT] [GF: Phase 1 Proposal] Elk.Finance A majority of the feedback pointed out that the original incentive was not designed to cater for development costs, therefore we have redesigned the entire proposal to be more focused on Optimism builders, and prospective OP users channeled into your ecosystem through our end-user bridge. Those using our Farming-as-a-Service and Bridging-as-a-Service infrastructure will be able to incentivize their users by offering incentives, making Optimism the obvious choice to try these products. The developer opportunities in the future, although indistinct now, should be a major reason to support Elk early in our journey. Number of OP tokens requested: 50000 OP Did the project apply for or receive OP tokens through the Foundation Partner Fund?: No If OP tokens were requested from the Foundation Partner Fund, what was the amount?: N/A How much will your project match in co-incentives? (not required but recommended, when applicable): Elk will increase liquidity mining incentives by 50-100% on applicable farms or distribution channels, as well as allocate extra marketing efforts to Optimism. How will the OP tokens be distributed? (please include % allocated to different initiatives such as user rewards/marketing/liquidity mining. Please also include a justification as to why each of these initiatives align with the problem statement this proposal is solving.): The tokens will be distributed in the ELK-OP, ELK-ETH, and ELK-VELO farms, or any other farm created by FaaS builders that best serves the interest of Optimism Ecosystem and Elk Finance. The ELK-OP farm will get a larger percentage of the rewards. BaaS builders building a bridge to Optimism for their own tokens will be eligible to reward some OP to their users, depending on eligibility. The liquidity incentive distribution will last for 5 weeks: Elk will increase mining incentives on eligble farms built using FaaS by 50-100%. Elk will also incentivise builders who build an eligible custom bridging solution using ElkNet to Optimism by rewarding their users. A great deal of incentivized liquidity and volume on Optimism will trigger our internal mechanisms designed to result in an increase in ELK distribution to Optimism compared to our other blockchains. Sustaining activity and volume on-chain is the goal here. To attract new builders from other chains/ecosystems and showcase Optimisim projects, a portion of the the OP incentives will incentivize the farms created by new and innovative projects using our FaaS, as well as those who deploy a custom bridge to the Optimism chain. We will also showcase up to 14 Optimisim Native partner projects with our new FaaS Farms. The showcased projects will encourage more projects to build, lead to more AMA’s and co-marketing, as well as drawing in both Elk users and 3rd party users of projects utilizing our infrastructure that may have not visited the Optimisim ecosystem yet. This will draw increased volume, encourage interest in Optimism projects, and motivate users to purchase the OP token for farming and other functions. Finally, it should be noted that Elk provides Impermanent Loss Protection to Elk farms, thus OP and other Elk farms will be protected against market fluctuation if the builders so choose to implement this feature. During the distribution of the incentives and beyond; 100% increase in TVL on ElkDex 100% increase in volume on ElkDex Targeted marketing efforts for Optimism across all our social media and community channels, as well as additional marketing from builders using our infrastructure and the OP incentives we will be able to reward. Over what period of time will the tokens be distributed for each initiative? Shorter timelines are preferable to longer timelines. Shorter timelines (on the order of weeks) allow teams to quickly demonstrate achievement of milestones, better facilitating additional grants via subsequent proposals: The liquidity incentive distribution will last for 5 weeks: Elk will increase mining incentives on applicable builder created farms by 50-100% and incentivize the building of bridges into the Optimism Ecosystem. Please clearly define the milestones you expect to achieve in order to receive milestone based installments. Please consider how each milestone relates to incentivizing sustainable usage and liquidity on Optimism. Progress towards each milestone must be trackable: We hope to receive the reward to immediately incentivise liquidity on Optimism farms once FaaS is available, but are willing to take them in small milestones and boost farms based on their TVL/emissions. Why will incentivized users and liquidity on Optimism remain after incentives dry up?: Once builders are able to build bridges into the Optimism Ecosystem, most will remain, as it is affordable and easy to maintain. Users and liquidity providers will be sufficiently incentivized to keep their LP on Optimism following the continued product development by our engineers, as well as other builders. Products such as Farming-as-a-Service and Bridging-as-a-Service will provide more utility to Optimism, helping incentivize users to keep their liquidity with Elk’s LP pairs on the Optimism chain. Please provide any additional information that will facilitate accountability (smart contracts addresses relevant to the proposal, relevant organizational wallet addresses, etc.): Deployed Optimism Contract Addresses: Optimism - Elk.Finance Docs Organizational Wallet Addresses: Community Wallet: 0xE1c0e5AC8aB0Dab88E682B9a8653Bc7a943fB80F Expenses Wallet: 0x997eBEeE6E89dE030880Cad6d604465549277CC9 Confirm you have read and agree to the Eligibility Restrictions (here): I have read the Eligibility Restrictions and agree to abide by their conditions ",
                    "links": [
                        "https://gov.optimism.io/t/suggested-public-reporting-requirements-for-grantees/4176",
                        "https://elk.finance/",
                        "http://discord.link/elk_finance",
                        "https://app.elk.finance/",
                        "https://docs.elk.finance/",
                        "https://docs.elk.finance/team",
                        "https://info.elk.finance/optimism/home",
                        "https://defillama.com/protocol/elk",
                        "https://www.multichain.org/",
                        "https://www.routerprotocol.com/",
                        "https://www.routerprotocol.com/",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-elk-finance/2895",
                        "https://docs.elk.finance/addresses/optimism",
                        "https://gov.optimism.io/t/grant-proposal-template/3233"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.828523846842812
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "7",
                    "likes": "2",
                    "time": "08/02/2023-06:25:05",
                    "content": "are you going to be okay with not being able to use these tokens for a year? that’s what the requirement is for builder grants ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/kingstonbaba",
                    "index": "8",
                    "likes": "2",
                    "time": "08/02/2023-19:50:46",
                    "content": "Elk is one project that I am very passionate about. Its more like a long term project with an amazing prospect when it comes to DEFI. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.23125
                },
                {
                    "author_link": "https://gov.optimism.io/u/LtSnakePlissken",
                    "index": "9",
                    "likes": "1",
                    "time": "09/02/2023-18:18:13",
                    "content": "Hi! Thanks for the comment! Yes we are okay with waiting one year for the tokens allocated to building incentives if needed. I know it was noted in the AMA that liquidity mining incentives are not held to this rule, which we can use to give to FaaS/BaaS builders creating farms. Then, we can have more incentives remaining for the year after for more builders, which could be advantagous. It would also be fine if we worked out something with the DAO about rewarding it to builders sooner. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.222222222222222
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "10",
                    "likes": "2",
                    "time": "09/02/2023-18:21:56",
                    "content": "I don’t think we have precedent for splitting applications between pathways, and in any case the bulk of the ask is tilted toward liq mining. My suggestion is to route this through growth experiments and, because the features you’re describing are already in the pipeline, to build them and apply for RPGF when the time comes. You could well see a grant come in sooner that way. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/LtSnakePlissken",
                    "index": "12",
                    "likes": "2",
                    "time": "09/02/2023-18:31:42",
                    "content": "Alright, thank you for the input! We really appreciate it, I see what you are saying. I have just edited the proposal to note that we are changing to the growth path, hopefully that works! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "13",
                    "likes": "2",
                    "time": "09/02/2023-18:44:46",
                    "content": "You have 24 hours to make the adjustments – you also may just want to punt to Cycle 11 to give yourselves some breathing room. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/LtSnakePlissken",
                    "index": "14",
                    "likes": "1",
                    "time": "09/02/2023-20:17:00",
                    "content": "Thank you for that! I’ve asked the team to review and made the changes to the current proposal so that it makes sense for cycle 10, if that works for you! If there are any other last-minute changes, we will absolutely make them before it is due! Again, we really appreciate the guidance  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.1187499999999995
                }
            ]
        },
        {
            "thread_link": "https://gov.optimism.io/t/draft-gf-phase-1-elk-finance-archived-original/4541",
            "title": "[DRAFT][GF: Phase 1] Elk Finance [ARCHIVED ORIGINAL ",
            "index": 4541,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Archive"
            ],
            "tags": [
                "season-3",
                "cycle-10"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/LtSnakePlissken",
                    "index": "1",
                    "likes": "7",
                    "time": "12/01/2023-01:43:58",
                    "content": "Project name: Elk Finance Author name and contact info: LtSnakePlissken I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: Yes L2 recipient address: 0x997eBEeE6E89dE030880Cad6d604465549277CC9 Which Voting Cycle are you applying for?: Season 3, Voting Cycle 10 Grant category: DeFi Is this proposal applicable to a specific committee? DeFi Committee Project description: Elk Finance is a cross-chain infrastructure project. ElkNet, the heart of the protocol, is responsible for enabling cross-chain communication, value transfer between blockchains, as well as custom secure bridging solutions to and from multiple chains. $ELK, our utility token on which the ecosystem relies, is used for transfers, fee collection, and a route for cross-chain swaps. The ElkNet is currently on 21 chains. On each chain is the ElkDex, which includes an exchange, farms, and staking. Currently running on Uniswap v2 logic, our future plans include concentrated solutions and also adjusted token economics. In the simplest terms, Elk is building infrastructure that enables chain agnostic communication, interoperability, and value transfer for end users - permissionless cross-chain bridging that is easy and accessible to developers and Web3 natives. While not a blockchain, ElkNet validators will be required to stake ELK in order to operate nodes, allowing trustless and decentralized cross-chain solutions managed by unlimited numbers of projects built on top of ElkNet. $ELK is needed to secure and maintain custom bridging solutions created with our ElkNet SDK, what we are calling Bridging-as-a-Service (BaaS). As a major Ethereum Layer 2, Optimism is an important blockchain for the ElkNet to include. In order to sustain the level of interoperability between Optimism and the other chains we are currently deployed on, it is imperative to grow deep liquidity for the ELK/OP pair. This reduces the friction for users moving to Optimism and swapping for the OP token. Farming-as-a-Service (FaaS) will provide projects and protocols the opportunity to build a fully customizable farming solution with no smart-contract knowledge. Our FaaS contracts will be audited and tested thoroughly to ensure safety, security, and reliability. We aim to have a release date for this permissionless liquidity provision in the near future. Cross-chain swaps (CCS) enable real time trustless bridging transactions between all supported blockchains; it’s enabled by an oracle built by Elk Finance for this particular purpose, utilizing the unlimited potential of the ElkNet. Obstacles to the development of a safe CCS system through the ElkNet are being surmounted by our engineering team. With BaaS, FaaS, CCS, and Elk Finance’s other upcoming products, we aim to connect all of DeFi. These products can attract more users to Optimism and expand on-chain use cases, ensuring that Optimism continues to be a central player in the Elk Ecosystem. It won’t be a case of building using ElkNet, but building on ElkNet; the blockchains welcoming Elk’s fragmentation-free cross-chain tech will find themselves on the radar of the next wave of blockchain activity with no borders. We expect this proposal to contribute to increased usage of both the ELK and OP token on the Optimistic Ethereum L2. Data from similar ecosystem/DAO/foundation Elk-supporting endeavors showed a sharp rise in volume and usage of ElkNet on-chain. Opening doors and preparing for the future. One example is when the Gnosis Chain helped to secure ~600% increase in liquidity growth. Project links:  Website: Elk Finance  Twitter: Elk Finance: Cross-Chain Architecture (@elk_finance) / Twitter  Discord/Discourse/Community: Elk Finance  Please include all other relevant links below:  Elk Finance | Linktree Additional team member info (please link): Link to Team Section of Elk Docs Relevant usage metrics:  TVL on Optimism: $41.02k 1  TVL across all chains: $1.9M 1  Weekly volume: $210,779 1   Competitors, peers, or similar projects: Multichain, Layerzero Is/will this project be open sourced? After leaving beta Optimism native?: No Date of deployment/expected deployment on Optimism: Currently Deployed Support: This grant is supported by Velodrome Finance Ecosystem Value Proposition: Optimism is already a blockchain connected to Elk Finance’s Elknet, but with BaaS, FaaS, cross chain swaps, and Elk Finance’s other upcoming products on the horizon, there is a need to direct efforts to deepen liquidity on Elk and improve the experience for OP users. More options for bridging are laudable, but more opportunities for OP ecosystem developers to benefit from exciting new technologies from Elk is just good manners. . The incoming products, SDKs and end-user benefits will attract more users to Optimism and expand on-chain usage, ensuring that Optimism continues to be a central player in the Elk Ecosystem and the Ethereum ecosystem at large We expect this proposal to increase user interactions for both ELK and OP token on the Optimistic Ethereum L2 and more importantly help deepen liquidity in important $ELK Pools. Has your project previously applied for an OP grant?:     [DRAFT] [GF: Phase 1 Proposal] Elk.Finance Governance Fund: Phase 1       Project Name: Elk.Finance  Author Name: Thundercat  Number of OP tokens requested: 140,000 $OP  L2 Recipient Address: 0xE1c0e5AC8aB0Dab88E682B9a8653Bc7a943fB80F  Relevant Usage Metrics: (TVL, transactions, volume, unique addresses, etc.)  Overall, the ElkNet has helped 52,000 Unique addresses transfer value, facilitating 324,597 transfers totaling 119,383,245 $ELK. Our multi-chain TVL sits around 3.1M, with a volume of around 400,000.  On Optimism, since May 4th, the ElkNet has facilitated 470 t…     A majority of the feedback pointed out that the original incentive was not designed to cater for development costs, therefore we have redesigned the entire proposal to be more focussed on OP users, and prospective OP users channeled into your ecosystem through our end-user bridge. The developer opportunities in the future, although indistinct now, should be a major reason to support Elk early in our journey. Number of OP tokens requested: 50000 OP Did the project apply for or receive OP tokens through the Foundation Partner Fund?: No If OP tokens were requested from the Foundation Partner Fund, what was the amount?: N/A How much will your project match in co-incentives?: Elk will increase liquidity mining incentives by 50-100% on applicable farms or distribution channels, as well as allocate extra marketing efforts to Optimism. Proposal for token distribution: The tokens will primarily be distributed in the ELK-OP, ELK-ETH, and ELK-VELO farm or any other farm that best serves the interest of Optimism Ecosystem and Elk Finance. The ELK-OP farm will get a larger percentage of the rewards The liquidity incentive distribution will last for 5 weeks: Elk will increase mining incentives on applicable farms by 50-100% A great deal of incentivized liquidity and volume on Optimism will trigger our internal mechanisms designed to result in an increase in ELK distribution to Optimism compared to our other blockchains. Sustaining activity and volume on-chain is the goal here. In addition, users and liquidity providers will be sufficiently incentivized to keep their LP on Optimism following the continued product development by our engineers. To attract new users from other chains and showcase Optimisim projects, a portion of the the OP incentives will incentivize the ELK-OP and/or OP-ETH pairing. We will also showcase up to 14 Optimisim Native partner projects with our new FaaS Farms.  The showcased projects will encourage AMA’s and co-marketing, drawing in users that may have not visited the Optimisim ecosystem yet. This will draw increased volume, encourage interest in Optimism projects, and motivate users to purchase the OP token for farming and other functions. Finally, it should be noted that Elk provides Impermanent Loss Protection to Elk farms, thus OP and other Elk farms will be protected against market fluctuation. During the distribution of the incentives and beyond; 100% increase in TVL on ElkDex 100% increase in volume on ElkDex Targeted marketing efforts for Optimism across all our social media and community channels. Please provide any additional information that will facilitate accountability:(smart contracts addresses relevant to the proposal, relevant organizational wallet addresses, etc.) Deployed Optimism Contract Addresses: https://docs.elk.finance/addresses/optimism Organizational Wallet Addresses: Community Wallet: 0xE1c0e5AC8aB0Dab88E682B9a8653Bc7a943fB80F Expenses Wallet: 0x997eBEeE6E89dE030880Cad6d604465549277CC9 ",
                    "links": [
                        "https://twitter.com/elk_finance",
                        "https://discord.gg/9HGABequgw",
                        "https://linktr.ee/elk_finance",
                        "https://docs.elk.finance/team",
                        "https://defillama.com/protocol/elk?denomination=USD",
                        "https://defillama.com/protocol/elk?denomination=USD",
                        "https://defillama.com/protocol/elk?denomination=USD",
                        "https://multichain.xyz",
                        "https://layerzero.network",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-elk-finance/2895",
                        "https://docs.elk.finance/addresses/optimism"
                    ],
                    "GPT-summary": "The post is a proposal for a grant from the Optimism Foundation for Elk Finance, a cross-chain infrastructure project. The proposal explains the project's goals, including enabling cross-chain communication and value transfer, and the use of the $ELK token. The post also includes relevant usage metrics and information on how the grant will be used to deepen liquidity on Elk and improve the experience for OP users. The post also includes positive feedback from a 3rd party and extends an invitation to collaborate.",
                    "GPT-proposal-categories": [
                        "Token economics",
                        "Interoperability and scalability",
                        "Grants, funding and resource allocation",
                        "Community and engagement",
                        "Law and regulations"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.700002516862982
                },
                {
                    "author_link": "https://gov.optimism.io/u/sajjadjohari76",
                    "index": "2",
                    "likes": "4",
                    "time": "13/01/2023-19:10:59",
                    "content": "Go to the moon Perfect ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/ksknkripto",
                    "index": "3",
                    "likes": "2",
                    "time": "13/01/2023-21:04:52",
                    "content": "Elk looks like a development platform. There is a need for improvement, especially in visual design. Light green color is eye catching. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/jacopo",
                    "index": "4",
                    "likes": "2",
                    "time": "24/01/2023-01:53:29",
                    "content": "yes please!!! give the grant to this project!!! I am using it since 2021, and I frequently jump from a chain to another and never been disappointed. The only issues are related to low liquidity and high price impacts for big amounts, since it is still not known by the mass and there is still few liquidity providers, but that’s only matter of money and low usage! The dapp works well and with the upcoming features this project will rock a lot and many more liquidity providers will come because it’s really helpful and the most unexpensive bridge I ever found around. And it is not wrapping tokens from a chain to another! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.405357142857143
                },
                {
                    "author_link": "https://gov.optimism.io/u/romario",
                    "index": "5",
                    "likes": "3",
                    "time": "24/01/2023-05:02:46",
                    "content": "everything is great, very fast and safe sylr ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.6
                },
                {
                    "author_link": "https://gov.optimism.io/u/Mike_fast",
                    "index": "6",
                    "likes": "2",
                    "time": "24/01/2023-11:26:06",
                    "content": "I’ve been using this bridge for most of my dealings in the last 1.5 years. There are some very interesting new thinking ideas in Elk, for instance cross-chain proxy assets, their reservoir system instead of mint and sync etc. I can see few negatives in supporting liquidity mining incentives with ELK. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.113636363636363
                },
                {
                    "author_link": "https://gov.optimism.io/u/lekhcando",
                    "index": "7",
                    "likes": "2",
                    "time": "24/01/2023-11:43:16",
                    "content": "Amazing project!! Hard working team!! So many real use case building. This project will be bring attention to many investors in coming days. At the moment your support is important. Elknet is really  Easy to use. Protects investors from impermanent loss. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.796502976190477
                },
                {
                    "author_link": "https://gov.optimism.io/u/Final",
                    "index": "8",
                    "likes": "1",
                    "time": "26/01/2023-09:57:42",
                    "content": "Elk is really building a lot, integrates over 20 different chains, and most importantly the developers are preffesional, helpful, and the team is always very transparent. I am sure they have big updates planned and implementing OP can bring great benefits for both of us ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 6.625
                },
                {
                    "author_link": "https://gov.optimism.io/u/LtSnakePlissken",
                    "index": "9",
                    "likes": "0",
                    "time": "31/01/2023-16:38:15",
                    "content": "Yes, we are indeed infrastructure focused. Thank you for your suggestions! We’ve worked hard on the app.elk.finance dApp to make it useful and aesthetically pleasing. Any specific suggestions on how to further improve the look and/or feel would be welcome!  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.008333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "10",
                    "likes": "0",
                    "time": "01/02/2023-17:47:03",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "414"
}