{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/draft-airdrop-2-proposal-ethereum-validator-node-operators/2962",
            "title": "[DRAFT] [Airdrop #2: Proposal] Ethereum Validator & Node Operators ",
            "index": 2962,
            "category": [],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/GLCstaked",
                    "index": "1",
                    "likes": "11",
                    "time": "12/07/2022-15:05:28",
                    "content": "Proposal to Airdrop $OP to Ethereum Network Validators Authors: GLCstaked (Discord: GC23997#6415) Intent: Include Ethereum network validators in $OP token distribution. This proposal targets solo validators who made at least one deposit to the Beacon Chain. This proposal excludes LSD (liquid staking derivative) token holders and staking as a service customers. To bring value and longevity to Optimism by onboarding ecosystem-aligned actors who have proven their early dedication to Ethereum. These Beacon Chain depositors are likely to partake in governance and node operations on Layer 2, arguably more so than basic users of Optimism. This proposal sets a precedent to incentivize those actors who have been working to further decentralise the L1 validator set. Incentivizing Ethereum validators benefits both Ethereum the base layer and Optimism network, reaffirming Optimism’s goal to fund public goods in the broader ecosystem, and we expect that other L2 protocols will follow this precedent. Recipients: total 10,182 Addresses from this list ETH-Solo-Validator-Addresses/Validator List.csv at main · GLCNI/ETH-Solo-Validator-Addresses · GitHub Tokens claimed on Optimism network, To the same address on L2. Airdrop Allocation: 3.2% of the remaining 14% future airdrop allocation OP: 601,295,421. Which is a Total OP: 137,438,953 of the Total OP Supply: 4,294,967,296 This leaves 10.8% of OP supply for future airdrops.  OP ALLOC775×379 87 KB  Token distribution: 137,438,953 OP to be distributed equally to all eligible addresses. Rewards on the basis on whether an eligible deposit was made and not number of validators, the list contains all unique addresses that made a valid deposit to the Beacon Chain, addresses belonging to centralised exchanges (such as Coinbase/Kraken), LSD services (such as Lido/Stakewise) and contracts have been removed. Data from https://ethsta.com/, more information can be found on the filter list. Previous discussions/links: Airdrop Ethereum Validators (Beacon Chain Contract Depositors) https://www.reddit.com/r/ethfinance/comments/udbwlm/beacon_chain_validators_should_be_included_in_l2/ Optimism Alignment: Digital democratic governance optimised to drive rapid and sustained growth of a decentralised ecosystem. The Optimism Collective will dispel the myth that public goods cannot be profitable. The Collective will consistently provide massive retroactive incentives for public goods which benefit Optimism, Ethereum, and the Collective as a whole. Distribution is highly important, not only wide but also targeted to the right set of stakeholders. Rewarding ecosystem aligned participants will bring value to Optimism governance. Validators have locked ETH and operate nodes to secure Ethereum via proof-of-take consensus, this is the fundamental infrastructure layer for Ethereum. Once deposited to the beacon chain contract validators have committed a non-trivial amount of capital until the merge, they must be positioned for long term success of Ethereum. They must provide physical infrastructure or pay for it to keep your validator active on the Network, which incurs electricity costs, hardware costs, internet provider costs and time/effort for maintenance. Validators will have: Proven: aptitude to run node operations and service the network Proven: long term alignment with Ethereum, especially pre-merge Proven: ‘proof of work’ actual resources and effort is spent to secure the network, and this cannot be gamed. As such, validators should have a say in the development of L2 networks, and would be a set of participants that bring value to L2 and a strong foundation of network shareholders primed to run the decentralised node set of the L2. Benefits to Optimism & Ethereum: We believe this is not only value additive to Optimism, but mutually beneficial to both networks For Optimism Onboard a strong set of ecosystem aligned users, interested in long term sustainable models, Which participate in governance and public goods funding. Value to governance: this set consists of builders/devs & very dedicated early supporters, proven by commitment to early risk pre-merge, It would be valuable to have these as stakeholders in Optimism. Those responsible for the base networks security/infrastructure should have voice in the direction of layer 2. Strengthen the future node set of Optimism network: ensure a strong foundation of the Optimism community to run the nodes and decentralised sequencers when they are ready. Many validators have expressed interest to run nodes/sequencers on layer 2, and it will be trivial for existing validators to add to existing operations. L2 networks want to have a decentralised node set that is run by the community with many node operators, and not in the hands of a few institutions. For Ethereum Layer 2 is essential for Ethereum to reach mass adoption, Including these participants sends a strong signal of rewarding meaningful support that will have positive effects on L1 that will benefit the L2 layer by having a stronger foundation. Positive External Incentives: Increase Validator Decentralisation Centralisation of ETH staking is a growing concern for Ethereum, and proof of stake. Ethereum has prioritised decentralisation & sustainability, allowing end users to participate in network consensus. Optimism is also aligned with this goal; however, the conditions of the merge timeline has allowed centralised institutions to gain a large market share over individual stakers.  ETHSta Distro1396×783 100 KB  LIDO (stETH) accounts for 31.30% of deposits to the beacon chain. LSD holders benefit from liquidity without needing to lock ETH or run nodes, this allows additional yield to be earned in DeFi on top of the base staking yield. It is currently more profitable and easier to stake with a service like Lido than it is to run your own validator, all work and maintenance involved in running a validator/s is abstracted away and handled by a centralised institution, this has hindered unique validator growth harming the network’s security/decentralisation. Coinbase accounts for 14.61% % Kraken 9.35% of Beacon chain deposits, by allowing users to stake their ETH through their exchange. This means a single entity is holding this ETH and staking across their own validators, not only is this damaging to network decentralisation, a single entity holding this much is a massive honeypot for hackers. We see a trend where individual stakers (‘others’ in the chart above) are diminishing, centralised institutions are catching up as the incentives for solo validating simply struggle to compete with current LSD. Execution risk of the merge has some influence over this, but even post merge due to the ease of LSD allowing holders to gain exposure to yield, have liquidity and earn additional yield in DeFi. We are still likely to see favour in LSD, APY is simply not attractive enough for the majority of would be Stakers to lock up/join the exit que and have to maintain node infrastructure when similar results can be achieved via LSD. This proposal has the potential to turn the tide on the current problem of Ethereum’s increasingly concerning centralisation. By creating external incentives to run solo validators, many more ETH holders will be willing to put the extra work in running their own validator for the additional incentives. increased ‘implied’ APY, this will take market share away from CEXs and LSDs. It is also likely that other L2s and projects will follow suit, This is in line with Optimism’s vision for Public goods. A stronger Ethereum foundation is beneficial to the Optimism network as a layer 2 on Ethereum that relies on the trust assumptions/security of layer 1. We see a similar effect on Gitcoin Donations: Gitcoin participants have become increasingly included in project airdrops. resulting in increased ecosystem funding, though the motivations may be profit seeking it does not detract that this creates an environment where more public goods are funded. Likewise with governance, many who would have been apathetic to public goods and governance are much more likely to pay attention and contribute to these activities. Why the exclusion of LSD holders, and exchange depositors: Because this has been brought up in previous discussion, the following explains the main reasons  Difficulty: due to liquidity of these tokens it makes it easier to game as people can spread these to farm airdrops, add the extra challenges with liquidity pools and tokens held on exchanges. Incentives: Expanded in the previous section, reduces the effectiveness of this proposal to increase validator decentralisation.  I strongly encourage everyone to support this proposal. A stronger infrastructure layer will strengthen Ethereum’s value and economic potential. There are solutions around the corner to run ‘shared’ validators with as little as 4 ETH, eg:OBOL network and SSV. It is essential for the long-term success of Ethereum that we do not allow the chain to be captured and monopolised by a few entities, external incentives such as this will have a positive effect on decentralisation. other info on LSD: https://notes.ethereum.org/@djrtwo/risks-of-lsd Acknowledgements: special thanks to @0xboodle, @superphiz, @kevkillerke for their feedback and support ",
                    "links": [
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/0/0aa6316d1ed4f95e98111a862fd6257a00b6d41e.png",
                        "https://ethsta.com/",
                        "https://gov.optimism.io/t/airdrop-ethereum-validators-beacon-chain-contract-depositors/134",
                        "https://www.reddit.com/r/ethfinance/comments/udbwlm/beacon_chain_validators_should_be_included_in_l2/",
                        "https://medium.com/ethereum-optimism/retroactive-public-goods-funding-33c9b7d00f0c",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/e/e4557229a00427b57559ca45bf5dd0f4e7586193.png",
                        "https://notes.ethereum.org/@djrtwo/risks-of-lsd"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.472878703983355
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "2",
                    "likes": "4",
                    "time": "12/07/2022-15:38:43",
                    "content": "    GLCstaked:  To fund a public good   GF fund is not for public good. Wait for RPGF round. and validators are not public good, I know security of parent chain is important but calling it as public good is not even close to public good definition. Dont we get reward as a solo validator ? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.541666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/GLCstaked",
                    "index": "3",
                    "likes": "1",
                    "time": "12/07/2022-16:46:21",
                    "content": "    GLCstaked:  The Collective will consistently provide massive retroactive incentives for public goods which benefit Optimism, Ethereum, and the Collective as a whole   we get rewarded as a solo validators, but the centralisation is an increasing concern, its simply much easier and profitable to use LSDs which is why the solo validator count is low and the network distribution is becoming centralised. this isn’t just about rewarding validators, its to turn the tide on validator centralisation if optimism can help incentivise solo staking, this is huge benefit to both networks, the picture of Ethereum validator distribution is not healthy right now, almost 1/3 is LIDO and another 1/3 is exchanges if we can help incentivise this to change we should support it and one of my points, is who will run the decentralised node set of OP, I am sure the vision is that it won’t be run by 1 or a few entity’s but by the users/community if so it makes sense to include existing node operators in distributions, as these are the  set of actors most likely to run nodes on layer 2, the reality is most users do not run nodes ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.042410714285714
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "4",
                    "likes": "2",
                    "time": "12/07/2022-17:02:34",
                    "content": "Because Public Good is so hot right now and being used everywhere. Counter Proposal:- OP Foundation to use the amount of token requested in this proposal, run bunch of solo validators and use the reward to fund actual public good. Feel free to jump in here with your view on public good. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.517857142857143
                },
                {
                    "author_link": "https://gov.optimism.io/u/GLCstaked",
                    "index": "5",
                    "likes": "1",
                    "time": "12/07/2022-20:27:33",
                    "content": "this proposal does not really fit into funding public goods and the GF, was not my intent to make it sound that way. this is for discussion on Airdrop 2, and concerning the remainder of ‘future airdrops’, I argue that a portion of that going to validators would have benefits to both networks. we already included network users in distribution #1, in principle those that use the network will bring value to governance because thy are active users of the network so have experience. in principal, including network infrastructure providers (validators), would bring value to governance because of their experience, and considering the future decentralised node set of Optimism Network. the reality is both groups there is no guarantee of stickiness, however I would argue network users is much more easily gamed and more likely to leave, most validators have long term commitments. From personal experience every investor/trader I know dumped their OP immediately and every validator I know has expressed interest to run nodes on L2. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "6",
                    "likes": "0",
                    "time": "12/07/2022-20:30:46",
                    "content": "please tag the post properly to right section, may be idea and feedback . thank you. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.428571428571428
                },
                {
                    "author_link": "https://gov.optimism.io/u/boodle",
                    "index": "7",
                    "likes": "2",
                    "time": "13/07/2022-19:16:47",
                    "content": "I am going to reiterate @GLCstaked here. I believe that solo node operators are under-compensated as compared to LSD holders. There may be a more creative way to drive incentives back toward individuals running nodes from home, but handing out some $OP doesn’t seem like a terrible idea to me. As was said in the post, L1 validators are more likely to be positive actors on Optimism than say users who made a handful transactions. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.51948051948052
                },
                {
                    "author_link": "https://gov.optimism.io/u/colfax",
                    "index": "8",
                    "likes": "2",
                    "time": "14/07/2022-16:53:54",
                    "content": "One of the primary goals of EthStaker is to be a voice and advocate for the solo stakers everywhere. We have reviewed and discussed this proposal as a team and agree with the ideas that it suggests. What does the rest of the community think? Do you also feel that Ethereum solo stakers would be good stewards of the Optimism ecosystem? -the EthStaker team ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/allen",
                    "index": "9",
                    "likes": "0",
                    "time": "15/07/2022-05:41:33",
                    "content": "Yes, absolutely. This also serves to further solidify the alignment between Ethereum and Optimism as a L2. Having the backbone of ETH better connected to the OP token is a great thing in my opinion. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "10",
                    "likes": "2",
                    "time": "16/07/2022-20:33:25",
                    "content": "I am a solo ETH2 delegator since the start and I don’t see how this makes me a public good. I get a reward by staking so this is not fitting any possible definition of a public good. I don’t understand why Optimism should further incentivize me to run a staker. I also don’t see how this would help Optimism. So I dont see a point in this proposal from Optimism’s point of view. Heck … as a solo staker I wouldn’t mind extra money … but as a delegate of Optimism governance I don’t see the value here. Finally … a process question. This is neither an RGPF proposal nor a Governance funding proposal, right? So what kind of proposal is it? The tag says airdrop #2 but was not aware this was something we could even vote on at this point. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.7961309523809526
                },
                {
                    "author_link": "https://gov.optimism.io/u/Prometheus",
                    "index": "11",
                    "likes": "2",
                    "time": "17/07/2022-10:02:46",
                    "content": "    lefterisjp:  Finally … a process question. This is neither an RGPF proposal nor a Governance funding proposal, right? So what kind of proposal is it? The tag says airdrop #2 but was not aware this was something we could even vote on at this point.   I agree it’s best fitted for airdrop #2 than anything else but not sure if we have a vote on that. Anyway, I see this potential reward like a small token of appreciation for solo stakers (not public goods) and an incentive for them to participate in the Optimism Collective. So far the Optimism Collective includes:  Optimism Users and users “Priced out of Ethereum” DAO Voters Multi-sig signers Gitcoin Grants Donators on L1 OP Token Buyers  Some are solo stakers for sure, meaning they may get a bit more tokens but I don’t see anything wrong with that. As previously said, solo stakers get “paid” meaning we shouldn’t see (at least I don’t see) this reward like a financial compensation for their work/participation but instead like a way to give them more voting power (since they play an important role). I guess more people deserves (more) tokens in order to make their participation in the collective more meaningful but since I’m not sure how much we can suggest I will abstain until we have some guidance on if and how we can help with the next airdrop. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.848809523809524
                },
                {
                    "author_link": "https://gov.optimism.io/u/bciase",
                    "index": "12",
                    "likes": "1",
                    "time": "17/07/2022-15:39:54",
                    "content": "Great, I think this can promote the long-term and stable development of op ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "13",
                    "likes": "2",
                    "time": "17/07/2022-22:30:44",
                    "content": "    lefterisjp:  The tag says airdrop #2 but was not aware this was something we could even vote on at this point.   I agree with this and I would also add, we should not encourage airdrop 2 eligibility criteria here. Its better left for OP Foundation to decide. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://gov.optimism.io/u/GLCstaked",
                    "index": "14",
                    "likes": "1",
                    "time": "18/07/2022-11:35:50",
                    "content": "its clear that this proposal falls under Airdrop (a 14% allocation yet to be decided on) not GF funds or RPGF, and the community should have a say on this, even if its ultimately up to the OP foundation This isn’t something we can vote on now, but there’s no reason we can’t make suggestions.     lefterisjp:  I also don’t see how this would help Optimism. So I dont see a point in this proposal from Optimism’s point of view.   Explained under benefits to optimism   value to governance, considering the experience/expertise of these actors   ability to run nodes/sequencers for optimism in future   would create incentives that help strengthen L1 decentralisation, which benefits any L2 that inherits security from L1   this concerns ‘airdrop’ not public goods funding, airdrop #1 was around onboarding community to bring value to optimism, further airdrops should be the same, validators would be value add, considering the resources committed and ecosystem support. @Prometheus mentioned the various actors that make up the op collective, why not include those that run the L1 infrastructure? considering optimism would not exist without & inherits its security from, and is looking to decentralise its own infrastructure in the future. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.388888888888888
                },
                {
                    "author_link": "https://gov.optimism.io/u/GLCstaked",
                    "index": "15",
                    "likes": "3",
                    "time": "04/11/2022-13:59:50",
                    "content": "I have updated GitHub - GLCNI/ETH-Solo-Validator-Addresses: unique ETH addresses belonging to solo stakers this includes every depositor to the Beacon Chain until the Merge on Sept 15 2022. There are 12,775 validators in the solo-validator category of which I believe the vast majority would be prime candidates to run OP infrastructure on its path to full decentralization. On the improvements #reviewed for false positives, filter list has been greatly improved #Coinbase accurately identified and is the main culprit accounting for 86% of the unique addresses depositing to beacon chain contract. This is due to the way they conduct deposits, with a fresh new address generated per deposit. #Most staking as a service/LSD providers deposit through a contract and are not included in the list by default More detail in the Repo ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.299242424242424
                }
            ]
        }
    ],
    "group_index": "152"
}