{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/gonna-eth-dhannte-delegate-communication-thread/3563",
            "title": "Gonna.eth (Dhannte) - Delegate Communication Thread ",
            "index": 3563,
            "category": [
                "\\xf0\\x9f\\x8f\\x9b Governance",
                "Delegate Updates"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "1",
                    "likes": "3",
                    "time": "26/09/2022-23:21:16",
                    "content": "These were my initial guidelines for the last 5 cycles: Yes:  Protocol usage incentives Grants and 3rd party developer incentives Retroactive allocations for early adopters  No:  Bridging incentives Paying for full project development.  Since then I come to realize most so-called “incentives” are mostly liquidity programs and financial tools for OP$ farming and it feels like no real value is added. This is what changed for Cycle 6: Yes  Incentivize Optimism usage Live on optimism (for funding go to the Optimism partnership program) Tooling and non-financial ideas have my attention Open source (unless DeFi committee C approval) DeFi project approved by committee C  No  Closed source projects (Unless DeFi committee C approval) Paying for full project development Ghost teams/projects with nothing deployed  ",
                    "links": [],
                    "GPT-summary": "The author of the proposal, Gonna.eth (Dhannte), is explaining the changes made to the guidelines for Cycle 6. The author has realized that most incentives are liquidity programs and financial tools for OP$ farming, and therefore, has decided to focus on incentivizing Optimism usage, tooling, and non-financial ideas. The post also includes a list of what is allowed and not allowed in Cycle 6.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.725524475524475
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "2",
                    "likes": "4",
                    "time": "08/11/2022-17:34:10",
                    "content": "As we move forward to the last committee voting cycle I felt it is a good time to give some feedback about this experience. I enjoyed both being a committee member and being a proposer at the same time as it gave me a full picture of how this worked and where improvements might go. Time wasted It blows my mind to see so many talented people gathered for such a good cause to be pulled into meaningless and repeating conversations. If you take only (Regular badge on Optimism Collective) you have the 18 most active readers. There you can find Karl, Kelvin, Katie, Polynya, and more. If you add up some of the strong delegates who give feedback and show up to the community call you have Lefteris or Linda Xie. You can quickly understand this is not people with free time. And yet here they are trying to push this forward. I yearn for a 20 min talk with any of them to learn all the things they have and I struggle seeing how do they have to repeat themselves over and over until they leave the conversations. Lack of Optimism Foundation Involvement This is crystal clear, if the foundation is going to hold the last word, then we need someone from inside representing the foundation and at least saying something like “this is being analyzed by the foundation you will have an answer in 24hs” We cannot have 48hs of unstoppable harassment over a committee member without any word from the foundation. I’m not asking for fast answers I know they have a lot on their plate, but at least an acknowledgment to avoid confrontation. And if for that they need more people I’m all in to vote for an $OP fund. By the way, I love the work the foundation is doing so far, this is just improvements on the amazing job they are doing already. About my vote on cycle 8 I abstained from EthernautDAO proposal as I am the proposer and I wanted the rest of the community to decide, I’m sorry if those who delegated to me felt misrepresented we passed with 96%. For all other proposals, I followed the respective elected Committee recommendation. When the committee recommended DYOR like Velo and Messari I did. I voted Yes for Massari as I believe they come with a different proposal. I would love to have more clarity about the grant but at least the idea is new and I want to know the metrics that come from it. I voted no for Velo I don’t think the second proposal repeating the first one makes much sense. (This applies to Gov and Partners fund). At the same time, the amount asked should be half of the first one and not more. This is a DeFi protocol, not a public good and they are profit-oriented, the project itself must consider a market acquisition of OP tokens if they need more to be sustainable and integrate this own demand in its own profit formula. Otherwise, they are just leveraging their own project with $OP.  If other DeFi projects want to use Velo as their main liquidity stream and they need $OP for the bribes etc then those projects should be asking for the tokens and not Velo. ",
                    "links": [
                        "https://gov.optimism.io/t/council-reviewer-self-nomination-gonna-eth-dhannte/4104",
                        "https://gov.optimism.io/t/grant-council-reviewer-nominations/4372/3"
                    ],
                    "GPT-discussion-categories": [
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.95291146761735
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "3",
                    "likes": "3",
                    "time": "16/12/2022-14:49:56",
                    "content": "The badge holder vote was a tough one. I wanted to pick 10 candidates but I had to pick 11. I based my vote on this, they don’t need to be in all of them but at least 2:   Forum participation, this wasn’t only by interaction with most of the elected candidates but also for their forum badges: Regular badge on Optimism Collective Gives Back badge on Optimism Collective Appreciated badge on Optimism Collective Respected badge on Optimism Collective Good Share badge on Optimism Collective   Personal debate on at least one forum post with each of them   Respectfully and insightful answers and questions on different forum topics   Committee member (Including shadowy committee)   Delegate call participation   I voted for: katie, linda, lefterisjp, OPUser, mastermojo, jrocki.eth, polynya, DeFi_LATAM_Joxes, MinimalGravitas, millie, krzkaczor and jackanorak I voted yes for the Grants Council proposal. The feedback is here: Feedback 1, Feedback 2, Feedback 3 As a final thought, we don’t have the perfect system to move governance forward but at least Optimism it’s trying to get better every season. Iteration, reflection, and tryouts are the best tools we have and I’ll keep supporting these radical governance changes with an optimistic mindset. I voted yes for the Protocol delegation program. These protocols are the core contributors to the Optimism ecosystem and without them we have nothing. It is obtuse to think they shouldn’t have a voice in their own space, native or not, we are all here to promote Optimism use. I hope to see more of these delegation programs to smaller projects too in the future. ",
                    "links": [
                        "https://gov.optimism.io/badges/32/gives-back",
                        "https://gov.optimism.io/badges/36/appreciated",
                        "https://gov.optimism.io/badges/37/respected",
                        "https://gov.optimism.io/badges/22/good-share",
                        "https://gov.optimism.io/t/draft-proposal-moving-to-a-grants-council/3945/21",
                        "https://gov.optimism.io/t/draft-proposal-moving-to-a-grants-council/3945/36",
                        "https://gov.optimism.io/t/draft-proposal-moving-to-a-grants-council/3945/37"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.013888888888888
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "4",
                    "likes": "2",
                    "time": "12/01/2023-20:19:37",
                    "content": "Special Voting Cycle #9b: Protocol Delegation Elections picks: ENS, is a no-brainer I want them to be integrated with optimism as soon as possible, their ethos it’s truly aligned with Optimism, and if we could edit, renew, pick new ens, and everything you do on mainnet here I won’t have any more uses for L1  Atlantis world, I’ve been meeting the team, learning about their process and what they want to deliver, how small the team is and yet they ship and ship and ship always thinking of the greater benefit of the ecosystem. I’m surprised by how welcoming they are when you ask questions and you want to learn more about them. Bethoven and Kwenta are in the top 20 of optimism usage and they should have a say in this governance: Optimism Project Usage - Custom Period Code4arena It’s good to see an audit project getting involved in governance. They have an innovative product and most of their projects are in optimism. I think it is also time to give security researchers representation in this governance and they were the only ones applying. Agora, they have been selected to deploy a new user interphase for Optimism governance, so most of the token house decisions will go directly into their product and this is the reason I believe they need to have a voice in this process. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.493709415584416
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "5",
                    "likes": "3",
                    "time": "16/01/2023-11:57:26",
                    "content": "Special Voting Cycle #9b: Grants Council Elections - Growth Experiments This vote was hard, all candidates are good and committed to the Optimism Collective. It almost feels like we waste resources when we vote people out of a council determined to work for the collective benefit. @SEED_LATAM_Joxes : Easy pick, they are a community not just one person and as they say, “if you want to go fast go alone, but if you want to go far, stay together” Defi_latam it’s one of the most active communities on the forum and their work as Defi Committee and NFT committee helped us a lot on last cycles. @Matt: I know mat long before this governance experiment. He helped EthernautDAO in many ways and never asked for anything in return. His public goods mindset it’s deep inside him long before there was any sort of personal benefit and he has been following one of the most complex DeFi protocols in the space since I know him. A great contribution to the Growth Council. @Michael: A no-brainer, he has hosted most of the community calls, has a great experience and it’s innovative when it comes to communication, even made a youtube vid about himself for the reviewer’s nomination and maybe, pioneering on how we should present ourselves in the future. @katie: She’s been here before anyone, the first community call host, has deep experience in governance long before Op collective, outstanding feedback giver. She has a positive work frame and every project she intervenes ends up being better. I’m very happy to root for her. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.139492018398268
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "6",
                    "likes": "2",
                    "time": "16/01/2023-12:14:22",
                    "content": "Special Voting Cycle #9b: Grants Council Elections - Builders Same as Growth Council, I feel we should keep all 5 candidates, make a redistribution for compensation and work together as a team. It’s not easy to find people willing to commit their time to the collective and all candidates here have worked a lot: @OPUser, look at that summary with 8 days of reading time on the forum: Profile - OPUser - Optimism Collective. I have to say that summary is impressive and it shows a commitment way beyond any other candidate on this council. Positive feedback giver, I got contradicted by him many times and he has never been disrespectful. Worked with him on the DeFi Committee, well organized and willing to help anyone. I hope he can make it! @jackanorak, another impressive summary, Profile - jackanorak - Optimism Collective. He’s been always in the front when it comes to ideas, the first to call for a rethinking of OP grants given we were giving too many tokens. The first one is to start a deep analysis of how distributions are going since they started. He is deeply involved with an Optimism native protocol from the beginning and the debates between him and OpUser are the most educational content you can find on this forum. Dhannte, this is the first time I vote for myself. I’ve been against this until someone made me realize all the delegation I have comes from people who trust me and that will vote for me if they had to do it themselves. ",
                    "links": [
                        "https://gov.optimism.io/u/jackanorak"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.4736802549302555
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "7",
                    "likes": "1",
                    "time": "16/01/2023-12:25:21",
                    "content": "respect the sentiment but I strongly disagree with this (oh sorry didn’t realize I was in your thread! thought it was general grants council thread) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.763888888888888
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "8",
                    "likes": "1",
                    "time": "16/01/2023-12:28:05",
                    "content": "All good, do you strongly disagree with everything said? Curious to understand what you mean and learn from it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.901041666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "9",
                    "likes": "1",
                    "time": "16/01/2023-12:31:15",
                    "content": "I don’t think opuser is well suited for this role, as evidenced by his rfp post, and I would rather not expand the council merely to accommodate him if it turns out he doesn’t have the votes ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party questioning proposal"
                    ],
                    "Sentiment": 2.5
                }
            ]
        }
    ],
    "group_index": "271"
}