{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/ready-gf-phase-1-proposal-popcorn-vault-infrastructure-tooling-on-optimism/5413",
            "title": "[READY][GF: Phase 1 Proposal] Popcorn - Vault Infrastructure & Tooling on Optimism ",
            "index": 5413,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Grants Council"
            ],
            "tags": [
                "cycle-11"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/RealMischa",
                    "index": "1",
                    "likes": "23",
                    "time": "03/03/2023-15:18:13",
                    "content": "Basic Details Project name: Popcorn Author name and forum name (please provide a reliable point of contact for the project): Michael Kisselgof - RealMischa L2 recipient address: 0x186156eFC621721d58AFD8B9ec17890e4773A543 Which Voting Cycle are you applying for?: Season 3 - Voting Cycle #11 I confirm that I have read the landing pages for the Builders and Growth Experiments Sub-Committees and that I have determined my proposal is best suited to be reviewed by the Builders Sub-Committee: [Yes/No]: Project Details What are you going to build?: Popcorn is building VaultCraft, a common permissionless infrastructure that will allow Popcorn and all of Optimism’s builders to spin up liquid, automated asset strategies on any EVM-compatible chain. This would be one of the first open protocols allowing for the modularization of vaults using a protocol-endorsed VaultFactory that ensures the safety of the strategy and its contracts. Vaults will be able to interact with a variety of protocols through the ERC4626-Wrapper and will also be stackable in design, meaning you will be able to build on top of other vaults. VaultCraft will also provide specialized module functionality for trading, leveraging, staking, and more. The protocol will dramatically reduce the required capital and time to market for any B2B enterprise, like Popcorn, looking to quickly expand its DeFi offering and allow anyone with little coding knowledge to mix and match both protocols and strategies to create sophisticated DeFi products within just a few clicks. Vaultcraft will serve as DeFi’s AWS equivalent offering scalable solutions for new protocols and Popcorn will do for the yield space what Uniswap did for AMMs! Popcorn is a multi-chain ReFi yield-optimizing protocol offering exposure to liquid asset strategies that not only earn competitive yield on your crypto but simultaneously fund nonprofits and social impact organizations at no additional cost to the user. Popcorn is a non-custodial, decentralized, and audited protocol that is governed by PopcornDAO. Why is what you are going to build going to succeed?: Popcorn will be the first ReFi yield-optimization protocol that uses vaults to automatically fund public goods with no additional cost to the end user. We measure success with TVL and funds donated to public goods. Thus we’re and confident VaultCraft will introduce a new paradigm for DeFi where anyone can custom-tailor multi-strategy vaults for any asset on any EVM-compatible chain, attracting more more TVL from DAO treasuries and crypto hedge funds, especially ones who are impact conscious. Is your project likely to bring new builders to the Optimism ecosystem? If so, please describe how: With VaultCraft’s permissionless tooling for vault creation, any dev or non-dev can contribute to DeFi’s portfolio of yield-generating products within just a few clicks. We’ve developed a simple UX for internal use that shows how you will be able to create a vault below: Steps in creating a vault with VaultCraft:  Choose your protocol Choose your asset Choose the adapter Pick a strategy Configure your fees  Popcorn and VaultCraft will benefit Optimism’s ecosystem by attracting protocols, developers, and funds that are looking to expand on methods of yield generation, which will inevitably attract more users, increase Optimism’s TVL, and provide more decentralized options to fund public goods. Is your project likely to improve the quality of developers in the Optimism ecosystem? If so, please describe how: Yes, providing developers with VaultCraft to help develop safe, risk-adjusted vaults for assets on Optimism. This will improve the quality, scale, and security of products created by developers in the Optimism ecosystem. Is your project likely to improve the commitment of developers in the Optimism ecosystem? If so, please describe how: Developers will have an easy, positive experience using VaultCraft to develop on Optimism resulting in an increased commitment to further development on the platform. The ease of use in developing vaults that are compatible with all EVM chains will be beneficial to Optimism’s long-term vision of developing a super chain. Provide us with links to any of the following for the project:  dApp Website Twitter Discord/Discourse/Community Github Other: Interview on VaultCraft with Code4rena  Other: VaultCraft audit with 230+ white hats   Do you have any metrics on the project currently? (TVL, transactions, volume, unique addresses, etc. Optimism metrics preferred; please link to public sources such as Dune Analytics, etc.):  TVL: $2M POP locked: 8.7M (dune) POP holders: 7,693 (dune) Twitter followers: 24.7K (Twitter) Discord members: 6,412 (Discord)  All data as of 02/27/2023 Who are your competitors?:  Yearn Beefy Yield Yak  What differentiates you from your competitors?: Popcorn bakes social impact into the heart of the protocol by automating fees to fund public goods. Non-profits and social impact organizations are determined by PopcornDAO. With the release of VaultCraft, not only will Popcorn be able to scale up its product offering and increase funding for public goods even more, but we will also provide DeF modularity in customizing automated asset strategies within just a few clicks. Popcorn can design products providing additional yield-generating opportunities for specific tokens or routing liquidity to specific yield opportunities on other protocols. Non-custodial, audited, and decentralized Vaults for Good will provide unique and novel methods of funding public goods as well. We also work closely with prestigious institutions for research and governance initiatives. Recently we onboarded the Oxford Blockchain Society, Vanderbilt Blockchain, and Blockchain at Michigan to the University Governance Program. Will your project be composable with other projects on Optimism? If so, please explain: Yes, Popcorn’s vault strategies rely on routing liquidity through other protocols such as Yearn, Curve, and several more under development. Additionally, other projects can leverage VaultCraft to create their vault strategies that utilize more projects within the ecosystem. Team Who are your founders?: Anthony Martin Michael Kisselgof What makes your founders well-positioned to accomplish your goals with this project (1-2 sentences on each)?: Michael contributed to and used the ERC-1155 Multi Token standard to fund and license bio R&D in 2017 in his first crypto project, IKU. He is a crypto veteran and a former TradFi professional (Credit Suisse Private Banking) with a vast network in web3. Anthony has led technical infrastructure development, digital marketing, and software development projects for companies such as Delivery Hero, Johnson & Johnson, and Time Inc. He’s worked as a software developer and consultant for seed stage, Series A, Series B, and publicly traded companies. His open-source projects have garnered hundreds of thousands of installations. Tell us about the rest of your team (if there are more teammates):   Leon Adler - Lead Developer  Joey Nakayama - Community DAO Lead  Alec Zorrilla - Business Operations Lead  Enialo - Lead Product Designer  Sam Mirson - Growth  Is this your first Web3 project?: No If not, what else have you built? (Share links, Github repository, or any other useful information.): IKU: iku.gitbook.io I understand that Builders grants are subject to a 1-year lock-up, as explained further in this post 2: [Yes/No]: Is your project funded? If so, provide an estimate of how many months of funding runway your project has: 90 months Grant Request What is the size of the grant request? (50k OP max): 250K OP How do you justify the size of the grant? OP will be used for vested LM rewards for Vaults, Vaults for Good, LP’s, and bounties as detailed under What is your plan for the use of the OP token after the 1-year lock-up? Roadmap Describe in discrete steps your plan for accomplishing your project:  C4 Audit 2/13/23 - 02/17/23: Review results 2/28/23: Buffer for additional audit with Blocksec 2/28/23 - 03/07/23: Blocksec Audit 3/07/23 - 03/15/23: Additional Audit review 3/21/23: VaultCraft live on Mainnet, Optimism, Polygon, Arbitrum, BNB Chain, Avalanche, and Fantom Q2 2023 (Optimism specific)  Vaults & Vaults for Good for:  USDC USDT DAI sUSD WETH WBTC ETH stETH wsteth FRAX MAI 3pool   Liquidity Pools  POP/USDC POP/OP POP/VELO   Onboard launch partners for governance  Velodrome Synthetix Aave Curve Beefy Pooltogether HOP Stargate Perpetual Protocol   Bounties (Q2 - Q4)  Using existing bounty infrastructure on Dework, Popcorn will incentivize developers to help ARG/Popcorn in developing yield-generating products with POP and OP compensation.   Public Good Funding  Aligned with RFC-9 PIP-9, and PIP-11, for every charitable donation, Popcorn will boost donations with OP, burn the dollar equivalent in POP, and reward token holders who participated in the governance with OP.      Please provide any additional information that will facilitate accountability:(smart contract addresses relevant to the proposal, relevant organizational wallet addresses, etc.) Audits  Zokyo Audit G0 Audit Immunefi Bounty Code4rena Audit  Wallets  Optimism Multisig - 0xf10c976E594E8b8269F36121136247082329cd1F POPStar Wallet - 0xe88F387Aedb091b6c57136c5Eea20644906a3FaC DAO Polygon - 0xa49731448a1b25d92F3d80f3d3025e4F0fC8d776 Mainnet LP - 0x6B1741143D3F2C4f1EdA12e19e9518489DF03e04 Foundation - 0x6B1741143D3F2C4f1EdA12e19e9518489DF03e04 Mainnet OUSD* - 0x265c6BF7464d13388Ee6787bd0Ee5634CfB631AD Zapper  Other  Gitbook  Does your plan depend on the receipt of OP tokens?: We intend to develop and release these strategies regardless of the OP grant but believe it will be mutually beneficial and the impact will be strongly amplified with the OP grant. What is your plan for the use of the OP token after the 1-year lock-up?:  35% - Vault & Vautlts for Good Rewards  Popcorn will create many more vaults beyond the listed vaults above which we would like to reward with POP & OP, especially Vaults for Good to incentivize funding public goods.   35% - POP liquidity pools  Popcorn will create liquidity pools for POP/USDC, POP/OP, and POP/VELO and boost yield by matching with POP and OP rewards.   10% - Bounties  Using existing bounty infrastructure on Dework, Popcorn will incentivize developers to help ARG/Popcorn in developing yield-generating products with POP and OP compensation.   20% - Public goods funding  Aligned with RFC-9 PIP-9, and PIP-11, for every charitable donation, Popcorn will boost the donation with OP, burn the dollar equivalent in POP, and reward token holders who participated in the governance with OP.    Please provide benchmark milestones for this project. These milestones should guide the Optimism community on the progress of your project during the 1-year lock-up period.  Vaults  KPI’s  TVL  USDC: $1M USDT: $1M DAI: $1M sUSD: $1M FRAX: $1M WETH: $500K WBTC: $500K ETH: $500K stETH: $500K wsteth: $500K MAI: $500K 3pool: $500K   Milestones per strategy  Contract launch 25% TVL goal met in 3 months 50% TVL goal met in 6 months 75% TVL goal met in 9 months 100% TVL goal met in 12 months       POP liquidity pools  KPI’s  TVL  POP/OP - $500K TVL POP/VELO - $250K TVL   Milestones per pool  Contract launch 25% TVL goal met in 2 months 50% TVL goal met in 3 months 75% TVL goal met in 3 months 100% TVL goal met in 5 months       Bounties  KPIs:  User engagement rate within 10 business days of being posted All bounties and requests are executed within 1 year     Public good funding  KPIs:  More than 500 unique addresses involved in voting (including delegated votes) by end of 2023 Cumulative > $500k distributed by end of 2023      Please define critical milestones for this project. Critical milestones are meant to show good-faith efforts to accomplish the project. Non-completion of these milestones could lead to the revocation of remaining grant rewards.  Launch Vaults & Vaults for Good in Q2 2023 Launch POP & OP Bounty program Onboard at least 3 launch partners in the Optimism ecosystem  Optimism Relationship Does your project solve a problem for the Optimism ecosystem?: VaultCraft by Popcorn solves the following business problems when developing vaults:  Time to market Vault complexity = costly  Capital/HR and lack thereof Audit per vault = $$$   Technical debt Centralized & permissioned vault development Ad hoc vault development is not scalable  Popcorn will also be a new paradigm of DeFi products that allow you to passively generate yield on your crypto while funding public goods. How does your proposal offer a value proposition solving the above problem?: By providing the following features in a common permissionless infrastructure:  EVM compatibility ERC4626-wrapper Fee customization Simplified UX for vault creation Protocol-endorsed factory for optimal safety and security Customization in a few clicks by choosing  Assets Protocols Modules - Trade | Stake | Leverage | Compound | Claim Rewards    Why will this solution be a source of growth for the Optimism ecosystem?: Anyone will be able to use VaultCraft to create safe, risk-adjusted vaults for assets on any EVM-compatible chain. VaultCraft will dramatically scale up not only Popcorn’s suite of yield-generating products, both for personal gain and for funding public goods, but Optimism’s ecosystem of yield-generating products. How committed are you (and your team) to building on Optimism?: Popcorn launched on Optimism on November 3, 2022. Additionally, several governance proposals [PIP-6] [PIP-12] have migrated liquidity, focused research, and enabled governance functionality on the platform. We are committed to continued development within the ecosystem. Is your project Optimism Native?: No Confirmations I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: [Yes/No]: I understand that I will be expected to following the public grant reporting requirements outlined here: [Yes/No]: ",
                    "links": [
                        "https://foul-porch-0eb.notion.site/Growth-Experiments-Sub-Committee-270d2f75ff0f410a869b2ba6a8324006",
                        "https://medium.com/code4rena/the-ones-in-the-arena-popcorn-dao-af45db3793b8",
                        "https://www.popcorndao.finance/",
                        "https://www.popcorn.network/",
                        "https://twitter.com/Popcorn_DAO",
                        "https://discord.com/invite/w9zeRTSZsq",
                        "https://github.com/popcorndao/",
                        "https://medium.com/code4rena/the-ones-in-the-arena-popcorn-dao-af45db3793b8",
                        "https://code4rena.com/contests/2023-01-popcorn-contest",
                        "https://dune.com/vintagegold/Popcorn-Overview",
                        "https://dune.com/vintagegold/Popcorn-Overview",
                        "https://twitter.com/Popcorn_DAO",
                        "https://discord.com/invite/w9zeRTSZsq",
                        "https://www.linkedin.com/in/leon-niesler-903720150/",
                        "https://linkedin.com/in/joeynakayama",
                        "https://linkedin.com/in/alec-zorrilla",
                        "https://www.linkedin.com/in/sammirson",
                        "https://www.linkedin.com/in/sammirson",
                        "https://iku.gitbook.io/whitepaper/",
                        "https://gov.optimism.io/t/grant-token-lock-explainer/5060",
                        "https://code4rena.com/contests/2023-01-popcorn-contest02/13:%20C4%20Audit%20Results",
                        "https://assets.website-files.com/5f99eb79d508ca853be5f2e8/61b21474b7a1746d889f599d_Popcorn%20SC%20Audit.pdf",
                        "https://www.popcorn.network/docs/PopcornMay2022.pdf",
                        "https://immunefi.com/bounty/popcornnetwork/",
                        "https://code4rena.com/contests/2023-01-popcorn-contest",
                        "https://optimistic.etherscan.io/address/0xf10c976E594E8b8269F36121136247082329cd1F",
                        "https://polygonscan.com/address/0xe88F387Aedb091b6c57136c5Eea20644906a3FaC",
                        "https://polygonscan.com/address/0xa49731448a1b25d92F3d80f3d3025e4F0fC8d776",
                        "https://etherscan.io/address/0x6B1741143D3F2C4f1EdA12e19e9518489DF03e04",
                        "https://etherscan.io/address/0x23013480c12974501A9b6c95e6585dcF3865Df81",
                        "https://etherscan.io/address/0x265c6BF7464d13388Ee6787bd0Ee5634CfB631AD",
                        "https://zapper.fi/bundle/0x6be8ef6207b4114a52ae5011fe8846da2af8f281,0xf023e5ef2eb3b8747cbad5b3847813b66e9bfdd7,0x084e8A8cF1C38dEF1D6dB8542a73aa0d54284F8D",
                        "https://popcorn-dao.gitbook.io/popcorndao-gitbook/about-popcorn/welcome-to-popcorn",
                        "https://app.dework.xyz/popcorndao",
                        "https://forum.popcorn.network/t/rfc-9-token-burn-per-charitable-donation/851",
                        "https://forum.popcorn.network/t/pip-9-reward-vlpop-holders-who-participate-in-popcorndao-governance/814",
                        "https://forum.popcorn.network/t/pip-11-token-burn-charity-donation/857/3",
                        "https://snapshot.org/#/popcorn-snapshot.eth/proposal/0x213b527964c0c392af8df570fcf9fb19533bd1509ed27d35d24750a4e9dce37d",
                        "https://snapshot.org/#/popcorn-snapshot.eth/proposal/0x34bd1095f8bbe302e794e2d82e459ed0e18af4e375b3d83b10dc4e36c21c893f",
                        "https://gov.optimism.io/t/suggested-public-reporting-requirements-for-grantees/4176"
                    ],
                    "GPT-summary": "The post is a proposal for a project called Popcorn, which aims to build VaultCraft, a permissionless infrastructure that allows for the creation of liquid, automated asset strategies on any EVM-compatible chain. The proposal explains the details of the project, including its benefits, competitors, and team. It also provides metrics on the project's current status and a roadmap for its future development. The post does not ask for feedback or collaboration, but it does extend an invitation to potential partners and answer potential questions.",
                    "GPT-proposal-categories": [
                        "Token economics",
                        "Interoperability and Scalability",
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.666861249481112
                },
                {
                    "author_link": "https://gov.optimism.io/u/GrantsOps",
                    "index": "2",
                    "likes": "5",
                    "time": "03/03/2023-15:58:31",
                    "content": "@lavande when able, can you have control transferred to @RealMischa? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/RealMischa",
                    "index": "3",
                    "likes": "5",
                    "time": "07/03/2023-14:11:33",
                    "content": "I spoke to Diomedes and forwarded to Binji/OPLabs as a larger grant proposal! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/BRMbm",
                    "index": "4",
                    "likes": "8",
                    "time": "09/03/2023-00:38:45",
                    "content": "So pumped to see this proposal on here. It’s a no brainer for the Optimism community, huge alignment of values ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.000000000000001
                },
                {
                    "author_link": "https://gov.optimism.io/u/JoeyN",
                    "index": "5",
                    "likes": "5",
                    "time": "09/03/2023-22:44:07",
                    "content": "This is an ambitious proposal and an awesome opportunity to grow the Optimism ecosystem while funding public goods on an ongoing basis. Excited to see how this will progress! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 7.1484375
                },
                {
                    "author_link": "https://gov.optimism.io/u/PopstarPepe",
                    "index": "6",
                    "likes": "6",
                    "time": "10/03/2023-07:50:02",
                    "content": "AWS equivalent for offering scalable DeFi solutions for new protocols with impact baked into it  Honestly though, very well-formulated and detailed proposal which clear alignment to Optimism’s core values (in my opinion). Would love to see this get funded ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.613636363636363
                },
                {
                    "author_link": "https://gov.optimism.io/u/Cardo",
                    "index": "7",
                    "likes": "4",
                    "time": "14/03/2023-13:43:51",
                    "content": "Strong and dedicated team, and Popcorn, like Optimism, is designed to reward public goods so this will be a great win for their collective goal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.541666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/kdm",
                    "index": "8",
                    "likes": "3",
                    "time": "14/03/2023-14:43:04",
                    "content": "Is there any “no-code” protocol out there that can create vaults? I guess enzyme, but seems like they lack the module functionality @RealMischa is proposing here. Popcorn looks legit as well, pretty stellar team. They got my vote. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Positive feedback on proposal",
                        "Comparing proposal to other protocols",
                        "None"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/vdmrb",
                    "index": "9",
                    "likes": "1",
                    "time": "14/03/2023-15:46:27",
                    "content": "More cheap vaults need to come to Optimism so I can park my recently exchanged USDC into LUSD or ETH Vaults. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/rickmorty",
                    "index": "10",
                    "likes": "1",
                    "time": "14/03/2023-22:34:05",
                    "content": "After the success of OUSD this weekend hitting 45% 7 day trailing APY due to redemptions and DEX volume, we gotta have more automated asset strategies on Optimism capitalizing on the demise of TradFi. I feel like Popcorn is a team of degens disguised as do-gooders hehe. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.125
                },
                {
                    "author_link": "https://gov.optimism.io/u/PeaceBtheJourney",
                    "index": "11",
                    "likes": "2",
                    "time": "14/03/2023-22:43:30",
                    "content": "+1 this has serious potential to be a good shot in the arm to optimise crypto to do good w vault strategies ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.333333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/HIGHERHIGHPETREX",
                    "index": "12",
                    "likes": "4",
                    "time": "15/03/2023-09:35:36",
                    "content": "I am not a blockchain develooer so mught not be able to understand everything written in this proposal but while i scanned, most topics kind of leaned towards decentralization and optimal scalability which are the required factors to run an exchange. If i am to say, some parts of the strategy seems okay and fine with me. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.5166666666666675
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPTIMUSPRIME",
                    "index": "13",
                    "likes": "3",
                    "time": "15/03/2023-10:07:30",
                    "content": "This shows that a lot of time has been taken to plan out all these strategies.  This shows the community really wants to grow. From the VaultCraft strategies, i think this aims to yield more profit for its users ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/RedFox",
                    "index": "14",
                    "likes": "3",
                    "time": "16/03/2023-11:28:51",
                    "content": "More cheap vaults need to come to Optimism so I can park my recently exchanged USDC into LUSD or ETH Vaults. Good to go. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Chipel",
                    "index": "15",
                    "likes": "1",
                    "time": "20/03/2023-11:37:50",
                    "content": "I support the Popcorn proposal for several reasons. Firstly, the creation of VaultCraft will provide a common infrastructure for automated, liquid asset strategies on any EVM-compatible chain. This will make it possible for anyone to create sophisticated DeFi products with little coding knowledge, which will attract more users to the Optimism ecosystem. Secondly, Popcorn is the first yield-optimization protocol that uses vaults to fund public goods with no additional cost to the end-user. This social impact focus will appeal to users who want to support public goods and nonprofit organizations. Finally, VaultCraft will benefit the Optimism ecosystem by attracting protocols, developers, and funds looking to expand their methods of yield generation, which will increase TVL and provide more decentralized options to fund public goods. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5152777777777775
                }
            ]
        }
    ],
    "group_index": "555"
}