{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/gf-phase-0-proposal-lyra-finance/202",
            "title": "[GF: Phase 0 Proposal] Lyra Finance ",
            "index": 202,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Governance Fund: Phase 0"
            ],
            "tags": [
                "cycle-1",
                "passed"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/mjs",
                    "index": "1",
                    "likes": "62",
                    "time": "03/05/2022-13:23:34",
                    "content": "Project Name: Lyra Author Name: Mike Defillama TVL (at snapshot): $31,948,436 Transactions/day (at snapshot): 325 Tier: 2 Optimism native: Yes Revisions to metrics used: N/A Number of OP tokens to claim: 3,000,000 L2 Recipient Address: 0xB6DACAE4eF97b4817d54df8e005269f509f803f9 Proposal for token distribution (under 1000 words): The Optimism Collective is a new type of community that’s digitally native, sustainable and fair. Lyra began the era of Optimism native projects and today, we are submitting one of the first proposals to the $OP governance fund.  How will the tokens be distributed? Our community has three pillars:  Builders  Liquidity  Traders Lyra’s $OP distribution will reward each of them.   Builders Amount: 600,000 $OP Criteria: Build on Lyra and apply to the Grants Council We’re going to build a vibrant ecosystem on top of Lyra. Composability is DeFi’s superpower and projects like Polynomial and Brahma have demonstrated the potential of building on Lyra. Public goods such as Lyra Live and The Short Put provide value to the whole community and align with Optimism’s ethos. Whether you’re building the next DeFi Option Vault, a community newsletter or anything in between, all builders will be eligible to apply.   Liquidity Amount: 1,700,000 $OP Criteria: Become a Lyra Liquidity Provider  Option Market Pools LYRA/ETH Gelato Pool  Liquidity is essential for any crypto protocol and it plays a crucial role in Lyra. By depositing to the Option Market Pools, LPs provide the collateral that the AMM needs to trade. LPs will be eligible for a share of $OP relative to their stake in the pools. $LYRA was the first token distributed on Optimism, reducing fees for token holders. However, building L2 native token liquidity is challenging and $OP incentives will help Lyra build the most liquid L2 token.   Traders Amount : 500,000 $OP Criteria: Start trading on Lyra Increasing trading activity is Lyra’s fundamental goal and the $OP token presents an opportunity to onboard an array of new users. A rebate on trading fees will reduce friction and help Optimism and Lyra attract more activity. Since launch, traders have paid over $600k in fees to Lyra Liquidity Providers.   Ecosystem Amount: 200,000 $OP Criteria: To be administered by Lyra Governance To inspire the next generation of Optimistic builders, Lyra will host a virtual hackathon and create content to educate builders on what to build with options and how to build on Lyra.   Retroactive Up to 10% of the total allocation will be distributed retroactively to the builders and users that helped build the Lyra community.  How will this distribution incentivize usage and liquidity on Optimism?   More Builders Without builders, there’s no stuff. From smart contracts to dApps and everything in between, both usage and liquidity on Optimism start with building more stuff. We think this one is a no brainer!   Liquidity Migration Lyra’s ignition program caused the single largest spike of TVL on Optimism. LP incentives will encourage another mass migration of liquidity from L1.  ignition2940×930 162 KB    More Traders Every trade on Lyra is a transaction on Optimism and to date, we’ve seen over 8000 unique traders make almost 19000 trades. Trader incentives will enable Lyra to attract even more first time users to Optimism.  Why will the incentivized users and liquidity remain after incentives dry up?   Builders make things that last While incentives are temporary, smart contracts and public goods built on Optimism are permanent. By directly incentivising builders, we will create an immutable foundation that exists long after the conclusion of the incentives.   Trader retention When people start trading on Lyra, they don’t stop. We have an almost 70% trader retention rate.  Screen Shot 2022-04-29 at 1.48.15 pm941×382 22.9 KB    Gas savings Users are paying 200x less in fees than they would on L1.  gas-savings3412×1108 135 KB   Over what period of time will the tokens be distributed? We will target distribution over 6 months. The exact rate at which tokens are distributed will be left to the Grants Council and Lyra Council to be ratified by governance in the upcoming LEAP-24.  How much will your project match in co-incentives? Builders  - Grants Council will match $LYRA to $OP up to $50k per month Liquidity - $LYRA distributed as per the framework in LEAP-21 Citizens - Trade fees matched up to a 100% total rebate Note This proposal is subject to approval by the Lyra Council. Specific allocations within each category are yet to be finalised. ",
                    "links": [
                        "https://twitter.com/PolynomialFi",
                        "https://twitter.com/BrahmaFi",
                        "https://twitter.com/Lyra_Live",
                        "https://twitter.com/lyrashortput",
                        "https://app.lyra.finance/pools/overview",
                        "https://www.sorbet.finance/#/pools/0x70535C46ce04181adf749f34B65B6365164d6B6E",
                        "https://app.lyra.finance/trade/eth",
                        "https://leaps.lyra.finance/",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/1X/4ced19a85d5893dc7d1595bebd02adaef93e23ad.jpeg",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/1X/2316a12af89555e057c0b48f353bc0183d6fdc65.png",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/1X/c6a4bcc7ca1724371ad94b86f574c9204ce80d58.png",
                        "https://leaps.lyra.finance/all-leap",
                        "https://leaps.lyra.finance/leaps/leap-21",
                        "https://gov.optimism.io/t/voting-cycle-1-roundup/2619",
                        "https://gov.optimism.io/t/protocol-delegation-self-nominations/4357/19"
                    ],
                    "GPT-summary": "The post is a proposal for the distribution of $OP tokens for the Lyra project, which is an Optimism native project. The proposal outlines how the tokens will be distributed among builders, liquidity providers, traders, and the ecosystem. The post also explains how the distribution will incentivize usage and liquidity on Optimism. The proposal is subject to approval by the Lyra Council, and specific allocations within each category are yet to be finalized. The post may invite constructive criticism, questions, and extensions from third parties.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Token economics",
                        "Community and engagement",
                        "Smart contract updates",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.714766714766714
                },
                {
                    "author_link": "https://gov.optimism.io/u/kevin",
                    "index": "2",
                    "likes": "0",
                    "time": "03/05/2022-13:23:48",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/kevin",
                    "index": "3",
                    "likes": "0",
                    "time": "03/05/2022-19:02:17",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/luke-ethwalker",
                    "index": "4",
                    "likes": "16",
                    "time": "03/05/2022-22:14:05",
                    "content": "The strong focus on builders strikes me as the best part of this proposal.  Additionally, giving incentives to Lyra will retroactively reward one of Optimism’s first native apps which has driven significant usage to the chain, including my own usage, relatively insignificant though that may be.  Retroactively funding projects building the ecosystem is the entire point of the OP Collective’s token distribution.  Lyra has turned me into an ambassador for Optimism, and I believe it is proper to reward their community. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.661458333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/Firstminister.eth",
                    "index": "5",
                    "likes": "5",
                    "time": "04/05/2022-06:49:30",
                    "content": "I think Lyra is the best options marketplace, along with Opyn. And Optimism is the home of complex financial instruments, the marriage is perfect and the incentives in OP would be well used. If staking were released on Optimism and not just L1, it would be interesting to incentivize single staking of the Lyra token as well ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.773809523809524
                },
                {
                    "author_link": "https://gov.optimism.io/u/Belalang",
                    "index": "6",
                    "likes": "7",
                    "time": "04/05/2022-07:06:52",
                    "content": "Hi dev, don’t get me wrong  this proposal isn’t even benefit for optimism dev/user, the only great decision is share 1,000,000 $OP for lyra builder suggestion: Liquidity (Amount: 1,500,000 $OP Become a Lyra Liquidity Provider), make this as “special” 1,500,000 OP only for people who add liquidity with pair OP/LYRA and LYRA/ETH + start program staking LYRA to get OP (with minimum 30 days staking lyra or less) benefit for both project and can be increase LYRA STAKING second suggestion : (Amount : 500,000 $OP Criteria: Start trading on Lyra 3) earn trading reward only for people who trade ETH/USD,  BTC/USD and OP/USD(if there any) noted: remember this at the end of this program OP community will be vote any proposal if they agree or not for distribution OP to the project, so make it interesting ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.935185185185185
                },
                {
                    "author_link": "https://gov.optimism.io/u/AlvaroHK",
                    "index": "7",
                    "likes": "6",
                    "time": "04/05/2022-08:21:39",
                    "content": "I think the proposal is quite good and in line with what is the ethos of the fund: “Each project must submit a proposal for how they will spend the tokens to grow usage of their project on Optimism” Use the funds to promote trading pairs like OP/LYRA or LYRA/ETH do not really grow usage of the Lyra dapp itself (options market) but to DEXs (uniswap,…). Same for pairs ETH/USD, BTC/USD, OP/USD… seems off of the purpose of the funds allocated to Lyra for this round. The focus in the growth of the Liquidity should be one of the main focus (+builders!) and it’s reflected into the proposal. Pools use sUSD so another native protocol like SNX benefit of it too. Also would allow builders on top of LYRA like POLYNOMIAL to have better liquidity an keep growing their own vaults. I see it could increase Lyra’s TVL from 30M to >90M $ of new capital bridged to OP. I see the proposal as it is a win-win for Optimism ecosystem. Better tools build on top + better liquidity > better efficiency and prices > more use by vaults/traders > more added value and synergies within Optimism. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.781565656565657
                },
                {
                    "author_link": "https://gov.optimism.io/u/cnupy",
                    "index": "8",
                    "likes": "2",
                    "time": "04/05/2022-08:59:12",
                    "content": "I’m so excited about this proposal. Totally support it! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9375
                },
                {
                    "author_link": "https://gov.optimism.io/u/ginpaang",
                    "index": "9",
                    "likes": "6",
                    "time": "04/05/2022-16:34:54",
                    "content": "Lyra is indeed one of the excellent projects in the early stage of op. although I didn’t make much contribution to the whole ecological construction, I still think OP should give a certain retrospective airdrop, because without the early application in ecology, Op has no ecology. Lyra’s participants made a great contribution to the ecology of OP in the early stage. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.730158730158731
                },
                {
                    "author_link": "https://gov.optimism.io/u/justope",
                    "index": "10",
                    "likes": "2",
                    "time": "05/05/2022-08:44:35",
                    "content": "the proposal should be win win solution for user and dev ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "11",
                    "likes": "3",
                    "time": "05/05/2022-15:07:05",
                    "content": "    mjs:  Liquidity Amount: 1,500,000 $OP Criteria: Become a Lyra Liquidity Provider   Liquidity is only work as long as reward is there, i would suggest move some fund from here to Traders, that will encourage users to use platform for long time. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.833333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/polynya",
                    "index": "12",
                    "likes": "3",
                    "time": "05/05/2022-16:47:11",
                    "content": "Fully agree with the builder incentives, and the trading fee rebates are a good idea too. I’d urge caution with the ~50% liquidity incentives, as it often attracts mercenary liquidity. Something to consider would be an initial bootstrapping, but a steeper drop-off, and reinvesting some of the tokens back into builders and/or traders. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.166666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/Muir",
                    "index": "14",
                    "likes": "5",
                    "time": "05/05/2022-17:57:06",
                    "content": "The problem with increasing trader rewards is that it leads to wash trading.  Lyra is already matching trading fee rebates up to 100%, and anything more than that would probably be pointless beyond pumping stats. Increasing liquidity in combination with increased trading allows for reduced slippage and in turn a better trading experience, which hopefully captures long term users.  image2302×456 90.2 KB  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.875
                },
                {
                    "author_link": "https://gov.optimism.io/u/polynya",
                    "index": "15",
                    "likes": "2",
                    "time": "06/05/2022-03:25:23",
                    "content": "Quite true, and this is something that’ll need to be modulated at the Lyra/LEAP end. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/mjs",
                    "index": "16",
                    "likes": "11",
                    "time": "06/05/2022-04:27:18",
                    "content": "Thanks for your feedback everyone! We are actively discussing in the Lyra discord if anyone wants to join us in there: Lyra _/. Firstly we want to finalise the retroactive component of the distribution. I will attempt to summarise the discussion from our Discord below. Retroactive Summary Optimism intends to incentivise future activity and usage on the network. I think we can agree that the vast majority of tokens should be forward-looking. Should we do a retroactive distribution at all? If so, to who? Well, without traders and LPs we wouldn’t have qualified at all. But they have also been rewarded with LYRA in proportion to their trading/liquidity. Also, some of the early LPs have been farming and dumping LYRA. LYRA token holders haven’t directly contributed to trading or liquidity on the protocol. However, I believe those that have participated in governance have indirectly contributed by electing the council which oversees the protocol. I think the following groups should be eligible for a retroactive distribution:  Traders (that didn’t dump) LPs (that didn’t dump) LYRA holders that voted in an election  We could also make the trading and LP criteria independent of volume/liquidity and create a flatter distribution than we will get with future incentives (H/T Spreek). Edit: Builders would also be eligible for retroactive $OP, but that will be handled on a case by case basis via the Grants Council. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.348484848484848
                },
                {
                    "author_link": "https://gov.optimism.io/u/Billy191",
                    "index": "17",
                    "likes": "4",
                    "time": "08/05/2022-13:43:04",
                    "content": "I’m good to see new criteria for retroactive rewards, to find really friends that will walk together with us TBH  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.7272727272727275
                },
                {
                    "author_link": "https://gov.optimism.io/u/Babar",
                    "index": "18",
                    "likes": "2",
                    "time": "13/05/2022-11:01:13",
                    "content": "I want a better eligibility criteria. let the team come up with a new idea. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.590909090909091
                },
                {
                    "author_link": "https://gov.optimism.io/u/Robor2b102",
                    "index": "19",
                    "likes": "3",
                    "time": "14/05/2022-20:52:02",
                    "content": "Yes, I wholeheartedly agree! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Optimism.Goverance",
                    "index": "20",
                    "likes": "6",
                    "time": "21/05/2022-13:27:17",
                    "content": "I like that you guys are giving alot to builders: ex: Poly, Braham, and The Lyra Short Put. Way to be on top of submitting your proposal before everyone else! You guys got your stuff together. The idea to give a small percentage as a retroactive is great as it rewards your loyal users while saving alot for future distribution. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.256944444444445
                },
                {
                    "author_link": "https://gov.optimism.io/u/Luckymonkey",
                    "index": "21",
                    "likes": "4",
                    "time": "26/05/2022-22:40:17",
                    "content": "    mjs:  building L2 native token liquidity is challenging and $OP   Wonderful progress ! Congrats to Lyra Finance for locking in with Optimism ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/Iris",
                    "index": "22",
                    "likes": "0",
                    "time": "27/05/2022-09:13:33",
                    "content": "good, will be wait… irisliang#0864 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/Tjure07",
                    "index": "23",
                    "likes": "2",
                    "time": "27/05/2022-12:30:21",
                    "content": "Thanks for the proposal. Will the ones depositing USDC into the security pool receive any OP-rewards as well? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/SHERPEM",
                    "index": "24",
                    "likes": "0",
                    "time": "27/05/2022-19:06:56",
                    "content": "Aĺl the best…sounds grts ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/shen",
                    "index": "25",
                    "likes": "0",
                    "time": "28/05/2022-12:01:16",
                    "content": "the best options marketplace on Optimisim, really interesting sUSD system good project one! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.958333333333332
                },
                {
                    "author_link": "https://gov.optimism.io/u/Justin",
                    "index": "26",
                    "likes": "3",
                    "time": "29/05/2022-05:47:00",
                    "content": "Incentivizing builders on an optimism native is good, same with liquidity and same with traders.  And for Lyra and few other protocols, a reward to retroactive LPs is in order because they put their money at risk in the early days.  So, all around - solid proposal that will help the OP ecosystem grow. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.339285714285714
                },
                {
                    "author_link": "https://gov.optimism.io/u/brickfance",
                    "index": "27",
                    "likes": "0",
                    "time": "01/06/2022-10:55:58",
                    "content": "Agree with this proposal, very much in the spirit of Web3 [image] ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.3
                },
                {
                    "author_link": "https://gov.optimism.io/u/neozaru",
                    "index": "28",
                    "likes": "1",
                    "time": "02/06/2022-14:47:46",
                    "content": "That one is a no-brainer to me: Lyra is what brought me on Optimism in the first place, and was one of the only protocol actively used there for a while, helping the battletesting of the rollup and bringing new users. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.316287878787879
                },
                {
                    "author_link": "https://gov.optimism.io/u/dregan",
                    "index": "29",
                    "likes": "2",
                    "time": "03/06/2022-20:55:46",
                    "content": "lyra is a nice protocol easy to use i like it and use it several times. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.722222222222221
                },
                {
                    "author_link": "https://gov.optimism.io/u/sonya",
                    "index": "30",
                    "likes": "0",
                    "time": "06/06/2022-13:45:06",
                    "content": "lyra is a first dApp in Optimism for me .i can make a lot of strategy for trading and can control risk by myself. so i get better trading. thanks you for create this protocol. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.583333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/toranit",
                    "index": "31",
                    "likes": "0",
                    "time": "07/06/2022-13:06:02",
                    "content": "Totally agreed with you. I’ve seen many Dapps attract new user with APR on farming, when users don’t happy with the APR they will be gone. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.795454545454546
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "32",
                    "likes": "3",
                    "time": "07/06/2022-13:40:19",
                    "content": "Indeed, I would have preferred to do what Pika has done with their proposal. Lock the token in their vault as lyra and pika both depends on their vault so keeping the vault stable should be top priority. second should be rewarding users using the vault and getting impacted by huge market swing. Liquidity mining wont work for long, sadly i dont have any better solution and I am afriad that some team is not open to receiving feedback. I had bad experience with wePiggy proposal ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.361111111111111
                },
                {
                    "author_link": "https://gov.optimism.io/u/meduzav",
                    "index": "33",
                    "likes": "0",
                    "time": "08/06/2022-08:57:11",
                    "content": "Nice distribution. I still waiting for re-open providing LP on Lyra. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/bobby",
                    "index": "34",
                    "likes": "0",
                    "time": "09/06/2022-14:14:25",
                    "content": "Made minor tweaks to the proposal per a conversation with (and permission from) @mjs ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/Xspaceq3",
                    "index": "35",
                    "likes": "0",
                    "time": "09/06/2022-14:42:17",
                    "content": "That’s good dude… community driven project are best in this space ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "36",
                    "likes": "1",
                    "time": "09/06/2022-14:58:47",
                    "content": "is there a way to see only the change? may be as highlight, because as i look at the proposal now, i dont know what was updated. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/0x5959.eth",
                    "index": "37",
                    "likes": "0",
                    "time": "10/06/2022-04:54:44",
                    "content": "Strongly support this proposal for new users to start using Lyra. First time experience is very important and Lyra has this new user experience. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.4760606060606065
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "38",
                    "likes": "0",
                    "time": "13/09/2022-18:29:06",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "21"
}