{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/draft-dappad-launchpad-grant-proposal-cycle-11/5608",
            "title": "[DRAFT] Dappad Launchpad Grant Proposal - Cycle 11 ",
            "index": 5608,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Grants Council"
            ],
            "tags": [
                "growth",
                "cycle-11"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/speranza",
                    "index": "1",
                    "likes": "19",
                    "time": "14/03/2023-13:42:02",
                    "content": " image945×281 62.1 KB  Author name and contact info (please provide a reliable point of contact for the project.): Umut Garip ( hello@dappad.app – ) (@ugarip – TG/TW) L2 recipient address : 0x8135507D79197A403D3a94F3af0e21aBE33FF637 Which Voting Cycle are you applying for?: 11 I confirm that I have read the landing pages for the Builders  18 and Growth Experiments  18 Sub-Committees and that I have determined my proposal is best suited to be reviewed by the Growth Experiments Sub-Committee: Yes I understand that Growth Experiments grants are subject to a “no sale rule,” as explained in this post , and I have read the terms of the rule: Yes Project Details What are you building?: We are building a launchpad called Dappad Launchpad. Dappad Launchpad is a decentralized launchpad platform for blockchain-based projects, built on top of the Optimism Ecosystem. Its aim is to provide a launchpad for new projects to launch and thrive in a decentralized ecosystem, while taking advantage of the scalability and low fees offered by Optimism. One of the key benefits of building on the Optimism Ecosystem is that it allows for faster and more efficient transactions, while reducing the overall cost of conducting transactions on the Ecosystem. This is achieved through the use of layer 2 scaling solutions, which help to increase the speed and capacity of the underlying blockchain network. Dappad Launchpad leverages the Optimism Ecosystem to provide a secure and decentralized platform for new projects to launch and grow, while taking advantage of the benefits of the underlying infrastructure. It offers a range of services to support project development and launch, including smart contract development, auditing, and tokenomics design. Overall, Dappad Launchpad is building a decentralized platform on the Optimism Ecosystem to help new projects launch and grow in a scalable, secure, and efficient ecosystem.  image945×605 85.8 KB   image945×683 108 KB   image945×566 102 KB  Early Mover Advantage: As the first decentralized launchpad platform built on the Optimism Ecosystem, Dappad Launchpad has the potential to establish itself as the go-to platform for new projects looking to launch on Optimism. This could give it an early mover advantage and help it to build a loyal user base. Scalability and Low Fees: The Optimism Ecosystem offers high scalability and low fees, making it an attractive platform for blockchain-based projects. By leveraging these benefits, Dappad Launchpad could attract a high volume of users looking for efficient and cost-effective launchpad services. Decentralization and Transparency: Dappad Launchpad’s decentralized approach could be a major selling point for users looking for transparency and fairness in the launchpad process. By providing a decentralized platform for funding and resource allocation, Dappad Launchpad could attract users who prioritize decentralization and transparency. Quality Projects: The success of Dappad Launchpad will depend on the quality of the projects it supports. By carefully selecting and vetting projects, Dappad Launchpad could build a reputation as a platform that only supports high-quality projects. This could help it to attract more users and investors over time. Strong Community: Dappad Launchpad could leverage the strength of the Optimism community to build a strong user base and support Ecosystem. By fostering a sense of community and providing resources and support for users, Dappad Launchpad could build a loyal and engaged user base that helps to drive its growth and success. Overall, the success of Dappad Launchpad in the Optimism Ecosystem will depend on a variety of factors, including its ability to attract high-quality projects, build a strong user base, and differentiate itself from other launchpad platforms. By leveraging the benefits of the Optimism Ecosystem and providing a decentralized and transparent platform for new projects to launch, Dappad Launchpad has the potential to be a successful launchpad platform in the blockchain ecosystem. How many users does your project have currently? Please include how you arrived at this estimate: We, at Dappad Launchpad, are currently focused on building our community. Although our project is still relatively new, we have seen significant interest in it, as evidenced by the high levels of activity in our Discord, Twitter, and Telegram communities. At present, between 3000-4000 users are actively participating in Dappad Launchpad-related activities, indicating that our project is gaining momentum and attracting a growing number of users. Looking ahead, we expect the number of users to continue to grow as we expand our range of activities and raise awareness about our offerings. As our community continues to expand, we believe that more people will become aware of our project and its potential, which will further solidify our position in the market. Building a strong community is crucial for the success of any blockchain project, as it not only helps to attract users and investors but also fosters a sense of trust and credibility in the project. By engaging with our community and providing resources and support to our users, we are taking a proactive approach to building a loyal and engaged user base that can help to drive our growth and success over time. Overall, we are optimistic about our project’s future prospects, and we are committed to building a strong and vibrant community that can help to establish Dappad Launchpad as a leading launchpad platform in the blockchain space. We completed 2 events so far on Galxe, and all events were on Optimism Ecosystem… Dappad Galxe Event Nft Contract : Dappad Testnet Event (APPATEST) Token Tracker | Optimism In 2 events we Dappad contributed 3.960 TX in Optimism Ecosystem.  image945×527 58.2 KB  Crew3 Missions  image945×875 96 KB  How will receiving a grant enable you to further the mission of maximizing the number of users interacting with Optimism? Please include a step-by-step flow of how you imagine this grant can lead to a greater number of user interactions with Optimism: We at Dappad Launchpad can maximize the impact of Optimism’s Grant Op by strategically (The Strategy is on page 10 shown as a table) deploying the funds to benefit the ecosystem. We plan to fund and support promising projects and protocols that align with the Optimism community’s goals and values. Additionally, we aim to assign tasks to users in active ecosystem projects and distribute rewards to successful completers. We believe that creating a competitive grant program will be an effective way to invite proposals from Optimism-built projects, partner with established protocols, or offer mentorship programs to accelerate development and ensure projects are well-positioned for success. By strategically distributing grant funds to impactful projects and initiatives, we can foster growth and innovation in the Optimism ecosystem, contributing to its long-term success and the broader blockchain industry. Tell us about the users you plan to target with this grant. Include any defining characteristics that will help you identify and target them.: Dappad Launchpad could target investors interested in Optimism-based projects and protocols with the grant, in line with its purpose of supporting the growth and development of projects on the Optimism ecosystem. Optimism-specific investors - These could include venture capital firms, angel investors, or cryptocurrency investors who are specifically interested in investing in projects and protocols built on the Optimism ecosystem. Early adopters of Optimism- These could include individuals who have been involved in the Optimism ecosystem from its early stages and are interested in supporting its growth and development. DeFi investors - These could include investors who are interested in supporting projects that are part of the broader decentralized finance (DeFi) ecosystem, which is closely tied to the Optimism ecosystem. Institutional investors with an interest in blockchain technology - These could include venture capital firms or other financial institutions that are interested in investing in emerging blockchain technologies and startups. Overall, the target audience for Dappad Launchpad with the Optimism grant would be investors who are specifically interested in supporting the growth and development of projects and protocols built on the Optimism ecosystem. It’s important for Dappad Launchpad to tailor its marketing and outreach efforts to reach these specific investor audiences and provide them with the necessary information and resources to make informed investment decisions. How would these users interact with Optimism? For how long?: According to the working logic of Dappad Launchpad, there is an obligation to stake Dappad tokens in the Optimism ecosystem for large projects to be funded in Launchpad. This staking is required in order to participate in the pre-sale of these large projects. The purpose of this staking is to incentivize token holders to participate in the Launchpad, and to reward them with part of the grant received by Dappad. By staking their tokens, users will not only earn token rewards with low interest rates, but also have the opportunity to participate in high-quality projects launching on the platform. In the long run, the fact that Dappad is funding good projects and achieving successful launches will allow people to become more familiar with the Optimism ecosystem and with Dappad. As Dappad gains more recognition and credibility within the community, it is likely that more users will become interested in staking their tokens and participating in Launchpad activities, leading to increased adoption of the Optimism ecosystem as a whole. Provide us with links to any of the following for the project: Demo: https://dappad.app Website: https://dappad.app Twitter: https://twitter.com/Dappadofficial Discord/Discourse/Community: Discord: Discord Telegram : Telegram: Contact @Dappadofficial Crew3: CREW³ | The #1 operating system for web3 communities Galxe: Dappad Optimism Launchpad | Galxe Github: : Dappad · GitHub Technical/Economic Documentation: Pitchdeck : https://dappad.app/pitchdeck.pdf Whitepaper: https://dappad.app/whitepaper.pdf Other: @Dappadapp | Twitter | Linktree Do you have any metrics on the project currently? (TVL, transactions, volume, unique addresses, etc. Optimism metrics preferred; please link to public sources such as Dune Analytics, etc.): We did 2 activities on Galxe, 1 activity on Crew3 with our community that they can attend at a certain time. We kept the time interval short and increased the interest. And all our activities are done on Optimism. We do not have any kind of metrics determined in question, because Dappad has not been launched yet. With our future events, we aim to do more Optimism transactions with our community in a longer period of time. Dappad Testnet Event (APPATEST) Token Tracker | Optimism Who are your competitors, and are they on Optimism?: It may seem like it has many competitors due to the De-Fi protocols currently, but there is no Launchpad available on Optimism. Dappad is the first of Optimism as both a launchpad and an investment point. Please link to code audits (if any): We don’t have yet but we plan to have Team: Başaran Culha / CMO: https://www.linkedin.com/in/başaran/ Umut Çınar / Blockchain Dev: https://www.linkedin.com/in/umut-cinar/ Can Özfuttu / Front end Dev: https://www.linkedin.com/in/canozfuttu/ Başar Mahmutluoğlu / BD of Marketing: https://www.linkedin.com/in/bmahmutluoglu/ Taylan Sağır / BD of Marketing: https://www.linkedin.com/in/taylansagir/ Ferhat Özdemir / Community Manager: https://www.linkedin.com/in/ferhato6zdemir/ Who are your founders?: Umut Garip: https://www.linkedin.com/in/ugarip/ Berkay Guven: https://www.linkedin.com/in/berkayguven/ Deniz Dervisoglu: https://www.linkedin.com/in/denizdervisoglu/ What makes your team well-suited to carry out the project described in this proposal? The Dappad team consists of 9 professional members and all team members are Doxxed. All of the team members have gained experience in many different projects in many different fields in the past. And with the combination of these common Experiences, Dappad began to be formed. Is this your first Web3 project?: The team members separately has worked with different projects in the past, but Dappad is a startup from scratch. If not, what else have you built? (Share links, Github repository, or any other useful information.): TrustPad (Launchpad) Tegisto (Decentralized Exchange) / Not Launched yet As Umut Garip is Co Founder of Alpha Capital, He has been incubating 2 projects right now called; Devium, and ShopCek Devium (Market place for Developers) / Not Launched yet ShopCek (E-Commerce Market Place) / Not Launched yet Grant Request  What is the size of the grant request? (250k OP max): 92.000 OP How do you justify the size of the grant?: At Dappad, we have multiple grant-related plans and programs. The process, which will begin with the conversion of communities that believe in optimism into an investor mass, continues with projects in different networks and Dappad acting as a bridge for the investor community to become Optimistic. During this process, partnerships will be established with various projects on Optimism and this grant will be distributed through various missions that will benefit the Optimism ecosystem. 230k Op is not enough when marketing and personal community rewards are included in these programs. As the Dappad team, we will be more active in grants and applications as our success is proven. Roadmap and Distribution Plan Describe in discrete steps how you will successfully implement your grant plan: In order to support the growth of the platform and attract more investors, the team behind Dappad has decided to distribute the donated Op’ token among investors participating in events with other projects in the Optimism Ecosystem. The first 50% of the token will be distributed before launch, rest will be distributed after the launch to investors participating in events with other projects in the Optimism Ecosystem, and the focus will be on encouraging these projects to become solution partners and organizing events to promote the Dappad Launchpad. This distribution plan is designed to help build a strong network of partners and supporters for the Dappad Launchpad, as well as attract more investors to the platform. By collaborating with other projects in the Optimism Ecosystem, Dappad hopes to create a thriving community of blockchain enthusiasts who can work together to support the growth of the platform. To further incentivize investors to participate in the Dappad Launchpad, the team has also implemented a staking mechanism. In order to participate in projects launched after the launch of the Dappad Token, investors will have to stake their Dappad tokens. In return, they will receive some amount (shown below) of Dappad token income and OP tokens as a loyalty reward. 20.000 quantities of OP will be distributed before launch as soon as events / competitions are over. It will be disturbed according to ranking on competitions and transaction participants make on events 72.000 quantities of OP will be distributed after launch 22.000 of them tokens will be distributed to those who make the most transactions on the      Optimism Ecosystem with Appa tokens in proportion to their transactions. Note: A minimum transaction      number will be announced. 50.000 of them will be distributed to those who staked their Appa Tokens on dappad.app (Min requirement of staked Appa token will be announced) This staking mechanism is designed to prevent inflation and encourage investors to hold their tokens for longer periods of time. By staking their Dappad tokens, investors can earn a small amount of income while also contributing to the growth of the platform. This, in turn, will cause the Total Value Locked (TVL) on the platform to grow further, creating more opportunities for investors to earn rewards. In conclusion, the distribution plan for the granted Op’ token for the Dappad Launchpad is designed to support the growth of the platform and attract more investors. By collaborating with other projects in the Optimism Ecosystem and implementing a staking mechanism, Dappad hopes to create a thriving community of blockchain enthusiasts who can work together to support the growth of the platform. How will the OP tokens be distributed? (please include % allocated to different initiatives such as user rewards/marketing/liquidity mining. Please also include a justification as to why each of these initiatives align with the problem statement this proposal is solving. Distribution should not include the sale of any tokens by the grantee or the use of tokens for compensation, protocol expenses, etc. See the no sale rule here):  image945×733 139 KB  The Op Tokens will be distributed in the name of loyalty reward for participants who attend Dappad Launchpad’s events with partners and stake Dappad Tokens after the Launch. The distribution will increase gradually each week as more participants attend the events. Over what period of time will the tokens be distributed for each initiative?: 12 week Please provide benchmark milestones for this project. These milestones should guide the Optimism community on the progress of your project throughout your work on the project. Do not use distribution of the grant itself as a milestone:   Successfully complete the integration of Dappad Launchpad with the Optimism Ecosystem, enabling projects to be launched and gain visibility on the platform.   Develop and launch a minimum viable product (MVP) for Dappad Launchpad, including key features such as project listing, investment opportunities, and basic analytics and reporting.   Demonstrate early community growth and engagement by reaching at least 5,000 users on the platform.   Host and promote at least 5 high-quality projects on the Dappad Launchpad platform, thus demonstrating the platform’s ability to attract and support innovative projects.   Achieve a user retention rate of at least 20% after the first 3 months of operation, demonstrating that users find the platform valuable and engaging in the long term.   Generate at least $50,000 in revenue from fees and commissions charged on the platform, demonstrating the platform’s ability to generate sustainable revenue streams.   Implement security features such as two-factor authentication, smart contract auditing and other security measures to ensure the safety of users’ funds and data.   Receive positive feedback and ratings from at least 50% of users in user surveys and reviews, which will serve to demonstrate a high level of user satisfaction and trust in the platform.   These metrics milestones will guide the Dappad Launchpad team and the Optimism community in measuring the project’s success in achieving its goals of fostering growth and innovation in the Optimism ecosystem, while providing a safe and reliable platform for users and investors.   Please define critical milestones for this project. Critical milestones are meant to show good-faith efforts to accomplish the project. Non-completion of these milestones could lead to revocation of remaining grant rewards. Do not use distribution of the grant itself as a milestone:   Integration with leading DeFi analytics platforms: Dappad Launchpad will integrate with leading DeFi analytics platforms such as Dune Analytics and Token Terminal to provide users with real-time data and insights on the performance of projects launched on the platform. This will increase transparency and help users make more informed investment decisions.    Research and identify the most suitable DeFi analytics platforms to integrate with (by May 2023)| Develop integration plan and technical requirements (by June 2023)| Test and deploy integration with selected platforms (by August 2023)| Monitor and evaluate the effectiveness of integration and make improvements if necessary (ongoing)|    Development of a mobile app. Dappad Launchpad will develop a mobile app for iOS and Android devices, making it easier for users to access the platform and stay informed about new project launches and investment opportunities. The app will be designed with a user-friendly interface and will include features such as push notifications, portfolio tracking and trading functions.    Conduct user research and gather requirements for the mobile app (by April 2023)| Design and develop a user-friendly mobile app for iOS and Android devices (by October 2023)| Test and deploy the mobile app (by November 2023)| Monitor user feedback and make improvements if necessary (ongoing)    Launching a decentralized governance mechanism: Dappad Launchpad will launch a decentralized governance mechanism that enables stakeholders to participate in decision-making and platform management. This will include implementing a voting mechanism and developing a user-friendly interface for stakeholders to participate in governance.    Research and identify the best approach for a decentralized governance mechanism (by May 2023) Develop and test the governance mechanism (by September 2023) Launch the governance mechanism and provide stakeholders with the ability to participate in decision-making (by October 2023) Monitor and evaluate the effectiveness of the governance mechanism and make improvements if necessary (ongoing)    Implementation of an automated smart contract auditing system: Implementation of an automated smart contract auditing system to improve the security and reliability of projects launched on the Dappad Launchpad. This will be realized through the integration of automated auditing tools such as MythX or Slither, which will enable developers to quickly and easily detect and fix vulnerabilities in their smart contracts.    Research and identify the most suitable automated auditing tools (by April 2023) Integrate the selected auditing tools into the Dappad Launchpad platform (by August 2023) Test and optimize the auditing system to ensure it effectively detects and fixes vulnerabilities (by October 2023) Monitor and evaluate the effectiveness of the auditing system and make improvements if necessary (ongoing)    Deployment of a decentralized launchpad analytics dashboard: Deployment of a decentralized launchpad analytics dashboard to provide users with real-time information on the performance and status of projects launched on the Dappad Launchpad. This will enable users to make informed investment decisions and monitor the progress of their investments.    Design and develop a user-friendly analytics dashboard for the Dappad Launchpad platform (by August 2023) Test and deploy the analytics dashboard (by September 2023) Monitor and evaluate the effectiveness of the analytics dashboard and make improvements if necessary (ongoing)    Launch a referral program: Launch a referral program encouraging users to refer new projects and investors to the platform, which will help grow the Dappad Launchpad community and increase the number of high-quality projects available for investment.    Develop and launch a referral program that incentivizes users to refer new projects and investors to the platform (by November 2023) Monitor the effectiveness of the referral program and make improvements if necessary (ongoing)    Increase the number of supported blockchain networks: By increasing the number of blockchain networks supported by Dappad Launchpad, it will allow projects built on additional blockchain networks to be launched and gain visibility on the platform.    Research and identify additional blockchain networks to support (by June 2023) Develop and deploy the necessary technical infrastructure to support the additional blockchain networks (by November 2023) Monitor and evaluate the effectiveness of the expanded platform and make improvements if necessary (ongoing)    Implement a governance system for the Dappad Launchpad platform: Implement a governance system for the Dappad Launchpad platform that allows stakeholders to participate in decision-making processes related to the development and operation of the platform.    Research and identify the best approach for a governance system that allows stakeholders to participate in decision-making (by May 2023) Develop and test the governance system (by September 2023) Launch the governance system and provide stakeholders with the ability to participate in decision-making (by October 2023) Monitor and evaluate the effectiveness of the governance system and make improvements if necessary (ongoing)  If the OP tokens are for direct distribution to users, why will incentivized users and liquidity on Optimism remain after incentives dry up?: We plan to enhance the liquidity of our platform by introducing a new pair, namely APPA - OP, and concurrently offer a farming opportunity to our valued liquidity providers. These providers will be duly compensated in the form of APPA tokens for their contributions towards augmenting the liquidity of the aforementioned pair. As a result of this initiative, investors will be more inclined to acquire additional OP tokens to participate in the liquidity pool instead of selling OP tokens they once gained, thereby increasing their chances of earning greater rewards. By providing this avenue for token holders to generate rewards, we hope to promote a sustainable ecosystem and foster a sense of community among our stakeholders. Please provide any additional information that will facilitate accountability (smart contracts addresses relevant to the proposal, relevant organizational wallet addresses, etc.): Additional information that can be added is ‘Is Your Project Native to Optimism?’ included in the question. Yes, Dappad is Native to Optimism A -Token Contract - 0x3813D02352273Daf0dDB10a6994F73F552642772 -Staking Contract (7 days) - 0x0EB4DbB2ee5CCC7cF77AEf1D9C2f82C0D586e125 -Staking Contract (14 days) - 0x85165442e5717D6Ded5582f79c920b6f55469712 -Staking Contract (30 days) -0x14007885a9c2d48903B4F793bfE23d4b1868aDD9 -Staking Contract (60 days) - 0x6de2751c984Dc0F8fC803668961e8DbD09DDED56 -Staking Contract (90 days) - 0x31f378CB59F5B2cf4575FdcF4Fc77D40628bB29F -Dappad Pool Contract - 0x9A5F94Ec2a5C3d03e979dd8e71Df32009e1F8E4A -Dappad Linear Claim Contract - 0xa6341045540ca361A383797Be6b6d952AB1d374D -Dappad Montly Claim Contract - 0x85B4de1AC543B458B78FA544eeDf0b99fdd46e98 Optimism Relationship Does your project solve a problem for the Optimism ecosystem? If so how?:   Lack of a reliable platform for launching new projects and promoting them to a wider audience.   Lack of interoperability with other blockchain networks, as the Optimism Ecosystem only supports Ethereum-based applications.   Lack of a reliable platform for investors to discover and invest in new projects.   Difficulty for projects built on other blockchain networks to port their applications over to the Optimism Ecosystem.   Need for a platform that can facilitate the launch and promotion of DeFi projects to a broader user base.   Need for a platform that offers a secure and decentralized environment for projects to launch and gain exposure.   Need for a platform that fosters collaborations and partnerships between projects on different blockchain networks, providing a platform for cross-chain interoperability.   Need for a platform that ensures investors have access to reliable and high-quality investment opportunities.   By addressing these issues, Dappad Launchpad helps to drive innovation and growth within the Optimism ecosystem while providing a secure and efficient environment for users and investors.   Why will this solution be a source of growth for the Optimism ecosystem?: Dappad Launchpad’s solution will be a source of growth for the Optimism ecosystem because it addresses several key issues that have been hindering the growth and adoption of DeFi projects on the Optimism Ecosystem. By providing a reliable platform for launching and promoting new projects, Dappad Launchpad will attract more developers and entrepreneurs to the Optimism Ecosystem, driving innovation and increasing the diversity of applications built on the Ecosystem. Additionally, by fostering collaborations and partnerships between projects on different blockchain networks, Dappad Launchpad will enable cross-chain interoperability and expand the reach of the Optimism Ecosystem beyond the Ethereum ecosystem. This will attract new users and investors to the ecosystem, further driving growth and adoption. Furthermore, by providing a secure and reliable platform for investors to discover and invest in vetted projects, Dappad Launchpad will create a trustworthy investment environment and attract more capital to the ecosystem. This will provide funding for new projects and help to drive their growth and adoption. Overall, Dappad Launchpad’s solution will help to overcome key barriers to growth and adoption in the Optimism ecosystem, paving the way for further innovation, diversity, and expansion. Is your project Optimism Native? : Yes we already have 9 contracts on Optimism Confirmations I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: Yes I understand that I will be expected to following the public grant reporting requirements outlined here : Yes ",
                    "links": [
                        "https://foul-porch-0eb.notion.site/Builders-Sub-Committee-02ba9da5b4534fbf955e6e4c8fcf1aa3",
                        "https://foul-porch-0eb.notion.site/Builders-Sub-Committee-02ba9da5b4534fbf955e6e4c8fcf1aa3",
                        "https://foul-porch-0eb.notion.site/Growth-Experiments-Sub-Committee-270d2f75ff0f410a869b2ba6a8324006",
                        "https://foul-porch-0eb.notion.site/Growth-Experiments-Sub-Committee-270d2f75ff0f410a869b2ba6a8324006",
                        "https://gov.optimism.io/t/grant-proposal-template/3233",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/5/51caf481e81b9d9bafb01e6709e3fcc6d4ea1289.jpeg",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/1/1cf369a7717c4e9763013aafd7ba5e16882688c7.jpeg",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/f/f95217d2f0ef6560f61679dc05ae6f8abbf7b0d3.jpeg",
                        "https://optimistic.etherscan.io/token/0x58de77b1e4ef1e5a0887155b7b11fc18bfe322c9",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/8/83d470a7dd94b5b00aeeb655573bde87c2193c4c.jpeg",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/0/0efbde1d7f384edae5f427afa1ff109134cf9092.jpeg",
                        "https://dappad.app",
                        "https://dappad.app",
                        "https://twitter.com/Dappadofficial",
                        "https://discord.gg/fN4MuGzv35",
                        "https://t.me/Dappadofficial",
                        "https://crew3.xyz/c/dappadapplaunchpad/questboard",
                        "https://galxe.com/DAPPAD",
                        "https://github.com/dappadapp",
                        "https://dappad.app/pitchdeck.pdf",
                        "https://dappad.app/whitepaper.pdf",
                        "https://linktr.ee/dappadapp",
                        "https://optimistic.etherscan.io/token/0x58de77b1e4ef1e5a0887155b7b11fc18bfe322c9",
                        "https://www.linkedin.com/in/ba%C5%9Faran/",
                        "https://www.linkedin.com/in/umut-cinar/",
                        "https://www.linkedin.com/in/canozfuttu/",
                        "https://www.linkedin.com/in/bmahmutluoglu/",
                        "https://www.linkedin.com/in/taylansagir/",
                        "https://www.linkedin.com/in/ferhato6zdemir/",
                        "https://www.linkedin.com/in/ugarip/",
                        "https://www.linkedin.com/in/berkayguven/",
                        "https://www.linkedin.com/in/denizdervisoglu/",
                        "https://foul-porch-0eb.notion.site/Proposer-AMA-February-3-2023-279db2774af249a8b07797d3cb9b5ef3",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/6/69370c7cd2d4e7610d517f225343f1cb03e7fb36.jpeg",
                        "https://gov.optimism.io/t/suggested-public-reporting-requirements-for-grantees/4176",
                        "https://gov.optimism.io/t/bhu-bu-gun-d-davam/5654/4"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.747414369981163
                },
                {
                    "author_link": "https://gov.optimism.io/u/kocak04",
                    "index": "2",
                    "likes": "9",
                    "time": "15/03/2023-13:17:01",
                    "content": "Looks like a good project. I would be interested. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.375
                },
                {
                    "author_link": "https://gov.optimism.io/u/MoneyManDoug",
                    "index": "3",
                    "likes": "12",
                    "time": "15/03/2023-15:57:06",
                    "content": "Hey this is Doug from the growth council, throughout the application process, this forum thread will be one of the official means of communication. Please be sure to monitor it for updates over the course of the review period. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/Revaa",
                    "index": "4",
                    "likes": "10",
                    "time": "15/03/2023-18:26:46",
                    "content": "I am thrilled with the Optimism ecosystem  and I am eagerly anticipating the first launchpad project to be released on it. I will definitely be keeping up with your updates. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.416666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/den0",
                    "index": "5",
                    "likes": "9",
                    "time": "15/03/2023-18:58:00",
                    "content": "I’m hoping you’ll be a hitchhiking guide for the Optimism Galaxy. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Ajantis",
                    "index": "6",
                    "likes": "6",
                    "time": "15/03/2023-19:20:25",
                    "content": "The Dappad project has me incredibly excited about the future of the crypto world. The project’s innovative approach, combined with its presence on popular ecosystem like Optimism, is incredibly promising. I can’t wait for the day when the project is finally released and we can see what it can do. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.395833333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/speranza",
                    "index": "7",
                    "likes": "3",
                    "time": "15/03/2023-22:06:48",
                    "content": "Thank you for the feedback. We keep our eyes on here for the probability of updates ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Cango35",
                    "index": "8",
                    "likes": "5",
                    "time": "16/03/2023-11:56:02",
                    "content": "Their focus on inclusivity and education also sets them apart, making blockchain technology more accessible to a wider audience. By offering resources and support to new and aspiring blockchain entrepreneurs, Dappad Launchpad is helping to foster a vibrant and diverse ecosystem. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.472537878787879
                },
                {
                    "author_link": "https://gov.optimism.io/u/kocak04",
                    "index": "9",
                    "likes": "3",
                    "time": "16/03/2023-16:05:09",
                    "content": "Launchpads have always intrigued me. It’s exciting to see so many credible projects launching from here on a great network. The success of the Optimism ecosystem is obvious. It is exciting to see that dappad, as the first and only launchpad of the ecosystem, will contribute a lot to this ecosystem. I’m definitely considering investing and I can’t wait to see dappad develop the ecosystem. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.425
                },
                {
                    "author_link": "https://gov.optimism.io/u/Ozzy0133",
                    "index": "10",
                    "likes": "1",
                    "time": "20/03/2023-16:28:23",
                    "content": "Nice to see a good launchpad project in optimism ecosystem. Hope it will close an important gap. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.833333333333332
                }
            ]
        }
    ],
    "group_index": "609"
}