{
    "poll_list": [
        {
            "id": "0x4e3e7bec358c9e2fc2f6b24be15cbd2bc13e31c1eff82151e6566b6b779ffbd4",
            "title": "Season 2: Cycle 8: Arrakis ",
            "discussion": "https://gov.optimism.io/t/draft-gf-phase-1-proposal-arrakis-finance/3805/2",
            "body": "This Governance Fund Phase 1 proposal is eligible for voting in Cycle 8. This is the last Voting Cycle of Season 2. \n\nThis proposal was reviewed by [DeFi Committee A](https://gov.optimism.io/t/defi-committee-a-season-2-recommendations/3522/10?u=lavande). You can find committee recommendations below:\n[DeFi Committee A Recommendations](https://gov.optimism.io/t/defi-committee-a-season-2-recommendations/3522/10?u=lavande)\n\nShadow DeFi Committee B is not an official committee but posts their own recommendations here: [https://gov.optimism.io/t/defi-shadow-committee-season-2-recommendations/3549/11](https://gov.optimism.io/t/defi-shadow-committee-season-2-recommendations/3549/11)\n    \nBy approving committees, the Token House entered a social contract to entrust and delegate the bulk of decision-making to official committees. However, delegates may vote against the recommendation of official committees but should provide a justification to the community as to why they voted differently.",
            "choices": [
                "For",
                "Against",
                "Abstain"
            ],
            "scores": [
                375572.0991908527,
                12188566.811318876,
                913080.3497694985
            ],
            "start": 1667513114,
            "end": 1668110714,
            "snapshot": "30456637",
            "state": "closed",
            "author": "0x83E54889754e737Fb3CdF07BAaCC0eB9699B6Bdd",
            "space": {
                "id": "opcollective.eth",
                "name": "Optimism Collective"
            }
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/draft-gf-phase-1-proposal-arrakis-finance/3805",
            "title": "[DRAFT] [GF: Phase 1 Proposal] Arrakis Finance ",
            "index": 3805,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Governance Fund: Phase 1"
            ],
            "tags": [
                "season-2",
                "cycle-8",
                "not-passed"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/barbarossa_Arrakis",
                    "index": "1",
                    "likes": "7",
                    "time": "25/10/2022-09:15:29",
                    "content": "Project name: Arrakis Finance Author name and contact info: barbarossa Twitter: @ 0x_barbarossa TG: @ Oxbarbarossa I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: Yes L2 recipient address: 0x8636600A864797Aa7ac8807A065C5d8BD9bA3Ccb Which Voting Cycle are you applying for? Phase 1, Cycle 8 Grant category: DeFi Is this proposal applicable to a specific committee? No Project description: Arrakis Finance is a liquidity management protocol that is built on top of Uniswap V3 and can be extended to any concentrated liquidity AMMs. Arrakis provides  The infrastructure that enables the easy implementation of any market making strategies and experiences, and Liquidity management strategies that are fit for any specific purposes of liquidity providers.  Project links:  Website: https://www.arrakis.finance/  Twitter: https://twitter.com/ArrakisFinance   Additional team member info: Co-founder & CEO: Hilmar X Twitter: @ hilmarxo TG: @ hilmarx Co-founder & CTO: Kassandra Twitter: @ kassandraETH TG: @ kassandra_eth Previous projects the team has meaningfully contributed to: Gelato Network: www.gelato.network/ Relevant usage metrics:  TVL: $720m (defillama) Network footprint: Mainnet, Optimism, Polygon and Arbitrum. Easily deployable on any network where Uniswap is present.  Competitors, peers, or similar projects (please link): Gamma (www.gamma.xyz) Charm Finance (charm. fi) Popsicle Finance popsicle.finance) Is/will this project be open sourced? Yes Optimism native? No Date of deployment/expected deployment on Optimism: Jan-09-2022 (optimistic tx hash/2151535) Ecosystem Value Proposition: Currently, in terms of TVL and volume, the overwhelming majority of trading activities on Uniswap are on Mainnet. Even among L2s, Optimism still falls behind Arbitrum and Polygon on those aspects. With the rapid growth of Optimism ecosystem, lack of liquidity and volume can be a major turnoff for projects as it is one of the top priorities when deciding whether or not to launch on a network. Arrakis’ core strength lies in bootstrapping liquidity for tokens in the most cost effective way, and creating deep liquidity with less capital by leveraging the concentrated liquidity feature of UniV3. By having Arrakis manage their liquidity, projects, especially the ones with limited resources, can save their $ETH or $USDC for building the products on Optimism, and no longer have to allocate a large budget of the project tokens to incentivize LPs. Besides, the lack of liquidity to support bigger volume will be significantly improved as Arrakis will fully and safely utilize the concentrated liquidity feature of UniV3. With the liquidity issue no longer being a barrier, projects can feel more confident to launch on Optimism, and way more trading activities can be encouraged to therefore boost the volume on Uniswap, hence the overall transactions on Optimism. Has your project previously applied for an OP grant? No Number of OP tokens requested: 500k Did the project apply for or receive OP tokens through the Foundation Partner Fund? No If OP tokens were requested from the Foundation Partner Fund, what was the amount? N/A How much will your project match in co-incentives? (not required but recommended, when applicable): N/A as there is no token from Arrakis yet. Proposal for token distribution:   How will the OP tokens be distributed? 100% allocation will be liquidity mining incentive for projects that have no pools on Uni V3 for their native tokens yet and will create Uni V3 pools in conjunction with the deployment of Arrakis PALM - a liquidity bootstrapping strategy developed by Arrakis Finance. Projects need to apply for the incentive through Arrakis. In order to propel the growth of Optimism ecosystem and further decentralize the distribution of $OP token, newly launched Optimism native projects and projects on other networks that recently expanded to Optimism will have priority in the application. Additionally, since the initial liquidity deposited into Arrakis vaults will be protocol owned liquidity, it means that protocol treasuries will be the recipients of the $OP incentives. To further encourage the Optimism governance participation and $OP distribution, all protocols that received $OP incentive through Arrakis will need to stake or delegate at least 50% of the $OP token, and distribute the rest to their community members. Note that a certain amount of the $OP token received might be used to cover transaction costs for operations on Optimism.   Over what period of time will the tokens be distributed for each initiative? The liquidity mining program will be running for 3-6 months, depending on the number of applicants.   Please list the milestones/KPIs you expect to achieve for each initiative: During the LM program, periodically, the number of projects onboarded, total TVL growth, and total volume growth will be monitored as KPIs to indicate the effectiveness of the LM program. The program may adjust accordingly based on the outcome of the KPIs.   Why will incentivized users and liquidity on Optimism remain after incentives dry up? LM is only to “grease the wheel” to get it started, a means to help projects more easily initiate their presence on Optimism. More importantly, it is to create opportunities showcasing the capabilities of Arrakis in helping projects and the entire Optimism ecosystem bootstrap liquidity and elevate capital efficiency, with much less liquidity resources required as opposed to the conventional methods. Once projects have witnessed the effectiveness of Arrakis’ services, the excellence of our product is enough of an incentive for them to stay and also for more to come, rather than token incentives, which is also the ethos of Arrakis Finance.   Please provide any additional information that will facilitate accountability:     Contract Address     Arrakis Factory 0x2845c6929d621e32B7596520C8a1E5a37e616F09   Arrakis Resolver 0xd2Bb190dD88e7Af5DF176064Ec42f6dfA8672F40   Arrakis Router 0xc56f04EC20dAD27c0f4701b14977C2DbE85142BA     ",
                    "links": [
                        "https://twitter.com/ArrakisFinance",
                        "https://gov.optimism.io/t/voting-cycle-8-roundup/3742/10",
                        "https://gov.optimism.io/t/scaleweb3-delegate-communication-thread/3314/15",
                        "https://gov.optimism.io/t/defi-committee-a-season-2-recommendations/3522/10",
                        "https://gov.optimism.io/t/gfx-labs-delegate-communication-thread/2728/19"
                    ],
                    "GPT-summary": "The post is a draft proposal for Arrakis Finance, a liquidity management protocol built on top of Uniswap V3. The proposal explains the project's infrastructure and liquidity management strategies, as well as its ecosystem value proposition. The author provides links to the project's website and Twitter account, and includes relevant usage metrics and information on the team. The proposal requests 500k OP tokens for a liquidity mining incentive program, and outlines the token distribution and milestones/KPIs for the initiative. The post also includes additional information for accountability, such as contract addresses.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Interoperability and Scaleability",
                        "Token economics",
                        "Smart contract updates",
                        "Privacy, Security and risk management"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.703555001546073
                },
                {
                    "author_link": "https://gov.optimism.io/u/ScaleWeb3",
                    "index": "2",
                    "likes": "3",
                    "time": "25/10/2022-13:49:35",
                    "content": "Thanks for your proposal. Happy to see Arrakis on Optimism and kickstart a healthy ecosystem around Uni v3. We didn’t see protocol metrics in regards to Optimism but checked DefiLLama & your website and saw some traction throughput 2022.  Do you still collaborate with Lyra, Thales etc.? Why did your TVL on Optimism go down? Did your focus shift back to Ethereum l1?   image774×394 27.3 KB   image730×360 32.9 KB  The amount requested could be fair for a 6 month liquidity mining campaign considering your current success as top uni v3 LM manager. However, this proposal looks a bit like a blank cheque with missing details on specific pairs, amounts per project, etc. which makes it hard to support in its current shape. Do you already have an idea for specific projects that you’d like to help with concentrated LM?     barbarossa_Arrakis:  100% allocation will be liquidity mining incentive for projects that have no pools on Uni V3 for their native tokens yet and will create Uni V3 pools in conjunction with the deployment of Arrakis PALM - a liquidity bootstrapping strategy developed by Arrakis Finance.   Protocol owned liquidity is much more sustainable than liquidity incentives for end-users. On one side, we believe the idea of governance participation is interesting but, on the other side, we do not yet see the connection to Optimism governance participation and further distribution to end-users. This sounds a bit like an unnecessary airdrop to parties that might not care? Consequently, don’t you think it would be better for Optimism to loan Op to Arrakis & projects to establish liquidity but ultimately get it back?     barbarossa_Arrakis:  Additionally, since the initial liquidity deposited into Arrakis vaults will be protocol owned liquidity, it means that protocol treasuries will be the recipients of the $OP incentives. To further encourage the Optimism governance participation and $OP distribution, all protocols that received $OP incentive through Arrakis will need to stake or delegate at least 50% of the $OP token, and distribute the rest to their community members.   Kickstarting things should be the optimal use for Op tokens - whether lent or invested.     barbarossa_Arrakis:  Once projects have witnessed the effectiveness of Arrakis’ services, the excellence of our product is enough of an incentive for them to stay and also for more to come, rather than token incentives, which is also the ethos of Arrakis Finance.   Overall, interesting proposal but hope to get a bit more details. ",
                    "links": [
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/f/f3dbf6dadc49026bb84cf2955f2dccc0359be8d4.png"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.723090277777779
                },
                {
                    "author_link": "https://gov.optimism.io/u/mastermojo",
                    "index": "3",
                    "likes": "2",
                    "time": "25/10/2022-15:12:54",
                    "content": "I am one of the Synthetix Ambassadors, and a member of the Defi Shadow Committee. I am an Optimism delegate [Delegate Commitments - #65 by mastermojo ] with sufficient voting power, and I believe this proposal is ready to move to a vote. ",
                    "links": [
                        "https://gov.optimism.io/t/voting-cycle-8-roundup/3742/10"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party auditing and reviewing proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/barbarossa_Arrakis",
                    "index": "4",
                    "likes": "1",
                    "time": "25/10/2022-15:26:16",
                    "content": "Thank you for the thoughtful response  I’ll address the comments one by one as these are valid questions and constructive suggestions.     ScaleWeb3:   Do you still collaborate with Lyra, Thales etc.? Why did your TVL on Optimism go down? Did your focus shift back to Ethereum l1?    We still manage the liquidity for those protocols on Optimism plus the others displayed on our UI, and are actively expanding our footprint. Having said that, there are multiple reasons why the TVL, not only on Optimism, but also mainnet has shrunk over the past couple of months. One major reason is the market down turn all networks are experiencing. Furthermore, the DeFi space becomes ever more competitive for the already scarce liquidity. With respect to Optimism specifically, the trading volume on UniV3 on Optimism has been rather small compared with the mainnet, which subsequently causes protocols to focus more on where the bulk of the volume is, i.e. mainnet UniV3. Arrakis on the other hand has no bias regarding which network we’d pay more attention to, as long as there is a demand for liquidity management service, we will go there. This demand just happens to somewhat correlate with volume as well.     ScaleWeb3:  However, this proposal looks a bit like a blank cheque with missing details on specific pairs, amounts per project, etc. which makes it hard to support in its current shape. Do you already have an idea for specific projects that you’d like to help with concentrated LM?   As stated in the proposal, we want to encourage new entrants to Optimism, which can either be existing protocols that haven’t expanded to Optimism yet, or protocols that can potentially be Optimism native projects. All of that leads to our decision of having an application process in place for protocols that would like to start their journey on Optimism. Indeed, we can also just easily do an LM for some majors which may also attract liquidity to the network. But that would be a waste of resources as Uniswap governance already decided to conduct their own LM with $OP received for major pairs, and we on the other hand believe that more $OP distribution should be in the hands of newer protocols that are more committed to the network. So basically we try to achieve 3 goals with our proposal:  Increase the overall TVL for Optimism Further decentralize the distribution of $OP Incentivize more protocols to expand / initiate on Optimism.      ScaleWeb3:  Protocol owned liquidity is much more sustainable than liquidity incentives for end-users.   Fully agreed. Arrakis PALM is intended for protocol owned liquidity. Maybe some confusions here need to be cleared out. When we say PALM is a liquidity bootstrapping strategy, it means that it helps protocols bootstrap base asset by leveraging the concentrated liquidity feature, rather than other incentives. A protocol can provide the initial liquidity in a skewed ratio between its native token and base asset, e.g. 10/90, and PALM will gradually pull that to 50/50. The $OP token we apply for is to incentivize protocols to try this innovative approach to bootstrap liquidity, i.e. base assets. The initial liquidity shall come from protocols themselves, hence POL.     ScaleWeb3:  we do not yet see the connection to Optimism governance participation and further distribution to end-users. This sounds a bit like an unnecessary airdrop to parties that might not care?   It is true that that “connection” is yet to be seen. However, it also seems to be an inevitable first step towards a decentralized governance. A compromise can be made that all $OP received by protocols will be staked or delegated.     ScaleWeb3:  Consequently, don’t you think it would be better for Optimism to loan Op to Arrakis & projects to establish liquidity but ultimately get it back?   I suppose that this implies $OP will act as a base asset in a trading pair. Though it’s possible to construct a set of terms for such arrangement, the downside of it would be limiting both the number of protocols that can participate and the amount of liquidity each of them can tap into, since a significant amount of $OP would have to be granted in order to make it meaningful. Besides, as much as we love Optimism, $OP token hasn’t achieved the base asset status yet, given its own liquidity and volatility. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.199016022291884
                },
                {
                    "author_link": "https://gov.optimism.io/u/barbarossa_Arrakis",
                    "index": "5",
                    "likes": "2",
                    "time": "25/10/2022-15:27:53",
                    "content": "The hero that we don’t deserve   Synthetix for life ser ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Exosphere",
                    "index": "6",
                    "likes": "2",
                    "time": "25/10/2022-18:19:26",
                    "content": "I am an Optimism delegate [Delegate Commitments - #29 by Exosphere ] with sufficient voting power, and I believe this proposal is ready to move to a vote. ",
                    "links": [
                        "https://gov.optimism.io/t/voting-cycle-8-roundup/3742/10"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/0xWeston",
                    "index": "7",
                    "likes": "1",
                    "time": "25/10/2022-18:20:51",
                    "content": "Great to see this proposal @barbarossa_Arrakis ! Great resources and tooling like Arrakis Finance designed for UniV3 solutions is a much needed protocol on Optimism and feel this will bring a lot of value to the ecosystem. Cheers! -Weston ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 8.416666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/mastermojo",
                    "index": "8",
                    "likes": "2",
                    "time": "25/10/2022-18:35:03",
                    "content": "Make sure you guys post here now: Voting Cycle #8: Roundup ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "10",
                    "likes": "0",
                    "time": "30/10/2022-09:03:54",
                    "content": "    barbarossa_Arrakis:  all protocols that received $OP incentive through Arrakis   Interesting move, how would you decide the amount of token a protocol will receive ? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/barbarossa_Arrakis",
                    "index": "11",
                    "likes": "0",
                    "time": "30/10/2022-13:18:51",
                    "content": "We have yet to make a detailed framework for decisions like this, but the easiest would be distributing $OP evenly among cohorts during each stage of the onboarding. Arrakis therefore can also improve the distribution mechanism via the iteration of each stage. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/katie",
                    "index": "12",
                    "likes": "1",
                    "time": "01/11/2022-19:49:38",
                    "content": " Defi Committee A Recommendation Voting recommendation: No Rationale: The amount requested is high and we would like to see more traction outside of Maker vaults.     barbarossa_Arrakis:   Note that a certain amount of the $OP token received might be used to cover transaction costs for operations on Optimism.    This sounds like it may violate the no sale rule. We would like to see this clarified.     barbarossa_Arrakis:  Please list the milestones/KPIs you expect to achieve for each initiative: During the LM program, periodically, the number of projects onboarded, total TVL growth, and total volume growth will be monitored as KPIs to indicate the effectiveness of the LM program. The program may adjust accordingly based on the outcome of the KPIs.   These KPIs are vague. We would like to see targeted numbers and milestones for these areas listed. Next Steps: We would like to see the amount requested lowered, clarification on whether or not it is intended to sell any tokens, and clear KPIs that include numbers and milestones to be achieved. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.2634920634920634
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "13",
                    "likes": "0",
                    "time": "03/11/2022-20:11:56",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "14",
                    "likes": "0",
                    "time": "03/11/2022-20:52:23",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/barbarossa_Arrakis",
                    "index": "15",
                    "likes": "1",
                    "time": "04/11/2022-14:59:53",
                    "content": "Thanks for the recommendation and it’s really appreciated  We will work on the items pointed out and bring a more polished proposal to the next cycle. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.125
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "16",
                    "likes": "1",
                    "time": "09/11/2022-13:56:30",
                    "content": "I agree with the committee recommendation and the points raised. As such I will be voting against.     katie:  Rationale: The amount requested is high and we would like to see more traction outside of Maker vaults.     barbarossa_Arrakis:   Note that a certain amount of the $OP token received might be used to cover transaction costs for operations on Optimism.    This sounds like it may violate the no sale rule . We would like to see this clarified.     barbarossa_Arrakis:  Please list the milestones/KPIs you expect to achieve for each initiative: During the LM program, periodically, the number of projects onboarded, total TVL growth, and total volume growth will be monitored as KPIs to indicate the effectiveness of the LM program. The program may adjust accordingly based on the outcome of the KPIs.   These KPIs are vague. We would like to see targeted numbers and milestones for these areas listed.   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.233928571428571
                },
                {
                    "author_link": "https://gov.optimism.io/u/SEED_LATAM_Joxes",
                    "index": "17",
                    "likes": "0",
                    "time": "11/11/2022-00:28:45",
                    "content": "Voted: Against The three points considered by Committee A were well considered by our community. Plus the intentions to help new projects without liquidity in Uniswap V3 is noble, but it is appropriate to provide more details of this approach and avoid gaming incentives, or else, start with a low amount to judge the results later. Happy to see an improvement of the proposal, since boostrapping Uniswap’s liquidity is positive for the ecosystem in general, most of the time. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.656818181818181
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "18",
                    "likes": "0",
                    "time": "14/11/2022-16:29:12",
                    "content": "Snapshot vote - not passed ",
                    "links": [
                        "https://gov.optimism.io/t/draft-proposal-protocol-delegation-program/3946/20"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "19",
                    "likes": "0",
                    "time": "14/11/2022-16:29:15",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "309"
}