{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/how-do-you-feel-about-a-conflict-committee/3117",
            "title": "How do you feel about a Conflict Committee ",
            "index": 3117,
            "category": [
                "\\xf0\\x9f\\x8f\\x9b Governance",
                "Metagovernance"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "1",
                    "likes": "9",
                    "time": "26/07/2022-13:56:03",
                    "content": "As of now, OPerating manual does not have any guideline on handling conflict of interest and I want to hear your opinion on this. Challenge:-  Lets say a project feels that an entity is voting against their proposal or giving someone a favor for some reason.   They can raise their voice but once voting is done, no one can do anything and foundation will act on the final result.   What if some one feels that I am acting and voting unethically.   Again, we dont have any thing in OPerating manual on how to handle this.   What to do if I see bias   I would appreciate if we can discuss this on this forum but what if other party is not willing to listen.   Suggestion:- Create a committee to handle such scenario, we can reach out to this committee with these type request and their decision would be final. Who Would be on this committee:-  Person/Team raising the request will choose 2 person* Other party involved, if chooses to, can also choose 2 person   One delegate(for simplicity we will keep any delegate with 0.5% voting power) and one OP Citizen  How I see it in work:-  3 out of 4 vote is needed to reach final decision. Keeping it small will help the committee would be trivial at initial steps It is MANDATORY to have OP Citizen in this committee.   Challenge:- Generally, I am not a big fan of creating many committee as I believe this makes things complicated and increase bureaucracy. But as we are doing and learning things iteratively, I am in favor of this. We should try and see how things works out, if not needed, we can decommission this committee. Happy to hear your thoughts on this. Edit:-1 Adding some context with an example. I submitted a proposal and was voted by Token House but I am not happy with how X entity has voted on my proposal. So, here i will invoke the Conflict committee and submit my case. Token house is and will be deciding pillar, what will change, if the Conflict committee approve my request, only vote of X will be removed from the final result. Votes and result from rest of the Token will still apply. We are not over-riding Token house, we are just removing conflict. ",
                    "links": [
                        "https://gov.optimism.io/t/opuser-delegate-communication-thread/2777/9"
                    ],
                    "GPT-summary": "The author of the post is proposing the creation of a Conflict Committee to handle scenarios where there is a conflict of interest or bias in voting for proposals. The author is asking for feedback and suggestions on the proposal and how it could work. The post also includes a challenge and a suggestion for the composition of the committee. The post invites discussion and feedback on the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 4.9338235294117645
                },
                {
                    "author_link": "https://gov.optimism.io/u/NicoEsp",
                    "index": "2",
                    "likes": "0",
                    "time": "26/07/2022-15:23:51",
                    "content": "Interest topic! My fear is that by trying to fix this, we will slow down the governance process… This suggestion you make it’s a good start, what I don’t understand is the presence of one delegate in this committee, what will be their role handling this conflicts? Also, until OP Citinzenship is “live” we could have someone from OP Foundation in the committee ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.407407407407407
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "3",
                    "likes": "3",
                    "time": "26/07/2022-15:38:19",
                    "content": "Valid point, I do see adding a committee might slow us down but what other option we have. I am sure, we will face conflict of interest issue in coming days.  what I don’t understand is the presence of one delegate in this committee, what will be their role handling this conflicts  Okey, so lets say Bob has a conflict of interest with Alice. Here, Bob will submit a conflict of interest report in front of this committee including all the evidence supporting his side, ofcourse Alice will do the same too. Then, this committee will hear both side of story and take a decision. Why a Delegate, I think they are involved this our gov process from start and they might the right person to for this task.  OP Citinzenship is “live” we could have someone from OP Foundation in the committee  This is tricky thought, Including someone from foundation will complicate things, main goal of this suggestion is to remove Bais and we dont want someone calling foundation Bias because of their decision. My goal would be to keep the foundation from gov as far as possible. We should resolve things internally, they have the Veto power anyway so if we act on something complex or critical, they can Veto it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.162240537240537
                },
                {
                    "author_link": "https://gov.optimism.io/u/diligit",
                    "index": "4",
                    "likes": "2",
                    "time": "26/07/2022-16:18:58",
                    "content": "Make me a permanent member of this committee and all will be fair. I don’t agree with this proposal, in every proposal a conflict of interest can be found, and then we exclude Token House votes and the final decision is made by 3-4 people. How do we verify that the entities that initiated this committee and elected the members of this committee do not have preemptive collusion… let’s create another committee that will verify this committee). And if this committee decides to cancel the votes then the Optimism Foundation does not have to execute the Token House decision just from the committee vote (3 people). My opinion: It is Token House (the decisive part), decentralized, and if we emphasize that Token House consists of many parties then 1-2 parties do not have the majority vote and do not decide the final result. And if we mention that projects still have to have voting power in the Optimism Collective then there can be certain conflicts, and for such cases rules can be set in the OPerating Manual proposed by the Token House, (without the need for a committee). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.178571428571429
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "5",
                    "likes": "1",
                    "time": "26/07/2022-16:55:26",
                    "content": "    diligit:  Make me a permanent member of this committee and all will be fair.   lol…where can i sign this proposal.  we exclude Token House votes and the final decision is made by 3-4 people  This need some clarification, will update the main post. One example, I submitted a proposal and was voted by Token House but I am not happy with how X entity has voted on my proposal. So, here i will invoke the Conflict committee and submit my case. Token house is and will be deciding pillar, what will change, if the Conflict committee approve my request, only vote of X will be removed from the final result. Votes and result from rest of the Token will still apply. We are not over-riding Token house, we are just removing conflict. Does this help ? happy to comment on any other thought.  How do we verify that the entities that initiated this committee and elected the members of this committee do not have preemptive collusion  You are right here and unfortunately, I dont have perfect solution for this but I do have a idea to counter this too. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.87608225108225
                },
                {
                    "author_link": "https://gov.optimism.io/u/diligit",
                    "index": "6",
                    "likes": "0",
                    "time": "26/07/2022-17:51:05",
                    "content": "    OPUser:  This need some clarification, will update the main post. One example, I submitted a proposal and was voted by Token House but I am not happy with how X entity has voted on my proposal. So, here i will invoke the Conflict committee and submit my case. Token house is and will be deciding pillar, what will change, if the Conflict committee approve my request, only vote of X will be removed from the final result. Votes and result from rest of the Token will still apply. We are not over-riding Token house, we are just removing conflict. Does this help ?   We have only one final result, the Token House result that should not be changed. What will be the criteria for initiating this committee… Example: a proposal failed with 55% against, then the authors can initiate the committee as a conflict of interest to anyone who voted 6% against and it will pass, that will change the Token House decision… And if someone will initiate this committee and excluding one party’s vote won’t change the final result of the vote, then it makes no sense… ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.541666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/diligit",
                    "index": "7",
                    "likes": "0",
                    "time": "26/07/2022-17:56:50",
                    "content": "Any committee cannot be initiated by conflicting parties, because there will always be conflicting interests, and the decision will not be objective, the committee must be created from neutral parties. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/diligit",
                    "index": "8",
                    "likes": "3",
                    "time": "26/07/2022-17:59:30",
                    "content": "It would be better to propose rules that will prevent conflict of interest and can be written in the Operating Manual. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "9",
                    "likes": "1",
                    "time": "26/07/2022-19:06:37",
                    "content": "Another example:- Total Vote 100 A= 20, B= 30,C= 10,D= 10, E= 10,F= 10, G= 6, H= 4 Initial votes Yes = A + B + G = 20+ 30+ 6 = 56% No  = C+D+E+F+H = 10 + 10 + 10 +10 + 4 = 44% Proposal Passed with 56% in favor Assuming G with 6% is now removed from final voting by conflict council Total votes now = 94 Yes = A + B = 20 + 30 = 50= approx 53%(50 of 94) No = C+D+E+F+H = 10 + 10 + 10 + 10+ 4 = 44 = approx 47%(44 of 94) Proposal passed with 53% in favor Removing a person even with 6%(now that total percentage has changed this 6% will be slightly higher but keeping it as it for discussion) will not change the final result. Yes, it might happen that removing a single person can change the final decision, but then I would say we have failed as gov where removal of single person is changing the end result.  And if someone will initiate this committee and excluding one party’s vote won’t change the final result of the vote, then it makes no sense   Any committee cannot be initiated by conflicting parties, because there will always be conflicting interests, and the decision will not be objective, the committee must be created from neutral parties.  Both valid point and I wanted to talk more on this once there was enough interest( including you and others) in this proposal but here we go. Why would you do this if removing one person does not have impact on final decision, well simply because it makes process transparent. Lets take this one step ahead. On the basis of engagement give everyone involved a Dynamic NFT, if my request goes in favor(approved by Conflict council) then change the NFT (some kind of point system) and deduct the point from loosing side. This will help us counter unnecessary request towards CC. What if an individual user chooses so do so, assuming they can create many account on forum just to raise a request Anyone who wants to create such request need approval from a delegate with 0.5% voting power, same as we are doing for GF proposal. A user can create multiple identity, a delegate could not. S/he/they will also only support request that has valid and actual evidence. This will also help with unnecessary request. Just to clarify, here if users request was denied by CC, the delegate who sponsored the request will losse the point.  Repeat the same process for multiple round and you have a digital on-chain identity, you can use that to show your credibility. In long run this could help us with DAO-to-DAO gov. What you say ? are we making any progress here ? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.052521008403361
                },
                {
                    "author_link": "https://gov.optimism.io/u/0x_Sam",
                    "index": "10",
                    "likes": "0",
                    "time": "29/07/2022-11:25:05",
                    "content": "The whole purpose, in my mind, of the bi-cameral governance system is to have the Token House largely be accountable to the “wisdom of the crowd” and setting an expert committee defeats that stated purpose. There is a time and place for moving away from the plutocratic forces of token-weighted voting and that venue is the Citizens House. Creating an additional arbitrator that could void the will of the Token House just feels like its not aligned with the OP vision, despite it having some benefits in specific situations. My counsel would be to build cultural norms of delegates abstaining when there is any semblance of conflict of interest. Perhaps there could be a way to surface a derogatory mark on a delegates score card if it seems like they acted with a conflict of interest, but I don’t know anyway we can hardcode that in on-chain governance that doesn’t create more problems than it would solve. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.014285714285714
                },
                {
                    "author_link": "https://gov.optimism.io/u/diligit",
                    "index": "11",
                    "likes": "0",
                    "time": "29/07/2022-11:50:06",
                    "content": "    0x_Sam:  My counsel would be to build cultural norms of delegates abstaining when there is any semblance of conflict of interest. Perhaps there could be a way to surface a derogatory mark on a delegates score card if it seems like they acted with a conflict of interest, but I don’t know anyway we can hardcode that in on-chain governance that doesn’t create more problems than it would solve.   Yes, for a start, setting cultural norms for delegates would be sufficient. I am of the opinion that projects should have voting power in the Optimism Collective, because projects are part of the Optimism Collective and their vote is important, then to prevent any conflict of interest “cultural norms” or rules should be established for both projects and delegates as entities with higher voting power. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.35
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "12",
                    "likes": "1",
                    "time": "29/07/2022-12:15:53",
                    "content": "This proposal was not to override token house decision, but rather to support them. But after having a good discussion with others, I agree that there are many assumptions in the post I need to update them. Thank you for your input though ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Ovetta",
                    "index": "13",
                    "likes": "1",
                    "time": "31/07/2022-00:36:21",
                    "content": "Your very well thought out suggestion, OP User, would work.  However I think that bad actors should be a matter for the OP Foundation members to assess and address.  Keeping it simple and giving each voter’s motives the benefit of the doubt should rule the day. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.166666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/juankbell",
                    "index": "14",
                    "likes": "1",
                    "time": "06/10/2022-15:40:11",
                    "content": "Hello! Optimism Collective community! This topic of conflict management is something we’ve been working a lot in Gravity DAO, and I want to share some of the things we’ve been doing, in case any of them could be of use or interest. Guide to manage conflict in DAOs GRAVITON GUIDE - Google Slides scale of conflict and transformational actions Scale of conflicts - Graduated sanction Guideline - ⚛ Community - Token Engineering Commons  Dispute-continuum1105×697 37.7 KB  ",
                    "links": [
                        "https://forum.tecommons.org/t/scale-of-conflicts-graduated-sanction-guideline/234",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/b/bf65e73ae6dfea42587087e538de637db6e04ad3.jpeg",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/11"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "178"
}