{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/gf-phase-0-proposal-polynomial-protocol/1625",
            "title": "[GF : Phase 0 Proposal] Polynomial Protocol ",
            "index": 1625,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Governance Fund: Phase 0"
            ],
            "tags": [
                "cycle-1",
                "passed"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/salman",
                    "index": "1",
                    "likes": "29",
                    "time": "27/05/2022-10:49:35",
                    "content": "Project Name: Polynomial Protocol Author Name: Salman Defillama TVL (at snapshot): $0M (approx $2m) Transactions/day (at snapshot): 150 Tier: 3 Optimism native: Yes Revisions to metrics used: At the time of the snapshot, Polynomial had just launched their product, and there was no DefiLlama page; therefore on the spreadsheet - it shows up as $0 TVL; it is up now and can be accessed by everyone at ​​Polynomial Protocol: TVL and stats - DefiLlama Number of OP tokens to claim: 900,000 L2 Recipient Address: 0x59672D112d680CE34C20fF1507197993CC0bA430 Proposal for token distribution (under 1000 words): Polynomial provides automated option strategies for its users. As an Optimism native project, Polynomial has a direct interest in the overall success of Optimism. By receiving an allocation from the $OP governance fund, Polynomial will seek to benefit its users and the adoption of the entire Optimism ecosystem. Goals Polynomial has the following goals in mind: 1. Bring more users into the Optimism ecosystem. 2. Improve accessibility/visibility to our vaults 3. Increase TVL   Q) How will the OP tokens be distributed?  Retroactive Airdrop Amount : 180,000 $OP Criteria : Existing users of Polynomial Earn Vaults  1480×796 54.4 KB    Liquidity Mining Amount : 450,000 $OP Criteria : Future users of Polynomial Products To incentivize the product usage on optimism, we will be giving liquidity mining rewards to future vault users of Polynomial. We have four Earn vaults, and plan to release v2 versions of these vaults along with Lyra’s Avalon update. We plan to distribute $OP tokens to these vaults equally for approx ~1-2 months following TGE. Before TGE, if more vaults are released, the tokens will be distributed amongst them too. Allocation to a vault = total OP allocation * (vault capacity / total capacity of all vaults). Newer vaults get a small multiplier (~1.5-2x).  Grants Amount : 128,580 $OP Criteria :Contributors / Bug Bounty / Tooling / Hackathons(20% for early builders and 80% for future rewards) Polynomial will reward the grants for bug bounties, toolings(i.e: Dune Analytics, Zapper), content creations and hackathons. Several volunteer community members have been building and creating with Polynomial for the past few months, and with these grants, we look forward to having more people build with Polynomial.  Building blocks Amount : 72,000 $OP Criteria : Be an LP in Lyra The capacity of Polynomial Vaults is directly proportional to the liquidity in Lyra. Currently, Polynomial Vaults are almost operating at full capacity due to the inability to increase the vault size. Incentivizing LP’ing in Lyra will help us raise the vault capacity and help us bring more users to Optimism  Frens of Polynomial Amount : 69,420 $OP Criteria : Be our fren We love Optimism and are optimistic about the derivative ecosystem being built here. We would love to pay it forward to the core devs of Optimism Native Derivative Projects : Synthetix, Lyra, Perp, Pika, Kwenta and Thales   Questions Q) How will this distribution incentivize usage and liquidity on Optimism? Polynomials bring users to Optimism which stays as long term as Optimism. Since Polynomial is still at its day 1, we want to incentivize root level growth that can profoundly impact the Optimism ecosystem. We are also an OP native project. Hence our growth is directly aligned with OP. Polynomial is built on top of Synthetix and Lyra. Hence all incentives will drive growth for the underlying protocols as well. Q) Why will the incentivized users and liquidity remain after incentives dry up?  Gas : We are trying to onboard the next-gen users to web3; most new users find the gas in L1 relatively high. Hence being on OP helps drive user growth more than L1.  1456×445 69.1 KB  65% of users are depositing under $100. Combined with the low gas fees experienced when transacting on Optimism, this presents a relatively accessible option for onboarding new users to the option vaults.  User Retention  1480×796 51.4 KB  Polynomial Earn Vaults have amassed a sizeable amount of sticky users - Unique addresses deposited against withdrawals since launch show that 78% of the users are still in the vaults, even after the considerable selloff in the crypto markets in May. The vaults have operated at near capacity for most of the weeks it has been live. Q) Over what period of time will the tokens be distributed? We intend to distribute the tokens within a 6 month timeframe, liquidity mining will be done in 1-2 months. Q) How much will your project match in co-incentives? Polynomial doesn’t have a token but we’ll match bug bounty in USDC (capped at $50K) ",
                    "links": [
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/1X/d2acc61da85e722400f27352173ae1ef8e167f45.png",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/1X/026cd8136a3ea68b37f8dd9516c072ef68efedaf.png",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/1X/38ef4cd406866019e3d38dec454356f5e89f24e7.png",
                        "https://gov.optimism.io/t/voting-cycle-1-roundup/2619",
                        "https://gov.optimism.io/t/draft-gf-phase-1-across-protocol/3163/48",
                        "https://gov.optimism.io/t/protocol-delegation-self-nominations/4357/16"
                    ],
                    "GPT-summary": "The post is a proposal for the allocation of $OP governance fund to Polynomial Protocol, an Optimism native project that provides automated option strategies for its users. The proposal outlines the goals of the project and how the tokens will be distributed among existing and future users, contributors, LPs, and friends of Polynomial. The post also addresses questions about how the distribution will incentivize usage and liquidity on Optimism, user retention, and co-incentives. The proposal is explained in detail, and there is constructive criticism and questions from third parties, but no advertising or entirely positive/negative feedback.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Token economics",
                        "Community and engagement",
                        "Smart contract updates",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.777162247474747
                },
                {
                    "author_link": "https://gov.optimism.io/u/MinimalGravitas",
                    "index": "2",
                    "likes": "7",
                    "time": "27/05/2022-19:08:46",
                    "content": "    salman:  128,580 $OP   Thought it was strange to see this odd amount until I read further to see why you wanted a specific amount for another category… nice. I like the balance between encouraging users (e.g. liquidity mining) and encouraging builders (e.g. grants), both seem like they will be useful for the growth of Optimism. The focus on further strengthening other parts of the OE ecosystem seems pretty sensible as well, boosting Lyra to raise your capacity for example will presumably have positive overflow effects on the growth of the whole Synthetix based group of dApps. 1-2 months for the liquidity mining period seems fairly short, how do you intend to maximize the impact it has in terms of new users over that time? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.527680652680653
                },
                {
                    "author_link": "https://gov.optimism.io/u/bbehnam86",
                    "index": "3",
                    "likes": "1",
                    "time": "29/05/2022-10:02:35",
                    "content": "Thx for details, Great ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/brucewang614",
                    "index": "4",
                    "likes": "2",
                    "time": "29/05/2022-10:28:42",
                    "content": "Thanks for the info, Nice proposal ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Faheemraj",
                    "index": "5",
                    "likes": "0",
                    "time": "31/05/2022-15:01:19",
                    "content": "Coool and very good consept ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.549999999999999
                },
                {
                    "author_link": "https://gov.optimism.io/u/cryptologycation",
                    "index": "6",
                    "likes": "0",
                    "time": "02/06/2022-09:51:02",
                    "content": "excellent but i think u can pan  liquidity mining period for longer as well ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/cryptovc",
                    "index": "7",
                    "likes": "0",
                    "time": "02/06/2022-14:28:43",
                    "content": "amazing great proposal from one of optimism’s most prominent ecosystem partners! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.15625
                },
                {
                    "author_link": "https://gov.optimism.io/u/EddO.S",
                    "index": "8",
                    "likes": "0",
                    "time": "06/06/2022-02:36:58",
                    "content": "This means Lyra LP provider will get $OP both from Lyra and Polynomial, Right? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.428571428571428
                },
                {
                    "author_link": "https://gov.optimism.io/u/EL_PASO",
                    "index": "9",
                    "likes": "0",
                    "time": "26/06/2022-21:15:20",
                    "content": "happy with this proposal, thank you ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Jokerbit",
                    "index": "10",
                    "likes": "0",
                    "time": "27/06/2022-07:33:09",
                    "content": "Thanks for this project info. I have read it and cannot agree at this moment. Let me make a further research. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/Ruby",
                    "index": "11",
                    "likes": "0",
                    "time": "29/06/2022-03:03:26",
                    "content": "great proposal, support! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/leivey",
                    "index": "12",
                    "likes": "0",
                    "time": "30/06/2022-16:02:11",
                    "content": "Good job  and proposal is nice ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/okka",
                    "index": "13",
                    "likes": "0",
                    "time": "13/09/2022-10:24:54",
                    "content": "I support this proposal ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "14",
                    "likes": "0",
                    "time": "13/09/2022-18:27:19",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "14"
}