{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/draft-gf-phase-1-proposal-crypto-lfdm/5030",
            "title": "[DRAFT][GF: Phase 1 Proposal] Crypto LFDM ",
            "index": 5030,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Grants Council"
            ],
            "tags": [
                "cycle-10",
                "passed"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/huzmond",
                    "index": "1",
                    "likes": "1",
                    "time": "02/02/2023-03:34:04",
                    "content": "Project name: Crypto LFDM Author name and contact info (please provide a reliable point of contact for the project): Huzmond : telegram : @huzmond ; Discord : Huzmønd#6336 I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: Yes I understand that I will be expected to following the public grant reporting requirements outlined here: Yes L2 recipient address: 0x61ee892250c03c1d7bc673e661be87116caba2ac Which Voting Cycle are you applying for?: Cycle 10 Which sub-committee should review your proposal? (Builders Grants, Growth Experiment Grants): Growth Experiment Grants Project description (please explain how your project works): We are two French content creators who have been actively producing videos since 2017. Initially, our channel focused on ETH mining. However, for the past year, we have shifted our focus to creating educational content on DeFi and specifically on the Cosmos ecosystem, and ETH ecosystem We are doing various content, on how to use wallets, how to use dex, how to choose a validator, but also some more general topics on ETH, L2 and Solana… Additionally, we host a weekly podcast on Twitch, featuring different guests and covering current events.We are also highly active on our Discord, where we initially covered various subjects in greater depth and from a more advanced, technical perspective. Additionally, we provide general community support on a range of topics. Website: Crypto LFDM - YouTube Twitter: https://twitter.com/CryptoLFDM Discord/Discourse/Community: Crypto LFDM Other relevant links (including any demos): Additional team member info (please link): https://twitter.com/huzmond Please link to any previous projects the team has meaningfully contributed to: Investir sur la DEFI COSMOS / ATOM - STAKING - YELDMOS - Niveau débutant Ep2 - YouTube Relevant usage metrics (TVL, transactions, volume, unique addresses, etc. Optimism metrics preferred; please link to public sources such as Dune Analytics, etc.): The channel got 37k suscribers2 776 826 viewsthe discord got 10k members Competitors, peers, or similar projects (please link): Monsieur-TK - YouTube Is/will this project be open sourced?: No Optimism native?: No Date of deployment/expected deployment on Optimism: 2/6/2023 What is the problem statement this proposal hopes to solve for the Optimism ecosystem?: This proposal aims to solve the problem of limited exposure and outreach of the Optimism ecosystem to potential users and community members. By creating engaging and informative YouTube videos, this proposal aims to increase awareness and understanding of the benefits and features of the Optimism ecosystem, and to help grow the community and user base.  The videos will cover topics such as how to use and interact with the platform, covering projects and individuals utilizing Optimism, and updates and developments within the ecosystem. The ultimate goal is to drive adoption and usage of the Optimism platform and to support its growth and success. How does your proposal offer a value proposition solving the above problem?: Our goal is to create a series of engaging, informative videos that will explain the basics of Optimism and optimistics rollups , how Optimism works, and how users can bridge, start using DeFi, covering different dapp of Optimism.These videos will be made available on our Youtube and social media channels, and will be promoted through various online and offline channels.In addition to our YouTube channel, we also host a weekly podcast on Twitch. Our podcast features guest appearances from industry experts, project founders, and other key players in global DeFi space and Web3 ecosystems. Through our podcast, we aim to provide our viewers with a platform to learn directly from those who are shaping the future of DeFi. In return for your sponsorship, we would be happy to promote Optimism in our videos and podcasts, provide shoutouts on our social media channels. Why will this solution be a source of growth for the Optimism ecosystem?: The value-add of these sponsorship is two-fold: first, they will help to promote Optimism and its services to a wider French and not only ETH native audience, increasing user adoption and engagement. Second, they will serve as a valuable resource for people looking to learn more about cryptocurrency and Optimistic rollups. By providing high-quality, accessible education, we aim to democratize access to this exciting and rapidly growing industry. Has your project previously applied for an OP grant?: Never Number of OP tokens requested: 10000 Did the project apply for or receive OP tokens through the Foundation Partner Fund?: No If OP tokens were requested from the Foundation Partner Fund, what was the amount?: / How much will your project match in co-incentives? (not required but recommended, when applicable): Not applicable How will the OP tokens be distributed? (please include % allocated to different initiatives such as user rewards/marketing/liquidity mining. Please also include a justification as to why each of these initiatives align with the problem statement this proposal is solving.): The budget will be used to support the creation and distribution of the educational content as well as incorporating Optimism branding into our videos and live streams.The funds will be allocated as follows:1. Video Production: The majority of the budget will be dedicated to the production of the six educational videos. This will include equipment, camera crew, writing and editing services.2. Marketing and Promotion: A portion of the budget will be used to promote the videos and live streams through social media channels and advertising.3. Miscellaneous Expenses: The remaining funds will be used for miscellaneous expenses such as travel to conference, software, and other production-related costs.We are committed to utilizing the funds efficiently and effectively to produce high-quality educational content that will inform and educate our viewers about Osmosis and the exciting developments happening on Optimism. Over what period of time will the tokens be distributed for each initiative? Shorter timelines are preferable to longer timelines. Shorter timelines (on the order of weeks) allow teams to quickly demonstrate achievement of milestones, better facilitating additional grants via subsequent proposals: Grant timeline The grant will cover a 3-month sponsorship and will include the following:Six educational videos:- An overview of how works optimistics rollups and Optimism- A guide on how to get started with Optimism, bridging, usage of the wallets, large covering of the ecosystem- A series of video with in depth coverage of the Optimism DeFi ecosystem- A series of videos on the NFT & P2E ecosystem- Utilisation of Optimism branding in our live stream- Shoutouts for Optimism on our social media channelsWe are excited about this opportunity to collaborate with Optimism and are committed to delivering high-quality educational content to our viewers Please clearly define the milestones you expect to achieve in order to receive milestone based installments. Please consider how each milestone relates to incentivizing sustainable usage and liquidity on Optimism. Progress towards each milestone must be trackable: To ensure that our sponsorship progress is tracked and monitored effectively, we propose the following milestones:1: First video release featuring Optimism branding and promotion.2: First podcast episode with a segment dedicated to Optimism and its features.3: 10,000 views on our YouTube channel with Optimism branding and promotion.4: After the 6 educational videos and 3 month sponsorship with shares of different tracks of impact, click, views, and new users. Why will incentivized users and liquidity on Optimism remain after incentives dry up?: The YouTube videos produced through this grant request will help to demonstrate the value and utility of the platform to potential users, and will help to build a strong and engaged community around Optimism. Additionally, by regularly providing information and updates about the platform, the videos will help to create a sense of connection and loyalty among users, and will encourage them to continue using the platform even after incentives are no longer available. By effectively communicating the value of the platform and engaging with users, this grant request aims to ensure that Optimism continues to thrive and grow, even after incentives have dried up. Please provide any additional information that will facilitate accountability (smart contracts addresses relevant to the proposal, relevant organizational wallet addresses, etc.): We don’t have any other grant from other ecosystem. Confirm you have read and agree to the Eligibility Restrictions (here): I have read the Eligibility Restrictions and agree to abide by their conditions ",
                    "links": [
                        "https://www.youtube.com/@CryptoLFDM/",
                        "https://twitter.com/CryptoLFDM",
                        "https://discord.gg/yHREu5aN2G",
                        "https://twitter.com/huzmond",
                        "https://www.youtube.com/watch?v=uBD1cjStPIk",
                        "https://www.youtube.com/@MonsieurTK",
                        "https://gov.optimism.io/t/grant-proposal-template/3233",
                        "https://gov.optimism.io/t/cycle-10-final-grants-roundup/5418",
                        "https://gov.optimism.io/t/cycle-10-grant-review-roundup/5284"
                    ],
                    "GPT-summary": "The post is a draft proposal for a grant from the Optimism Foundation. The proposal is for a French content creator to create educational videos on the Optimism ecosystem to increase awareness and understanding of the benefits and features of the Optimism ecosystem, and to help grow the community and user base. The post includes information on the project, the team, the budget, and the milestones. The post also includes links to the team's website, social media channels, and previous projects.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Smart contract updates",
                        "Not a proposal",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal",
                        "None"
                    ],
                    "Sentiment": 5.614708208458209
                },
                {
                    "author_link": "https://gov.optimism.io/u/MoneyManDoug",
                    "index": "2",
                    "likes": "1",
                    "time": "05/02/2023-16:16:56",
                    "content": "    GrantsOps:    Video Production: The majority of the budget will be dedicated to the production of the six educational videos. This will include equipment, camera crew, writing and editing services.   Marketing and Promotion: A portion of the budget will be used to promote the videos and live streams through social media channels and advertising.   Miscellaneous Expenses: The remaining funds will be used for miscellaneous expenses such as travel to conference, software, and other production-related costs.   We are committed to utilizing the funds efficiently and effectively to produce high-quality educational content that will inform and educate our viewers about Osmosis and the exciting developments happening on Optimism.   The use of funds here would conflict with the no-sale rule, revisions needed. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.902935606060606
                },
                {
                    "author_link": "https://gov.optimism.io/u/HCNAT0_NEU_Blockhain",
                    "index": "3",
                    "likes": "1",
                    "time": "05/02/2023-20:03:57",
                    "content": "    GrantsOps:  Relevant usage metrics (TVL, transactions, volume, unique addresses, etc. Optimism metrics preferred; please link to public sources such as Dune Analytics, etc.): The channel got 37k suscribers 2 776 826 views   Do you have more in-depth metrics on average viewership you could share with us? Any form sent to your viewers on who owns cryptocurrency, what do their holdings consist of, what blockchains do they interact with the most? I feel like this would help get a better sense of the audience we’d be interacting with and would be looking to move to Optimism. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.328125
                },
                {
                    "author_link": "https://gov.optimism.io/u/huzmond",
                    "index": "4",
                    "likes": "1",
                    "time": "06/02/2023-18:24:42",
                    "content": "Hey everyone, I would like to make some edits to our proposal, since the No-Sale rule is clearly in conflict with our use of funds, so i propose to modify it : How will the OP tokens be distributed? 1- Podcast  / Livestream Episode : 24 Distribution : 150 $OP distributed randomly to 3 selected viewer/listener each episode Total OP distributed : 3,600 $OP 2- Youtube educational Video Episode : 6 Distribution : 250 $OP distributed randomly to 3 selected viewer/listener each episode Total OP distributed : 1,500 $OP 3- Crew3.xyz Quest We will create different and various Mission on a dedicated Crew3, the goal will be to boost the community engagement, on our twitter post related to optimism but also on optimism ecosystem related content, make them discover some new part of the Optimism ecosystem with educationnal mission. Use all the possibility that we have with crew3 to engage and reward the good optimism user of the community. Total : 4,900 $OP @lavande ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.071678321678322
                },
                {
                    "author_link": "https://gov.optimism.io/u/huzmond",
                    "index": "5",
                    "likes": "2",
                    "time": "06/02/2023-18:33:55",
                    "content": "Honestly it’s really difficult to get on depth metrics of our viewers since we doesn’t have any form. Average viewers is around 3/4k each since 6month average. But what i could said, most of them use and hold crypto, they’re mostly beginner but use simple DeFi apps. Most of them follow us now for the cosmos eco content, but use different chain, and have mined ETH. From what i see, a vast majority never used Optimism at all. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.6499999999999995
                },
                {
                    "author_link": "https://gov.optimism.io/u/HCNAT0_NEU_Blockhain",
                    "index": "6",
                    "likes": "1",
                    "time": "08/02/2023-15:12:31",
                    "content": "May be good in the future to send out a google form of sorts to get more in-depth data on what your viewers use and their levels of experience / what they interact with most. ie. Send it in the discord and get a little more insight as to what they focus on on a more micro level. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.794642857142858
                },
                {
                    "author_link": "https://gov.optimism.io/u/katie",
                    "index": "7",
                    "likes": "1",
                    "time": "22/02/2023-03:04:31",
                    "content": "Hello @huzmond I wanted to share with you the Milestone Assessment Guidance and let you know that you have the option to make  any changes to your current proposal based on the new milestone information, until Monday.  After that your proposal will move to final review from the grant council members.  Thank you! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving information about grant process"
                    ],
                    "Sentiment": 5.227272727272727
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "9",
                    "likes": "1",
                    "time": "05/03/2023-19:48:33",
                    "content": "Hi @huzmond! Can you provide a Telegram handle or other contact method so the Optimism team can get in touch about paying out this grant! Feel free to DM or email lavande@optimism.io ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.609375
                }
            ]
        }
    ],
    "group_index": "499"
}