{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/message-to-optimism-community-from-wintermute/2595",
            "title": "Message to Optimism community from Wintermute ",
            "index": 2595,
            "category": [
                "\\xf0\\x9f\\x93\\xa2 Updates and Announcements",
                "Official Communications"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/wishful_cynic",
                    "index": "1",
                    "likes": "74",
                    "time": "08/06/2022-20:15:36",
                    "content": "Hi Optimism Community. On behalf of Wintermute I wanted to explain the recent events surrounding wallet 0x4f3a120E72C76c22ae802D129F599BFDbc31cb81. I’ll aim to be as factual as possible, focusing on full transparency and making sure every Optimism stakeholder is on the same page with the current situation as well as making it clear what our actions are going forward. Timeline of events Two weeks ago, Wintermute was engaged by the Optimism Foundation to provide liquidity in the OP token upon its listing on centralized exchanges. As part of the agreement Wintermute received a 20 million loan in OP. Initially the loan was to be deployed on one of the Wintermute’s wallets on Optimism. As we communicated the wallet address to the Optimism team, we made a serious error. We had a Gnosis safe deployed on mainnet for a while and due to an internal mistake, we’ve communicated the very same wallet as the receiving address. As some of you may know, this is not a smart thing to do - having control over mainnet Safe doesn’t guarantee control on other EVM compatible chains (unlike ordinary wallets). We notified the Optimism team on the 30th of May. Since the launch next day was a clear priority we agreed on receiving additional 20 million tokens (providing $50 million USDC as collateral), all while exploring ways to retrieve the funds. At the same time we got in contact with the Gnosis Safe team, asking them for assistance with retrieving the funds. After consulting with the Optimism and Safe teams, Wintermute made the assessment that the funds were potentially retrievable, and that nobody other than Wintermute could recover those funds. The assessment was also that it was a high risk retrieval that could only be attempted once and required Safe to support. Retrieval was scheduled for 7th of June. However, the assumption that the funds can only be recoverable by Wintermute proved to be false. Exploit Somebody has done their homework well, however. In less than 24 hours after we notified Safe and Optimism about the situation, wallet 0x8BcFe4f1358E50A1db10025D731C8b3b17f04DBB has been funded via tornado cash transfer. It proceeded with performing a replay attack by replaying the Gnosis Safe MasterCopy 1.1.1 deployment from Eth mainnet. They then used the previously deployed contract 0xE7145dd6287AE53326347f3A6694fCf2954bcD8A to deploy vaults per batches of 162. The hacker then proceeded with selling 1m OP tokens for ETH and withdrew back to L1 via Synapse and Hop bridges to then use tornado cash on mainnet. What we are planning to do about it As of the time of this writing, the attacker still has 19 million OP tokens in their possession. We are not sure why they chose not to liquidate all of it at once. There is hope that it is a whitehat exploit, in which case the remaining funds are potentially recoverable. However we are currently operating under the premise that it is not the case, since we haven’t received any communication from them and our message on the chain was left unanswered. We want to make one thing clear - the initial error is 100% Wintermute’s fault and as such we will proceed to buy OP every time the attacker sells it to make the protocol whole eventually (we did initiate buying the first million OP tokens yesterday already). We understand that it can potentially create price volatility in the token and will make best efforts to smoothen the effect. Message to the exploiter We expect the exploiter to read this as well (eventually). This is our message to you: We are open to see this as a white hat exploit. Moreover, the way the attack has been performed has been rather impressive and we can even consider consulting opportunities or other forms of cooperation in future. We are also content with the scenario where the remaining 19 million tokens are returned to Optimism wallet: 0x2501c477d0a35545a387aa4a3eee4292a9a8b3f0 You have one week to consider being a whitehat. In case the above doesn’t happen, we are 100% committed to returning all the funds, tracking the person(s) responsible for the exploit, fully doxxing them and delivering them to the corresponding juridical system. Remember that robbers need to get lucky every time. Cops only have to get lucky once. This is not a “code is law” theoretical argument. This is you taking a bag with cash that was left behind by a (careless) person. Us being careless still leaves you a criminal. We already started investigating the potential leads, in certain cases stopping short of informing respective law enforcement agencies. Consider your options and choose to be good and optimistic instead of living in fear  ",
                    "links": [
                        "https://gov.optimism.io/t/lets-talk-about-the-op-20-million-hack/2604/2",
                        "https://gov.optimism.io/t/questions-on-wintermutes-mistake-and-wintermute-are-you-ready-to-make-an-offer-offer-to-the-attacker-they-send-you-19m-op-you-send-them-usdc-problem-solved/2601/6"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.370682302771855
                },
                {
                    "author_link": "https://gov.optimism.io/u/ben-chain",
                    "index": "2",
                    "likes": "11",
                    "time": "08/06/2022-20:36:42",
                    "content": "Thanks @wishful_cynic for the transparency and accountability, we appreciate it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/forrest",
                    "index": "3",
                    "likes": "6",
                    "time": "08/06/2022-20:38:50",
                    "content": "Thank you for the transparency, for accepting responsibility, and for the buyback commitment. Wishing your team the best with the recovery. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/pseudotheos",
                    "index": "4",
                    "likes": "7",
                    "time": "08/06/2022-20:44:02",
                    "content": "Thank you for being transparent. Good luck. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "5",
                    "likes": "7",
                    "time": "08/06/2022-20:48:18",
                    "content": "kudos for taking the responsibility and for being transparent. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/musky",
                    "index": "6",
                    "likes": "2",
                    "time": "08/06/2022-20:49:56",
                    "content": "Great insider job. No way any hacker would know this issue and take advantage of it. unless…insider informs the hacker to do it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/James",
                    "index": "7",
                    "likes": "6",
                    "time": "08/06/2022-20:54:51",
                    "content": "FireEyes appreciates the accountability and commitment @wishful_cynic & Wintermute have taken here - Although these events are a clearly a serious oversight, taking the steps outlined above will make the community whole again. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.777777777777778
                },
                {
                    "author_link": "https://gov.optimism.io/u/iSpeakNerd",
                    "index": "8",
                    "likes": "6",
                    "time": "08/06/2022-21:01:52",
                    "content": "Multiple people found the mint contract before the front-end went live allowing them to claim their OP early as the contract wasn’t paused initially. If they could find the contract, someone could doubtlessly find 20M $OP sitting at an unclaimed address on Optimism L2. Wintermute has acknowledged the error, taken responsibility, and promised to take the actions needed to make the community whole. Far more than what we would get outside crypto space. So, kindly go away with your insults and deal with your disappointment + frustration healthily next time. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.471074380165289
                },
                {
                    "author_link": "https://gov.optimism.io/u/0xJohn",
                    "index": "9",
                    "likes": "2",
                    "time": "08/06/2022-21:13:51",
                    "content": "Wintermute team, Please see this proposal - https://gov.optimism.io/t/questions-on-wintermutes-mistake-and-wintermute-are-you-ready-to-make-an-offer-offer-to-the-attacker-they-send-you-19m-op-you-send-them-usdc-problem-solved/2601/2 Your inputs are appreciated. Thank you. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Leuno",
                    "index": "11",
                    "likes": "1",
                    "time": "08/06/2022-21:38:29",
                    "content": "Have you made a bug bounty offer to the hacker to see if they would return the funds? How will the employee who made the error be reprimanded? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Butterbum",
                    "index": "13",
                    "likes": "4",
                    "time": "08/06/2022-22:13:09",
                    "content": "Your transparency is appreciated.     wishful_cynic:  as such we will proceed to buy OP every time the attacker sells   Wow…Thank you for making such a major commitment for Optimism Good luck ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9624999999999995
                },
                {
                    "author_link": "https://gov.optimism.io/u/henrycase",
                    "index": "14",
                    "likes": "1",
                    "time": "08/06/2022-23:26:13",
                    "content": "    wishful_cynic:  You have one week to consider being a whitehat. In case the above doesn’t happen, we are 100% committed to returning all the funds, tracking the person(s) responsible for the exploit, fully doxxing them and delivering them to the corresponding juridical system.   He never saw Molly again.     musky:  Great insider job. No way any hacker would know this issue and take advantage of it. unless…insider informs the hacker to do it.   It’s way easier than you think, but when a new anything launches there are people looking to understand it for the primary purpose of exploiting it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.536363636363635
                },
                {
                    "author_link": "https://gov.optimism.io/u/arc_s",
                    "index": "16",
                    "likes": "3",
                    "time": "09/06/2022-00:03:56",
                    "content": "No one is a criminal, Wintermute are the only one to blame. They told Optimism to send the funds to an address they didn’t own, this is ridiculous ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.833333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/0xbobns",
                    "index": "17",
                    "likes": "0",
                    "time": "09/06/2022-00:25:56",
                    "content": "Hope Optimism will be pass this situation strong community and developer. Code bless you. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.166666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/SEED_LATAM_Joxes",
                    "index": "18",
                    "likes": "7",
                    "time": "09/06/2022-00:33:16",
                    "content": "Thank you for the transparency. I really hope the owner will act as a white hat and both parties settle this problem quickly in the interest of both. In any case, this is a persistent debt on the part of the Wintermute company. Is there any ongoing aggrement to guarantee that even after the years and the market stage, Wintermute will meet its obligations? For example by providing more additional collateral to the Optimism Foundation for this purpose. If there is information in this regard that can be shared, to continue with transparency in procedures, it would be appreciated. (In the same way we expect the governance&community can follow more closely this type of agreements in the future [for provision of liquidity and similar] to ensure that everything is OK if possible). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.015151515151516
                },
                {
                    "author_link": "https://gov.optimism.io/u/naresdang",
                    "index": "19",
                    "likes": "3",
                    "time": "09/06/2022-00:51:05",
                    "content": "Thank you for being transparent. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/ping",
                    "index": "20",
                    "likes": "2",
                    "time": "09/06/2022-00:52:15",
                    "content": "Thank you for the transparency. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/alrashel",
                    "index": "21",
                    "likes": "2",
                    "time": "09/06/2022-01:24:06",
                    "content": "Optimism is not just in name but also in deeds. Thanks a lot. Go ahead. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/emerald",
                    "index": "22",
                    "likes": "3",
                    "time": "09/06/2022-01:28:47",
                    "content": "    wishful_cynic:  we will proceed to buy OP every time the attacker sells it to make the protocol whole eventually (we did initiate buying the first million OP tokens yesterday already)   Instead of having us trust that you will buyback the stolen tokens, will you be exploring ways to uphold this promise using smart contracts instead? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.107142857142858
                },
                {
                    "author_link": "https://gov.optimism.io/u/ApePrince",
                    "index": "23",
                    "likes": "13",
                    "time": "09/06/2022-01:43:55",
                    "content": "why is everyone thanking these guys!?This should have been mentioned to the community way before this and this is not how transparency works. As the community is very disappointed in the teams and how things were handled up to this point.  Market makers dumping the price in order to buy back ( the reality of what  is happening so far) is not a great thing for a project. Optimism was a great concept and we had high hopes for this; the community have now lost the trust.  Now there will be plenty of guys from both teams coming here and slamming this message saying this and that. Go for it! - Reality is the teams should have been transparent before this! They should have communicated this within 48 hrs max. Those who knew already cashed out of the air drop and now talking about getting the next one. unbelievable ! Keep in mind the market makers are not here on goodwill. They will make their money one way or another. This is just wrong on so many levels. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.73125
                },
                {
                    "author_link": "https://gov.optimism.io/u/Ruby",
                    "index": "24",
                    "likes": "1",
                    "time": "09/06/2022-03:11:01",
                    "content": "Thanks for your info! I had wish this could be more transparent DAY One! If the team can write this letter before the initial airdrop started, things could be different. We can wait, we did not need to rush I hope everything will be resolved optimistically Keep us in loop, thanks again! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.125
                },
                {
                    "author_link": "https://gov.optimism.io/u/cola",
                    "index": "26",
                    "likes": "1",
                    "time": "09/06/2022-03:36:23",
                    "content": "It is sincere, but more importantly, it should be disclosed in time when the problem is out of control and the issuance plan should be changed. Concealing major problems will do great harm to users who continue to support and buy OP during this period. I will still support the OP and its ecology. I hope that after the baptism of these events, the OP can be more sincere, modest, safe and transparent, and will surely enjoy ecological prosperity. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.119318181818182
                },
                {
                    "author_link": "https://gov.optimism.io/u/newjks",
                    "index": "27",
                    "likes": "0",
                    "time": "09/06/2022-03:38:49",
                    "content": "Where is buy back address? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Jeremylau",
                    "index": "28",
                    "likes": "1",
                    "time": "09/06/2022-03:44:08",
                    "content": "Although this incident has caused short-term losses to us as staunch holders of $OP, it shows the responsible attitude of the Wintermute team. I hope that the team can continue to contribute to the optimistic future development. Hopefully the attacker will make the right choice: be a white hat hacker, not a criminal! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.735714285714286
                },
                {
                    "author_link": "https://gov.optimism.io/u/Jeremylau",
                    "index": "29",
                    "likes": "1",
                    "time": "09/06/2022-03:48:12",
                    "content": "It seems that the HODLER who added $OP in the past two days is not very lucky! I am one of them. The $OP in the airdrop was not sold, and a lot of positions were added. As a result, I lost a lot of money in this incident! I was thinking yesterday, with so little $OP in circulation, who is buying at a high price and selling at a loss at a low price? It turned out to be hacker 0 cost arbitrage ~ really hateful! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.810149572649572
                },
                {
                    "author_link": "https://gov.optimism.io/u/phuchoangle",
                    "index": "30",
                    "likes": "0",
                    "time": "09/06/2022-03:51:32",
                    "content": "Thanks so much for your transperacy. This would help a lot. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lazeeeerlin",
                    "index": "31",
                    "likes": "0",
                    "time": "09/06/2022-04:21:15",
                    "content": "Hope the last luck belongs to justice and bring back more returns to OP investors ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/Callen_WM",
                    "index": "32",
                    "likes": "9",
                    "time": "09/06/2022-04:38:04",
                    "content": "Hey guys, there has been a lot of question regarding the buy back which I have answered in the Optimism Discord. So I’ll re-post what I wrote in there: We will be purchasing via CEXs. Given we are also the market maker for $OP any price dislocation will be arbed by us on DEXs. This is obviously a tough day for Wintermute and as a consequence the OP community and team. I just want to let the community know that we will not be going anywhere, we will continue to support $OP and its community and fulfil our obligation on both the market making side as well as repurchasing all tokens offloaded from the address we are not in control of ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.027777777777778
                },
                {
                    "author_link": "https://gov.optimism.io/u/kkishow",
                    "index": "33",
                    "likes": "1",
                    "time": "09/06/2022-07:31:29",
                    "content": "It is hoped that transparency and active responsibility will continue. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.333333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/xiaolaoban",
                    "index": "34",
                    "likes": "1",
                    "time": "09/06/2022-08:04:48",
                    "content": "我有点奇怪的就是 ，为什么这个事情今天才说，现在已经是6月9日了。不是五月30日的事情吗？为什么当时不说，这是割了多少韭菜啊 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Mcmich",
                    "index": "35",
                    "likes": "0",
                    "time": "09/06/2022-08:09:45",
                    "content": "  this is a fact. I thief was contacted by someone inside ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/ozingi",
                    "index": "36",
                    "likes": "0",
                    "time": "09/06/2022-12:01:17",
                    "content": "加油宝贝，攻击者站出来，虽然我很羡慕你啊啊啊啊 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "37",
                    "likes": "0",
                    "time": "09/06/2022-12:04:07",
                    "content": "well you are right about lack of transparency from OP team, messing up the airdrop, before bashing at me, remember they had all the time for infra setup, deleting post on this gov portal and now this. Its not looking good at all. Does anyone knows when did this happened ? before the airdrop was live or after ? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.87012987012987
                },
                {
                    "author_link": "https://gov.optimism.io/u/0xjason42069",
                    "index": "38",
                    "likes": "0",
                    "time": "09/06/2022-12:06:33",
                    "content": "They knew before the airdrop was live ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.681818181818182
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "39",
                    "likes": "3",
                    "time": "09/06/2022-12:11:33",
                    "content": "Then, I have one question, why didnt the team deploy a new token contract, stolen token was not live, hence the new one would have invalidated the value of the exploit ? I assume if it leads to delay in airdrop, $20M is worth few hours/day of delay. Can anyone with more understanding of contract comment on this, was this possible ? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.574675324675324
                },
                {
                    "author_link": "https://gov.optimism.io/u/0xjason42069",
                    "index": "40",
                    "likes": "1",
                    "time": "09/06/2022-12:26:27",
                    "content": "The teams answer to that, is since watermute told them there’s a chance funds were recoverable, they would just continue like nothing happened ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "41",
                    "likes": "3",
                    "time": "09/06/2022-12:40:56",
                    "content": "chuckles, I dont know if this is some kind of joke or not. I see three option:-  Deploy a new contract once the issue was knows as 20M is quite a significant % of released token supply. Postpone the airdrop until this is sorted. Make it public and come clean  and they decided to keep it close. Again, to re-iterate I dont want to involve or even encourage price discussion here. OP is gov token and for me, it has the same value at $0.1 or $1 and I dont buy that wintermute told them its recoverable and they agree with them. With brain force that OP team has, If they did not knew in first few hour if its recoverable or not, no one would. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9550189393939394
                },
                {
                    "author_link": "https://gov.optimism.io/u/newjks",
                    "index": "42",
                    "likes": "3",
                    "time": "09/06/2022-12:57:07",
                    "content": "Post the buy back address here so everyone can easy monitor it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.083333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/LAVEP",
                    "index": "43",
                    "likes": "3",
                    "time": "09/06/2022-13:33:19",
                    "content": "Transparency is vital.  Situation unfortunate.  Fingers crossed this works   Stay Optimistic!! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.296875
                },
                {
                    "author_link": "https://gov.optimism.io/u/fig",
                    "index": "44",
                    "likes": "3",
                    "time": "09/06/2022-15:05:59",
                    "content": "Love the firm stance on clawing back the funds. Appreciative of you [Wintermute] coming to the forum and telling the story from your perspective. Seems to be a complex and impressive attack. We hope the exploiters see this message and act in their best interest. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.857142857142858
                },
                {
                    "author_link": "https://gov.optimism.io/u/mgsre1999",
                    "index": "45",
                    "likes": "2",
                    "time": "09/06/2022-15:57:15",
                    "content": "please maintain this level of transparency ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/PAKDO",
                    "index": "46",
                    "likes": "2",
                    "time": "09/06/2022-16:52:42",
                    "content": "It’s gonna be ok soon ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/artoria",
                    "index": "47",
                    "likes": "1",
                    "time": "09/06/2022-18:06:36",
                    "content": "I worked out a timeline of OP exploit:  twitter.com    TechnoArtoria (🦇,🔊) @artoriamaster  A summary of $OP exploit timeline. Hope this explains why the incident happened and why retails got rekt (spoiler: pure incompetence of @optimismPBC and Wintermute)🧵   Optimism ( ✨ 🔴_ 🔴 ✨) @optimismPBC  Wow, what a day.   OP Drop #1 had a turbulent launch which we finally stabilized after more than five hours of non-stop work.  We’ll be publishing a full, detailed retrospective on the lessons learned next week. Let’s quickly talk about what happened.    10:20 PM - 8 Jun 2022           11                1            Optimism team was notified about the exploited on June 6th. However, it was not disclosed to the public until June 8th. Coincidentally, OP token price topped at 1.3 USD on June 6th. Dropped 20% within a day, and then another 30% the following day. Was there insider trading?  image1009×512 33.4 KB  ",
                    "links": [
                        "https://twitter.com/artoriamaster/status/1534767315744595968",
                        "https://twitter.com/artoriamaster/status/1534767315744595968",
                        "https://twitter.com/optimismPBC/status/1531798279582666752",
                        "https://twitter.com/artoriamaster/status/1534767315744595968",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/1X/b0f836cb6a720271b30aa384fb1fda12677bc3b0.png"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.948809523809524
                },
                {
                    "author_link": "https://gov.optimism.io/u/max.op",
                    "index": "48",
                    "likes": "0",
                    "time": "09/06/2022-18:20:18",
                    "content": "I agree, transparency is crucial. some buyback proof would we good.  https://thumbs.gfycat.com/DaringBigDungenesscrab-size_restricted.gif(image larger than 4 MB) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.166666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/Calypso",
                    "index": "49",
                    "likes": "0",
                    "time": "09/06/2022-19:35:30",
                    "content": "Totalmente de acuerdo, aumentar la transparencia. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/artoria",
                    "index": "50",
                    "likes": "2",
                    "time": "09/06/2022-21:37:06",
                    "content": "There is no transparency. The mistake was hidden from the public before the token launch. Even after the exploit happened, Optimism team hid this information for additional 2 days while insiders sold OP tokens and caused 40% dump. I want the community to continue investigation and urge Optimism team to clarify. (1) Why did it take 2 additional days after the exploit on June 6th to disclose the information? (2) Was there insiders who, based on information about the exploit not yet available to the public, sold OP tokens before the public announcement on June 8th? Please find the details in the following post:     Information Disclosure Request for 20M OP Exploit - Was There Insider Trading? What Happened Behind The Scenes?       I collected relevant public available information in retrospective and worked out a timeline of the exploit. From these information combined with OP token price history, I strongly suspect there was insider trading. Insiders were aware of the exploit 2 days earlier than public disclosure.  A summary of timeline:    Key information:  “Wintermute notified us that someone else had taken control of the address on June 06”, as posted by @jinglejamOP    Briefly speaking, Optimism team was notified by …     ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.411458333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/dcposch",
                    "index": "51",
                    "likes": "2",
                    "time": "10/06/2022-03:07:20",
                    "content": "Thanks for the transparency. Can you clarify if this matches your experience?  Screen Shot 2022-06-09 at 7.31.30 PM1182×562 103 KB  No shame & not trying to call you out, but I think this is a great learning opportunity. We’re all early and best practices are still developing. If it’s true that you confirmed two smaller, test transactions before the main one, it suggests an obvious best practice. Always go thru the process of spending / withdrawing assets before greenlighting a major transaction. In this case, that would’ve exposed the issue with much less value at stake. Verifying a test transaction by just viewing it in a block explorer / seeing the account balance go up is insufficient. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.630208333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/wishful_cynic",
                    "index": "52",
                    "likes": "12",
                    "time": "10/06/2022-03:49:32",
                    "content": "Hi everyone, wanted to give an update on the ongoing situation and also provide a response to some common questions/reactions I’ve seen last 24 hours. Update on current situation Exploiter is currently in possession of 18 million OP tokens out of 20 he had initially. We’ve repurchased 1 million tokens to offset what they sold. 1 Million OP tokens has been sent to Vitalik and he has been kind enough to return them to Optimism Foundation. Some tokens have been delegated by the exploiter, but I don’t see this as a material issue at this stage. Clarifying some questions Optimism should have done a better job at checking the transactions to Wintermute. I’d like to reiterate again that this was 100% our fault. Could Optimism have asked us to perform that check? Yes they could in theory. In practice nobody asks for this ever, including when dealing with large transfers. Protocol is always: Do a test Wait for confirmation the test was successful Send the rest Our process failed there, but it is excessive to ask the Optimism team to do more in this situation. However, it is certainly a learning point for all of us to potentially do these checks in future where the magnitude of the transfer warrants it. Can you prove that Wintermute bought 1 million tokens? If OP token has only been available on decentralized exchanges, such proof would have been easy to provide. However, in our capacity as Market Maker, we are trading OP on 5 major centralized exchanges and some smaller ones as well. I am very open to suggestions on how we can demonstrate this, but ultimately , short of doing an independent audit on Wintermute, there is no way for us to prove this. I can say one thing though. If we endeavor to buy all 20 million tokens right away, we would push the price higher and open ourselves for a possibility of other trading firms front running us. Moreover, we would give the attacker a possibility to cash out at a better price. Current approach where we only buy what the exploiter sells, makes sure that the price impact over the space of more than a few hours is minimal. Why didn’t we ask for a network upgrade to fix the mistake This is a two-part question. First opportunity to do this was when we realized that the funds were inaccessible. As I’ve written in the original post, the initial assessment has been that the funds can only be recovered by us. Safe team recently posted their own assessment, confirming that:  1258×148 29.4 KB  Back then it seemed feasible that given the possibility of recovery it would make sense to proceed without network upgrade and recover funds later. Second opportunity arose once we realized that the funds had been taken by the exploiter. I’ve seen questions and even governance proposals to fix this by voting. I strongly believe that “fixing” this by governance vote would have been a mistake, despite potentially saving Wintermute money. What this would have created is a precedent. Precedent to compensate every single mistake on Optimism in future, that would not stop with transfers gone bad. At Wintermute we strongly believe that this is not the right approach, not just for Optimism, but for all other protocols as well, save for catastrofic events endangering protocol survival. Accepting to recover funds this way would mean that we would have no right to oppose similar actions done in future. It might sound illogical, but this is the way we approach governance – by broadcasting our values and operating principles and striving to abide by them. If our opinion on this matter changes we would communicate it. We don’t think that our values should change based on an amount that we can afford to lose. I’m well aware that the majority of trading firms do not operate this way and would simply vote in line with their commercial interests. We are different. Why can’t we make an offer to the attacker to purchase the remaining OP for USDC? There is a simple legal reason – this would constitute an OTC trade and we are required to KYC our counterparties (to make sure we are not dealing with North Korea or a drug kingpin). There is also a fairness reason – we don’t think the exploiter should get away with it. We would be legalizing his exploit that way and we don’t think that makes sense. Message to the exploiter I realize, I was not necessarily clear what we consider fair in this situation. We are prepared to accept to pay a bounty of 10% of the total amount (so in this case an extra 1 million OP tokens on top of what was already cashed out) and consider this a whitehat hack situation and not to pursue you legally. Remaining 17 million tokens should be returned back to Optimism Foundation at the address: 0x2501c477d0a35545a387aa4a3eee4292a9a8b3f0 If the funds are not transferred by 12PM noon 11th of June, we’ll start sharing the information we already know with the relevant authorities and will not treat this as whitehat. We will duplicate this message, broadcasting it to  0x4f3a120E72C76c22ae802D129F599BFDbc31cb81 on optimism network ",
                    "links": [
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/2/247cd7d301998d9da514cb1eb54f4be1b6e9f2ce.png"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.598696911196911
                },
                {
                    "author_link": "https://gov.optimism.io/u/MinimalGravitas",
                    "index": "53",
                    "likes": "1",
                    "time": "10/06/2022-09:20:01",
                    "content": "   Optimistic Ethereum L2 Explorer    Optimistic L2 Transaction Hash (Txhash) Details | Optimism Optimistic L2 detailed transaction info for txhash 0x48464e4a6459062ac07efb4959fe8a6f90843f74922e68f71a929b33969f8f37. The transaction status, block confirmation, gas fee, Ether (ETH), and token transfer are shown.       Hello, Vitalik, I believe in you, just want to know your opinion on this. BTW, help to verify the return address and I will return the remaining after you. And hello Wintermute, sorry, I only have 18M and this is what I can return. Stay Optimistic!  Kudos to Azrkhr#1181 on Discord for spotting/sharing.    Discord   Discord - A New Way to Chat with Friends & Communities Discord is the easiest way to communicate over voice, video, and text.  Chat, hang out, and stay close with your friends and communities.      ",
                    "links": [
                        "https://optimistic.etherscan.io/tx/0x48464e4a6459062ac07efb4959fe8a6f90843f74922e68f71a929b33969f8f37",
                        "https://discord.com/channels/667044843901681675/968498016417902673/984742702757331016",
                        "https://discord.com/channels/667044843901681675/968498016417902673/984742702757331016"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.045454545454545
                },
                {
                    "author_link": "https://gov.optimism.io/u/Jeremylau",
                    "index": "54",
                    "likes": "0",
                    "time": "10/06/2022-11:04:37",
                    "content": "Hackers chose a very sensible channel to solve this! It’s a good thing to pull VB in as an intermediary, but it also shows distrust of optimism and WM, which is not surprising given the appearance of the Oolong incident. I hope that after this incident, Optimism and WM can be more responsible and honest, do a good job in the safety foundation of the project, do a good job in marketing and publicity, and let Optimism return to its correct position! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.171875
                },
                {
                    "author_link": "https://gov.optimism.io/u/lonlychs",
                    "index": "55",
                    "likes": "2",
                    "time": "02/07/2022-14:13:31",
                    "content": "Thank you for being transparent ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/jordan",
                    "index": "56",
                    "likes": "1",
                    "time": "07/07/2022-04:56:33",
                    "content": "Much appreciate the transparency ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/GinjaNinja",
                    "index": "57",
                    "likes": "1",
                    "time": "13/08/2022-19:18:32",
                    "content": "Honesty and transparency are very much appreciated. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Trudahamzik",
                    "index": "58",
                    "likes": "0",
                    "time": "15/08/2022-02:36:34",
                    "content": "Great write up and awesome transparency. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/chuahendryt",
                    "index": "59",
                    "likes": "0",
                    "time": "14/01/2023-04:47:57",
                    "content": "The summer is coming. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/motonledin7",
                    "index": "60",
                    "likes": "0",
                    "time": "15/01/2023-06:53:25",
                    "content": "I have nothing to say but bless. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/ruck",
                    "index": "61",
                    "likes": "0",
                    "time": "15/01/2023-15:48:18",
                    "content": "Wintermute Wintermute Wintermute ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Crash",
                    "index": "63",
                    "likes": "0",
                    "time": "16/01/2023-10:44:54",
                    "content": "Thank you for the transparency bro ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        },
        {
            "thread_link": "https://gov.optimism.io/t/message-to-optimism-community-from-perpetual-protocol/3050",
            "title": "Message to Optimism Community from Perpetual Protocol ",
            "index": 3050,
            "category": [
                "\\xf0\\x9f\\x93\\xa2 Updates and Announcements",
                "Official Communications"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/tongnk",
                    "index": "1",
                    "likes": "9",
                    "time": "21/07/2022-16:16:12",
                    "content": "Hi everyone, We want to provide context and clarify our intentions behind actions taken following the Phase 0 airdrop.  Background As a major project on Optimism, Perpetual Protocol applied for and received a Phase 0 OP Token grant of 9m OP tokens. The proposal outlined 3 areas for spending: Liquidity Acquisition, Liquidity Mining and Builder Acquisition. Two aspects of the execution of the proposal have drawn criticism from the Optimism community. To better understand how decisions are made at Perpetual Protocol, it is key to know how the project is structured. As with most projects in the space, the ultimate goal is to decentralize and Perpetual Protocol shares this ideal. We currently have 5 distinct entities which are:   Perpetual DAO: the entity that holds and manages all remaining PERP tokens from the initial mint  Foundation: the team that builds the core protocol, manages the current UI found at perp.com, and manages rewards etc. as mandated by the Perpetual DAO  GrantsDAO: a sub DAO that funds projects and protocols to integrate and build on Perp  Token listing DAO: a sub DAO that approves and lists markets on Perp  Market Making Entity: a separate entity and team that handles market making  All of the entities currently have distinct teams, budgets and mandates, with the exception of the Perpetual DAO which does not yet have a team.  Issue 1: Retroactive airdrop to LPs As part of the initial Phase 0 proposal, we specified that we wanted to allocate 8M of OP tokens towards liquidity mining incentives to grow the TVL and trading volume on Perp. As part of this, we had also intended to reward existing LPs through a retroactive airdrop. This was not put into the proposal as we did not want to attract airdrop farmers but rather incentivise real individuals and entities that would provide funds to Perp. We did not provide sufficient details regarding our implementation plans and we should have communicated our plan better to the OP community. Wallets belonging to the market making entity (MME) were not excluded from the retroactive airdrop to all wallets that facilitated trading volume as an LP between launch and June 1, of which MME wallets comprised a substantial majority. The MME was formed as a distinct legal entity with its own team (detailed in this gov post: https://gov.perp.fi/t/proposal-market-making-entity/634/). ​The MME uses the wallets listed in Perp V2 Foundation vs External, some of which were migrated from the Foundation (source). The MME mandate is two fold:  Provide liquidity on Perp V2, and Work with other market makers to provide liquidity on Perp V2 via USDC lending or other means  After the retroactive airdrop was sent to historical LPs of Perp v2, because the OP token has not yet been added as a collateral type on Perp v2, the MME decided to convert a portion of the OP to USDC (one of three assets currently used as collateral) in order to provide more liquidity on Perp v2. OP was not sold to profit team members, but to further the MME mandate of driving liquidity growth on Perpetual Protocol, and by extension, Optimism as a whole. We understand that to many people it may look like the foundation and MME are one organization, and as such, presume the foundation team gave tokens to itself, and later sold them. We would like to apologize for poorly communicating this matter to the OP community. We have asked the MME to repurchase the OP tokens that were sold, and place these in the fund used for future liquidity mining rewards as described in the Phase 0 proposal. Previously we planned to add OP as a collateral type once price discovery had matured and major distributions had been completed. We have decided to expedite this process, allowing the MME team to use OP as collateral in the near future, adding to the OP token’s use cases.  Issue 2: GrantsDAO Allocation The sale of 500k OP tokens for USDC and subsequent bridging to Mainnet executed by the Perp GrantsDAO also caused concern and dismay among the Optimism community. The GrantsDAO is the longest running Perp sub-DAO. The GrantsDAO Committee is independent and no current or former foundation team members sit on this committee. This DAO has funded numerous Perp related projects and aims to continue doing so for years to come. According to the GrandDAO’s experience, a large majority of grants are priced in USD as most of the projects still have expenses that are required to be paid in USD. Given this, the DAO committee’s mandate demands effective treasury management, and the committee decided the best course of action was to sell the 500K OP for USDC. Afterwards the funds were bridged back to Ethereum and into the Gnosis safe where GrantsDAO funds are kept. The committee has expressed its understanding that bridging liquidity out of Optimism goes against the mission of the GrantsDAO (to grow the Perp and Optimism ecosystems) and this was an oversight on their part. We have asked the committee to create a new Gnosis safe on Optimism at the earliest possible time and bridge funds back so they are ready to distribute to grantees on Optimism.  Restatement of Intentions The Phase 0 airdrop proposal’s stated goal is to increase the use of Perpetual Protocol as well as Optimism. We firmly believe the actions of the foundation team and sub-DAOs are aligned with this goal, as our future is directly tied to the future of Optimism as a whole. However, we understand how the actions described above led to misunderstanding about our intentions.  Perpetual’s Future with Optimism Despite recent misunderstandings, our commitment to Optimism, the community and ecosystem has never been stronger.  We continue to have the highest transaction volume on Optimism (Dune) and work constantly to grow this number. We remain dedicated to being on Optimism only and have no plans to deploy on other chains. We are not multi-chain and the success of our protocol ties directly to the success of Optimism. Given we are not multi-chain, all PERP and OP used as rewards serve to grow and incentivise liquidity, users and builders on Optimism. We have a heavy focus on composability and have a solid track record of funding projects through grants. Working closely with the OP team we have convinced many projects to deploy on Optimism and continue to collectively grow the ecosystem. We are active in Optimism governance and are firmly committed to the future success of Optimism as well as a healthy, decentralized governance landscape.  We hope this gives some context into how the various teams thought about the actions they took and hope to illustrate that none of these had the intention to be malicious or self-serving. We have strongly backed Optimism as the chain to be on and will continue to do so. We strongly believe in the OP team and the potential of the ecosystem to thrive and create a composable DeFi world that benefits all. ",
                    "links": [
                        "http://perp.com",
                        "https://gov.perp.fi/t/proposal-market-making-entity/634/15",
                        "https://dune.com/queries/616146",
                        "https://gov.perp.fi/t/proposal-market-making-entity/634/15",
                        "https://dune.com/optimismpbc/Optimism"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.668738781543659
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "2",
                    "likes": "6",
                    "time": "21/07/2022-17:07:47",
                    "content": "Thank you writing this. MME still make sense but moving fund to main chain just to hold it in Gnosis is major overlook on your DAO side. Its a DAO, which means the DAO team must have discuss this before bridging over, right ? A DAO, full of people getting funds to improve liquidity on OP chain and once they have the fund, decided to bridge out. How do you explain this ? I am not following Perp closely so correct me if I am wrong but do you discuss such changes with team and community, not with OP community but at least with your community ? As when this happened no one aware of this. Self-delegation and now this, in both the cases someone else pointed it out and then we get a official communication from your team. It should be other way around. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.094940476190476
                },
                {
                    "author_link": "https://gov.optimism.io/u/Maessedai",
                    "index": "4",
                    "likes": "0",
                    "time": "22/07/2022-16:21:29",
                    "content": "I think this situation reveals that governance is working (in part).  There are a number of actions that perpetual (and subsequent daos) took either outside the proposal or against the spirit of the proposal and it appears to me you are taking the proper steps to correct these based on the discussion happening in the forums.  I am glad you are doing this and think it’s the right move.  I think we may consider some process to enforce the agreed upon proposals if the protocol asking for the funds acts in bad faith. I don’t think perpetual did this however optimism was forced to trust you to do the right thing.  I understand the reading behind the retroactive airdrop and the reasoning makes sense however that decision shouldn’t really have been up to you as you were asking for $op under specific qualifications and choosing to spend the $op differently then outlined isn’t the way we want protocols to act even if for good reasons. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.21978021978022
                },
                {
                    "author_link": "https://gov.optimism.io/u/RocketMan",
                    "index": "5",
                    "likes": "1",
                    "time": "24/07/2022-19:18:43",
                    "content": "I find it intriguing that you opted to airdrop 89% (8/9m) of the OP tokens received to LPs. That’s a significant number of the OP received by Perp and leaves very little for the proposals other stated uses. I think at most a maximum of 50% should have been allocated in this way. Especially since it wasn’t ever in the proposal (for reasons I understand). Can you explain why so much was allocated for retroactive airdrops to LPs? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.71875
                },
                {
                    "author_link": "https://gov.optimism.io/u/tongnk",
                    "index": "6",
                    "likes": "2",
                    "time": "25/07/2022-17:45:52",
                    "content": "    OPUser:  MME still make sense but moving fund to main chain just to hold it in Gnosis is major overlook on your DAO side. Its a DAO, which means the DAO team must have discuss this before bridging over, right ? A DAO, full of people getting funds to improve liquidity on OP chain and once they have the fund, decided to bridge out. How do you explain this ?   I’m not sure given this was the grants dao decision but the funds wouldn’t be helping liquidity as it would be for projects that build on top of Perp and OP     RocketMan:  I find it intriguing that you opted to airdrop 89% (8/9m) of the OP tokens received to LPs. That’s a significant number of the OP received by Perp and leaves very little for the proposals other stated uses.   Actually this is incorrect, it was 1.8m airdropped out of the 8M that was allocated towards liquidity. However as pointed out above a large majority of this is going to be bought back and put back towards liquidity mining ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.545138888888888
                },
                {
                    "author_link": "https://gov.optimism.io/u/YOOOO",
                    "index": "7",
                    "likes": "0",
                    "time": "26/07/2022-14:10:05",
                    "content": "This project is a fraud, cheated out of OP most of the issued to the internal wallet ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/dhann0x",
                    "index": "8",
                    "likes": "0",
                    "time": "14/03/2023-17:15:38",
                    "content": "This isn’t really how it should be toward token distribution, that amount of OP is too much for retroactive LPs what of users who traded on the dex, Loyal community members who stood by the project, your prepvangelist program, wouldn’t you reward the community, I mean when I joined your discord those perpvangelist are really doing an awesome job to be honest, considering them part of the plan would really geer them up and better the community, I mean don’t leave out the community, you didn’t talk about participants who did op quests too. Well whatever just please include the community in this op plan  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.304166666666666
                }
            ]
        }
    ],
    "group_index": "81"
}