{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/delegators-lets-move/3588",
            "title": "Delegators: Let's move! ",
            "index": 3588,
            "category": [],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/TheDoctor",
                    "index": "1",
                    "likes": "4",
                    "time": "29/09/2022-23:40:44",
                    "content": "We may delegate and make some comments about proposals, hoping all this new infrastructure will bring us a better world. Guess what? Not going to happen if we don’t make it happen. I’ve been around for a while, waiting for someone to make that vague proposal I have in my mind, that I can feel but I’m not able to express and make happen. Cause I’m not strong enough, not a leader, not a winner, … I am a Ph.D. holder in Applied Mathematics, but sometimes I cannot solve a captcha on discord, because of my ADHD. I’m sure I’m not the only one that can see things others can’t, but nobody cares to listen if is not fancily written on a white paper promising the moon. I got my OP airdrop for voting in a DAO. So I feel that we can delegate, but we must keep practicing governance on a smaller scale. That’s why they bring us here. I truly believe that there is too much bottom-up community work to do. We are close to having the best highways ever, but billions of utility cars are not aware, and they keep driving through terrible paths. My proposal is:  why don’t we as a community start making a list of all that ideas (social impact oriented) and discuss them together so we can start making some possible? It will be great to create some social use cases as a community. Am I too optimistic?  ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.345095693779904
                },
                {
                    "author_link": "https://gov.optimism.io/u/TheDoctor",
                    "index": "2",
                    "likes": "0",
                    "time": "02/10/2022-17:57:21",
                    "content": "The following was just an idea to explore other communities’ mechanisms in the OP ecosystem. I think it has been misinterpreted as a firm proposal coming from me, there is no point in such a thing. I find it necessary to explore some mechanism for creating some truly decentralized small communities inside a huge community like this one, but it must be created as a group, not an individual, that’s why I appreciate your feedback and I reformulate the idea after more reading and participation. Something like this would bring different ideas and it’d be an opportunity to keep researching governance, which is my main personal interest. About the DAO token, I wasn’t thinking in a token as we understand after years of scam tokenomics, just a way of organizing governance of that small group. A nontransferable solution or a DAO platform solution could be implemented. Anyway is not for me to decide. PD: I don’t know how to interpret some laugh reaction I got on Discord when discussing this. I interpret it as someone who doesn’t know how a person with a neurodivergent brain can have issues expressing herself, especially in a foreign language. That behavior is a great way to make diversity stay away from any community giving as a result the same products built by the same people. What is crypto for then? Thanks and I’ll keep learning with all of you. Here is some idea: We can create a subDAO for OP holders so we can explore governance:  Anyone holding OP tokens and wanting to participate in this experiment can do it by indicating his OP address on this forum or in the official OP Discord. We establish a deadline and a block number for holding OP We create a DAO token and we send it to all the Holders who claimed it with a formula so we are a truly decentralized OP user DAO, here’s a proposal: Being n= number of Op addresses joining this idea and X= [ X1, X2,…,Xn] a vector where Xi=Number of OP tokens holding user i Each participant will get Y[i] = min ( Xi, 2*Med(X)) tokens of the DAO  (1) DAO tokens won’t be traded in any market nor liquidity would be provided. We can mint the exact amount needed to distribute and all the steps will be verifiable. (2) This DAO will contribute to community involvement in OP governance by giving small OP holders the opportunity to speak their minds and be heard in a small agora from where any issue could be discussed, community reviewed and scaled to the official governance OP roles. Feel free to rewrite the proposal or even post it yourself, any feedback will be great. We can also look for being a heterogeneous DAO by establishing some minimum participants from any language represented in this community. *Med is the median value. ------------I’d add some feedback I get on Discord----------------- 1. The purpose of this DAO is to create a new token: It is a very understandable concern, that’s why I’ll add comment (1) to the proposal: Thanks for your comment. Not at all the idea, is just to explore governance beyond delegating to others. That token won’t be listed anywhere, nobody will provide liquidity for it. We can just mint the exact amount needed to distribute. 2. How will a token or subDAO contribute to community involvement in OP governance? We are here to explore new ways of governance, but unfortunately, not everyone can read all proposals and vote them all. What can we do then? 1. Self delegate, and vote only on those proposals in which we are motivated to follow. In this case, our tokens will be useless on those proposals if we cannot participate, and we would still feel as in usuall democracy that our vote is not relevant. 2 Delegate and hope delegators are going to vote as we feel by expressing ourselves commenting on proposals in the first week As a subDAO, we could explore some Booton- UP emergency properties, and end up bringing different use cases for L2 rather than the Defi, NFT. We also could name a delegator (not need to be one of us) and we could translate our thoughts about some issue. I understand that OP Governance can not bring more complexity to the system by adding other roles, but as a tokenized community we always can explore other ways to make information go from button-UP.   Regarding that not everyone can read all the proposals and vote on all the proposals, there are delegates, committees that read all the proposals and provide recommendations, feedback, constructive enough for a person not involved to make a voting decision. Regarding that not everyone can vote, there are delegates, delegate the OP tokens and delegates will vote if you don’t have enough time to get involved in voting and governance. The Optimism Collective is community driven, it is maximally open and any member can put forward their ideas, or any problem, and they will be discussed, solved and implemented. And delegates do not have an ‘official OP governance role’, delegates are contributors acting on the basis of a social commitment. A recent example to make sure that every community member’s voice is heard you can check the forum for discussions during the reflection period, and compare the Operating Manual V 0.1.2 and V.0.2.1, all these changes and implementations were made by the OP community. And during the voting season some solutions can be implemented or some problems can be solved, anytime, anyone can say, we also have OP Governance Call every 2 weeks, where OP community, delegates and the OP team participate, where anyone can raise any problem. We are open. Thanks for your feedback. Before I posted this, I read carefully all documentation and some projects. But what I realized is that I didn’t participate enough so I could have a better understanding of the government issues. Thanks for your time  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4458556149732615
                }
            ]
        }
    ],
    "group_index": "281"
}