{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/draft-gf-phase-1-proposal-fam/5035",
            "title": "[DRAFT][GF: Phase 1 Proposal] fam ",
            "index": 5035,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Grants Council"
            ],
            "tags": [
                "cycle-10",
                "not-passed"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/ckt",
                    "index": "1",
                    "likes": "2",
                    "time": "02/02/2023-04:19:14",
                    "content": "Project name: fam. Author name and contact info (please provide a reliable point of contact for the project): Chris Tam (chris@gmfam.xyz; @ckttam on Telegram / Twitter) I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: Yes I understand that I will be expected to following the public grant reporting requirements outlined here: Yes L2 recipient address: 0x3b74c3F17559E4CD937C5bcA4bC86C23a2B8A5f0 Which Voting Cycle are you applying for?: Cycle 10 Which sub-committee should review your proposal? (Builders Grants, Growth Experiment Grants): Builders Grants Project description (please explain how your project works): Fam is a public good that provides Community Hubs for token-based web3 projects (e.g. NFT collections) on our website (https://gmfam.xyz) and mobile app (‎fam. on the App Store). A Community Hub is a token-gated space where project holders can visit a Member Directory, view and contribute to an Activity Calendar, and join or create Community Clubs (groups, or sub-communities). We currently support Ethereum-based NFTs and would like to begin supporting Optimism-native NFTs, as well. Website: https://gmfam.xyz Twitter: https://twitter.com/gmfamxyz Discord/Discourse/Community: Other relevant links (including any demos): e.g. Community Hub for Pudgy Penguins: Pudgy Penguins - Fam Additional team member info (please link): Chris Tam (https://twitter.com/ckttam, https://www.linkedin.com/in/ckttam/)Shuguo Yang (https://twitter.com/0xYungApple, https://www.linkedin.com/in/yangshuguo/) Please link to any previous projects the team has meaningfully contributed to: Doodles – DoodleBank Community Fund proposal in the works; can provide links once live Relevant usage metrics (TVL, transactions, volume, unique addresses, etc. Optimism metrics preferred; please link to public sources such as Dune Analytics, etc.): Major ETH NFT project partners using Fam officially for community management (including Doodles, Pudgy Penguins, and more in pipeline); ~500 members registered; ~400 community activities created Competitors, peers, or similar projects (please link): Lu.ma (https://lu.ma/) – token-gated eventsOtterspace (https://otterspace.xyz/) – DAO managementCharmverse (https://www.charmverse.io/) – web3 collaboration Is/will this project be open sourced?: In the Future Optimism native?: No Date of deployment/expected deployment on Optimism: 3/31/2023 What is the problem statement this proposal hopes to solve for the Optimism ecosystem?: In order for Optimism to break into the consumer-facing mainstream, more consumer-facing digital projects (e.g. NFT collections) must choose to build their products in the ecosystem. The challenge is that there must be better and easier ways for those projects to provide value and utility to their end users (i.e. web3 consumers, e.g. NFT buyers), especially versus more established ecosystems. In particular, we believe that much of the value that such consumers are looking for in these types of projects comes from the community of other members, which is currently lacking in Optimism. How does your proposal offer a value proposition solving the above problem?: Fam empowers members of web3 communities to connect and coordinate with one another, creating organic value amongst themselves. By adding support for Optimism NFTs on Fam, we hope to open our Community Hubs to Optimism-based NFTs projects, as well, making it easy for holders of Optimism NFTs to get the most out of their community experience, while also helping those NFT projects build, manage, and empower their communities. Why will this solution be a source of growth for the Optimism ecosystem?: By adding this layer of community-based utility to all token-based projects on Optimism (e.g. NFT collections), we expect that it will be easier for such projects to attract users, thereby making it more attractive for projects to choose the Optimism ecosystem. Specifically, we would hope to drive growth in both the number (and share) of projects who choose Optimism, as well as the number of new and active Optimism wallets & users. Has your project previously applied for an OP grant?: No. Number of OP tokens requested: 100,000 Did the project apply for or receive OP tokens through the Foundation Partner Fund?: No If OP tokens were requested from the Foundation Partner Fund, what was the amount?: N/A How much will your project match in co-incentives? (not required but recommended, when applicable): N/A, as we do not currently have a token How will the OP tokens be distributed? (please include % allocated to different initiatives such as user rewards/marketing/liquidity mining. Please also include a justification as to why each of these initiatives align with the problem statement this proposal is solving.): Development Costs – the OP tokens will essentially be used to cover development costs associated with supporting the Optimism ecosystem and its various NFT projects. This includes initial development costs, as well as ongoing support, maintenance, and various idiosyncratic requests by the ecosystem and/or partner projects.User Rewards – while we have not budgeted for User Rewards in the current proposal, this could be interesting, and would essentially serve as a way to incentivize users not only to sign up for Fam, but to become holders of Optimism NFT projects. If this is worthwhile, we would be happy to discuss the scale and implementation of such a program separately. Over what period of time will the tokens be distributed for each initiative? Shorter timelines are preferable to longer timelines. Shorter timelines (on the order of weeks) allow teams to quickly demonstrate achievement of milestones, better facilitating additional grants via subsequent proposals: The tokens will be distributed to the development team over the course of 3-4 months over the initial development and support period. Please clearly define the milestones you expect to achieve in order to receive milestone based installments. Please consider how each milestone relates to incentivizing sustainable usage and liquidity on Optimism. Progress towards each milestone must be trackable: The main milestone will be successfully launching Fam Community Hubs for Optimism NFT projects. Some intermediate milestones could be developed with some early NFT projects, e.g. private alpha launch, integrating Optimism-based token data, gating based on Optimism-based tokens, supporting feature requests they might have on the way to launch, etc. Why will incentivized users and liquidity on Optimism remain after incentives dry up?: Our belief is that community value is not only a means, but the ends – mainstream users are attracted to web3 projects like NFT collections by the dream of joining a community of like-minded individuals where they feel they truly belong. Not only is this sense of community something that brings new users into the ecosystem, but it is also the strongest and most organic incentive to remain and to stay engaged; community is the basis of the stickiness and network effects that bring about snowballing, exponential user growth. Please provide any additional information that will facilitate accountability (smart contracts addresses relevant to the proposal, relevant organizational wallet addresses, etc.): Organization wallet addreess: 0xC149B82d92085D0Bb04b19b7DD5F0191A476CF99 Confirm you have read and agree to the Eligibility Restrictions (here): I have read the Eligibility Restrictions and agree to abide by their conditions ",
                    "links": [
                        "https://gmfam.xyz",
                        "https://apps.apple.com/us/app/fam/id1635060354",
                        "https://gmfam.xyz",
                        "https://twitter.com/gmfamxyz",
                        "https://gmfam.xyz/fam/pudgy-penguins-project",
                        "https://twitter.com/ckttam",
                        "https://www.linkedin.com/in/ckttam/",
                        "https://twitter.com/0xYungApple",
                        "https://www.linkedin.com/in/yangshuguo/",
                        "https://lu.ma/",
                        "https://otterspace.xyz/",
                        "https://www.charmverse.io/",
                        "https://gov.optimism.io/t/grant-proposal-template/3233",
                        "https://gov.optimism.io/t/cycle-10-grant-review-roundup/5284"
                    ],
                    "GPT-summary": "The post is a draft proposal for a project called Fam, which aims to provide Community Hubs for token-based web3 projects. The author explains how the project works, its value proposition, and how it hopes to solve a problem in the Optimism ecosystem. The post also includes information about the author and team, relevant links, and metrics. A third party could provide constructive criticism, extend to the proposal, or ask questions about it.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Token economics",
                        "Interoperability and Scaleability",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.787502811041772
                },
                {
                    "author_link": "https://gov.optimism.io/u/ckt",
                    "index": "2",
                    "likes": "1",
                    "time": "06/02/2023-07:27:07",
                    "content": "Hi there – I’m the Proposal author and wanted to update it in the following way:  Number of OP tokens requested: 50,000 Also acknowledging that we are aware of and accept the 1-year token lockup period  Not sure if @lavande could please help me update the Proposal and/or transfer ownership of the Proposal / post?  Thank you very much! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.40625
                },
                {
                    "author_link": "https://gov.optimism.io/u/GrantsOps",
                    "index": "3",
                    "likes": "2",
                    "time": "06/02/2023-14:00:03",
                    "content": "Proposer is having difficulty updating the post due to the Discourse spam filter. The above comment changing the amount of OP requested and acknowledging the 1-year lockup should be considered incorporated into the application. The Council notes that this application will be updated.  photo_2023-02-06 07.59.151280×814 54.7 KB  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.6875
                },
                {
                    "author_link": "https://gov.optimism.io/u/FractalVisions",
                    "index": "4",
                    "likes": "0",
                    "time": "06/02/2023-14:10:39",
                    "content": "    ckt:  Over what period of time will the tokens be distributed for each initiative? Shorter timelines are preferable to longer timelines. Shorter timelines (on the order of weeks) allow teams to quickly demonstrate achievement of milestones, better facilitating additional grants via subsequent proposals: The tokens will be distributed to the development team over the course of 3-4 months over the initial development and support period. Please clearly define the milestones you expect to achieve in order to receive milestone based installments. Please consider how each milestone relates to incentivizing sustainable usage and liquidity on Optimism. Progress towards each milestone must be trackable: The main milestone will be successfully launching Fam Community Hubs for Optimism NFT projects. Some intermediate milestones could be developed with some early NFT projects, e.g. private alpha launch, integrating Optimism-based token data, gating based on Optimism-based tokens, supporting feature requests they might have on the way to launch, etc.   Can you also please define that the 3-4 month period for the funds being distributed to the developers is after the 12 month token lock ? It appears that the funds will be used immediately according to this section. The distribution schedule does not have any approximate timeframe or percentages related to the allocation of funds from the grant. As well as providing a more thought out timeline and scope of work to achieve each milestone that is laid out attached to each benchmark associated with it … I do not see any information that is “Trackable” over time. I also do not see how each milestone relates to incentivizing sustainable usage and liquidity on Optimism. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.857142857142858
                },
                {
                    "author_link": "https://gov.optimism.io/u/ckt",
                    "index": "5",
                    "likes": "1",
                    "time": "07/02/2023-07:29:07",
                    "content": "Thanks for the feedback! (Sorry, the Discourse forum doesn’t allow me to update the post as a “new account”, since it contains more than 2 links)  Yes, agreed that actual token distribution is subject to a 12-month token lock. The 3-4 months from above is referring to the development timeline (more details below), which is what we think the grant timeline naturally maps to, since development would begin as soon as the grant is approved.  Perhaps it’s best to separate the concepts as “grant” distribution (aligned with development milestones) and “token” distribution, when whatever tokens are granted per the development milestones are then actually distributed to developers upon expiration of the 12-month lock. Let me know if my understanding here is off.  Assuming (per above) that this is “grant” distribution (vs. “token” distribution to the developers), here is a proposed schedule with milestones, amounts, and estimated timelines:  I. Support for Optimism: 50%  Estimated timeline: Grant Approval + 2 months Conditions for granting:  Verify that Optimism projects are supported by Fam Can consider if it still makes sense to proceed based on results and ecosystem interest    II. First Optimism Project using Fam: 25%  Estimated timeline: Milestone I. (above) + 1 month Conditions for granting:  Gather feedback and ensure that this meets the needs of the Project before moving on / funding    III. Second Optimism Project using Fam: 25%  Estimated timeline: Milestone II. (above) + 1 month Conditions for granting:  Likewise gather feedback and ensure that this meets the needs of the Project Also circle back up with first Project to ensure still meeting their needs     Our envisioned “flywheel” for sustainable usage of the Optimism ecosystem is as follows:   Fam develops support for Optimism Optimism projects (e.g. NFT projects) can then use Fam to activate, engage, and manage their communities Active communities attract more users More users + community infra (like Fam) attract more projects to choose Optimism They in turn use Fam to activate, engage, and manage their communities Which attracts more users And so on…  Fam is an instance of a class of public goods focused on community infrastructure. Our thesis is that Fam (and other such community-focused public goods) can help Optimism become a more attractive ecosystem for projects to choose to build on, especially projects looking for the type of “consumer-facing” communities that we’ve seen become popular with ETH-based NFT projects. Our belief is that investing in such public goods – ones that facilitate community – is an important (and in some ways more sustainable) complement to other forms of user incentivization (e.g. financial), since there is built-in utility, network effects, and stickiness associated with the communities that get built, and which serve as the foundations for organic growth. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.916666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/ckt",
                    "index": "6",
                    "likes": "1",
                    "time": "07/02/2023-07:31:43",
                    "content": "Separately, also wanted to provide the link mentioned above on a proposal that I’m working on for Doodles: Establish a Doodles Community Fund dedicated to funding community-organized activities for one another - Doodles - Doodlebank Discussion Not only as a reference for other web3 contributions, but this is something that I’d be interested in helping with within the Optimism ecosystem, for Optimism projects & communities, as well. Thanks! ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.375
                },
                {
                    "author_link": "https://gov.optimism.io/u/ckt",
                    "index": "7",
                    "likes": "0",
                    "time": "15/02/2023-10:26:09",
                    "content": "Following up with some comments after our conversation with @Gonna.eth:  More about our team Our team has extensive technical experience architecting and implementing complex products at both large and small scales. At one end of the spectrum, co-founders CKT and 0xYungApple were previously on the same team at Google as Product and Engineering Leads, respectively, building for millions of users at global scale on teams like NBU (Next Billion Users), Google Pay, and Verily (part of Alphabet). Most of our senior engineers also hail from “big tech”, including TikTok, Tencent, and others. On the other end of the spectrum, CKT and 0xYungApple also have experience building rapidly at startups, with CKT having been the lead front-end developer (and co-founder/CEO) for two separate startups – the first of which (Opez) went through YCombinator S2011 – while 0xYungApple was the VP of Engineering (and co-founder) of a healthtech startup (Aurora Health). From an education perspective, CKT studied math & economics at Yale, while 0xYungApple studied computer science, has a Masters in cryptography, and conducted cryptographic research at a national laboratory. Together, the team has made the transition from web2 to web3 over the past few years, especially as NFTs, social, and community-related web3 technologies began to proliferate. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.054197994987469
                },
                {
                    "author_link": "https://gov.optimism.io/u/ckt",
                    "index": "8",
                    "likes": "0",
                    "time": "15/02/2023-10:26:48",
                    "content": "(Continued, @Gonna.eth)  More about our company Fam was established at the beginning of 2022 (with groundwork laid in late 2021), and we have raised a pre-seed round that included investors such as Alliance, Xoogler, and a number of notable angels across web2 and web3. All members of the team are working on Fam full-time. ",
                    "links": [
                        "https://xoogler.co/"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/ckt",
                    "index": "9",
                    "likes": "0",
                    "time": "15/02/2023-10:27:22",
                    "content": "(Continued, @Gonna.eth)  More about our business Fam provides community infrastructure to web3 projects, especially NFT projects. We currently have a growing number of partners (“official” communities) using our platform (e.g. Doodles, Pudgy Penguins, etc.) – including paid communities, who derive value from the premium features (e.g. moderation, bots, advanced events features) that we offer them on top of our basic community tools. Our growth thus far has been mostly organic and based on word-of-mouth – users seeing other users utilizing our community management tools, especially around event organization and coordination, and reach out to us. ",
                    "links": [
                        "https://pudgypenguins.com/"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.9375
                },
                {
                    "author_link": "https://gov.optimism.io/u/ckt",
                    "index": "10",
                    "likes": "0",
                    "time": "15/02/2023-10:28:06",
                    "content": "(Continued, @Gonna.eth)  More about our engagement One of our most popular features is our decentralized community calendar (e.g. Pudgy Penguins - Community Calendar), where projects can aggregate all ongoing activities in their community and share it with community members (e.g. in Discord, Twitter, using links or the downloadable example below). The calendar is open for members of the community to contribute to it themselves, as well as RSVP, get event tickets, and chat with other attendees. We continue to build new features to support our communities (in both free and premium tiers), with a strong roadmap of engagement-oriented features in the pipeline, revolving around events (online and IRL) and connecting with other members.  1600×976 178 KB  ",
                    "links": [
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/f/fe4c4fd6085a1aca06527a228745ea7da122be4c.jpeg"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.288720538720538
                },
                {
                    "author_link": "https://gov.optimism.io/u/FractalVisions",
                    "index": "11",
                    "likes": "0",
                    "time": "15/02/2023-16:06:05",
                    "content": "Hey  @ckt thanks for all the information here! We are waiting on an update for the grant application going into cycle 11 so I suggest you wait on that to restructure this grant for the next round of consideration. I am curious! Is this platform is free or plans on implementing a paid for model? What is stopping the Fam app from adding Optimism NFTs onto the platform currently? There are many competitor platforms similar to this one and want to know exactly how users will be incentivized to use the Optimism network in contribution to the overall growth. Is there any sort of marketing plan involved? I do not see how each milestone relates to incentivizing sustainable usage and liquidity on Optimism. What the council is looking for here on the milestones with the builders grant is a firm commitment to generating liquidity on Optimism and the capability to expand the number of users on the network with some sort of educational campaign about Optimism NFTs or network to help raise awareness.     ckt:  Fam is an instance of a class of public goods focused on community infrastructure. Our thesis is that Fam (and other such community-focused public goods) can help Optimism become a more attractive ecosystem for projects to choose to build on, especially projects looking for the type of “consumer-facing” communities that we’ve seen become popular with ETH-based NFT projects. Our belief is that investing in such public goods – ones that facilitate community – is an important (and in some ways more sustainable) complement to other forms of user incentivization (e.g. financial), since there is built-in utility, network effects, and stickiness associated with the communities that get built, and which serve as the foundations for organic growth.   Impact = Profit The impact over profit model is a very important part of how the ecosystem on optimism works. Whether that is through the form of donation or free education. The impact must outweigh the profit. How is there a contribution being made to public goods or what makes you consider fam a public good ? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.8540322580645165
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "12",
                    "likes": "2",
                    "time": "15/02/2023-19:07:04",
                    "content": "    FractalVisions:  We are waiting on an update for the grant application going into cycle 11 so I suggest you wait on that to restructure this grant for the next round of consideration.   Hey, Fractal I had a call with the Fam. team yesterday to asses some of the missing parts of their proposal and I’m incorporating all this feedback for Cycle 10. Please try not to confuse participants. I do appreciate all the questions you made below that comment. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.333333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "13",
                    "likes": "2",
                    "time": "15/02/2023-19:10:39",
                    "content": "    FractalVisions:  What the council is looking for here on the milestones with the builders grant is a firm commitment to generating liquidity on Optimism and the capability to expand the number of users on the network with some sort of educational campaign about Optimism NFTs or network to help raise awareness.   This is inaccurate. The growth committee is for maximizing users. The builder’s committee is to support developer teams, maximize developers in the Optimism ecosystem and also combine this with marketing for their projects. If you refer to “The council” I’ll advise adding things like “I think the council” or “Maybe the council” to clarify this is your opinion and not a council statement. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.125
                },
                {
                    "author_link": "https://gov.optimism.io/u/FractalVisions",
                    "index": "14",
                    "likes": "1",
                    "time": "15/02/2023-21:51:06",
                    "content": "Sure thing. It gets really confusing sometimes trying to decipher these grants. I think the original ask kept popping up as I refresh the page for some reason making me think this was for the growth experiment grants even though I read the revisement. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.958333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/FractalVisions",
                    "index": "15",
                    "likes": "1",
                    "time": "15/02/2023-21:53:50",
                    "content": "Sorry. I certainly didn’t know that. I am not trying to cause any confusion. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.2857142857142865
                },
                {
                    "author_link": "https://gov.optimism.io/u/TheDoctor",
                    "index": "16",
                    "likes": "2",
                    "time": "15/02/2023-22:34:06",
                    "content": "    ckt:  web3 contributions, but this is something that I’d be interested in helping with within the Optimism ecosystem, for Optimism projects & communities, as well.   That sounds great. I think is important to act an feel as a part of the OP community ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 7.416666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "17",
                    "likes": "1",
                    "time": "16/02/2023-00:49:40",
                    "content": "I know you don’t some times happens I have my history of mess ups myself  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.125
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "18",
                    "likes": "2",
                    "time": "23/02/2023-13:18:56",
                    "content": "Hi, @ckt thank you for all the extra info you gave us. I wanted to bring awareness of a new Milestone Assessment the Grants Council added. It is not mandatory for cycle 10 but you could get a better score on the final review if you implement it. Again thank you for the effort you guys are putting into this proposal! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.795454545454546
                },
                {
                    "author_link": "https://gov.optimism.io/u/ckt",
                    "index": "19",
                    "likes": "1",
                    "time": "27/02/2023-08:43:33",
                    "content": "Thanks, Gonna!  I’ve reformatted the milestones we had before to fit the new Milestone Assessment framework: Critical Milestones: I. Support for Optimism  Estimated timeline: Grant Approval + 2 months Conditions for granting:  Verify that Optimism NFT projects are indeed supported by Fam Can verify by creating and viewing a Fam that is token-gated based on an OP-native NFT (including, e.g., one that Fam mints itself for purposes of such proof)   Proposed % of tokens granted (NOT transferred, per 1-year lockup): 50%  II. First Optimism Project(s) using Fam  Estimated timeline: Milestone I. (above) + 2 months Conditions for granting:  Creation of Fams for at least two OP-native NFT projects Gather feedback and ensure that Fam meets the needs of the Project   Proposed % of tokens granted (NOT transferred, per 1-year lockup): 50%  This milestone is important enough that it should be considered to be a Critical Milestone.  If, after building support for OP we are unable to get any OP-native NFT projects on Fam (within a reasonable timeframe, e.g. 2 months or so), then we should reconsider if the investment has brought enough value to the OP ecosystem to be worth the full grant amount. Benchmark Milestones: III. 10+ Optimism Projects using Fam  Estimated timeline: Grant Approval + 6 months Conditions for achieving:  Being able to verify that we have set up Fams for 10+ OP-native projects (e.g. from this list or otherwise: Non Fungible Tokens On Optimism)    We believe that in a reasonable base-case scenario we should be targeting having at least 10 OP-native projects using Fam within the first half year of launching on Optimism.  Certainly, we would even hope that we exceed that. IV. 500+ Users (Members) joining Optimism Project Fams  Estimated timeline: Grant Approval + 6 months Conditions for achieving:  Viewing the Members Lists for OP-native projects on Fam (and/or via reporting of Fam) and verifying that there are at least 500 members total    In the event that there are at least 10 OP-native projects on Fam, we would hope that each of them is able to attract 50 registered members each on average, totalling around 500 members.  Again, we hope to exceed this in order to prove out the value of our platform and engagement model, but this would be a reasonable base case. (Original)     ckt:  I. Support for Optimism: 50%  Estimated timeline: Grant Approval + 2 months Conditions for granting:  Verify that Optimism projects are supported by Fam Can consider if it still makes sense to proceed based on results and ecosystem interest    II. First Optimism Project using Fam: 25%  Estimated timeline: Milestone I. (above) + 1 month Conditions for granting:  Gather feedback and ensure that this meets the needs of the Project before moving on / funding    III. Second Optimism Project using Fam: 25%  Estimated timeline: Milestone II. (above) + 1 month Conditions for granting:  Likewise gather feedback and ensure that this meets the needs of the Project Also circle back up with first Project to ensure still meeting their needs      ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.306803150553151
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "20",
                    "likes": "2",
                    "time": "28/02/2023-00:36:34",
                    "content": "awesome I updated my final score thank you! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                }
            ]
        }
    ],
    "group_index": "502"
}