{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/conduit-protocol-providing-seamless-trading-experience-for-synthetix-perps-v2/5485",
            "title": "Conduit Protocol - Providing Seamless Trading Experience for Synthetix Perps V2 ",
            "index": 5485,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Grants Council"
            ],
            "tags": [
                "growth",
                "cycle-11"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/Conduit",
                    "index": "1",
                    "likes": "10",
                    "time": "07/03/2023-16:25:58",
                    "content": "Basic Details  image1500×500 28.2 KB  Project name: Conduit Author name and contact info (please provide a reliable point of contact for the project.): Nate the Noble - Marketing Lead | TG: @NTN3017 | Discord: Nate The Noble#3017 DogeX - Policy Lead | Discord: DogeX#6195 L2 recipient address: oeth:0x463A522F657e1c591c495d688c8627bA2d9342dE Which Voting Cycle are you applying for?: Season 3, Cycle 11 I confirm that I have read the landing pages for the Builders 5 and Growth Experiments 7 Sub-Committees and that I have determined my proposal is best suited to be reviewed by the Growth Experiments Sub-Committee: [Yes/No]: Yes I understand that Growth Experiments grants are subject to a “no sale rule,” as explained in this post 4, and I have read the terms of the rule: [Yes/No]: Yes Project Details What are you building?: Conduit is a novel front-end for Synthetix Perps V2 aiming to greatly improve the overall trading experience, thereby driving additional robust volume for Synthetix on Optimism. Specifically, Conduit adds the following neat features for Synthetix perps:  Fully modular UI Multiple language support In-depth charting & interactive order executions Order types, i.e. stop loss, limit buy Theme toggles General improvements to trade execution, relative to current market leaders   image1277×780 55.9 KB  Why do you believe what you are building is going to succeed?: We have analyzed the market gap and listened to the traders’ need for a friendly, personalized UX/UI, the ability to pull in high leverage and cost optimization to execute trading strategies for any trader from the basic to intermediate level. With a user centric approach that aims to solve the main pain points that the traders have, Conduit has been built from day one with a goal of providing a seamless trading experience. Throughout the building process, the team has sought feedback from traders as well as the Synthetix team. The results have been stellar and Conduit will be working closely with the Synthetix team to be the primary front-end operator. Aside from the product itself, Conduit is maintained by team members originating from Concave - a builder’s cooperative that builds and invests in novel DeFi products. With Concave as the supporting arm, Conduit leverages a 30+ strong capable team with years of runway - excluding revenues. How many users does your project have currently? Please include how you arrived at this estimate: The project started with teasers on the 2nd day of March 2023 and gained a large traction of 1000 followers during the first 48 hours. The sporadic growth was totally organic and had no paid reach. We currently stand at between 5k-10k reach per post and we see the potential in guerilla marketing, with psy-ops which was what garnered Concave’s 30k followers. That said, Conduit will integrate into Synthetix perps back end to enhance the end users interface experience; therefore, the immediate addressable market is at least as large as Synthetix. In addition to that, Concave’s community, which stands at over 30,000 strong across Twitter & Discord, will bolster day-one Conduit user base substantially. As of March 6th, the Conduit Discord and Twitter stand at over 1,700 members and ~900 Twitter followers, which we expect to grow significantly as the front-end becomes available for users in the immediate future. How will receiving a grant enable you to further the mission of maximizing the number of users interacting with Optimism? Please include a step-by-step flow of how you imagine this grant can lead to a greater number of user interactions with Optimism: By receiving a grant, Conduit will be able to offer lucrative trading fee rebates which will be instrumental in attracting liquidity and overall users. The exact flow is as follows:   OP Incentives are announced for traders trading on Conduit, reducing trading fees significantly.   Conduit will integrate into Synthetix perps back end to enhance the end users interface experience., allowing Synthetix users to experience a progressive and intuitive interface. Listening to our users is paramount, as it serves as the root to user stickiness and, by extension, content users.   As part of converting existing Optimism Synthetix users, there are still three times as many Ethereum Synthetix users that may opt for Optimism.   With a growing user base, additional market participants from other perpetual-based protocols also begin to try out Conduit, driving significant growth for Synthetix and Optimism as a whole in terms of TVL, volume and fees.   Tell us about the users you plan to target with this grant. Include any defining characteristics that will help you identify and target them.:  Active SNX Traders/Hedgers - Targeting existing Synthetix perp users (KWENTA, Decentrex) Prospective Perp Traders - Other perpetuals platforms are also a target acquisition base; particularly, users from the GMX, Gains and dYdX ecosystems Concave’s DeFi user base with over 30,000 members DeFi users who are new to L2 & perpetuals  How would these users interact with Optimism? For how long?: Conduit’s essential targets are to retain users by offering a superior and fully customizable UI/UX experience in addition to the advantages of Optimism’s lightning fast network and Synthetix’ competitive fee rates. Users who utilize the front-end will be interacting with Optimism by using Synthetix’ Perps V2. Provide us with links to any of the following for the project:  Demo: https://alpha.conduit.lol/  Website: https://www.conduit.lol/  Twitter: https://twitter.com/ConduitFi  Discord: https://discord.gg/conduit  Github: Front-end github remains private for competitive edge. Here is the contract repo: synthetix-docs/addresses.md at master · Synthetixio/synthetix-docs · GitHub  Technical/Economic Documentation: (To be released) Other: N/A  Do you have any metrics on the project currently? (TVL, transactions, volume, unique addresses, etc. Optimism metrics preferred; please link to public sources such as Dune Analytics, etc.): The project platform itself has not yet been officially published, and as such the metrics requested are not available at this point. We will be able to update Optimism Collective once it’s available. Who are your competitors, and are they on Optimism?: Below is a list of protocols we deem direct competitors:  Kwenta - Optimism Decentrex - Optimism GMX - Arbitrum, Avalanche Gains Network - Arbitrum / Polygon Vela - Arbitrum dYdX - Starkware / dYdX Chain  Please link to code audits (if any):   github.com   Synthetixio/synthetix-docs/blob/master/content/releases.md !!! tip \"Notice\"      Imported from https://github.com/Synthetixio/synthetix/releases  # Schedar (v2.83.1)  **Published**: Feb 15, 2023  **Codebase**: [v2.83.1](https://github.com/Synthetixio/synthetix/tree/v2.83.1)  > - [SIP-255: Burn fees instead of distributing them](https://sips.synthetix.io/sips/sip-255/)  > Audit: https://iosiro.com/audits/synthetix-schedar-release-smart-contract-audit  ## Release notes  - The sUSD fees collected by the FeePool are now burned at the close of the fee period, effectively reducing user debt automatically instead of having to manually claim the synths.  ---        This file has been truncated. show original      Team Who are your founders?:  Shanghigh - Engineering Lead & Project Lead | TG: @shanghigh9 | Discord: Shanghigh#9999 Nate the Noble - Marketing Lead | TG: @NTN3017 | Discord: Nate The Noble#3017 Triton - Design Lead | TG: @triton7788 | Discord: triton#2516 DogeX - Policy Lead | Discord: DogeX#6195  What makes your team well-suited to carry out the project described in this proposal? All team members listed in the previous prompt originate from the same project, Concave (https://concave.lol/). Conduit is an effort supported by Concave as a whole; the team has been working together, running a tight ship for over a year from delivering impactful solutions to a changing DeFi landscape. With years of runway (excluding revenues), 11mm assets under management and specialists ranging from tokenomics to marketing to engineers, the team is well-equipped to make Conduit a significant success for Synthetix and the broader Optimism ecosystem as a whole. Significant efforts were made to aggregate ideal product market fit - for a product of this type, ultimately traders themselves must find the platform convenient and frictionless. Based on the internal research undertaken within the context of perpetual futures, trading platforms, the Synthetix ecosystem and Optimism’s lightning fast L2 network, the Conduit team has already received highly positive and encouraging feedback, which keeps us grounded and up to date. Is this your first Web3 project?: No at all. We have experience with creating, sustaining and operating Concave. The team has developed a novel “Smart Bonding” mechanism as well as a unique liquid staking solution that incentivizes long-term aligned stakeholders. Concave is a builder’s cooperative that builds and invests in novel DeFi products - this gives us the benefit of being exposed to various Web3 projects that require our expertise both intrinsically and extrinsically. Individually, some of us have also been part of other prominent projects, such as OlympusDAO. If not, what else have you built? (Share links, Github repository, or any other useful information.): All team members working on the project actively work on Concave (as well as Conduit). Link: https://concave.lol/ Grant Request What is the size of the grant request? (250k OP max): 250,000 OP How do you justify the size of the grant?: The grant money utilized aims to provide an opportunity to attract significant new TVL, users and volume to the Optimism ecosystem, of which the incentives issued will pay for itself in the long-term. Moreover, the grant size will allow Conduit to maintain competitiveness with respect to other front-end operators and other competitors that have already received grants. How much will your project match in co-incentives? (not required but recommended, when applicable): N/A - at the time of the application, Conduit does not have a token so we are not able to match incentives ourselves. Roadmap and Distribution Plan Describe in discrete steps how you will successfully implement your grant plan: Building on the success of initial marketing initiatives that have brought a sturdy amount of initial users, Conduit will continue pre-launch marketing campaigns which include referral-based contests, role grinding on Discord for completing tasks, co-marketing efforts with other protocols and/or prominent folk and other similar verticals. Internally, we are currently measuring growth in users across our socials in preparation for the Conduit beta. The feedback gathered from the beta will be instrumental in the future growth of Conduit in terms of market share and overall volume. Ultimately, we aspire to be front-end operators that understand the demands and desires of all relevant stakeholders within the (Synthetix) derivatives ecosystem - as user feedback flows in from the beta, Conduit is prepared to iterate in furtherance of the best derivatives front-end. In addition to collecting valuable feedback, there is significant added benefit for Conduit as it pertains to additional user acquisition and active participation - when users are presented with a product that values their individual feedback, there is a great propensity to share that experience both on socials and within the existing community. Upon successful completion of the implementation of feedback from users (the end of the beta), Conduit opens its doors for the public. The run-up to launch and the post-launch operations are focused on additional user growth via effective leveraging of existing partners/influencers the team has access to. Various reward mechanisms will be implemented to encourage engagement and participation. During this stage, Conduit additionally aims to introduce significantly lower trading fees made possible by the grant - this serves to attract and ultimately convert a larger audience of veteran and junior traders alike into the Optimism and Synthetix ecosystems. Through the accomplishment of the above plan, the Conduit team is confident that overall protocol usage will be high on a consistent basis and that incentives will be unnecessary to sustain growth. How will the OP tokens be distributed? (please include % allocated to different initiatives such as user rewards/marketing/liquidity mining. Please also include a justification as to why each of these initiatives align with the problem statement this proposal is solving. Distribution should not include the sale of any tokens by the grantee or the use of tokens for compensation, protocol expenses, etc. See the no sale rule here 3): Migration Incentives: 200,000 OP - 80% Trading Contest: 50,000 OP - 20% Ultimately, the OP received is best utilized in incentivizing the market to use the Conduit front-end. That said, there is additional value in hosting a trading competition with lucrative top prizes to incentivize more trading activity on the platform. Over what period of time will the tokens be distributed for each initiative?: The Migration Incentives will be active shortly after receiving the grant and will remain active as long as there are tokens to issue for trading rebates; in short, the time the tokens will be issued is a function of trading volume. The trading contest is a planned event that will run over the course of a few weeks. Please provide benchmark milestones for this project. These milestones should guide the Optimism community on the progress of your project throughout your work on the project. Do not use distribution of the grant itself as a milestone:   Become the primary front-end operator for Synthetix products   Acquire at least 25% of the traffic of front-end operators for Synthetix Perps V2, leveraging the existing Concave & Synthetix community for the initial growth   Acquire at least 50% of the traffic of front-end operators, at which time Conduit considers activating the fee switch   Provide support not just for futures, but also options contracts   Please define critical milestones for this project. Critical milestones are meant to show good-faith efforts to accomplish the project. Non-completion of these milestones could lead to revocation of remaining grant rewards. Do not use distribution of the grant itself as a milestone:   Successful completion of a closed-beta involving Concave community members, inclusory of feedback items stemming from the testing period   Acquire at least 25% of the traffic of front-end operators   Activate the fee switch after a few months of stable growth   If the OP tokens are for direct distribution to users, why will incentivized users and liquidity on Optimism remain after incentives dry up?: The OP tokens will be utilized to jumpstart the service to life, but it is not a necessary component for Conduit in the long-term. The team has monitored other protocols and respective grant strategies to observe what works and/or can be improved. Through our analysis, the current Conduit plan includes provisions to prevent sybil attacks and wash trading by directing OP tokens based on the actual fees accrued, not the volume traded. The Conduit team is fully focused on providing seamless trading experience to traders while remaining extremely competitive in the space. We are traders and investors ourselves, and have participated in various areas of trading gamification in the space. We understand what makes traders tick and are highly confident in creating funnels that draw in traders and retain users on Conduit - there will be various growth plans for this purpose. Combining this with Conduit’s fluidity and utility of the front-end presented, it greatly minimizes the desire for traders to look for an alternative. Please provide any additional information that will facilitate accountability (smart contracts addresses relevant to the proposal, relevant organizational wallet addresses, etc.): oeth:0x463A522F657e1c591c495d688c8627bA2d9342dE Optimism Relationship Does your project solve a problem for the Optimism ecosystem? If so how?: Traders deserve the best market tools and interfaces; specifically, both Synthetix and OP community members have often asked for an intuitive and customizable alternative to current front-end operators, which is exactly what Conduit aims to address. Why will this solution be a source of growth for the Optimism ecosystem?: The penultimate goal is for Conduit to emerge as the premiere front-end choice of perpetual contract offerings, and as such, Optimism greatly benefits from having that front-end hosted on an Optimism-deployed dAPP. The market demands an individualized and fully modular Perps V2 front-end, Conduit provides. Is your project Optimism Native?: Conduit will be launching on Optimism with no immediate plans to expand beyond. Confirmations I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: [Yes/No]: Yes I understand that I will be expected to following the public grant reporting requirements outlined here: [Yes/No]: Yes ",
                    "links": [
                        "https://foul-porch-0eb.notion.site/Builders-Sub-Committee-02ba9da5b4534fbf955e6e4c8fcf1aa3",
                        "https://foul-porch-0eb.notion.site/Growth-Experiments-Sub-Committee-270d2f75ff0f410a869b2ba6a8324006",
                        "https://gov.optimism.io/t/grant-proposal-template/3233",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/9/91fdd75ba81082e865dca178a686c0d6cb389286.png",
                        "https://alpha.conduit.lol/",
                        "https://www.conduit.lol/",
                        "https://twitter.com/Conduitfi",
                        "https://discord.gg/zeAZEFfVe4",
                        "https://github.com/Synthetixio/synthetix-docs/blob/master/content/addresses.md",
                        "https://github.com/Synthetixio/synthetix-docs/blob/master/content/releases.md",
                        "https://github.com/Synthetixio/synthetix-docs/blob/master/content/releases.md",
                        "https://github.com/Synthetixio/synthetix-docs/blob/master/content/releases.md",
                        "https://concave.lol/",
                        "https://concave.lol/",
                        "http://calendar.google.com/calendar/u/0/r?tab=mc",
                        "https://gov.optimism.io/t/suggested-public-reporting-requirements-for-grantees/4176"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5534431578621035
                },
                {
                    "author_link": "https://gov.optimism.io/u/thuat19",
                    "index": "2",
                    "likes": "3",
                    "time": "07/03/2023-17:54:01",
                    "content": "I’m looking forward to Conduit with new things ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.681818181818182
                },
                {
                    "author_link": "https://gov.optimism.io/u/nangolilla",
                    "index": "3",
                    "likes": "2",
                    "time": "07/03/2023-21:05:00",
                    "content": "Let’s gooo! Great news! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/ezra",
                    "index": "4",
                    "likes": "1",
                    "time": "07/03/2023-22:34:42",
                    "content": "Great protocol with some features i’ve never seen. Seems like a blue chip project on Optimism ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/engsudal",
                    "index": "5",
                    "likes": "1",
                    "time": "08/03/2023-10:44:35",
                    "content": "great idea conduit get a king of optimism ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/maloon",
                    "index": "6",
                    "likes": "1",
                    "time": "08/03/2023-19:07:51",
                    "content": "Cant wait for Conduit to be working! 100% Success ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/nemonasa",
                    "index": "7",
                    "likes": "1",
                    "time": "09/03/2023-01:26:29",
                    "content": "Gonna Make an article out of this. IBelieve on those Core Team. Working hard everyday on Concave. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.770833333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/CryptoKachu",
                    "index": "8",
                    "likes": "1",
                    "time": "09/03/2023-01:49:47",
                    "content": "Great proposal. It will make synergy with the Optimism ecosystem! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/K_516",
                    "index": "9",
                    "likes": "1",
                    "time": "09/03/2023-02:36:14",
                    "content": "I’ve heard about Concave and been impressed with what they did. Optimism is great, however, the perp trading volume is not as famous as its competitor Arbitrum. That’s SAD… I Hope Conduit can help leverage Synthetix v2 and also the whole Optimism Ecosystem! Can’t wait to read more details and try your beta product <3 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.375
                },
                {
                    "author_link": "https://gov.optimism.io/u/RageAgainstEVM",
                    "index": "10",
                    "likes": "1",
                    "time": "09/03/2023-13:21:16",
                    "content": "Yes, I totally agree with this. New snx frontend to use ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.340909090909091
                },
                {
                    "author_link": "https://gov.optimism.io/u/Bambius",
                    "index": "11",
                    "likes": "1",
                    "time": "09/03/2023-13:22:39",
                    "content": "I support this grant. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Doogie69",
                    "index": "12",
                    "likes": "1",
                    "time": "10/03/2023-20:20:07",
                    "content": "The concave team have proven their ability to build. Looking forward to this next step. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/devranjan",
                    "index": "13",
                    "likes": "1",
                    "time": "13/03/2023-06:43:43",
                    "content": "This is going to be on of the top DEX on Optimism. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                }
            ]
        }
    ],
    "group_index": "573"
}