{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/gf-phase-0-proposal-aave/1712",
            "title": "[GF: Phase 0 Proposal] Aave ",
            "index": 1712,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Governance Fund: Phase 0"
            ],
            "tags": [
                "cycle-1",
                "passed"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/helloshreyas",
                    "index": "1",
                    "likes": "31",
                    "time": "27/05/2022-18:30:33",
                    "content": "Project Name: Aave Author Name: Llama (@dydymoon, @HelloShreyas) DefiLlama TVL at snapshot: $1,790,756 Transactions/Day at snapshot: 38 Tiers: 3 Optimism native: No Number of OP tokens to claim: 300,000 OP L2 Recipient Address: 0xcd150D9CFDb39D287D69B9b1bb7111E58414aCA8 Proposal for token distribution: Distribute OP tokens to Aave Grants DAO to help grow Aave and Optimism. Rationale: Aave is a decentralized non-custodial liquidity market protocol where users can participate as depositors or borrowers. Aave v3 was deployed on Optimism two months ago and the current TVL is $7m. The goal of this proposal is to explain how to use this grant to increase the growth on Aave and the Optimism Ecosystem. How will the OP tokens be distributed? The distribution would need to go through a governance vote, but the following distribution have been proposed: The 300k OP tokens will be sent to Aave Grants DAO which will focus the distribution building on Optimism Ecosystem. The specific allocation will be decided by AGD, but roughly we expect two-thirds to go to builders rewards and one-third to events focused on the Optimism ecosystem. Builders rewards - 200,000 OP (2/3rd of total) Aave Grants DAO will allocate 200k OP to involve the community by distributing grants to build on top of Aave V3 Optimism and grow the OP ecosystem. Any builder can apply for technical or non technical projects and will be eligible for a share of the rewards. Events (focused on Optimism ecosystem) - 100,000 OP (1/3rd of total) Aave Grants DAO represents the Aave protocol in many DeFi events, which could be sponsored and receive hackathon prizes.  Aave Grants sponsored events  Tokens will be used to either sponsor DeFi events and highlight Optimism or help fund Optimism focused events.   Hackathon prizes  Tokens will be distributed to builders as prizes for building on Optimism for the next hackathons.    How will this distribution incentivize usage and liquidity on Optimism? Aave Grants DAO will allocate OP rewards innovation and product development. This will help the growth of the ecosystem and improve liquidity on Optimism. Why will the incentivized users and liquidity remain after incentives dry up? Aave protocol is deployed on many chains including Optimism, and has already reached $7m TVL. Moreover, most of this grant is allocated to improve Aave on OP and build on top of it which should bring more users. Once these users become regular users of the Optimism ecosystem, they might become loyal users to the ecosystem and will not leave easily, as we can see on other networks eligible for LM programs such as Polygon or Avalanche. Over what period of time will the tokens be distributed?  Optimism Grants: 6 to 12 months depending on OP price Events & Sponsoring : around 6 months depending on OP price  How much will your project match in co-incentives? Aave Grants DAO has been allocated a $6m budget, which should help match the allocated rewards for builders. ",
                    "links": [
                        "https://gov.optimism.io/t/op-grants-through-season-2-where-has-the-op-gone/4025/6"
                    ],
                    "GPT-summary": "The post is a proposal for token distribution for the Aave project on the Optimism network. The author explains the proposal and how the OP tokens will be distributed to Aave Grants DAO to help grow Aave and Optimism. The post also includes information on how the distribution will incentivize usage and liquidity on Optimism, and how long the tokens will be distributed. A 3rd party could give constructive criticism or ask questions about the proposal, and the author is not advertising the proposal.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Interoperability and Scaleability",
                        "Token economics",
                        "Community and engagement",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.713541666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "2",
                    "likes": "11",
                    "time": "27/05/2022-18:32:50",
                    "content": "    helloshreyas:  The 300k OP tokens will be sent to Aave Grants DAO which will focus the distribution building on Optimism Ecosystem. The specific allocation will be decided by AGD, but roughly we expect 70% to go to builders rewards and 30% to events focused on the Optimism ecosystem.   Distribution by DAO. Solid proposal. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.833333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/web3magnetic",
                    "index": "3",
                    "likes": "4",
                    "time": "27/05/2022-18:39:26",
                    "content": "Allocating OP emissions towards Aave Grants sponsored events that highlight Optimism network, and towards hackathons for building on Optimism are great strategies to direct OP distribution towards. Optimism would stand to benefit immensely from Aave Grants DAO’s  vast expertise in public goods funding. Strongly in support of this proposal. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.111111111111112
                },
                {
                    "author_link": "https://gov.optimism.io/u/Defi_LATAM_axlvaz",
                    "index": "4",
                    "likes": "7",
                    "time": "27/05/2022-19:18:02",
                    "content": "Very good proposal and transparent since the $OP sharing will be through the DAO. On the other hand, Aave is at stage 0 according to the table proposed by optimism.   docs.google.com    [PUBLIC] Optimism Governance Fund: Phase 0 Distribution Phase 0 Distribution  Contract / Type,# Tx/day,TVL (DefiLlama),Tier,OP Native,Tier distribution (in OP),Final OP Distributed Perpetual...      The title says Phase1, I think they should correct it. ",
                    "links": [
                        "https://docs.google.com/spreadsheets/d/1kiMnAKXTxrmoL7duvLrDlhMfa35HGE55QgUK0Rq2Sso/edit#gid=1014306106",
                        "https://docs.google.com/spreadsheets/d/1kiMnAKXTxrmoL7duvLrDlhMfa35HGE55QgUK0Rq2Sso/edit#gid=1014306106"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None"
                    ],
                    "Sentiment": 6.308333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/helloshreyas",
                    "index": "5",
                    "likes": "1",
                    "time": "27/05/2022-19:24:09",
                    "content": " The title says Phase1, I think they should correct it.  Thanks, changed to phase 0! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/Justin",
                    "index": "6",
                    "likes": "1",
                    "time": "29/05/2022-06:32:01",
                    "content": "In contrast to some other proposals that incentivize builders, the Aave proposal commits to incentivizing optimism specific builders.  Given their track record, it is a worthy endeavor for the OP community support. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.347222222222222
                },
                {
                    "author_link": "https://gov.optimism.io/u/harryDeth",
                    "index": "7",
                    "likes": "0",
                    "time": "29/05/2022-07:43:33",
                    "content": "lets go op  we will do it ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/fig",
                    "index": "8",
                    "likes": "3",
                    "time": "31/05/2022-14:25:37",
                    "content": "@helloshreyas is a true luminary in the space and focuses on benefiting multiple ecosystems at once. As a reviewer at Aave Grants DAO, there is clear demand for funding and building on L2 applications. Aave and the grants ecosystem seems like a fitting investment of these OP funds. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.1875
                },
                {
                    "author_link": "https://gov.optimism.io/u/Bobbay_StableLab",
                    "index": "9",
                    "likes": "1",
                    "time": "31/05/2022-20:20:42",
                    "content": "Aave grants DAO does some great work. This is a great idea and gives a win-win for both Aave and Optimism. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Jeremylau",
                    "index": "10",
                    "likes": "1",
                    "time": "04/06/2022-06:25:58",
                    "content": "AAVE has made outstanding contributions to DAOs and social platforms. Optimistic and AAVE should strengthen more in-depth cooperation! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.930555555555555
                },
                {
                    "author_link": "https://gov.optimism.io/u/jjlee710",
                    "index": "11",
                    "likes": "0",
                    "time": "24/06/2022-04:40:25",
                    "content": "i am happy to hear that Aave wants to be with optimism eco. i support you. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/chicco",
                    "index": "12",
                    "likes": "0",
                    "time": "26/06/2022-16:14:21",
                    "content": "My God AAVE the best project ever guys! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/eynno",
                    "index": "13",
                    "likes": "0",
                    "time": "15/07/2022-01:25:46",
                    "content": "This is a solid proposal. Good to bring the project into the Optimism ecosystem. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/thesleeper",
                    "index": "14",
                    "likes": "0",
                    "time": "05/08/2022-01:34:52",
                    "content": "Nice and clear especially doing by DAO. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.166666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "15",
                    "likes": "0",
                    "time": "13/09/2022-18:28:09",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "16"
}