{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/review-gf-phase-1-interest-protocol-post-deployment/2968",
            "title": "[REVIEW] [GF: Phase 1] Interest Protocol Post-Deployment ",
            "index": 2968,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Governance Fund: Phase 1"
            ],
            "tags": [
                "cycle-6"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/GFXlabs",
                    "index": "1",
                    "likes": "1",
                    "time": "13/07/2022-18:07:06",
                    "content": "Project Name: Interest Protocol Author Name & Contact: GFX Labs; governance@gfxlabs.io L2 Recipient Address: 0xa6e8772af29b29B9202a073f8E36f447689BEef6 I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant : Yes Number of OP tokens requested: 240,000 Category: DeFi Is this proposal applicable to a specific committee? Yes. One of the DeFi Committees. Project Description: Interest Protocol is a fractional reserve, overcollateralized borrowing protocol. IP software allows users to permissionlessly generate USDi stablecoins against their collateral assets. Users may also swap USDC for USDi (and vice versa) at a 1:1 exchange rate through the protocol. All USDi utilize rebasing to report accrued fees. USDi accrues through fees paid by borrowers. Project Links: Website Twitter Discord Please link to any previous projects the team has meaningfully contributed to: To avoid forum clutter, this can be disclosed privately upon request. Relevant Usage Metrics: On Ethereum, Interest Protocol ranks 118th in TVL after less than 1 month, and $3.9m in overcollateralized loans (both at time of writing). Competitors, peers, and similar projects: Compound and Aave are both competitors. Similar projects (overcollateralized while also fractionally reserved) are difficult to locate. Is/will this project be open sourced? Yes. Optimism native? No. Date of deployment/expected deployment on Optimism: Ultimately up to IP governance, but this grant would likely prioritize that deployment to the immediate future. Ecosystem Value Proposition: Interest Protocol plans to support the OP token as collateral on Optimism. Interest Protocol is designed to allow tokens held as collateral to still be able to participate in governance via delegation controlled by the user. This means token holders – in particular small holders whose governance voice is not particularly loud – avoid choosing between using their OP to finance on- or off-chain priorities, or participating in Optimism governance. Has your project previously applied for an OP grant? No. But there is a separate grant request for this project for an incentives subsidy. Did the project apply for or receive OP tokens through the Foundation Partner Fund? No. Proposal for token distribution (under 1000 words): How will the OP tokens be distributed? Tokens will be distributed to incentivize borrowing usage of Interest Protocol. Note that Interest Protocol supports vote delegation by users’ collateral tokens, so users do not need to choose between governance participation and accessing value from their holdings, should they choose to place the tokens as collateral at Interest Protocol. How will this distribution incentivize usage and liquidity on Optimism? Interest Protocol will support OP as a collateral type. Interest Protocol notably allows users to delegate votes from their collateral tokens even while in the vault. This added utility combined with the fact that Interest Protocol does not lend out collateral provides a use for OP other than selling into the market. Why will the incentivized users and liquidity remain after incentives dry up? Users will hopefully retain their OP to borrow against, delegate their votes, or both. Note that Interest Protocol will support OP as a collateral, and will also allow users to continue delegating their OP while serving as collateral. The screenshot below shows what this looks like on Ethereum Interest Protocol with other governance tokens.  1094×1048 70.1 KB  Over what period of time will the tokens be distributed? The specific schedule is ultimately up to Interest Protocol governance, but 20,000 OP per week for 12 weeks to celebrate the launch on Optimism is the intention at this time. How much will your project match in co-incentives? IPT, the governance token of Interest Protocol (not yet in circulation as of writing), will be used to incentivize borrowers. IPT will at least match with OP incentives on a 25 cent price basis for IPT. ",
                    "links": [
                        "https://interestprotocol.io/#/landing",
                        "https://twitter.com/interestdefi?lang=en",
                        "https://discord.gg/BjxN6t4MXN",
                        "https://defillama.com/protocol/interest-protocol",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/9/96959709eb37a720469426c5c9131506036c6a53.jpeg",
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-overnight-fi/3536/23",
                        "https://gov.optimism.io/t/yield-bearing-staked-tokens-with-vote-rights/3634/2",
                        "https://gov.optimism.io/t/review-gf-phase-1-interest-protocol-development-deployment-to-optimism/2951/17",
                        "https://gov.optimism.io/t/review-gf-phase-1-interest-protocol-development-deployment-to-optimism/2951/4"
                    ],
                    "GPT-summary": "The post is a proposal for a grant for the Interest Protocol, a fractional reserve, overcollateralized borrowing protocol. The author explains the project, its usage metrics, competitors, and ecosystem value proposition. The proposal includes a plan for token distribution and how it will incentivize usage and liquidity on Optimism. The post also invites feedback and questions from third parties, and a third party provides positive feedback and constructive criticism.",
                    "GPT-proposal-categories": [
                        "Token economics",
                        "Interoperability and Scalability",
                        "Grants, Funding and resource allocation",
                        "Privacy, Security and risk management",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 4.925925925925926
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "2",
                    "likes": "2",
                    "time": "15/09/2022-18:21:47",
                    "content": "This falls under Defi committe review I asume. Specify it please. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/GFXlabs",
                    "index": "3",
                    "likes": "2",
                    "time": "16/09/2022-14:23:06",
                    "content": "    Gonna.eth:  Specify it please.   Can you provide a reference from the Operating Manual? This proposal is obviously something that would fall under a DeFi committee, but if stating that is required formality, we’d like to find the source to ensure we follow those guidelines precisely. Thanks! Edit: It was under the grant proposal template for anyone else looking for it. Thanks again! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/SEED_LATAM_Joxes",
                    "index": "4",
                    "likes": "1",
                    "time": "20/09/2022-02:43:49",
                    "content": "Hi @GFXlabs glad to see you here. We have seen both proposals (1. development/deployment and 2. post-deployment). Quoting from both proposals:     GFXlabs:  Date of deployment/expected deployment on Optimism: Ultimately up to IP governance, but this grant would likely prioritize that deployment to the immediate future.   In case the first one is not approved by OP governance, can you specify a little more how this proposal is affected? For example detail some drawbacks, or expected deployment in both scenarios if is possible. Thanks for considering splitting your proposals. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.58125
                },
                {
                    "author_link": "https://gov.optimism.io/u/GFXlabs",
                    "index": "5",
                    "likes": "3",
                    "time": "20/09/2022-12:33:11",
                    "content": "    SEED_LATAM_Joxes:  In case the first one is not approved by OP governance, can you specify a little more how this proposal is affected?   Deployment to Optimism would likely not be prioritized to the same extent over other work (such as collateral onboardings) if the smaller proposal is not approved. Interest Protocol has decentralized token governance, so that’s obviously just a guess since any token holder with enough IPT or delegated votes could put forth a proposal to prioritize an Optimism deployment over other work. These were broken into separate proposals to give governance the option to vote on each piece separately, since one is to defray deployment expenses and is quite small, while this proposal is targeted at more traditional co-incentivization and larger in size. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.05078125
                },
                {
                    "author_link": "https://gov.optimism.io/u/ScaleWeb3",
                    "index": "7",
                    "likes": "2",
                    "time": "27/09/2022-11:28:47",
                    "content": "Hi, this proposal is actually not yet on Snapshot. Hence, you voted for the proposal below      [REVIEW] [GF: Phase 1] Interest Protocol Development/Deployment To Optimism Governance Fund: Phase 1       Project Name: Interest Protocol  Author Name and Contact: GFX Labs; governance@gfxlabs.io  I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: Yes  Number of OP tokens requested: 31,764 OP  L2 Recipient Address: 0xa6e8772af29b29B9202a073f8E36f447689BEef6  Grant Category: DeFi  Is this proposal applicable to a specific committee? Yes. One of the DeFi Committees.  Project Description: Interest Protocol is a fractional reserve…     ",
                    "links": [
                        "https://interestprotocol.io/"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "156"
}