{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/gf-phase-0-proposal-stargate-finance/721",
            "title": "[GF:Phase 0 Proposal] Stargate Finance ",
            "index": 721,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Governance Fund: Phase 0"
            ],
            "tags": [
                "cycle-1",
                "passed"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/Tangle",
                    "index": "1",
                    "likes": "15",
                    "time": "21/05/2022-00:45:28",
                    "content": "Project Name: Stargate Finance Author Name: Tangle DefiLlama TVL (at Snapshot): $35 700 000 Transactions/day (at Snapshot): 646 Tier: 2 Optimism native: No Revisions to metrics used: N/A Number of OP tokens to claim: 1,000,000 L2 Recipient Address: 0x392AC17A9028515a3bFA6CCe51F8b70306C6bd43  Stargate Finance is a fully composable liquidity transport protocol that lives at the heart of Omnichain DeFi. At inception on March 17, 2022, Stargate launched on Optimism as one of the 7 initial Networks. Since then it has grown to 1500+ active community members as seen via Snapshot governance, and has achieved some of the following metrics:  Overall protocol transfer volume to date: $1.8B Optimism transfer volume to date: $153M Optimism transfer count to date: 11.2K transfers Optimism peak TVL: $41M  Stargate Finance has proposed OP Distribution to the Community: Snapshot  How will the OP tokens be distributed? Create a Liquidity Mining program with 700,000 OP tokens. These tokens would be emitted to help the current pool over the next 6 months. Emissions of STG have ended on the Optimism network, and this would help ensure LP’s to stay and remain incentivized. Deeper liquidity ensures users can enjoy reduced slippage as they are bridging between networks. The liquidity program should pick up from where STG emissions stopped. Offer Qualified Partners who integrate Stargate widget 300,000 OP tokens. These tokens would be provided over 6 months to qualified Partners, pending governance approval, integrating Stargate as a widget on their respective frontend on all inbound transfer to Optimism. At the end of each month, partners will have the OP Tokens distributed to them pro-rata based on the nominal USD value that their integration has transferred to Optimism. This would make sure more protocols are incentivized to deploy/support Optimism in their L2/Omnichain strategy.  How will this distribution incentivize usage and liquidity on Optimism? The Liquidity Mining program will help attract users to bring liquidity over to Optimism, and potentially retain this liquidity within the Optimism ecosystem. The Qualified Partner program will incentivize protocols looking to build on top of Stargate to deploy on Optimism as well.  Why will the incentivized users and liquidity remain after incentives dry up? LP’s find these pools attractive as they take on no IL risk as its single sided, and fees will increase as the Optimism network grows. While incentivising integrations with Stargate, users will remain using the products they’ve learned to love that use Stargate and Optimism Over what period of time will the tokens be distributed? 6 Months for Liquidity Mining, and 6 Months for Qualified Partners. This proposal helps to align the Stargate ecosystem with Optimism, and would be a great use of the OP Tokens to help increase the Optimism network, while providing incentives for Stargate users and integrators/partners. Edited based on feedback. ",
                    "links": [
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-hashflow/2461/20",
                        "https://gov.optimism.io/t/voting-cycle-1-roundup/2619"
                    ],
                    "GPT-summary": "The post is an explanation of the Stargate Finance project, which is a liquidity transport protocol that lives at the heart of Omnichain DeFi. The author proposes a distribution of OP tokens to incentivize usage and liquidity on Optimism, including a Liquidity Mining program and a Qualified Partner program. The post also mentions some metrics achieved by Stargate Finance and provides details on how the tokens will be distributed. The post may be of interest to those looking to collaborate on or advertise the Stargate Finance project, as well as those who have questions or constructive criticism about the proposal.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Interoperability and Scaleability",
                        "Token economics",
                        "Community and engagement",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.8273809523809526
                },
                {
                    "author_link": "https://gov.optimism.io/u/patrickbateman",
                    "index": "2",
                    "likes": "1",
                    "time": "22/05/2022-02:53:35",
                    "content": "Sounds like a solid proposal to me, and the bonding auction will ensure that liquidity is locked in the protocol which will facilitate transfers into Optimism in perpetuity. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Meduza",
                    "index": "3",
                    "likes": "1",
                    "time": "22/05/2022-13:31:48",
                    "content": "Seems like both sides win. Great proposal! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/wangyi",
                    "index": "4",
                    "likes": "1",
                    "time": "22/05/2022-18:21:19",
                    "content": "    Meduza:  Great proposal!   OP  will become the best L2 project in the future, we have always supported ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.333333333333332
                },
                {
                    "author_link": "https://gov.optimism.io/u/Justin",
                    "index": "5",
                    "likes": "0",
                    "time": "29/05/2022-05:07:16",
                    "content": "I wish i could understand this proposal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/nana",
                    "index": "6",
                    "likes": "0",
                    "time": "30/05/2022-01:53:13",
                    "content": "stargate is a very good project,i used it frequently,support the proposal ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.549999999999999
                },
                {
                    "author_link": "https://gov.optimism.io/u/chaosen",
                    "index": "7",
                    "likes": "0",
                    "time": "01/06/2022-14:09:01",
                    "content": "good proposal especially on stargate, OP TVL still relatively low compare other network ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.71875
                },
                {
                    "author_link": "https://gov.optimism.io/u/toranit",
                    "index": "8",
                    "likes": "0",
                    "time": "08/06/2022-10:24:51",
                    "content": "I really like Stargate, when i need to bridge stable coin this is my first choice. Easy and have many choice of both chain and token to use. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.729166666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/youyou",
                    "index": "9",
                    "likes": "0",
                    "time": "07/08/2022-13:51:18",
                    "content": "its binging.lets go to do it gogogo ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "10",
                    "likes": "0",
                    "time": "13/09/2022-18:28:03",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "636"
}