{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/recap-community-governance-call-december-6th/4268",
            "title": "Recap Community Governance Call (December 6th) ",
            "index": 4268,
            "category": [
                "\\xf0\\x9f\\x93\\xa2 Updates and Announcements",
                "Community Calls"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/jrocki.eth",
                    "index": "1",
                    "likes": "4",
                    "time": "08/12/2022-22:38:58",
                    "content": "Hey Optimists! Thanks for participating in this weeks governance call. Zoom recording – Passcode: fGQ6$n#V  Summary of discussion:    Special Voting Cycle #9a begins 12/8/2022 and ends 12/21/2022. Snapshot voting links below: –  Grants Council – Protocol Delegation Program   What to do when a forum discussion strays off the proposed topic like the Protocol Delegation Program thread? – Best course of action is for community to regulate itself by suggesting to the poster that this would be better in it’s own separate post on the forum   On Chain Voting is targeted for season 3. See this thread   The Optimism Foundation now accepting applications for the Grants Council Lead. For more information see this thread   Feedback needed: Public Reporting Requirements for Grantees – The idea here is to collect a standard set of data points from grantees and make this data publicly available to the community to build on top of and leverage for analysis. For instance, if you are on the grants council you may be leveraging this data to determine the effectiveness of prior grants to inform future grant decisions. – At some point we may need a Growth Experiments Sub-Committee:The goal of this sub-committee might be leveraged to help us determine what really effective liquidity mining and user growth incentive programs look like.   The Foundation is working on something that will provide more transparency into the foundation itself based on delegate feedback from the last call    RetroPGF Round 2 Announced!! 10 million in $OP! Read more here  ",
                    "links": [
                        "https://snapshot.org/#/opcollective.eth/proposal/0x37fc8a6ae60cff2e4e72fe9c0567f739bb9a78262c2ada236892fcbc7af2c32d",
                        "https://snapshot.org/#/opcollective.eth/proposal/0x3a1f9a30c47d6060f3b732404f3a6b2ceba3da07be0505ef0f93b6dab7fa3185",
                        "https://gov.optimism.io/t/draft-proposal-protocol-delegation-program/3946/37",
                        "https://gov.optimism.io/t/transitioning-to-on-chain-voting/4193",
                        "https://gov.optimism.io/t/grants-council-membership-information-contingent-on-special-voting-cycle-9a/4101",
                        "https://gov.optimism.io/t/suggested-public-reporting-requirements-for-grantees/4176",
                        "https://optimism.mirror.xyz/wqk1Yeyn2OhV9paDzbRXvQ0m0JYDu2npbSkMClwk1rY",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/22"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.490699404761905
                },
                {
                    "author_link": "https://gov.optimism.io/u/HCNAT0_NEU_Blockhain",
                    "index": "2",
                    "likes": "2",
                    "time": "13/12/2022-15:03:11",
                    "content": "Sharing my thoughts on few topics covered this past call: I think as a couple other ideas for when forums go off track, it may be helpful for a collapse-able option of various posts that are marked a specific way as off topic or not directly relevant to the subject. Ofc this is a dev question if our forums offers that or could update and implement that option. I also think the best idea to settle when these debates stray is just suggest hopping in discord chat and get it settled elsewhere, with more clarity as words can be misinterpreted. If we suggest simply posting new side chats of the forums I think a lot can get lost in the posts and discussions for specific actual proposals whereas discussion could help solve disputes faster. Very much agree and support the Public Reporting Requirement for Grantees, I think we just have to make sure to enforce these updates and make sure we have everything (being finalization and confirmation) that we would like so that we don’t have to consistently go back and forth with proposers on adding more information. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.632070707070707
                }
            ]
        }
    ],
    "group_index": "377"
}