{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/airdrop-1-feedback-thread/80",
            "title": "Airdrop #1 Feedback Thread ",
            "index": 80,
            "category": [],
            "tags": [
                "airdrop"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/karl",
                    "index": "1",
                    "likes": "163",
                    "time": "27/04/2022-18:37:00",
                    "content": "We would love to hear your thoughts on airdrop #1! In order to keep the feedback in one place, please reply to this thread with your thoughts and suggestions. Good feedback includes:  Suggestions for how to tune spam filters to reward real users.  Includes sybil resistance as well as improving false sybil positives.   Positive sum behaviors you think contribute to the community. Airdrop logistics (size, frequency, etc)  Please leave constructive feedback so we keep the signal to noise ratio high in here! <333 Thank you!!! ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.452414772727273
                },
                {
                    "author_link": "https://gov.optimism.io/u/Jonas",
                    "index": "3",
                    "likes": "44",
                    "time": "27/04/2022-19:36:15",
                    "content": "It’s interesting to consider what we think is positive impact behavior right now and moving forward. If we look at Optimisim as a City we want it to become denser, more poppin, we want our friends to be here, we want the cool stores to be here, we want great nightlife etc. While we want the city to be poppin, we want to maintain the quality of life - this could be largely solved thru public goods funding. Mainly, I’m curious about how opinionated the Optimism collective wants to be about incentivizing specific behavior. If the collective feels it’s fine to subsidize certain protocols, I would suggest  Incentivizing L2 bridge (f.e. Hop) liquidity to allow citizens to easily get to and from Optimism Incentivizing DEX liquidity & usage (f.e. Uniswap) so the network effects become strong enough to overtake mainnet Incentivizing efficient asset allocation f.e. using Lending protocols - people focus on TVL, but more important is that assets are productive Incentivizing deployment of contracts that are used - this could be a catch-all for the whole economy, specifically rewarding smaller projects and NFTs and tokens. But obviously easily gameable  Just a few ideas  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.371353284396763
                },
                {
                    "author_link": "https://gov.optimism.io/u/dinesheng345",
                    "index": "4",
                    "likes": "25",
                    "time": "27/04/2022-21:11:28",
                    "content": "i will give some suggestions for airdrop #1 regarding eligibilty criteria here is   At list use optimism bridge one time  to fund his account and deposit at list 0.001ETH or if not use bridge then at list deposit 0.01ETH from any other sources   make at list 5 transaction in optimism network in any type. or use optimism network at list 1days or more   total 5 transactions value is at list 5$ or more   if any one meet this criteria then we consider for optimum user airdrop apart from that repeatOptimism Users* DAO Voters Multisig Signers Gitcoin Donores Users Priced Out of Ethereum active users criteria is same who published Optimism Gateway  is good ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.338541666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/smartcontracts",
                    "index": "5",
                    "likes": "21",
                    "time": "27/04/2022-22:00:41",
                    "content": "Some suggestions here, will use this comment as my personal list of potential improvements:  Give users the ability to see a “detailed breakdown” view which will show them exactly why they were (or were not) eligible for a given category. Would significantly reduce the amount of noise in Discord where users are asking us to double check if the algorithm ran correctly (it did). Avoid vague category names like “Optimism User” or “Repeat Optimism User”. We’re not actually rewarding Optimism users in general, we’re rewarding a sub-class of Optimism users that fit a given behavior (necessary because we have to filter out spam somehow). Using a generic category name like “Optimism User” creates a sense of unfairness for people who were users of Optimism but didn’t hit the minimum usage requirements to get the bucket. Look into ZK attestations for users that own multiple wallets to prove that they do, in fact, own multiple wallets and can therefore get the bonus for those wallets together. Unfortunately there are some clear problems with this approach, unrelated parties could come together to pretend to share the same wallets to get the bonus, effectively giving people more tokens than they should fairly receive.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.8315217391304355
                },
                {
                    "author_link": "https://gov.optimism.io/u/GLCstaked",
                    "index": "6",
                    "likes": "25",
                    "time": "27/04/2022-22:26:40",
                    "content": "I’m making the case that Addresses that deposited to Beacon Chain Contract ( ETH validators ) are among a set of the Ethereum community best suited for these tokens, for various reasons I go into this thread (https://twitter.com/GLCstaked/status/1519382570244390912) These actors have proven  𝐥𝐨𝐧𝐠 𝐭𝐞𝐫𝐦 𝐚𝐥𝐢𝐠𝐧𝐦𝐞𝐧𝐭 𝐰𝐢𝐭𝐡 𝐄𝐭𝐡𝐞𝐫𝐞𝐮𝐦, 𝐞𝐬𝐩𝐞𝐜𝐢𝐚𝐥𝐥𝐲 𝐩𝐫𝐞-𝐦𝐞𝐫𝐠𝐞 𝐚𝐩𝐭𝐢𝐭𝐮𝐝𝐞 𝐭𝐨 𝐫𝐮𝐧 𝐧𝐨𝐝𝐞𝐬 /𝐬𝐞𝐫𝐯𝐢𝐜𝐞 𝐭𝐡𝐞 𝐧𝐞𝐭𝐰𝐨𝐫𝐤 𝐑𝐞𝐚𝐥 𝐫𝐞𝐬𝐨𝐮𝐫𝐜𝐞𝐬 𝐬𝐩𝐞𝐧𝐭 𝐭𝐨 𝐬𝐞𝐜𝐮𝐫𝐞 𝐭𝐡𝐞 𝐧𝐞𝐭𝐰𝐨𝐫𝐤, 𝐭𝐡𝐢𝐬 𝐜𝐚𝐧𝐧𝐨𝐭 𝐛𝐞 𝐒𝐲𝐛𝐢𝐥 𝐚𝐭𝐭𝐚𝐜𝐤𝐞𝐝  If OP plays a role in decentralisation of the sequencer then this makes even more sense, existing validators are most likely to run nodes for optimism. every validator I’ve spoken too, has expressed interest to run nodes on L2. Every airdrop eligibility criteria I have seen in this space can be gamed, but addresses in this set must have committed a non-trivial amount of capital until the merge, must be confident in the Ethereum communities’ ability to execute its roadmap and be positioned for long term success. must provide physical infrastructure or pay for it to keep the validator active on the Network, this must be persistent which incurs electricity costs, hardware costs, internet provider costs and time/effort for maintenance. I plan to create a governance proposal, for allocating a portion of the remainder of 14% airdrop tokens to beacon chain contract depositors, anybody interested in discussing this get in touch with me via twitter *my username ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.303030303030304
                },
                {
                    "author_link": "https://gov.optimism.io/u/smartcontracts",
                    "index": "7",
                    "likes": "14",
                    "time": "27/04/2022-23:04:51",
                    "content": "I think this is a really interesting proposal. As I mentioned on Discord, I would propose that any mechanism that rewards Beacon Chain depositors/validators take into account the following:  Whether or not the address is a solo staker Whether or not the address uses a minority client  We have an interesting opportunity to highly incentivize certain beneficial behaviors on the Beacon Chain if done correctly. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.3742857142857146
                },
                {
                    "author_link": "https://gov.optimism.io/u/Mahachai",
                    "index": "8",
                    "likes": "92",
                    "time": "28/04/2022-00:15:00",
                    "content": "The Sybil attacker draining 500K OP tokens and it can be used as sequencer attack in the future. This is only the surface that people found and reported which could be the tip of the iceberg   Ethereum (ETH) Blockchain Explorer    Address 0x5bdcb28df59004331122d5235c3602657a48ec5e | Etherscan The Address 0x5bdcb28df59004331122d5235c3602657a48ec5e page allows users to view transactions, balances, token holdings and transfers of ERC-20, ERC-721 and ERC-1155 (NFT) tokens, and analytics.       Please seriously consider blacklisting these addresses from the Airdrop#1 and the future airdrops. We understand Optimism encourage network volumes and activities but kindly consider the security of the network as the heart of the chain, ser. I’m having my followers discussing on this network threat from Sybil attackers and express strong opinions on this feedback ",
                    "links": [
                        "https://etherscan.io/address/0x5bdcb28df59004331122d5235c3602657a48ec5e"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.583333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/OxMrb",
                    "index": "9",
                    "likes": "10",
                    "time": "28/04/2022-01:59:48",
                    "content": "Just leaving this tweet here, hopefully it helps, https://twitter.com/kavourias/status/1519192669465030657?s=21&t=dyzXH3Y08XHjSxzJ5hksRQ and hopefully the team is aware of it. Cheers ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/Maessedai",
                    "index": "10",
                    "likes": "20",
                    "time": "28/04/2022-02:10:35",
                    "content": "I think the approach to the airdrop is great.  But for whatever its worth, under “priced out of ethereum” the threshold seems to be high IMO.  2 transactions a week on L1 is not a cheap endeavor for smaller capital users (like me).  If we were “priced out of ethereum” it was because we couldn’t afford to transact very often at all on L1 so we used other L2s to participate.  It just seems to me it isn’t accurately named.  Maybe “L2 explorers” would be more accurate.  If you want to hit users who used bridges to expand to L2’s because we don’t have that kind of money then transacting twice a week on L1 is not us.  The earlier adaptors and more wealthy definitely hit that mark.  I think it just depends what the goal of that category was, but either way probably not the most accurate name. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.451470588235294
                },
                {
                    "author_link": "https://gov.optimism.io/u/arsano",
                    "index": "11",
                    "likes": "4",
                    "time": "28/04/2022-07:44:50",
                    "content": "I agree with this topic. 500K $OP draining may affect to the DAO decision in the future and this is not a normal participation. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.8125
                },
                {
                    "author_link": "https://gov.optimism.io/u/kmil9",
                    "index": "12",
                    "likes": "2",
                    "time": "28/04/2022-11:36:10",
                    "content": "I agreed the team should do something to make it right. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.428571428571428
                },
                {
                    "author_link": "https://gov.optimism.io/u/Palmmehipp",
                    "index": "13",
                    "likes": "2",
                    "time": "28/04/2022-17:18:30",
                    "content": "I agree with you team should do something right for community  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.428571428571428
                },
                {
                    "author_link": "https://gov.optimism.io/u/KANTT",
                    "index": "14",
                    "likes": "5",
                    "time": "28/04/2022-18:33:37",
                    "content": "I agree and the next airdrop maybe it is attacked already. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/smartcontracts",
                    "index": "15",
                    "likes": "10",
                    "time": "28/04/2022-19:33:12",
                    "content": "People are aware of the reports of Sybil attacks and are actively investigating. Will have more information soon™. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.027777777777778
                },
                {
                    "author_link": "https://gov.optimism.io/u/kevster.eth",
                    "index": "16",
                    "likes": "6",
                    "time": "29/04/2022-00:28:01",
                    "content": "It’s not possible to see which validator runs which client. Some data can be gathered from block proposals but you can’t 100% be sure about the client everybody runs. That’s also a the reason why we don’t know for sure what the real client diversity is. But I also think individual node operators should be in this drop rather than big staking firms. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/sturz81",
                    "index": "17",
                    "likes": "4",
                    "time": "29/04/2022-01:00:08",
                    "content": "  I couldn't agree more with your post.  I think the length of history and total transaction count of layer 1 wallet should have been explored rather than transactions after bridging, during what was a brutal gas period.    I am So great full to have hit 3 out of 5, and as a good Ethernaut I'm paying my penance by checking off the other 2 after the fact.  I come from nothing and Ethereum, Uniswap, ENS, and now Optimism have made me feel included in a way I've never known. Just for being curious    Thank you Thank you ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.78125
                },
                {
                    "author_link": "https://gov.optimism.io/u/Lordcrypto7676",
                    "index": "18",
                    "likes": "4",
                    "time": "29/04/2022-14:19:14",
                    "content": "Personally I believe the OP team didn’t handle the airdrop correctly. Sure you are trying to avoid large Sybil attacks for 100’s of wallets. Though, any person that even wanted to try OP with a single bridge and a few swaps should of been included. I mean, even a small amount compared to the other checklist requirements, a 100 tokens or something. They excluded 200k wallets and likely lost a ton of future users in the process. It basically was a Paraswap type exclusion on a lesser scale. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.888798701298701
                },
                {
                    "author_link": "https://gov.optimism.io/u/Lordcrypto7676",
                    "index": "19",
                    "likes": "2",
                    "time": "29/04/2022-14:22:25",
                    "content": "Perhaps split those recovered Sybil wallets tokens between the single bridge/swaps wallets that used the protocol. It was wrong to exclude people that did support OP on a lesser scale, still supported OP. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.0476190476190474
                },
                {
                    "author_link": "https://gov.optimism.io/u/Maessedai",
                    "index": "20",
                    "likes": "2",
                    "time": "29/04/2022-14:40:21",
                    "content": "    sturz81:  length of history   absolutely on “length of history” because I think that will get you closer to actual people rather than burner wallets.  Excited by this either way just want to contribute if possible. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.71875
                },
                {
                    "author_link": "https://gov.optimism.io/u/0xbobns",
                    "index": "21",
                    "likes": "3",
                    "time": "29/04/2022-15:14:07",
                    "content": "    Mahachai:  I agree with this topic. 500K $OP draining may affect to the DAO decision in the future and this is not a normal participation.   OMG Please seriously consider ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.319444444444445
                },
                {
                    "author_link": "https://gov.optimism.io/u/cairo",
                    "index": "22",
                    "likes": "8",
                    "time": "29/04/2022-15:19:36",
                    "content": "First of all, thank you for a great airdrop - clearly a lot of thought went into this and very much looking forward to seeing how Optimism develops from here. My feedback is related to the Gitcoin Donors criteria. Why was this criteria only applicable to L1 Ethereum? Feels like it is unfairly weighted to an L1 Eth user, as those that made donations via Zksync did not qualify. I feel like if the criteria is called “Gitcoin Donors” it shouldn’t be about the chain the donation was made on, but the fact that the address has made a Gitcoin donation. If this criteria is included in future rounds, please consider donations that have been made on Zksync (and other chains if applicable). Thank you  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.436111111111112
                },
                {
                    "author_link": "https://gov.optimism.io/u/smartcontracts",
                    "index": "23",
                    "likes": "6",
                    "time": "29/04/2022-17:24:38",
                    "content": "Moving this over from https://gov.optimism.io/t/airdrop-1-multiplier-and-multiple-address-review/77 by @Gonna.eth (NOT MY CONTENT BELOW)  I know OP team worked hard for this and I wont have any personal gains from this proposal (I use dhannte.eth for everything) but the problem with the multiplier is multiple addresses from the same person are not considered. I’ll elaborate: If I have 1 Address for DAO voting 1 Address for multisig 1 Address for trading 1 Address for bridging 1 Address for donations  In terms of security, this sounds logical. But when it comes to the airdrop this person won’t receive multipliers even if he is a big contributor (Seen this from some EthernautDAO multisigners). Would it be possible to sign a message with each address to provide proof of being the same person and have multipliers applied like if it was just one address? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.254629629629629
                },
                {
                    "author_link": "https://gov.optimism.io/u/smartcontracts",
                    "index": "24",
                    "likes": "5",
                    "time": "29/04/2022-17:26:16",
                    "content": "Moving this over from https://gov.optimism.io/t/reconsider-this-address-for-the-airdrop by @Gonna.eth (NOT MY CONTENT BELOW)  Reconsider this airdop address    Ethereum (ETH) Blockchain Explorer    Contract Address 0x4c33fe28d7dafae6921f3bc2cd542c55bc9ad517 | Etherscan The Contract Address 0x4c33fe28d7dafae6921f3bc2cd542c55bc9ad517 page allows users to view the source code, transactions, balances, and analytics for the contract address. Users can also interact and make transactions to the contract directly on...      2700 addresses to use op and arbitrum bridge where used to be Airdorped This address is eligible for over 68k op and is clearly a farmer. Maybe a channel or a discourse subcategory to report these things could be open? Sorry if I was not allowed to post any proposals yet ",
                    "links": [
                        "https://etherscan.io/address/0x4c33fe28d7dafae6921f3bc2cd542c55bc9ad517",
                        "https://etherscan.io/address/0x4c33fe28d7dafae6921f3bc2cd542c55bc9ad517"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.625
                },
                {
                    "author_link": "https://gov.optimism.io/u/Joseph",
                    "index": "25",
                    "likes": "2",
                    "time": "29/04/2022-17:57:53",
                    "content": "Hey, thanks for airdrop. Why don’t we add additional criteria for total gas paid, i.e. compensate with OPs in proportion to total gas paid by address up to snapshot date. This seems to be the fairest criteria and helps not overlooking those who did a real impact on Optimism so far in terms of activity. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/chdonger",
                    "index": "26",
                    "likes": "4",
                    "time": "30/04/2022-13:52:04",
                    "content": "Thanks for airdrop. However, as Op become indpendent and can be interacted with other chain directly. I think be in active in L1 should be none necessary. I will suggest that include 3rd party bridge in round 2/3 in the future ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.901041666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/Tiger",
                    "index": "27",
                    "likes": "5",
                    "time": "01/05/2022-17:26:16",
                    "content": "Awesome job overall on the airdrop. It’s clear a ton of thought went into the criteria. A couple things I’d suggest for future airdrops would be: -Participation in Optimism governance -Recognizing wallets that used another L2 rather than L1 to donate on Gitcoin before snapshot (the important action was completed regardless of the means) -Recognizing more wallets that bridged over to L2(s) In terms of future airdrop frequency, I would propose a quarterly basis of 1% of token supply for the first year…then possibly semi-annually afterwards. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.175000000000001
                },
                {
                    "author_link": "https://gov.optimism.io/u/Tiger",
                    "index": "28",
                    "likes": "5",
                    "time": "01/05/2022-17:32:21",
                    "content": "Agree with incentivizing Bridges like Hop, DEX liquidity   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/fornax",
                    "index": "29",
                    "likes": "1",
                    "time": "02/05/2022-02:23:37",
                    "content": "Agree here, I also don’t get the current “priced out of ethereum” as I used bridges to L2 and still did a few tx on mainnet, but mostly I’m trying to focus on using L2s as I believe they’re the future. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.375
                },
                {
                    "author_link": "https://gov.optimism.io/u/YOHOHO",
                    "index": "30",
                    "likes": "2",
                    "time": "02/05/2022-13:01:04",
                    "content": "I agree with this feedback. if you fix this problem, the comunity and ecosystem are gonna grown-up. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Juanbug",
                    "index": "31",
                    "likes": "2",
                    "time": "03/05/2022-20:22:44",
                    "content": "I agree with incentivizing bridges and maybe even other projects on ETH L1 that might be down to move over to optimism. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.298611111111112
                },
                {
                    "author_link": "https://gov.optimism.io/u/SamuelMeus",
                    "index": "32",
                    "likes": "1",
                    "time": "03/05/2022-20:56:51",
                    "content": "Agree with Joseph. It’s very simple and transparent criteria. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/MoneyManDoug",
                    "index": "33",
                    "likes": "2",
                    "time": "04/05/2022-00:39:21",
                    "content": "i actually think the specifications for the drop are pretty inclusive and fair at the same time. very hard to balance usually. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.267361111111111
                },
                {
                    "author_link": "https://gov.optimism.io/u/leifu",
                    "index": "34",
                    "likes": "1",
                    "time": "04/05/2022-08:47:07",
                    "content": "Fully agree with all the improvements, especially for the first one. If the user can check the breakdown with the bots, it will save lots of effort in managing discord and have more meaningful discussions about the future airdrops. We can even have a bounty to ask the community members to check the scripts if there are any bugs before claiming the token. Additionally, I have some concerns about the global filter in airdrop #1, especially for the snapshot’s bot-catching proposal. It’s an efficient tool to filter out the farmers but it will also lead to some false positive cases (real users voted on this proposal by accident) because it didn’t check the on-chain activities. It would be better to use different filters to cross-check a single wallet adress. At last, thanks for your great work. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.845576298701298
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "35",
                    "likes": "2",
                    "time": "04/05/2022-12:46:46",
                    "content": "I am in favor of this. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Graciouseats",
                    "index": "36",
                    "likes": "1",
                    "time": "04/05/2022-12:51:24",
                    "content": "OPCO’s can issue tickets to it’s citizens for special events hosted by that OPCO, as NFTs. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.7857142857142865
                },
                {
                    "author_link": "https://gov.optimism.io/u/Alexeverythink",
                    "index": "37",
                    "likes": "0",
                    "time": "04/05/2022-16:34:52",
                    "content": "Hop protokol users is good idea ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/srikarv",
                    "index": "38",
                    "likes": "3",
                    "time": "06/05/2022-22:24:29",
                    "content": " The initial retroactive airdrop should be very small and the behavior of the wallets that receive these airdrops should then be monitored carefully over some time period T, upon which a slightly larger airdrop should be given that aligns with metrics defined by the Optimism community. Too often airdrops are a one-and-done thing, especially when retroactive.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.575
                },
                {
                    "author_link": "https://gov.optimism.io/u/ajdarvv",
                    "index": "39",
                    "likes": "10",
                    "time": "06/05/2022-23:30:05",
                    "content": "Hello! First of all congratulations on all your success so far, and also congratulations with the success of launching $OP in what I believe is a really fair airdrop mechanism and one which rewards early Optimism users! My only gripe if you can call it that would be that zksync gitcoin donations weren’t included and it was only those on layer 1, especially when one of the things you are trying to address is “priced out of ethereum” users. My suggestion would be to include zksync gitcoin donations in the next airdrop round, perhaps make it so that they also had to be optimism users as well as zksync and also use the original cut off dates for airdrop #1 for that criteria to keep it fair? Thanks, ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.017857142857142
                },
                {
                    "author_link": "https://gov.optimism.io/u/sybillingthisthread",
                    "index": "40",
                    "likes": "2",
                    "time": "08/05/2022-13:49:40",
                    "content": "You have to acknowledge that sybillers are your “real users” as well - and even more dedicated than the most - who were ready to waste their time and money in a bet that your protocol is going to airdrop anything in the first place. If you don’t like the allocation they are getting - adjust the requirements, but do not just cut them out for the sake of angry - and probably poor and lazy - twitter mob who is simply envious but have no intention of putting in any work. Airdrop should be a celebration of all your achievements, not a witchhunt for a momentary clout cough paraswap and soon hopprotocol cough. Protect the positive narrative, keep building - and the price will follow, it doesn’t matter if anyone is going or not going to dump their tokens, just focus on the quality of your product. The only situation where sybilling isn’t acceptable is when it’s done on a basis of insider information (sus timing and exactly following the requirements) - you may cut these out - but this information shouldn’t get leaked in the first place. Thanks, please be merciful ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.325757575757576
                },
                {
                    "author_link": "https://gov.optimism.io/u/MinimalGravitas",
                    "index": "41",
                    "likes": "1",
                    "time": "08/05/2022-17:16:08",
                    "content": " The only situation where sybilling isn’t acceptable is when it’s done on a basis of insider information (sus timing and exactly following the requirements) - you may cut these out  I think you’re forgetting that the point of the airdrop wasn’t primarily to reward accounts with a financial windfall, OP is a voting token that was intended to go to users most likely to want to contribute to the project’s governance (e.g. people who have used Optimism, participated in other governance voting, donated to public goods etc). Would it make sense to give some people more voting power just because they  were ready to waste their time and money in a bet that your protocol is going to airdrop anything  ? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.579545454545455
                },
                {
                    "author_link": "https://gov.optimism.io/u/HuntTheFarmers",
                    "index": "42",
                    "likes": "5",
                    "time": "08/05/2022-17:52:12",
                    "content": "Unbelievable. You can’t be serious. Sybil attackers are a cancer to any project. Parasites looking to get rich at the expensive of others. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.114583333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/sybillingthisthread",
                    "index": "43",
                    "likes": "0",
                    "time": "08/05/2022-20:07:21",
                    "content": "    MinimalGravitas:  users most likely to want to contribute   Just like those who got 6k tokens for not using optimism at all, right? It’s still an assessment and wishful thinking about people wanting to dump or wanting to govern, but rewarding people for testing protocol and their actual participation - where sybillers are quite crucial due to the sheer number of interactions - feels at least fair. And they are still users. You can tweak any metrics for their reward - just like optimism did with 6 categories bonus - without cutting them out “just because”, which is good for the narrative, which will bring even more attention and users to the project.     HuntTheFarmers:  Sybil attackers are a cancer to any project.   How so? They are participating and ramping those juicy volume/users numbers up, stressing the network and testing interractions in droves. If their actions are too simplistic - ramp up airdrop requirements, if they are pervasive and all-around - good, then they’ve been more useful to the protocol than you and your complaints on twitter. Contribution and reward is a fair game, you can increase your contribution if you find your reward lacking, projects would be only thankful for that. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.871598639455781
                },
                {
                    "author_link": "https://gov.optimism.io/u/Simon",
                    "index": "44",
                    "likes": "1",
                    "time": "08/05/2022-20:39:20",
                    "content": "You should make a continuous airdop with small amont available every day. And airdrop should be claimable manualy. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.375
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "45",
                    "likes": "2",
                    "time": "09/05/2022-06:27:20",
                    "content": "every day? could you please explain your reasoning behind it? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/ajdarvv",
                    "index": "46",
                    "likes": "0",
                    "time": "09/05/2022-18:58:21",
                    "content": "Optimism so far has done a great job at balancing Optimism users and cutting out those trying to game a potential airdrop, those types of users would probably sell immediately too. To compare OP to Parasawp and Hop is ridiculous, both of them were clearly not fair but OP is fair (minus the gitcoin donations on L2 being ignored…) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.898148148148148
                },
                {
                    "author_link": "https://gov.optimism.io/u/Optimistic",
                    "index": "47",
                    "likes": "0",
                    "time": "12/05/2022-12:07:23",
                    "content": "Just some recommendation from me, we know people that not use optimism even got airdrop so doesnt make sense if you take off the optimism user itself. But IF you want to take care of sybil, is need to be special spesification. Example: we know the sybil use multiple wallet, but maybe one of the address are active user on optimism chain so if the sybil address have more than 10 transaction on optimism chain, they still eligable for airdrop. We can assume they are maybe have 100 account but only a couple address have most activeness on chain, so we are can still rewards the parent address to make him still use the optimism ecosystem. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.01984126984127
                },
                {
                    "author_link": "https://gov.optimism.io/u/MoneyManDoug",
                    "index": "48",
                    "likes": "1",
                    "time": "12/05/2022-22:03:10",
                    "content": "If you are sybilling you are hurting the protocol and should be slashed completely. i even believe we should offer bounties for those who write scripts to catch the malicious users. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/Babar",
                    "index": "49",
                    "likes": "0",
                    "time": "13/05/2022-11:04:20",
                    "content": "Holy shit! how do they manage?   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/BP_Gamma",
                    "index": "50",
                    "likes": "3",
                    "time": "14/05/2022-16:02:22",
                    "content": "  twitter.com   Chris Whinfrey.eth ⟠ @WhinfreyChris  0/ Sybil resistant airdrops have turned into an arms race.  We had no idea what we were up against when we started designing the Hop distribution.  Here’s how we filtered out over 10,000 Sybil attacker addresses and enlisted army of Sybil hunters to find the rest 👇   11:18 AM - 13 May 2022           812                182            I would get in touch with the Hop team because they’ve been doing a lot of work catching sybillers.  I think you’ll find that you guys have a lot of the same common addresses that Hop flagged as a sybilling wallet. ",
                    "links": [
                        "https://twitter.com/WhinfreyChris/status/1525178626563420160?s=20&t=swKKjpfpwcxB7OVy50tgyw",
                        "https://twitter.com/WhinfreyChris/status/1525178626563420160?s=20&t=swKKjpfpwcxB7OVy50tgyw",
                        "https://twitter.com/WhinfreyChris/status/1525178626563420160?s=20&t=swKKjpfpwcxB7OVy50tgyw"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/Tiger",
                    "index": "51",
                    "likes": "4",
                    "time": "15/05/2022-00:39:27",
                    "content": "For the next airdrop, I’d also suggest rewarding addresses that don’t dump any $OP after claim, or only sell some (maybe on a 3-tiered basis). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/wcc",
                    "index": "52",
                    "likes": "3",
                    "time": "15/05/2022-09:22:20",
                    "content": "Totally happy to see detailed discussions and debates here. For me, sybil is one of the biggest roadblocks for decentralized governance many projects seeking for, and it is dramatically difficult to remove them once too late (already claimed all tokens). Based on my observations, I saw that there is a large scale of sybil on Juno chain (on Cosmos) where someone knew the criteria and gamed it. Now the community is finding ways to remove that large account but it would cause many drawbacks too (ref) Regarding Hop approach, I understand that some people would like to let OP use the same approach. Personally I think it may open up loopholes for OP since we have >1 times of airdrops. Given this situation, sybil farmers can game it and then report themselves. So, I would love to suggest 3 sources of addresses to be investigated:  OP team Leverage sybils identified by Hop approach Open for community to submit potential sybil addresses (out of #1 and #2) without any reward - there is still an indirect incentive for OP holders to identify due to less circulation supply (those sybils will not be claimable).  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.481442577030813
                },
                {
                    "author_link": "https://gov.optimism.io/u/LilysSummer",
                    "index": "53",
                    "likes": "2",
                    "time": "16/05/2022-09:26:10",
                    "content": "I think the sybil attacker’s address should be excluded, but the HOP’s way is very crude and it cannot exclude professional airdrop hunters. There needs to be some time left for suspected airdrop hunters to appeal, and if their reasons are appropriate and the community agrees, then they can be considered for retention, so that no innocent people can be excluded due to address association. Other than that, you can consider about setting up an ecological incentive fund, not only for DApp developers, but also some NFT marketplace should be provided for them to incentive the operators of long-term NFT projects and the community. NFTs are very important for OP because they allow more people to see the advantages of OP. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.277272727272727
                },
                {
                    "author_link": "https://gov.optimism.io/u/Butterbum",
                    "index": "54",
                    "likes": "2",
                    "time": "16/05/2022-15:15:28",
                    "content": "Great work in attempting to cast the net as wide as possible. I do believe in the future drops we could try include [quote=“GLCstaked, post:6, topic:80”] Addresses that deposited to Beacon Chain Contract ( ETH validators ) [/quote] Just would like to add my take on the sybil resistance… I do agree that Sybil attacks are a problem in some cases and need to be reviewed. It wouldn’t really be a problem in Optimism governance as we have the Token House & the Citizens’ House. With that being said, there are some pros for not excluding sybil attackers.   A sybil attackers provides the network with many transactions, creating a stress test environment and reduces overall transaction fees for everyone.   Generally the attackers are first to sell allowing people who missed out on the airdrop to join the adventure by acquiring some undervalued tokens. This in turn can further distribute the token to many more people.   Disclaimer: I did not sybil attack Optimism. Request: If you are a sybil attacker please consider delegating  to me  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.038461538461538
                },
                {
                    "author_link": "https://gov.optimism.io/u/Notorious84",
                    "index": "56",
                    "likes": "1",
                    "time": "17/05/2022-20:41:17",
                    "content": "Maybe tasks to do every week or month to earn points or something like that for next airdrop ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/HuntTheFarmers",
                    "index": "57",
                    "likes": "3",
                    "time": "18/05/2022-03:20:46",
                    "content": "Are you a sybiller? Haven’t seen anyone defending sybillers except sybillers. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/MinimalGravitas",
                    "index": "58",
                    "likes": "0",
                    "time": "18/05/2022-08:10:26",
                    "content": "     Proposal Discussion     Submit and discuss proposals to Optimism Collective Governance.       Governance Fund: Phase 1 Proposals      Governance Fund: Phase 0 Proposals        I think you might be looking for the GF: Phase 0 Proposals - various dApps built on Optimism are requesting pots of OP which they will then distribute to their users - for more info check out Governance Fund Overview | Optimism Docs . ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/midnightpastel",
                    "index": "59",
                    "likes": "1",
                    "time": "18/05/2022-12:49:02",
                    "content": "For the Airdrop logistics: I think vesting period(per week/per month) is helpful for reducing sell pressure and It gives more awareness to people about the project at least for the vesting period of time. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/Tuqui",
                    "index": "60",
                    "likes": "1",
                    "time": "18/05/2022-19:33:35",
                    "content": "I think there are real users that just hunted the airdrop on videos like chico crypto ones, they just bridged and did a swap on uniswap and for that they are getting some tokens. Question is, do they deserve to be blocked?? Imo this category will dump their tokens very quick. If wanted they can be excluded by taking out all wallets with less than 5 transactions. Sybil attackers, as others pointed out many people abused the system as they always does, i think these ones should be taken out 100%, those easily seen sending funds from 1 wallet to 20+ wallets and then farming with the same activity on all of those wallets. These type will also dump the tokens, and with difference with the above category, they are getting thousands and thousands of them to dump for each person. I like the approach HOP is taking, take out the ones that are farming in huge amounts (i think they took out 20+ connected wallets with shady behaviour and considering those above 10+ depending on behaviour) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.775
                },
                {
                    "author_link": "https://gov.optimism.io/u/Hitsuga",
                    "index": "61",
                    "likes": "1",
                    "time": "18/05/2022-22:51:04",
                    "content": "Oooh I’m liking this post. I think it’d be healthy to get some genuinely active wallets involved instead of random freshly made wallets with zero to no transactions! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.302083333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "62",
                    "likes": "1",
                    "time": "19/05/2022-06:12:52",
                    "content": "    Hitsuga:  active wallets   This is such a good idea, may be some eligibility criteria on the number of transaction done by the address in a month ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.944444444444445
                },
                {
                    "author_link": "https://gov.optimism.io/u/kryos.eth",
                    "index": "63",
                    "likes": "8",
                    "time": "19/05/2022-09:41:51",
                    "content": "Coming from someone in crypto since BTC was $300… eliminate all the sybil farmers. I completely bail on projects that had gamed distribution from the start. This is about decentralization and community. People get furious when they get 727 tokens and dude botted and gets 500k. I could have botted, and I guess if not filtering out all sybil attacks to the best of ability is optimisms approach I certainly would make it a point to bot in the future, because thats acceptable here to many apparently. Been using optimism a long while, decided to check governance for the first time and this is the first thread I read. Man. Initial post started so positive too. Very lame to see so much pro sybil discussion. Eliminate every last sybil farmer you can find. Quite disapointed in the general acceptance of sybil farmers over here on optimism. Just reward real people for real things, incentivize legit users that arent gaming an airdrop. Real users should be part of governance, unless you really want the top ten bots running your chain. For every huge sybil farmer eliminated the little guy gets more say, more tokens, and thats a stronger community. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.930811688311688
                },
                {
                    "author_link": "https://gov.optimism.io/u/Tuqui",
                    "index": "64",
                    "likes": "9",
                    "time": "19/05/2022-13:14:46",
                    "content": "I think the same, lame to see Sybil attackers here defending themselves. I remember seeing the contracts when chico crypto and others mentioned Optimism or zkSync or others, and you could see the bridge how it was spammed like crazy… We dont have that amount of users, its lying to ourselves if we think we have 200k+ unique users. I get it some might have real 1-5 wallets bc one its for multisig, different type of hot wallets, a ledger, etc… But those who have 20+ wallets its near imposible they are not sybil attackers and going just for a quick profit and exit the space, providing nothing. I also at some point thinked about doing sybil, i havent, but if the sybil attackers are rewarded in this airdrop #1 , why wouldnt we all do the same for airdrop #2? Thats the sad part, we have the first airdrop and the second one announced for the future, if we give sybil attackers a free pass, for the second airdrop will be a chaos (and more because the allocation is bigger). Optimism has a new ethos no other has put into the table, allowing these farmers to take a huge % will go against to all of Optimism ideals. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.501799242424243
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "65",
                    "likes": "4",
                    "time": "19/05/2022-15:37:26",
                    "content": "Totally agree, we can army of sybil in Hop. OP should implement the same method too. We should not and must not reward Bot and Sybilers. edit- *see ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Tuqui",
                    "index": "66",
                    "likes": "4",
                    "time": "19/05/2022-17:06:18",
                    "content": "Yes, HOP sybil attacker list will close May 24. The team should use that list to blacklist those sybil (and others people or team have found) This is the HOP list hop-airdrop/eliminatedSybilAttackers.csv at master · hop-protocol/hop-airdrop · GitHub it started at 10k found by the team, and users (then reviewed by HOP team) have found 30% more making it 13k. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/Babar",
                    "index": "67",
                    "likes": "0",
                    "time": "21/05/2022-07:40:16",
                    "content": "thats a quite logical statement. worth considering for all protocols. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.375
                },
                {
                    "author_link": "https://gov.optimism.io/u/bradleyni",
                    "index": "68",
                    "likes": "0",
                    "time": "23/05/2022-04:47:52",
                    "content": "award  the users who still active after snapshot announcement ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.333333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/georgechiu",
                    "index": "69",
                    "likes": "1",
                    "time": "23/05/2022-15:20:05",
                    "content": "Although this idea sounds interesting, I don’t think it’s practical. Because it’s impossible to trace off-chain plus it’s hard to define what is considered as a sell action. Here are some examples, people could short perp on CEX(if OP is listed) or they could provide concentrated liquidity on Uniswap V3 to act as a limit sell order, or you could even borrow against OP for stable on AAVE(if OP is listed) and get liquidated purposely, which act as a form of selling but with price discount. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.641666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/ben-chain",
                    "index": "70",
                    "likes": "9",
                    "time": "23/05/2022-20:09:24",
                    "content": "Hi all, over the past few weeks, we have been searching for additional sybils as discussed above in this thread. We’ve removed over 17k sybil addresses and recovered over 14 million OP, redistributed proportionally to the remaining holders. More details can be found here in the docs. If you have any feedback on this filtering process, please feel free to drop a comment in this feedback form. We may use this feedback to inform future OP Airdrops. ",
                    "links": [
                        "https://optimismpbc.typeform.com/sybil-feedback"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.375
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "71",
                    "likes": "1",
                    "time": "23/05/2022-20:26:05",
                    "content": "Thank you. Not rewarding Bot and Sybiler was needed. Huge respect to OP for this. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.375
                },
                {
                    "author_link": "https://gov.optimism.io/u/Tuqui",
                    "index": "72",
                    "likes": "0",
                    "time": "23/05/2022-20:32:37",
                    "content": "Wow man makes me happy to read this!! Bye bye bad actors! Thanks team for taking the job and the extra time for this!! And also all the great Optimistic citizens taking their time for doing research and track those bad actors. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.375000000000001
                },
                {
                    "author_link": "https://gov.optimism.io/u/kryos.eth",
                    "index": "73",
                    "likes": "0",
                    "time": "23/05/2022-21:22:24",
                    "content": "You have restored my faith in optimism. Awesomeness. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Butterbum",
                    "index": "74",
                    "likes": "0",
                    "time": "23/05/2022-23:02:16",
                    "content": "Fantastic work. I’m glad we addressed the issue.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/pnsam",
                    "index": "75",
                    "likes": "0",
                    "time": "24/05/2022-00:14:20",
                    "content": "I would like to suggest something for Optimism   We should filter out sybil by filter the number of transactions of address. If some addresses that have the transaction in OP only 1-2 transactions, that’s mean they create new wallet to hunt the airdrop.   One more thing to prevent OP from sybil attack is that “sybil bounty”. We can propose more $OP for those who can point out the sybil.   For the airdrop logistics, we should distribute 10% weekly.   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.823863636363637
                },
                {
                    "author_link": "https://gov.optimism.io/u/ternnoi",
                    "index": "76",
                    "likes": "0",
                    "time": "24/05/2022-01:17:50",
                    "content": "Very hard to do no eth faucet on testnet ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.104166666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/0xbobns",
                    "index": "77",
                    "likes": "0",
                    "time": "24/05/2022-01:31:44",
                    "content": "Thank you for seriously consider blacklisting about Sybil attackers ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.333333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/mcbonton",
                    "index": "79",
                    "likes": "0",
                    "time": "24/05/2022-03:19:26",
                    "content": "Thank you for organize sybil ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/chien",
                    "index": "80",
                    "likes": "1",
                    "time": "24/05/2022-03:32:39",
                    "content": "The size and amount of transactions should be another factors for airdrop eligibility! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/thesleeper",
                    "index": "81",
                    "likes": "0",
                    "time": "24/05/2022-03:36:16",
                    "content": "#2 airdrop should allocate for #1 HODL who believe in a power of OP ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/kkxxx",
                    "index": "82",
                    "likes": "0",
                    "time": "24/05/2022-03:52:33",
                    "content": "Please consider the HODLers from Airdrop#1 for the Airdrop#2, those are the true believers for Op family ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/qiqiya",
                    "index": "83",
                    "likes": "0",
                    "time": "24/05/2022-03:58:40",
                    "content": "Maybe we can get experience from PSP and hop. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/xacrid",
                    "index": "84",
                    "likes": "0",
                    "time": "24/05/2022-04:14:55",
                    "content": "Airdrop formulas need some weights. The more usage, The more airdrops. The usage can be regarded total transaction values. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.666666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/tutuioio",
                    "index": "85",
                    "likes": "0",
                    "time": "24/05/2022-04:16:19",
                    "content": "Frist of all, I have to say Thank you that the team prohibited sybil which, The Sybil attacker draining many OP tokens and it seem to be protect in the future. Anyways, I have an idea about Airdrop that you can make an easy condition related to the next airdrop for who is the new OP to contribute it to them and can make a new user to use this block such as any glamming game, coin flit or any betting by OP chips. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.447811447811448
                },
                {
                    "author_link": "https://gov.optimism.io/u/adaykak",
                    "index": "86",
                    "likes": "0",
                    "time": "24/05/2022-04:54:15",
                    "content": "I agree  we need to give airdrop for the real people, so i wanna you give airdrop for nft community also  a part in enabling the chain to grow in the future because good nft comes from good community.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Hakutheshiba",
                    "index": "87",
                    "likes": "0",
                    "time": "24/05/2022-06:23:40",
                    "content": "Couldn’t agree more. Totally sum up what the team should do. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/totow",
                    "index": "88",
                    "likes": "0",
                    "time": "24/05/2022-06:29:44",
                    "content": "Thank you for take serious about sybil attack topic. Respect! For the #2Airdrop: please consider more score for the#1airdrop OP holder (OP diamond-hand) and separate the token distribution by weeks/months to reduce selling pressure. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.208333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/Hakutheshiba",
                    "index": "89",
                    "likes": "1",
                    "time": "24/05/2022-06:34:15",
                    "content": "I have around 3 suggestions for the remaining airdrop eligibility, 1) the team can allow $OP tokens holder to lock their tokens, and incentives should consider the amount of period of lock. I feel like this could provide some benefits for the committed community and not just dump from day 1. 2) Optimism NFT. I believe NFT on optimism can grow much further and this will bring new volume of fund into the ecosystem. 3) Should blacklist addresses of sybil attacker from drop #1. GO OPTIMISM!! Thanks. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.68844696969697
                },
                {
                    "author_link": "https://gov.optimism.io/u/poomink",
                    "index": "90",
                    "likes": "0",
                    "time": "24/05/2022-06:59:00",
                    "content": "Thank you for eliminating Sybil attackers to ensure fairness to all users. And it will be a good standard in the next air drop distribution. For the next air drop, I would suggest using the points from the first round as an additional multiplier. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://gov.optimism.io/u/Nop99",
                    "index": "91",
                    "likes": "0",
                    "time": "24/05/2022-06:59:30",
                    "content": "Thank you for 1Airdrop .I Hold OP token for fuure ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/kokkak555",
                    "index": "92",
                    "likes": "0",
                    "time": "24/05/2022-07:02:41",
                    "content": "#2 airdrop should allocate to people who bridge or swap token from or to optimism beacuse of there are a lot of dapp sush as hashflow that can bridge to another chain not just ethereum chain. That will brings more users to join our OP family. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/jewjewvid",
                    "index": "93",
                    "likes": "0",
                    "time": "24/05/2022-07:35:22",
                    "content": "I feel very proud with bot removal management or spam this time It made me feel proud of very platform and makes me want to keep using it including recommending to friends Log in to the optimisim. And I think checking the minimum transection in setting It should be a good user check. ETH as a minimum to use, from 0.1ETH to 1ETH, and each level or level receives a different airdrop. due to use or contribute more or less to your platform ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.817708333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/jjztha",
                    "index": "94",
                    "likes": "0",
                    "time": "24/05/2022-07:36:56",
                    "content": "reward should distribute to real user ,sybil attacker must be block or ban address them anyway thank for the airdrop LFG TTM project ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/jamijami",
                    "index": "95",
                    "likes": "0",
                    "time": "24/05/2022-08:05:10",
                    "content": "Thanks for sybil filtering in Airdrop#1. I think how to separate real user and sybil is to repeatitive of usage. For next airdrop, maybe filter by continueing use Dapp in Optimism and have ETH left in wallet more than 0.01ETh ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.8999999999999995
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPh",
                    "index": "96",
                    "likes": "0",
                    "time": "24/05/2022-08:51:37",
                    "content": "Upvote this thread. We need to take this serious. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.333333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/HYPE",
                    "index": "97",
                    "likes": "0",
                    "time": "24/05/2022-10:05:43",
                    "content": "Good step for distribution airdrop and remove of spam I think the first airdrop can divide the people who airdrop hunter and real so the next step for airdrop could include all people that HODL  OP$ and keep doing active in Optimism chain that more transaction, more dapp used, etc. And people that not moving money out of chain should be include for airdrop too (not one night stand for airdrop hunter) Thank you for your hardwork ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.44047619047619
                },
                {
                    "author_link": "https://gov.optimism.io/u/Tiger",
                    "index": "98",
                    "likes": "1",
                    "time": "24/05/2022-11:24:30",
                    "content": "Good points, sell action would be complicated to identify. A simple way around this would be to compare the amount of tokens in the wallet at snapshot #2 to the amount claimed in #1. Same or higher amount at second snapshot = hodler. I also think routine governance participation in proportion to airdrop #1 amount would probably be a more practical way to characterize DIAMOND HANDED citizens  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.65625
                },
                {
                    "author_link": "https://gov.optimism.io/u/ibO",
                    "index": "99",
                    "likes": "1",
                    "time": "24/05/2022-11:31:33",
                    "content": "I agree with this opinion. Royalty users better earn more and all Sybil attacker’s addresses should be excluded. Moreover, users who have participated in more protocols with more transactions should earn more than only one use. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.083333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/babadebabashiyeye",
                    "index": "100",
                    "likes": "0",
                    "time": "24/05/2022-11:44:34",
                    "content": "i like it I love projects like this ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/superzerone",
                    "index": "101",
                    "likes": "0",
                    "time": "24/05/2022-13:01:12",
                    "content": "I think next airdrop round need drop to real user ex. drop to user have tx 20+ on chain or volume 100usd + ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/donutQ",
                    "index": "102",
                    "likes": "0",
                    "time": "24/05/2022-13:33:31",
                    "content": "this is huge action that you filter out those Sibil, Our communitty can’t thank you enough ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/calontro26",
                    "index": "103",
                    "likes": "0",
                    "time": "24/05/2022-13:55:29",
                    "content": "I agreed the team do something right for community sir  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.428571428571428
                },
                {
                    "author_link": "https://gov.optimism.io/u/AlTimist",
                    "index": "104",
                    "likes": "0",
                    "time": "24/05/2022-14:12:10",
                    "content": "Couldn’t agree more. If OP team continues to do it, the community will grow faster. -An airdrop should be distributed smaller and more frequently to support real user, not an airdrop hunter who use 1-2 times and then go away. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.3
                },
                {
                    "author_link": "https://gov.optimism.io/u/MaSaChi",
                    "index": "105",
                    "likes": "1",
                    "time": "24/05/2022-14:20:26",
                    "content": "Eliminating the Sybil attackers is a very positive action for the community. strengthen the community. Sybil attackers should be taken seriously. Either this time or anyone in the future. Thank sir ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.077651515151516
                },
                {
                    "author_link": "https://gov.optimism.io/u/MWAD",
                    "index": "106",
                    "likes": "0",
                    "time": "24/05/2022-14:30:35",
                    "content": "I would give some suggestions for the next airdrop.  At list use optimism bridge one time to fund his account and deposit at list 0.001ETH or if not use bridge then at list deposit 0.01ETH from any other sources Give airdrop to the $OP Holder, considered from how long the address can hold the $OP coin. total 3 transactions value is at list 5$ or more  if any one meet this criteria then we consider for optimum user airdrop apart from that repeatOptimism Users ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.854166666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/JarnErk",
                    "index": "107",
                    "likes": "0",
                    "time": "24/05/2022-14:54:27",
                    "content": "Awesome on 1st Airdrop criteria in my opinion. Suggestion criteria for next airdrops would be:  Distribute to people who hold first 5 NFT project that launch on OP. This will reflect that team focus on “Gas fee friendly chain”, which will attract NFT people from mainnet.  This is all I have for now, update later. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.625
                },
                {
                    "author_link": "https://gov.optimism.io/u/maykung",
                    "index": "108",
                    "likes": "0",
                    "time": "24/05/2022-15:30:44",
                    "content": "Appreciate what the team did by preventing sybil attacks for the first round airdrop. It means that Optimism really intends to stay transparent and focus on building a strong community by distributing airdrop to appropriate users who want to grow with OP network and ecosystem.  For the next airdrop, I would suggest focusing on users who:  Continue using the ecosystem: frequent uses on multiple DAPPs Stake ETH on beacon chains Donate/support grants in gitcoin Hold and stake $OP tokens received from the first round airdrop. (Perhaps giving a multiply boost to the amount of airdrop, like x2 if that user holds and stakes all of thier $OP.)  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.606060606060606
                },
                {
                    "author_link": "https://gov.optimism.io/u/anasjoe",
                    "index": "109",
                    "likes": "0",
                    "time": "24/05/2022-15:37:01",
                    "content": "I agree and the next airdrop for real user on OP Chain ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/khunbon",
                    "index": "110",
                    "likes": "1",
                    "time": "24/05/2022-15:56:39",
                    "content": "The care you made for the community was undeniable as the team could walk away and ignore those unfair players. To be honest, this even makes Optimism more valuable than ever! For the airdrop idea, I would propose that you do multiple time snapshots for those people who are new to L2, to be exact, Optimism, who are always active in the community to even cut away people who came for just an instant profit. Also need to watch out for new wallets as well. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.619107744107744
                },
                {
                    "author_link": "https://gov.optimism.io/u/Blackyamorn",
                    "index": "111",
                    "likes": "0",
                    "time": "24/05/2022-16:26:53",
                    "content": "To verify that the user is real Should check multiple channels that are connected, such as Phone number, Mail, Discord, Twitter, at least all 4 of these topics should be connected. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.875
                },
                {
                    "author_link": "https://gov.optimism.io/u/jadyn",
                    "index": "112",
                    "likes": "0",
                    "time": "24/05/2022-16:38:25",
                    "content": "I think it’s good to do this. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/pxhpb",
                    "index": "113",
                    "likes": "0",
                    "time": "24/05/2022-16:54:41",
                    "content": "I appreciate that Optimism has good improvements and developments for the community to be truly decentralized. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/suparlerk",
                    "index": "114",
                    "likes": "1",
                    "time": "24/05/2022-17:06:50",
                    "content": "i think we can check hop of txs for protect multiple wallet ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/25SEp",
                    "index": "115",
                    "likes": "0",
                    "time": "24/05/2022-18:32:23",
                    "content": "I was amazed by the handling of airdrops of this team and community. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/premtester",
                    "index": "116",
                    "likes": "0",
                    "time": "24/05/2022-19:01:51",
                    "content": "Agreed on the team about the sybil. I think to build a great community we must avoid that things ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Belter",
                    "index": "117",
                    "likes": "1",
                    "time": "24/05/2022-19:47:41",
                    "content": "I think this is the good idea to avoid people who tried to pump free money from airdrop, it could be the role model for the next project that tried to give airdrop to users. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.833333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/lllicylll",
                    "index": "118",
                    "likes": "0",
                    "time": "24/05/2022-23:59:46",
                    "content": "I think you do something good for the community. Fighting, I’m cheering you on. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/tangsir",
                    "index": "119",
                    "likes": "0",
                    "time": "25/05/2022-00:00:04",
                    "content": "I think we should have hunt sybil program ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Rangerover",
                    "index": "120",
                    "likes": "0",
                    "time": "25/05/2022-00:09:00",
                    "content": "홉 프로토콜 사용자를 대상으로 추가 에어드랍을 하는것은 아주 좋은 생각입니다 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/thakhathepcryp",
                    "index": "121",
                    "likes": "1",
                    "time": "25/05/2022-01:05:00",
                    "content": "thank for give reward to real user ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/naresdang",
                    "index": "122",
                    "likes": "0",
                    "time": "25/05/2022-01:05:02",
                    "content": "Checking the next round of air drop distribution must be checked like the first round. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.8125
                },
                {
                    "author_link": "https://gov.optimism.io/u/pratoinvest",
                    "index": "123",
                    "likes": "0",
                    "time": "25/05/2022-01:05:07",
                    "content": "Always distribute op coins to people who are active or have TVL on the op. Addresses that are always moving after airdrop announcements. Maybe someone interested in the OP is probably someone to follow. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.291666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/serbisxz",
                    "index": "124",
                    "likes": "0",
                    "time": "25/05/2022-01:05:17",
                    "content": "I would like to give the next round of prizes. There is a section on projects related to community and NFT.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.666666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/bidongling",
                    "index": "125",
                    "likes": "1",
                    "time": "25/05/2022-01:05:28",
                    "content": "Agree with incentivizing Bridges like Hop, DEX liquidity   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Cc2021",
                    "index": "126",
                    "likes": "0",
                    "time": "25/05/2022-01:41:35",
                    "content": "if the team make Airdrop #2345… more expectable, it would help people better experiencing the network. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/brucewang614",
                    "index": "127",
                    "likes": "0",
                    "time": "25/05/2022-01:53:09",
                    "content": "I love the way of Op airdrop ,maybe incentive some bridges behavior like Hop ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/Chokeizzbpptr3",
                    "index": "128",
                    "likes": "0",
                    "time": "25/05/2022-03:02:44",
                    "content": "Airdrop for hold nft and bridge all chain ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPh",
                    "index": "129",
                    "likes": "1",
                    "time": "25/05/2022-04:48:44",
                    "content": "First thing first, I see some Sybil’s attack flying around, but OP team response quick and redistribute that token to sincere user. Thats awesome! As for my suggestion…  Some sort of incentive for OP holder, like future airdrop or something similar. For Sybil’s attack prevention. Should we start with bridge value at least $30 and have continous tx  atleast 2 times for continuous x weeks. For “Priced out of ethereum” that need 2tx a week on L1 are not cheap. As for me, I try every efford to avoid using L1. So thats make me not in the criteria for airdrop.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.018518518518519
                },
                {
                    "author_link": "https://gov.optimism.io/u/nut1shot",
                    "index": "130",
                    "likes": "1",
                    "time": "25/05/2022-06:23:00",
                    "content": "I agree with the team. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Johnny",
                    "index": "131",
                    "likes": "0",
                    "time": "25/05/2022-07:18:21",
                    "content": "Great！I agree！But the bridge isn’t the key one,  DEX liquidity & usage is more important. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/lactobacillus",
                    "index": "132",
                    "likes": "0",
                    "time": "25/05/2022-07:35:00",
                    "content": "Interesting and agree with Joseph Idea. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/akibara123",
                    "index": "133",
                    "likes": "0",
                    "time": "25/05/2022-17:35:52",
                    "content": "Suggestions for how to tune spam filters to reward real users.  At least before announcing the airdrop, it should be filtered out sybil first so as not to upset each other. Positive sum behaviors you think contribute to the community.  The person who gives feedback should also receive an airdrop. Airdrop logistics (size, frequency, etc)  Should be shared with people who are involved with the use of DApps.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.252272727272728
                },
                {
                    "author_link": "https://gov.optimism.io/u/Tuqui",
                    "index": "134",
                    "likes": "1",
                    "time": "25/05/2022-22:06:42",
                    "content": "Add as Sybil attacker list those who minted hundreds of Optimism Collective: Hello World mirror NFT token, clearly they are bad actors. We went to 500k+ NFTs and some bad actors minted thousands, they have a very bad spirit. Or if its too harsh, for the Airdrop #2 make them have -500 tokens (or some other substract number to their final amount) for bad behaviour. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 2.9781250000000004
                },
                {
                    "author_link": "https://gov.optimism.io/u/nongknot",
                    "index": "135",
                    "likes": "0",
                    "time": "26/05/2022-04:43:15",
                    "content": "does anyone have an example of the sybil atk? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/KANTT",
                    "index": "136",
                    "likes": "0",
                    "time": "26/05/2022-06:36:33",
                    "content": "I think the next airdrop will be attacked again so we should find a way to eliminate  Sybil attackers. For the next airdrop, I think we should allocate for #1 HODL who believes in OP. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/nanopunk",
                    "index": "137",
                    "likes": "0",
                    "time": "26/05/2022-07:18:48",
                    "content": "Fees were fine to me and I paid them, however Im in a huge favour to allow others with low budget to also get a chance for an airdrop. These people need this most dont you all think ? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.645833333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/hoofeng",
                    "index": "138",
                    "likes": "0",
                    "time": "26/05/2022-08:18:38",
                    "content": "空投应该是多维度去考察，这样才会避免女巫更多的出现 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Nop99",
                    "index": "139",
                    "likes": "0",
                    "time": "26/05/2022-08:44:45",
                    "content": "    Mahachai:  Please seriously consider blacklisting these addresses from the Airdrop#1 and the future airdrops. We understand Optimism encourage network volumes and activities but kindly consider the security of the network as the heart of the chain, ser. I’m having my followers discussing on this network threat from Sybil attackers and express strong opinions on this feedback   I agree Giving only 500K OP token holders can have a negative impact on the network. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.333333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "140",
                    "likes": "0",
                    "time": "26/05/2022-10:47:21",
                    "content": "A simple example would be depositing eth in a new address, complete the farming steps, move the fund to another address and do the same again, repeat this multiple number of times. This is one example. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.236363636363636
                },
                {
                    "author_link": "https://gov.optimism.io/u/0xWeston",
                    "index": "141",
                    "likes": "0",
                    "time": "26/05/2022-10:53:30",
                    "content": "Yes this is possible; and I think an excellent idea. I use different wallets for many different reasons primary ones being security and privacy, and this is a large problem needing a solution as airdrops are a core pillar of the current crypto economic landscape and I think always will be. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.285714285714286
                },
                {
                    "author_link": "https://gov.optimism.io/u/BigName",
                    "index": "142",
                    "likes": "0",
                    "time": "26/05/2022-11:20:48",
                    "content": "Good job done. It’s good to detect the airdrop hunters and weed them out. It’s a win for qualified addresses now ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.666666666666668
                },
                {
                    "author_link": "https://gov.optimism.io/u/killstory",
                    "index": "143",
                    "likes": "1",
                    "time": "26/05/2022-12:29:43",
                    "content": " Daily active transactions in 1 day Airdrop for Deployer and validator node of optimism Airdrop for Optimism NFT trader - to attract them to use Optimism  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.666666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/ajyoda",
                    "index": "144",
                    "likes": "0",
                    "time": "26/05/2022-13:40:17",
                    "content": "Airdrop #1 was fantastic and refreshing. For the filtering I think wallet that has same transaction amount around the same time should be considering sybils because they likely to follow an airdrop guide from the same source. Also this can really be false so maybe need to track the wallet for long amount of time to conclude if they are true or false sybil. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.2
                },
                {
                    "author_link": "https://gov.optimism.io/u/zy1800",
                    "index": "145",
                    "likes": "0",
                    "time": "26/05/2022-15:47:16",
                    "content": "I also think it’s great and hope to pass. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Piyush",
                    "index": "146",
                    "likes": "0",
                    "time": "26/05/2022-15:56:21",
                    "content": "I totally support to eliminate sybil attackers, bcoz this will really impact dAO decision in a good way. Totally in favor of this… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.125
                },
                {
                    "author_link": "https://gov.optimism.io/u/apkiwlove2",
                    "index": "147",
                    "likes": "0",
                    "time": "26/05/2022-16:33:55",
                    "content": "hi i think in the future can add on kyc. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Teerapat_hdi",
                    "index": "148",
                    "likes": "1",
                    "time": "26/05/2022-18:26:06",
                    "content": "Thank you for organize sybil ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Tuqui",
                    "index": "149",
                    "likes": "0",
                    "time": "26/05/2022-21:51:26",
                    "content": "I think that how it is its ok, there are like 700 wallets in the higher tiers (5 or 6 categories) that maybe most of them are OGs … they have their wallets for long time doing all things with good practices and thats why they have that categories. Its more than 3000+ if you count 4 categories. Its a lot of wallets. I think these kind of wallets are most probably to participate in governance, active members, holders, etc. I know a lot of people -as myself- that if we start gathering all their wallets they might get into the 4+ categories, i would welcome that but i think that then there wont be much distinction between categories. The reason i dont like it its because doing this of joining seperate wallets then lot of people could play it out for next airdrop if it turns like this. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.819444444444445
                },
                {
                    "author_link": "https://gov.optimism.io/u/kitonnum",
                    "index": "150",
                    "likes": "1",
                    "time": "27/05/2022-01:29:47",
                    "content": "Let me share my idea, after launching a token public sale you should provide the token airdrop or NFT airdrop again which has the condition to distribute to those who hold and do not sell tokens because they are confident in this project. They will build a good community for this project. The community will grow from them. Thank you. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Seizhin",
                    "index": "151",
                    "likes": "2",
                    "time": "27/05/2022-16:25:28",
                    "content": "I suggest multiple transactions is required to get the airdrop, and at least used the Optimism Bridge before. The airdrop size should be considered as the attack may lead to large DAO vote swing. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.857142857142857
                },
                {
                    "author_link": "https://gov.optimism.io/u/p0d34",
                    "index": "152",
                    "likes": "0",
                    "time": "27/05/2022-16:28:50",
                    "content": "I’m excited for airdrop #1 and think you’ve done an amazing job thus far. By the looks of it, there will be many more chances to get more airdrops in the future. As long as people are incentivized to use the network it’s great and effective and that should be the main focus in my opinion. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.859848484848485
                },
                {
                    "author_link": "https://gov.optimism.io/u/time118",
                    "index": "153",
                    "likes": "0",
                    "time": "27/05/2022-16:36:47",
                    "content": "Thank you for organize sybil ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Dorys",
                    "index": "154",
                    "likes": "0",
                    "time": "27/05/2022-23:48:58",
                    "content": "I definitely agree with you. Not everyone can use L1 very frequently ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.324999999999999
                },
                {
                    "author_link": "https://gov.optimism.io/u/Dorys",
                    "index": "155",
                    "likes": "0",
                    "time": "27/05/2022-23:51:13",
                    "content": "When you say daily active user, you mean using optimism everyday? I think that just screams airdrop farmer ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.192708333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/Dorys",
                    "index": "156",
                    "likes": "0",
                    "time": "27/05/2022-23:59:47",
                    "content": "This doesn’t make sense in my opinion. Why would someone need to waste gas daily claiming airdrop? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/nnkppee",
                    "index": "157",
                    "likes": "0",
                    "time": "28/05/2022-05:32:18",
                    "content": "I would suggest to launch check in campaign for proving the discipline of joining this project. yeah it sound that simply but i would believe this method can help you somehow ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/darwin",
                    "index": "158",
                    "likes": "0",
                    "time": "28/05/2022-08:00:25",
                    "content": "I like very much the move that Optimism made to remove OP farmers accounts that could hurt OP and its DAO. We are sailing in right direction ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.364285714285715
                },
                {
                    "author_link": "https://gov.optimism.io/u/Koqe1",
                    "index": "159",
                    "likes": "0",
                    "time": "28/05/2022-12:41:53",
                    "content": "Looking good when its time? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/youyou",
                    "index": "160",
                    "likes": "0",
                    "time": "29/05/2022-03:12:26",
                    "content": "Is it not possible to modify the airdrop rules now? The second airdrop should increase the proportion of the community, such as the community, and discord ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/usmile",
                    "index": "161",
                    "likes": "1",
                    "time": "29/05/2022-03:17:03",
                    "content": "me tooI agree with you team should do something right for community ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.428571428571428
                },
                {
                    "author_link": "https://gov.optimism.io/u/Justin",
                    "index": "162",
                    "likes": "2",
                    "time": "29/05/2022-05:14:23",
                    "content": "What if you could give airdrop users the ability to gift a very small amount of tokens to any wallet they choose?  You keep the quantity small so that it isn’t a big loss if most people self-deal to another wallet they control … but a certain percentage would pay it forward to a friend that might be curious.  Imagine giving a few dozen or a hundred tokens to a CEX user that might just set up a wallet if they were intrigued by a small quantity of tokens.  If we really want to expand crypto beyond our circle jerk then - how can we not just encourage people to bridge over to optimism from other networks but how do we get people to be brave enough to leave the centralize exchanges for the decentralized world? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.193452380952381
                },
                {
                    "author_link": "https://gov.optimism.io/u/MinimalGravitas",
                    "index": "163",
                    "likes": "0",
                    "time": "30/05/2022-21:38:51",
                    "content": "I get what you’re saying, but if someone hasn’t moved off of a CEX yet then what’s the likelyhood that they are going to participate in governance anyway? I suppose if you were gifting them tokens then you could talk them through the voting process etc, but then you can always just send them any tokens anyway, OP will be transferable just like any other ERC-20. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.375
                },
                {
                    "author_link": "https://gov.optimism.io/u/Justin",
                    "index": "164",
                    "likes": "0",
                    "time": "31/05/2022-04:13:08",
                    "content": "I generally think that people become interested because of the tokens and then some discover a fascinating ecosystem.  It would only be a percentage, but if the spirit of the “pay it forward” part of the airdrop would be explicitly stated, some people would try to put them in the right hands.  Anyway, just an idea. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.285714285714286
                },
                {
                    "author_link": "https://gov.optimism.io/u/Magic",
                    "index": "165",
                    "likes": "0",
                    "time": "31/05/2022-09:18:16",
                    "content": "My suggestions for the future are:  min 10 transactions on the network bridge for at least 0.1 ETH use of at least 2 daaps  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/investgineer",
                    "index": "166",
                    "likes": "2",
                    "time": "31/05/2022-17:48:41",
                    "content": "We witnessed the turmoil today when people wanted to make a quick buck and wanted to leave the OPTIMISTIC community. The airdrop hunters intended to claim and dump the $OP token right away. IMO, we should carefully evaluate the on-chain behavior of such wallets and the appropriateness for the next governance token distribution. The evaluation might include time-based criteria, such as how long certain addresses retain the airdrop. This should be treated optimistically as an incentive rather than a penalty. To preserve valuable assets for LPing, HODLing, and not completely throwing away their voting rights. Cheers! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.344907407407407
                },
                {
                    "author_link": "https://gov.optimism.io/u/linbahti",
                    "index": "167",
                    "likes": "0",
                    "time": "31/05/2022-20:05:33",
                    "content": "I used the network of optimism, but got nothing. Used with the help of the uniswap exchange, made swaps for more than $1000. But, unfortunately, not a single OP coin was credited to me for my actions My wallet 0x6161cD1Ab48968D1d827ce7fAf5cc64264B2C532 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.3392857142857135
                },
                {
                    "author_link": "https://gov.optimism.io/u/iampermxx",
                    "index": "168",
                    "likes": "0",
                    "time": "01/06/2022-01:06:13",
                    "content": "I’d like to advise you to consider all the dumpsters for Airdrop#2. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/y127cx",
                    "index": "169",
                    "likes": "0",
                    "time": "01/06/2022-02:01:38",
                    "content": "可以多激励 L2 桥（fe Hop）流动性，让市民轻松往返 Optimism ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/strauss07",
                    "index": "170",
                    "likes": "0",
                    "time": "01/06/2022-04:14:40",
                    "content": "this is so helpful thanks ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Reus",
                    "index": "171",
                    "likes": "1",
                    "time": "01/06/2022-04:25:26",
                    "content": "I want to ask anyone if we have proposal of wallet that wrote contract to claim OP$ before official claimed  except core team, will not be eligible to any OP airdrop after that, because I think it’s not fair for anyone who wait for official announcement. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/Illpo",
                    "index": "172",
                    "likes": "2",
                    "time": "01/06/2022-04:37:34",
                    "content": "I agree with this.  The OP team has been very clear that the the OP token isn’t just a monetary unit, but a unit of responsibility for those who want to participate in the stewardship of the network and community.  I would add my voice to the chorus of others who see the dissonance between holding the OP token and selling it shortly after the Airdrop #1.  For Airdrop #2, I’d propose filtering out people who received OP from the first airdrop and have subsequently sold their airdropped OP tokens.  If the OP token primarily represents responsibility in the OP community, it seems inconsistent to then bestow MORE responsibility via Airdrop #2 on addresses/individuals who already offloaded the responsibility received from Airdrop #1. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.066666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/kryos.eth",
                    "index": "173",
                    "likes": "2",
                    "time": "01/06/2022-05:06:09",
                    "content": "I sold my tokens immediately at $3 and bought again at $1, why should I be excluded from future airdrops for profiting? I use at least 20 Dapps on optimism on a regular basis, and want to be active in governance. What you suggest would exclude me, an active OP user who some days pays $100 in transaction fees and has a desire to actively participate in governance. So because I profited off my OP tokens and you did not I should be excluded? This is a bad idea. I hold OP tokens too, and I am an active daily user. Maybe consider people who dumped 100% and never interacted but stances like the one above are unreasonable at best and ridiculous at worst. This is crypto, people trade their tokens to profit. Tomorrow I’ll hold the same amount of OP but have profited along the way. If I remember correctly part of Optimisms mission statement states that profitability is very important. I very much align with this viewpoint. I should not be excluded while I own hundreds of OP tokens and have much more locked on Optimism. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.003703703703703
                },
                {
                    "author_link": "https://gov.optimism.io/u/mies_van_der_flo",
                    "index": "174",
                    "likes": "0",
                    "time": "01/06/2022-06:40:34",
                    "content": "Where do u see rule saying u will be excluded from future airdropa after selling any of your OP tokens? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/darwin",
                    "index": "175",
                    "likes": "0",
                    "time": "01/06/2022-07:36:04",
                    "content": "If the trade is open is normal someone to sell others will buy. I would say more for the delegates that if they sell, again its more of an impression of their dedication in the project. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.4375
                },
                {
                    "author_link": "https://gov.optimism.io/u/EMELA",
                    "index": "176",
                    "likes": "0",
                    "time": "01/06/2022-09:16:42",
                    "content": "True. I agree this one is a serious threat to the future safety and growth of OP. Please team, avert this early enough. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.116666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/mrax33",
                    "index": "177",
                    "likes": "0",
                    "time": "01/06/2022-09:16:56",
                    "content": "it had a lot of problems ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/donutQ",
                    "index": "178",
                    "likes": "2",
                    "time": "01/06/2022-10:09:59",
                    "content": "even there’s a lot of thread that happened but team git everything under control, that’s such amazing to see, glad i’m here as one of the community <3 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.625
                },
                {
                    "author_link": "https://gov.optimism.io/u/mies_van_der_flo",
                    "index": "179",
                    "likes": "0",
                    "time": "01/06/2022-10:17:17",
                    "content": "I belive keeping more than half of airdrop for hodl is good requirement for future airdrops ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.291666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/bciase",
                    "index": "180",
                    "likes": "0",
                    "time": "01/06/2022-10:32:43",
                    "content": "I think this airdrop was messed up by witches ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/hamidreza",
                    "index": "181",
                    "likes": "0",
                    "time": "01/06/2022-10:40:43",
                    "content": "Great project . I love it ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/kkishow",
                    "index": "183",
                    "likes": "0",
                    "time": "01/06/2022-10:56:41",
                    "content": "This is good airdrop!!! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/BlackOmega",
                    "index": "184",
                    "likes": "2",
                    "time": "01/06/2022-14:08:10",
                    "content": "To filter bots and multi-accounts, I recommend viewing the past history of wallets. If an account has interacted on the Ethereum network (buy / sell NFT on Opensea, trade on Uniswap, 1Inch, Matchaxyz, Ethereum trade on Metamask, etc). I wouldn’t set trade limits because not all of them are whales. I think that having interacted in the past with dapp on Ethereum is enough to make the selection ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.166666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/tyevlag",
                    "index": "185",
                    "likes": "1",
                    "time": "01/06/2022-14:09:34",
                    "content": "The airdrop process was very smooth, well done ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.6
                },
                {
                    "author_link": "https://gov.optimism.io/u/frankrx15",
                    "index": "186",
                    "likes": "1",
                    "time": "01/06/2022-14:14:02",
                    "content": " I would like to have an event to send work for a chance to win an Airdrop, which may be divided into different levels, such as various content creation tasks. including animation videos, articles, graphics  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Boomer0x",
                    "index": "187",
                    "likes": "0",
                    "time": "01/06/2022-14:18:00",
                    "content": "Y’all were ass holes not coming out with the “official announcement” and simultaneous coinbase listing until like 6 hours after the claims site went live. Claims site should have been live as soon as the smart contract was launched and that should have been announced all together. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.811688311688313
                },
                {
                    "author_link": "https://gov.optimism.io/u/ceej",
                    "index": "188",
                    "likes": "0",
                    "time": "01/06/2022-14:28:00",
                    "content": "The Beacon Chain depositors have the true diamond handers. They would be helpful to be hodlers on the network. The airdrop for me was pretty buggy never had enough gas to be able to claim due to network load. Had to bridge in more eth to get the required gas. First iteration was rocky but that’s the point to continue iterations as we improve. Communications from the team was great! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.703125
                },
                {
                    "author_link": "https://gov.optimism.io/u/bobby",
                    "index": "189",
                    "likes": "1",
                    "time": "01/06/2022-16:02:18",
                    "content": "Cross-posting feedback from   Wallet that wrote contract to claim $OP before official annoucement shouldn't be eligible for any upcoming airdrop (except core team) - #8 by OPUser   Should the address of the OP be minted in advance by contract method should be punished（对提前铸造op的地址是否应惩罚）） - #3 by cpto   ",
                    "links": [
                        "https://gov.optimism.io/t/should-the-address-of-the-op-be-minted-in-advance-by-contract-method-should-be-punished-op/2191/3"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/joshuaffub",
                    "index": "190",
                    "likes": "2",
                    "time": "01/06/2022-16:42:08",
                    "content": "This sounds like a fair idea, could this be done so as to show appreciation for those who support what they can, as what they can might not be much but to the project it ads up huge and brings loyalty of the small but many ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.550000000000001
                },
                {
                    "author_link": "https://gov.optimism.io/u/Prometheus",
                    "index": "191",
                    "likes": "1",
                    "time": "01/06/2022-17:38:11",
                    "content": "    kryos.eth:  I sold my tokens immediately at $3 and bought again at $1, why should I be excluded from future airdrops for profiting?   Because you care more about profits than keeping your tokens safe in your wallet?     kryos.eth:  What you suggest would exclude me, an active OP user who some days pays $100 in transaction fees and has a desire to actively participate in governance.   If you already profited in the #1 airdrop why do you need more from airdrop #2 or whatever? Airdrop #2 shouldn’t be for profit takers because they have plenty of ways to take profits. They don’t need more tokens via a #2 airdrop. It should be quite easy to understand why people that sold their #1 airdrop don’t need a #2.     kryos.eth:  Tomorrow I’ll hold the same amount of OP but have profited along the way.   Exactly… congratulations that’s why people selling don’t need airdrop #2. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.203703703703703
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "192",
                    "likes": "1",
                    "time": "01/06/2022-18:08:50",
                    "content": "    Prometheus:  Because you care more about profits than keeping your tokens safe in your wallet?   I am against it, once they claim it, its their token and they have full right on what they want to do with it. What will be the eligibility criteria for next airdrop that is yet to be decided and if this proposal comes there I will vote against it. OP Team has mentioned this earlier too, they are not against selling and no one should be. I can still agree on giving incremental reward, like you sold 50% of your claimed stack in 24hr, you will get less reward in comparison to someone who sold after 1 week.  Just like we did this time, different criteria and different reward but blocking them is wrong and I dont support it. If you dont want them to sell, give them a soul bound NFT. What I am totally support is blocking the address that claimed via smart contract before it was live, officially.  More here ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.649891774891774
                },
                {
                    "author_link": "https://gov.optimism.io/u/Prometheus",
                    "index": "193",
                    "likes": "2",
                    "time": "01/06/2022-18:13:58",
                    "content": "    OPUser:  What I am totally support is blocking the address that claimed via smart contract before it was live, officially.   People selling at $3 and $2 did it before the “official” release. Anyway, let’s make this even simpler. Everyone that got in the #1 airdrop shouldn’t be eligible for airdrop #2. Sure… people will always find ways to get some more tokens from airdrop #2 anyway but why should we give more tokens to the same people? By the way, many people seem to assume they will get more tokens in airdrop #2 but they need to assume the opposite. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.3059163059163055
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "194",
                    "likes": "1",
                    "time": "01/06/2022-18:29:03",
                    "content": "    Prometheus:  People selling at $3 and $2 did it before the “official” release.   we are not on the same page, i guess, price does not matter, if they sold or not, if they are providing LP or participating in gov, it does not matter. What I am advocating is the approach they choose was against public good, it was chaotic, instead of waiting for few more hours they choose to take the another path. This should not be encouraged and I would vote to discard those addresses. Again, I am not talking about future drop, we have lot of time for that, I am talking about what happened and what we can do to discourage such behavior. Beauty of iterative approach is falling can be fun too, we failed at launch but for next one we are more prepared. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.590909090909091
                },
                {
                    "author_link": "https://gov.optimism.io/u/Prometheus",
                    "index": "195",
                    "likes": "0",
                    "time": "01/06/2022-19:05:14",
                    "content": "    OPUser:  we are not on the same page, i guess, price does not matter, if they sold or not, if they are providing LP or participating in gov, it does not matter. What I am advocating is the approach they choose was against public good, it was chaotic, instead of waiting for few more hours they choose to take the another path.   If you believe in this then price was the main factor for claiming as soon as possible. Why would they rush the claim otherwise? I’m still not sure if it was a bad thing, overall it was neutral and a nice stress test to the network. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.371212121212121
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "196",
                    "likes": "0",
                    "time": "01/06/2022-20:03:46",
                    "content": "    Prometheus:  Why would they rush the claim otherwise?   this isnt my concern as this thread is not related to discuss the seller intention. What we have as of now is addresses of user who used the SC and now we need to reach on a consensus, what action the team can take to penalize such user. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.166666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/Endless",
                    "index": "197",
                    "likes": "0",
                    "time": "01/06/2022-20:04:18",
                    "content": "Good Ecosystem and fast ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/gunktd",
                    "index": "198",
                    "likes": "0",
                    "time": "02/06/2022-16:45:34",
                    "content": "I agree with this guy!! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/bal281",
                    "index": "200",
                    "likes": "0",
                    "time": "02/06/2022-17:16:55",
                    "content": "I think sybil filtering was a good idea because many people who spam the wallet for additional airdrops won’t be able to claim their prizes. Despite the fact that I received a large airdrop by donating simply in Gitcoin, I think the airdrop size was way too much for what I have done. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.761904761904763
                },
                {
                    "author_link": "https://gov.optimism.io/u/suquare",
                    "index": "201",
                    "likes": "0",
                    "time": "02/06/2022-17:35:36",
                    "content": "Hey, I think I am eligible for the airdrop because of L1 bulk checkout on Gitcoin. But it is saying otherwise. Can I post the txid here so someone can shed light on it? Thanks! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.625
                },
                {
                    "author_link": "https://gov.optimism.io/u/kullu90",
                    "index": "202",
                    "likes": "0",
                    "time": "02/06/2022-18:34:16",
                    "content": "In crypto community, airdrops are usually aimed at big volume traders and the small guy is almost always termed as an airdrop farmer and left out. I hate that. I thank the optimism team for not doing that and that is what increases my trust in the project by many folds. Not every small investor is an airdrop farmer. The point can be clearly seen by looking at the accounts who sell their $OP and who don’t sell. Why are the people who got the largest amount of airdrop and dump it, not called airdrop farmers? People who get small allocation of $OP have a very good reason to sell $OP and get some much needed money. So, if they are not selling their $OP (believe me it is very hard to resist), that says something about their trust in the project and community. So, I think that optimism should keep that in mind moving forward and accordingly reward such accounts and not the ACTUAL AIRDROP FARMERS who already have a lot of money and get huge chunks of airdrop and sell it to tank the project. It could be an experiment worth doing if we aim to bring the crypto to masses. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.072135416666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/JTBiggaFigga",
                    "index": "203",
                    "likes": "1",
                    "time": "02/06/2022-21:39:18",
                    "content": "To be honest, I’ve only flirted with the idea of even using Optimism. Never fully engaged, since I was kind of waiting out to see which L2 would rise to the top. I’ve mainly only been engaged in only L1 chains, like ETH, AVAX, FTM, and SOL, and only received a small OP airdrop for being a Curve DAO voter. I believe that adding that small amount for DAO members was a good tactic and will encourage more activity, both in governance and dApps.  Even with the small amount. So for me, it got my attention!!! I’m going to keep my OP, participate in governance, while also looking to add more positions on the supported dApps, especially for ones I’m already involved in like Curve and AAVE on other chains. Nice touch!!! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.027099609375
                },
                {
                    "author_link": "https://gov.optimism.io/u/anasjoe",
                    "index": "204",
                    "likes": "0",
                    "time": "03/06/2022-02:03:31",
                    "content": "more airdrop for OP Diamomd hand Holder ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/Hippotangmo",
                    "index": "205",
                    "likes": "0",
                    "time": "03/06/2022-08:54:55",
                    "content": "In my opinions, next airdrop should include holder of the OP, and more for donators. the idea of widespread airdrop to attach more user to Optimism chain is good but I think if you can do the option for KYC to get more airdrop will gather more collective data for future of Optimism. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.928571428571429
                },
                {
                    "author_link": "https://gov.optimism.io/u/Tjure07",
                    "index": "206",
                    "likes": "2",
                    "time": "03/06/2022-10:31:24",
                    "content": "Why are you assuming that small investors didn’t dump their tokens and only the ones with larger amounts of OP sold quick? That’s not right because I followed the Discord token-chat a few days prior to the launch date and many couldn’t wait to claim and dump the token. I am 100% sure many of them where small bags and the differentation which should be made is: Who holds the airdrop (regardless if a whale or a small bag holder) after the launch and who dumps it? Every holder is important to the ecosystem and an active governance. Thus a time calculation would make sense: the longer one holds OP, the more rewards he should receive for airdrop round #2 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.408482142857142
                },
                {
                    "author_link": "https://gov.optimism.io/u/pingdaddy",
                    "index": "207",
                    "likes": "1",
                    "time": "03/06/2022-12:30:00",
                    "content": "I totally agree with this topiv, please take this into account. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/neozaru",
                    "index": "208",
                    "likes": "0",
                    "time": "03/06/2022-15:00:51",
                    "content": "Similar experience here. Very slick and clear airdrop process, with great explanation of the airdrop conditions and process. Loved the delegator selection system with the themes and all, although technically this forces users to choose a delegator in a short window meaning more risk of delegator concentration. A pseudo-random selection from a voted list could be a nice concept too for those who are not educated / don’t have time to look at it. Otherwise might reproduce same flaws as in traditional system and politics. A bit disappointed with zkSync not being taken in account for Gitcoin donations especially with the “combined criteria” system but at the same time this is free tokens and more energy needed to be spent for bot filtering and criteria design itself. Not the first project struggling with zkSync in their airdrop so I imagine this is an harder thing to do (or that Gitcoin got sybil-ed with it ?) About future airdrops, I am not sure if they should be done to EOA or directly to the projects building on Optimism (those projects can then individually decide how they distribute to EOAs) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5271739130434785
                },
                {
                    "author_link": "https://gov.optimism.io/u/keynes",
                    "index": "209",
                    "likes": "0",
                    "time": "03/06/2022-15:17:08",
                    "content": "I agreed the team should do something to make it right. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.428571428571428
                },
                {
                    "author_link": "https://gov.optimism.io/u/poppakkawat",
                    "index": "210",
                    "likes": "0",
                    "time": "03/06/2022-16:23:05",
                    "content": "The DAO decision should be a sum from a wide range of users, not a few people that are Sybil attackers. This could even ruin the network we are creating! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0625
                },
                {
                    "author_link": "https://gov.optimism.io/u/ajdarvv",
                    "index": "211",
                    "likes": "0",
                    "time": "03/06/2022-16:46:41",
                    "content": "Criteria for the next drop for me has to include:  Gitcoin donors via Zksync who donated prior to the cut off date for airdrop #1 donations on L1 (the same allocation as Gitcoin donors in airdrop #1 should be applied as I think this is something a lot of people were disappointed in) OP users that have interacted with a minimum of say 5 applications on Optimism Members who have contributed on here (although I do not know how this could be implemented, but I think it would help bring more discussion this forum)  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/leumar",
                    "index": "212",
                    "likes": "0",
                    "time": "03/06/2022-20:56:16",
                    "content": "Thanks for the airdrop. Could have been tested better before. Communication was no top, but ok ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.1875
                },
                {
                    "author_link": "https://gov.optimism.io/u/MinimalGravitas",
                    "index": "213",
                    "likes": "2",
                    "time": "03/06/2022-21:01:54",
                    "content": "    ajdarvv:  Members who have contributed on here (although I do not know how this could be implemented, but I think it would help bring more discussion this forum)   As someone contributing here quite a lot I’m not sure that’s such a good idea. We might see a lot of meaningless noise from people just trying to get their interaction numbers up! There’s also not way to filter out sockpuppets / Sybils on the forum (or Discord for that matter) so it would be an easy metric to game. I completely agree with you about the zkSync Gitcoin donors though. I got that part of the airdrop because I’d used mainnet to donate for a round or two, but people who were smart enough to use zkSync straight away are if anything more likely to want to participate in governance of an L2 than those who just used Ethereum L1! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.418792517006803
                },
                {
                    "author_link": "https://gov.optimism.io/u/Sereno",
                    "index": "214",
                    "likes": "0",
                    "time": "04/06/2022-07:09:12",
                    "content": "You can check the use of different ecosystem platforms to verify that you are an Optimist. This Airdrop made me turn my eyes and today they have my full attention. <3 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/toranit",
                    "index": "215",
                    "likes": "0",
                    "time": "04/06/2022-07:14:39",
                    "content": "I concern about some people can claim the airdrop before the official announcement. I don’t have issue about the OP price but this incident made the team look unprofessional. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/G.GHANDI",
                    "index": "216",
                    "likes": "1",
                    "time": "04/06/2022-08:20:53",
                    "content": "First of all Thanks for including me into the community. It seems off to a great start. Whatever is decided for future airdrops I hope nothing is announced before snapshot. No frontrunning. I’m not sure how governance voting will work but if there is voting on the subject, the snapshot should be taken before any voting decisions are taken. That’s my 2 cents worth ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.80952380952381
                },
                {
                    "author_link": "https://gov.optimism.io/u/project_uwb",
                    "index": "217",
                    "likes": "0",
                    "time": "04/06/2022-12:18:34",
                    "content": "I have posted this idea as part of another thread, but just found this feedback thread. So will post this here as well. I think there is a lot of discussion about airdrop dumpers and how to effectively get users not to dump but actually play the positive sum game! I think is has to be the game theory that incentives are not just earned by being an early adopter but by continuing to be part of the ecosystem and actually contributing. I guess there is a need to be able to measure contibutions to be able to reward and retain net positive users. This will turn to a flywheel affect and will attract more net positive contributors. I think also future airdrops that are big in size should think about having a vesting period and a way to accelerate vesting based on positive contribution. This way users will actually try out to be part of the community rather than just harvest the airdrop and move on! If we even have an increased retention of 10 or 20% more users that actually contributed I am sure it will be great for the ecosystem! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.956611570247934
                },
                {
                    "author_link": "https://gov.optimism.io/u/Iceped03",
                    "index": "218",
                    "likes": "0",
                    "time": "04/06/2022-13:54:01",
                    "content": "I agree with him. Please consider this issues. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "219",
                    "likes": "0",
                    "time": "04/06/2022-18:27:04",
                    "content": "Are we not gonna discuss Phase 0 1Inch funding proposal ? It seems the team is planning on keeping the whole stack to themselves. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Jeremylau",
                    "index": "220",
                    "likes": "0",
                    "time": "05/06/2022-01:58:37",
                    "content": "I think the main reason is that the marketing of the OP token launched by the optimistic team was too weak and failed to attract the attention of the market. There was no OP even on the CMC hot search on the first day of the launch. The team was too low-key, or there were problems with marketing ideas, and they failed to cooperate with several CEX joint activities in advance. It is clear that BINANCE, CB, and FTX have indicated in advance that they will launch OP transactions, but obviously the team has not Actively contacted the person in charge of the platform for negotiation, which resulted in the Binance recharge OP being stuck for 24 hours (perhaps to protest the marketing failure of the optimistic team), so the project wants to develop rapidly and gain strong support from the market, the team still needs to learn better marketing and co-op strategy! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.142857142857142
                },
                {
                    "author_link": "https://gov.optimism.io/u/gilescope",
                    "index": "221",
                    "likes": "0",
                    "time": "05/06/2022-05:48:37",
                    "content": "Maybe a bug: appeared as having used optimism (correct), but then later I check back and that’s not the case, but now I am a DAO voter (not quite sure which DAOs it was looking at but yeah try and participate when I have time). It’s appreciated to have some tokens but surprised that the reasons flip flopped. (Hoping there’s some love for gitcoin zksync users later - got to reward L2 usage.) (Oh and I love the focus on retroactive public goods and a citizen house - hope it works out) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/MAMI",
                    "index": "222",
                    "likes": "0",
                    "time": "06/06/2022-07:44:30",
                    "content": "I believe in the team and hopefully everything is fine for us. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.083333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/ruKawin",
                    "index": "223",
                    "likes": "0",
                    "time": "06/06/2022-07:57:53",
                    "content": "Hi, I personally don’t think that the airdrop was communicated or marketed enough, which may have been an intentional self-selecting mechanism for quality and active community pooling. I for one, had no idea that it was happening and would have played more of a role to earn the airdrop if I were. What are everyone’s thoughts about this for the 2nd airdrop? Should we market it more or less, and do the rewarded behaviors or actions need to change or are they good as they are? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.875
                },
                {
                    "author_link": "https://gov.optimism.io/u/yonexman",
                    "index": "224",
                    "likes": "0",
                    "time": "06/06/2022-18:50:59",
                    "content": "thank you, for first round op airdrop and i waiting for second round airdrop from op,thank you again ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.8125
                },
                {
                    "author_link": "https://gov.optimism.io/u/SMIN",
                    "index": "225",
                    "likes": "0",
                    "time": "06/06/2022-18:54:18",
                    "content": " Love this idea @Tiger ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/Eklypse",
                    "index": "226",
                    "likes": "1",
                    "time": "07/06/2022-01:52:57",
                    "content": "I found the first airdrop fair and the process to claim very instructive. Some people sold part of the airdrop to provide the other half on a pair with OP in Uniswap by example. Those people contribute in the usage of the optimism network and help the OP token to be more liquid which I think is a good thing. So I disagree with those who want to prevent them to be eligible for further airdrop ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.286458333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/chonk",
                    "index": "227",
                    "likes": "1",
                    "time": "07/06/2022-03:53:25",
                    "content": "I think overall it was done well. i just have 2 points to put forth. Specifically these 2 categories. In light of transparency, i qualified for 3 criteria, and yes it would have been life changing money if either one below was considered. however, i will state points objectively & without bias.  Donated to Gitcoin Grants on L1  This seems counterintuitive. If we are advocating for adoption of L2s, anyone who has donated/funded grants regardless of chain should have been considered.   Priced out of Ethereum  One can make the point that this is similar to the point i raised above. Also, while this is not specific to OP, i think the industry needs to come up with better ways of quantifying airdrop eligibility. im sure there are people just like me who use different wallets for different chains. we continued transacting on L1 via a different wallet. Yes, sometimes things cross over when u need funds quickly on another chain, so you bridge. but bummed nonethless to get penalized for practicing “security hygiene” using diff wallets for diff chains.    ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.666666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/MinimalGravitas",
                    "index": "228",
                    "likes": "1",
                    "time": "07/06/2022-08:06:55",
                    "content": "    chonk:  Donated to Gitcoin Grants on L1  This seems counterintuitive. If we are advocating for adoption of L2s, anyone who has donated/funded grants regardless of chain should have been considered.    I passed the criteria for this one due to donating once via mainnet, but completely agree that zkSync donors should have been included in this. I wonder if it was a data collection difficulty rather than an intentional omission? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.9375
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "229",
                    "likes": "2",
                    "time": "07/06/2022-11:58:23",
                    "content": "Even I  thought they excluded it because it might be difficult to find the addressed donating on zkSync chain so out of curiosity I started looking into it, it took me few minutes to find Gitcoin public api with all the addressed publicly available. So I am aligned toward intentional omission. Here is the API if you want to check the address, you need to do gitcoin authentication to call the api. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.625
                },
                {
                    "author_link": "https://gov.optimism.io/u/MinimalGravitas",
                    "index": "230",
                    "likes": "0",
                    "time": "07/06/2022-12:17:31",
                    "content": "Interesting, but is there a way to tell if that list includes both zkSync and Mainnet donors? It has about 5x the number of addresses as received the Gitcoin criteria from the airdrop (Airdrop 1 | Optimism Docs) so I’d be interested to know why that is? Lots of linked accounts maybe that were dismissed as ‘Sybils’? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "231",
                    "likes": "1",
                    "time": "07/06/2022-12:26:22",
                    "content": "I not sure if its contains both mainnet and zkSync, but my address is there and i have only made the donation on zkSync, so one thing for sure that it zksync address were available. and from gitcoin documentation “endpoint available for those who’d like to just get all addresses that’ve ever funded a Gitcoin Grant”, so It seems, that json contains all the address(mainnet/zksync and other supported chains too) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.770833333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/chonk",
                    "index": "232",
                    "likes": "0",
                    "time": "07/06/2022-16:44:20",
                    "content": "that’s a good one ser. nice catch. it could also be that filtering the total amounts in terms of $$ wise if they were to set a minimum? if the idea is to open the floodgates to onboard more people to L2. having essentially 2 criteria involving L1 txns is odd. tbh, also amazed at the numbers that 19,542 wallets qualified for the “Multi-sig signers - control over a large pool of capital”. - i’m just thinking out loud here, but suppose i’m a whale, with a large pool of capital, multi-sig but they are all just belongs to one person. that qualifies? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.300865800865801
                },
                {
                    "author_link": "https://gov.optimism.io/u/Tjure07",
                    "index": "233",
                    "likes": "0",
                    "time": "08/06/2022-09:33:02",
                    "content": "Hi neozaru. How can you contribute for Gitcoin from zkSync? This sounds like an interesting option for future donations ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/TheDoctor",
                    "index": "234",
                    "likes": "0",
                    "time": "08/06/2022-15:53:42",
                    "content": "Thanks to the team for the community airdrop. I look forward to participating and learn with all of you ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/patipan.eth",
                    "index": "235",
                    "likes": "0",
                    "time": "08/06/2022-18:18:32",
                    "content": "I think the way that Optimism deal with Sybil attack is great! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/neozaru",
                    "index": "236",
                    "likes": "0",
                    "time": "08/06/2022-20:37:49",
                    "content": "(users can choose how they want to donate on Gitcoin. ZkSync is one of the options)  image1898×933 74.1 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/l3unny69",
                    "index": "237",
                    "likes": "0",
                    "time": "09/06/2022-03:09:37",
                    "content": "only who op   (holder) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Tjure07",
                    "index": "238",
                    "likes": "0",
                    "time": "09/06/2022-08:58:40",
                    "content": "Thanks, bro! I like the advantages of all these L2-networks. Hopefully Optimism will be onboarded soon ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/THEBANK",
                    "index": "239",
                    "likes": "1",
                    "time": "13/06/2022-15:29:21",
                    "content": "Thanks for eliminating Sybil attackers. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Sergey",
                    "index": "240",
                    "likes": "0",
                    "time": "16/06/2022-21:17:46",
                    "content": "to give the different amount of airdrop. The minimum amount for one time users, bigger amount for frequent users ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.166666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/lonlychs",
                    "index": "241",
                    "likes": "0",
                    "time": "02/07/2022-14:24:25",
                    "content": "it’s great  thankful  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/HuntTheFarmers",
                    "index": "242",
                    "likes": "1",
                    "time": "04/07/2022-18:46:44",
                    "content": "Didn’t filter enough for Sybil attackers. This one alone had ~71 wallets. Sybilor transferred all airdrop farmed $OP to this wallet and sold all $OP for almost $45,000 USDC.    Optimistic Ethereum L2 Explorer    Address 0x9f071bf429cb9e9ca10abfba7a793d387c388028 | Optimism The Address 0x9f071bf429cb9e9ca10abfba7a793d387c388028 page allows users to view transactions, balances, token holdings and transfers of both ERC-20 and ERC-721 (NFT) tokens, and analytics.      ",
                    "links": [
                        "https://optimistic.etherscan.io/address/0x9f071bf429cb9e9ca10abfba7a793d387c388028"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Asparagus",
                    "index": "243",
                    "likes": "0",
                    "time": "09/07/2022-08:38:19",
                    "content": "I think that it was a very generous airdrop, I am new and have been using optimism a bit. It’s good to see more projects coming over. I sold some of my op, couldn’t work how to stake ( I am new to the space and am learning in my spare time) Will look into it soon. Thank you ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.672727272727272
                },
                {
                    "author_link": "https://gov.optimism.io/u/Asparagus",
                    "index": "244",
                    "likes": "0",
                    "time": "09/07/2022-08:43:19",
                    "content": "Most people that are doing it for money would dump at least some to buy back lower if they were doing it for the money. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.333333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/Asparagus",
                    "index": "245",
                    "likes": "0",
                    "time": "09/07/2022-08:45:17",
                    "content": "How many wallets is it Acceptable to claim with. I only used one but I know a lot of people use more. That does seem rude. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.875
                },
                {
                    "author_link": "https://gov.optimism.io/u/konkinbiw",
                    "index": "246",
                    "likes": "0",
                    "time": "09/07/2022-16:18:12",
                    "content": "i agree with you. We should stimulate liquidity from many sides. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/HuntTheFarmers",
                    "index": "247",
                    "likes": "0",
                    "time": "10/07/2022-03:14:46",
                    "content": "I’m not part of the team so I have no idea how many wallets are acceptable. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/Asparagus",
                    "index": "248",
                    "likes": "0",
                    "time": "10/07/2022-22:47:51",
                    "content": "Thanks, I guess it’s up to each individual to do what’s right, seems there are some good things happening on op ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.482142857142858
                },
                {
                    "author_link": "https://gov.optimism.io/u/Tjure07",
                    "index": "249",
                    "likes": "0",
                    "time": "11/07/2022-13:54:28",
                    "content": "If you interact with the wallets and use them frequently in the OP-ecosystem you are an active user and it separates you from an airdrop farmer. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.916666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/edson",
                    "index": "250",
                    "likes": "1",
                    "time": "20/07/2022-15:07:16",
                    "content": " Timing of Airdrop OP airdrop was one of my favorite airdrops. The timing of the airdrop seemed good at the time, as it looked like there was a market recovery about to happen. Unfortunately, there was a small correction after it, bringing down OP with it. As the market is recovering, OP is going up aggressively as well. TLDR; on that point, unlucky timing but it doesn’t matter in the end.  On punishing past airdrop participants It’s good to define what the goals of the airdrop are. Immediately after the first airdrop, there was a forum post suggesting that no one who sold their tokens should be eligible for future airdrops. People may sell for a variety of reasons.  For example, airdrops are taxed as income the moment they are received, so it’s responsible to sell some to set aside for taxes. Was the purpose of the airdrop so no one would sell the airdrop? If so, then yes, not giving an airdrop to people who sold it seems reasonable. But is the purpose of the airdrop to distribute governance, or to incentivize people to use Optimism? If so, I don’t think withholding an airdrop from users of the network is aligned with those goals.  Governance experience of the airdrop With regards to the experience with the previous airdrop. My understanding is OP is mainly a governance token. So, I would have liked more transparency around how to participate in governance from the Optimism website. I had to ask around in Discord to get this information, and it took a while to get the answers I was looking for. For example, the process for how delegates were chosen in the claims page wasn’t clear to me. Or how new people were to be added to it. Also, there is an option to delegate anyone not listed, even your own address. However, there’s no guidance on where to go from there. There was no link to the page where votes take place. The option to delegate to someone not listed in the page, to delegate whoever you’d like, was hard to find as well. If I were to purchase OP tokens, for example, my intention would be to participate in governance directly, as the best way to make sure your representative votes the way you want is by being your own representative. We have the technology now where electing representatives is no longer a requirement. There’s no one room people need to be in to sign off on decisions like there were in ~1787 when the US government was created. We can discuss online. And we use token allocation proven onchain to weigh votes. So this barrier to participate in governance as an individual I’m not a fan of. If the main purpose of OP token isn’t governance, then I’m open to being corrected. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.039578477078478
                },
                {
                    "author_link": "https://gov.optimism.io/u/Ikpeamarom",
                    "index": "251",
                    "likes": "0",
                    "time": "24/07/2022-01:30:37",
                    "content": "For starters, thank you very much for the airdrop… personally, I don’t think the idea of multiplier is so cool. The tokens would have been distributed to mostly the L2users and donors, since there is a plan for more airdrops in future, the voters and other contributors to governance could have been rewarded in future ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.928125
                },
                {
                    "author_link": "https://gov.optimism.io/u/PieterKlaas",
                    "index": "252",
                    "likes": "0",
                    "time": "27/07/2022-15:30:35",
                    "content": "Wow, fully agree as well going for a sweet approach will definitely increase the quality of the experience. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/danftz",
                    "index": "253",
                    "likes": "1",
                    "time": "30/07/2022-20:49:03",
                    "content": "For the last few months, I’ve contributed to a DAO called Ricochet who’re building on top of Superfluid’s money streaming protocol. And I realized that the underlying technology behind this, streams with continuous settlement and per-second (to be technically correct: per-block) netting, could be very much an exciting new way to airdrop tokens. Imagine a “continous” airdrop over a period of, for example, 6 months. An airdrop wouldn’t be something users would interact with once, dumping them I assume in many cases, but a month-long experience where users receive tokens each day, actually every second. There are good reasons to believe that this could - relative to a one-off airdrop - be a much more powerful mechanism to create a loyal group of people, who’re all committed to seeing Optimism flourish. I’ve observed with airdrop #1 that many eligible users bridged ETH to Optimism, claimed the airdrop, and bridged back with the funds. My suggested airdrop distribution would make this impossible. To play with open cards here: While I do not have any business relations with Superfluid, I do have personal ones. I’m open to discuss this with the team in more depth and also connect you to with the people behind Superfluid if you want to explore this idea further. Also would love to talk about some ideas I have to improve sybil resistance and filter both amateurish and more sophisticated airdrop farmers. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.661255411255412
                },
                {
                    "author_link": "https://gov.optimism.io/u/igrkalina1",
                    "index": "254",
                    "likes": "0",
                    "time": "01/08/2022-10:36:30",
                    "content": "It 's interesting and informative . ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/TheDoctor",
                    "index": "255",
                    "likes": "1",
                    "time": "07/08/2022-01:37:52",
                    "content": "    danftz:  ith the team in more depth and also connect you to with the people behind Superfluid if you want to explore this idea further. Also would love to talk about some ideas I have to improve sybil resistance and filter both amateurish and more sophisticated airdrop farmers   Interesting approach. There are many ways of incentivizing participants, we just need to explore them and try. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.222222222222222
                },
                {
                    "author_link": "https://gov.optimism.io/u/GinjaNinja",
                    "index": "256",
                    "likes": "1",
                    "time": "13/08/2022-19:21:49",
                    "content": "I did not receive the drop even though I bridged ETH and used Optimism platforms, mainly AAVE and Uniswap multiple times starting May 12. Not sure what happened, hope to qualify for round 2. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.716666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/TheDoctor",
                    "index": "258",
                    "likes": "1",
                    "time": "13/08/2022-23:04:51",
                    "content": "Hi, I think you were late: A snapshot of addresses was taken on 03-25-2022 0:00 UTC I hope you’ll find your place in the DAO. Good luck ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/dippudo",
                    "index": "259",
                    "likes": "1",
                    "time": "14/08/2022-02:18:01",
                    "content": "Airdrop #1 was, without a doubt, a great success - congrats to the team. I loved how easy it was to claim, and the steps users had to take before receiving (e.g. briefing the users on the Optimism Collective). With that being said, there is always room for improvement:   Given the inherent “farming” mentality which people get upon airdrop announcements, it would be reasonable to not give away the exact day/week/month subsequent airdrops will occur. This will help filter out some airdrop farmers.   I have seen some people request for an in-depth list of what the airdrop criteria is made up of, but I do think that it has some risks of targeted transactions to effectively farm the future airdrops.   Timing is definitely a key factor in airdrops. From what I have noticed, token airdrops most commonly get dumped 1-2 weeks after the airdrop itself.   Airdropping a token during a bear market does somewhat incentivise users - even more - to sell the airdrop off to remain liquid.   Airdropping a token during a bull market may stunt the token price appreciation in the short term: while the rest of the altcoins are pumping, your token is getting dumped because it got airdropped.   But don’t get me wrong, threading such a needle in airdrop timing is incredibly difficult. It does require a substantial amount of luck and faith in your community to hold the fundamental principles and values of the token close enough that they wouldn’t paper hand them upon claim.   Another thing that relates to token prices after an airdrop is the airdrop size. We all want big airdrops, because that means big money. But, reducing the size of the airdrop does make the user think twice about selling right of the bat.  Yet another needle to thread: the balance between an airdrop proportion fair enough to keep people happy, and an airdrop proportion insignificant enough that people won’t sell  Instead of granting lump-sums of airdrops in 1-4 phases, maybe stretch it out a bit more to about 5-10? Not sure what the broader community feels about this, would like to hear some thoughts on this.   Lastly, expanding token use cases in DeFi. This will help reduce sellers in the short term, while providing more options and usability of the token in the long-run. For example, hardly any protocols have a farm for single-staking $OP - many community members including myself are keeping an eye out for the “big-names” of DeFi to implement this, such as Aave for example.  This was a problem which some DAOs (I shall not name them) that I participated in have. Expanding use cases of the token (e.g. more dApp implementation) will incentivise airdrop receivers to utilise their airdropped tokens in helping grow the Optimism ecosystem.    I have made some points on token price as I hate to see the community feel down after watching their tokens fall in price. As much we’re all in here for the tech and values, we must remind ourselves to keep our heads up during downturns. If we can’t do it ourselves, then better tokenomics must be implemented to help us. Moral and narratives matter more in crypto than anywhere else, we must remain optimistic. I would like to end this by saying, thanks for the great work Optimism - we’re all looking forward for future advancements and developments. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.868816906607605
                },
                {
                    "author_link": "https://gov.optimism.io/u/hank",
                    "index": "260",
                    "likes": "0",
                    "time": "22/08/2022-18:50:09",
                    "content": "Optimism is a base layer for apps,  apps that needs a lot of interactions and become too costly to entertain on ETH mainnet. One of the features are advanced voting. Voting are there to steer the growth of optimism.  I think the system should reward great voters!! Voters that help spread the funds for public good in such a way that optimism grows as much as possible and as efficient as possible. If optimism works best for builders, builders will come, if builders come users will. Check my thread    Proposal for a governance structure Governance Fund: Phase 1       The forum of Optimism need to be the backbone of our governance. The forum will be a place to share proposals, bounce ideas, rank proposals and promote engaged members to suiting roles.  Different roles that are needed are a treasury, voters and proposal promoters.  The goal should be too automate as many tasks as possible to make pay for work efficient.  What do we want? We want to grow OP as much as possible with the least possible resistance. That’s why we should create different groups and t…     ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/GinjaNinja",
                    "index": "261",
                    "likes": "0",
                    "time": "24/08/2022-15:44:36",
                    "content": "Airdrops are great, agree with they should go towards governance vs people immediate selling. They are not in for the long road and dont see a future in OP ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/hank",
                    "index": "262",
                    "likes": "2",
                    "time": "27/08/2022-02:56:27",
                    "content": "I like your points but i would like to add some thoughts i had when reading your text.     dippudo:   I have seen some people request for an in-depth list of what the airdrop criteria is made up of, but I do think that it has some risks of targeted transactions to effectively farm the future airdrops.    This could also be used to motivate the person receiving the airdrop to follow the criteria. Optimism can come up with a criteria which stimulates growth in the optimism network.     dippudo:  Airdropping a token during a bear market does somewhat incentivise users - even more - to sell the airdrop off to remain liquid.   And also motivates people to hold with a longer timeframe, that takes advantage of a bear market.     dippudo:  Lastly, expanding token use cases in DeFi. This will help reduce sellers in the short term, while providing more options and usability of the token in the long-run. For example, hardly any protocols have a farm for single-staking $OP - many community members including myself are keeping an eye out for the “big-names” of DeFi to implement this, such as Aave for example.   Creating value for the holders is great. And that is what gives the token real value. I would say that it’s  the tokens only purpose to create a value for itself. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.170138888888888
                },
                {
                    "author_link": "https://gov.optimism.io/u/PieterKlaas",
                    "index": "263",
                    "likes": "0",
                    "time": "26/09/2022-14:38:37",
                    "content": "Yess Indeed. good topic’s you roll on. The growth of OP is important. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/lazeeeerlin",
                    "index": "264",
                    "likes": "1",
                    "time": "14/10/2022-07:22:10",
                    "content": "rewards are distributed based on user activity rather than funds, which is more conducive to decentralization ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/PieterKlaas",
                    "index": "265",
                    "likes": "0",
                    "time": "18/10/2022-14:24:56",
                    "content": "Good Topics bro, good one. Governance Token. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/chrishan",
                    "index": "266",
                    "likes": "0",
                    "time": "19/10/2022-13:34:54",
                    "content": "for the one who keep OP and the new user ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.681818181818182
                },
                {
                    "author_link": "https://gov.optimism.io/u/S4t0sh1",
                    "index": "267",
                    "likes": "3",
                    "time": "07/11/2022-08:19:46",
                    "content": "Delegating ones own voting power should definitely be a criteria for future airdrops, at least to some extend after the implimentation of Agora. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.375
                },
                {
                    "author_link": "https://gov.optimism.io/u/Noodles",
                    "index": "268",
                    "likes": "1",
                    "time": "02/12/2022-10:52:21",
                    "content": "I suggest a 2nd airdrop be given to those that are still holding ALL of their 1st airdrop tokens. This is way better than the tasks as this invites bounty hunters and not loyal holders. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.555555555555555
                },
                {
                    "author_link": "https://gov.optimism.io/u/blackWidowOS",
                    "index": "269",
                    "likes": "0",
                    "time": "03/12/2022-15:25:52",
                    "content": "I think the approach to the airdrop is great. But for whatever its worth, under “priced out of ethereum”     ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/Statych",
                    "index": "270",
                    "likes": "0",
                    "time": "08/12/2022-12:33:57",
                    "content": "To onboard ecosystem-aligned actors who have proven their early dedication to Ethereum.  Validators are likely to partake in governance and node operations on L2   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/KYPRIVETZDAROVA",
                    "index": "271",
                    "likes": "0",
                    "time": "08/12/2022-12:34:32",
                    "content": "although I did not receive a drop, I am very glad that you have introduced a new multiplier system for active users of the ecosystem   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.088383838383838
                },
                {
                    "author_link": "https://gov.optimism.io/u/7Anastaysha",
                    "index": "272",
                    "likes": "0",
                    "time": "08/12/2022-12:38:05",
                    "content": "I propose to reward participants not for the money they have contributed to the protocol, but for actions so that more new users come to the ecosystem   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.590909090909091
                },
                {
                    "author_link": "https://gov.optimism.io/u/MarkBullah",
                    "index": "273",
                    "likes": "0",
                    "time": "08/12/2022-12:39:13",
                    "content": "Here is a scenario I think is too complicated.   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 2.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/AptosX",
                    "index": "274",
                    "likes": "1",
                    "time": "09/12/2022-04:29:23",
                    "content": "Great idea to airdrop ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/wanglaoda001",
                    "index": "275",
                    "likes": "1",
                    "time": "11/01/2023-14:34:09",
                    "content": "I am looking forward to the second airdrop. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Slappy",
                    "index": "276",
                    "likes": "2",
                    "time": "13/01/2023-18:43:56",
                    "content": "Hello. I’m new to OP and actually at first got taken by a false “OP Airdrop” scam on Twitter. They were pretty slick. Anyway, I got on to your actual main page, followed it, completed the proper airdrop, and ended up getting more in the airdrop than I lost in the scam, so I’m still pretty happy. Now I’m off to explore supporting various things. I like the vibe here. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.751165501165501
                },
                {
                    "author_link": "https://gov.optimism.io/u/tiffjunes1",
                    "index": "277",
                    "likes": "0",
                    "time": "14/01/2023-12:56:17",
                    "content": "I had none. But I am looking forward to the AIRDROP #2. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/ahrgk5670",
                    "index": "278",
                    "likes": "0",
                    "time": "14/01/2023-13:21:32",
                    "content": "How about distributing the airdrop quantity that has not yet been charged to other active members? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.354166666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/flegelspeedw",
                    "index": "279",
                    "likes": "2",
                    "time": "14/01/2023-13:29:41",
                    "content": "Activities on Forum should be considered. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/judonpryeo",
                    "index": "280",
                    "likes": "1",
                    "time": "15/01/2023-02:28:57",
                    "content": "Forum activities should be considered! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/vv52",
                    "index": "281",
                    "likes": "0",
                    "time": "17/01/2023-09:14:15",
                    "content": "[image][quote=“karl, post:1, topic:80, full:true”] We would love to hear your thoughts on airdrop #1! In order to keep the feedback in one place, please reply to this thread with your thoughts and suggestions. Good feedback includes:  Suggestions for how to tune spam filters to reward real users.  Includes sybil resistance as well as improving false sybil positives.   Positive sum behaviors you think contribute to the community. Airdrop logistics (size, frequency, etc)  Please leave constructive feedback so we keep the signal to noise ratio high in here! <333 Thank you!!! [/quote] Hello to everyone who received the first airdrop, tell me what it was given for?  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.423498376623376
                },
                {
                    "author_link": "https://gov.optimism.io/u/marmariia",
                    "index": "282",
                    "likes": "0",
                    "time": "17/01/2023-11:28:44",
                    "content": "@tiffjunes1  of course you are check it Users who sold the initial OP airdrop should become ineligible for all future airdrops ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/pxhpb",
                    "index": "283",
                    "likes": "1",
                    "time": "18/01/2023-06:18:16",
                    "content": "Give an opportunity to airdrop people who are interested in even a small transaction. to distribute coins to more people and lead to more usage. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/Fot63life2000val",
                    "index": "284",
                    "likes": "0",
                    "time": "23/01/2023-15:54:41",
                    "content": "True definitely need more adoption and more usage ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.6875
                }
            ]
        }
    ],
    "group_index": "638"
}