{
    "poll_list": [
        {
            "id": "0x37d5038262ef8a6eac1d6e107a5d8c80e0e05e278af5598064ba7c473fd66ff0",
            "title": "Season 2: Cycle 7: Alchemix",
            "discussion": "https://gov.optimism.io/t/review-gf-phase-1-cycle-7-proposal-alchemix/3475",
            "body": "This Governance Fund Phase 1 proposal is eligible for voting in Cycle 7. \n\nThis proposal is was reviewed by [DeFi Committee A](https://gov.optimism.io/t/defi-committee-a-season-2-recommendations/3522/8). You can find committee recommendations below:\n\n[DeFi Committee A recommendations]([https://gov.optimism.io/t/defi-committee-a-season-2-recommendations/3522/8](https://gov.optimism.io/t/defi-committee-a-season-2-recommendations/3522/8))\n\nShadow DeFi Committee B is not an official committee but has posted their own recommendations here: [https://gov.optimism.io/t/defi-shadow-committee-season-2-recommendations/3549/11](https://gov.optimism.io/t/defi-shadow-committee-season-2-recommendations/3549/11)\n\nBy approving committees, the Token House entered a social contract to entrust and delegate the bulk of decision-making to official committees. However, delegates may vote against the recommendation of official committees but should provide a justification to the community as to why they voted differently.",
            "choices": [
                "For",
                "Against",
                "Abstain"
            ],
            "scores": [
                371080.07568924275,
                11535053.648453357,
                649787.6146063509
            ],
            "start": 1665691803,
            "end": 1666293003,
            "snapshot": "29191293",
            "state": "closed",
            "author": "0x47C88bb92B409fF25F6587EA611fac4e55f76007",
            "space": {
                "id": "opcollective.eth",
                "name": "Optimism Collective"
            }
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/review-gf-phase-1-cycle-7-proposal-alchemix/3475",
            "title": "[REVIEW] [GF: PHASE 1 CYCLE 7 PROPOSAL] Alchemix ",
            "index": 3475,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Governance Fund: Phase 1"
            ],
            "tags": [
                "cycle-7",
                "not-passed"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/Ov3rkoalafied",
                    "index": "1",
                    "likes": "6",
                    "time": "14/09/2022-17:25:46",
                    "content": " Optimistic Alchemix OP Incentive Proposal Summary of changes from discussion:  Reduce total ask from 750k to 500k to be more in-line with other proposals Removed a use case of tokens that would have seen Alchemix self-delegate for a year then utilize the tokens to boostrap alOP or extent the grant (based on feedback that delegation/self-delegation is not typically desired and future use cases can be funded with future grants). A majority of comments were around this topic. Added clarification around potential future incentives from Alchemix (via migrating CRV / CVX bribes from mainnet to veVELO on Optimism). Reduce total ask to 250k and reduce total time to 6 months to meet defi committee recomendation.  Project Name: Alchemix Author Name: Butler and The Third Stringers, @Ov3rkoalafied, 0xFelix, Barree (Alchemix BizGov SubDAO) Contact Info: Discord: Butler And The Third Stringers#0440, Ov3rkoalafied#8405 Telegram: @OxTurtleHermit, @Ov3rkoalafied I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: Yes L2 Recipient Address: 0xC224bf25Dcc99236F00843c7D8C4194abE8AA94a Which Voting Cycle are you applying for?: Voting Cycle 7 Grant Category DeFi Is this proposal applicable to a specific committee?: DeFi Committee Project Description Alchemix allows users to leverage the time value of money by borrowing up to 50% of future yield on deposited collateral with no risk of liquidation, in the form of synthetic assets alUSD and alETH. User collateral is deposited into underlying yield strategies, and yield earned is used to pay down user debt. Because liquidation is not possible and the primary interaction is front-loaded (deposit and take initial loan), Alchemix depositors are far stickier TVL than other forms of DeFi yield farming, which means that users that come to Alchemix on Optimism are likely to remain. Project links:  Website: https://alchemix.fi/  Twitter: https://twitter.com/AlchemixFi  Discord: Discord  Forums: https://forum.alchemix.fi/public/   Additional team member info (please link):  Scoopy Trooples (https://twitter.com/scupytrooples) theTechnocratic (https://twitter.com/thetechn0cratic) N4n0 (https://twitter.com/n4n084191635) Toyvo (https://twitter.com/toyvo_)  Relevant Metrics: Mainnet/Fantom Metrics: https://alchemix-stats.com/ Current Optimistic Alchemix TVL: Launched Sept 28th, live here: Alchemix Optimistic Alchemix alAsset liquidity: $1.5M alETH/ETH, $1M alUSD/USDC (both on Velodrome) incentivized / farmed via AIP-59 Competitors, peers, or similar projects No major direct competitors - similar projects include https://abracadabra.money/ , https://www.euler.finance/ , and https://twitter.com/0xC_Lever, but all offer distinct differences that may appeal to different types of users with different goals (ie, Abra denominates all loans in MIM, euler is more akin to a pure interest rate swap, 0xC_Lever is a fork but only for vlCVX). Is/will this project be open sourced?: Yes, the Alchemix front end and smart contracts are open source. Optimism native?: Alchemix has deployed on Ethereum mainnet and Fantom. Deployment date: Deployed Sept 28th, via AIP-62. Vaults can be viewed here: Alchemix Deposit caps are limited to 100k / 100 ETH for the first week.  Ecosystem Value Proposition: (200 words) Many DeFi protocols are built around DeFi power users. Alchemix is a tool that benefits power users, as well as users that wish to remain minimally active, or route real-world finances and spending through DeFi as an alternative to traditional means. We are passionate about providing DeFi users a safe way to gain capital efficiency on their assets, and believe users should be able to do so in a cheap environment without having to sacrifice Ethereum’s security. Alchemix is built on external yield solutions, so assets deposited will contribute to increasing TVL of other protocols throughout the Optimism ecosystem. This TVL is not just vanity or temporary - the proven use case of Alchemix will drive additional actual usage and fee revenue to integrated protocols (at first, AAVE and Velodrome). At the time of writing Alchemix is responsible for 46% of the liquidity in the yvDAI vault and 26% of the yvWETH vault on Yearn. Furthermore, the liquidity demands of providing synthetic asset redeemability will greatly increase TVL of AMMs we partner with. Alchemix is responsible for ~122m of combined alUSD3CRV and alUSDFBP liquidity, and ~56m of alETHCRV liquidity in mainnet Curve, which is ~3% of Curve’s total (all chains) TVL. Alchemix also owns a locked veVELO position that has built up $2.9m of incentivized liquidity on Velodrome, between alETH and alUSD pairs. Alchemix has also (as of Sept 14th) accumulated additional VELO as well as migrated a portion of protocol owned alETH liquidity to Velodrome per AIP-59. Alchemix has also recently acquired a veSDL position and is pursuing ways to incentivize liquidity on Optimism thru Saddle. Even before the impact of veSDl and AIP-59, Optimism is already Alchemix’s largest home for alAsset liquidity, aside from mainnet Ethereum. Finally, Alchemix believes public goods are good, and contributed $100,000 total to Gitcoin Grants in rounds #13 and #15. Has your project previously applied for an OP grant? No Number of OP tokens requested: 250,000 OP Did the project apply for or receive OP tokens through the Foundation Partner Fund?: No If OP tokens were requested from the Foundation Partner Fund, what was the amount?: N/A How much will your project match in co-incentives?  We are primarily matching incentives on the liquidity side of the Alchemix system, as that is where incentives are typically needed most. Since the passing and execution of AIP-59 Alchemix has over 6.5 million veVELO power and $1m of protocol-owned alETH liquidity farming on Velodrome. Should the deposit caps on Optimistic Alchemix quickly fill, that will be indicative to Alchemix that we should look to re-allocate some bribes from CRV/CVX on mainnet to veVELO on Optimism to further scale the deployment.  Per the token distribution below, the incentives are expected to create more demand on the TVL side than the demand side (partially because this TVL is stickier and therefore more desireable). As deposits grow, more liquidity will be necessary than what our current incentives + VELO grant can provide. Alchemix can redirect emissions, including from CRV/CVX bribes on mainnet, to meet this liquidity demand Based on a target alAsset liquidity of at least 1/2 of TVL on Optimism, bribes worth approximately 500k OP (paid in ALCX) would be necessary to direct to Velodrome The end result is that Alchemix is providing incentives to make Optimistic Alchemix feasible for launch, Optimism provides incentives start the growth, and then we can step in with more incentives to sustain the growth.     Proposal For Token Distribution How will the OP tokens be distributed?   50% (125,000) will incentivize vault depositors in the form of boosted yield, for 6 months, split between alETH and alUSD. Estimated to incentivize $25m of deposits (at an approximated market-determined boost of 1% APR on AAVE strategies)  50% (125,000) will incentivize LP providers on Velodrome through bribes, for 6 months, split between alETH and alUSD. Estimated $3m additional liquidity at 10% APR (Alchemix currently incentivizes $2.5m of liquidity on Velodrome) No tokens at any point would be delegated or self-delegated  Over what period of time will the tokens be distributed?  Tokens used for velodrome bribes will be distributed over the course of 6 months. Tokens used for depositor boosted yield will be distributed over the course of 6 months.  Trackable Milestones / KPIs Alchemix is inherently good and positive-sum for Optimism, for the following reasons:  Alchemix is an attractive DeFi offering due to the reduced risk that comes with not having to worry about liquidations. Because it is built on other yield providers it will simultaneously increase TVL in integrated partners such as AAVE (our initial planned Optimism vault offering) as well. Based on V1 and V2 yearn vault statistics, we would expect at least 25% of AAVE Optimism TVL in aWETH and stablecoins to migrate to Optimistic Alchemix. (note that some DeFi trackers may double-count this TVL between AAVE and Alchemix while some may subtract the TVL from Alchemix or AAVE). Alchemix TVL is inherently sticky, even if alAsset liquidity incentives reduce. This effect is demonstrated by the fact that currently, with no direct incentive to migrate from v1 to v2, AND with globally reducing DeFi yields and liquidity, half of deposits still remain with v1 compared to v2 (note: v1 is being retired October 1st). There is currently $26m of TVL in V1 and $26m of TVL in V2. Systematically, users can only exit vaults through repaying their debt themselves, waiting for automatic yield repayments to repay their debt, or via self-liquidation (which allows exiting with [collateral] - [debt] of user’s deposit). Because of the fact that there is no liquidation risk, there is no penalty for continuous max borrowing, and so the incentive for users is to continue to leverage the time value of money by maximizing their debt at all times. Self-liquidations reduce total underlying collateral earning yield and are therefore undesirable for the user in many cases. In a scenario where the user has max-borrowed, self-liquidating would reduce their capital that is earning yield by 50%, which means the users would have to find a yield source greater than twice that of the underlying Alchemix vault for them to consider leaving. Together these factors create long-lasting and sticky TVL in Alchemix vaults and underlying integrated vault partners. The liquidity requirements for ensuring redeemability of synthetic assets for the underlying assets they represent creates a need to incentivize liquidity in alAsset pools. The yield created by these incentives will drive more LPers to increase TVL of partnering AMMs on Optimism. We expect deposit TVL to increase with liquidity, and in periods of decrease  liquidity we expect deposit TVL to decrease at a slower rate.  By integrating with yield providers such as AAVE, we will be farming OP rewards on underlying vaults as well, which will be passed on to depositors in the form of boosted yield. The presence of liquidity on both Optimism and Mainnet, with a large influx of new users on Optimism will create arbitrage opportunities that will drive volume to Optimism bridges and Velodrome. For example - $10m of migrated TVL to Optimism would create $10m of initial bridge volume, $5m of alAsset selling volume, and additional arbitrage volume (on both exchanges and bridges) between mainnet and optimism during the period of higher demand to sell alAssets.  Why will the incentivized users and liquidity remain after incentives dry up?  The OP incentives are going to immediately grow the Optimism Ecosystem, as is typically expected from liquidity mining incentives. The real test is if this creates new long term users and TVL. Due to both our veVELO growth plan (see two points below) as well as the aforementioned stickiness of Alchemix deposits, this TVL has a much greater retention rate than many other forms of DeFi protocols. Alchemix will be able to launch stETH strategies on Optimism once staked ETH unlocks are possible. Additionally, Alchemix will be able to integrate any mainnet strategy that also launches on Optimism (for example, Yearn strategies are planned for deployment as soon as they are scaled up on Optimism). Lastly, Optimism has numerous unique DeFi protocols that could offer yield strategies not available on mainnet (and offers grants to protocols willing to write their own yield adapters!). Many users will prefer the cheaper fees of Optimistic Alchemix and will continue to migrate as the feature set becomes more identical to mainnet. With the increased demand will come increased need for liquidity. Alchemix is currently farming VELO through protocol owned alETH liquidity, which will be constantly claimed and locked to create an ever-growing stack of veVELO by which to incentivize liquidity. Additionally, Alchemix has plans to launch a Velodrome alAsset AMO (Similar to the mainnet Curve AMO) that would be able to deposit and farm VELO with excess transmuter funds (and withdraw and burn alAssets when needed to increase price), thus increasing the available alAsset liquidity, alAsset price control tools, and profitability of Optimistic Alchemix. Lastly, Alchemix can re-direct mainnet liquidity driving assets to Optimism if demand is more present there (CVX, CRV, SDL, TOKE).  ",
                    "links": [
                        "https://twitter.com/AlchemixFi",
                        "https://discord.gg/Jk3czaAp",
                        "https://forum.alchemix.fi/public/",
                        "https://twitter.com/scupytrooples",
                        "https://twitter.com/thetechn0cratic",
                        "https://twitter.com/n4n084191635",
                        "https://twitter.com/toyvo_",
                        "https://alchemix-stats.com/",
                        "https://app.alchemix.fi/vauls",
                        "https://snapshot.org/#/alchemixstakers.eth/proposal/0xa90296d160beb63c39811ba6eed5de419eda0f166195c1c000324650b378cf2f",
                        "https://abracadabra.money/",
                        "https://www.euler.finance/",
                        "https://twitter.com/0xC_Lever",
                        "https://snapshot.org/#/alchemixstakers.eth/proposal/0xaa9481eba5bfb2945d11a71d7d1063ce48e3e8a2d6b8342a8dc7d16058ad63c9",
                        "https://app.alchemix.fi/vaults",
                        "https://forum.alchemix.fi/public/d/345-aip-59-increase-velodrome-stake",
                        "https://gov.optimism.io/t/review-gf-phase-1-proposal-yearn/3509/4",
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-abracadabra-money/2918/28",
                        "https://gov.optimism.io/t/defi-shadow-committee-b-season-2-recommendations/3549/12",
                        "https://gov.optimism.io/t/defi-committee-a-season-2-recommendations/3522/8",
                        "https://gov.optimism.io/t/gfx-labs-delegate-communication-thread/2728/17",
                        "https://gov.optimism.io/t/voting-cycle-7-roundup/3586/10",
                        "https://gov.optimism.io/t/ready-gf-phase-1-cycle-8-proposal-alchemix/3764"
                    ],
                    "GPT-summary": "The post is a proposal for an Optimistic Alchemix OP Incentive. The proposal explains how Alchemix works and how it benefits DeFi users. It also provides relevant metrics and information about the project, including its competitors and ecosystem value proposition. The proposal includes a token distribution plan and trackable milestones. The post also mentions feedback received and changes made to the proposal based on that feedback.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Interoperability and Scaleability",
                        "Token economics",
                        "Smart contract updates",
                        "Privacy, Security and risk management"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.589273355245577
                },
                {
                    "author_link": "https://gov.optimism.io/u/Ov3rkoalafied",
                    "index": "2",
                    "likes": "1",
                    "time": "14/09/2022-17:27:29",
                    "content": "A couple more links to relevant proposals mentioned in the post, since I was limited in the # of links I could include: Gitcoin Donations, rounds #13 and #15. V1 retirement retirement information, being retired Oct 1st ",
                    "links": [
                        "https://forum.alchemix.fi/public/d/344-aip-58-gitcoin-cause-grants-round-gr15",
                        "https://forum.alchemix.fi/public/d/348-aip-61-migrate-v1-to-v2-and-sunset-v1"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.3809523809523805
                },
                {
                    "author_link": "https://gov.optimism.io/u/Ov3rkoalafied",
                    "index": "3",
                    "likes": "0",
                    "time": "15/09/2022-01:37:38",
                    "content": "Additionally, this proposal was reviewed by Jack with VELO and the SNX Ambassadors. You can discuss here, in the OP discord (a thread has been created), or in the Alchemix Discord (here: Alchemix) ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "4",
                    "likes": "1",
                    "time": "15/09/2022-18:12:15",
                    "content": "Hey, you should verify the new proposal template v2 and add relevant information.     Grant Proposal Template 🏛 Governance   Phase 1 Proposal Template v2 Hey folks!  This thread will contain our drafted updates to various Governance-Fund-related language and the proposal template. We look forward to hearing your feedback as we enter the Reflection Period!  This is an update to the “How to Create a Proposal” post.   Key information about Governance Fund grants 5.4% of the total initial token supply (231,928,234 OP) will be distributed to Optimism projects and communities via the Governance Fund.  During Season 2, proj…     ",
                    "links": [
                        "https://gov.optimism.io/t/governance-fund-phase-1-how-to-create-a-proposal/216"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.530303030303029
                },
                {
                    "author_link": "https://gov.optimism.io/u/Ov3rkoalafied",
                    "index": "5",
                    "likes": "0",
                    "time": "16/09/2022-13:24:47",
                    "content": "Thank you for pointing this out - we will revise ASAP and edit post / comment here when we do. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Ov3rkoalafied",
                    "index": "6",
                    "likes": "0",
                    "time": "19/09/2022-03:04:14",
                    "content": "We have revised to match the current proposal structure. @Gonna.eth ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "7",
                    "likes": "0",
                    "time": "19/09/2022-03:32:16",
                    "content": "Glad to see more protocols looking to delegate their tokens. Although there are no standards on this point, my suggestion is that you fold the tokens to be delegated into one of your other asks – or to consider something creative with the OP that you would hold, e.g., devise some utility within Alchemix’s core offerings. You could then draw down the delegatable OP over time, reacquiring it through market buys should you decide that governance power is something you’d wish to accumulate over the long term (and I candidly think it is!) Separately, I’m not sure how to get around the KYC issue, and it’s probably worth some discussion. One thing we could do is arrange for a multisig with some KYC’d people on it and set it such that you need at least one KYC’d person signing off on any tx. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.758838383838384
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "9",
                    "likes": "1",
                    "time": "20/09/2022-02:48:19",
                    "content": "I am an Optimism delegate [Delegate Commitments - #136 by jackanorak ] with sufficient voting power and I believe this proposal is ready to move to a vote. KYC is an open issue but this should be part of the deliberation ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/MattL",
                    "index": "10",
                    "likes": "1",
                    "time": "20/09/2022-03:01:27",
                    "content": "I’m an Optimism delegate with >0.5% of the current votable token supply and I believe this proposal is ready to move to a Snapshot vote (not an endorsement of the proposal itself but that I think it is ready for voting). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving positive feedback on proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.666666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/mastermojo",
                    "index": "11",
                    "likes": "0",
                    "time": "20/09/2022-11:15:15",
                    "content": "I am an Optimism delegate [Delegate Commitments - #65 by mastermojo] with sufficient voting power, and I believe this proposal is ready to move to a vote ",
                    "links": [
                        "https://gov.optimism.io/t/voting-cycle-7-roundup/3586/10"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Ov3rkoalafied",
                    "index": "12",
                    "likes": "1",
                    "time": "20/09/2022-16:03:19",
                    "content": "I think holding the delegated OP for the potential to bootstrap a future alOP would be a good candidate. alOP would require a yield source, which would most likely come from either AAVE utility (or similar integration), or even better if Optimism eventually earns revenue and shares it with token holders. While we wait for this use case to emerge as a possibility, it gives us a say in what (I think) will be our largest/most popular L2 offering for a while. If it becomes clear this won’t be feasible, then we can look to extend / ramp up liquidity mining to attract more users (should it continue to be proven that our depositors are generally remaining deposited). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.34090909090909
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "13",
                    "likes": "0",
                    "time": "20/09/2022-21:19:00",
                    "content": "Hi @Ov3rkoalafied , Thank you for your proposal. I have few input and would appreciate if your could provide additional information.  KYC part is negotiable or off the table ? I believe this will be done between your team and foundation. Do you have any dashboard where I can see stats on Optimism, I assume the deployment was on 19th Sept.        Ov3rkoalafied:  matching incentives on the liquidity side of the Alchemix system   are you planning to migrate liquidity from other chain to optimism to jump start the launch?  On self-delegation, would you consider using vault or lp token for self-delegation. Keeping 250K just for delegation is not a good of token, imo.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 3.875
                },
                {
                    "author_link": "https://gov.optimism.io/u/Ov3rkoalafied",
                    "index": "14",
                    "likes": "0",
                    "time": "21/09/2022-18:08:03",
                    "content": "  I asked around and looked through the forums, and I haven’t found any elaboration on the KYC requirement besides the one question (including discussions on where it was added). No one on the team has KYC’d before, and we have done plenty of deals without it, including an OTC sale of ALCX tokens shortly after the protocol launched. I believe KYC would be off the table for us, but we are open to other approaches if acceptable.   We have deployed the contracts with small (100k) deposit caps. Currently we are working on completing staging for the UI with the live contracts, then we will announce and lift the caps. So there’s not really any stats yet (unless anyone wants to interact with the contracts directly, if they can find them!).   See my comment above yours - we could hold onto the OP for an eventual alOP. Alternatively, since I’d like to keep the total quantity the same, we could put the 250k OP into the LP/depositor incentives and self-delegate over the course of time that we are drawing down from those.   Who would be good to ask about KYC? Ultimately is it just a DAO decision? Ie, we would go to vote with a “no” for KYC, and then the DAO could pass or fail it? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.009627525252526
                },
                {
                    "author_link": "https://gov.optimism.io/u/Netrim",
                    "index": "15",
                    "likes": "0",
                    "time": "21/09/2022-18:23:41",
                    "content": "The requirement came from OP Labs directly, most likely driven by whatever legal requirements they deemed satisfactory to protect the real world entity. My current guess is that this items is a hard stop since Phase 0 projects were required to KYC themselves and this was not part of the discussion for Phase 0 nor part of the OPerating manual ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.506944444444444
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "16",
                    "likes": "0",
                    "time": "21/09/2022-18:51:00",
                    "content": "    Ov3rkoalafied:  Who would be good to ask about KYC   A good place to start the discussion would be gov-general channel on discord, another option would be creating a thread and getting community feedback and last option would be to directly contacting Optimism foundation team.     Ov3rkoalafied:  we could hold onto the OP for an eventual alOP   Please update the proposal to reflect the same.     Ov3rkoalafied:  Currently we are working on completing staging for the UI with the live contracts   any time line for this ? and what about co-incentives ? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.168831168831169
                },
                {
                    "author_link": "https://gov.optimism.io/u/Ov3rkoalafied",
                    "index": "17",
                    "likes": "1",
                    "time": "22/09/2022-00:53:14",
                    "content": "Just posted there, thanks! We do have one team member that would be willing to KYC, so will determine if that would be acceptable. I’ve updated the proposal to reflect alOP. Our matching incentives are all on the liquidity incentivization side, since that requires more incentives than the product side to maintain sufficient liquidity for depositors to take loans. Velodrome has done a good job at making liquidity more efficient, so we are incentivizing by taking a larger stake specifically in Velodrome - we own a sizable lock already, purchased more through AIP-49. That AIP also had us move $1 million of protocol owned alETH liquidity from mainnet to Velodrome. If we start to see TVL migrate from mainnet to Opti or a lot of fresh TVL come in on Opti and the incentives aren’t keeping up, then we can also redirect some bribes from mainnet curve to Velodrome (not yet approved by governance). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Defi_LATAM_axlvaz",
                    "index": "18",
                    "likes": "0",
                    "time": "26/09/2022-01:15:23",
                    "content": "    Ov3rkoalafied:  33% (250,000) will incentivize vault depositors in the form of boosted yield, for one year, split between alETH and alUSD. Estimated to incentivize at least $25m of deposits (at an approximated market-determined boost of 1% APR on AAVE strategies)   What date have you determined to launch the vaults in Optimism?     Ov3rkoalafied:  33% (250,000) will be held for the potential to bootstrap a future alOP integration. alOP would require a yield source, which would most likely come from either AAVE utility (or similar integration), or even better if Optimism eventually earns revenue and shares it with token holders. While we wait for this use case to emerge as a possibility, the OP self-delegated or delegated to a partner protocol to give Alchemix a voice in Optimism governance. If it eventually becomes clear alOP won’t be feasible, then we can look to extend / ramp up liquidity mining to attract more users (should it continue to be proven that our depositors are generally remaining deposited).   Can you indicate the possible protocols to which you will delegate OP tokens? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.613636363636364
                },
                {
                    "author_link": "https://gov.optimism.io/u/Ov3rkoalafied",
                    "index": "19",
                    "likes": "0",
                    "time": "27/09/2022-01:31:18",
                    "content": "  Vaults are live but with low deposit caps. We are working on finalizing the UI, it got delayed due to some DDOS attacks (so we are shoring up our main front end first). I will post here and edit the proposal as soon as we are fully live, including updating TVL when closer to voting. The new voting starts Oct 13th so should be plenty of time to get a bit of TVL.   The most likely protocols would be Velodrome (they will be a major partner for us on Optimism for alAsset liquidity, so our goals will be somewhat aligned), or SNX (they have some delegates who have also been active in our community and they have helped us with this proposal). Nothing has been officially decided yet.   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.470801767676767
                },
                {
                    "author_link": "https://gov.optimism.io/u/Defi_LATAM_axlvaz",
                    "index": "20",
                    "likes": "0",
                    "time": "27/09/2022-01:37:50",
                    "content": "    Ov3rkoalafied:  33% (250,000) will incentivize LP providers on Velodrome through bribes, for one year, split between alETH and alUSD. Estimated $3m additional liquidity at 10% APR (Alchemix currently incentivizes over $2.9m of total liquidity on Velodrome, with more expected from AIP-59)   Will this distribution be 50/50? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/Defi_LATAM_axlvaz",
                    "index": "22",
                    "likes": "1",
                    "time": "27/09/2022-11:36:26",
                    "content": "    Ov3rkoalafied:    33% (250,000) will be held for the potential to bootstrap a future alOP integration. alOP would require a yield source, which would most likely come from either AAVE utility (or similar integration), or even better if Optimism eventually earns revenue and shares it with token holders. While we wait for this use case to emerge as a possibility, the OP self-delegated or delegated to a partner protocol to give Alchemix a voice in Optimism governance. If it eventually becomes clear alOP won’t be feasible, then we can look to extend / ramp up liquidity mining to attract more users (should it continue to be proven that our depositors are generally remaining deposited). While out of scope for this proposal, a future grant application could request additional OP to further grow liquidity and users thru new or existing AMMs, or to incentivize/fund development of future self-repaying products that integrate Alchemix with other Optimism protocols.    I am against delegation and self-delegation with tokens received through grants. I think that if you want to give voice to Alchemix you can make purchase of OP tokens in the secondary market. Considering that in AIP-59 you make use of treasury (correct me if I am wrong) to buy VELO tokens, you can use the same resource to buy OP tokens. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.253342245989305
                },
                {
                    "author_link": "https://gov.optimism.io/u/Ov3rkoalafied",
                    "index": "23",
                    "likes": "0",
                    "time": "27/09/2022-17:38:18",
                    "content": "Yes, 33% (250,000) each. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Ov3rkoalafied",
                    "index": "24",
                    "likes": "0",
                    "time": "27/09/2022-17:46:09",
                    "content": "Delegation is not the primary purpose. As mentioned we would be holding for up to a year with the hopes of incentivizing alOP in the future (requires some updates on the OP side, and we are working on an update that would make launching separate alAssets feasible). If that use case never comes to fruition then after a year, we would fold the OP into the first two use cases, to extend their life. In the meantime, we were thinking we would delegate OP. In this scenario if we want a voice in governance beyond a year we would still have to purchase OP, but at least it gives us some say while we build up the funds / TVL to justify doing so. We also figured delegating/voting would be better than LPing the tokens somewhere (ALCX/OP or something), since that’s effectively a limit-sell order on OP if it goes up, but if LPing those tokens would be more preferable we can do that. Lastly, if more people voice concerns with delegation or LPing (hard for me to know if your opinion reflects a large portion of voters / past precedent in voting - if you have any insight there please let me know), then we can just fold those OP tokens into the first two use cases. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.988591269841271
                },
                {
                    "author_link": "https://gov.optimism.io/u/Defi_LATAM_axlvaz",
                    "index": "25",
                    "likes": "1",
                    "time": "27/09/2022-17:55:30",
                    "content": "You don’t necessarily have to apply for all the funds now, you can apply for the funds needed for your plan right now, show results and reapply for another OP token grant. If the results are good, you should have no problem getting a second approval. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.232142857142858
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "26",
                    "likes": "1",
                    "time": "27/09/2022-18:15:26",
                    "content": "Reminding people here that self-delegation has been determined to be in scope so long as the intention to do is made explicit. @Defi_LATAM_axlvaz is entitled to their belief, but this is not the official position as outlined on the grant proposal template. “Expectation” doesn’t mean that self-delegation shouldn’t be granted – it means that the assumption is that it is not granted unless a project specifically asks for it.  image1448×266 30.7 KB  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.09375
                },
                {
                    "author_link": "https://gov.optimism.io/u/Defi_LATAM_axlvaz",
                    "index": "27",
                    "likes": "0",
                    "time": "27/09/2022-18:25:49",
                    "content": "    jackanorak:  “Expectation” doesn’t mean that self-delegation shouldn’t be granted – it means that the assumption is that it is not granted unless a project specifically asks for it.   Depending on how it is proposed it can be well seen or not, that is what the forum is for. It does not mean that all projects that want to delegate or self-delegate grant tokens must be approved. In my personal opinion I don’t see it at all healthy for governance. In this case I see speculation when you could ask for the necessary amount and then reapply for a second grant. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.286458333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "28",
                    "likes": "0",
                    "time": "27/09/2022-21:30:31",
                    "content": "Hi @Ov3rkoalafied, Last I remember someone from your team was willing to the KYC, has this been finalized ? Please also change the Voting Cycle to 7. Relatively liquidity seems sticky, from peak of 800M to 62M as of writing but this might be because of current market condition.     Ov3rkoalafied:  I will post here and edit the proposal as soon as we are fully live, including updating TVL when closer to voting   would you consider waiting for one more cycle ? this will give us time to see how your OP deployment is received by community.     Ov3rkoalafied:  As mentioned we would be holding for up to a year with the hopes of incentivizing alOP in the future   This is also something to consider, if you are only going to use the token next year why not submit another proposal when you are ready next year ? Distributing OP from grant to sit in another wallet is not a good use imo.     Ov3rkoalafied:  $1m of protocol-owned alETH liquidity.   is this already deployed to OP chain ? How can i verify this ? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.306818181818182
                },
                {
                    "author_link": "https://gov.optimism.io/u/Ov3rkoalafied",
                    "index": "29",
                    "likes": "0",
                    "time": "28/09/2022-03:06:58",
                    "content": " Last I remember someone from your team was willing to the KYC, has this been finalized ? Please also change the Voting Cycle to 7.  I’ll modify this to cycle 7. For KYC, I’ve gotten a few different answers, still none with absolute clarity. Most recently, from talking with some folks on the Optimism legal side of things, it seemed like our entire multisig may need to KYC which isn’t really feasible, but the wording was not clear. Waiting to hear back. I think it may be easier to just go to vote, with the intent to try to meet the KYC requirements, and if for some reason we can’t, we would just have to pull out of the grant.  Relatively liquidity seems sticky, from peak of 800M to 62M as of writing but this might be because of current market condition.  Sorry, are you saying liquidity is sticky or isn’t here? And yes collapsing defi yields / less TVL in defi as a whole in general are the biggest factor, yearn was something like 40% APR when Alchemix launched. Liquidity is definitely mercenary to incentives though, whereas a depositor only needs liquidity for their initial loan, then a future re-up of their loan a while later.  would you consider waiting for one more cycle ? this will give us time to see how your OP deployment is received by community.  I think that could make sense, depending on when we are able to officially launch. But if we launch soon and TVL fills up quickly, it may not matter as much. Is their precedent for going to a vote, failing the vote, and then re-applying with modifications in the next cycle?  This is also something to consider, if you are only going to use the token next year why not submit another proposal when you are ready next year ? Distributing OP from grant to sit in another wallet is not a good use imo.  With what we know now about delegation and how it is perceived, this probably makes more sense. We will likely update to split the tokens 50/50 and remove use case #3. I’m going to let more feedback continue to roll in since we have the time, as well as stats once we launch, then make the changes in one revision/revision narrative.  is this already deployed to OP chain ? How can i verify this ?  I believe so, let me track that down and follow up. EDIT: Address is DeBank | Your DeFi wallet But debank doesn’t seem to track VELO liquidity, trying to find a tracker that does show it. It could also be viewed with rabby: https://rabby.io/ ",
                    "links": [
                        "https://rabby.io/"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.393393393393393
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "30",
                    "likes": "1",
                    "time": "28/09/2022-18:58:42",
                    "content": "    Ov3rkoalafied:  I’m going to let more feedback continue to roll in since we have the time   Totally agree with this. I will wait for open question to get some more clarity.     Ov3rkoalafied:  Alchemix is currently farming VELO through protocol owned alETH liquidity, which will be constantly claimed and locked to create an ever-growing stack of veVELO by which to incentivize liquidity   Few additional points:- I see you have one year distribution plan, could you provide some information on your plan. Will it done weekly /bi-weekly and is there a cap on max number of token distributed weekly ? and how this will help with long term liquidity ? Do you mean bribing on velo with your voting power ? I am trying to understand the co-incentives and long term plan here. Would you consider matching co-incentives with your native token ? Apologies for many question here but there was some communication gap in last voting cycle and i want to make sure i have my doubt clear before we reach next voting round.     Ov3rkoalafied:  Is their precedent for going to a vote, failing the vote, and then re-applying with modifications in the next cycle?   Personally I will enforce on KYC. and yes this is doable and quite easy. If a proposal does not get approval in current cycle, they can submit a new proposal in next cycle, there is no limit. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.422090220385675
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPGovWatch",
                    "index": "31",
                    "likes": "1",
                    "time": "28/09/2022-19:56:02",
                    "content": "There should be consistent guidance from the DeFi committees on whether or not using a portion of their grant for self-delegation to give them a voice in governance is acceptable. If it is true that it was approved for another project, it should be enforced consistently and not be removed from this proposal. I also believe that the committees should be consistent on whether or not actively being deployed on Optimism is a pre-requisite for the approval of a grant request. I believe there is now a proposal being approved for a protocol not yet deployed, if true we should not ask that the proposers delay their asks. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.263888888888889
                },
                {
                    "author_link": "https://gov.optimism.io/u/Defi_LATAM_axlvaz",
                    "index": "32",
                    "likes": "0",
                    "time": "28/09/2022-21:35:01",
                    "content": "At this time it is feedback from the delegates and the community. Then the committee makes recommendations. You can read it here: The committee should separate itself from this talk. At this time it is feedback from the delegates and the community. Then the committee makes recommendations. You can read it here:     Update to Committee Operations 🏛 Governance       As the first Voting Cycle of Season 2 comes to a close, the Foundation would like to address some confusion related to multiple aspects of committee operations. The below updates to the voting cycle will be reflected in an update to the Operating Manual and implemented at the start of Voting Cycle #7.  Voting Cycle with Committees  We’d like to clarify and adjust how committee operations fit into the three-week voting cycle.   Week 1: Community and Delegate Feedback  2 explicit delegate approval…     It should also be noted that each committee has a criteria and each proposal is a different case. ",
                    "links": [
                        "https://github.com/ethereum-optimism/OPerating-manual/blob/main/manual.md"
                    ],
                    "GPT-discussion-categories": [
                        "None of the topics listed match. The comment seems to be discussing a different topic related to committee operations and feedback, which is not directly related to the proposal for an Optimistic Alchemix OP Incentive."
                    ],
                    "Sentiment": 5.6499999999999995
                },
                {
                    "author_link": "https://gov.optimism.io/u/Defi_LATAM_axlvaz",
                    "index": "33",
                    "likes": "0",
                    "time": "28/09/2022-22:02:20",
                    "content": "@Ov3rkoalafied  The most important thing is to know the KYC conditions and if the Alchemix team is willing to adapt. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.916666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPGovWatch",
                    "index": "34",
                    "likes": "0",
                    "time": "28/09/2022-23:17:06",
                    "content": "I understand that. I’m suggesting the committee members act on this guidance and make clear their positions on protocol self-delegation and deployment status so protocols can revise their proposals accordingly.  “Committee members should do their best to be active in this process to ensure continuity for proposers throughout the voting cycle and since some committee members will need to provide the required approvals.”  The objective here is to create some “continuity” between the feedback phase and committee recommendation phase. If there isn’t, you create an impossible situation for proposers when faced with inconsistent feedback from different committees and their individual members. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.214285714285714
                },
                {
                    "author_link": "https://gov.optimism.io/u/Defi_LATAM_axlvaz",
                    "index": "35",
                    "likes": "1",
                    "time": "28/09/2022-23:43:21",
                    "content": "I think you are confused, or at least I see it that way: 1- The gov members (they don’t necessarily have to be delegates) can give the feedback they think is correct. 2- Delegates (they don’t necessarily have to be committee members) can give the feedback they feel is correct. 3- Delegates who are members of a committee can give feedback that is likely to be aligned with the committee on which they serve. 4- Committees give recommendations according to what they believe is best for Optimism governance and for the protocol. With their criteria formed by a group of delegates. The proposers adapt the comments to what they feel is necessary and within the recommendations of the members and the committee. The approval of the next phases does not depend exclusively on the delegates who are members of the committee. Other delegates can and have already done so. Personal opinion: For me self-delegation is not applicable, BUT if there is a proposal that convinces me that self-delegation in that proposal should be approved I will agree. In this particular case if Alchemix makes a long term bet on Optimim it can buy the token in the same way it did with the VELO token. Lastly I think proposals that want to include self-delegation have every right to do so, the snapshot vote is the final decision. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.1804315476190474
                },
                {
                    "author_link": "https://gov.optimism.io/u/Prometheus",
                    "index": "36",
                    "likes": "3",
                    "time": "29/09/2022-00:10:10",
                    "content": "    OPGovWatch:  you create an impossible situation for proposers   I guess it’s a gamble for proposers. If they want to self-delegate they will gamble the approval because voters may consider things they wouldn’t if self-delegation wasn’t on the table. Acquiring voting power via grants is a risk for proposers in my opinion and should be avoided but proposers can try. As far as they make it explicit,  people will vote accordingly. No matter what committees suggest. If voters don’t like grants to be used for self-delegation they probably will not care much about the proposal or what the committee thinks. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.388888888888889
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPGovWatch",
                    "index": "37",
                    "likes": "0",
                    "time": "29/09/2022-01:38:25",
                    "content": "At least so far, the committee recommendations seem to carry enough weight with delegates to push through or kill any proposal they weigh-in on. Unless any committee member expresses openness to using self delegation to expand protocol representation in governance, it certainly sounds like they should remove them if they want a shot at a yes vote. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.017857142857142
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "38",
                    "likes": "0",
                    "time": "29/09/2022-02:05:29",
                    "content": " I guess it’s a gamble for proposers. If they want to self-delegate they will gamble the approval because voters may consider things they wouldn’t if self-delegation wasn’t on the table.  Sorry, i don’t follow what you mean here. Are you saying that other asks may be in or out of scope depending on whether a proposal has included self-delegation? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 3.4375
                },
                {
                    "author_link": "https://gov.optimism.io/u/Prometheus",
                    "index": "39",
                    "likes": "2",
                    "time": "29/09/2022-02:13:09",
                    "content": "I mean voters can vote considering self-delegation regardless of any merits or values of the proposal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.4375
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "40",
                    "likes": "0",
                    "time": "29/09/2022-02:53:52",
                    "content": " what changed for you? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Defi_LATAM_axlvaz",
                    "index": "41",
                    "likes": "0",
                    "time": "29/09/2022-02:57:45",
                    "content": "Nothing has changed is what I think and what I have expressed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "42",
                    "likes": "0",
                    "time": "29/09/2022-03:06:06",
                    "content": "There you say you think self-delegation is acceptable so long as it’s made explicit in the proposal, and in this thread you say it’s a threat to governance:  I am against delegation and self-delegation with tokens received through grants.   I think that if you want to give voice to Alchemix you can make purchase of OP tokens in the secondary market. Considering that in AIP-59 you make use of treasury (correct me if I am wrong) to buy VELO tokens, you can use the same resource to buy OP tokens.   In my personal opinion I don’t see [self-delegation] at all healthy for governance. In this case I see speculation when you could ask for the necessary amount and then reapply for a second grant  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.78125
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "43",
                    "likes": "0",
                    "time": "29/09/2022-03:07:38",
                    "content": "One point here, by the way: Alchemix were in fact first airdropped locked VELO tokens – that is, they were granted governance power over the protocol. Which eventually led them to buy and lock more VELO, which is what you see in AIP-59. Sometimes being a little active in fostering engagement is a good thing. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving additional information on proposal"
                    ],
                    "Sentiment": 6.129166666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/Defi_LATAM_axlvaz",
                    "index": "44",
                    "likes": "0",
                    "time": "29/09/2022-03:34:55",
                    "content": "    jackanorak:  There you say you think self-delegation is acceptable so long as it’s made explicit in the proposal, and in this thread you say it’s a threat to governance:   First, it is necessary to contextualize: Both the Perpetual and Synthetix self-delegations were in a framework where they had not expressed that they would be used for self-delegation. As I said before and say again now I am not in favor of self-delegation, but if there is a superseded proposal it would be something to assess and subsequently be in favor in that particular case. Finally I have given my reasons why I do not see this self-delegation as positive. And as I have said other times it is my point of view. If the proponents want to include self-delegation in their proposal that is fine and they can do so. As always the final decision is in the snapshot. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.442803030303031
                },
                {
                    "author_link": "https://gov.optimism.io/u/Defi_LATAM_axlvaz",
                    "index": "45",
                    "likes": "1",
                    "time": "29/09/2022-03:36:13",
                    "content": "Here you have been awarded a grant, and you have also been given an airdrop. Do you think these are not enough reasons to bet on Optimism? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "46",
                    "likes": "0",
                    "time": "29/09/2022-03:43:45",
                    "content": "Honestly? I think in many cases people need to be shown the value of governance power. There’s a ton we’re capable of accomplishing with enough participation and buyin from stakeholders, and we’re all here because we know this. Not everyone knows this, and unless they do we’re not going to have enough resources to follow through on our goals. There’s an entire graveyard of projects and ecosystems that’ll show you that grants and airdrops are in themselves not enough to sustain effort. Users, developers, and partners can’t be expected to immediately ‘get it’ just because they got some free money – they need to have some actual hands-on exposure to what we’re doing. What i’m saying is that sometimes you need to drag people to the party when you want them to show up. That’s what facilitating self-delegation is to me. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.681818181818182
                },
                {
                    "author_link": "https://gov.optimism.io/u/Defi_LATAM_axlvaz",
                    "index": "47",
                    "likes": "1",
                    "time": "29/09/2022-04:14:11",
                    "content": "    jackanorak:  What i’m saying is that sometimes you need to drag people to the party when you want them to show up. That’s what facilitating self-delegation is to me.   And you think that granting grants is not inviting them to the party? Self-delegation of token grants can lead to centralization or secret agreements between projects-protocols and delegates to delegate tokens in exchange for votes/grants. I think it is necessary to be careful with self-delegation, a malicious actor could sneak in. I also believe that a good cause of self-delegation can add to this governance but it has to be evaluated with a lot of criteria and responsibility. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.1
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "48",
                    "likes": "0",
                    "time": "29/09/2022-04:33:26",
                    "content": "I think this fear is legitimate but entirely misplaced if you think self-delegation in broad daylight is a major vector here. The routes to collusion are many and don’t require a lick of self-delegation. You want to know how to avoid centralization and kneecap collusion? Get more stakeholders in the game. Right now the distribution of votes is more or less fixed since the airdrop, and the only distribution of OP is to protocols, which are doing nothing with them until doling out 60% of their granted tokens (realistically closer to 100% initially given the speed of liq mining relative to other uses) to the likes of stablecoin farmers to be dumped into LPs, again doing nothing. So there are likely few marginal delegators (the # of delegated tokens has consistently decreased, even as circulating supply has increased), and the same centralization concerns persist until the next marquee OP airdrop, which may or may not improve the distribution. Show projects, partners, builders what it means to get into governance and take part in assembling the collective, to tangle over heady ideas about coordination and incentivization, to cooperate and compete, and you start to see the decentralization we all want here. That’s all to say that i think allowing some measure of self-delegation in fact hastens decentralization, and what’s more, you get a bunch more voices in the forums. I urge you to be more open-minded here, both about the risks of centralization and about the benefits of letting broader inclusion breathe. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.525879917184265
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "49",
                    "likes": "1",
                    "time": "29/09/2022-04:51:25",
                    "content": "this is veering into a more general discussion so out of respect for Alchemix and their efforts i suggest we move this into a thread i just spun up: Let's settle once and for all the question of grantees self-delegating ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.375
                },
                {
                    "author_link": "https://gov.optimism.io/u/Defi_LATAM_axlvaz",
                    "index": "50",
                    "likes": "2",
                    "time": "29/09/2022-05:33:33",
                    "content": "This game is open and everyone can participate, or is this not the ethos of cryptocurrencies? In general it is hard to make there interests in DAOs and governance, even if incentives are handed out. We have voted a lot of projects and given a lot of money in grants, projects/protocols have a great opportunity to receive incentive funding on their projects/protocols without resorting to inflating their token or using their treasury. Only a few have submitted delegates in this government. Do you think the game is not open, do you think there is no inclusion, when the cost of participation is $0? Protocols can apply for delegates in their communities and some have large communities. isn’t that what Velo did to get delegate votes? they have done it even for voting committees. Surely in the future we will get proxies for the tokens that are being given now as incentives to protocol users. Protocols have influence over their communities/users. If it is convenient to continue the conversation in another thread. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.11359126984127
                },
                {
                    "author_link": "https://gov.optimism.io/u/Bobbay_StableLab",
                    "index": "51",
                    "likes": "0",
                    "time": "29/09/2022-08:51:47",
                    "content": "    Ov3rkoalafied:  33% (250,000) will be held for the potential to bootstrap a future alOP integration. alOP would require a yield source, which would most likely come from either AAVE utility (or similar integration), or even better if Optimism eventually earns revenue and shares it with token holders. While we wait for this use case to emerge as a possibility, the OP self-delegated or delegated to a partner protocol to give Alchemix a voice in Optimism governance. If it eventually becomes clear alOP won’t be feasible, then we can look to extend / ramp up liquidity mining to attract more users (should it continue to be proven that our depositors are generally remaining deposited).   Since it is a potential, I’d suggest removing this until the Alchemix team has better knowledge whether alOP will be feasible and apply for a future grant. Especially since your other solution was to extend the rewards LPs, it is better to see the success of this grant, instead of doubling down. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.785130718954249
                },
                {
                    "author_link": "https://gov.optimism.io/u/Ov3rkoalafied",
                    "index": "52",
                    "likes": "0",
                    "time": "29/09/2022-13:22:25",
                    "content": "I’ve received multiple answers to this, none of them end-all be-all clear on what is required. We want to be flexible but ultimately if our entire multisig has to KYC it’s probably a no go. Anything else I think we can work around. If the proposal passes and it turns out we can’t KYC, OP doesn’t lose anything and all we lost is time. So if we don’t figure out the exact KYC requirements by the time it’s time to vote, I would prefer to go to a vote and just state that we aim to follow KYC requirements and will work with the Optimism Foundation to do so. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.3500000000000005
                },
                {
                    "author_link": "https://gov.optimism.io/u/Ov3rkoalafied",
                    "index": "53",
                    "likes": "0",
                    "time": "29/09/2022-13:27:55",
                    "content": "There are dozens of L1 projects willing to shell out if you build on their chain. We chose Optimism because of its EVM compatability / Ethereum alignment (being an L2), as well as the vibrant DeFi ecosystem. I understand concerns with governance, but I think an argument for self-delegation is that if you want us to make Optimism a true home for Alchemix, then we would like to have a voice in it. Having that initial voice lets us experience OP governance firsthand to determine if we would like to purchase more OP to have a more sustained voice. Understood though that there can be concerns with protocols partnering up / gaming votes with that concentrated power. Since we have a week until community feedback ends, I’m going to take a few days to think about if I can more clearly dictate our plan for delegation or if it does ultimately just make sense to remove it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.083333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/Ov3rkoalafied",
                    "index": "54",
                    "likes": "0",
                    "time": "29/09/2022-13:35:58",
                    "content": "We are live! Deposit caps will be 100k for a week, then cranked up to $5m so long as there are no issues: Alchemix ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.301136363636364
                },
                {
                    "author_link": "https://gov.optimism.io/u/Prometheus",
                    "index": "55",
                    "likes": "2",
                    "time": "29/09/2022-13:54:14",
                    "content": "    Ov3rkoalafied:  I think an argument for self-delegation is that if you want us to make Optimism a true home for Alchemix, then we would like to have a voice in it.   Why not using your community to leverage the Governance position instead of using grants for that? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "56",
                    "likes": "1",
                    "time": "29/09/2022-14:11:31",
                    "content": "My suggestion here would probably be simply to include the self-delegation component in one of your other asks - your delegate power would draw down over time, and the stickiness of that power would depend on, to @Prometheus point, perhaps your community’s interest in delegation. For what it’s worth, I do think the primary source of new delegation will have to be protocols and especially their communities. And protocols are more likely to animate their communities once they come to appreciate the possibilities inherent in participating in governance. And no, I’m not talking about self-interest – i’m talking about helping to shape the ecosystem people want to see. It’s an exciting thing to consider if you’re a protocol. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.677904040404041
                },
                {
                    "author_link": "https://gov.optimism.io/u/Defi_LATAM_axlvaz",
                    "index": "57",
                    "likes": "1",
                    "time": "29/09/2022-21:58:51",
                    "content": "My question is what happens when the incentives in Optimism run out. I think self-delegation can also bring parasitic protocols into the network as well as users farming the token in their protocols. I also believe that if Alchemix had any interest in this governance it would have appointed at least one delegate, why didn’t it do so if it sought to have a say in this governance? Asking for support in your community is a good start and has a cost of $0 as well as appointing a delegate to represent Alchemix’s interests. In the event that the proposal is not voted YES, will Alchemix still be interested in governance as one of the protocols they seek to develop in the network? Self-delegation with token grants is the same thing @jackanorak complains about from users. What I don’t see in the protocols being pushed by @jackanorak  for self-delegation is at least minimal participation beyond his own proposals. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.607142857142858
                },
                {
                    "author_link": "https://gov.optimism.io/u/Defi_LATAM_axlvaz",
                    "index": "58",
                    "likes": "2",
                    "time": "29/09/2022-22:05:12",
                    "content": "However, I will stop commenting on the thread beyond the proposal itself. I think it is a long discussion but worth addressing and discussing in governance. This kind of conversations make the governance of Optimism grow, which is what we all want. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.416666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/Ov3rkoalafied",
                    "index": "59",
                    "likes": "2",
                    "time": "30/09/2022-01:24:49",
                    "content": "Honestly I think we just haven’t wrapped our heads fully around OP governance, there’s a lot going on and you have to understand that many of the protocols applying are not going to be nearly as knowledgable as someone already very familiar. So I appreciate all your insight. And yes - even without being given an initial say, Optimism is still very interesting to us as a long-term deployment. Obviously the potential for incentives led to us narrowing down to Optimism as our next L2 launch, but we passed on numerous other chains that reached out to offer significant incentives to deploy on them. And quite frankly I think the incentives just made us prioritize dev time - it was already shaping up to be our next launch without incentives because the team already liked what Optimism was doing and it’s one of the first EVM L2 with the right DeFi ecosystem (which is a good sign for future growth). As mentioned I\"m going to do a deeper dive into delegation and watch the other thread for discussion, then revise the proposal either with a more detailed delegation ask or with it removed, leaving at least a couple more days for community feedback. Ultimately the delegation is not our primary goal for the proposal. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.085126678876679
                },
                {
                    "author_link": "https://gov.optimism.io/u/marc",
                    "index": "60",
                    "likes": "0",
                    "time": "30/09/2022-14:49:06",
                    "content": "hello @Ov3rkoalafied, it’s marc from Candide Wallet. Thank you for your proposal and congrats to Alchemix on their Optimism Launch! Alchemix is one of the protocols that really highlight interesting use cases enabled by DeFi with their self-repaying non liquidation loans. Overall, well written proposal that highlights both Alchemix ecosystem value proposition and its values to contribute to public goods through Gitcoin. I will echo previous feedback from other commentators:  I encourage you to reconsider the amount you are requesting for your future alOP integration. Since this is still in the pipeline of possibilities like you mention, you can always come back to request this amount in another proposal once the integration is live and have some traction. This integration is interesting for Optimism and will bring lots of value. At the current state, your total requested value amount is sitting around x8 the protocol deposits on Optimism (since you have just recently deployed). The expectation is that the amount requested would somehow match your protocols deposits. I believe your proposal have a higher chance of getting through if you lower your ask and your timeframe from 1 year, or wait until you show some more traction for another cycle.   Should the deposit caps on Optimistic Alchemix quickly fill, that will be indicative to Alchemix that we should look to re-allocate some bribes from CRV/CVX on mainnet to veVELO on Optimism to further scale the deployment.   can you clarify exactly when and how much of rellocation to from CRV/CVX bribes on mainnet?  Overall, I am in support of this proposal as Alchemix has a unique proposition to Optimism in terms of its innovative mechanism in DeFi. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.7847796143250685
                },
                {
                    "author_link": "https://gov.optimism.io/u/Defi_LATAM_axlvaz",
                    "index": "61",
                    "likes": "0",
                    "time": "01/10/2022-02:05:51",
                    "content": " ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Ov3rkoalafied",
                    "index": "62",
                    "likes": "1",
                    "time": "02/10/2022-19:57:36",
                    "content": "Hello! A few updates related to this comment/others here:  I’ve entirely removed our ask for future alOP / self delegation. While it appears self delegation could be acceptable, it isn’t the primary reason we applied for the grant and it makes sense that a future use case could be addressed with a future grant. Looking at some other protocol asks, I’ve reduced the total ask from 750,000 to 500,000 (ie, the tokens that were being asked for for self delegation were completely removed, rather than reidistributed). I updated a few statistics here and there just to reflect the present day #delegate-updates   I do want to note that The “total requested based on current TVL” feels a bit backwards to me. Isn’t the point of OP grants to incentivize TVL and genuine defi activity on Optimism? I think our (reduced) ask is fair for these reasons:  we have a proven use case on mainnet, being live for a year and a half, and the quality defi / low gas environment of optimism strengthens the use case without needing users to sacrifice their loyalty to ethereum We’ve explained that TVL is rather sticky so incentives are necessary to get people to migrate to try out Optimistic Alchemix Without an OP grant, users are less likely to use Optimistic Alchemix, as they could use another protocol that gives them OP incentives (which would then put Alchemix on uneven footing where our utility needs to overcome their straight financial incentive)  it’s a bit of a chicken & egg scenario, where we need a grant to prove we deserve the grant, but I believe the points above + the reduce total amount (from eliminating the delegated tokens) addresses the concerns. This also means we aren’t requesting dev or DAO funds - every OP token we get will go into the hands of those bringing TVL to Optimism through Alchemix / Alchemix partners. For CVX/CRV bribes, it will be dependent on alAsset peg. As seen in the proposal it’s expected that the incentives bring more TVL to depositors than to liquidity (which is good, as that TVL is stickier). This also means that if we hit our TVL expectations, we will need more liquidity on Optimism. A clear sign of need would be either high TVL or lower alAsset peg on Optimism. Usually liquidity equivalent to half of TVL is sufficient / a good target. So - if we meet our goal of >30m TVL, we’d need ~15m of liquidity. The incentives we have asked for in theory put us at 30m TVL, and 5m of liquidity. The liquidity comes from 250k OP tokens plus our VELO position. So we’d effectively need to provide another effective 500k+ of OP (in the form of ALCX) get up to the required liquidity. Which happens to be the grant we requested (that actually wasn’t intentional haha). So effectively, the way the proposal is set up is that we are providing the incentives to make Optimistic Alchemix feasible for launch, Optimism provides incentives start the growth, and then we can step in with more incentives to sustain the growth. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.585876623376623
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "63",
                    "likes": "1",
                    "time": "02/10/2022-21:11:54",
                    "content": " it’s a bit of a chicken & egg scenario, where we need a grant to prove we deserve the grant, but I believe the points above + the reduce total amount (from eliminating the delegated tokens) addresses the concerns.  I share this concern and think the focus always ought to be on evidence-backed expectation of growth unlocked by a grant – that is, what we think the grant catalyzes for the ecosystem-- rather than by existing TVL. One of the core purposes of the gov fund is to migrate protocols that have demonstrated PMF elsewhere, and Alchemix clearly fits this bill, even if it has yet to hit its ‘full’ numbers on Optimism. This isn’t to say TVL isn’t irrelevant – it is a fine enough (but messy and manipulable) proxy for use, utility, and market acceptance – but there’s a risk in using it as a crutch as we have. Part of it is that it’s an easy thing to point to relative to other metrics, which is why we ought to be asking more from protocols in furnishing use data and perhaps pointing delegates to known resources on our end to help evaluate. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.010416666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/marc",
                    "index": "64",
                    "likes": "1",
                    "time": "03/10/2022-14:56:53",
                    "content": "Thank you for the clarification. You make a solid case for Alchemix’s proposal and the adjustments you have made strengthens it. I encourage you to summarize the clarification for the CVX/CRV bribes in the original proposal post, as well as highlight changes that you have made throughout your proposal in the top (based on the feedback you received). I am giving support for this proposal in its current form, both for Alchemix’s value going beyond simple DeFi primitives with its unique proposition as well as its proposal that is well revised to increase activity on Optimism. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party giving entirely positive feedback on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.041666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/Ov3rkoalafied",
                    "index": "65",
                    "likes": "0",
                    "time": "05/10/2022-00:22:24",
                    "content": "Thank, you, done and done! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "66",
                    "likes": "0",
                    "time": "05/10/2022-00:52:39",
                    "content": "Not sure whether I need to do this again, but I’ve been asked to do so, just in case: I am an Optimism delegate [Delegate Commitments - #136 by jackanorak ] with sufficient voting power and I believe this proposal is ready to move to a vote. ",
                    "links": [
                        "https://gov.optimism.io/t/voting-cycle-7-roundup/3586/10"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 4.875
                },
                {
                    "author_link": "https://gov.optimism.io/u/mastermojo",
                    "index": "67",
                    "likes": "0",
                    "time": "05/10/2022-01:31:04",
                    "content": "Voting Cycle #7: Roundup move your approvals here; Jack and myself gave you the OK. Good luck! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.4375
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "68",
                    "likes": "1",
                    "time": "12/10/2022-15:43:47",
                    "content": "The defi shadow committee  – which is not an official committee – supports this proposal. We broadly support Alchemix’s proposal as written but advise halving their ask generally by time and size – there’s simply no good argument for running a grant past six months, and even that amount of time is a stretch. They’re in the minority of proposals to date that have offered a bottom-up approach in outlining the size of their ask and explaining the additionality of the grant, and we’re inclined to agree with their view. Another key piece is that Alchemix’s proposal is rare in that they are explicitly committing to move resources over to Optimism themselves — that is, they’re not just trying to draw users and capital, they’re moving the deployment of their own capital to encourage more use on Optimism. This goes beyond the simple idea of “incentive matching” — it’s a reflection that a grant can beget follow-on activity, and it’s exactly the kind of behavior we should be encouraging. We think there is still some work to be done to determine KPIs, demonstrate migration from Mainnet, and discuss potential integrations with other ecosystem protocols, but these are nits in an otherwise well-presented proposal that seems advantageous for Optimism. ",
                    "links": [
                        "https://gov.optimism.io/t/defi-shadow-committee-b-season-2-recommendations/3549/12"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.6298076923076925
                },
                {
                    "author_link": "https://gov.optimism.io/u/katie",
                    "index": "69",
                    "likes": "0",
                    "time": "12/10/2022-16:21:39",
                    "content": " Defi Committee A Recommendation Voting recommendation: No with caveat to resubmit Rationale: We like the overall token distribution plan and value proposition.  However, we would like to see the proposal resubmitted with the amount and distribution timeline split into 2 separate proposals.  We would be happy to approve this proposal once these changes are made. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Ov3rkoalafied",
                    "index": "70",
                    "likes": "0",
                    "time": "12/10/2022-18:55:41",
                    "content": "My interpretation of this request is that we would split it into 250k tokens for depositor incentives, and 250k tokens for liquidity incentives - is that accurate? Additionally, can the split simply be a note in the proposal that the two 250k asks will be voted on separately, or you’d actually like us to split it out into two new forum posts? Thanks! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.786363636363636
                },
                {
                    "author_link": "https://gov.optimism.io/u/katie",
                    "index": "71",
                    "likes": "2",
                    "time": "12/10/2022-23:41:22",
                    "content": "We would like to see the distribution timeline and amount requested both reduced.  The current ask is 500,000 over one year, so ideally we would like to see 250,000 over 6 months, so we can re-evaluate and make an additional grant based on performance metrics.  Thank you for following up and please reach out if you have any additional questions. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/Ov3rkoalafied",
                    "index": "72",
                    "likes": "0",
                    "time": "13/10/2022-00:16:09",
                    "content": "Got it, so to verify - you are asking us to reduce the ask to 250k over 6 months for this proposal. Then, in 6 months, we can come back with another proposal for another 250k, or more, or less, if it makes sense to do so. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.555555555555555
                },
                {
                    "author_link": "https://gov.optimism.io/u/katie",
                    "index": "73",
                    "likes": "1",
                    "time": "13/10/2022-00:22:37",
                    "content": "Yes, exactly.  We can reassess after the 6 month timeline and evaluate effectiveness of the current token distribution plan. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://gov.optimism.io/u/Ov3rkoalafied",
                    "index": "74",
                    "likes": "1",
                    "time": "13/10/2022-01:00:24",
                    "content": "Thank you for the feedback. I’ve made the suggested edits to the proposal to reflect 250k tokens over 6 months. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/katie",
                    "index": "75",
                    "likes": "0",
                    "time": "13/10/2022-02:49:39",
                    "content": "I believe it may be too late for these changes to be included in the current voting cycle.  If that’s the case, we will be happy to support this proposal in the next voting cycle.  Looping in @lavande for guidance ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "76",
                    "likes": "3",
                    "time": "13/10/2022-12:37:48",
                    "content": "Since this proposal has received two delegate approvals, it may move to a vote in Cycle 7 as is. Since approvals and committee recommendations were provided based on the proposal in its current form, and votes go to Snapshot today, I believe it is too late to make changes to the current proposal in this cycle. The options would be to submit this proposal as is in Cycle 7 or to re-submit an updated proposal in Cycle 8. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party auditing and reviewing proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 4.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPGovWatch",
                    "index": "77",
                    "likes": "2",
                    "time": "13/10/2022-13:07:30",
                    "content": "Yes, I believe this proposal should go to Snapshot now in the same form in which it was originally submitted. @Ov3rkoalafied this means it could still be approved by delegate votes in its current form and you are welcome to reach out to delegates to solicit their support. If it does not pass, you can resubmit to Cycle 8 with edits @Katie has suggested which sounds like it will earn their endorsement and will likely lead to easy approval then. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.340277777777778
                },
                {
                    "author_link": "https://gov.optimism.io/u/katie",
                    "index": "78",
                    "likes": "1",
                    "time": "13/10/2022-20:24:13",
                    "content": "Voted no - Defi Committee A reasoning given here.  I like this proposal overall but the team is going to adjust their amount requested and distribution timeline and resubmit for next cycle. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Ov3rkoalafied",
                    "index": "79",
                    "likes": "0",
                    "time": "13/10/2022-22:56:56",
                    "content": "Sounds good to me. Do I need to do anything for it to proceed in that manner? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/polynya",
                    "index": "81",
                    "likes": "2",
                    "time": "15/10/2022-02:54:49",
                    "content": "Hope to vote for this in the next voting cycle, if you follow committee’s recommendation this is a strong proposal otherwise. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.083333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "82",
                    "likes": "2",
                    "time": "15/10/2022-18:32:01",
                    "content": "Voted : Against Going with Committee decision and would love to support the proposal with new changes. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.590909090909091
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "83",
                    "likes": "0",
                    "time": "20/10/2022-11:26:23",
                    "content": "Voted No for this particular iteration of the proposal following DeFi committee A’s recommendation. The team will hopefully take the feedback and resubmit next cycle. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.277777777777778
                },
                {
                    "author_link": "https://gov.optimism.io/u/SEED_LATAM_Joxes",
                    "index": "84",
                    "likes": "0",
                    "time": "21/10/2022-02:35:24",
                    "content": "[Final] Voting: Against Following the DeFi A committee recommendation, our vision particularly in this case, we would like to see some traction as a lending protocol in the Optimism network or faithfully follow the recommendations of the committee to governance provide a grant (approving the proposal) in its fair measure. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.083333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "85",
                    "likes": "0",
                    "time": "21/10/2022-13:15:05",
                    "content": "Snapshot vote - not passed ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "86",
                    "likes": "0",
                    "time": "21/10/2022-13:15:08",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "252"
}