{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/season-1-grant-proposal-template-old/3454",
            "title": "Season 1 Grant Proposal Template [OLD] ",
            "index": 3454,
            "category": [
                "\\xf0\\x9f\\x8f\\x9b Governance"
            ],
            "tags": [
                "season-1"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "1",
                    "likes": "0",
                    "time": "13/09/2022-13:07:29",
                    "content": " Incentive Proposal Template  Project Name: Author Name: Number of OP tokens requested: L2 Recipient Address: Relevant Usage Metrics: (TVL, transactions, volume, unique addresses, etc.) Optimism alignment (up to 200 word explanation): Proposal for token distribution (under 1000 words):  How will the OP tokens be distributed? How will this distribution incentivize usage and liquidity on Optimism? Why will the incentivized users and liquidity remain after incentives dry up? Over what period of time will the tokens be distributed? Has your project previously received an OP token grant? If yes, what’s the status of these tokens? How much will your project match in co-incentives?   ",
                    "links": [],
                    "GPT-summary": "The post is a grant proposal template for a project on Optimism. The author explains the project and provides details on the token distribution. A third party may ask questions or provide constructive criticism on the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.06547619047619
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "2",
                    "likes": "0",
                    "time": "13/09/2022-13:07:37",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "3",
                    "likes": "0",
                    "time": "13/09/2022-13:08:26",
                    "content": "Saving here just for the record. Please use the new grant proposal template for Season 2. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.681818181818182
                }
            ]
        },
        {
            "thread_link": "https://gov.optimism.io/t/season-2-grant-proposal-template/3233",
            "title": "Season 2 Grant Proposal Template ",
            "index": 3233,
            "category": [
                "\\xf0\\x9f\\x93\\x8c Policies and Templates"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/ben-chain",
                    "index": "1",
                    "likes": "38",
                    "time": "05/08/2022-16:56:58",
                    "content": " Phase 1 Proposal Template v2 All Governance Fund grant proposals will be processed by a Grants Council in Season 3. Please submit your application to the Grants Council here following the process outlined here.  ALL CYCLE 11 GRANT PROPOSALS SHOULD USE THE UPDATED TEMPLATE HERE.   Key information about Governance Fund grants 5.4% of the total initial token supply (231,928,234 OP) will be distributed to Optimism projects and communities via the Governance Fund.  A portion of the Governance Fund may be used to provide OP grants. There are two primary objectives of Governance Fund grants in Season 3:   Grow population of values-aligned builders: The Governance Fund should support developers launching novel applications that will draw new users to Optimism.  Support small scale initiatives to grow unique users on Optimism: The Governance Fund may also support protocols by incentivizing small scale user growth initiatives.  Larger scale partnerships with protocols that have already found product-market fit are better suited to the Partner Fund. For further details on the governance fund, please see the Governance Fund Charter.  During Season 3, projects can submit grant proposals to the Grants Council. The Council is split into two sub-committees:   Builders Sub-Committee:  Focus: maximize the number of developers building on Optimism Non-focus: retroactive funding Possible grant examples: prospective builder grants for new projects, hackathons, technical content Format: proposers receive grants, suggested to be <50k OP, which are locked for a period of 1-year. If access to upfront capital is a blocker for applicants, Optimism may put them in touch with alternative resources to support teams in this position. Budget: 850k OP / Season Reviewers: @gonna.eth, @kaereste, and @jackanorak  Consensus: 2/3 vote required to fund a grant    Growth Experiments Sub-Committee:  Focus: maximize the number of users interacting with applications on Optimism Non-focus: retroactive airdrops Possible grant examples: small-scale liquidity mining experiments, usage incentives, user education Format: proposers receive milestone-based grants, suggested to be <250k OP, to pass on directly to their users as incentives for engaging with a protocol, platform, product or service. 40% of the grant will be distributed to the proposer upfront and the remaining 60% will be distributed upon completion of a mid-way point milestone. Completion of all milestones should be achievable in 3-6 months. Budget: 4M OP / Season Reviewers: @Michael, @katie, @GFXlabs, @MattL, and @MoneyManDoug  Consensus: 3/5 vote required to fund a grant    The Council is welcome to consider any and all proposals which would drive growth or address a gap in the Optimism ecosystem, including public goods projects. However, all grant funding should come with an expectation of growth-related deliverables. It is not the intended purpose of the governance fund to retroactively fund public goods without an expectation of future work—there is a distinct OP allocation dedicated to this, which will be distributed via the Citizens House at a later date. You can read more about the total allocation of OP in the Allocations section 13 of our Governance docs 10.The Council may also put forward Requests for Proposals for particular grant proposals they would like to review.  How to apply for a Governance Fund grant To submit a proposal, please submit your application to the Grants Council here following the process outlined here. The application will follow the below template, which you should complete via the application form. Please make sure you are familiar with the no-sale policy outlined below, under Eligibility, before applying.  Grant Proposal Template  Project name: Author name and contact info (please provide a reliable point of contact for the project): I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: [Yes/No] I understand that I will be expected to following the public grant reporting requirements outlined here: [Yes/No] L2 recipient address: Which Voting Cycle are you applying for?: Which sub-committee should review your proposal? (Builders Grants, Growth Experiment Grants) Project description (please explain how your project works): Project links:  Website: Twitter: Discord/Discourse/Community: Please include all other relevant links below:  Additional team member info (please link): Please link to any previous projects the team has meaningfully contributed to: Relevant usage metrics (TVL, transactions, volume, unique addresses, etc. Optimism metrics preferred; please link to public sources such as Dune Analytics, etc.): Competitors, peers, or similar projects (please link): Is/will this project be open sourced? Yes/No/In Future Optimism native?: Yes/No Date of deployment/expected deployment on Optimism: Ecosystem Value Proposition:  What is the problem statement this proposal hopes to solve for the Optimism ecosystem? How does your proposal offer a value proposition solving the above problem? Why will this solution be a source of growth for the Optimism ecosystem?  Has your project previously applied for an OP grant? If successful, please link to your previous grant proposal and provide a brief update on milestones achieved with the grant. If unsuccessful, and this is a resubmission, please specify how you have incorporated significant changes in accordance with feedback. Number of OP tokens requested: Did the project apply for or receive OP tokens through the Foundation Partner Fund?: Yes/No/In Process If OP tokens were requested from the Foundation Partner Fund, what was the amount?: How much will your project match in co-incentives? (not required but recommended, when applicable): Proposal for token distribution:  How will the OP tokens be distributed? (please include % allocated to different initiatives such as user rewards/marketing/liquidity mining. Please also include a justification as to why each of these initiatives align with the problem statement this proposal is solving.) Over what period of time will the tokens be distributed for each initiative? Shorter timelines are preferable to longer timelines. Shorter timelines (on the order of weeks) allow teams to quickly demonstrate achievement of milestones, better facilitating additional grants via subsequent proposals. Please clearly define the milestones you expect to achieve in order to receive milestone based installments. Please consider how each milestone relates to incentivizing sustainable usage and liquidity on Optimism. Progress towards each milestone must be trackable. Why will incentivized users and liquidity on Optimism remain after incentives dry up?  Please provide any additional information that will facilitate accountability:(smart contracts addresses relevant to the proposal, relevant organizational wallet addresses, etc.)   Eligibility considerations The below restrictions may not map with 100% clarity onto all possible scenarios. In the spirit of governance minimization, the Optimism Foundation will not police the application of these rules. Instead, it is the directive of the Token House to apply these parameters consistent with the purpose of the Governance Fund: driving sustainable usage and engagement on Optimism (rather than simply providing teams with working capital or voting power). OP received through Growth Experiments Grants should not be sold by the grant recipient. This “no sale” rule:   Includes the grant recipient, their affiliates and any other related persons. These persons cannot receive OP for the purpose of selling (or if the grant recipient knows they intend to sell) the tokens.  Includes the direct exchange of OP for crypto or fiat, whether done publicly or privately. Think selling OP in exchange for fiat or crypto, regardless of whether done on a CEX, DEX, OTC desk, at your local park, or otherwise.  Does not include using OP to incentivize usage. Providing OP as liquidity mining incentives is not restricted by these parameters. There is no expiration to this rule for Growth Experiments Grants  OP received through Builders Grants should not be sold by the grant recipient for a period of one year. After a holding period of one year, Builders Grant recipients have full discretion over how they utilize OP, so long as it coincides with the objectives outlined in their proposal. You can read more about the reasoning behind the token locks here. The expectation is that token grants will not be self-delegated for use in governance. The primary purpose of these token grants is to incentivize sustainable usage and growth of the Optimism ecosystem. Accordingly, for partners interested in increasing their voting power, the preferred route is by encouraging users to delegate their rewards to your governance representatives. There is no hard restriction on self-delegation, but if you plan to delegate a portion or all of your grant tokens to your own protocol, or a closely affiliated party, this should be made clear in your grant proposal along with your reasoning. ",
                    "links": [
                        "https://foul-porch-0eb.notion.site/Grants-Council-Internal-Procedures-504521342ee0402980321c56f1488542",
                        "https://gov.optimism.io/t/grants-proposal-template-cycle-11/5291",
                        "https://gov.optimism.io/t/op-governance-update-1-june-9-2022/2620",
                        "https://gov.optimism.io/t/governance-fund-charter/3944",
                        "https://community.optimism.io/docs/governance/allocations.html",
                        "https://community.optimism.io/docs/governance/",
                        "https://foul-porch-0eb.notion.site/Optimism-Grants-Council-090bb648d1854136b9630c608da7a8bc",
                        "https://foul-porch-0eb.notion.site/Grants-Council-Internal-Procedures-504521342ee0402980321c56f1488542",
                        "https://foul-porch-0eb.notion.site/Application-2d47da131a004e94a74e56af9438026b",
                        "https://gov.optimism.io/t/suggested-public-reporting-requirements-for-grantees/4176",
                        "https://gov.optimism.io/t/working-constitution-of-the-optimism-collective/55",
                        "https://gov.optimism.io/t/grant-token-lock-explainer/5060",
                        "https://gov.optimism.io/t/grants-proposal-template-cycle-11/5291",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/2",
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-otterspace/3445/17",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-velodrome-finance/3736/74",
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-cycle-6-kromatika/3306/35",
                        "https://gov.optimism.io/t/ready-gf-phase-1-across-protocol/3163/65",
                        "https://gov.optimism.io/t/update-of-the-phase-1-protocol-nomination-template/2966/13",
                        "https://gov.optimism.io/t/introducing-miticushqui-a-decentralized-monetary-authority-protocol-for-optimism/3051/2",
                        "https://gov.optimism.io/t/governance-update-3/3232",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-marsbase/4974",
                        "https://gov.optimism.io/t/ready-gf-phase-1-crnft/3716/13",
                        "https://gov.optimism.io/t/optiland-quests/5425",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-optichads-nft-project/3430/21",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-optichads-nft-project/3430/20",
                        "https://gov.optimism.io/t/review-gf-phase-1-proposal-alchemix/3475/4",
                        "https://gov.optimism.io/t/review-gf-phase-1-interest-protocol-post-deployment/2968/3",
                        "https://gov.optimism.io/t/draft-gf-phase-1-utopia-labs/3468/2",
                        "https://gov.optimism.io/t/opuser-delegate-communication-thread/2777/11",
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-otterspace/3445/19",
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-otterspace/3445",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/9",
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-karma-delegate-dashboard/3411",
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-karma-discourse-forum-plugin/3412",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/12",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-cycle-7-curve/3089/76",
                        "https://gov.optimism.io/t/lets-settle-once-and-for-all-the-question-of-grantees-self-delegating/3577",
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-gysr/2463/33",
                        "https://gov.optimism.io/t/crnft-upwork-for-web-3-0/3657/2",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/11",
                        "https://gov.optimism.io/t/voting-cycle-7-roundup/3586",
                        "https://gov.optimism.io/t/gfx-labs-delegate-communication-thread/2728/17",
                        "https://gov.optimism.io/t/lets-settle-once-and-for-all-the-question-of-grantees-self-delegating/3577/14",
                        "https://gov.optimism.io/t/voting-cycle-6-roundup/3481",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-zz-finance/3667/23",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/10",
                        "https://gov.optimism.io/t/crnft-upwork-for-web-3-0/3657/3",
                        "https://gov.optimism.io/t/review-gf-phase-1-proposal-optimism-tally-ho/3517/32",
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-otterspace-v2/3583",
                        "https://gov.optimism.io/t/voting-cycle-8-roundup/3742",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/27",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/14",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/19",
                        "https://gov.optimism.io/t/defi-committee-a-season-2-recommendations/3522/10",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/13",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-arrakis-finance/3805/12",
                        "https://gov.optimism.io/t/review-gf-phase-1-proposal-symphony-finance/3694/59",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/15",
                        "https://gov.optimism.io/t/gf-phase-1-proposal-optimism-nigeria/5366",
                        "https://gov.optimism.io/t/gf-phase-0-proposal-layer2dao/1198/53",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/16",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/21",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/26",
                        "https://gov.optimism.io/t/voting-power-grant-proposal/4197",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-opweave-coverage-of-everything-optimism/4990/6",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/22",
                        "https://gov.optimism.io/t/draft-gf-unmarshal-grant-cycle-11/5414",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/23",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-carbon/4975",
                        "https://gov.optimism.io/t/gf-phase-1-optimism-creative-event-and-education-seminar/5478",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/24",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/25",
                        "https://gov.optimism.io/t/ready-fairmint-growth-experiments-cycle-11/5508",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-praise/4986",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-defiedge/4985",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-pairwise/4976",
                        "https://gov.optimism.io/t/draft-crnft-digital-art-incubator/5009/2",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-poolz-finance/4977",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-opweave-coverage-of-everything-optimism/4990",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-longship/5005",
                        "https://gov.optimism.io/t/ready-gd-phrase-1-proposal-quadrat-protocol-powered-by-0xplasma-labs/5313",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-messari-protocol-services/4989",
                        "https://gov.optimism.io/t/draft-phase-1-proposal-giveth/4991",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-liquity/4979",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-clique/4980",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/29",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-elk-finance/4981",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-karma-delegate-registry/4982",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-essence-finance/4983",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-the-optimistic-series/4911",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-thales/4984",
                        "https://gov.optimism.io/t/gf-phase-1-proposal-defunds-co-decentralized-finance/4912",
                        "https://gov.optimism.io/t/gf-phase-1-proposal-tiny-dino-show-optimism/4914",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-oayc/4341/84",
                        "https://gov.optimism.io/t/gf-phase-1-proposal-optimism-x-afro-beat-music/4916",
                        "https://gov.optimism.io/t/gf-phase-1-proposal-via-protocol/4917",
                        "https://gov.optimism.io/t/gf-phase-1-proposal-hats-finance/4918",
                        "https://gov.optimism.io/t/gf-phase-1-proposal-complex-labs/4919",
                        "https://gov.optimism.io/t/opt-x-pathomap-optimistic-healthcare/4312/5",
                        "https://gov.optimism.io/t/gf-phase-1-proposal-resonate/4920",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-apetimism-launchpad/3852/18",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-code4rena/4835/2",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-messari-protocol-services/4989/2",
                        "https://gov.optimism.io/t/gf-phase-1-proposal-isomorph/4972",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-clipper/5019",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-metronomo/5021",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-rotki/5025",
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-paytrie-stablecoin-on-off-ramp-in-canada/5380",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-rigoblock/5028",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-atomic-links/5029",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-crypto-lfdm/5030",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-nested/5031",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-parcel/5032",
                        "https://gov.optimism.io/t/forward-growth-experiment-cycle-11/5539",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-premia/5034",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-front-running-protection-via-shielded-mempool-for-op-stack-using-threshold-encryption/5036",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-mux-protocol/5037",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-pass-on/5039",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-mava/5040",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-geo-web/5042",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-op-medicine/5043",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-ens-wildcard-domains/5044",
                        "https://gov.optimism.io/t/ready-vesper-finance/5389",
                        "https://gov.optimism.io/t/technical-grant-application-web3-game-rocket-rocket/5324",
                        "https://gov.optimism.io/t/impermax-finance-op-grant-growth-experiments-for-cycle-11/5339",
                        "https://gov.optimism.io/t/gf-phase-1-proposal-rubicon/5068",
                        "https://gov.optimism.io/t/gf-phase-1-proposal-questbook-optimism-grants-tooling/5069",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-shapeshift-dao/4968",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-crnft/5075",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-search-finance/5076",
                        "https://gov.optimism.io/t/draft-gf-phase-1-mux-protocol/5078",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-fluent-finance/5038",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-op-name-service/5096",
                        "https://gov.optimism.io/t/phase-1-proposal-optimism-mint/4819/5",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-fam/5035",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-praise/4986/4",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/30",
                        "https://gov.optimism.io/t/archive-kyberswap/4978",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-elk-finance/4981/6",
                        "https://gov.optimism.io/t/gf-phase-1-proposal-intswap/4913",
                        "https://gov.optimism.io/t/opt-x-pathomap-optimistic-healthcare/4312/10",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-dforce/5004",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/32",
                        "https://gov.optimism.io/t/gf-phase-1-proposal-analysis-on-optimism-incentive-programs-and-framework-construction-for-future-programs/5456",
                        "https://gov.optimism.io/t/gf-phase-1-proposal-ante/5529",
                        "https://gov.optimism.io/t/growth-experiments-proposal-op-medicine-with-electronic-medicine-trial-and-test-records-as-a-service-ehr-and-radiology-services/5537",
                        "https://gov.optimism.io/t/conduit-protocol-providing-seamless-trading-experience-for-synthetix-perps-v2/5485",
                        "https://gov.optimism.io/t/symbiosis-optimism-growth-experiments-grant-request-cycle-11/5513",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-pendle/5495",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-scry-protocol-permissionless-high-scale-oracles/5483",
                        "https://gov.optimism.io/t/gf-phase-1-proposal-defiedge/5484",
                        "https://gov.optimism.io/t/infinity-wallet-growth-experiments-cycle-11/4915",
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-nftearth-nft-marketplace/5491",
                        "https://gov.optimism.io/t/draft-gf-cycle-11-proposall-dforce-one-stop-shop-for-defi-solutions-on-optimism/5482",
                        "https://gov.optimism.io/t/babeldao-collaboratively-creating-story-universes/5427",
                        "https://gov.optimism.io/t/gf-phase-2-growth-proposal-shapeshift-dao/5568",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-zonic/5295",
                        "https://gov.optimism.io/t/cycle-11-grant-growth-experiments-rain/5530/2",
                        "https://gov.optimism.io/t/gf-phase-1-proposal-optimism-nigeria/5366/3",
                        "https://gov.optimism.io/t/symbiosis-optimism-growth-experiments-grant-request-cycle-11/5513/3",
                        "https://gov.optimism.io/t/draft-gf-unmarshal-grant-cycle-11/5414/2",
                        "https://gov.optimism.io/t/rigoblock-protocol-growth-experiments-cycle-11/5601",
                        "https://gov.optimism.io/t/geo-web-growth-experiments-cycle-11/5594",
                        "https://gov.optimism.io/t/builders-cycle-11-praise-reputation-minter-on-optimism/5598",
                        "https://gov.optimism.io/t/tide-protocol-data-driven-quests-growth-experiments-cycle-11/5610",
                        "https://gov.optimism.io/t/growth-experiment-bored-town-nft-art-community/5612",
                        "https://gov.optimism.io/t/giveth-growth-experiment/5637",
                        "https://gov.optimism.io/t/draft-gf-phase-1-giottus/5639",
                        "https://gov.optimism.io/t/metalswap-growth-experiments-grant-cycle-11/5613",
                        "https://gov.optimism.io/t/revolte-an-interactive-novel-to-onboard-web2-users-to-web3-growth-experiments/5376",
                        "https://gov.optimism.io/t/bhu-bu-gun-d-davam/5654",
                        "https://gov.optimism.io/t/ready-gf-phase-3-xtoken-terminal/5665",
                        "https://gov.optimism.io/t/okse-wallet-card-visa-mastercard-growth-experiments-cycle-11/5641",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-zkholdem/4973",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/17",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-myoptiboyz-nft/4866/4",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-tarot/3002/47",
                        "https://gov.optimism.io/t/another-case-of-self-delegation-of-op-tokens-received-in-grants/3372/5",
                        "https://gov.optimism.io/t/governance-fund-observations/3257",
                        "https://gov.optimism.io/t/governance-fund-observations/3257/2",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/8",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/28",
                        "https://gov.optimism.io/t/gf-phase-1-proposal-edge-wallet-integration-of-optimism-velodrome-lp-staking-swaps-tarot-lp-staking/3994",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/4",
                        "https://gov.optimism.io/t/another-case-of-self-delegation-of-op-tokens-received-in-grants/3372",
                        "https://gov.optimism.io/t/operating-manual-of-the-optimism-collective-v0-2-0/3370",
                        "https://gov.optimism.io/t/review-gf-phase1-homora-v2-on-optimism/3425/6",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/5",
                        "https://gov.optimism.io/t/review-gf-phase-1-proposal-bankless-academy-v2/3353/32",
                        "https://gov.optimism.io/t/review-gf-phase-1-nice2win/3423/16",
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-cycle-6-kromatika/3306/33",
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-barnbridge-2nd-swing/3351/4",
                        "https://gov.optimism.io/t/review-gf-phase-1-proposal-socket/3368/8",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-prime-rating/3216/2",
                        "https://gov.optimism.io/t/draft-gf-phase-1-givestation/3496/2",
                        "https://gov.optimism.io/t/draft-gf-phase-1-zerodao/2981/13",
                        "https://gov.optimism.io/t/draft-gf-phase-1-utopia-labs/3468/4",
                        "https://gov.optimism.io/t/review-gf-phase-1-proposal-karma-delegate-dashboard/3411/6",
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-bankless-academy-v2/3353/40",
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-across-protocol-updated-template/3401/9",
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-socket/3368/20",
                        "https://gov.optimism.io/t/review-gf-phase-1-interest-protocol-development-deployment-to-optimism/2951/21",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/7"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.57110456416012
                },
                {
                    "author_link": "https://gov.optimism.io/u/ben-chain",
                    "index": "2",
                    "likes": "0",
                    "time": "05/08/2022-19:55:16",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "3",
                    "likes": "15",
                    "time": "05/08/2022-23:02:30",
                    "content": "This is an super cool, I see couple of suggestion raised by me along with other delegates and community member. So thank you for working on feedback and making the changes accordingly.  Relevant usage metrics (TVL, transactions, volume, unique addresses, etc. Optimism metrics preferred; please link to public sources such as Dune Analytics, etc.)  Dont just provide a link of dune or defillama.If your account is new and you are limited to post link on your proposal. Post the related images, link as a comment. I am huge fan of Curve proposal, use that a reference and improve on top of it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.957611832611834
                },
                {
                    "author_link": "https://gov.optimism.io/u/MinimalGravitas",
                    "index": "4",
                    "likes": "14",
                    "time": "06/08/2022-09:40:10",
                    "content": "Such a lot of great additions on this, explicitly requiring links to the various community channels, data sources and similar projects are small, simple changes that will be a much appreciated QoL improvement for delegates. Really impressed. Another addition that would be useful might be a section for links to the team’s previous projects, so if the one they are deploying to Optimism is brand new and doesn’t show much in the way of impressive metrics yet, proposers can still demonstrate that they have a good track record of shipping decent dApps (or whatever they do). I’m also a big fan of the explicit restriction on using tokens for governance unless that use is included in the proposal, obviously that occurred briefly and was resolved by the cooperative response from the team who did it, but making it clear before hand that this is not cool seems a better way to avoid any bad vibes from misunderstanding and different interpretations of the token’s purpose. Overall the new template is  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.789545454545455
                },
                {
                    "author_link": "https://gov.optimism.io/u/Defi_LATAM_axlvaz",
                    "index": "5",
                    "likes": "10",
                    "time": "06/08/2022-15:43:17",
                    "content": "I think this update is very good, I would add two more questions: 1- Did the project apply for or receive OP tokens through the Foundation Partners Fund? Yes/No or we have applied and have not received a response yet. 2- If OP tokens were requested from the  Foundation Partners Fund, what was the amount? Note: I believe these questions are important because currently the Partners Fund is managed by OF, and delegates/government members do not have access to this information. There are protocols that apply to Phase 1 and also apply to the Partners Fund, I think both the token house and the OF should maintain communication about this to the Partners Fund ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.262500000000001
                },
                {
                    "author_link": "https://gov.optimism.io/u/SEED_LATAM_Joxes",
                    "index": "6",
                    "likes": "9",
                    "time": "07/08/2022-00:00:35",
                    "content": "These changes should be satisfactory for the vast majority of proposals received so far (as a measure), which is a very good sign. First, I would like it to be clarified,     ben-chain:  I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: [Yes/No]   it would be important to know if the KYC implies that there will be applicants who would be restricted from receiving these grants if they are located in certain countries, or if this point is not an issue that a team should worry about. Second,  doing echo of this:     Defi_LATAM_axlvaz:  1- Did the project apply for or receive OP tokens through the Foundation Partners Fund? Yes/No or we have applied and have not received a response yet. 2- If OP tokens were requested from the Foundation Partners Fund, what was the amount?   We have recently seen how projects like Aave have received funds through both fund allocations (partners and governance fund) or like Velodrome, which received funds from the partner fund and they have a draft ongoing to the governance fund.     ben-chain:  Has your project previously applied for an OP grant? If successful, please link to your previous grant proposal and provide a brief update on milestones achieved with the grant. If unsuccessful, and this is a resubmission, please specify how you have incorporated significant changes in accordance with feedback.   In these case, for reasons of transparency, it would be positive to know if a team is in the process of applying (sending the same proposal or another plan) through partner funds. ",
                    "links": [
                        "https://twitter.com/VelodromeFi/status/1545434763951017986"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.669757846320347
                },
                {
                    "author_link": "https://gov.optimism.io/u/Bobbay_StableLab",
                    "index": "7",
                    "likes": "8",
                    "time": "07/08/2022-13:41:48",
                    "content": "These are valuable additions to the current proposal template and will significantly help token holders, especially delegates, make decisions since most of the information will now be presented within the forum. In previous voting cycles, I would deep dive into as many protocols as possible to make informed opinions, but it wasn’t always possible due to time constraints. Here are some further thoughts on this new template structure.   I agree with DeFi_Latam that it’d be helpful to see whether projects have received tokens for transparency reasons. It wouldn’t reduce their chance of getting a grant from the governance fund, but it’s excellent to understand how they would spend the extra $OP.   Should projects clarify why they are asking for x amount? They detail the project and distribution method, but I’d like to understand why they need x amount rather than a higher or lower amount.   It’s important that we don’t burden grantees with an overwhelming application. We should only keep the necessary questions within the template. Right now, it is a good size, but I am wary that if we add much more, it might deter communities from applying.   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.946828533785055
                },
                {
                    "author_link": "https://gov.optimism.io/u/linda",
                    "index": "8",
                    "likes": "8",
                    "time": "08/08/2022-04:47:41",
                    "content": "I’m supportive of the new information requested in this updated template. It will make reviewing proposals a lot smoother. One aspect I would like to better understand expectations on is the “OP received through the Governance Fund should not be sold by the grant recipient” rule. Is there an expected timeline for this request? In some cases, I would imagine teams requesting funding to further build on Optimism might need help in covering non-OP denominated expenses especially if they are building a public good. Is there an expectation that they can’t sell any tokens indefinitely even if means helping them fulfill the goal in the proposal? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0852272727272725
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "9",
                    "likes": "8",
                    "time": "11/08/2022-14:58:41",
                    "content": "Thank you for the valuable feedback on the new proposal template! We’ve added 3 additional fields to reflect your feedback:  Please link to any previous projects the team has meaningfully contributed to: Did the project apply for or receive OP tokens through the Foundation Partner Fund? Yes/No/In Process If OP tokens were requested from the Foundation Partner Fund, what was the amount?  We hope this new template will save you valuable time and improve the delegate experience in Season 2! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.842803030303029
                },
                {
                    "author_link": "https://gov.optimism.io/u/krzkaczor",
                    "index": "10",
                    "likes": "3",
                    "time": "11/08/2022-18:52:50",
                    "content": "Much needed change! I spent a lot of time researching projects requesting funds, this template will make delegates’ lives much easier. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.583333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/rasmuky",
                    "index": "11",
                    "likes": "7",
                    "time": "17/08/2022-04:56:00",
                    "content": "I agree that proposals should include some subjective proposer generated data and analytics, which will be a great improvement vs what was available in cycles 3 and 4. However, I’d also like to see some basic information to enable objective data and analytics professionals / community members to perform analysis for the Optimism community / delegates. Information could include:  All smart contracts relevant to the proposal, at minimum including (i) address, (ii) chain, (iii) description of the smart contract, (iv) if branded / marketed differently than proposal protocol…reason for inclusion (e.g., core team forked protocol, etc.). Even something similar to the Velodrome security page in docs would be a good start. Ideally across all chains so user base performance and brand loyalty could be observed   image1087×1113 145 KB   All relevant organization addresses (e.g., treasury address, DAO operational address, sub DAO addresses, etc.).  This would give analytics professionals a head start and if provided directly by the proposal team should cut down on cycles where contracts are missing, chains are missing, etc. (i.e., enables completeness of the on chain picture / performance). There’s always a balance between zero data supported diligence vs overly restrictive diligence, but there is a lot of $OP up for grabs and I for one would like to execute some data diligence to objectively support or challenge proposer teams in a productive and optimistic way. Additionally:  Would be great to hear feedback from other delegates if there are other key breadcrumbs which would be helpful in this context? If formalized or structured in the future, a call with proposers to ask questions about trends and performance may be more efficient / productive than comments in discourse, but would require coordination. To make sure the proposer is being fairly represented by objective data analyses  Lastly, generally a minor point and may be overly prescriptive, but should probably suggest that teams make a linktr.ee or similar for their proposal as I know there are limits to the number of links to post in Discourse. Could make it easier for delegates to make sure they hit all the relevant key links and nothing is buried in comments. ",
                    "links": [
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/1/1cb31d0b70df9d86f34e38effcc28a6974678842.png"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.91765873015873
                },
                {
                    "author_link": "https://gov.optimism.io/u/arabianhorses",
                    "index": "12",
                    "likes": "2",
                    "time": "24/08/2022-19:01:15",
                    "content": "    ben-chain:  OP received through the Governance Fund should not be sold by the grant recipient.   yep, it makes sense, but some grants are not directly for users, some projects use their allocation to make their projects better, for example, ‘rotki’ has used %100 of their allocation to fund their developers (they sold their allocation directly) these kinda projects are out of scope? or was it just a mistake?  just asking. btw I also support these kinda incentives if It makes OP ecosystem better, if it is worthy, it is okay for me. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.569444444444445
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "13",
                    "likes": "9",
                    "time": "25/08/2022-14:51:46",
                    "content": "    ben-chain:  The expectation is that token grants will not be self-delegated for use in governance   would love to know if this apply to only Phase 1 gov token or Phase 0 as well ? Some context:-     Grant Proposal Template v2 🏛 Governance   Phase 1 Proposal Template v2 Hey folks!  This thread will contain our drafted updates to various Governance-Fund-related language and the proposal template. We look forward to hearing your feedback as we enter the Reflection Period!  This is an update to the “How to Create a Proposal” post.   Key information about Governance Fund grants 5.4% of the total initial token supply (231,928,234 OP) will be distributed to Optimism projects and communities via the Governance Fund.  During Season 2, proj…     We had a discussion on this in past when Perp choose to self-delegate( I want to discuss project boosting their delegate power with governance fund ) but after our feedback they decided to revoke it. Today, I saw that SNX team has done the same by using their phase 0 fund(Dune). My opinion still remains the same, I think team should not use gov fund token to self-delegate One thing I like to see is Foundation not micro-managing us but If we go though my thread on Perp, we are clearly divided here, one side find it against open gov while other doesnt and quite frankly I dont see us making any progress by repeating the same conversation again so I wont create a new thread. My request from foundation would be to update the template to reflect if the rules apply to all grant fund or just Phase 1. Doing so will make the process more clear and put an end to this conversation. ",
                    "links": [
                        "https://gov.optimism.io/t/governance-fund-phase-1-how-to-create-a-proposal/216",
                        "https://gov.optimism.io/t/i-want-to-discuss-project-boosting-their-delegate-power-with-governance-fund/2961",
                        "https://dune.com/optimismfnd/optimism-op-token-house",
                        "https://gov.optimism.io/t/another-case-of-self-delegation-of-op-tokens-received-in-grants/3372"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.300426136363637
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "14",
                    "likes": "0",
                    "time": "25/08/2022-22:19:10",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Defi_LATAM_axlvaz",
                    "index": "15",
                    "likes": "7",
                    "time": "26/08/2022-07:56:37",
                    "content": "I just saw this entry. I was looking in the discord and here in the forum if someone had touched the subject of self-delegation. I have written this thread:     Another case of self-delegation of OP tokens received in grants 💌 Ideas & Feedback       Antecedents  One debate that has been ongoing since the beginning of this governance is the use of tokens allocated in project grants to increase the voting power of their delegates.  The first to speak on this topic was @OPUser  when @tongnk, of Perpetual Protocol, self-delegated the 9M OP tokens he had received in Phase 1.  You can read the full thread here, “I want to discuss the project driving its proxy power with the governance fund.”  For the sake of governance and after intense debate, P…     ",
                    "links": [
                        "https://gov.optimism.io/t/i-want-to-discuss-project-boosting-their-delegate-power-with-governance-fund/2961",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-ooki-protocol/3279/7",
                        "https://gov.optimism.io/t/review-gf-phase-1-proposal-bankless-academy/3353/25",
                        "https://gov.optimism.io/t/draft-gf-phase-1-rook-protocol/2892/6",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-socket/3368/3",
                        "https://gov.optimism.io/t/governance-update-4/3435",
                        "https://gov.optimism.io/t/governance-fund-phase-1-how-to-create-a-proposal/216",
                        "https://gov.optimism.io/t/gf-phase-1-spool-finance-op-incentives/3443/2",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-izumi-finance/3303/20",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-domani-protocol/3410/2",
                        "https://gov.optimism.io/t/ready-gf-phase-1-sushi/3301/10",
                        "https://gov.optimism.io/t/draft-gf-phase-1-kyberswap/3302/15",
                        "https://gov.optimism.io/t/season-1-grant-proposal-template-old/3454/3",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-gpux/2725/4",
                        "https://gov.optimism.io/t/draft-gf-phase-1-open-meta-protocol/2741/11",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-scry-protocol-permissionless-high-scale-oracles/2877/2",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-light-client-proxy-bridge-for-optimism/2940/5",
                        "https://gov.optimism.io/t/draft-gf-phase-1-rebel-creator-community-platform/2861/9",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-nicenode/3038/2",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-frax/3110/6",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-velodrome/2900/47",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-izumi-finance/3303/22"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.791666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "16",
                    "likes": "3",
                    "time": "10/09/2022-05:38:47",
                    "content": "A trivial loophole around the no-selling rule is posting OP as collateral. Should protocols be discouraged from borrowing against their granted OP? I can imagine some strategic uses for this, e.g., temporarily increasing capacity as you wait to ‘spend’ your OP on whatever growth initiatives over some time period, but I’d imagine this would be the kind of thing that would have to be outlined well in advance. ",
                    "links": [
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/7",
                        "https://gov.optimism.io/t/draft-gf-phase-1-nice2win/3423/25"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Netrim",
                    "index": "17",
                    "likes": "5",
                    "time": "10/09/2022-13:59:12",
                    "content": "This is a fine line sure, because a sufficiently malicious interpretation would be post as collateral and then let it be liquidated since then the borrowed assets would be “free” to use. What if a protocol posts the OP as collateral, borrows something and with that something buys more OP to use for delegation. Is this a realistic expectation? The case you outlined I think falls within a non malicious, non governance attack. It’s protecting their granted assets while their plan bears fruit, as long as it’s clearly outlined from the beggining. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.4523809523809526
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "18",
                    "likes": "5",
                    "time": "12/09/2022-20:08:34",
                    "content": "Yeah, that’s a great set of examples spanning the range of possible intentions. A lot of hangups we’ve faced in Season 1 have come from insufficiently defined expectations and somewhat clumsy post-hoc reactions, and frankly we’ve just scratched the surface of possible shenanigans protocols could engage in. Mere self-delegation as an unexpected activity could seem quaint by the end of the coming season. My suggestion is that (until we come up with a better method than issuing a lump sum up front to be used over 3-12 months) we explicitly prohibit any movement of or action with OP except in accordance with what’s outlined in a proposal. There are indeed strategic uses of in-reserve OP, and I think it’s fair not to outright prohibit any use that doesn’t directly translate to Optimism’s growth, so long as the final ‘action’ of the OP does work to grow the eco. But grantees should at min outline their strategies. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.596153846153847
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "19",
                    "likes": "2",
                    "time": "16/09/2022-19:19:14",
                    "content": "Updated to include a field that asks proposers to specify a voting cycle to avoid ambiguity we’re encountering in Voting Cycle 6 about which proposals should be evaluated ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "20",
                    "likes": "4",
                    "time": "21/12/2022-20:16:05",
                    "content": "Updated to reflect changes related to the Grants Council ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Axel_T",
                    "index": "21",
                    "likes": "3",
                    "time": "15/01/2023-03:17:02",
                    "content": "Hi @lavande and @ben-chain Do you have any response to Linda’s and ArabianHorses’ issues? I.e. The blanket no-sale rule: Does it expire after a designated lock up period? Is there any allowance to use grants for the actual project that will be carried out? It just seems odd that this rule has no stated expiry. What’s the incentive or reward for applying to and winning a grant from Season 3? It seems like a paradox: Applicants are meant to incentivise growth, yet all the can do is effectively become an organisational bridge to hand over OP to its users. If these users are already familiar with Optimism then there is no growth, and if they are new to Optimism then why do they want OP (without at least at lot of future work & incurred costs by applicants to make OP appealing). Sorry, I’m happy to be corrected, by anyone here. But what am I missing? Why are organisations applying for Season 3, to become obligated to future work, without a reward or incentive? In particular when this is meant for small scale experiments? Disclosure: I’m strongly considering applying for Season 3 to help get a unique education program up and running in 2023, but after reading this Forum topic I’m confused as to why to volunteer for this ~6 month effort with zero help to meet the running costs of the project, let alone be rewarded for it (beyond the incurred costs). Thanks for any advice or clarification. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.597288676236046
                },
                {
                    "author_link": "https://gov.optimism.io/u/poucheparase",
                    "index": "22",
                    "likes": "0",
                    "time": "15/01/2023-03:39:56",
                    "content": "It is very good post. Thanks. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.7749999999999995
                },
                {
                    "author_link": "https://gov.optimism.io/u/Kree",
                    "index": "23",
                    "likes": "1",
                    "time": "15/01/2023-09:12:30",
                    "content": "Hi, we created a grant proposal just before the end of the last voting cycle but unfortunately too late to finish by the cycle deadline. You can see this here .  Now it seems that we don’t fit in either the Growth Experiments or Builder sub-committee outlines and the Partner fund looks to be intended for existing projects migrating to Optimism. Could anyone suggest what we should do? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "24",
                    "likes": "1",
                    "time": "17/01/2023-13:31:53",
                    "content": "Hi @Axel_T I think the idea is for OP tokens to be distributed to users and let them choose if they want to sell or not. Mainly to achieve decentralization. If you want/need funding there are other channels for it like Partnership Program, Retroactive public good funding, etc. My own opinion is that OP tokens are tough to be a governance token. Even if they have a price, liquidity, and all. Their main use of them is to vote on the token house governance and this is why projects have a lock and no selling policy. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.621031746031746
                },
                {
                    "author_link": "https://gov.optimism.io/u/Axel_T",
                    "index": "25",
                    "likes": "2",
                    "time": "18/01/2023-03:08:58",
                    "content": "Thanks @Gonna.eth I appreciate your direct response. I don’t necessarily agree with your advice, as I don’t think it aligns with the Governance Fund’s goals and purpose, as outlined in the Optimism Docs and the Governance Fund Charter, and thus I don’t think it’s the best advice for the future of Optimism overall, but I still genuinely appreciate the response. It’s always good to get other’s opinions, see how they interpret things, and you are still the only one to date who has responded to ArabianHorses’, Linda’s, and my own queries (all noted above) about this particular issue. So cheers! It’ll all be taken on board. Have a great day! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.458333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "26",
                    "likes": "0",
                    "time": "19/01/2023-15:32:23",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "27",
                    "likes": "2",
                    "time": "20/01/2023-01:03:41",
                    "content": "We’re working on clarifying for everyone and will publish an update to the grant proposal template shortly! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "28",
                    "likes": "2",
                    "time": "20/01/2023-14:19:34",
                    "content": "Updated as outlined below:  Included: Council Reviewer names Incorporated: specification of milestones for milestone-based payments Clarified: there is no expiration to this rule for Growth Experiments Grants Added: “OP received through Builders Grants should not be sold by the grant recipient for a period of one year. After a holding period of one year, Builders Grant recipients have full discretion over how they utilize OP, so long as it coincides with the objectives outlined in their proposal.”  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/Axel_T",
                    "index": "29",
                    "likes": "1",
                    "time": "24/01/2023-12:12:09",
                    "content": "Hi @lavande   What’s the reasoning behind the asymmetrical restrictions on ‘selling OP by grant recipient’? One group of grants is restricted from selling for a year, the other group of grants cannot sell forever. What’s the logic being used for the two different treatments? In particular if all objectives, plans and activities are outlined across both types of Proposals?   Secondly, @Subli_Defi and @Michael were discussing this issue (the idea of being ‘sponsored’ via OP for future work) in the Post, (Request for Grants: Growth Experiments - #14 by FractalVisions. Michael says the operating framework and rules are yet to be set, and to stay tuned. But you have updated the Proposal Template 4 days ago, with apparently finalised policies. I’m confused. Who should Grant Proposers be listening to when structuring our Proposals? Can anyone clarify this?   Thanks to anyone for any input here. I’m considering dedicating the time to structure a Proposal for a Season 3 Grant, but I’m just unable to prepare adequately with the conflicted messaging. So thanks to anyone for some clear & final guidance (even if that guidance is just to wait for now ) Cheers. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.866071428571429
                },
                {
                    "author_link": "https://gov.optimism.io/u/Michael",
                    "index": "30",
                    "likes": "1",
                    "time": "26/01/2023-14:32:21",
                    "content": "Hey @Axel_T, On point #2, I would follow what is said in this post. I hadn’t seen the most recent update when I wrote the message in the other thread. Cheers, Michael ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://gov.optimism.io/u/Axel_T",
                    "index": "31",
                    "likes": "1",
                    "time": "26/01/2023-22:00:00",
                    "content": "Thanks for the insight & advice, @Michael I much appreciate the uniform position. Cheers. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/chaselb",
                    "index": "32",
                    "likes": "0",
                    "time": "28/01/2023-02:09:27",
                    "content": "    ben-chain:    Includes the grant recipient, their affiliates and any other related persons. These persons cannot receive OP for the purpose of selling (or if the grant recipient knows they intend to sell) the tokens.  Includes the direct exchange of OP for crypto or fiat, whether done publicly or privately. Think selling OP in exchange for fiat or crypto, regardless of whether done on a CEX, DEX, OTC desk, at your local park, or otherwise.    Hello! I’m new here and trying to understand the processes and how everything works. I was wondering how this rule is getting enforced? As in, if a recipient breaks this rule, how would we know? And what would the consequence be for that recipient? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.09280303030303
                },
                {
                    "author_link": "https://gov.optimism.io/u/GrantsOps",
                    "index": "33",
                    "likes": "0",
                    "time": "18/02/2023-00:44:35",
                    "content": "Note that this post will be updated. The Cycle 11 grants forms can be found here: Grants Proposal Template - Cycle 11. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "34",
                    "likes": "0",
                    "time": "21/02/2023-12:55:19",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "191"
}