{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/gf-phase-0-proposal-1inch-network/655",
            "title": "[GF: Phase 0 Proposal] 1inch Network ",
            "index": 655,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Governance Fund: Phase 0"
            ],
            "tags": [
                "cycle-1",
                "passed"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/1inch",
                    "index": "1",
                    "likes": "15",
                    "time": "18/05/2022-16:11:47",
                    "content": "Project Name: 1inch NETWORK Author Name: 1inch Labs Defillama TVL (at snapshot): N/A Transactions/day (at snapshot): 275+ Tier: N/A Optimism native: Yes Revisions to metrics used: N/A Number of OP tokens to claim: 300,000 L2 Recipient Address: 0x1bd315E3F029083DA8731a6b1c6F2959A0d15376 Background: 1inch has been part of the Optimism chain since the initial launch of the network and was one of the first dapps deployed. 1inch is best described as a network of decentralized protocols designed to provide the fastest and most efficient operations in the DeFi space. It was launched in tandem with the release of its Aggregation Protocol V1. Since then, 1inch Network has developed additional DeFi tools such as the Liquidity Protocol, Limit Order Protocol, P2P transactions, and 1inch Mobile Wallet. Optimism chain is available natively in our wallet and we will keep on bringing the adoption to it. Since the initial integration with Optimism, 1inch quickly became one of the first top 10 dApps on the chain. Proposal for token distribution (under 1000 words): Goals: 1inch Network plans to accelerate the development of Optimism native features and expand R&D for L2. Benefits:  As a market leader in the growing DEX aggregation field, 1inch Network has the capacity to bootstrap further adoption of Optimism network. Attract more developers and builders to the Optimism ecosystem and help them bring their vision to the market.  How will the OP tokens be distributed? $300,000OP tokens would be used to incentivise usage and growth of Optimism on 1inch Network thought the 1inch Wallet App. With the amount for incentives, the team would:  Launch an AirDrop Campaign for top wallets that are funded in 1inch Wallet App for iOS and Android in Ethereum or Optimism. The 1inch Labs will conduct an airdrop on Optimism network.  How will this distribution incentivize usage and liquidity on Optimism? The Airdrop will attract the users to explore the Optimism ecosystem, while the 1inch Team will constantly improve and support the costs of the infrastructure for 1inch Network on Optimism, including: TokenList API Service, Balances API Service, GasPrice API Service, LimitOrderProtocol API Relayer (Introduction | 1inch Network), TokenPrices API Service build on top of SpotPriceAggregator smart contract (Introduction | 1inch Network). Moreover, the team is working hard on Pathfinder (including algorithm impovements and LiquiditySources integrations) that searches deals across different DEXes, MarketMakers and LimitOrders. Another part of 1inch Network ecosystem on Optimism is Mobile Wallet for Android and iOS that allows users perform instant swaps and token transfers with their 1inch’s non-custodial mobile solution. 1inch Wallet incorporates 1inch Aggregation Protocol API that gives the opportunity to perform swaps for hundreds or even thousands intergrations with Optimism through program code. The team is doing its best to improve the Pathfinder Algorithm response time and add as much Liquidity Sources to 1inch Aggregation Protocol API as possible. Also, the team is trying to keep updated token prices by integrating onchain price oracles to the 1inch Spot Price Aggregator smart contract. Without builders, innovation and product development are impossible. We believe that adoption and growth of usage and liquidity on Optimism starts with building - anything from Smart Contracts to dApps, but first — users need to find out about the ecosystem, therefore we propose such an Airdrop, as part of the initial strategy. How will the incentivized users and liquidity remain after incentives dry up? 1inch Foundation has vast experience with liquidity incentivization; therefore, it has been decided that the most popular user attraction mechanics, such as an Airdrop campaign would be the most efficient. Over what period of time will the tokens be distributed? For over 1 month, the team will be responsible and engaged in the introduction, and search for larger growth opportunities on Optimism. These combined efforts will lead to a greater partnership between Optimism and 1inch Network, and will improve the utility of both ecosystems. ",
                    "links": [
                        "https://docs.1inch.io/docs/spot-price-aggregator/introduction",
                        "https://gov.optimism.io/t/voting-cycle-1-roundup/2619",
                        "https://gov.optimism.io/t/airdrop-1-feedback-thread/80/219",
                        "https://gov.optimism.io/t/op-grants-through-season-2-where-has-the-op-gone/4025/2"
                    ],
                    "GPT-summary": "The post is a proposal by 1inch Network to accelerate the development of Optimism native features and expand R&D for L2. The proposal suggests using $300,000OP tokens to incentivize usage and growth of Optimism on 1inch Network through the 1inch Wallet App. The post explains how the distribution of tokens will incentivize usage and liquidity on Optimism and how the incentivized users and liquidity will remain after incentives dry up. The proposal also highlights the various DeFi tools developed by 1inch Network and its experience with liquidity incentivization.",
                    "GPT-proposal-categories": [
                        "Token economics",
                        "Interoperability and scalability",
                        "Grants, funding and resource allocation",
                        "Community and engagement",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.95528083028083
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "2",
                    "likes": "1",
                    "time": "18/05/2022-16:49:00",
                    "content": "noble idea but isn’t OP Team doing the same, R&D and optimizing the OP ecosystem. second, if you are focusing on development then why not reserve some token for other developer(s) and team, something like a grant , who want to build something either on top of OP or on 1inch ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.9750000000000005
                },
                {
                    "author_link": "https://gov.optimism.io/u/Opuser420",
                    "index": "3",
                    "likes": "0",
                    "time": "19/05/2022-00:45:28",
                    "content": "But aren’t the OP team taking 19% of token supply. Guess is fair given users of OP are the protocols itself. Should give some to 1inch community on OP imo. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/karlyang",
                    "index": "4",
                    "likes": "0",
                    "time": "19/05/2022-06:02:33",
                    "content": "Happy to see participation in GF. Just curious whether 1inch is in eligible for GF Phase 0 as I did not see it in the list . ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "5",
                    "likes": "0",
                    "time": "19/05/2022-06:10:44",
                    "content": "Indeed, they are not on the list, I am also confused. Either they did the submission for Phase1 or we are missing something. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/karlyang",
                    "index": "6",
                    "likes": "0",
                    "time": "19/05/2022-06:25:03",
                    "content": "There’s one inch on the list. I don’t know if they’re one inch. Maybe it’s the same project. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lazeeeerlin",
                    "index": "7",
                    "likes": "0",
                    "time": "19/05/2022-06:49:17",
                    "content": "The prosperity of the ecology will make the underlying protocol go further. To support projects like 1INCH to participate in the construction of OP, they should be given certain rewards, which is also in line with the value of OP sponsoring public services. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.357142857142857
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "8",
                    "likes": "0",
                    "time": "19/05/2022-09:22:43",
                    "content": "    karlyang:  one inch   well paint me surprised, how did I miss that. They are on the list, one inch and 1 inch are same project. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/karlyang",
                    "index": "9",
                    "likes": "0",
                    "time": "19/05/2022-09:48:01",
                    "content": "lol，it’s a mistake.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Defi_LATAM_axlvaz",
                    "index": "10",
                    "likes": "1",
                    "time": "19/05/2022-11:50:12",
                    "content": "Row 25 “Oneinch”. is misspelled. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Piyush",
                    "index": "11",
                    "likes": "1",
                    "time": "27/05/2022-16:15:45",
                    "content": "Great to see 1inch being a part of optimism eco… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/web3magnetic",
                    "index": "12",
                    "likes": "1",
                    "time": "27/05/2022-18:08:12",
                    "content": "Undeniably, builders are what makes any network grow. However unlike most other proposals, 1inch seeks to direct all the distribution towards their team. The Optimism community would like to know what features and Optimism specific products that 1inch could develop, and how the Optimism community can feel confident that 1inch will continue to deliver on their goals towards furthering adoption and usage of the Optimism network. In principle, I support this proposal - however some more transparency and disclosure would be welcome! PS: A minor correction - Optimism native: Yes  - 1inch being a multi-chain aggregator is not Optimism specific. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.347222222222221
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "13",
                    "likes": "0",
                    "time": "27/05/2022-18:21:51",
                    "content": "    web3magnetic:  In principle, I support this proposal - however some more transparency and disclosure would be welcome!   Finally someone actually read the proposal. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://gov.optimism.io/u/Justin",
                    "index": "14",
                    "likes": "0",
                    "time": "29/05/2022-05:33:38",
                    "content": "The commitments are not sufficiently concrete to award tokens to developers.  Can this be conditional on the release of some new functionality? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.71590909090909
                },
                {
                    "author_link": "https://gov.optimism.io/u/mikolay",
                    "index": "15",
                    "likes": "0",
                    "time": "05/06/2022-02:33:39",
                    "content": "In what world is claiming a significant portion of governing power, and openly refusing to give it back to people is acceptable? Why should anyone put their trust to somebody who can make this kind of an offer? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 6.21875
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "16",
                    "likes": "0",
                    "time": "05/06/2022-14:03:58",
                    "content": "you are right, this proposal need improvement. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.428571428571428
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "17",
                    "likes": "0",
                    "time": "13/09/2022-18:28:43",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "632"
}