{
    "poll_list": [
        {
            "id": "0xa9457a5344747a6c272de786419fc7a4e83fcf0f927ef9b1ce767452faa9b453",
            "title": "Title: Special Voting Cycle #9b: Grants Council Elections - Growth Experiments ",
            "discussion": "https://gov.optimism.io/t/grant-council-reviewer-nominations/4372/18",
            "body": "Following the approval of the Grants Council, the Token House will elect 5 Reviewers to the Growth Experiments sub-committee. This Season 3 vote will utilize approval voting. Voting is set up such that you can place a vote for any number of nominees.  Voting for yourself is a violation of the delegate code of conduct. \n\nYou can see the full list of nominations here: https://gov.optimism.io/t/grant-council-reviewer-nominations/4372/18",
            "choices": [
                "GFX Labs ",
                "Bobbay (Stablenode)  ",
                "Joxes (DeFi LATAM)",
                "Matt (Synthetix Ambassadors) ",
                "HC_NATO ",
                "Michael Vander Meiden",
                "MoneyManDoug/Sugma.eth ",
                "Fig (Flipside Crypto) ",
                "Solarcurve ",
                "Katie Garcia "
            ],
            "scores": [
                9821030.990377434,
                5734824.108581537,
                5381927.1399353845,
                8518766.258846764,
                1117104.400633462,
                11642648.117443005,
                7838582.637443187,
                5070419.181323163,
                5340995.537793288,
                9842625.12759914
            ],
            "start": 1673550501,
            "end": 1674068901,
            "snapshot": "65256918",
            "state": "closed",
            "author": "0x47C88bb92B409fF25F6587EA611fac4e55f76007",
            "space": {
                "id": "opcollective.eth",
                "name": "Optimism Collective"
            }
        },
        {
            "id": "0xdcff47b93fb17a11411bda1809e22cba72e5131d31624e4c0f2b9dbee6811f5c",
            "title": "Title: Special Voting Cycle #9b: Grants Council Elections - Builders ",
            "discussion": "https://gov.optimism.io/t/grant-council-reviewer-nominations/4372/4",
            "body": "Following the approval of the Grants Council, the Token House will elect 3 Reviewers to the Builders Grants sub-committee. This Season 3 vote will utilize approval voting. Voting is set up such that you can place a vote for any number of nominees.  Voting for yourself is a violation of the delegate code of conduct. \n\nYou can see the full list of nominations here: https://gov.optimism.io/t/grant-council-reviewer-nominations/4372/4",
            "choices": [
                "Dhannte",
                "Juanbug (Penn Blockchain)  ",
                "Jack Anorak ",
                "Krzysztof Urbański (L2BEAT)",
                "OPUser"
            ],
            "scores": [
                12407169.24481851,
                4216821.323100085,
                9629513.518206565,
                11423813.360834822,
                5524621.1485430375
            ],
            "start": 1673550282,
            "end": 1674068682,
            "snapshot": "65255266",
            "state": "closed",
            "author": "0x47C88bb92B409fF25F6587EA611fac4e55f76007",
            "space": {
                "id": "opcollective.eth",
                "name": "Optimism Collective"
            }
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/grant-council-reviewer-nominations/4372",
            "title": "Grant Council Reviewer Nominations ",
            "index": 4372,
            "category": [
                "\\xf0\\x9f\\x8f\\x9b Governance",
                "Elections"
            ],
            "tags": [
                "nominations",
                "season-3"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/system",
                    "index": "1",
                    "likes": "10",
                    "time": "21/12/2022-18:51:09",
                    "content": " While the code of conduct stipulates that delegates may not vote on their own candidacy in elections, in the case of approval/ranked choice votes, delegates may vote for themselves, so long as they also cast votes for the remaining elected positions.  Example: I can vote for my own candidacy on the Growth Experiments committee, so long as I also cast 4 additional votes (a total of 5 votes, as there are 5 open positions on the sub-committee.)  Please post your self-nominations for the Season 3 Grants Council here, following the template outline here Grants Council Membership Information. ",
                    "links": [
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/24",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/26",
                        "https://gov.optimism.io/t/governance-update-5/4397",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/25"
                    ],
                    "GPT-summary": "The post is an explanation of the process for voting on the Growth Experiments committee and a call for self-nominations for the Season 3 Grants Council. It also provides a template for the Grants Council Membership Information.",
                    "GPT-proposal-categories": [
                        "Community and engagement",
                        "Grants, Funding and resource allocation",
                        "Board composition",
                        "Not a proposal",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.785714285714285
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "2",
                    "likes": "0",
                    "time": "21/12/2022-20:03:40",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "3",
                    "likes": "9",
                    "time": "22/12/2022-09:18:40",
                    "content": " Council Reviewer Self-Nomination Dhannte  Council sub-committee: Builders If you are a delegate, please provide the link to your delegate commitment:  Delegate Commitments - #2 by Dhannte  If you are a delegate, please indicate what % of votable supply is delegated to you: 0.37% If you are a delegate, please indicate your voting participation rate in OP governance to date: 97% I missed: Qi DAO, BarnBridge, and Test 2 votes. Please link to your voting history (and delegate communication thread, if applicable): Voting History: Delegates of Optimism DAO  Dhannte - Delegate Communication Thread - #2 by Dhannte  Please outline any other contributions to the Optimism ecosystem to date: I funded EthernautDAO which brought 10 core developer contributors to different projects in optimism. Synthetix, Aelin, Grateful, Optimism, and Kwenta. Do you have a technical background? If so, please elaborate: I made a career as a game designer and I understand code, graphics, and narrative on the base layer while focusing on project management and creative solutions. Did you serve on a committee in Season 2? If so, please specify which: Yes, DeFi committee C Please demonstrate any experience you believe is relevant to this role: I’ve been working as the founder of EthernautDAO to grow the developer space for the last year and a half, my experience so far:  Developer mentorships coordination: Mentorships - EthernautDAO  Envision and coordinate dev hackable smart contracts for educational purposes:   Staking | Address 0x805f02142680f853a9c0e5d5d6f49aec28c31e8b | Etherscan https://goerli.etherscan.io/address/0xbbcf8b480f974fa45adc09f102496edc38cb3a6c https://goerli.etherscan.io/address/0x4b90946ab87bf6e1ca1f26b2af2897445f48f877 https://goerli.etherscan.io/address/0xc357c220d9ffe0c23282fcc300627f14d9b6314c https://goerli.etherscan.io/address/0xa5343165d51ea577d63e1a550b1f3c872adc58e4#code https://goerli.etherscan.io/address/0x445d0fa7fa12a85b30525568dfd09c3002f2ade5 https://goerli.etherscan.io/address/0xf3cfa05f1ed0f5eb7a8080f1109ad7e424902121 https://goerli.etherscan.io/address/0x00f4b86F1aa30a7434774f6Bc3CEe6435aE78174  https://goerli.etherscan.io/address/0x66408824a99ff61ae2e032e3c7a461ded1a6718e… https://goerli.etherscan.io/address/0x07abfcced19aeb5148c284cd39a9ff2ac835960a… https://goerli.etherscan.io/address/0x012f0c715725683a5405b596f4f55d4ad3046854…  https://goerli.etherscan.io/address/0x66ec6b0f30754123bdf9acf4d8f4e2bdf5d36f4f https://goerli.etherscan.io/address/0x43ff315d0003365fe1246344115a3142b9ebfe0b   Developer community growth: Discord Developer Portal Active Ethernauts (voters) on discord: 81 Past mentors: 15 Future mentors role picked: 201 Mentee’s role picked: 1.100 on-chain developer attestation, EXP soulbound token given by nomination of peers when an educational contribution is done developer bounties for NFT creation, smart contracts and hackable smart contracts Developer partnership searcher, my main job today, looking for new projects who want to expand their developer teams and deploy their contracts in optimism. Last project to be onboarded by governance proposal: Shapeshift (working with the team on the proposal) and Game7 (sponsoring a developer educational game to run in optimism) Sponsoring developer meetups like “Crypto para mortales” https://twitter.com/CryptoPMortales/status/1575962741877379072  Hosting knowledge online talks for developers to hear from peers about their projects, last one: https://twitter.com/EthernautDAO/status/1594488959022895107    Please demonstrate expertise relevant to your Council sub-committee:  Deep understanding of what works to maximize the number of developers’ growth. An active member of big developer communities.  Soft skills:  Adaptability Comunication Decision making Self motivation Empathy Work Ethic  Hard Skills:  Multilingualism Product design Project management Research skills Toknomics, code and narrative at base level  Please describe your philosophy on what makes a good Governance Fund grant:  Clear objective to be accomplished Clear milestones and math distribution of the fund Target onboarding solutions for new users Accurate and simple project communication Active and positive feedback loops on the proposal thread  What types of grant applications would you like to see (or what RFPs would you create?): I created a proposal in the past [Review] [GF: Phase 1 Proposal Cycle 8] EthernautDAO It was approved after 3 voting cycles of feedback. I would like to see:  Tooling proposals, like a new and better hard hat or foundry. Developer educational games like https://ethernaut.openzeppelin.com/ or https://www.damnvulnerabledefi.xyz/  Online hackathons with job interviews at prices On-chain auditing prices Hacker teams to incentivize projects security (Hats Finance, Inmmunefi) GitHub, Twitter, Online developer history integration for developer on-chain attestation and anti sybl attacks systems. All kinds of experiments involving developers to get their hands in the mud and build something Research teams at the protocol level  Please disclose any anticipated conflicts of interest: None, even if there’s an EthernautDAO fork I’ll promote it and consider it a peer. Please verify that you agree to abide by the delegate code of conduct: Yes Please verify that you understand KYC will be required to receive Council rewards at the end of Season 3: Yes Please verify that you are able to commit 12 hours/week to review grant applications and other Council operations: Yes ",
                    "links": [
                        "https://optimism.showkarma.xyz/profile/dhannte.eth#votinghistory",
                        "https://gov.optimism.io/t/dhannte-delegate-communication-thread/3563/2",
                        "https://forum.ethernautdao.io/c/mentorships/6",
                        "https://goerli.etherscan.io/address/0x805f02142680f853a9c0e5d5d6f49aec28c31e8b",
                        "https://t.co/Mxw7lPgJd9",
                        "https://t.co/YGnP17bQoP",
                        "https://t.co/VN1gsbBqTS",
                        "https://t.co/dV0rsLw2FN",
                        "https://t.co/FPsm7uJ26h",
                        "https://t.co/78mIOoVW0F",
                        "https://t.co/FebMP7sU4G",
                        "https://t.co/v5f5Vxu2NY",
                        "https://t.co/C29ENVzgfv",
                        "https://t.co/ATjnYirJA7",
                        "https://t.co/zBZuyz6ZXi",
                        "https://t.co/VRebl7Kvf1",
                        "https://discord.com/developers/servers/857263307732025425/analytics/growth-activation?interval=2&start=2022-10-04&end=2022-11-29",
                        "https://twitter.com/ShapeShift",
                        "https://twitter.com/G7_DAO",
                        "https://twitter.com/CryptoPMortales/status/1575962741877379072",
                        "https://twitter.com/EthernautDAO/status/1594488959022895107",
                        "https://gov.optimism.io/t/review-gf-phase-1-proposal-cycle-8-ethernautdao/3800",
                        "https://ethernaut.openzeppelin.com/",
                        "https://www.damnvulnerabledefi.xyz/",
                        "https://gov.optimism.io/t/delegate-code-of-conduct/3943"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.2699885148864745
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "4",
                    "likes": "5",
                    "time": "22/12/2022-09:25:33",
                    "content": "The original self-nomination is here:  Dhannte Grant Council Reviewer Nomination  @lavande do you prefer the whole template text here or do we post a link to our own self-nomination posts? Maybe it keeps this thread cleaner and all nominations visible. It also allows people to interact with the nominees on their own posts. (I’ll delete the wrong one) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.2749999999999995
                },
                {
                    "author_link": "https://gov.optimism.io/u/GFXlabs",
                    "index": "5",
                    "likes": "11",
                    "time": "27/12/2022-15:10:37",
                    "content": "Council sub-committee: Growth Experiments If you are a delegate, please provide the link to your delegate commitment: Commitment Communications Thread If you are a delegate, please indicate what % of votable supply is delegated to you: 2.39% of total OP votable supply is currently delegated to GFX Labs, from 5,466 addresses. If you are a delegate, please indicate your voting participation rate in OP governance to date: Participation has been complete since the beginning of Optimism governance, though GFX Labs utilizes a multisig that sporadically is unable to vote through Snapshot. Details for which votes these apply to can be found on GFX Labs’ communications thread, and generally have been added to vote counts by hand by the OP team in the event they would be decisive. Please link to your voting history and any voting rationale you’ve shared: Communications Thread Please outline any other contributions to the Optimism ecosystem to date: GFX Labs served on DeFi Committee A along with @Katie, @linda, @Bobbay_StableLab, and @fig (Flipside). Do you have a technical background? If so, please elaborate: GFX Labs includes multiple people with technical talent and experience. The liaison serving on this council is not a person with a technical background, but has deep experience with governance and spending programs in DeFi. They also will have access to GFX technical, legal, and other specialized staff internally. Did you serve on a committee in Season 2? If so, please specify which: DeFi Committee A. Please demonstrate any experience you believe is relevant to this role: GFX Labs has deep experience at Uniswap, Compound, MakerDAO, and Hop. Particularly at MakerDAO, there have been many lessons learned about how to handle, disburse, and monitor large budgets. Please demonstrate expertise relevant to your Council sub-committee: GFX Labs staff have been part of more than 50,000,000 of budgets allocated, approved, and disbursed across multiple protocols. This includes both grants and ongoing budgets. Much of this is around financial or operational improvements to grow revenues, user bases, and use cases – growth. Please describe your philosophy on what makes a good Governance Fund grant: There should be a clear path for a grant to be both useful and measurable in its effects. Soft goals like raising awareness are inappropriate, and programs such a user acquisition need to clearly demonstrate that spending is sourcing new users or assets for Optimism, rather than compete within Optimism for the same users/assets. Additionally, there needs to be tight control by Governance Fund representatives when disbursing funds to grantees. In a traditional organization, there would be a full time position tasked with monitoring incoming reports by grantees. That may not be appropriate or possible for Optimism, but handing over large piles of assets without any grant agreement in place needs to end, even if such an agreement is not enforceable legally. Going forward, most grants should be made on a competitive basis. The Grants Council should identify key areas it would like to see improved, and then solicit competition offers from prospective grantees for a finite grant budget. There should still be room for grantees with novel applications to approach Optimism for funding without such a process, but in general, all grants should be competitive unless they are a continuation of a previous grant that has been deemed successful. GFX Labs prefers to take a lifecycle view of grants, where even at the pre-grant stage there is planning for how the grantee will report on their expenses, their measurable effects, and how the grant will wind down. Overall, the common theme is that much of the tedious or less exciting work of grant allocation and  monitoring has not occurred, and GFX Labs is ready to assist with many of those tasks. What types of grant applications would you like to see or what RFPs would you create? Optimism, like other L1s and L2s, is at its core a new frontier that has been opened for settlement. Within a certain range, technology will not decide which of those L1s and L2s will become useful and which will not. Just like historical frontiers that were opened for settlement, Optimism needs settlers. It is the people and assets finding productive use on Optimism that will determine its ultimate success. This requires bringing in new users and new assets, since it is the activity of this users and assets that create value on Optimism. In general, we would like to see grants that migrate users and assets to Optimism in a way that is targeted and measurable. Governance of Optimism and increasing the usefulness of the OP token are also priorities, but less relevant for this nomination. Please disclose any anticipated conflicts of interest: GFX Labs generally does not hold tokens in its own right, but does have significant delegations on MakerDAO, Hop Protocol, and Uniswap. Please verify that you agree to abide by the delegate code of conduct : Yes Please verify that you understand KYC will be required to receive Council rewards at the end of Season 3: Yes Please verify that you are able to commit 12 hours / week to reviewing grant applications and other Council operations: Yes ",
                    "links": [
                        "https://gov.optimism.io/t/gfx-labs-delegate-communication-thread/2728",
                        "https://gov.optimism.io/t/gfx-labs-delegate-communication-thread/2728",
                        "https://gov.optimism.io/t/delegate-code-of-conduct/3943"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.61720826687932
                },
                {
                    "author_link": "https://gov.optimism.io/u/Bobbay_StableLab",
                    "index": "6",
                    "likes": "9",
                    "time": "28/12/2022-10:00:42",
                    "content": "Council sub-committee: Growth Experiments If you are a delegate, please provide the link to your delegate commitment: StableLab’s Delegate Commitment StableLab’s Communication Thread If you are a delegate, please indicate what % of votable supply is delegated to you: 0.25% If you are a delegate, please indicate your voting participation rate in OP governance to date: 100% Please link to your voting history (and delegate communication thread, if applicable): StableLab Communication Thread Voting History (Filter by Optimism) Please outline any other contributions to the Optimism ecosystem to date: We participated on DeFi Committee A for Season 2. Do you have a technical background? If so, please elaborate: While StableLab is familiar with technical aspects, StableLab does not have a dedicated technical team yet. However, we have worked with numerous leading protocols, including MakerDAO, Balancer, and Element Finance, among others seen below.  1164×500 103 KB  We make up for our lack of a technical team with our extensive experience supporting protocols with growth and governance. Having these roles requires us to have a grasp of the technical elements of a protocol. Did you serve on a committee in Season 2? If so, please specify which: DeFi Committee A - Reviewer Please demonstrate any experience you believe is relevant to this role: Alongside our participation in DeFi committee A, some of our team members have been in the space for many years, contributing to DeFi protocols such as MakerDAO and 1Inch. We have first-hand experience in understanding the needs of a protocol and expanding its reach. With a team of full-time governance analysts, we work in multiple protocols and have the privilege of understanding what works and does not. This gives us a bird’s eye view of the ecosystem as we can identify patterns of successful and unsuccessful programs in attracting and retaining users. During our work in various protocols, we have worked with different service providers and can spot opportunities to insert relevant providers to elevate a protocol or network. For example, we introduced ShowKarma to Optimism. We were a consistent responder to proposals in seasons 1 and 2, both on the forums and in DMs, providing feedback when necessary. We are consistent across all platforms and will continue to act as a line of support for protocols in the Optimism ecosystem. Please demonstrate expertise relevant to your Council sub-committee: We are also the operations lead at Element Finance and have helped build the infrastructure for Element DAO. In doing so, we have worked with external providers to tailor their services for Element Finance, such as reviewing grant proposals and recommending amendments to create a successful proposal. We are also one of the lead domain allocators of the Compound Grants Committee and are working with Questbook to structure the grants program at Compound. Please describe your philosophy on what makes a good Governance Fund grant: We expect a successful grant application to demonstrate some of the following:   Clear milestones  Example: Socket     Granular explanations for the amount of funding requested  Example: Rotki     Effective and efficient distribution of grant funds  Example: Hop Protocol & EthernautDAO     Consistent communication with the community  Example: Alchemix & ShowKarma     Clear value-add to the ecosystem  Example: Agora     Achievable goals within a set timeframe  Example: Superfluid     What types of grant applications would you like to see: We are advocates for innovation. Here are some examples of what grants we would like to see:  DAO tooling  Governance Onboarding   “Mining” experiments  Governance Mining   Educational initiatives  Technical Non-technical   Community  Marketing Education   Developer tooling  Overall, we believe Optimism has already distributed many grants, and the S3 Grants Council should use this information to identify gaps that need to be addressed. For example, multiple bridges and wallets have been given grants. Unless they are exceptional, we should avoid further funding them and focus on other gaps. Please disclose any anticipated conflicts of interest: We are delegates at various protocols, which you can see on our website. We are also investors in certain protocols. Please verify that you agree to abide by the delegate code of conduct: Yes Please verify that you understand KYC will be required to receive Council rewards at the end of Season 3: Yes Please verify that you are able to commit 12 hours/week to review grant applications and other Council operations: Yes ",
                    "links": [
                        "https://gov.optimism.io/t/stablenode-delegate-communication-thread/2973",
                        "https://gov.optimism.io/t/stablenode-delegate-communication-thread/2973",
                        "https://www.notion.so/stablenode/bfaaf09e108247a78dd7f1ab1244221c?v=abc3bcea569c40c8817f8e8c1fa7627c",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/7/7ef45b02c5b71810dfd20252cd8be1906013dd36.png",
                        "https://gov.optimism.io/t/s02-committee-proposal-decentralized-finance-governance-committee-group-a/3286",
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-karma-delegate-dashboard/3411",
                        "https://snapshot.org/#/elfi.eth/proposal/0x25994800c0d7fa05e89d5b027636e9bcc8c27656c994c5e4fa0466b87aaec99f",
                        "https://compound.finance/governance/proposals/136",
                        "https://www.questbook.xyz/",
                        "https://gov.optimism.io/t/review-gf-phase-1-proposal-socket/3647",
                        "https://gov.optimism.io/t/ready-gf-phase-1-rotki/2732",
                        "https://gov.optimism.io/t/gf-phase-0-proposal-hop-protocol/944",
                        "https://gov.optimism.io/t/review-gf-phase-1-proposal-cycle-8-ethernautdao/3800",
                        "https://gov.optimism.io/t/ready-gf-phase-1-cycle-8-proposal-alchemix/3764/1",
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-karma-delegate-dashboard/3411",
                        "https://gov.optimism.io/t/review-gf-phase-1-proposal-agora/3752",
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-superfluid/2314",
                        "https://www.stablenode.xyz/",
                        "https://gov.optimism.io/t/delegate-code-of-conduct/3943"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.008994708994708
                },
                {
                    "author_link": "https://gov.optimism.io/u/SEED_LATAM_Joxes",
                    "index": "7",
                    "likes": "8",
                    "time": "28/12/2022-16:19:09",
                    "content": "Council sub-committee: Growth Experiments If you are a delegate, please provide the link to your delegate commitment: LINK For our nomination, we propose to continue working as we did during previous season for governance committees: a team led by the representative delegate @SEED_LATAM_Joxes together with 4 people as contributors @Netrim, @Defi_Latam_axlvaz, @Jadmat.Eth-DefiLatam and adding @CryptoBlondynka. In case of being selected, we propose to continue working in this way and offer the committee the possibility of providing greater assistance for other tasks to guarantee a better organization in meeting its objectives within the established deadlines during all period. If you are a delegate, please indicate what % of votable supply is delegated to you: 0.46%. Boardroom - Voting history Karma - Voting history If you are a delegate, please indicate your voting participation rate in OP governance to date: 100% participation (excluding tests). Please link to your voting history (and delegate communication thread, if applicable): DeFi LATAM - Delegate Communication Thread  Please outline any other contributions to the Optimism ecosystem to date:  Participation in governance since day 0 Participation in the DeFi C committee  Participation in the Tooling committee   Workshop: Introduction to Optimism (ES) at ETHLATAM Bogotá (previous day to Devcon) Collaborating with Optimism Español in adoption across different activities  Do you have a technical background? If so, please elaborate: Delegate: @SEED_LATAM_Joxes currently studying Metallurgical Engineering, one year remaining. Since 2020 interested in Ethereum scaling solution systems, in the last year helping as a bridge between state of technical development and content for the community, serving as a researcher, educator and writer. The same role for the understanding and monitoring of DeFi ecosystem and Ethereum-related technologies. Contributors: @Netrim, Bachelor degree in International Relations. No technical background, just a passion for tokenomics, crypto technology as a way to achieve financial autonomy and closing the information gap. @Defi_Latam_axlvaz Senior Technician in System Infrastructure. Before entering the crypto world, I worked for several years in Continuous Process Industries in Robotics and Automation of industrial processes. Currently I’m researcher DeFi projects on their structure and long-term sustainability, focused on tokenomics. @Jadmat.Eth-DefiLatam retired Entrepreneur, I have founded and directed commercial, logistics and tourism projects in emerging areas; At the same time, I found my passion for finance, and with it stock market instruments, especially financial options; I’m a part time p2p operator; today dedicated almost entirely to DeFi, half researcher, half degen; I’m interested in growth strategies (design of solutions for DeFi projects, products or mechanisms) for governance of those protocols that are interesting to me. @CryptoBlondynka Graduate in International Relations with a mention in Integration Processes and International Economic Relations. Currently, I work as a Financial Operations Analyst. On the other hand, I started helping with translations and interpretations from/to English/Russian/Spanish. No technical background but Interest in DeFi. I made daily reports for DeFi LATAM, I translated the Synthetix litepaper into Spanish. Currently, I do translations for Optimism Español. Did you serve on a committee in Season 2? If so, please specify which: DeFi C and Tooling committee. Please demonstrate any experience you believe is relevant to this role: @SEED_LATAM_Joxes (Twitter):  I currently work at DeFi LATAM as a researcher of DeFi protocols, infrastructure, MEV, scaling solutions, incidents, etc. You can see my articles here. I’m co-founder of L2 en Español, a community dedicated to the study of Ethereum’s scaling solutions, also known as ‘Layer 2’ and other execution layers. I was previously part of Polygon Advocate program.  @Netrim (Twitter):  Standalone DeFi enthusiast. Researcher by choice in all interesting discussions. I advise and/or support Alpha Venture DAO, Beta Finance, Contango, SpookySwap, Beethoven X and Tarot.  @Jadmat.Eth-DefiLatam (Activity)  Researcher Just a DeFi enthusiast on my own. So far my focus has been on my learning, my fields of interest are: – Derivatives – Tokenomics – Partnerships – Strategy – Growth – Business Development  @Defi_Latam_axlvaz (Twitter)  Currently working as a crypto ecosystem researcher for a VC Web3 Collaborating in the development of the crypto marketplace called CryptoAvisos  Collaborating with DeFi LATAM and L2 en Español communities I previously worked at Defiant Wallet as a Product Researcher and P2P lead Former employee of OKXX exchange as P2P Operation Manager Former employee of an OTC table 100% crypto as Operator  @CryptoBlondynka (Twitter)  Financial Operations Analyst Researcher Collaborated with DeFi LATAM regarding daily reports Optimism translations in Spanish and, in addition, general translations: Russian/Spanish/English.  Please demonstrate expertise relevant to your Council sub-committee: As we write, my team and I have varied knowledge and a deep context of the ecosystem, as well as being involved in different instances. We have expertise, focus, and we work very well as a team in assigning and reviewing responsibilities, where our delegate remains the leader. Our proposal is also to offer a possibility of carrying out additional tasks in case the sub-committee deems it appropriate, such as organization, additional research, communication, etc. Please describe your philosophy on what makes a good Governance Fund grant:  Clear goals KPIs according to the amount requested and the current state of the ecosystem Good value proposition Team behind the project/protocol Sustainability of the project in the long term (tokenomics) Healthy treasury Active, simple and precise communication of the project Be aligned with the Optimism and Ethereum ecosystem And the most important a spectrum of decentralization identifiable and minimally reasonable to the web3 ecosystem that Optimism wants to target.  This can be corroborated in our updates in our communication thread. What types of grant applications would you like to see (or what RFPs would you create?): We would like to see innovative proposals in the DeFi ecosystem, with value proposals that really contribute to the ecosystem and that generate palpable growth of users with a focus on user experience and product, without only short-term incentives and avoiding the possibility of being gameable. In addition, we would like to see shorter deadlines where the requested funds are applied and evaluate results (its effectiveness) in a short period of time. Innovation in identity, privacy protocols and not so financial applications would also be highly valued. Finally, we want the initiatives in education to focus on the state of development of Optimism as defined by the Foundation according to its own progress (what and when to focus on infra and dApp development; and user education on key use cases). Please disclose any anticipated conflicts of interest: None at the moment. In case it comes up in the future we will make it public in the appropiate channels and our governance thread. Please verify that you agree to abide by the delegate code of conduct: Yes Please verify that you understand KYC will be required to receive Council rewards at the end of Season 3: Yes Please verify that you are able to commit 12 hours / week to reviewing grant applications and other Council operations: Yes ",
                    "links": [
                        "https://dune.com/optimismfnd/optimism-op-token-house",
                        "https://boardroom.io/voter/0x94Db037207F6fB697DBd33524aaDffD108819DC8?isDelegate=true",
                        "https://optimism.showkarma.xyz/profile/joxes.eth#votinghistory",
                        "https://gov.optimism.io/t/defi-latam-delegate-communication-thread/2950",
                        "https://gov.optimism.io/t/draft-so2-committee-proposal-defi-group-c/3320",
                        "https://gov.optimism.io/t/draft-s02-committee-proposal-tooling-governance-committee/3333",
                        "https://www.youtube.com/watch?v=0Nf8SKikDWA",
                        "https://twitter.com/OptimismESP",
                        "https://twitter.com/0xJoxes",
                        "https://www.defilatam.com/",
                        "https://twitter.com/thelyingbear",
                        "https://gov.optimism.io/u/jadmat.eth-defilatam/summary",
                        "https://twitter.com/Axlvaz",
                        "https://cryptoavisos.com/",
                        "https://twitter.com/0xBlonde",
                        "https://gov.optimism.io/t/delegate-code-of-conduct/3943",
                        "https://gov.optimism.io/t/defi-latam-delegate-communication-thread/2950/19",
                        "https://gov.optimism.io/t/defi-latam-delegate-communication-thread/2950/20"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.517337164750958
                },
                {
                    "author_link": "https://gov.optimism.io/u/Juanbug",
                    "index": "8",
                    "likes": "8",
                    "time": "30/12/2022-00:29:53",
                    "content": "Council sub-committee: Builder If you are a delegate, please provide the link to your delegate commitment: Penn Blockchain If you are a delegate, please indicate what % of votable supply is delegated to you: 0.52% If you are a delegate, please indicate your voting participation rate in OP governance to date: 99% (86/87 votes) Please link to your voting history and any voting rationale you’ve shared: Delegate Thread, Snapshot History Do you have a technical background? If so, please elaborate: Solidity developer for 2 years, and team of engineers with 50+ years of collective CS experience. Members of the team have been technical grant reviewers for projects like the Near Foundation and the Uniswap Foundation. Did you serve on a committee in Season 2? If so, please specify which: We did not. Please demonstrate any experience you believe is relevant to this role: Penn Blockchain (FranklinDAO) is an active delegate in various defi protocols such as Aave, MakerDAO, dYdX, Uniswap, Centrifuge, etc. Our team ranges from crypto founders to lawyers and developers, many of which have massive passions for the L2 narrative and have been increasingly “optimistic on Optimism.” Please demonstrate expertise relevant to your Council sub-committee: Team members have been in similar grant reviewing positions in the past. We have worked for Near Protocol, Uniswap Foundation, and other web3 related grant teams. We have also received a few governance related grants ourselves and are very familiar with good and bad processes for the grant application process. Please describe your philosophy on what makes a good Governance Fund grant: At its core now, it’s very innovative projects that will bring more users and TVL to Optimism. This could be anywhere from an optimized fork to a new defi primitive. A good request will have multiple milestones, a plan of action (roadmap), concrete deliverables, ambitious goals, and a good developer team to support and build it. No grant request will be perfect, but we’ll try our best to make it as good as possible for Optimism. With years of experience, we’ve gotten good at weeding out the “grant hunters” from those with genuine intentions. What types of grant applications would you like to see or what RFPs would you create? This should incorporate your view on what the Optimism ecosystem needs to prioritize right now: As mentioned prior, we’re looking for new defi primitives or optimized forks. An area that we think needs a lot of exploration and has great potential is RWA, Treasury Management, and Refi. Please disclose any anticipated conflicts of interest: Delegates for different defi protocols as mentioned Please verify that you agree to abide by the delegate code of conduct 1: Yes Please verify that you understand KYC will be required to receive Council rewards at the end of Season 3: Yes Please verify that you are able to commit 12 hours / week to reviewing grant applications and other Council operations: Yes ",
                    "links": [
                        "https://app.flipsidecrypto.com/velocity/queries/499118ae-d783-449e-af5d-653a5e644f87",
                        "https://gov.optimism.io/t/franklindao-penn-blockchain-delegate-communication-thread/4024",
                        "https://snapshot.org/#/profile/0x070341aA5Ed571f0FB2c4a5641409B1A46b4961b",
                        "https://gov.optimism.io/t/delegate-code-of-conduct/3943"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.229178691678692
                },
                {
                    "author_link": "https://gov.optimism.io/u/MattL",
                    "index": "9",
                    "likes": "6",
                    "time": "03/01/2023-15:47:40",
                    "content": "Council sub-committee: Growth Experiments If you are a delegate, please provide the link to your delegate commitment: Commitment If you are a delegate, please indicate what % of votable supply is delegated to you: 15.02% is delegated to the SNXAmbassadors, of which I am an elected member of. If you are a delegate, please indicate your voting participation rate in OP governance to date: The original SNXAmbassador wallet faced multisig issues from the start, and the new OPSNXAmbassador wallet was created after a few rounds of voting. In my opinion, it wouldn’t be helpful to judge participation based on this. Please link to your voting history and any voting rationale you’ve shared: OPSNXAmbassador Snapshot + SNXAmbassador Snapshot + Voting Rational for Shadow Committee Please outline any other contributions to the Optimism ecosystem to date: Discussed later on. Do you have a technical background? If so, please elaborate: Although I do not have direct technical experience, I rely on the expertise of some members of the SNXAmbassadors who have solidity and other development experience. I also enjoy explaining technical matters. Did you serve on a committee in Season 2? If so, please specify which: Shadow Committee Please demonstrate any experience you believe is relevant to this role:  I am currently a Core Contributor for Synthetix, where I primarily focus on Communications, Marketing, and Partnerships. I have had the opportunity to take on various projects and initiatives, such as supporting SNX’s international presence (SNX Country Leads) and community marketing (SNX 300), and helping new protocols build on top of Synthetix as part of partnership efforts. I was also recently re-elected as one of the five SNX Ambassadors. The SNX Ambassadors are an elected council that represents Synthetix through governance across the ecosystem and works on partnerships/business development alongside CCs and other councils. I have collaborated with many protocols across Optimism to support their growth, a prime example being Synthetix Spartan Spaces on Twitter, which I host as an SNX Ambassador. This platform promotes great protocols across both Optimism and ETH mainnet and helps them explain their protocols to users. These efforts have led to many successful partnerships and integrations for Synthetix and other ecosystem partners. I have the ability to concisely communicate complex technical topics in a way that is easily understood by end users. Extensive knowledge of the DeFi landscape and what it takes to support a protocol in various aspects. I have been a DeFi user since the early days of the space. Before the days of complex gov tokens and during the great times of yearn and curve being used together being the most interesting use-case  Please demonstrate expertise relevant to your Council sub-committee: I have a pulse on the Optimism ecosystem and have worked extensively with protocols onboarding to Optimism, helping them navigate the process of growth on Optimism. I have firsthand experience of onboarding new users into the ecosystem and supporting them with a great product and ongoing incentives to keep them engaged in the long term. Based on this experience, I believe I am a strong candidate to serve on the Optimism Growth Experiments Committee, with the goal of driving growth for Optimism in the long term. Please describe your philosophy on what makes a good Governance Fund grant:  Great product / usecase for the protocol within Optimism and the greater DeFi ecosystem A clear path to non-incentivized growth - Overtime Markets fit this with it’s Gov Fund Grant Clear KPI’s Milestones to release grants Quality team (on all facets - devs, community, marketing, etc) Healthy Treasury Potential contingency plan / alternate path to distributing governance fund grant Path to protocol decentralization / Governance structure  Yet again, I will echo what Juan said – there’s no way that a grant proposal will be perfect or fit in perfectly with what’s required/wanted on Optimism. But there should always be a great attempt to bring in protocols that fit within the needs of Optimism users, and also help bring protocols to a yes grant request if it’s close! What types of grant applications would you like to see or what RFPs would you create? There’s three big types of grant applications I would like to see  Innovative protocols that fit well into Optimism - While this is a wide net, I think the simplicity of it can’t be denied. There must be an all-out push for protocols to build innovative protocols both on Optimism, and on Optimism protocols. There is a great opportunity to incentivize money legos to be built and supported for the long term, which will help to incentivize continued growth from users and development across Optimism. Furthermore, these protocols should be incentivized to support builders and education to bring users onto Optimism. Protocol ecosystems are great for Optimism, and should be uniquely supported. Onboarding and Education - The next group of DeFi users should be brought to Optimism directly from CEXs and educated on why it’s important to continue building on top of Ethereum through L2s, and how all their DeFi/crypto needs can be supported on Optimism. These educational needs can be fulfilled through working with YouTubers/guide writers to ensure that there is ample content across onboarding to Optimism and using some of the projects on Optimism. Again, there is a need for a long-term partnership between the Optimism Foundation, Optimism Governance, and protocols on Optimism to ensure that onboarding is as easy as possible. Research Content (with distribution ability) - Research-level content should be incentivized in various ways, though this will require a deep partnership with the Optimism foundation to ensure that it is done correctly.  Yet again, I will echo what Juan said – there’s no way that a grant proposal will be perfect or fit in perfectly with what’s required/wanted on Optimism. But there should always be a great attempt to bring in protocols that fit within the needs of Optimism users, and also help bring protocols to a yes. Please disclose any anticipated conflicts of interest: I am an elected member of the SNX Ambassadors and a Core Contributor at Synthetix. Please verify that you agree to abide by the delegate code of conduct 1: Yes Please verify that you understand KYC will be required to receive Council rewards at the end of Season 3: Yes. Please verify that you are able to commit 12 hours / week to reviewing grant applications and other Council operations: Yes ",
                    "links": [
                        "https://snapshot.org/#/profile/0x406b607644c5d7bfda95963201e45a4c6ab1c159",
                        "https://snapshot.org/#/profile/0x46abFE1C972fCa43766d6aD70E1c1Df72F4Bb4d1",
                        "https://gov.optimism.io/t/defi-shadow-committee-season-2-recommendations/3549/13",
                        "https://gov.optimism.io/t/defi-shadow-committee-season-2-recommendations/3549/13",
                        "https://gov.optimism.io/t/delegate-code-of-conduct/3943"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.407131661442006
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "10",
                    "likes": "12",
                    "time": "03/01/2023-22:00:38",
                    "content": "Council sub-committee: Builders If you are a delegate, please provide the link to your delegate commitment: https://gov.optimism.io/t/delegate-commitments/235/136 If you are a delegate, please indicate what % of votable supply is delegated to you: 0.83% If you are a delegate, please indicate your voting participation rate in OP governance to date: 79% (100% since posting a delegate commitment) https://optimism.showkarma.xyz/profile/jackanorak.eth Please link to your voting history and any voting rationale you’ve shared: (You may link to your Snapshot profile for voting history. You may link to your delegate communication thread, or any other medium you use to communicate with your delegators, to share your voting rationale.) Active delegates of Optimism Please outline any other contributions to the Optimism ecosystem to date:  Integral contributor to Velodrome’s design and launch, with coordination of OP Labs High level of contributions to OP governance as delegate and commenter Aided in the onboarding of some 30-odd protocols to Optimism, made introductions, advised on optimal product and liquidity strategy Advised several OP protocols as they applied for governance grants Published Optimism’s first review of passed grants, which led to a shift away from liquidity mining as a preferred grant target and was directly responsible for making builder grants in scope for Governance. Leading most comprehensive retrospective of OP grants to date, which has already surfaced major insights and revelations of protocols’ handling of OP Was voice influencing major changes in direction of grants, including the implementation of the Grants Council itself  Do you have a technical background? If so, please elaborate: I’m technical right up to the point of the actual software engineering of protocols. Conversant in code and design. Deeply involved in quantitative protocol construction and am credibly ‘technical’ in defi. Regularly code to extract insights and perform actions onchain. Without going into specifics, my professional background is quantitative in nature. Did you serve on a committee in Season 2? If so, please specify which: I was on the shadow committee, which was an unofficial committee that I believe made valuable contributions. Please demonstrate expertise relevant to this role and your Council sub-committee: I am a builder and have gone through the process of going from zero to a major ecosystem player, building something while facing a threadbare budget, maximum skepticism, and vocal detractors. My team has gotten an OP Labs Grant and an OP governance grant and I believe raised the bar on applying for and reporting on grants of this nature. As a delegate, I’ve voted on grants, and as a member of the Shadow Committee, I’ve helped to push people’s thinking on what grants ought to be used for. As an individual, I’ve proposed ecosystem-wide initiatives rethinking how Optimism manages its resources, and I’ve staked much of my career in crypto on making Optimism succeed. In short, I’ve experienced virtually all tasks and perspectives that could go into the construction of grants, and there’s little in the way of subject matter that I haven’t personally worked with, from crosschain messaging to staking to security to NFTs. I chose to apply for builder grants instead of growth experiments for three reasons.  I already have a track record of independent voting and have advised my delegators that I would always vote and argue against Velodrome’s immediate interest if it was in conflict with what I thought was best for Optimism. That said, it seems that perceived conflicts of interests are less pronounced in this group; more growth experiments are likely to touch velodrome than builder grants. This vertical also plays well into my day job, which has me doing a lot of outreach to builders. In this capacity, hopefully it’s not a stretch to say I’ve likely spoken with more active and prospective builders on Optimism than anyone outside of the OP Foundation. In this way I can help guide builders to the program and get the initiatives we’re looking for. I think builder grants at this stage are more critical for the long-term viability of the Optimism project; there’s a lot of exciting stuff that OP is going to roll out that the builder community needs to be prepared to exploit.  Please describe your philosophy on what makes a good Governance Fund grant: I believe in a structured approach, where the council articulates where OP is and where it wants it to go. It should outline what sorts of people, teams, and activities are needed to get to this desired future, and it should shape and approve grants that get Optimism those people, teams, and activities. Grants should be designed with justifiable, measurable, and achievable objectives, and they should be reviewable periodically so that the Grants Council can guide them and retain the ability to withhold future grants. They should be scaled appropriately to the objectives (and the objectives’ value to the ecosystem), not to the projects’ size or perceived importance. Although there is room to take a slight shotgun approach, grants should go to the projects that are most promising in their domains. This requires the Grants Council to have an informed opinion about the likely winning teams in each space. Just like the best tools are multifunction tools, the best grants will have second-order benefits affecting the largest number of builders. That is, you fund the project that makes other projects more achievable. This is how you accelerate ecosystems. In the course of a grants program, major things might change. This is crypto. So the grants council should also allow for some opportunism in approving grants. What types of grant applications would you like to see or what RFPs would you create? Although I keep hearing about Optimism needing things like its own GMX, I think we want to skate to where the puck is going, and I think that’s OP Stack and other forms of infrastructural/middleware advancements that publicly increase design space for enterprising builders. We want these fundamental advancements early, which will then through lower costs, better performance, more decentralization, etc, facilitate the building of those apps we want to see. We do want those apps too, things like RWA, gaming, privacy, and so on, but in my mind this all flows downstream of builders knowing that Optimism and not some other ecosystem is inevitable. That is, we want to fund the things that let builders know that we can offer the best ecosystem to work in, the best tools to work with, and the best funding to derisk experimentation. Please disclose any anticipated conflicts of interest: If I am elected, I will review grants that could have a material impact on Velodrome. This is not new; the majority of grants proposed to date have involved Velodrome. That’s unavoidable. We’re an exchange. However, I’ve consistently voted in Optimism’s interest, even when doing so would be against Velodrome’s immediate interests. I do so because I want Optimism to win, and in any case I see Optimism’s success as more necessary for Velodrome’s success than any individual grant. Please verify that you agree to abide by the delegate code of conduct 1: Yes Please verify that you understand KYC will be required to receive Council rewards at the end of Season 3: Yes Please verify that you are able to commit 12 hours / week to reviewing grant applications and other Council operations: Yes ",
                    "links": [
                        "https://optimism.showkarma.xyz/profile/jackanorak.eth",
                        "https://optimism.showkarma.xyz/profile/jackanorak.eth#votinghistory",
                        "https://gov.optimism.io/t/delegate-code-of-conduct/3943"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.089179597458818
                },
                {
                    "author_link": "https://gov.optimism.io/u/HCNAT0_NEU_Blockhain",
                    "index": "11",
                    "likes": "1",
                    "time": "04/01/2023-01:50:48",
                    "content": "Hi all, formally introducing myself here as Cooper, one of the Co-Directors of Governance at NEU Blockchain, submitting our Grant Council Review Self-Nomination on behalf of the team. Please let me know if you have any questions, just keeping this short to focus on the Nomination Application. Council sub-committee: Growth Experiments If you are a delegate, please provide the link to your delegate commitment: Currently in process of receiving delegation If you are a delegate, please indicate what % of votable supply is delegated to you: (voting power can be referenced here:  N/A If you are a delegate, please indicate your voting participation rate in OP governance to date: (You may link to your profile on Karma 1, if applicable. If not, you can divide the number of Optimism votes under your Snapshot profile by 87, which is the number of Token House votes through Season 2. N/A Please link to your voting history and any voting rationale you’ve shared: (You may link to your Snapshot profile for voting history. You may link to your delegate communication thread, or any other medium you use to communicate with your delegators, to share your voting rationale.) NEU Blockchain | Metavote Tracker - We continue to build out our voting and summary descriptions of votes from the TribeDAO and now internal discussion with the governance team about Optimism Season 2 Cycle 8 Grants Funding. NEU Blockchain Twitter - We have previously tweeted our thoughts on TribeDAO votes during the unwinding and liquidation process. If accepted into the Grants Council Review, we will be happy to open our discussion and thought process more from the members of the NEU Blockchain governance team. We may record audio or create consistent notes for the non-Grants Council Review delegates to read specific to Grant Funding reviews. Please outline any other contributions to the Optimism ecosystem to date:  Suggested solutions on transitioning to a Grants Council platform while maintaining delegate involvement. Provided solution suggestions on how to separate information pertaining to relevant forum topics and discussions on protocol activity on Optimism. Provided feedback and thoughts on governance community calls Provided feedback and suggestions on EthernautDAO’s grant funding proposal in Season 2 Cycle 8 related to payment of educator incentives  Do you have a technical background? If so, please elaborate: We have team members currently dual majoring in Business Administration and Computer Science and Business Administration and Data Science. Other Co-Director is currently familiarizing with writing SQL queries. Overall technical background of the team is general with an understanding of Etherscan, Dune Analytics, and Flipside Crypto. Did you serve on a committee in Season 2? If so, please specify which: N/A Please demonstrate any experience you believe is relevant to this role:  We have previously worked on winding down the TribeDAO and Fei Protocol, voting on providing funds back to stablecoin users and governance members. Understanding of a variety of DeFi protocols from various members, tokenomics, and incentivization strategies for user rewards Able to break down tokenization and protocols on a less-complex level via previous presentations, discussions, and co-op experiences.  Please demonstrate expertise relevant to your Council sub-committee:  Team members understand requirements for a good funding request with previous experiences in funding-case competitions. We have a strong understanding of general protocols and are able to quickly learn about new protocols.  Please describe your philosophy on what makes a good Governance Fund grant:  Fund Requesters are easy to contact Clear KPIs in relation to requested fund usage Projections and explanations on how funds will be effective Understanding of core customers and customer base Diversified division of roles and power over parts of the protocol Benefits the growth of Optimism Network beyond rewards (Why will people stay?)  A Good Governance Fund grant is one that is precise yet flexible. Not everything goes as planned, economic conditions change, users find other interests, liabilities are exposed. However, the projections and expectations of the funding should be clear to help best assess the effectiveness of funding. When we see consistent discussion and passion behind the protocol, it helps us gain confidence in what is being built and how close the goals of the funding can be met through challenges. What types of grant applications would you like to see or what RFPs would you create? This should incorporate your view on what the Optimism ecosystem needs to prioritize right now We would like to see grant applications that aim to further build the DeFi ecosystem. As crypto users have experienced CEX liability, asset management protocols is a place we’d be excited to explore further, incurring less fees via Optimism’s Optimistic Rollup and attracting users who don’t want to focus on active management. We’d also like to see further investment in informational reporting and developing relations within the Optimism Network. There should be a push to not only follow our current grants, but also to work on reporting it beyond the network, attracting new users based on our presented growth. Expanding the community via informative reports and celebrating the success of the grant funding outside the current Optimism Collective. Please disclose any anticipated conflicts of interest: NEU Blockchain Governance is currently solely focused on the Optimism Collective. We have no current conflicts of interest but will continue to be searching for delegation for other protocols during our work with Optimism. Please verify that you agree to abide by the delegate code of conduct: Yes Please verify that you understand KYC will be required to receive Council rewards at the end of Season 3: Yes Please verify that you are able to commit 12 hours / week to reviewing grant applications and other Council operations: Yes ",
                    "links": [
                        "https://optimism.showkarma.xyz/",
                        "https://docs.google.com/spreadsheets/d/1wau04JWuJxX9O9sidqipvIlYKxvqVZl0KqqvGORuEVI/edit?usp=sharing",
                        "https://twitter.com/NEU_Blockchain",
                        "https://gov.optimism.io/t/delegate-code-of-conduct/3943"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.510809984768318
                },
                {
                    "author_link": "https://gov.optimism.io/u/Michael",
                    "index": "12",
                    "likes": "4",
                    "time": "04/01/2023-17:52:53",
                    "content": "Hey everyone! The best way to get to know me without reading a wall of text is this 2-minute video I made for the grants council nomination: Michael | Grants Council Nomination Background - YouTube. Council sub-committee: Growth Experiments If you are a delegate, please provide the link to your delegate commitment: Delegate Commitments - #21 by Michael If you are a delegate, please indicate what % of votable supply is delegated to you: 0.23% If you are a delegate, please indicate your voting participation rate in OP governance to date: 79% (100% participation since July 7, 2022) Please link to your voting history and any voting rationale you’ve shared: Voting History via Boardroom Videos explaining rational in various rounds.  Optimism Governance | Voting Round 3 Overview - YouTube Optimism Governance | Voting Round 4 Overview - YouTube  Please outline any other contributions to the Optimism ecosystem to date:  Contributor to Optimism codebase (link to pull request) Multiple educational videos about Optimism, L2-related EIPs, and Optimism Protocol Tutorials.  Hosted majority of community governance calls to date. This involved creating an agenda, sourcing agenda topics from the community, running the actual calls, and creating recap posts for the calls.  Do you have a technical background? If so, please elaborate:  Yes, I worked as a machine learning engineer and have been coding smart contracts for 2.5 years. I’ve placed in multiple web3 hackathons, including 1st out of 27+ teams. Code contributor to Optimsm (link to pull request) Master of Science in Robotics from Carnegie Mellon University, focus on machine learning & incentive systems.  Did you serve on a committee in Season 2? If so, please specify which: Yes, I served on the NFT committee with @jrocki.eth, @OPUser, @Butterbum, and @FractalVisions. Please demonstrate any experience you believe is relevant to this role:  Consumer facing product manager at high-growth tech startup, learned how to understand and capture users Crypto educator. 300k+ views on YouTube, ability to communicate complex topics to a youtube audience Technical ability: contributor to Optimism codebase, machine learning engineer, smart contract dev  Please demonstrate expertise relevant to your Council sub-committee: In the process of making educational content for youtube, I’ve done smart-contract-level deep dives into the incentive systems and liquidity programs of tens of crypto protocols. This base of research has given me a wealth of knowledge of the different incentives being used across the Ethereum ecosystem. When evaluating grants, this knowledge allows me to detect grant requests that are made to As a product manager focused on growth, I learned to think systematically about the process of transforming a potential user into a super-user. The combination of my technical background with my background in user incentives & behaviour is what will make me a valuable contributor to growth experiments sub-committee. Please describe your philosophy on what makes a good Governance Fund grant: Guiding Principle: Grants should use funds efficiently to drive us closer to the Optimistic Vision.  Specific things I’d like to see with grant proposals: Clear milestones with milestone unlocks. Definition of what “success” of grant use would be, with trackable metrics. Accomplishes something that would be difficult to accomplish without the grant (bootstrapping liquidity, competitions, meetups, education) Solid logic for why grant is needed and how it will to more sticky users making Optimism their L2 home.  What types of grant applications would you like to see or what RFPs would you create? Guiding principle: Bias towards experimentation Given the data we’ve received on past grants, we know that funding massive liquidity incentive programs doesn’t always yield the best results. As it stands right now, we don’t currently know which type of grants are best for Optimism’s growth. Because of this, our bias should be towards trying out new types of grant proposals and then being rigorous on judging how successful they were. As far as specific grant types, I’ve already created a detailed thread here on why I believe competitions would be a great use of the grant funds. Some specific examples of grants that I’d like to see:  Education competitions to improve usability (tutorials, how L2s work, about Optimism) Social media competitions to increase awareness Sponsoring real-world events (optimism/crypto meetups)  It’s important to note that the size of these experimental grants will likely be much smaller than previous grants. As far as the traditional liquidity incentive grants that we saw so much of last year, I am still open to funding them given that they have strong logic behind why this grant will be effective vs some of the grants we saw last season. Please disclose any anticipated conflicts of interest: None Please verify that you agree to abide by the delegate code of conduct : Yes Please verify that you understand KYC will be required to receive Council rewards at the end of Season 3: Yes Please verify that you are able to commit 12 hours / week to reviewing grant applications and other Council operations: Yes ",
                    "links": [
                        "https://gov.optimism.io/t/delegate-commitments/235/21",
                        "https://boardroom.io/voter/0x6EdA5aCafF7F5964E1EcC3FD61C62570C186cA0C?isDelegate=true",
                        "https://youtu.be/-xo7ZVbjZ6k",
                        "https://youtu.be/s1krQiVCdL0",
                        "https://github.com/ethereum-optimism/optimism/pull/2389",
                        "https://youtu.be/i7II_mMqI7M",
                        "https://youtu.be/Hl7ANnenRUQ",
                        "https://www.youtube.com/playlist?list=PLkNS7G9A9BfavIYKlTA59sSkPyPR_R8vJ",
                        "https://github.com/ethereum-optimism/optimism/pull/2389",
                        "https://gov.optimism.io/t/are-competitions-better/4318",
                        "https://gov.optimism.io/t/delegate-code-of-conduct/3943"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.6983318405732195
                },
                {
                    "author_link": "https://gov.optimism.io/u/MoneyManDoug",
                    "index": "13",
                    "likes": "2",
                    "time": "06/01/2023-03:49:11",
                    "content": "Council sub-committee: Growth Experiments If you are a delegate, please provide the link to your delegate commitment: Commitment Communications Thread If you are a delegate, please indicate what % of votable supply is delegated to you: 0.65% If you are a delegate, please indicate your voting participation rate in OP governance to date: As a delegate i’ve voted on 99% of proposals to date having missed only a single proposal “the NFT committee proposal” Please link to your voting history and any voting rationale you’ve shared: Communications Thread Please outline any other contributions to the Optimism ecosystem to date: In the past i have reviewed products in development by optimism and provided feedback, as well as having participated in the Shadow committee Do you have a technical background? If so, please elaborate: I spent two years with a space technology company and also have basic coding/solidity skills. Did you serve on a committee in Season 2? If so, please specify which: Shadow committee. Please demonstrate any experience you believe is relevant to this role: Since my early days of involvement in this space i have always looked for ways to contribute/voice my opinion and help projects grow, i have contributed to Wing.Finance, Synthetix , Deus, Risk harbor and Ontology all of which experienced major growth cycles over time. One of the most valuable things you can obtain in this space is heritage and i believe thats something Optimism has been building for some time. with my expertise i think we can grow and navigate our path in an efficient and safe manner. Please demonstrate expertise relevant to your Council sub-committee: I have spent years watching failed/successful experiments throughout different sectors in the space and understand what has a history of working or failing, there is also a risk taking aspect here and in the past i have been more than willing to think outside of the box while being creative and rational. Please describe your philosophy on what makes a good Governance Fund grant: Realistically a good grant returns value in the form of users/engagement and capital inflow, team/culture is also a major factor and our grantees should be held to highest level of standards and ethical practices. What types of grant applications would you like to see or what RFPs would you create? i would like to see grant applications from educational institutions or large/local businesses as physical integrations increase awareness and grow users from the bottom up. in my opinion it is ideal to formulate growth strategies using unique means, we can achieve that user snowball effect with the right grants and good guidance Please disclose any anticipated conflicts of interest: Please verify that you agree to abide by the delegate code of conduct : Yes Please verify that you understand KYC will be required to receive Council rewards at the end of Season 3: Yes Please verify that you are able to commit 12 hours / week to reviewing grant applications and other Council operations: Yes ",
                    "links": [
                        "https://gov.optimism.io/t/doug-sugma-eth-delegate-communication-thread/4452",
                        "https://gov.optimism.io/t/doug-sugma-eth-delegate-communication-thread/4452",
                        "https://gov.optimism.io/t/delegate-code-of-conduct/3943"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.20063025210084
                },
                {
                    "author_link": "https://gov.optimism.io/u/fig",
                    "index": "14",
                    "likes": "6",
                    "time": "06/01/2023-15:34:09",
                    "content": "Ok - we’ll bite, here we go:  Council sub-committee: Growth Experiments If you are a delegate, please provide the link to your delegate commitment: Delegate Commitments - #69 by Flipside Crypto If you are a delegate, please indicate what % of votable supply is delegated to you: 1.14% If you are a delegate, please indicate your voting participation rate in OP governance to date: 74.71% - due to administrative errors for Voting Period #2, disclosed here. Please link to your voting history and any voting rationale you’ve shared: Our voting histories are outlined in a Weekly Governance Round-Up, which we publish EOW. Here we discuss current events, key proposals, and convey our votes / rationales. You can see some here:    Medium – 11 Nov 22    Flipside Governance Recap | 11 November 2022 Welcome to the Flipside Governance Team Recap! Here’s a weekly summary of heady governance activity, hard-hitting research & data analysis…  Reading time: 4 min read       Or the most recent one, here. Please outline any other contributions to the Optimism ecosystem to date: We’ve made this killer app - hoping to better inform users, token holders, and delegates.    op-governance.vercel.app   Optimism Governance Data | Flipside Crypto Optimism Governance Data Powered by Flipside Crypto      Plus, our OP data was used to calculate participation in Retroactive Delegate Rewards for Season 1 & 2 And lastly, The Optimist Score where OP users can attest their reputations score on-chain! Give it a go here: https://science.flipsidecrypto.xyz/optimist/ Do you have a technical background? If so, please elaborate: Fundamental & technical. Did you serve on a committee in Season 2? If so, please specify which: Yes, DeFi Committee A Please demonstrate any experience you believe is relevant to this role: A few other relevant roles: Reviewer @ Aave Grants DAO (~1-year tenure), reviewing a myriad of grants and projects Grant Committee @ Marinade, a $500,000 program helping futher secure SOL & mSOL Scout @ SteelDAO (fka BessemerDAO), identifying early-stage projects and public goods Please demonstrate expertise relevant to your Council sub-committee: Flipside Crypto participates alongside and develops it’s own growth experiments daily. It is embedded in our values. We use data to judge the efficacy of Web3 projects’ growth. We are builders, marketers, analysts, delegates, and operators, studying case studies of successful DAOs, L1 & L2s, while simultaneously building our own. From 5+ years working in crypto full-time, our team remains focused on decision-making and growing the efficiency of DAOs - while onboarding more users. Some personal experiences: Marketing Intern @ Voyager Digital DeFi Research / Junior Trader @ Proxima Capital Governance Contributor @ Flipside Crypto Lead Governance Contributor @ Flipside Crypto You can read our Tweets here and our musings on Governance & crypto here. Please describe your philosophy on what makes a good Governance Fund grant: ROI. How does this benefit Optimism first? And the crypto ecosystem second? Where can we get the highest return on a dollar. What types of grant applications would you like to see or what RFPs would you create? I would focus on sectors previously ignored in the past cycles; bridging solutions to attract more users, marketing and education to empower users, and DeFi / Gaming integrations to retain users. Please disclose any anticipated conflicts of interest: Flipside Crypto + any Ethereum delegations (Aave, MakerDAO, Hop, SushiSwap) Please verify that you agree to abide by the delegate code of conduct : Yes Please verify that you understand KYC will be required to receive Council rewards at the end of Season 3: Yes Please verify that you are able to commit 12 hours / week to reviewing grant applications and other Council operations: Yes ",
                    "links": [
                        "https://gov.optimism.io/t/s02-committee-proposal-decentralized-finance-governance-committee-group-a/3286",
                        "https://medium.com/flipside-governance/flipside-governance-recap-11-november-2022-b60417870c77",
                        "https://medium.com/flipside-governance/flipside-governance-recap-11-november-2022-b60417870c77",
                        "https://medium.com/flipside-governance/flipside-governance-year-in-review-2022-weekly-recap-7d41835326ea",
                        "https://op-governance.vercel.app/",
                        "https://op-governance.vercel.app/",
                        "https://gov.optimism.io/t/retroactive-delegate-rewards-for-season-1-2/3947",
                        "https://science.flipsidecrypto.xyz/optimist/",
                        "https://aavegrants.org/",
                        "https://marinade.finance/",
                        "https://www.bvp.com/news/building-the-web3-ecosystem-of-the-future",
                        "https://twitter.com/flipsidegov",
                        "https://medium.com/flipside-governance",
                        "https://gov.optimism.io/t/delegate-code-of-conduct/3943"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.126190476190477
                },
                {
                    "author_link": "https://gov.optimism.io/u/solarcurve",
                    "index": "15",
                    "likes": "2",
                    "time": "08/01/2023-15:43:41",
                    "content": "Council sub-committee: Growth Experiments If you are a delegate, please provide the link to your delegate commitment: Delegate Commitments - #44 by solarcurve If you are a delegate, please indicate what % of votable supply is delegated to you: (voting power can be referenced here ) 0.55% at time of writing If you are a delegate, please indicate your voting participation rate in OP governance to date: https://optimism.karmahq.xyz/profile/balancermaxi.eth#votinghistory 100% voting participation rate Please link to your voting history and any voting rationale you’ve shared: Snapshot I’ve shared some reasoning in various proposal threads. I’d encourage anyone interested in my rationale to browse my forum activity here. Please outline any other contributions to the Optimism ecosystem to date: I’m largely responsible for getting BeethovenX & Balancer on Optimism early last summer. Optimism was the first network where boosted pools made up the majority of platform TVL (boosted pools deposit most tokens someone to earn extra yield for LP’s, e.g. Aave). Beyond this, I’ve been a fairly active delegate and participant in the Shadow Committee last season. Overall I believe Optimism has a very promising future and even if not elected to a position here, I’ll continue working behind the scenes as much as I can. Do you have a technical background? If so, please elaborate: I have taken some coding courses several years ago. I’m certainly not a developer now days but I have a strong understanding of technical concepts. I would not be someone who could do a code review or similar. Did you serve on a committee in Season 2? If so, please specify which: The Shadow Committee! Please demonstrate any experience you believe is relevant to this role: I’ve served in the Balancer DAO since its inception. I spent a few months on Balancer’s Grants team. I am a prominent participant in Balancer’s governance process (and actually designed most of it). Additionally, I lead a team called the Balancer Maxis which works for the Balancer DAO in various capacities including on-chain ops and business development. Please demonstrate expertise relevant to your Council sub-committee: I believe I have a very strong understanding of how incentive mechanisms work in DeFi (and in general). The year is 2023 so we should ensure Optimism does not spend funds on sub-optimal incentive schemes. I’m very open to novel approaches if any are brought forward. At the same time, there are many proposals Optimism has funded which will lead to zero lasting benefit. Please describe your philosophy on what makes a good Governance Fund grant: The most important factor is a reasonable likelihood of a long term benefit to Optimism. Printing OP can make anything look good while the printer is on. The critical question is does any benefit persist after the printing ends? If not, do not print. A simple philosophy but I believe a very important one. The act of spending OP on things that will not generate long term value can in fact make it harder for real value to rise to the surface, since it must compete with artificial short term incentives. The more we can level the playing field and let those products/projects which can stand on their own without incentives rise to the surface the quicker Optimism can grow in my view. What types of grant applications would you like to see or what RFPs would you create? Optimism needs additional second and third level projects which can build on top of the base level primitives like DEX’s and lending markets (where we have sufficient liquidity already). In other words, more and better use cases for why users should come to Optimism and take advantage of our strong DEX & lending market liquidity. Leveraged vaults is one recent example of Notional Finance making good use of Balancer liquidity. Please disclose any anticipated conflicts of interest: I contribute to Balancer DAO and have a good relationship with the BeethovenX team. I would abstain from voting on grant proposals from direct competitors (other DEXes). Please verify that you agree to abide by the delegate code of conduct : Yes Please verify that you understand KYC will be required to receive Council rewards at the end of Season 3: Yes Please verify that you are able to commit 12 hours / week to reviewing grant applications and other Council operations: Yes ",
                    "links": [
                        "https://dune.com/optimismfnd/optimism-op-token-house",
                        "https://optimism.karmahq.xyz/profile/balancermaxi.eth#votinghistory",
                        "https://snapshot.org/#/profile/0x512fce9B07Ce64590849115EE6B32fd40eC0f5F3",
                        "https://gov.optimism.io/u/solarcurve/activity",
                        "https://blog.notional.finance/introducing-leveraged-vaults/",
                        "https://gov.optimism.io/t/delegate-code-of-conduct/3943"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.72967563837129
                },
                {
                    "author_link": "https://gov.optimism.io/u/katie",
                    "index": "16",
                    "likes": "3",
                    "time": "11/01/2023-06:04:57",
                    "content": "Sliding in before the deadline! Council sub-committee: Growth Experiments If you are a delegate, please provide the link to your delegate commitment: Delegate Commitment If you are a delegate, please indicate what % of votable supply is delegated to you: 3.07% If you are a delegate, please indicate your voting participation rate in OP governance to date: 100% Please link to your voting history and any voting rationale you’ve shared: Here’s my Snapshot Voting History and my voting rationale is shared on each Forum proposal post. Please outline any other contributions to the Optimism ecosystem to date: I was the Lead of Defi Committee A. I also began and hosted the biweekly community governance calls and am a regular participant. I have participated in every voting cycle by providing feedback to proposers and voting on 100% of proposals. Do you have a technical background? No Did you serve on a committee in Season 2? I was the Lead of Defi Committee A. Please demonstrate any experience you believe is relevant to this role: I have been in the Defi space for 4 and a half years with 3 and a half years at the Maker Foundation and 1 year at an investment firm composed of former Maker Foundation employees - UDHC. Please demonstrate expertise relevant to your Council sub-committee: I have been very involved in the Optimism ecosystem and governance. I have also been in the broader defi space for a long time, and have hands-on experience providing feedback to project founders through my current role at a successful VC firm. Please describe your philosophy on what makes a good Governance Fund grant: I like to see clear and measurable KPIs. I also like the milestone based grants that are contingent on performance. What types of grant applications would you like to see or what RFPs would you create? I would like to see some of the underserved markets that attract new users such as gaming, NFTs and educational material. Please disclose any anticipated conflicts of interest: Any portfolio companies for UDHC would be a conflict of interest. Please verify that you agree to abide by the delegate code of conduct 1: Yes Please verify that you understand KYC will be required to receive Council rewards at the end of Season 3: Yes Please verify that you are able to commit 12 hours / week to reviewing grant applications and other Council operations: Yes ",
                    "links": [
                        "https://snapshot.org/#/opcollective.eth",
                        "https://gov.optimism.io/t/delegate-code-of-conduct/3943"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None"
                    ],
                    "Sentiment": 5.523415977961433
                },
                {
                    "author_link": "https://gov.optimism.io/u/kaereste",
                    "index": "17",
                    "likes": "3",
                    "time": "11/01/2023-13:00:22",
                    "content": "Council sub-committee: Builders sub-committee If you are a delegate, please provide the link to your delegate commitment:     Delegate Commitments 🏛 Governance       Name: Krzysztof Urbański (kaereste or krst)  Address or ENS: private: kaereste.eth, L2BEAT: l2beatcom.eth  Discord username: krst#6650  Verification (Tally profile or tweet): https://twitter.com/l2beat/status/1600859255648661505, personal Twitter: https://twitter.com/kaereste  I have read and understood the Delegate Commitment Process: Yes  I understand that becoming a delegate is a significant commitment: Yes  My reasons for wanting to be a delegate: I’ve been involved in a fight for free softw…     If you are a delegate, please indicate what % of votable supply is delegated to you: 520,425 OP, 2.22% of votable supply. If you are a delegate, please indicate your voting participation rate in OP governance to date: 62% (https://optimism.karmahq.xyz/profile/l2beatcom.eth#votinghistory), we have missed some votes, yet now we have a role among our team (me) dedicated solely to governance activities, so future participation would be rather close to 100%. Please link to your voting history and any voting rationale you’ve shared: https://optimism.karmahq.xyz/profile/l2beatcom.eth#votinghistory https://gov.optimism.io/t/l2beat-delegate-communication-thread/ Previously we’ve been providing rationale for specific votes inside relevant voting proposal threads. From now on we’ll be summarizing our participation in the delegate communication thread as well as on our social media (to spread the word about Optimism Governance outside of this forum). Please outline any other contributions to the Optimism ecosystem to date: L2BEAT is by definition ingrained in the L2 ecosystem. We’ve been early fans and supporters of Optimism. On our website we present detailed information about Optimism (Optimism – L2BEAT) including project milestones, live TVL and activity tracking. We have created the risk framework for both L2s and Bridges so that first of all we keep the users informed about the risks they’re taking but also we push the protocols (including Optimism) to strive for a better, decentralized, permissionless and trustless future. We are running an Optimism node in a validator mode and we’re actively monitoring if everything is running correctly. Do you have a technical background? If so, please elaborate: Yes, I am fluent with code and software architecture. I used to be a developer and sysadmin a long time ago. I also have a UX and product management background. For the last 15 years I’ve been working as a product manager/product owner. I am used to scheduling and planning IT projects and working with the development teams. I’ve been responsible for project delivery in various projects ranging from ecommerce through financial services to AI systems. As L2BEAT we have a very experienced technical team with deep expertise in L2s and crypto development. Did you serve on a committee in Season 2? If so, please specify which: Yes, the Tooling Committee ([DRAFT] S02 Committee Proposal: Tooling Governance Committee) Please demonstrate any experience you believe is relevant to this role: I have a decent experience with non-crypto granting programs (mainly EU and government funds), both from the perspective of grant receiver as well as grant operator, I believe this might be useful in this role. No matter if I get elected or not, I’ll be sharing my input on how to facilitate proper grant distribution. As L2BEAT we have a good overview of existing tooling in the L2 ecosystem and we have some vision of what’s lacking and what would be interesting to have. We will be sharing those views as RFPs and will engage in discussions to help the relevant teams deliver best results possible. Please demonstrate expertise relevant to your Council sub-committee: I have lots of experience in working with teams to properly plan and schedule projects. While reviewing the proposals I will be working closely with proposers to make sure their proposals are both realistic and focused on delivering the most value to the Optimism ecosystem. I’ve been already working on the Tooling Committee in the previous season and been engaging in productive discussions with the proposers, hope to continue this in the upcoming season. I believe that the grant council should be more involved in the discussion with projects while fine-tuning the grant proposal so that the proposals are either abandoned early or are written properly so that they are more likely to pass. Especially that going forward we won’t have an open voting but just a Grant Council approval, it is crucial to have a healthy and open discussion on what are the Council’s expectations and goals. Members of L2BEAT team have been involved in the development of many web3 tools, including DethCode (GitHub - dethcrypto/dethcode: View source of deployed Ethereum contracts in VSCode), TypeChain (GitHub - dethcrypto/TypeChain: 🔌 TypeScript bindings for Ethereum smart contracts), ethTx (https://ethtx.info/)., TokenFlow (https://tokenflow.live/) and others. I believe that we have necessary experience and knowledge to make a valuable addition to the Builders Sub-committee. Please describe your philosophy on what makes a good Governance Fund grant: A good grant is one that is deliverable in the proposed schedule and budget. I prefer smaller budgets and timeframes with a specific plan for execution. It’s easier to pivot and adapt on a smaller scope than on the very ambitious, multi-month project. It is essential that all proposals include clearly defined and quantifiable key performance indicators (KPIs). This will enable the evaluation of the project’s impact in the future and provide future grantees with valuable insights and lessons learned from the execution of previous projects. When it comes to software, we are firmly committed to the use of open-source, decentralized, and permissionless systems that prioritize the security and privacy of the users. While we acknowledge that certain compromises may be necessary in certain cases (such as with most Layer 2 solutions today), we will always give preference to proposals that align more closely with these values when presented with multiple options. What types of grant applications would you like to see or what RFPs would you create? Regarding the type of proposals that we are looking for, we feel that there is a lot of space to innovate in terms of:  User-facing apps with exceptional user experience (like wallets, but also specific smaller feature-apps) Governance tooling, especially all kinds of projects that facilitate control and transparency over distributed funds or that allow for better process management in terms of Optimism governance Advanced developer tooling (like more sophisticated block explorers, etc.) that enhance developer experience and makes it easier to build, test and deploy software on Optimism Tools and resources that facilitate maintenance of Optimism rollup, like tooling that helps run an in-house Optimism validator node and monitor for the issues, in the future the possibility to submit fraud proofs All kinds of educational resources to promote not only the mechanics but also values of the Optimism ecosystem  Please disclose any anticipated conflicts of interest: I don’t think there are any existing personal conflicts of interest. If there are any during my tenure, I will immediately reveal them. As L2BEAT, we are running a research and analytics platform for the L2 ecosystem (https://l2beat.com/) so obviously any competing project could be considered as posing a conflict of interest. However, in all cases I will work closely with the projects for their best interest and best interest of the Optimism and Ethereum ecosystems. Furthermore, as L2BEAT we might be applying for Optimism grants as well - in such cases I will abstain from voting and will not engage in the Council discussions on this specific proposal. Please verify that you agree to abide by the delegate code of conduct 1: Yes Please verify that you understand KYC will be required to receive Council rewards at the end of Season 3: Yes Please verify that you are able to commit 12 hours / week to reviewing grant applications and other Council operations: Yes ",
                    "links": [
                        "https://twitter.com/l2beat/status/1600859255648661505",
                        "https://twitter.com/kaereste",
                        "https://optimism.karmahq.xyz/profile/l2beatcom.eth#votinghistory",
                        "https://optimism.karmahq.xyz/profile/l2beatcom.eth#votinghistory",
                        "https://gov.optimism.io/t/l2beat-delegate-communication-thread/",
                        "https://l2beat.com/scaling/projects/optimism",
                        "https://gov.optimism.io/t/draft-s02-committee-proposal-tooling-governance-committee/3333",
                        "https://github.com/dethcrypto/dethcode",
                        "https://github.com/dethcrypto/TypeChain",
                        "https://ethtx.info/",
                        "https://tokenflow.live/",
                        "https://l2beat.com/",
                        "https://gov.optimism.io/t/delegate-code-of-conduct/3943"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.014943810398355
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "18",
                    "likes": "2",
                    "time": "11/01/2023-17:20:48",
                    "content": "Council sub-committee: Builders If you are a delegate, please provide the link to your delegate commitment: Delegate Commitment If you are a delegate, please indicate what % of votable supply is delegated to you: 0.34% If you are a delegate, please indicate your voting participation rate in OP governance to date: 98% Delegates of Optimism DAO Please link to your voting history and any voting rationale you’ve shared: As an advocate of open communication and mutual feedback, I always share my voting rational on my delegate communication thread. Please outline any other contributions to the Optimism ecosystem to date: I don’t have a project of my own on Optimism so my contribution could be seen as limited to some audience. Nonetheless, as I am quite active on OP Governance, here are few small one’s I would like to mention.  I was actively sharing my feedback on proposals during initial stage of our gov, when we were going through Phase 0. Lead DeFi Committee C Member of NFT committee After finding that Uni is seeking community feedback on their OP grant distribution, I shared my thought and they considered it. ([RFC] The Optimism-Uniswap Protocol Liquidity Mining Program - #9 by devinwalsh - Proposal Discussion - Uniswap Governance) I met Barbarossa (from Arrakis) and invited them to join our gov, they later submitted a grant proposal. Helped Tally in drafting their proposal ( Abstained from voting) Contributed to OP manual - Pull request. Update manual.md by OPuserWasTaken · Pull Request #13 · ethereum-optimism/OPerating-manual · GitHub  Created a flow chart for season 2 and later a zk-based badge (on Sisimo) for season 2 committee members Contributed to almost all proposals on this forum, in one way or another. Along with DeFiLatam Team, contributed towards updating OP manual.  Do you have a technical background? If so, please elaborate: As a pseudo anon this is little weird but here are few points. As tradi-fi dev moving towards biz-dev and product management, I have seen and lead couple of end-to-end product development, so I understand bits and pieces of a project development, their complexity and challenges. No solidity experience but I am following and reading about web3 space from past couple of year, both personally and professionally, so I am comfortable with most web3 ecosystem. Did you serve on a committee in Season 2? If so, please specify which: DeFi Committee C NFT committee Please demonstrate any experience you believe is relevant to this role: Professionally, I have been on both side of grant, receiving and granting, with only difference is that web3 space is moving at an insane speed compare to tradifi. Deep understanding on Optimism ecosystem. Please demonstrate expertise relevant to your Council sub-committee:  Learned a lot about distributed communication/co-ordination from my participation in season 2 committee. After reading all most all proposals on this forum, I am quite comfortable with reviewing a proposal based on its merit. As I am part of this gov from beginning, I have the full context on what type of funding was approved, their impact, drawback and scope of improvement. This is quite important as I can apply those learning on upcoming proposals. Not related to any project so my views not biased towards anyone.  Please describe your philosophy on what makes a good Governance Fund grant: It wont be perfect, we just completed two seasons with some good and bad use of grant but we can apply those learning to build something new and better.  Clear timeline, short duration and KPI based proposals. From reviewer side, willingness to work in tandem with protocol. Foundation is working on iteration and i would like to see the same approach applied when doing the fund allocation, distribution of fund in small amount to fund and support as many proposals as possible.  What types of grant applications would you like to see or what RFPs would you create? This should incorporate your view on what the Optimism ecosystem needs to prioritize right now.  Measurable, focus on short duration. Do, learn, and iterate Privacy related project. (DeFi or P2P) Building on/around LSD Project working on Digital Identity. Tool and infra on Optimism. With low transaction cost and OP stack, i believe on chain gaming will see some traction, metaverse is another domain that i am really excited about and would love to see some innovation around it.  Please disclose any anticipated conflicts of interest: None, I am not related to any project in any way. Happy to answer any query. Please verify that you agree to abide by the delegate code of conduct : Yes Please verify that you understand KYC will be required to receive Council rewards at the end of Season 3: Yes Please verify that you are able to commit 12 hours / week to reviewing grant applications and other Council operations: Yes ",
                    "links": [
                        "https://optimism.karmahq.xyz/profile/hailvitalik.eth#votinghistory",
                        "https://gov.optimism.io/t/opuser-delegate-communication-thread/2777",
                        "https://gov.uniswap.org/t/rfc-the-optimism-uniswap-protocol-liquidity-mining-program/17820/9",
                        "https://github.com/ethereum-optimism/OPerating-manual/pull/13",
                        "https://gov.optimism.io/t/draft-so2-committee-proposal-defi-group-c/3320"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.592862062180243
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "19",
                    "likes": "0",
                    "time": "11/01/2023-19:09:01",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "20",
                    "likes": "0",
                    "time": "19/01/2023-00:03:45",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "21",
                    "likes": "2",
                    "time": "19/01/2023-00:04:40",
                    "content": "Snapshot vote - Builders Snapshot vote - Growth Experiments The Council Lead was selected by the Foundation for Season 3 and is @danelund.eth ",
                    "links": [
                        "https://snapshot.org/#/opcollective.eth/proposal/0xa9457a5344747a6c272de786419fc7a4e83fcf0f927ef9b1ce767452faa9b453"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/SlaverSlave",
                    "index": "22",
                    "likes": "0",
                    "time": "26/01/2023-18:28:00",
                    "content": "Hi, this optimism trip was very exciting.  I participated in optimism QUESTs Then I shill optimism in social media like twitter and discord. By the way I was really exciting about first optimism airdrop camping and now I trying myself donig best MEMS for optimism prodjects like that ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 6.973333333333334
                }
            ]
        }
    ],
    "group_index": "394"
}