{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/draft-gf-phase-1-proposal-optimism-africa-dao/4737",
            "title": "[DRAFT] [GF: Phase 1 Proposal] Optimism Africa DAO ",
            "index": 4737,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Grants Council"
            ],
            "tags": [
                "season-3",
                "cycle-10",
                "not-passed"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/Hawwal",
                    "index": "1",
                    "likes": "2",
                    "time": "22/01/2023-00:02:56",
                    "content": "Project name: Optimism Africa Regional DAO Author name and contact info:  Emmanuel Hawwal Ogungbadero Twitter: itshawwal, Linkedin: itshawwal, Email: optimism.africa@gmail.com   I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: Yes L2 recipient address: 0xB6Bb848A8E00b77698CAb1626C893dc8ddE4927c Which Voting Cycle are you applying for? : Phase 1 Which sub-committee should review your proposal: Education  Project description:  Optimism Africa 23500×2500 145 KB  Hello, Community. My name is Hawwal, and I’m a creative from Africa, Guinness world record holder, I have a BSc in Computer Science, and also the founder of Blaqk Stereo Dao. This is a project I am really passionate about as its my dream to see Africans build apps and tools to contribute to our continent and the ecosystem by gaining knowledge on how Optimism works also promoting development and usage of the OP Stack through strategic hackathons. Goal: Onboarding African builders, spreading the adoption of Optimism locally across the African continent. Ushering in “Op-chain’s” or the Super-chain’s  next line of developers. In order to further spread the knowledge of Optimism locally in different regions and cultures here in Africa, we would be utilising a grassroots strategic approach which will benefit the growth of Optimism here in Africa. We are creating Optimism African Regional Dao that will serve these purposes:  Hosting seminars and events to educate university students and builders. Organisation of Hackathons rewarding innovation and builders from the African continent building on and developing the Op-stack. Translation of Optimism educational content to local languages amongst various African countries. General Optimism awareness in Africa.  Project links: We prepared a proposal deck for the community to view which contains additional details.  Discord: Link  Twitter: Link  Proposal deck: Link   Additional team member info:  Project Lead: E. Hawwal Ogungbadero - Twitter: itshawwal, Linkedin: itshawwal. Community manager: Benedicta Nweke - LinkedIn  Community manager 2: Timi Otegbayo - LinkedIn  Developer lead: Victor Aiyeola - Linkedin  Marketing: Ized Uanikhehi - Linkedin   Please link to any previous projects the team has meaningfully contributed to: Near protocol: Guinness world record (Longest Recording Marathon with Multiple Artists) - Link Relevant usage metrics:  Projected Metrics/KPI’s:-  Hackathons: The primary focus is to attract developers and builders across Africa to these events that will hold twice every 6 months.    Metrics:-  2 hackathon in Africa   90 hackathon participants in total per each hackathon     least of 20 submissions per each hackathon    Seminars and Conferences: This focuses on organising continental conferences as well as events in universities to share information about Optimism as we socialise and onboard new Africans to the Optimism ecosystem.    Number of Conferences: 2     Number of events: minimum - 20    Social media: Various Optimism socials pages will be set up in local African languages and will post daily educative content translated in their languages. Metrics:-  1 Twitter Spaces per Week 4 Social posts per Week (Twitter, Discord, Telegram, Medium & mirror.xyz) Ongoing management of local communication channels  Competitors, peers, or similar projects: Binance Africa & Aurora Africa. Is/will this project be open sourced? Yes Optimism native: Yes Date of deployment/expected deployment on Optimism: (Q1 - Q3) 2023 Ecosystem Value Proposition:   Problem:  Poor awareness of Optimism in Africa Limited African engagement with Optimism ecosystem apps No established Optimism Organization to directly engage with the African continent.    Solution:  Establishment of an Optimism African Dao: That could engage one on one and onboard builders from African nations to the Optimism ecosystem. Hosting of regional events on a monthly bases: to boost Optimism awareness in Africa Organisation of Hackathons: To engage and encourage builders across Africa as-well students in universities exposing their talents, and supporting their projects as they build and further develop the Op stack. Provision and translation of Optimism and Op stack’s educational contents via platforms in various local languages across Africa regions.    Has your project previously applied for an OP grant: No Number of OP tokens requested: 260,000 OP We are requesting payment to be given in batches. 40% upfront to launch and 60% after delivery of first 3 reports. Did the project apply for or receive OP tokens through the Foundation Partner Fund?: No Proposal for token distribution: In efforts to drive the proliferation of OP usage amongst African builders and to increase the interact-ability with Optimism ecosystem apps, OP tokens received will be used to drive the African OP ecosystem as tokens will be held and only distributed through prolific projects designed to drive OP usage during our Hackathons. Distribution:     Purpose Percentage (%)     OP circulation in builders proliferation projects (Hackathons) - 25   Regional (Universities) OP circulation interact-ability - 10   Optimism Africa OP locked (duration: 1yr) for future African OP proliferation projects - 55   Optimism Africa OP stack development circulation - 10   Total - 100    Duration: 6 - 12 months. (Marketing, reoccurring events will continue beyond the 6 months benchmark.) A full detailed report will be presented on the first week of every month with covering:  Onboarded African projects interacting with OP stack OP in circulation Events held. Social media posts with links. Current OP balance in wallet (verification: etherscan).  Milestones/KPI’s:    2x Hackathons within 4 - 6 months     2x Optimism Africa conferences within 4 - 6 months.     Optimism Africa proliferation projects: 8 - 20 onboarded to Optimism ecosystem.     Social pages least growth in 4 - 6 months:   20k on Twitter 10k on Telegram 7k on Discord    Retention strategy: Launch of “Optimism Tribe” web3 social club for universities across Africa. Optimism Tribe is a web3 social club dedicated to inspiring, educating, and exposing youths in higher institutions to the vast opportunities in Optimism, onboarding and building a fully functional community of young minds in the Optimism ecosystem.” This clubs will be established in each African university and inaugurated eco leads or “tribal chiefs” as we call them will be the custodians. Re-elections will occur periodically to elect new eco leads as previous leads leave campus. Traction: A few months back we held the first-ever Tribe event and we planted the first club cell which was tagged “Tribe LASUTH \". Currently, we have about 20 active members in the club all discussing web3 and possible fusion into their field of study which happens to be medicine. check out this blog post on medium. Please provide any additional information that will facilitate accountability: Regional DAO Operations  Forum Posts to update Community (mirror.xyz inclusive) Legal Agreements Tooling:  Metamask Etherscan Utopia Boardroom Otoco KYC DAO Questbook    Thank you. ",
                    "links": [
                        "https://www.linkedin.com/in/hawwal",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/0/0654ae155d258ecae2b9bc9f23b9652f53b8933c.png",
                        "https://www.guinnessworldrecords.com/world-records/209803-longest-recording-session-with-multiple-artists#:~:text=The%20longest%20recording%20marathon%20with,Nigeria%2C%20on%2025%20June%202022.",
                        "https://discord.gg/d8PZAXcdNq",
                        "https://www.twitter.com/optimismafrica",
                        "https://drive.google.com/drive/folders/1dDvLrt3ZmNY7Ohn2LpqehAfFR5r2bipt?usp=share_link",
                        "https://www.twitter.com/itshawwal",
                        "https://www.linkedin.com/in/hawwal",
                        "https://www.linkedin.com/in/benedicta-nweke-912a1a67",
                        "https://www.linkedin.com/in/timi-phoenix-b61a01110",
                        "https://www.linkedin.com/in/victor-aiyeola",
                        "https://www.linkedin.com/in/izeduanikhehi",
                        "https://www.blaqkstereo.com/gwr",
                        "https://www.lasuth.org.ng/",
                        "https://medium.com/@blaqkstereo/blaqk-stereo-introduces-tribe-a-web3-social-club-for-universities-68e2183a2e0a"
                    ],
                    "GPT-summary": "The post is a draft proposal for the Optimism Africa Regional DAO, which aims to onboard African builders and promote the adoption of Optimism in Africa through hackathons, seminars, and translation of educational content. The proposal includes details on the project's goals, team members, metrics, competitors, and ecosystem value proposition. The post also mentions the request for OP tokens and the proposal for their distribution. The post explains the proposal in detail and invites feedback and questions from the community.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Smart contract updates",
                        "None",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal",
                        "None"
                    ],
                    "Sentiment": 5.226417615306504
                },
                {
                    "author_link": "https://gov.optimism.io/u/Tootoopaing",
                    "index": "2",
                    "likes": "2",
                    "time": "25/01/2023-05:57:02",
                    "content": "Niceij jsiidjcjcjjcndjskjxjchfhfjdjcjcjj ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/MoneyManDoug",
                    "index": "3",
                    "likes": "2",
                    "time": "05/02/2023-16:37:24",
                    "content": "    Hawwal:  |Hackathons events|- 8.4| |Hackathon incentives|- 20| |Reoccurring events - Regional (Universities)|- 13.8| |Optimism Africa conferences (x2)|- 16| |Marketing (for a year)|- 20.4| |Optimism Africa Retro Dev. support grants|- 11.4| |Team Compensation (work duration)|- 10| |Total|- 100|   your proposed distributions would require edits as it violates the no-sale rule. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Hawwal",
                    "index": "4",
                    "likes": "1",
                    "time": "05/02/2023-18:54:39",
                    "content": "Hello, Thanks for the feedback, I really appreciate. I would like to get more info on the “No-sale rule” so I could get some guidance as to how the distributions can be rearranged. Thanks  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.375
                },
                {
                    "author_link": "https://gov.optimism.io/u/GrantsOps",
                    "index": "5",
                    "likes": "2",
                    "time": "05/02/2023-21:52:04",
                    "content": "Hello, please refer to the Feb 3 AMA notes as a reference. The full no sale rule text is available in the notes. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://gov.optimism.io/u/Hawwal",
                    "index": "6",
                    "likes": "1",
                    "time": "06/02/2023-09:48:34",
                    "content": "Hello, thanks so much for the help, I have made the necessary adjustments to the distributions.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.666666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/FractalVisions",
                    "index": "7",
                    "likes": "1",
                    "time": "06/02/2023-13:03:24",
                    "content": "    Hawwal:  Number of OP tokens requested: 260,000 OP We are requesting payment to be given in batches. 40% upfront to launch and 60% after delivery of first 3 reports.   This part of the grant request for 260,000 OP exceeds the maximum number of tokens for this grant structure as part of the original guidelines. Also does this section below describe actions that violate the no sale rule of the grant ? This looks like developer funds & some sort of payout to the team with a percentage of the tokens.     Hawwal:  |Optimism Africa devs. proliferation OP circulation|- 10% |Team reserve|- 15%   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.5625
                },
                {
                    "author_link": "https://gov.optimism.io/u/Hawwal",
                    "index": "8",
                    "likes": "0",
                    "time": "06/02/2023-16:57:09",
                    "content": "Hello, Thanks for the feedbacks…     FractalVisions:  This part of the grant request for 260,000 OP exceeds the maximum number of tokens for this grant structure as part of the original guidelines.   I’m happy to cut down the budget to this proposal to suit the guidelines. We should be able to execute within the original guidelines budget provision.     FractalVisions:  Also does this section below describe actions that violate the no sale rule of the grant ? This looks like developer funds & some sort of payout to the team with a percentage of the tokens.   This is the re-adjusted distribution percentages. On reading through the No-sale rule, I had to reroute to prevent or avoid situations that may involve converting or selling of OP to fiat or any other crypto currency as OP is a governance token and is to remain in the Optimism ecosystem here in Africa to be used as the primary token in future African emerging tech. I will readjust the distribution again and merge the team reserve with the main Optimism Africa OP locked reserve. Thanks ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.140046296296297
                },
                {
                    "author_link": "https://gov.optimism.io/u/FractalVisions",
                    "index": "9",
                    "likes": "1",
                    "time": "06/02/2023-17:08:23",
                    "content": "All good! You have a nice proposal here and we will wait to hear back from other members of governance for additional feedback or guidance. Glad to see you adapt with the cycle of grants being presented this season. It will be a historic vote for many projects coming to Optimism. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.678571428571429
                },
                {
                    "author_link": "https://gov.optimism.io/u/Hawwal",
                    "index": "10",
                    "likes": "0",
                    "time": "06/02/2023-17:14:25",
                    "content": "Thanks so much, I really appreciate the feedback.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                }
            ]
        }
    ],
    "group_index": "433"
}