{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/gf-phase-1-proposal-ante/5529",
            "title": "[GF: Phase 1 Proposal] Ante ",
            "index": 5529,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Grants Council"
            ],
            "tags": [
                "builders",
                "cycle-11"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/delalunia",
                    "index": "1",
                    "likes": "1",
                    "time": "08/03/2023-17:12:56",
                    "content": " Basic Details Project Name: Ante  ante-logo-with-wordmark900×400 95 KB  Author Name and Contact Info: Justin | justin@ante.xyz | Forum: delalunia | Discord: Delalunia#6671 L2 Recipient Address: 0x8F9fd1E69Ad22aceeba0eC010CA7910B3eb69429 Which Voting Cycle are you applying for? Cycle 11 - Builders I confirm that I have read the landing pages for the Builders and Growth Experiments Sub-Committees and that I have determined my proposal is best suited to be reviewed by the Builders Sub-Committee: Yes I understand that Growth Experiments grants are subject to a “no sale rule,” as explained in this post, and I have read the terms of the rule: [Yes/No]: Yes   Project Details What are you going to build? Ante is building a trust primitive that makes trust guarantees explicit on-chain, showing user faith in the tested smart contracts. Why is what you are going to build going to succeed? We have been live with our v0.5 proof of concept already for over a year, with 6 protocols having already written and staked their own Ante Tests. Is your project likely to bring new builders to the Optimism ecosystem? If so, please describe how: Ante will bring new builders to the Optimism ecosystem by bootstrapping trust with protocols and aligning their goals with other builders. Additionally this platform is a great way for developers to dive into a protocol’s smart contract, start digging into their invariants, and writing them out into Ante Tests. Additionally, this platform is a great way for developers to improve their protocol and smart contract understanding by digging into protocol smart contracts for invariants and writing them as Ante Tests. Is your project likely to improve the quality of developers in the Optimism ecosystem? If so, please describe how: Ante will improve the quality of developers in the Optimism ecosystem as developers, users and projects integrate with Ante to improve the overall trust in the space. With increased trust, more protocols will adopt writing Ante tests and attract aligned like minded developers. Is your project likely to improve the commitment of developers in the Optimism ecosystem? If so, please describe how: Ante’s overarching goal of improving trust within the ecosystem with more adoption of Ante tests will allow developers be aligned and committed. Additionally, with our introduction of author rewards, test writers will be able to improve their capabilities and earn additional yield by writing tests. Provide us with links to any of the following for the project:  Demo: https://app.ante.finance/  Website: https://www.ante.finance/  Twitter: https://twitter.com/antefinance  Discord: Ante Finance  Github: GitHub - antefinance/ante-community-tests: Community-authored Ante Test repository  Medium: Ante Finance   Do you have any metrics on the project currently? (TVL, transactions, volume, unique addresses, etc. Optimism metrics preferred; please link to public sources such as Dune Analytics, etc.):  TVL - 500k (Ante Finance: TVL and Stats - DefiLlama) Projects partnered - 8 (Have written Ante Tests and staked by project)  Who are your competitors? As far as we are aware, we don’t believe we have any direct competitors at the moment. What differentiates you from your competitors? N/A Will your project be composable with other projects on Optimism? If so, please explain: Nearly all projects should be able to have some sort of guarantee that can be explicitly written out or checked on chain, so we’re able to integrate with most all new and old projects on Optimism.   Team Who are your founders? Chris What makes your founders well-positioned to accomplish your goals with this project (1-2 sentences on each)? Our founder Chris comes from a traditional finance background, has been closely working in and monitoring the crypto and defi space for the past several years, and strongly aligned with the project’s mission of “making trust explicit” and building upon that trust. Tell us about the rest of our team (if there are more teammates): Our team (including advisors) is primarily technical and consists of individuals with engineering, tech, traditional finance, and academic backgrounds. Is this your first Web3 project? Yes If not, what else have you built? (Share links, Github repository, or any other useful information): N/A I understand that Builders grants are subject to a 1 year lock-up, as explained further in this post: Yes Is your project funded? If so, provide an estimate of how many months of funding runway your project has: Yes, the project is funded, we estimate that we have ~36 months of runway.   Grant Request What is the size of the grant request? (50k OP max): 50k OP How do you justify the size of the grant? Ante believes we are working on a new primitive for trust-signaling, which could form the building blocks for decentralized trust ratings and increase peace of mind for web3 builders and users.   Roadmap Describe in discrete steps your plan for accomplishing your project: We believe we have 3 main types of counterparts: 1) users, 2) developers, 3) protocol partners, and we need to deliver value to all 3 counterparts in order to grow the Ante community. We are systematically rolling out and testing new features (e.g., Antegen - a “no code” way to deploy Ante Tests) in order to attract more users, and have hosted workshops at university campuses and crypto conferences which are targeted at developers. For protocol partners, we are continuously working to find new partnerships (e.g., with Zellic, a top-tier auditing firm), and finding ways to enhance value for our existing partners (e.g., pioneering “trust reports” to summarize trust assumptions about individual protocols). Please provide any additional information that will facilitate accountability: (smart contracts addresses relevant to the proposal, relevant organizational wallet addresses, etc.) N/A Does your plan depend on the receipt of OP tokens?: No What is your plan for the use of the OP token after the 1 year lock-up?: We are still brainstorming ways to use the OP token, but one way we could use the token is to stake OP behind the Ante Tests of key network guarantees or protocols in the ecosystem. Please provide benchmark milestones for this project. These milestones should guide the Optimism community on the progress of your project during the 1-year lock-up period. We have two primary milestone categories: 1) releases of new features or releases of next versions of the web app (we just released v0.6 of the Ante web app), and 2) number of partnerships with protocols. Please define critical milestones for this project. Critical milestones are meant to show good-faith efforts to accomplish the project. Non-completion of these milestones could lead to revocation of remaining grant rewards.  First milestone we have is regularly releasing new features monthly for the existing web app and potentially releasing the next version of the protocol. The second milestone is increasing the number of protocols we partner with (e.g., doubling or tripling the current number). The third milestone are our KPIs we are track - e.g., web app hits, number of Ante tests written, total unique addresses, which are indicators of traction. Goals being to increase that by 2 or 3 times by end of the year.    Optimism Relationship Does your project solve a problem for the Optimism ecosystem? Trust is one of the biggest issues in all of crypto, preventing users from joining or adopting the system due to that mistrust. Ante hopes to solve this issue by creating a way to explicitly show trust in a project by having Ante tests written and staked for that project. How does your proposal offer a value proposition solving the above problem? When projects write Ante Tests for their invariants or promises, users can more easily see what guarantees projects are committing to. Once staked by projects themselves and their users, it shows confidence that both have in their code and commitments directly with that value. Why will this solution be a source of growth for the Optimism ecosystem? With more projects that are able to explicitly demonstrate trust in their project, it should give more confidence overall in the project and Optimism ecosystem, bringing in more users and developers. How committed are you (and your team) to building on Optimism? We have already committed our initial v0.5 to Optimism (https://v05.app.ante.finance). We continue to pursue that with our current v0.6 release (https://app.ante.finance) and any future releases as well. Is your project Optimism Native? Yes   Confirmations I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: Yes I understand that I will be expected to following the public grant reporting requirements outlined here: Yes Thank you! The Ante Team  ",
                    "links": [
                        "https://gov.optimism.io/u/delalunia",
                        "https://optimistic.etherscan.io/address/0x8F9fd1E69Ad22aceeba0eC010CA7910B3eb69429",
                        "https://foul-porch-0eb.notion.site/Builders-Sub-Committee-02ba9da5b4534fbf955e6e4c8fcf1aa3",
                        "https://foul-porch-0eb.notion.site/Growth-Experiments-Sub-Committee-270d2f75ff0f410a869b2ba6a8324006",
                        "https://gov.optimism.io/t/grant-proposal-template/3233",
                        "https://app.ante.finance/",
                        "https://www.ante.finance/",
                        "https://twitter.com/antefinance",
                        "https://discord.gg/ante",
                        "https://github.com/antefinance/ante-community-tests/",
                        "https://medium.com/ante-finance",
                        "https://defillama.com/protocol/ante-finance",
                        "https://gov.optimism.io/t/grant-token-lock-explainer/5060",
                        "https://v05.app.ante.finance",
                        "https://app.ante.finance",
                        "https://gov.optimism.io/t/suggested-public-reporting-requirements-for-grantees/4176"
                    ],
                    "GPT-summary": "The post is a proposal for a project called Ante, which aims to build a trust primitive that makes trust guarantees explicit on-chain, showing user faith in the tested smart contracts. The proposal explains the project's details, how it will succeed, and how it will bring new builders to the Optimism ecosystem. The post also includes metrics, team information, grant request, roadmap, and confirmations. The proposal does not ask for feedback or collaboration, but it may be extended to by third parties.",
                    "GPT-proposal-categories": [
                        "Smart contract updates",
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Board composition",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.677015692640692
                },
                {
                    "author_link": "https://gov.optimism.io/u/kaereste",
                    "index": "2",
                    "likes": "1",
                    "time": "14/03/2023-06:49:55",
                    "content": "Hey @delalunia, giving you a heads up that this will be the formal comms channel with the grant council builders subcommittee, which consists of @Gonna.eth, @jackanorak, @danelund.eth, and myself. We’ll make sure we’re around to address any questions you have in this process. We might also be asking additional questions here during the review process so please check this thread for updates on a regular basis. One thing to be mindful of is that in the Cycle 11 we require the milestones to be precisely defined into two categories - critical milestones and benchmark milestones as described in Milestone Assessment . Could you please restructure your milestones description to follow this structure? Moreover, please elaborate a bit more on the use of the grant and on the justification of the size of the grunt. I know you’ve noted that you’re still brainstorming it, but having more details will make it easier for us to fairly score it in our assessment. We would appreciate some more details about your team, we would like to be able to check some sources (Github, Twitter, Linkedin - anything that allows us to actually assess the quality of the team). Thanks in advance for your response, in case you had any questions don’t hesitate to ask here or reach out to us! ",
                    "links": [
                        "https://gov.optimism.io/u/jackanorak",
                        "https://gov.optimism.io/u/danelund.eth",
                        "https://gov.optimism.io/t/milestone-assessment/5314"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.8125
                }
            ]
        }
    ],
    "group_index": "585"
}