{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/op-burning-for-sustainability/3018",
            "title": "$OP Burning for Sustainability ",
            "index": 3018,
            "category": [],
            "tags": [
                "token"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/0xHarsh",
                    "index": "1",
                    "likes": "4",
                    "time": "18/07/2022-04:29:36",
                    "content": "Hello good people, I suggest we use $OP as a gas token instead of ETH and burn $OP spent as gas. We all know how the token launch went and who dumped it. So, we need a burning mechanism to balance the tokenomics and reduce the total supply. After all, this is a suggestion for sustainability, but the final decision is on the team. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/Prometheus",
                    "index": "2",
                    "likes": "2",
                    "time": "18/07/2022-08:57:09",
                    "content": "Related:  Enabling $OP as a gas token on Optimism Network! Change the use of OP tokens from a governance token to the main network token for gas payment Make OP as the network fee token along with governance token Should we pay fees with OP token? Optimism $OP Buyback and Burn to increase price of the token!  ",
                    "links": [
                        "https://gov.optimism.io/t/change-the-use-of-op-tokens-from-a-governance-token-to-the-main-network-token-for-gas-payment/2245",
                        "https://gov.optimism.io/t/make-op-as-the-network-fee-token-along-with-governance-token/2400/1",
                        "https://gov.optimism.io/t/should-we-pay-fees-with-op-token/2376",
                        "https://gov.optimism.io/t/optimism-op-buyback-and-burn-to-increase-price-of-the-token/2489"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.520833333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/haldizenli",
                    "index": "3",
                    "likes": "1",
                    "time": "18/07/2022-11:39:27",
                    "content": "We can use it as gas token. Zksync will do that. Why not us? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Prometheus",
                    "index": "4",
                    "likes": "4",
                    "time": "18/07/2022-11:53:28",
                    "content": "There’s already plenty of debate on this, no need to spread the debate into multiple posts, anyway I’m quite aligned with:    Change the use of OP tokens from a governance token to the main network token for gas payment   I’m strongly against this proposal. One of the unique strengths of Optimism is Ethereum Equivalence, it isn’t just EVM compatible, but is designed to operate almost exactly like mainnet. This means porting smart contracts across is as simple as possible, gas works the same, opcodes work the same, it means Optimism can adopt all the same EIPs as Ethereum with minimal extra work. Basically it’s an amazing advantage over just about everything else. If we stopped using Ethereum for gas and switched to using OP we would be sacrificing all of that to what gain? The OP collected as gas would need to be sold for ether in order to pay the mainnet fees anyway so all it would really do is add an extra step to that process.      Change the use of OP tokens from a governance token to the main network token for gas payment   Cross-posting here from Twitter : I understand this proposal is motivated by a wish to increase the OP price. The price is a function of supply+demand. We can ignore supply for this proposal and only focus on demand. Demand for OP will likely come from two sources:  Staking demand to earn sequencer revenues Reservation demand, e.g. as a money-like instrument or gas token  Sequencer revenue is primarily a function of providing the best possible UX to Optimism devs/users. Forcing users to hold OP would improve the reservation demand but at the cost of much worse UX - ultimately hurting demand more than helping it. Instead, I think the natural endgame is for all execution layers to abstract away fees entirely and let users pay in one of many major tokens, pay from a secondary account, pay from the output of their trades, or with MEV, etc. This is the best possible UX and this will maximize usage of Optimism and ultimately demand for the OP token more than any other strategy.   ",
                    "links": [
                        "https://gov.optimism.io/t/change-the-use-of-op-tokens-from-a-governance-token-to-the-main-network-token-for-gas-payment/2245/69",
                        "https://twitter.com/hasufl/status/1532605348195999744?s=20&t=V-cws4UBMbhx9f0a1aUStA"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.791921768707483
                },
                {
                    "author_link": "https://gov.optimism.io/u/0xHarsh",
                    "index": "5",
                    "likes": "2",
                    "time": "26/07/2022-10:35:18",
                    "content": "I created a separate post because my main motive is to create a constant burning mechanism. Be it a gas fee token or something else, but $OP as a gas fee token seems very doable. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.611111111111111
                },
                {
                    "author_link": "https://gov.optimism.io/u/hait",
                    "index": "6",
                    "likes": "0",
                    "time": "01/12/2022-06:26:39",
                    "content": "This feature is definitely needed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Memecode",
                    "index": "7",
                    "likes": "2",
                    "time": "07/12/2022-22:15:48",
                    "content": "In my opinion I support a multi use of OP token and using it as a source for cheaper gas transaction might be doable. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "167"
}