{
    "poll_list": [
        {
            "id": "0xc9c0a739a29ce6477708f49a2985e4c8cb2e4ba0be1d3761541ed189a9c341e1",
            "title": "Season 2: Cycle 8: Angle",
            "discussion": "https://gov.optimism.io/t/review-gf-phase-1-proposal-angle-protocol/2552/55",
            "body": "This Governance Fund Phase 1 proposal is eligible for voting in Cycle 8. This is the last Voting Cycle of Season 2. \n\nThis proposal was reviewed by [DeFi Committee C.](https://gov.optimism.io/t/defi-committee-c-season-2-recommendations/3437/13?u=lavande) You can find committee recommendations below:\n[DeFi Committee C Recommendations](https://gov.optimism.io/t/defi-committee-c-season-2-recommendations/3437/13?u=lavande)\n\nShadow DeFi Committee B is not an official committee but posts their own recommendations here: [https://gov.optimism.io/t/defi-shadow-committee-season-2-recommendations/3549/11](https://gov.optimism.io/t/defi-shadow-committee-season-2-recommendations/3549/11)\n    \nBy approving committees, the Token House entered a social contract to entrust and delegate the bulk of decision-making to official committees. However, delegates may vote against the recommendation of official committees but should provide a justification to the community as to why they voted differently.",
            "choices": [
                "For",
                "Against",
                "Abstain"
            ],
            "scores": [
                15037138.311965097,
                46748.2534368667,
                385898.39635395905
            ],
            "start": 1667513358,
            "end": 1668110958,
            "snapshot": "30456637",
            "state": "closed",
            "author": "0x83E54889754e737Fb3CdF07BAaCC0eB9699B6Bdd",
            "space": {
                "id": "opcollective.eth",
                "name": "Optimism Collective"
            }
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/review-gf-phase-1-proposal-angle-protocol/2552",
            "title": "[REVIEW][GF: Phase 1 Proposal] Angle Protocol ",
            "index": 2552,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Governance Fund: Phase 1"
            ],
            "tags": [
                "season-2",
                "passed",
                "cycle-8"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/tuta",
                    "index": "1",
                    "likes": "8",
                    "time": "07/06/2022-15:26:54",
                    "content": "Hi everyone! This is the latest update of the proposal edited by @BlockAdopter from the Angle team. This update takes into account feedback from the delegates. Thank you for your input and for helping us improve this proposal.   Condensed summary of the updated proposal   Angle is applying for a 250k OP tokens grant  250k OP tokens to be distributed over 6 months as follows:   2/4: agEUR - USDC pool on Uniswap V3  1/4: agEUR - OP volatile pool on Velodrome, in the form of bribes  1/4: agEUR - MAI volatile pool on Velodrome, in the form of bribes    More weight to the Uniswap pool as this rewards LPs as opposed to bribes that risk attracting mercenary participants (we changed the distribution following feedback from delegates) Also Velodrome is an Optimism-only platform and this favors the Optimism ecosystem.  Matching incentives: Angle will match the amount of votes obtained on Velodrome using OP from this grant with Angle’s resources (either voting power, either through bribes).  Bonus for contributors on Optimism: Angle to grant 10,000 $Angle tokens to each author of a contribution made to Angle Protocol on Optimism (that is double the rewards offered to contributors on other chains)    Long form proposal (updated)  This is the GF Phase 1 Proposal from the Angle Protocol. The goal is to help push the adoption of agEUR, a robust and decentralized EUR-stablecoin, and its underlying platform Angle on the Optimism network. Project name: Angle Protocol Author name and contact info: @BlockAdopter, can be contacted through Twitter or Discord (TheBlockAdopter | Mariam#7290) or @tuta, can be contacted through Twitter or Discord (tuta#3689). I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: Yes L2 recipient address: 0x3245d3204eeb67afba7b0ba9143e8081365e08a6 Grant category: Governance Fund Phase 1 Is this proposal applicable to a specific committee? [y/n, link to committee] Yes, DeFi Committee Project description (please explain how your project works)**:**Angle is a decentralized and over-collateralized stablecoin protocol that launched agEUR, the leading decentralized EUR stablecoin on Ethereum. Angle Borrowing module works similarly than Maker, with improvements on many aspects: users can borrow stablecoins after depositing tokens as collateral, and get liquidated if the value of this collateral goes below a certain threshold. It is deployed natively on Optimism, allowing users to borrow or get leverage with agEUR against OP, USDC, and wETH. Angle is also planning to offer yield and investment products in the future. Project links:  Website: App 2  Twitter: Angle Protocol  Discord/Discourse/Community: Discord, Discourse  Please include all other relevant links below: Analytics, agEUR dashboard   Additional team member info (please link):Co-founders Discord/Telegram: sogipec#6666 / @pveyrat, Picodes#0368 / @Picodes, gnervo#9112 / @gnervo Please link to any previous projects the team has meaningfully contributed to: NA Relevant usage metrics (TVL, transactions, volume, unique addresses, etc. Optimism metrics preferred; please link to public sources such as Dune Analytics, etc.):  Angle TVL ~$75M, with currently > 300k on Optimism. agEUR total supply > 45M € agEUR daily transaction count > 100 agEUR weekly DEX volume > 30,000,000 agEUR agEUR total transfer volume on-chain > 5B agEUR (includes all types of transactions)  Competitors, peers, or similar projects (please link): Maker QiDAO Frax Liquity Is/will this project be open sourced? Yes, Angle is already open-sourced. Everything can be found in this repository. Optimism native?: Angle Borrowing module has recently been launched natively on Optimism. $agEUR is a native Optimism asset. Angle was originally launched on Ethereum in November 2021. Date of deployment/expected deployment on Optimism: Angle Borrowing module contracts were deployed on Optimism in mid-July 2022. Ecosystem Value Proposition:   What is the problem statement this proposal hopes to solve for the Optimism ecosystem Having a robust and decentralized EUR stablecoin natively on Optimism.  How does your proposal offer a value proposition solving the above problem? agEUR is one the leading decentralized EUR stablecoin on-chain, and can be minted natively on Optimism. Angle also allows users to get leverage on their OP tokens by borrowing agEUR.  Why will this solution be a source of growth for the Optimism ecosystem? Growing agEUR on Optimism is a way to attract all DeFi users which have the EUR as their local currency to the network.  Has your project previously applied for an OP grant? No. Number of OP tokens requested: 250,000 OP Did the project apply for or receive OP tokens through the Foundation Partner Fund?: No If OP tokens were requested from the Foundation Partner Fund, what was the amount?: NA How much will your project match in co-incentives? We will match the grant in incentives with Angle’s own resources. Please see the detail of these co-incentives below. Proposal for token distribution:  How will the OP tokens be distributed?  Here, we lay out a revised proposition for the distribution of the received OP tokens, and a new way for Angle to help push Optimism’s adoption. A) 100% of received OP tokens to be distributed as liquidity incentives, linearly over 6 months between 3 agEUR pools. The 250,000 OP tokens would be distributed linearly over 6 months, for a total of 10,416 OP / week. This distribution would be split between 3 pools as follows:   2/4: agEUR - USDC pool on Uniswap V3 directly, with the option of having LP liquidity managed by @Gamma. (We have by the way created a new UniV3 LP incentivization mechanism detailed here, and we hope to push for a more global adoption on Optimism);  1/4: agEUR - OP volatile pool on Velodrome, in the form of bribes; and  1/4: agEUR - MAI volatile pool on Velodrome, in the form of bribes.  This would amount to:  5208 OP / week in the Uniswap V3 pool, or ~$3,750 at a price of $0.72 / OP; and 2604 OP / week directed to the agEUR - OP and agEUR - MAI Velodrome pools, or ~$1,875 at a price of $0.72 / OP.  This is equivalent to $7,500 x 52 = $390,000 / year distributed on the three pools ($190,000 over the 6 months of the program), or a ~4% APY per pool with $10m in liquidity in all pools over the first 6 months. Depending on where the APY stabilizes, we can expect around $3-4M of $agEUR to be minted on Optimism across these pools. As $OP is now accepted as collateral to mint agEUR on Angle, this creates an interesting opportunity for $OP holders to increase the token liquidity without selling some of their tokens. B) Angle matching distributed $OP incentives on Velodrome Angle will match the amount of votes obtained on Velodrome using OP from this grant with Angle’s resources (either voting power, either through bribes from Angle’s own capital). This means, for example, that with a value of $7500 OP tokens distributed each week, Angle would be voting or bribing with a minimum of $7,500 worth of votes or bribes per week in favor of the agEUR - OP and agEUR - MAI on Velodrome per week. C) Doubling Angle contributions program for Optimism contributions during the span of the $OP incentives. As detailed here, Angle is currently running a program rewarding external contributors with 5000 ANGLE for meaningful contributions. As this is currently under the discretion of the Angle team, we understand that OP tokens shouldn’t be used to reward such contributions. To push Optimism’s adoption, we think it would be a great idea to double these incentives to 10,000 ANGLE when the Angle contributions are made on Optimism. This would require a DAO vote on our side, but we are confident Angle community will be in favor of such a proposal. Please see the top of this post to access a condensed summary of the proposal. ",
                    "links": [
                        "https://gov.optimism.io/u/blockadopter/summary",
                        "https://twitter.com/TheBlockAdopter",
                        "https://gov.optimism.io/u/tuta",
                        "https://twitter.com/thecryptogus",
                        "https://optimistic.etherscan.io/address/0x3245d3204eeb67afba7b0ba9143e8081365e08a6",
                        "https://app.angle.money/#/borrow",
                        "https://twitter.com/AngleProtocol",
                        "https://discord.gg/fNZmqdrM2F",
                        "https://gov.angle.money/",
                        "https://analytics.angle.money/",
                        "https://dune.com/tuta/ageur",
                        "https://oasis.app/",
                        "https://app.mai.finance/",
                        "https://frax.finance/",
                        "https://www.liquity.org/",
                        "https://github.com/AngleProtocol",
                        "https://blog.angle.money/a-new-incentivization-mechanism-for-uniswap-v3-liquidity-8ce32fa611b1",
                        "https://gov.angle.money/t/angle-contributions-program/365",
                        "https://gov.optimism.io/t/voting-cycle-8-roundup/3742/5",
                        "https://gov.optimism.io/t/defi-committee-c-season-2-recommendations/3437/13"
                    ],
                    "GPT-summary": "The post is an update on the GF Phase 1 Proposal from the Angle Protocol, which aims to push the adoption of agEUR, a decentralized EUR-stablecoin, and its underlying platform Angle on the Optimism network. The proposal includes details on the grant requested, the distribution of OP tokens, and the co-incentives offered by Angle. The author explains the project's value proposition and how it solves the problem of having a robust and decentralized EUR stablecoin natively on Optimism. The post also mentions feedback from delegates and the team's response to it.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Interoperability and Scaleability",
                        "Board composition",
                        "Smart contract updates",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.813944611935683
                },
                {
                    "author_link": "https://gov.optimism.io/u/Justin",
                    "index": "2",
                    "likes": "3",
                    "time": "13/06/2022-00:39:43",
                    "content": "A few questions about this proposal: When do you plan to offer your dApp on the Optimism Network? For your liquidity incentives, would it be possible to target Mainnet LPs specifically in order to incentivize a migration of positions to Optimism? As currently written, the suggested OP token distribution provides ranges and does not add up to 100%.  Would it be possible to add clarity to this before it is voted on? Leaving OP tokens with the DAO does not ensure that the tokens will be used to incentivize usage and liquidity.  I would be opposed to that inclusion. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/tuta",
                    "index": "3",
                    "likes": "1",
                    "time": "13/06/2022-09:02:13",
                    "content": "Thanks for your questions. I added the estimated deployment date of July 2022 to the post. It could very well end up being August. I also specified the distribution, and lowered the DAO share from 20 to 10%. The goal here is to align incentives between Angle and Optimism by having skin in the game and involving the DAO into Optimism governance. If the Token House don’t think this is the right way to do so, then we can distribute everything as incentives. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.357142857142857
                },
                {
                    "author_link": "https://gov.optimism.io/u/Cryptoz",
                    "index": "4",
                    "likes": "0",
                    "time": "19/06/2022-11:07:51",
                    "content": "Rewarding LP pools is useless and drives temporary and fake adoption. I don’t see remotely how this proposal will drive adoption of Optimism. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/tuta",
                    "index": "5",
                    "likes": "0",
                    "time": "20/06/2022-10:47:30",
                    "content": "It drives adoption of Optimism (or any network really) in that it brings users and liquidity to the network. As we have seen multiple times, this helps a lot with growth but usually attracts mercenary capital that leaves once incentives dry up (i.e. “fake adoption” indeed). However I think those LPs leave for two reasons: 1) believe the tokens they are farming are worthless, and/or 2) they don’t believe the network in question has the chance to get more adoption than any other competitor. If you believe these LPs think that for Optimism, then I agree Optimism shouldn’t distribute OP incentives to LPs. Personally, I believe what I shared in the message above and hope it’s true:     tuta:  as they are likely to come for the rewards and stay for the quality of the network.   If you have any other alternative to drive Angle & Optimism adoptions together, feel free to share it here. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.032051282051282
                },
                {
                    "author_link": "https://gov.optimism.io/u/Cryptoz",
                    "index": "6",
                    "likes": "0",
                    "time": "20/06/2022-11:21:14",
                    "content": "The problem with liquidity incentives is that they are generally unsustainable and projects need to find new ways to grow and bring liquidity rather then needing liquidity incentives which when they run out the projects dies off. Yes, I bet a lot of the liquidity getting pulled is because people farm worthless projects. The problem though is there is always another project on the same network which will be providing liquidity rewards or a higher APR. So when your project runs out of rewards they will just jump over to the next project and your liquidity will dry up. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.692640692640692
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "7",
                    "likes": "2",
                    "time": "20/06/2022-12:22:23",
                    "content": "I wish all the project focusing mostly on LPer incentive see your comment and understand that LP incentive will not last. Once the incentive is gone, users will be gone too because they came for the reward. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/tuta",
                    "index": "8",
                    "likes": "0",
                    "time": "20/06/2022-16:40:57",
                    "content": "To be honest I think Angle will have a somewhat unique value proposition for Optimism users once it’s deployed there. It will be (I think) the first borrowing based stablecoins protocol on Optimism, issuing agEUR so a EUR-pegged stablecoin. It will also be one of the cheapest way to borrow stablecoins and get leverage on-chain. Thanks to Optimism lower fees, the minimum debt size will be lower than on mainnet, opening the app and its use cases to smaller borrowers. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.425000000000001
                },
                {
                    "author_link": "https://gov.optimism.io/u/SEED_LATAM_Joxes",
                    "index": "9",
                    "likes": "0",
                    "time": "20/06/2022-23:05:32",
                    "content": "Since this proposal is basically encouraging LPs of Angle assets, could you provide more details (do you have any draft?) About which DEXs (and ranges, if applicable) do you plan to encourage liquidity? agEUR with other EUR Stablecoins (sEUR, EURT), or with USD Stablecoins? What is your priority here? Do you also plan to encourage a pair with ETH, OP or your own governance token, ANGLE?. Thank you ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.625
                },
                {
                    "author_link": "https://gov.optimism.io/u/tuta",
                    "index": "10",
                    "likes": "1",
                    "time": "21/06/2022-11:11:58",
                    "content": "Sure. This will likely end up being voted by veANGLE holders on Snapshot, but I think these are the most natural pools to incentivize for Angle, agEUR, and Optimism:  agEUR-USDstable and/or agEUR-EURstable agEUR-ETH agEUR-OP  I don’t have any specific distribution preference between each of those pools though. Maybe a little bit more on ETH and OP ones to compensate for IL?  Ethereum mainnet deployment By the way, we have deployed the Angle Borrow contracts on Ethereum mainnet, and they are accessible from our new app. This is what would be deployed on Optimism. Docs: Borrowing Module Overview - Angle Docs Developers docs: Architecture Overview - Angle Dev Docs (addresses can be found here) Github repo: GitHub - AngleProtocol/angle-borrow: Smart contracts for the Borrowing module of the Angle Protocol ",
                    "links": [
                        "https://docs.angle.money/angle-borrowing-module/borrowing-module",
                        "https://developers.angle.money/borrowing-module-contracts/architecture-overview",
                        "https://developers.angle.money/overview/smart-contracts/mainnet-contracts#borrowing-module",
                        "https://github.com/AngleProtocol/angle-borrow"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.069074675324675
                },
                {
                    "author_link": "https://gov.optimism.io/u/sogipec",
                    "index": "11",
                    "likes": "3",
                    "time": "27/07/2022-15:29:51",
                    "content": "Hey everyone, Pablo from Angle Protocol and co-author with @tuta of the Angle Incentive proposal. I’d like to give some updates about the state of Angle incentive proposal.  Angle Project Update First on Angle and Optimism. The protocol was just deployed on Optimism: it is now possible to borrow agEUR for 0.5% a year on Optimism against ETH and USDC. New collateral types can easily be added so we could technically support OP for instance. Everything happens here and the smart contract addresses can be found here. To start creating flywheel effects, the protocol has seeded a $400k pool with USDC and agEUR on Velodrome and acquired 2m VELO tokens (for $90k) locked for a period of 4 years. agEUR is therefore a liquid Euro stablecoin on Optimism, and it’s now easy and super cheap to get leverage on ETH or on USDC through Angle protocol on Optimism thanks to the seeded agEUR liquidity.  Updates on the proposal Number of OP tokens requested: 250,000 OP We propose to reduce the number of requested OP tokens from 500,000 to 250,000, and leave us the room to apply again for 250,000 additional OP (or what’s necessary then) when we have more evidence of our success. TVL on Optimism: Official announcement has not been made yet but 200k agEUR have already been brought to Optimism, and the protocol has already committed more than $500k to the Optimism ecosystem. How will the OP tokens be distributed? Based on community’s feedback on the proposal, especially about the fact that LPs can be mercenary. Following up on @tuta’s comments, growing liquidity is essential for Angle product to be attractive: otherwise there’s no point in getting leverage on agEUR, and we’ll slowly and smoothly decrease OP rewards so that in the end APY comes mostly from fees of people using the pool to sell agEUR to get leverage or to buy agEUR to repay their debt. What we propose as well is to amend the reward smart contracts to propose a lock to LPs: idea is that LPs which are locked for a certain amount of time (up to 1 year for instance) receive more rewards than those that do not lock. On top of that, to make the distribution clearer, what we propose is the following:  80% for agEUR liquidity on Optimism (spread between Velodrom - agEUR/USDC to start with- and Curve) 20% for bounties and teams building on top of Angle on Optimism  Over what period will the tokens be distributed 1 year How much will the project match in co-incentives The project has already bought some VELO tokens to incentivize liquidity on Optimism. We will keep voting for our Optimism pools with these tokens and make sure that VELO rewards are higher than OP rewards distributed to LPs. Based on the different token prices, we may include some ANGLE rewards to make sure there’s always more than 1$ of non-OP reward for each OP reward that’s distributed. On top of the incentives, should the proposal be successful, we propose to facilitate the adoption of OP on Angle protocol and facilitate the introduction of OP as a collateral to mint agEUR. Angle low interest rates (0.5%) would be the smallest ones possible for people to borrow against OP. This will allow among other things OP holders to mint stablecoins against their OP (rather than having to sell it) or to get leverage on their tokens (using the agEUR-OP liquidity we would be building). ",
                    "links": [
                        "https://developers.angle.money/overview/smart-contracts/optimism",
                        "https://app.velodrome.finance/liquidity/manage?address=0x7866c6072b09539fc0fde82963846b80203d7beb"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.329502734107997
                },
                {
                    "author_link": "https://gov.optimism.io/u/Bobbay_StableLab",
                    "index": "12",
                    "likes": "0",
                    "time": "28/07/2022-09:14:02",
                    "content": "If it was just deployed on optimism. I’d recommend coming back in a couple weeks to see the usage of the protocol. There are some great incentives here, and we appreciate that you have utilized the community feedback to adjust your OP request, but we believe it’s better to apply once the protocol has been alive for a while. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/sogipec",
                    "index": "13",
                    "likes": "0",
                    "time": "28/07/2022-09:46:01",
                    "content": "Definitely, will do then and thanks for your reply! Also might work well in terms of timing since next round will only start on the 8th of September. TVL at the moment is $900k on Optimism by the way. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.05
                },
                {
                    "author_link": "https://gov.optimism.io/u/diligit",
                    "index": "14",
                    "likes": "1",
                    "time": "29/07/2022-12:32:09",
                    "content": "It will be a good idea for the Angle Protocol to re-apply a proposal in voting cycle #6, the Angle Protocol is launched on Optimism, (in that term mentioned in this proposal),     tuta:  By the end of July 2022   the governance funding is aimed at incentivizing projects launched on Optimism, and such incentivization would contribute to the growth of Angle as well as the growth of the Optimism ecosystem. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/Benjamin.lens",
                    "index": "15",
                    "likes": "1",
                    "time": "02/09/2022-06:33:12",
                    "content": "Definitely support this! Love CDPs and Angle is a + for the Optimism community If they get an OP grant, we can also partner with MAI to make a bigger splash on liquidity capture ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/tuta",
                    "index": "16",
                    "likes": "3",
                    "time": "05/09/2022-07:58:07",
                    "content": "Thanks for the support @Benjamin.lens ! We are coming back for voting cycle #6 now that Angle has been deployed on Optimism! The app can be used here to borrow agEUR against OP, USDC, and wETH. You can also check out the analytics (by selecting Optimism on the top right corner), and all the contracts deployed on the rollup. There are potentially some interesting partnerships coming with Angle on Optimism with Gamma, QiDao (MAI), and Liquity (LUSD). Let us know if you think the proposal is ready to move to voting for Cycle#6! @Bobbay_StableLab @OPUser @diligit Ps: I created a dedicated thread on the new Discord channel. ",
                    "links": [
                        "https://analytics.angle.money/#/borrow",
                        "https://developers.angle.money/overview/smart-contracts/optimism",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-angle/2552/15"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 6.2012987012987
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "17",
                    "likes": "0",
                    "time": "05/09/2022-08:33:04",
                    "content": "Hi @tuta Thank you for the tag. Few things:-  change the proposal template to latest one. in the new template summarize the feedback you have got so far. once new season starts, first week is for community feedback so I assume we will see more engagement here from the community. At the end of first week, summarize all the feedback again on the proposal for delegate/committee feedback in second week.  Please find more on the new process here ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.0495867768595035
                },
                {
                    "author_link": "https://gov.optimism.io/u/Benjamin.lens",
                    "index": "18",
                    "likes": "1",
                    "time": "07/09/2022-15:00:24",
                    "content": "Exciting! USDC is cool and all, but what about minting agEUR with MAI   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.8125
                },
                {
                    "author_link": "https://gov.optimism.io/u/tuta",
                    "index": "19",
                    "likes": "1",
                    "time": "12/09/2022-11:11:41",
                    "content": "Thank you for the input! I just updated the proposal, and added DeFi Committee Group C as reviewers. If understood correctly, schedule should be as follows:  Community feedback until September 15th Delegate feedback until September 22nd. Voting until September 28th.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/alexcutlerdoteth",
                    "index": "20",
                    "likes": "2",
                    "time": "12/09/2022-15:48:22",
                    "content": "FWIW: Angle Protocol’s to acquisition and max locking veVELO (4y) demonstrates to me that they are making a long term bet on the Optimism ecosystem and that this isn’t just about a short term liquidity boost. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving positive feedback on proposal",
                        "Author of proposal explaining proposal"
                    ],
                    "Sentiment": 4.875
                },
                {
                    "author_link": "https://gov.optimism.io/u/BP_Gamma",
                    "index": "21",
                    "likes": "2",
                    "time": "13/09/2022-07:20:12",
                    "content": "We also support Angle Protocol’s grant request.  They have their own ve-token model that aims to keep LPs invested even after the OP rewards are gone, and they’ve shown themselves to be a top notch team that can deliver. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal"
                    ],
                    "Sentiment": 7.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/tuta",
                    "index": "22",
                    "likes": "0",
                    "time": "16/09/2022-15:29:20",
                    "content": "Hey everyone, Community feedback looks great overall! Looking forward to hear your final thoughts @OPUser @Gonna.eth @SEED_LATAM_Joxes @MinimalGravitas @ScaleWeb3 . As always, let us know if there is anything. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 6.333333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "23",
                    "likes": "0",
                    "time": "16/09/2022-16:04:45",
                    "content": "Thank you for the tag. I just notice that you have assigned this proposal to Defi Committee C, ideally it should be just DeFi Committee. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/tuta",
                    "index": "24",
                    "likes": "1",
                    "time": "20/09/2022-09:21:10",
                    "content": "Thanks, just updated! Moving the proposal to [REVIEW]. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/tuta",
                    "index": "25",
                    "likes": "0",
                    "time": "22/09/2022-12:53:58",
                    "content": "Hey @OPUser , @ScaleWeb3 and others! Is the proposal finally ready to be moved to a vote? If I remember correctly you have up until today to consider the proposal to be ready for voting in this round. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.333333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "26",
                    "likes": "0",
                    "time": "22/09/2022-13:27:30",
                    "content": "Hey @tuta  Thank you the tag. From defilama, your number to token request is quite high compared to TVL on OP but you have a good TVL on mainnet even in this bear market so with the incentives you might be able to bring some liquidity. I am afraid that most of tvl will be farmers but may be few will stay. Could you provide details on distribution, weekly/daily/day and pair you are targeting Also, do you have any KPI ? goal that you want to achieve ? On co-incentives, I dont think buying token of other project is a co-incentives. What are offering as part of your proposal, that is a co-incentive. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.667857142857143
                },
                {
                    "author_link": "https://gov.optimism.io/u/tuta",
                    "index": "27",
                    "likes": "1",
                    "time": "22/09/2022-13:52:36",
                    "content": "The daily/weekly distribution would entirely depend on the number of pools we incentivize. Getting OP tokens would help us change our Optimism pools. For now, agEUR/USDC in on a volatile Velodrome pool. With OP tokens as incentives, we could move agEUR/USDC to UniswapV3 where liquidity could be much more efficient. Here, additional incentives could be offered to users leveraging Gamma (cc @BP_Gamma) to provide their liquidity. At the same time, we are thinking about creating two new volatile Velodrome pools that would be incentivized with OP tokens:  agEUR/ETH agEUR/OP  This would provide more liquidity to OP, and strenghten agEUR liquidity on Optimism. This is helpful for users wanting to get leverage on their OP tokens through the Angle Borrowing module, one use case that we expect to be especially demanded when the bull market comes back.  KPIs In terms of KPI, this is pretty straightforward for Angle: growing 1) the number of vaults on Optimism, and 2) the agEUR total supply on Optimism. By going into more details, with 200k OP (80% of 250k) of incentives distributed linearly over 6 months, $5M of TVL would be receiving an APY of 8% at current prices. This should be enough to bring around $2-3M of agEUR on Optimism on a stable pool.  Co-incentives In terms of co-incentives, once again we have tokens set aside (5% of the weekly distribution) that could be voted to be distributed as co-incentives on Optimism. As there is no liquidity for ANGLE there yet, this would require to setup a bridge similar to agEUR and build liquidity there, but it is very possible! It would make ANGLE available to smaller users. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.782754010695187
                },
                {
                    "author_link": "https://gov.optimism.io/u/ScaleWeb3",
                    "index": "28",
                    "likes": "1",
                    "time": "22/09/2022-17:00:39",
                    "content": "Hi, thank you for the updated proposal! A EUR stablecoin is a great value-add to DeFi & Optimism and we generally like the possibility of using (shorting) the EUR in DeFi (vs. other USD-denominated stablecoins). Appreciate the qualitative analytics and first traction on Optimism since June, the demonstrated long-term move into the Op ecosystem with locking veVelo, and thinking of optimal liquidity usage on Velo / Uni. 250K Op seems to be a reasonably large amount for the size (marketcap) of Angle & the planned Op distribution over 6 months - mainly focusing on agEUR liquidity which is essential for agEUR usage.     tuta:  In terms of co-incentives, once again we have tokens set aside (5% of the weekly distribution) that could be voted to be distributed as co-incentives on Optimism. As there is no liquidity for ANGLE there yet, this would require to setup a bridge similar to agEUR and build liquidity there, but it is very possible! It would make ANGLE available to smaller users.   We agree, moving (some if not all) token liquidity to l2 should be beneficial for almost all projects as transaction costs don’t eat up purchasing power & execution generally moves up the stack. Co-incentives would make the proposal much stronger and accelerate growth on Optimism. Why can only 5% be distributed to Optimism as co-incentives? Is that a changeable, votable protocol parameter? (We only have 0.4% of votable supply and can’t give you a formal approval to move to Snapshot voting.) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.6686507936507935
                },
                {
                    "author_link": "https://gov.optimism.io/u/tuta",
                    "index": "29",
                    "likes": "1",
                    "time": "23/09/2022-08:54:48",
                    "content": "Thank you for your comment @ScaleWeb3 ! In terms of co-incentives, I should have pointed out that we used $90k of the protocol funds to buy and lock VELO to incentivize agEUR pools with VELO tokens. We plan on keep that going, and be split between the different agEUR pools co-incentivized by OP! This can be seen as co-incentives originally coming from Angle protocol reserves.     ScaleWeb3:  Co-incentives would make the proposal much stronger and accelerate growth on Optimism. Why can only 5% be distributed to Optimism as co-incentives? Is that a changeable, votable protocol parameter?   The 5% of the distribution is what is set aside weekly for temporary programs such as this one. The rest of ANGLE incentives are voted by veANGLE holders on mainnet and distributed between the different gauges. Adding a gauge is a significant process (vote by the DAO + contract deployment), especially when tokens need to be distributed on L2s. Though it is not impossible, the goal of a gauge is definitely not to be temporary which makes it unlikely in this case. Sorry if it may seem uncooperative, but I wouldn’t want to leverage something that I can’t ensure later on. However, adding an ANGLE gauge could make total sense in 6 months if we get this first pocket of tokens approved and it appears interesting for both Optimism and Angle to continue and reinforce the program! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.361979166666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/tuta",
                    "index": "30",
                    "likes": "0",
                    "time": "23/09/2022-15:23:09",
                    "content": "Hey guys, tagging you here for final feedback after the latest comments @SEED_LATAM_Joxes @MinimalGravitas @Gonna.eth ! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5625
                },
                {
                    "author_link": "https://gov.optimism.io/u/Defi_LATAM_axlvaz",
                    "index": "31",
                    "likes": "0",
                    "time": "25/09/2022-23:52:54",
                    "content": "    tuta:  ¿Cómo se distribuirán los tokens OP? 80% para la liquidez de agEUR en Optimism (spread entre Velodrome - agEUR/USDC y Curve). → Esto aumentaría el préstamo de agEUR en Optimism y aumentaría la liquidez de la moneda estable. 20% para recompensas y creación de equipos además de Angle on Optimism, con algo similar al Programa de contribuciones de Angle . → Esto incentivaría al ecosistema de Angle a crecer en Optimism en lugar de en otra red.   You can elaborate on both points, keep in mind that this point is one of the most important when making decisions. You can elaborate more on your incentive program. And in the case of contributors, how are you going to select that they are actually contributing to the ecosystem. Who decides? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/tuta",
                    "index": "32",
                    "likes": "2",
                    "time": "04/10/2022-09:55:54",
                    "content": "We have updated the token distribution after the different feedback we got on the proposal. The original post has been updated, and it is now much more detailed (cc @Defi_LATAM_axlvaz , @OPUser ). Here is what has changed:  How will the OP tokens be distributed?  80% for agEUR liquidity on Optimism (spread between Velodrome - agEUR/USDC and Curve). → This would grow agEUR borrowing on Optimism and increase the stablecoin liquidity. 20% for bounties and teams building on top of Angle on Optimism, with something similar to the Angle Contributions Program. → This would incentivize Angle ecosystem to grow on Optimism rather than on another network.  Here, we lay out a revised proposition for the distribution of the received OP tokens, and a new way for Angle to help push Optimism’s adoption. After reading the comments, we realized that the main issue with the previous proposal was the unclear distribution of received tokens. An 80-20% split with unclear guidelines as to how would either of those would be distributed. This is an attempt to clarify that. A) 100% of received OP tokens to be distributed as liquidity incentives, linearly over 6 months between 3 agEUR pools. The 250,000 OP tokens would be distributed linearly over 6 months, for a total of 10,416 OP / week. This distribution would be split equally between 3 pools:  agEUR - OP volatile pool on Velodrome, in the form of bribes agEUR - MAI volatile pool on Velodrome, in the form of bribes agEUR - USDC pool on Uniswap V3 directly, with the option of having LP liquidity managed by @Gamma. (We have by the way created a new UniV3 LP incentivization mechanism detailed here, and we hope to push for a more global adoption on Optimism).  This would amount to 3,472 OP / week / pool, or ~$3,000 at current prices. This is equivalent to 3,000 x 52 = $156,000 / year distributed on each pool, or a 4% APY per pool with $4m in liquidity each over the first 6 months. Depending on where the APY stabilizes, we can expect around $4-6M of $agEUR to be minted on Optimism across these pools. As $OP is now accepted as collateral to mint agEUR on Angle, this creates an interesting opportunity for $OP holders to increase the token liquidity without selling some of their tokens. B) Matching incentives through our veVELO votes, as is already the case Angle has bought and locked more than $90,000 of VELO (2M tokens) to incentivize agEUR - USDC and agEUR - MAI pools on Optimism. (tx 1, tx 2) The VELO distributed on those pools can be see as a form of co-incentives coming from Angle Protocol. Additionally, all the $OP tokens received by our voting power are not dumped but redistributed in new bribes every week (between 500 and 700 $OP / week currently). Similarly, all the $VELO received by the protocol liquidity used to seed the agEUR-USDC Velodrome pool ($200k agEUR + $200k USDC) are also relocked, increasing our ability to co-incentive the pool alongside $OP tokens. With the received $OP, we would bribe on Velodrome on pools on which we already have voting power and we’ll keep reinvesting all the $OP received as bribes. C) Doubling Angle contributions program for Optimism contributions during the span of the $OP incentives. As detailed here, Angle is currently running a program rewarding external contributors with 5000 ANGLE for meaningful contributions. As this is currently under the discretion of the Angle team, we understand that OP tokens shouldn’t be used to reward such contributions. To push Optimism’s adoption, we think it would be a great idea to double these incentives to 10,000 ANGLE when the Angle contributions are made on Optimism. This would require a DAO vote on our side, but we are confident Angle community will be in favor of such a proposal.  Let us know if you have any feedback, so we can update the proposal in time for Voting #cycle-7  ! Leaving Voting #cycle-7 schedule here as a reminder:  Week 1: Community and Delegate Feedback, until October 6th  Week 2: Committee Review, from October 7th to 13th  Week 3: Voting, from October 14th to 19th   ",
                    "links": [
                        "https://gov.angle.money/t/angle-contributions-program/365/13",
                        "https://blog.angle.money/a-new-incentivization-mechanism-for-uniswap-v3-liquidity-8ce32fa611b1",
                        "https://optimistic.etherscan.io/tx/0xe76a808c6498ee3bbff9d7dad9eca2b33fe68b2b47298de9f39b24d44649b394",
                        "https://optimistic.etherscan.io/tx/0x39f2edc1fc4a2ae0d9b5136747865ea4129aa66b975b5b2499eb48c07eae0b91",
                        "https://gov.angle.money/t/angle-contributions-program/365"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.0491310160427805
                },
                {
                    "author_link": "https://gov.optimism.io/u/sogipec",
                    "index": "33",
                    "likes": "0",
                    "time": "04/10/2022-09:59:57",
                    "content": "I think Angle commitment to Optimism is already greater than most protocols applying for the grant. Also the protocol has an allocation of ANGLE tokens it can use for such incentive programs (on top of everything mentionned by @tuta), so commitments can only be increased from here! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/marc",
                    "index": "34",
                    "likes": "2",
                    "time": "04/10/2022-13:51:37",
                    "content": "hello @tuta and @sogipec , thank you for your proposal and congrats on your Optimism Deployment! Angle Protocols has a unique proposition with its EUR pegged stablecoin, and I am not aware of other protocols doing so on Optimism. I can see since June that you have achieved traction on Optimism and incorporated feedback from other community members and delegates. The incentives have the potential to catalyze a growth, and your ask and time frame now matches that the expectation of the community and delegates. A few notes that will strengthen you proposal:   Be clear on the co-incentives of 5000 ANGLE contributions. If the co-incentives requires a vote, I would encourage you to start the discussion, and submit for a vote in Angle Gov. You can communicate updates on your proposal mentioning that you have started the process.   Be clear on the KPIs that you have set       tuta:  The 1st KPI for the tokens distributed as incentives will be the total agEUR supply on Optimism and the TVL of the related pools. The 2nd KPI will be the number of integrations and external contributions we see popping up for Angle on Optimism.    What is the total increase of agEUR supply and TVL of related pools you expect? What is the increased the number of integrations, and the number of external contributors you expect?  I know it’s not evident to estimate these KPIs, but you can specify your target goals based on the your previous performance, as well as other lending protocols that are currently running incentives. This will both give an idea of your potential to the community and delegates, as well as strength your case for your second proposal in 6 months if you got closer to your goals. Overall, your proposal make sense to Optimism and you have in-cooperated important feedback that was given earlier. I am giving support for Angle’s proposal,  both for its unique proposition  and its previous history to demonstrate traction. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0368589743589745
                },
                {
                    "author_link": "https://gov.optimism.io/u/sogipec",
                    "index": "35",
                    "likes": "2",
                    "time": "04/10/2022-14:35:01",
                    "content": "Thanks for your reply and questions @marc!  As for the co-incentives on contributions, these do not require a vote, and Angle Core Team has a dedicated allocation it can use for this! In terms of KPIs, you’re right to ask us to be more specific:   Total increase of agEUR supply: at least 2m, and for the TVL of the protocol we expect it to increase by around 3.5m to 4m depending on the collateral ratio of users borrowing. Total increase of TVL of related pools: we expect our agEUR-USDC pool to reach at least $2m TVL, and our agEUR-OP and agEUR-MAI to be each $1m. We already support our agEUR-MAI with veVELO votes + OP bribes, so expect it to keep building flywheel effects there. Number of integrations: we’ve already had a vote to get agEUR listed on Aave on Optimism. While this is an important integration, we expect that increased agEUR liquidity on DEXes will help it get integrated in different Perpetual swaps, and used as a treasury asset by DAOs built on Optimism that have European contributors. Overall, we count on having at least 5 integrations unlocked by this grant As for the number of external contributors, this is also something that’s hard to quantify. What we care about as a DAO is the number of active people in the governance, and pushing for Angle integrations. If we manage to get at least 4 active community members from this airdrop, this could greatly help Angle governance make a leap forward.  Should you have other questions, please do not hesitate to ask them! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0913407029478455
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "36",
                    "likes": "2",
                    "time": "04/10/2022-23:24:23",
                    "content": "Hi @tuta , with new changes this proposal look much better. Also, thank you for your engagement. I am looking at the TVL on Optimism, when you launched on Optimism in august your protocol TVL jumped to $2.3M and now its around 200K, a 10X fall in TVL in just 2 months which give me an impression that the liquidity is not sticky or am I missing something here ? With your TVL I believe the token ask and distribution plan has some scope of improvement. My suggestion would be to reduce the number of weekly distribution. Do you know how much of co-incentives we can expect(weekly) from your voting power and protocol owner liquidity. I think $90K worth of Velo locking shows your long term direct vision on velo protocol and indirectly on Optimism which should not be combined with co-incentives of a proposal. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.704545454545454
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "37",
                    "likes": "3",
                    "time": "05/10/2022-00:46:39",
                    "content": "Point of clarification here, not related to Angle’s proposal in particular: Because Velodrome is Optimism’s liquidity hub, a liquidity-based DeFi protocol signaling commitment to Velodrome in this way is in effect signaling direct commitment to Optimism. If you’re spending money on an Optimism-exclusive activity (Velodrome exists only on Optimism) so you can do more things on Optimism past the end of the grant program, and you are bidding up the demand for liquidity (or bidding for control of incentives), you are committing your own resources to ecosystem stimulus over and above what the grant is offering, and you’re doing it in one of the most direct ways possible. Any time a proposal says they’ll co-incentivize liquidity mining on Velo or Uniswap or even their own protocol, they’re actually signaling less commitment to Optimism than something like locking. Why? Because once the liquidity mining is gone, they don’t have anything else to do on Optimism if they don’t want it. If you lock Velo, you are highly incentivized to continue doing things on Optimism. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.77
                },
                {
                    "author_link": "https://gov.optimism.io/u/sogipec",
                    "index": "38",
                    "likes": "0",
                    "time": "05/10/2022-08:36:25",
                    "content": "You’re right to point that liquidity decreased here! We expect it to grow more steadily now for the future as a big fraction of it was mercenary liquidity which was attracted by the boost offered by the Velodrome team. The reason why we expect liquidity to be more sticky in the future is that most of it could stay without token incentives because fee incentives should be enough: having a lot of agEUR liquidity is interesting for people willing to take leverage and short the € or long the € and short the $. You still need two things for that:  more awareness on your product: which we didn’t have among the Optimism community as we launched the protocol. Angle is still the cheapest way to get leverage on any collateral asset at the moment on Optimism enough liquidity for agEUR: to avoid high slippage when swapping from/to agEUR  We expect that the Optimism grant and the OP incentives we’ll place on Velodrome and Uniswap (to not only reward rent seekers who own veVELO but actual users) will help get both of it and start creating flywheel effects around agEUR. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.812471655328798
                },
                {
                    "author_link": "https://gov.optimism.io/u/gs8nrv",
                    "index": "39",
                    "likes": "1",
                    "time": "05/10/2022-08:38:32",
                    "content": "On the TVL side, it is true that the TVL dropped but the number of active position increased back in September. I prefer to have multiple medium holder than larger ones with high stakes and less sticky. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.15
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "40",
                    "likes": "0",
                    "time": "05/10/2022-08:48:22",
                    "content": "    sogipec:  boost offered   This make sense, thank you. I see Angle is also available on Abritrum but very low traction, is it because of lack on incentives ? any insight on these.  With your TVL I believe the token ask and distribution plan has some scope of improvement. My suggestion would be to reduce the number of weekly distribution.   Do you know how much of co-incentives we can expect(weekly) from your voting power and protocol owner liquidity. I think $90K worth of Velo locking shows your long term direct vision on velo protocol and indirectly on Optimism which should not be combined with co-incentives of a proposal.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.791666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/sogipec",
                    "index": "41",
                    "likes": "0",
                    "time": "05/10/2022-08:56:59",
                    "content": "Lack of traction on Arbitrum is due to a lack of integrations and incentives. The protocol is further away in its development on Arbitrum than it is on Optimism. We’ve just created a pool on Arbitrum at the moment without seeking any further because there are less low-hanging fruits there. Sorry forgot to answer your points:  As for the reduction of the weekly distribution, it’s true that we could divide by 2 to distribute everything in 1 year rather than in 6 months. About co-incentives: with the VELO locked and the incentives we are receiving and relocking our re-using to bribe, we are driving about $155k worth of incentives a year to agEUR pools (agEUR-MAI and agEUR-USDC) at the moment. But this is going reinforcing itself since we’re putting everything we have with our PoL  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.898809523809524
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "42",
                    "likes": "0",
                    "time": "05/10/2022-09:17:13",
                    "content": "Thank you, I was not aware of increased position in September. Do you have dashboard where i can validate it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.375
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "43",
                    "likes": "0",
                    "time": "05/10/2022-09:33:47",
                    "content": "Ideally, I am in favor of short distribution duration so instead of stretching it to 1 year i would suggest halving the amount and keep the duration same. Once its over, you can always submit a new proposal. 5K $OP split between 3 pool, your KPI are defined, co-incentives of approx $70K in form ob bribe( for half year) and good liquidity on main net, with all this I think you have a good proposal. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.353535353535353
                },
                {
                    "author_link": "https://gov.optimism.io/u/sogipec",
                    "index": "44",
                    "likes": "2",
                    "time": "05/10/2022-10:45:12",
                    "content": "You can check this here. We’re talking of small amounts here so not sure it’s fully statistically significant. Given the commitment we’ve made so far (VELO acquisition, PoL invested), and the fact that not all of it will be OP bribes (also UniV3 LP incentivization with our new incentivization mechanism), I’d be very much incline towards keeping the $150k request. So I suggest to hear feedback from others and if everyone recommends halving the amount, then let’s reduce it! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.363636363636363
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "45",
                    "likes": "1",
                    "time": "05/10/2022-11:40:45",
                    "content": "Yes, that is indeed a better approach, lets wait for few more feedback. I would also like to hear others opinion on how you are going back to velo acquisition as a co-incentives. Should we consider B2B and Protocol-to-Protocol partnership as a co-incentives. I agree that it reflect your long term vision on Optimism and Velo protocol but its not a proposal co-incentives. Both should not be mixed. Like I said earlier, co-incentives are what you are willing to offer as part of your proposal and in this case it would be amount of bribe going towards the pool to boost the liquidity. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://gov.optimism.io/u/picodes",
                    "index": "46",
                    "likes": "0",
                    "time": "05/10/2022-17:12:41",
                    "content": "Hi! Picodes from Angle community. @OPUser would it be better if we committed to match the OP incentives we’ll distribute with our own ressources ? Although in the end it shouldn’t change much as these ressources will likely be our veVELO voting power ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.625
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "47",
                    "likes": "0",
                    "time": "05/10/2022-17:53:55",
                    "content": "Hi @picodes  yes please. Its totally Angle’s team call how they want to match the co-incentives, my request is that it should be clear. How the co-incentives will look like and how much ? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "48",
                    "likes": "0",
                    "time": "06/10/2022-02:31:20",
                    "content": "can you please define what is important about co-incentives and what the ideal form of co-incentive is? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "49",
                    "likes": "0",
                    "time": "06/10/2022-05:51:37",
                    "content": "I have mentioned this two time in this thread already but copying one more time.     OPUser:  Like I said earlier, co-incentives are what you are willing to offer as part of your proposal and in this case it would be amount of bribe going towards the pool to boost the liquidity.   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "50",
                    "likes": "0",
                    "time": "06/10/2022-14:16:30",
                    "content": "This doesn’t answer my question. What I’m asking is a set of general questions:   why are co-incentives important   what is their ideal form, and why   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 7.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/ScaleWeb3",
                    "index": "51",
                    "likes": "3",
                    "time": "12/10/2022-12:13:10",
                    "content": "As mentioned in one of our earlier comments, we are supportive of this proposal due to the value-add of a EUR stablecoin, reasonable ask & usage of funds to bootstrap required liquidity. Re co-incentives: To spur growth on Optimism, and especially attract liquidity, token incentives are an appropriate measure. As co-growth initiatives should help the growth of projects & Optimism, it is only fair to ask for incentives from both sides.  If a large marketcap project on Eth l1 just asks for free funds for its current users & potentially a few more APY hunters, we don’t see long-term alignment, no sustainable onboarding to Optimism; colloquially said “a very one-sided, short-sighted, not aligned proposal” If a smaller project can’t match incentives but may be able to add innovative tech to Optimism or help with user onbaording, we wouldn’t make co-incentives a hard requirement & rather see them as bonus. Bribing, marketing & other forms of support can ofc also be seen as co-incentives - hence it depends very much on the proposal what the optimal co-incentives are.  That said, it’s always good to have clear outlook on co-incentives to assess a proposal. We hope (expect) proposers can (to) clarify the amount of co-incentives with their community before moving a proposal to the voting stage in the future. PS: We would rephrase this part of the proposal as you bought veVELO and match incentives with your votes/bribes and offer the “Doubling Angle contributions program for Optimism contributions”.     tuta:  How much will your project match in co-incentives? (not required but recommended, when applicable): No co-incentive program planned yet, but if this proposal is approved, Angle DAO could very well start a governance process to allocate ANGLE tokens on some Angle Optimism pools.   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.98652380952381
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "52",
                    "likes": "0",
                    "time": "12/10/2022-12:20:01",
                    "content": "@OPUser is this your exact view as well? Because when I respond to this I want to make sure I’m addressing both of you ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://gov.optimism.io/u/BlockAdopter",
                    "index": "53",
                    "likes": "4",
                    "time": "14/10/2022-16:48:45",
                    "content": "Hi everyone! @BlockAdopter from Angle Protocol here. Please find below our updated proposal. This update takes into account feedback from the delegates. Thank you for your input and for helping us improve this proposal.  Condensed summary of the updated proposal    Angle is applying for a 250k OP tokens grant   250k OP tokens to be distributed over 6 months as follows:   2/4: agEUR - USDC pool on Uniswap V3  1/4: agEUR - OP volatile pool on Velodrome, in the form of bribes  1/4: agEUR - MAI volatile pool on Velodrome, in the form of bribes    More weight to the Uniswap pool as this rewards LPs as opposed to bribes that risk attracting mercenary participants (we changed the distribution following feedback from delegates)   Also Velodrome is an Optimism-only platform and this favors the Optimism ecosystem.   Matching incentives: Angle will match the amount of votes obtained on Velodrome using OP from this grant with Angle’s resources (either voting power, either through bribes).   Bonus for contributors on Optimism: Angle to grant 10,000 $Angle tokens to each author of a contribution made to Angle Protocol on Optimism (that is double the rewards offered to contributors on other chains)      Long form proposal (updated)  This is the GF Phase 1 Proposal from the Angle Protocol. The goal is to help push the adoption of agEUR, a robust and decentralized EUR-stablecoin, and its underlying platform Angle on the Optimism network. Project name: Angle Protocol Author name and contact info: @BlockAdopter, can be contacted through Twitter or Discord (TheBlockAdopter | Mariam#7290) or @tuta, can be contacted through Twitter or Discord (tuta#3689). I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: Yes L2 recipient address: 0x3245d3204eeb67afba7b0ba9143e8081365e08a6 Grant category: Governance Fund Phase 1 Is this proposal applicable to a specific committee? [y/n, link to committee] Yes, DeFi Committee Project description (please explain how your project works)**:**Angle is a decentralized and over-collateralized stablecoin protocol that launched agEUR, the leading decentralized EUR stablecoin on Ethereum. Angle Borrowing module works similarly than Maker, with improvements on many aspects: users can borrow stablecoins after depositing tokens as collateral, and get liquidated if the value of this collateral goes below a certain threshold. It is deployed natively on Optimism, allowing users to borrow or get leverage with agEUR against OP, USDC, and wETH. Angle is also planning to offer yield and investment products in the future. Project links:  Website: App 2  Twitter: Angle Protocol  Discord/Discourse/Community: Discord, Discourse  Please include all other relevant links below: Analytics, agEUR dashboard   Additional team member info (please link):Co-founders Discord/Telegram: sogipec#6666 / @pveyrat, Picodes#0368 / @Picodes, gnervo#9112 / @gnervo Please link to any previous projects the team has meaningfully contributed to: NA Relevant usage metrics (TVL, transactions, volume, unique addresses, etc. Optimism metrics preferred; please link to public sources such as Dune Analytics, etc.):  Angle TVL ~$75M, with currently > 300k on Optimism. agEUR total supply > 45M € agEUR daily transaction count > 100 agEUR weekly DEX volume > 30,000,000 agEUR agEUR total transfer volume on-chain > 5B agEUR (includes all types of transactions)  Competitors, peers, or similar projects (please link): Maker QiDAO Frax Liquity Is/will this project be open sourced? Yes, Angle is already open-sourced. Everything can be found in this repository. Optimism native?: Angle Borrowing module has recently been launched natively on Optimism. $agEUR is a native Optimism asset. Angle was originally launched on Ethereum in November 2021. Date of deployment/expected deployment on Optimism: Angle Borrowing module contracts were deployed on Optimism in mid-July 2022. Ecosystem Value Proposition:   What is the problem statement this proposal hopes to solve for the Optimism ecosystem Having a robust and decentralized EUR stablecoin natively on Optimism.  How does your proposal offer a value proposition solving the above problem? agEUR is one the leading decentralized EUR stablecoin on-chain, and can be minted natively on Optimism. Angle also allows users to get leverage on their OP tokens by borrowing agEUR.  Why will this solution be a source of growth for the Optimism ecosystem? Growing agEUR on Optimism is a way to attract all DeFi users which have the EUR as their local currency to the network.  Has your project previously applied for an OP grant? No. Number of OP tokens requested: 250,000 OP Did the project apply for or receive OP tokens through the Foundation Partner Fund?: No If OP tokens were requested from the Foundation Partner Fund, what was the amount?: NA How much will your project match in co-incentives? We will match the grant in incentives with Angle’s own resources. Please see the detail of these co-incentives below. Proposal for token distribution:  How will the OP tokens be distributed?  Here, we lay out a revised proposition for the distribution of the received OP tokens, and a new way for Angle to help push Optimism’s adoption. A) 100% of received OP tokens to be distributed as liquidity incentives, linearly over 6 months between 3 agEUR pools. The 250,000 OP tokens would be distributed linearly over 6 months, for a total of 10,416 OP / week. This distribution would be split between 3 pools as follows:   2/4: agEUR - USDC pool on Uniswap V3 directly, with the option of having LP liquidity managed by @Gamma. (We have by the way created a new UniV3 LP incentivization mechanism detailed here, and we hope to push for a more global adoption on Optimism);  1/4: agEUR - OP volatile pool on Velodrome, in the form of bribes; and  1/4: agEUR - MAI volatile pool on Velodrome, in the form of bribes.  This would amount to:  5208 OP / week in the Uniswap V3 pool, or ~$3,750 at a price of $0.72 / OP; and 2604 OP / week directed to the agEUR - OP and agEUR - MAI Velodrome pools, or ~$1,875 at a price of $0.72 / OP.  This is equivalent to $7,500 x 52 = $390,000 / year distributed on the three pools ($190,000 over the 6 months of the program), or a ~4% APY per pool with $10m in liquidity in all pools over the first 6 months. Depending on where the APY stabilizes, we can expect around $3-4M of $agEUR to be minted on Optimism across these pools. As $OP is now accepted as collateral to mint agEUR on Angle, this creates an interesting opportunity for $OP holders to increase the token liquidity without selling some of their tokens. B) Angle matching distributed $OP incentives on Velodrome Angle will match the amount of votes obtained on Velodrome using OP from this grant with Angle’s resources (either voting power, either through bribes from Angle’s own capital). This means, for example, that with a value of $7500 OP tokens distributed each week, Angle would be voting or bribing with a minimum of $7,500 worth of votes or bribes per week in favor of the agEUR - OP and agEUR - MAI on Velodrome per week. C) Doubling Angle contributions program for Optimism contributions during the span of the $OP incentives. As detailed here, Angle is currently running a program rewarding external contributors with 5000 ANGLE for meaningful contributions. As this is currently under the discretion of the Angle team, we understand that OP tokens shouldn’t be used to reward such contributions. To push Optimism’s adoption, we think it would be a great idea to double these incentives to 10,000 ANGLE when the Angle contributions are made on Optimism. This would require a DAO vote on our side, but we are confident Angle community will be in favor of such a proposal. Please see the top of this post to access a condensed summary of the proposal. ",
                    "links": [
                        "https://gov.optimism.io/u/blockadopter/summary",
                        "https://twitter.com/TheBlockAdopter",
                        "https://gov.optimism.io/u/tuta",
                        "https://twitter.com/thecryptogus",
                        "https://optimistic.etherscan.io/address/0x3245d3204eeb67afba7b0ba9143e8081365e08a6",
                        "https://app.angle.money/#/borrow",
                        "https://twitter.com/AngleProtocol",
                        "https://discord.gg/fNZmqdrM2F",
                        "https://gov.angle.money/",
                        "https://analytics.angle.money/",
                        "https://dune.com/tuta/ageur",
                        "https://oasis.app/",
                        "https://app.mai.finance/",
                        "https://frax.finance/",
                        "https://www.liquity.org/",
                        "https://github.com/AngleProtocol",
                        "https://blog.angle.money/a-new-incentivization-mechanism-for-uniswap-v3-liquidity-8ce32fa611b1",
                        "https://gov.angle.money/t/angle-contributions-program/365"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None"
                    ],
                    "Sentiment": 5.884599967933301
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "54",
                    "likes": "4",
                    "time": "14/10/2022-21:01:16",
                    "content": "Hi @BlockAdopter thank you for the changes. This look much better. Dont forget to update the proposal and get two delegate approval before second week of next cycle. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "55",
                    "likes": "4",
                    "time": "19/10/2022-15:16:16",
                    "content": "I am an Optimism delegate [ Delegate Commitments - #136 by jackanorak Delegate Commitments - #136 by jackanorak ] with sufficient voting power and I believe this proposal is ready to move to a vote. ",
                    "links": [
                        "https://gov.optimism.io/t/voting-cycle-8-roundup/3742/5"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/MoneyManDoug",
                    "index": "56",
                    "likes": "4",
                    "time": "19/10/2022-15:28:59",
                    "content": "As an Optimism delegate with voting power above the required threshold I believe this proposal is ready. Delegate Commitments - #71 by MoneyManDoug ",
                    "links": [
                        "https://gov.optimism.io/t/voting-cycle-8-roundup/3742/5"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/marc",
                    "index": "57",
                    "likes": "2",
                    "time": "25/10/2022-09:42:11",
                    "content": "hey Angle, thank you for incorporating feedback. This looks much better. Don’t forget to change your tag from #cycle-7 to #cycle-8 if you plan on moving to the next cycle. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/BlockAdopter",
                    "index": "58",
                    "likes": "1",
                    "time": "25/10/2022-12:33:10",
                    "content": "Thnak you @marc for your feedback! The tag is changed to #cycle-8 and the proposal listed in the Round-up post for Cycle 8. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "59",
                    "likes": "5",
                    "time": "02/11/2022-20:57:40",
                    "content": "Recommendation from DeFi committee C Details This proposal focuses its efforts on liquidity mining, indicating its approach to boost capital in its stablecoin, agEUR, in order for it to be better used by users and protocols. Targets such as expected blocked capital and spending plan to achieve it are properly detailed therein. Value-Add Crypto is heavily focused on USD pegged stablecoins. Angle’s agEUR is a proven, overcollateralized, EUR-pegged stablecoin. Angle offers OP as one of the collateral options. The proposal can achieve more liquidity for agEUR, another place to use OP and can consequently help users as well as OP protocols that want to leverage another currency than USD. Traction Forex currencies have relatively low adoption/traction outside of Ethereum. Angle has 70M TVL on Ethereum and small TVL on Optimism. Most TVL is in USDC (due to long USD, short EUR trading strategy) and more collaterals are onboarded but less used so far. Amount Very reasonable Ask. Angle is applying for a 250k OP tokens grant over 6 months. One half will be allocated to agEUR - USDC pool on UniV3 using Gamma as liquidity manager and other half to bribing agEUR - OP and agEUR - MAI pools on Velodrome. Co-incentives Angle will match the amount of votes obtained on Velodrome using OP from this grant with Angle’s resources. Also, Angle will allocate ANGLE tokens for contributors that can bring value in any way on Optimism (content, dashboards, documentation). Alignment Angle is multi-chain without a special preference for Optimism but its integrated to other protocol on Optimism. Recommendation :- YES Our past recommendation is available on committee recommendation thread ",
                    "links": [
                        "https://gov.optimism.io/t/defi-committee-c-season-2-recommendations/3437",
                        "https://gov.optimism.io/t/gfx-labs-delegate-communication-thread/2728/19",
                        "https://gov.optimism.io/t/defi-committee-c-season-2-recommendations/3437/13"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.378428571428572
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "60",
                    "likes": "0",
                    "time": "03/11/2022-20:12:51",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "61",
                    "likes": "0",
                    "time": "03/11/2022-20:50:07",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "62",
                    "likes": "3",
                    "time": "09/11/2022-13:41:34",
                    "content": "Very happy to see a Euro-based stablecoin project do a proposal and happy to go with committee recomendation here and vote FOR.     OPUser:  Details This proposal focuses its efforts on liquidity mining, indicating its approach to boost capital in its stablecoin, agEUR, in order for it to be better used by users and protocols. Targets such as expected blocked capital and spending plan to achieve it are properly detailed therein. Value-Add Crypto is heavily focused on USD pegged stablecoins. Angle’s agEUR is a proven, overcollateralized, EUR-pegged stablecoin. Angle offers OP as one of the collateral options. The proposal can achieve more liquidity for agEUR, another place to use OP and can consequently help users as well as OP protocols that want to leverage another currency than USD. Traction Forex currencies have relatively low adoption/traction outside of Ethereum. Angle has 70M TVL on Ethereum and small TVL on Optimism. Most TVL is in USDC (due to long USD, short EUR trading strategy) and more collaterals are onboarded but less used so far. Amount Very reasonable Ask. Angle is applying for a 250k OP tokens grant over 6 months. One half will be allocated to agEUR - USDC pool on UniV3 using Gamma as liquidity manager and other half to bribing agEUR - OP and agEUR - MAI pools on Velodrome. Co-incentives Angle will match the amount of votes obtained on Velodrome using OP from this grant with Angle’s resources. Also, Angle will allocate ANGLE tokens for contributors that can bring value in any way on Optimism (content, dashboards, documentation). Alignment Angle is multi-chain without a special preference for Optimism but its integrated to other protocol on Optimism.   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.708428571428572
                },
                {
                    "author_link": "https://gov.optimism.io/u/SEED_LATAM_Joxes",
                    "index": "63",
                    "likes": "1",
                    "time": "11/11/2022-03:28:02",
                    "content": "Voted: For Following our own recommendations, forex currencies is a space worth pushing for diversity in  Optimism ecosystem. Additionally, Angle’s track record is valuable so far, so the next steps are how to further grow the DeFi scene in Europe to catalyze this opportunity. Good luck! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.3392857142857135
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "64",
                    "likes": "0",
                    "time": "14/11/2022-16:35:25",
                    "content": "Snapshot vote - passed ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "65",
                    "likes": "0",
                    "time": "14/11/2022-16:35:59",
                    "content": "@tuta can you provide a Telegram handle or other contact method so the Optimism team can get in touch about paying out this grant! Feel free to comment on this thread, DM, or email palash@optimism.io ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.609375
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "66",
                    "likes": "0",
                    "time": "14/11/2022-16:36:19",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "79"
}