{
    "poll_list": [
        {
            "id": "0x0a184f7fd0042e9e33ee545d0316b4d382f302a75806394e67dee4249b7dbd04",
            "title": "Season 2: Cycle 8: PoolTogether ",
            "discussion": "https://gov.optimism.io/t/review-gf-phase-1-pooltogether/3747",
            "body": "This Governance Fund Phase 1 proposal is eligible for voting in Cycle 8. This is the last Voting Cycle of Season 2. \n\nThis proposal was reviewed by [DeFi Committee C.](https://gov.optimism.io/t/defi-committee-c-season-2-recommendations/3437/14?u=lavande) You can find committee recommendations below:\n[DeFi Committee C Recommendations](https://gov.optimism.io/t/defi-committee-c-season-2-recommendations/3437/14?u=lavande)\n\nShadow DeFi Committee B is not an official committee but posts their own recommendations here: [https://gov.optimism.io/t/defi-shadow-committee-season-2-recommendations/3549/11](https://gov.optimism.io/t/defi-shadow-committee-season-2-recommendations/3549/11)\n    \n By approving committees, the Token House entered a social contract to entrust and delegate the bulk of decision-making to official committees. However, delegates may vote against the recommendation of official committees but should provide a justification to the community as to why they voted differently.",
            "choices": [
                "For",
                "Against",
                "Abstain"
            ],
            "scores": [
                11828772.359385662,
                1462043.952083625,
                2405489.7035967163
            ],
            "start": 1667513507,
            "end": 1668111107,
            "snapshot": "30456637",
            "state": "closed",
            "author": "0x83E54889754e737Fb3CdF07BAaCC0eB9699B6Bdd",
            "space": {
                "id": "opcollective.eth",
                "name": "Optimism Collective"
            }
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/review-gf-phase-1-pooltogether/3747",
            "title": "[Review] [GF: Phase 1] PoolTogether ",
            "index": 3747,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Governance Fund: Phase 1"
            ],
            "tags": [
                "season-2",
                "passed",
                "cycle-8"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/Leighton",
                    "index": "1",
                    "likes": "9",
                    "time": "21/10/2022-18:37:14",
                    "content": "Project name: PoolTogether Author name and contact info: Leighton Cusack // PoolTogether Inc (@lay2000lbs on Telegram) I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: Yes L2 recipient address: 0xfB0dADb835fAdE151aBf6780BeAfB12FC5BA0e1F Which Voting Cycle are you applying for?: Cycle 8 Grant category: Governance Fund Phase 1 Is this proposal applicable to a specific committee? DeFi Committee Group A or C  Project description (please explain how your project works): PoolTogether is a global savings account with super powers. It’s a DeFi protocol enabling anyone to deposit and save funds while having the chance to win thousands of dollars in prizes every day. Even if they don’t win, they keep all their money and can withdraw at any time. This is possible because prizes are made up of the interest that accrues on all deposited funds. Users deposit into the network, yield accrues on all deposits, and that yield is randomly awarded as prizes. The protocol was built by PoolTogether Inc and is now controlled by the community of POOL token holders.  Project links:   Website: https://pooltogether.com   Twitter: https://twitter.com/PoolTogether_   Discord/Discourse/Community: Discord, Governance Forum   Please include all other relevant links below:  App User Documentation Developer Documentation Github Smart Contract List Tools  Pool Explorer (Community-built)     Additional team member info (please link): The protocol was originally developed by PoolTogether Inc. The co-founders of that company are listed below:  Leighton Cusack Brendan Asselstine Chuck Bergeron  As of today, there are many other contributors to the protocol too numerous to list. Importantly, since the protocol is non-custodial and decentralized, no company or contributors (or even POOL token holders) have any control over user deposits.  Please link to any previous projects the team has meaningfully contributed to: Primary contributions of the team listed above have been to the The PoolTogether protocol. The protocol is one of the first and most widely used DeFi applications since 2019.  Relevant usage metrics (TVL, transactions, volume, unique addresses, etc. Optimism metrics preferred; please link to public sources such as Dune Analytics, etc.): Optimism Metrics  $35,535,642 TVL 19,000+ current unique depositors 1,200+ current unique prize winners  Relevant Dashboards:   OP DeFi Activity (Dune)  PoolTogether Optimism Analysis (Dune)  PoolTogether Weekly Stats (Dune)  PoolStats.xyz(Community-built)  Optimism Usage Statistics (Orbiter.Finance)   Competitors, peers, or similar projects (please link): PoolTogether has no direct competitor or similar projects. You could consider Aave to be a similar project but using Aave directly does not offer the return variance of PoolTogether.  Is/will this project be open sourced? Yes, PoolTogether is open source. You can find all code on Github.  Optimism native? No, the PoolTogether protocol is Ethereum native. However, 77% of all deposits and the majority of all depositors are on Optimism. Additionally, all major marketing efforts are centered around growing PoolTogether on, and onboarding users to, the Optimism network. The PoolTogether community is fully value-aligned and dedicated to Optimism’s cause.  Date of deployment/expected deployment on Optimism: July 8th, 2022  Ecosystem Value Proposition:  What is the problem statement this proposal hopes to solve for the Optimism ecosystem? The Optimism ecosystem needs a simple, secure, and compelling on-ramp. That on-ramp is PoolTogether. PoolTogether is a proven protocol that is fun and financially healthy to use. It’s been recognized by leaders in the Ethereum community. Decentralized Finance can be complicated and inaccessible; PoolTogether opens the doors. After learning through PoolTogether, users can more confidently experience other DeFi protocols in the Optimism ecosystem.  How does your proposal offer a value proposition solving the above problem? PoolTogether is the best way to onramp users into the Optimism ecosystem. The protocol applies to beginners as well as to experienced users and provides a secure and accessible entry point to Decentralized Finance. It is one of the few protocols live on the Optimism network that allows for returns without the risk of impermanent loss, the use of derivatives, or pooling funds exposed to bridge risk. As a prize savings protocol, PoolTogether is ultimately designed to be a public good. It’s a global savings account run by its users. It’s a financial instrument that’s proven to direct money away from wealth-destroying mechanisms and help people become financially healthy.  Why will this solution be a source of growth for the Optimism ecosystem? PoolTogether has already proven to be one of the most popular apps on Optimism. Currently there are over 18,000 unique depositors and the protocol is #7 for total TVL on Optimism. Since PoolTogether is built on external yield sources, PoolTogether’s growth directly contributes to AAVE’s TVL on Optimism as well as improved liquidity for borrowers. The protocol is aligned with Optimism’s public goods vision and is uniquely positioned to grow the ecosystem in a sustainable way. Prize Savings is a global industry with >$100 billion deposited in TradFi products. Prize Savings is also a concept that works a lot better on the blockchain than it does in the fiat world. PoolTogether will be the first breakout consumer DeFi application.  Has your project previously applied for an OP grant? PoolTogether Inc has previously requested and received 450,000 $OP tokens through the Foundation Partner Fund to be distributed as user incentives for using the PoolTogether protocol. These OP tokens were effectively used to grow PoolTogether to $35 million in deposits and 18,000 unique active depositors. This makes PoolTogether one of the most popular apps on Optimism. Additionally, Optimism has become the main network PoolTogether is used on, with over 70% of all network deposits being on Optimism. The initial 450,000 $OP distribution happened in three phases, while the third phase is still ongoing until November 15th. You can find a detailed grant update here. Notably, PoolTogether has exceeded the success benchmarks of Foundation grant which was $25 million in deposits and 10,000+ unique depositors.  Number of OP tokens requested: 550,000 $OP  Did the project apply for or receive OP tokens through the Foundation Partner Fund?: The initial allocation outlined above of 450,000 $OP was received via the foundation partner fund.  If OP tokens were requested from the Foundation Partner Fund, what was the amount?: 450,000 $OP  How much will your project match in co-incentives? (not required but recommended, when applicable): The PoolTogether protocol continues to provide co-incentives in the form of additional USDC that is being distributed as prizes above the yield that is generated. In other words, assuming $1,000 in USDC yield is generated on deposits, $1,500 will be distributed as prizes, with the additional USDC coming from the PoolTogether protocol treasury. The amount of subsidy is variable depending on POOL governance but historically has amounted to $500 - $2,000 per day in additional subsidy. In addition, the PoolTogether Grants Team is actively looking to fund grants from team and community members who are expanding PoolTogether on Optimism  Proposal for token distribution:  How will the OP tokens be distributed?  70% will be distributed directly to PoolTogether depositors on Optimism over 19 weeks 20% will be reserved for teams/projects that build new PoolTogether UIs that leverage core features of the protocol on Optimism 10% will be distributed to projects that directly integrate PoolTogether on Optimism   Over what period of time will the tokens be distributed for each initiative? 380,000 of the user rewards will be distributed over a period of 19 weeks at the rate of 20,000 tokens per week to all Optimism depositors. This represents a 28% reduction in the current $OP distribution rate. The goal of this step is to keep incentivizing the growth momentum on Optimism while tapering off special incentives. 19 additional weeks will reach until March 28th 2023 when distribution can be re-evaluated. The remaining 170,000 $OP tokens will be used for building on Optimism in two primary ways. The first is to encourage builders to create Optimism specific on-boarding tools and websites to the protocol. The second is to fund yield source integrations with other Optimism yield sources. All of these things ensure Optimism will continue to grow and be the primary interaction point of the PoolTogether protocol.  Please list the milestones/KPIs you expect to achieve for each initiative, considering how each relates to incentivizing sustainable usage and liquidity on Optimism. Please keep in mind that progress towards these milestones/KPIs should be trackable. All KPIs outlined in our first grant have been exceeded. We aim to again exceed these and drive more growth to Optimism. The grant will be a success if  PoolTogether on Optimism grows current TVL from $35 million to $40 million while reducing $OP incentives by ~30% Total unique depositors grow to ≥ 30,000 Optimism remains PoolTogether’s prize pool with the highest TVL At least 1 alternative user interface is in production At least 1 yield source integrates with the protocol   Why will incentivized users and liquidity on Optimism remain after incentives dry up? PoolTogether remains the front door to DeFi on Optimism. Thus far, PoolTogether usage on Optimism has shown to be broad based and sticky. Even without the $OP incentives, Optimism depositors will still be enjoying the prizes! As PoolTogether grows, it gets better. When PoolTogether reaches $200 million in TVL the weekly prizes will be over $100K. The more deposited into PoolTogether, the more attractive PoolTogether becomes. The protocol is designed to create a reinforcing growth loop. ",
                    "links": [
                        "https://gov.optimism.io/t/draft-so2-committee-proposal-defi-group-c/3320/106",
                        "https://pooltogether.com",
                        "https://twitter.com/PoolTogether_",
                        "https://pooltogether.com/discord",
                        "https://gov.pooltogether.com/",
                        "https://app.pooltogether.com/deposit?network=optimism",
                        "https://docs.pooltogether.com/",
                        "https://dev.pooltogether.com/",
                        "https://github.com/pooltogether",
                        "https://dev.pooltogether.com/protocol/deployments/mainnet#optimism",
                        "https://tools.pooltogether.com/",
                        "https://poolexplorer.win/",
                        "https://twitter.com/lay2000lbs",
                        "https://twitter.com/b_asselstine",
                        "https://twitter.com/ChuckBergeron",
                        "https://optimistic.etherscan.io/token/0x62bb4fc73094c83b5e952c2180b23fa7054954c4",
                        "https://optimistic.etherscan.io/token/0x62bb4fc73094c83b5e952c2180b23fa7054954c4",
                        "https://dune.com/gandalfsdad/pt-weeklystats",
                        "https://dune.com/pooltogether/op-defi-activity",
                        "https://dune.com/pooltogether/optimism-analysis",
                        "https://dune.com/pooltogether/weeklystats",
                        "https://poolstats.xyz/?chain=op",
                        "https://www.orbiter.finance/dataDetail?nav=Dapps",
                        "https://github.com/pooltogether",
                        "https://pooltogether.mirror.xyz/LYjoXuD4krG-1NY_hTJYMmdkNjxFd6wqvG7hTVzcXOs",
                        "https://twitter.com/VitalikButerin/status/1278337661988716547",
                        "https://medium.com/pooltogether/the-power-of-no-loss-prize-savings-1f006503f64",
                        "https://defillama.com/chain/Optimism",
                        "https://dune.com/gandalfsdad/pt-weeklystats",
                        "https://poolstats.xyz/",
                        "https://gov.optimism.io/t/pooltogether-grant-update/3531",
                        "https://gov.optimism.io/t/defi-committee-c-season-2-recommendations/3437/14",
                        "https://gov.optimism.io/t/voting-cycle-8-roundup/3742/9",
                        "https://gov.optimism.io/t/gfx-labs-delegate-communication-thread/2728/19"
                    ],
                    "GPT-summary": "The post is a proposal for a grant from the Optimism Foundation for the PoolTogether protocol. The author explains how the protocol works and how it can be an on-ramp for users into the Optimism ecosystem. The post includes relevant metrics and links to the project's website and social media accounts. A 3rd party gives entirely positive feedback on the proposal, extending to the proposal and advertising it. There are no negative feedback or constructive criticism given, and no collaboration or auditing/reviewing of the proposal mentioned.",
                    "GPT-proposal-categories": [
                        "Interoperability and Scalability",
                        "Grants, Funding and Resource Allocation",
                        "Community and Engagement",
                        "Token Economics",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.9191391264562
                },
                {
                    "author_link": "https://gov.optimism.io/u/Noxe",
                    "index": "2",
                    "likes": "6",
                    "time": "21/10/2022-18:52:30",
                    "content": "PoolTogether is the best DeFi protocol to onboard new users. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.840909090909091
                },
                {
                    "author_link": "https://gov.optimism.io/u/Netrim",
                    "index": "3",
                    "likes": "3",
                    "time": "21/10/2022-23:27:54",
                    "content": "Hi Leighton, nice written proposal. I think the proposal would be stronger taking out the second part of the ask:     Leighton:   20% will be reserved for teams/projects that build new PoolTogether UIs that leverage core features of the protocol on Optimism    Having said that, I would like to see a bigger focus on the integration of new revenue sources which would drive organic usage and less focus on distribution to depositors. Maybe go for 50/50 on this part. Currently you could have integrated AAVE only, correct? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.441287878787879
                },
                {
                    "author_link": "https://gov.optimism.io/u/Defi_LATAM_axlvaz",
                    "index": "4",
                    "likes": "4",
                    "time": "22/10/2022-08:45:15",
                    "content": "Hey @Leighton  good to see PoolTogether back here and show the performance of the latest grants. In Latin America PoolTogether is a very popular protocol and used by users:   twitter.com    diegodefi.eth 🇦🇷🦇🔊⚔️ @diego_defi  Ya participando de la lotería donde nunca se pierde en #Optimims😀@PoolTogether_ fue uno de los primeros protocolos en donde interactúe cuando comencé en #DeFi y me encanta ❤️ twitter.com/diego_defi/sta… https://t.co/It6EhkUwM6   diegodefi.eth 🇦🇷🦇🔊⚔️ @diego_defi  La gente @PoolTogether_ llega a #Optimism? 😱😱😱😱 https://t.co/8UGkNhpfhr    3:00 PM - 8 Jul 2022           21                3            In our communities they are very popular. I have a question, could you please detail how you are going to manage these funds, will they be linked to PoolTogether governance or will they be selected by the team?     Leighton:   20% will be reserved for teams/projects that build new PoolTogether UIs that leverage core features of the protocol on Optimism 10% will be distributed to projects that directly integrate PoolTogether on Optimism    ",
                    "links": [
                        "https://twitter.com/diego_defi/status/1545422572677840896?s=20&t=BIhXxAm8sdcoTbntj5kNxQ",
                        "https://twitter.com/diego_defi/status/1545422572677840896?s=20&t=BIhXxAm8sdcoTbntj5kNxQ",
                        "https://twitter.com/search?q=%23Optimims",
                        "https://twitter.com/PoolTogether_",
                        "https://twitter.com/search?q=%23DeFi",
                        "https://twitter.com/diego_defi/status/1545402903015325697",
                        "https://t.co/It6EhkUwM6",
                        "https://twitter.com/diego_defi/status/1545402903015325697",
                        "https://twitter.com/diego_defi/status/1545422572677840896?s=20&t=BIhXxAm8sdcoTbntj5kNxQ"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.14025974025974
                },
                {
                    "author_link": "https://gov.optimism.io/u/Leighton",
                    "index": "5",
                    "likes": "1",
                    "time": "23/10/2022-20:29:08",
                    "content": "Hey Netrim! Thanks for the input! You are correct that currently the only yield source integrated is Aave. So a big goal here would be to get at least one more additional Optimism yield source integrated. I do think it makes sense to weight a bit heavy towards that and less heavy on the UIs. The idea around the UI though is to try and create something that is geared towards people totally new to crypto. Think something that combines Optimism Gateway with the ability to deposit, check prizes, etc. Does that make sense and answer your questions? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.009848484848485
                },
                {
                    "author_link": "https://gov.optimism.io/u/Leighton",
                    "index": "6",
                    "likes": "0",
                    "time": "23/10/2022-20:40:37",
                    "content": " In Latin America PoolTogether is a very popular protocol and used by users:  That is really encouraging to hear! Please reach out to me if you have any ideas on how we can continue to grow protocol usage in Latin America!  I have a question, could you please detail how you are going to manage these funds, will they be linked to PoolTogether governance or will they be selected by the team?  Good question! This grant request is ultimately for PoolTogether Inc, the company. So at the end of the day we (meaning the company) will be in charge of managing their distribution. However, I do anticipate that process will have a lot of input from the broader PoolTogether community. Let me know if you have any other thoughts or questions! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.811249999999999
                },
                {
                    "author_link": "https://gov.optimism.io/u/Squeeks",
                    "index": "7",
                    "likes": "2",
                    "time": "24/10/2022-03:02:29",
                    "content": "Looks good to be. I have good user experience with PoolTogether ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/Jadmat.Eth-DefiLatam",
                    "index": "8",
                    "likes": "1",
                    "time": "24/10/2022-03:16:24",
                    "content": "Hey @Leighton;     Leighton:  El protocolo PoolTogether continúa brindando coincentivos en forma de USDC adicionales que se distribuyen como premios por encima del rendimiento que se genera. En otras palabras, suponiendo que se generen $1000 en rendimiento de USDC en los depósitos, $1500 se distribuirán como premios, y el USDC adicional provendrá de la tesorería del protocolo PoolTogether.   This would accompany the $OP rewards; Or is it an action that they normally perform even if the grant is not received? Would you help me to clearly understand where these coincentivities come from and what their distribution policy is like? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.583333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/Lonser",
                    "index": "9",
                    "likes": "0",
                    "time": "25/10/2022-14:09:08",
                    "content": "Hey, not Leighton but a PT Community member  The USDC incentives come from the PT treasury (https://info.pooltogether.com/), the network APR currently is 3.42%, that means a 1000$ depositor wins on average 34$ and that is better than what he would get on Aave directly! The current prize distribution on Optimism is: 1 x 1000$ 32 x 20$ and 512 x 5$, per day! We especially want to reward small depositors, that‘s why there are so many small prizes and there is a prize cap of 1 prize per wallet. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party advertising proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.387499999999999
                },
                {
                    "author_link": "https://gov.optimism.io/u/Jadmat.Eth-DefiLatam",
                    "index": "10",
                    "likes": "1",
                    "time": "25/10/2022-14:24:30",
                    "content": "Hey @Lonser; thanks for answering But my doubts are not clear to me; What is your treasury fund distribution policy? I understood that these funds are sent today, right? that is, regardless of the $OP grant ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.726190476190476
                },
                {
                    "author_link": "https://gov.optimism.io/u/mastermojo",
                    "index": "11",
                    "likes": "2",
                    "time": "25/10/2022-15:13:48",
                    "content": "I am one of the Synthetix Ambassadors, & a member of the Defi Shadow Committee. I am an Optimism delegate [Delegate Commitments - #65 by mastermojo ] with sufficient voting power, and I believe this proposal is ready to move to a vote. ",
                    "links": [
                        "https://gov.optimism.io/t/voting-cycle-8-roundup/3742/9"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Leighton",
                    "index": "12",
                    "likes": "0",
                    "time": "25/10/2022-15:18:42",
                    "content": "Hey, great question! The $OP factors in and without the $OP prizes would be reduced significantly. The finance team that sets the prize distribution has committed to keeping the average USDC yield rate at least 50% higher than Aave USDC yield assuming the $OP incentives stay. This has been based on the assumption of the last couple of months of having $OP incentives. I can’t speak to exactly how that would change if the $OP incentives did not stay but it would certainly be less. I can say overall, the whole PoolTogether community sees the $OP incentives as a super important and limited window to maximize growth. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party is advertising proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.81547619047619
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "13",
                    "likes": "1",
                    "time": "25/10/2022-18:50:24",
                    "content": "I’m a delegate with enough voting power Delegate Commitments - #136 by jackanorak and i think this is ready for a vote ",
                    "links": [
                        "https://gov.optimism.io/t/voting-cycle-8-roundup/3742/9"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/ScaleWeb3",
                    "index": "14",
                    "likes": "3",
                    "time": "25/10/2022-20:45:01",
                    "content": "Thanks for the concise proposal. It’s good to see your alignment with Optimism, initial growth on Optimism & reaching set goals. We believe that easy-to-use products with product market fit such as Pooltogether can onboard a significant amount of real users & liquidity - even though yield hunters may dominate currently. Consequently, it’s also reasonable to phase out OP rewards over time after a kickstarting period to ultimately achieve sustainable growth on Optimism      Leighton:  380,000 of the user rewards will be distributed over a period of 19 weeks at the rate of 20,000 tokens per week to all Optimism depositors. This represents a 28% reduction in the current $OP distribution rate. The goal of this step is to keep incentivizing the growth momentum on Optimism while tapering off special incentives. 19 additional weeks will reach until March 28th 2023 when distribution can be re-evaluated.   The core KPIs are also very clear and make sense - not 100% sure about the necessity of new frontends / builder incentives in the near-term for a project that can, in our opinion, contribute most to the success of Optimism with user/liquidity onboarding in the near-term. That said, we also see potential in future collaborations on specific co-marketing campaigns, user onboarding funnels, better UX etc. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.045115112160566
                },
                {
                    "author_link": "https://gov.optimism.io/u/Leighton",
                    "index": "15",
                    "likes": "0",
                    "time": "28/10/2022-18:02:51",
                    "content": "Thanks for your feedback! Let me know if you have any additional questions! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5625
                },
                {
                    "author_link": "https://gov.optimism.io/u/Tjark",
                    "index": "16",
                    "likes": "3",
                    "time": "01/11/2022-10:13:24",
                    "content": "As we get closer to the voting period, I’d like to highlight the OP Rewards part of this Dune Dashboard. As a background: The current rewards on PoolTogether accrue in real time and are claimable every Tuesday for the previous week, based on a users TWAB. So far, more than 5,400 unique wallets have claimed the OP rewards on PoolTogether, while we can still see several hundred new claimers every week.  image1438×760 98.3 KB  At the time of writing, 347,500 OP tokens are available for claiming. Out of these, almost 300,000 were claimed already.  image1438×760 91.4 KB  The increase in claims in week five and ten suggest that some users wait for the end of a distribution period to claim the full amount at once. The third distribution period will end on November 15th. I expect a similar increase in claims the week after that. Overall this verifies the thesis that $OP distributed via PoolTogether goes to a wide set of users and not just to a few whales. The marketing around the incentives continues to be effective, attracting new users and creating awareness. While these rewards go out to many new Optimism users, we make sure to keep educating them about their rights in token house governance. The claim process in the PoolTogether app includes a prompt to delegate your $OP:  image2400×1350 149 KB  Happy to discuss any left uncertainties or doubts before the voting period starts.  ",
                    "links": [
                        "https://dev.pooltogether.com/protocol/contracts/v4-periphery/TwabRewards",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/6/66a41aaa24cfd0851faca4a63c1e7eab6b00194a.jpeg",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/4/429893cd0877050940f2a8f55efffee19915492f.jpeg",
                        "https://twitter.com/PoolTogether_/status/1562552039548518403",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/0/00e1ca9a451383cb1162615b4f67d624bd1386c3.jpeg"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party advertising proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.927700922266139
                },
                {
                    "author_link": "https://gov.optimism.io/u/Jadmat.Eth-DefiLatam",
                    "index": "17",
                    "likes": "0",
                    "time": "01/11/2022-13:39:40",
                    "content": "@Leighton Very clear proposal; the statistics are specific, and I am enthusiastic about the results achieved; PT is a great project for Optimism, its track record and simplicity is impeccable As some members have already commented, I don’t agree with the grant to projects, much less to user interfaces; would you be willing to change this? @Netrim advice, to diversify the source of income (new alliances) seems key to the joint and organic growth of the ecosystem ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.3887205387205395
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "18",
                    "likes": "0",
                    "time": "01/11/2022-13:59:10",
                    "content": "I would like to echo this as well. PT has clear use case, last distribution plan and its impact is clearly visible, both from TVL and user activity side. Not that I am against better UI but in given the market condition, shouldn’t we focus more towards user incentives. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party is advertising proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.2
                },
                {
                    "author_link": "https://gov.optimism.io/u/Jadmat.Eth-DefiLatam",
                    "index": "19",
                    "likes": "0",
                    "time": "01/11/2022-14:28:44",
                    "content": "Netrim warned me that they should no longer change the proposal, it was approved as such, I did not notice this; With which my advice is useless in this instance, would you be willing to change this for the next cycle? @Leighton ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.6875
                },
                {
                    "author_link": "https://gov.optimism.io/u/Leighton",
                    "index": "20",
                    "likes": "0",
                    "time": "01/11/2022-15:20:37",
                    "content": "Thanks for the feedback! We’ve carefully timed this proposal to avoid an ending of the deposit incentives. Right now, if this current vote fails then $OP rewards for PoolTogether will end on November 15th (two weeks from today). Obviously we could re-start them but I think ending and then re-starting would lead to a big loss in momentum and diminish the overall effectiveness that we see. We are happy to continue to work collaboratively on how to best leverage 170k OP allocated for yield source integrations and alternative interfaces. Yield source integrations will be very important as it will improve the overall Optimism ecosystem. As an example of alternative interfaces, here is one thing that Pool Grants recently funded. This wouldn’t something funded using this grant but we do believe that ideas like this could help cement a larger community on Optimism and attract more people to try it out. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.918571428571429
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "21",
                    "likes": "0",
                    "time": "01/11/2022-15:59:19",
                    "content": "fwiw i’m in favor of advancing the proposal as is, tho couple q’s there’s an enormous amount of precedent in funding integrations so i’m not at all averse to encouraging more composability within the system. wanted to know, though – what’s the process of integration look like, and how’s the dev burden distributed between you and the partner protocol? has there been friction in getting new yield sources onboarded? i’d also comment that better UX in a world with generally bush-league interfaces is for my money a better source of user onboarding than any small incentive. paired with user incentives (which have been uniquely effective in PoolTogether’s hands – the analysis last week showed that, broadly speaking, their efficacy has been mixed at best), I’d say that’s good, broad coverage for growth. That said, though, hoping to get a brief sense of finances and why a grant at this stage would catalyze better UX – are you unable to move this forward otherwise? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.1356951871657746
                },
                {
                    "author_link": "https://gov.optimism.io/u/Leighton",
                    "index": "22",
                    "likes": "0",
                    "time": "01/11/2022-16:47:35",
                    "content": " wanted to know, though – what’s the process of integration look like, and how’s the dev burden distributed between you and the partner protocol? has there been friction in getting new yield sources onboarded?  Good question! Over the years we’ve tried many different approaches, we’ve done them internally, we’ve bountied them and then yield source teams have done them. Our best outcomes have been working directly with yield source teams to get them done. We also always audit them. So generally we’ve tried to either get the yield source team to do them for free and we pay for the audit or provide some sort of grant to the yield source team… that would be the idea here.  That said, though, hoping to get a brief sense of finances and why a grant at this stage would catalyze better UX – are you unable to move this forward otherwise?  The PoolTogether Inc team is a total 5 people (was 4 people until yesterday when we added Ncookie). We have zero designers on our team and we only have one front-end. So internally, we are highly limited in terms of what we can do UI wise. I’ve always felt like there is a big need for a UI that connects to the protocol but focuses specifically on people who have never used a dapp before (have a Cex account but never used DeFi). So that’s something specifically I’d love to see. We’ve also had a lot of good work done on instrumentation, things like prize notification bots, prize odds calculators, things along those lines. Overall, these integrations and UIs are things that will move a lot slower but I thought having some allocation for them would be good as a longer term play rather than incentive focused stuff. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.270439787485243
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "23",
                    "likes": "0",
                    "time": "01/11/2022-18:56:52",
                    "content": "I love this proposal and PoolTogether is highly trusted in the space. But we asked every other proposal to either state exactly how teams/projects reserves will be distributed or to take it out of the proposal I feel I have to ask the same here. Don’t get me wrong I know 100% you will use this for new PoolTogether UIs. But if you can specify how that  20% distribution will be that would be perfect. The same goes for the 10%. I rather have to approve a second proposal asking for UIs core features individually than leave this 30% to the team will. Again, I trust the PoolTogether team 100% but I want to keep the same conditions for all teams even if they earned my trust. thank you! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party or author is advertising proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.592234848484848
                },
                {
                    "author_link": "https://gov.optimism.io/u/Leighton",
                    "index": "24",
                    "likes": "0",
                    "time": "01/11/2022-19:10:25",
                    "content": "Thanks for the input and kind words! Could you clarify this for me?  we asked every other proposal to either state exactly how teams/projects reserves will be distributed  What level of detail do you need beyond what is already shared? Do you need to know exactly who would be getting the grants?  I rather have to approve a second proposal asking for UIs core features individually than leave this 30% to the team will.  My understanding (via @Netrim) is at this stage, we can’t change the proposal. Is that correct? If it is possible to adjust the current proposal before voting I would do so. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.736111111111111
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "25",
                    "likes": "0",
                    "time": "01/11/2022-19:23:43",
                    "content": "    Leighton:  My understanding (via @Netrim) is at this stage, we can’t change the proposal. Is that correct? If it is possible to adjust the current proposal before voting I would do so.   You can change the proposal. Tag your approvers to reafirm their position.     Leighton:  What level of detail do you need beyond what is already shared? Do you need to know exactly who would be getting the grants?   “Well if you say 10k Op will go to this team for this UIs” that would be awesome. But if you have the UIs features in mind and you don’t have the teams at least specify those features and approximate distributions. “Feature 1 does this and we will allocate approx 10k OP” Sounds logical or is it too much work? I’m trying to figure out how to approve this I’m very fond of developer grants. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.666666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/Leighton",
                    "index": "26",
                    "likes": "0",
                    "time": "01/11/2022-19:39:15",
                    "content": "It sounds logical and it’s not too much work but given the time constraints I’m not sure it’s possible. Let me just re-iterate the key points here as I have added more information in the comments.   550,000 OP total grant request   380,000 allocated to depositor rewards   110,000 OP allocated to alternative interfaces   55,000 OP allocated to alternative yield source integrations   For the 110,000 we think there is a big opportunity to further leverage “PoolTogether as the front door to DeFi” by making a dedicated interface targeted to people who own crypto on centralized exchanges but have never used an app. Think of it like if the Optimism Get Started page and app.pooltogether.com had a baby. That’s the primary a goal, a secondary goal would be more experimental ideas that might get submitted once we put out a request, I used the web3 savings cards as an example. That specific example is already funded so doesn’t need a grant but I think there is a lot of room to build easier to onboard interfaces for the protocol. As I mentioned in another comment, the PoolTogether Inc team has zero designers and only 1 front-end dev so having some grants to do work on front-ends would be helpful. The second part, 55,000 OP for yield source integration is more straight forward. Right now the protocol is only intergated with Aave on Optimism, this is pretty limiting. It would be great to integrate with other yield sources, we have looked into integrating with Velodrome so that is possible but I also assume in the coming months more yield sources will be coming online. These OP tokens would be used as incentives to get those teams to integrate with the PoolTogether protocol. This is something we’ve done before on Ethereum mainnet. I’m not sure if that adds clarity? I am happy to try and adjust the original proposal as several people have asked questions about it but I also don’t want to mess up the voting process! So looking for some input on best suggested path forward. ",
                    "links": [
                        "https://app.pooltogether.com/",
                        "https://web3savings.network/"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.955775669642858
                },
                {
                    "author_link": "https://gov.optimism.io/u/Netrim",
                    "index": "27",
                    "likes": "0",
                    "time": "01/11/2022-19:42:31",
                    "content": "As Dhantee says, the proposal CAN be changed but you need your delegates to maintain their endorsement. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "28",
                    "likes": "0",
                    "time": "01/11/2022-19:50:54",
                    "content": "It does thank you! I’ll support this proposal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Leighton",
                    "index": "29",
                    "likes": "0",
                    "time": "01/11/2022-19:58:40",
                    "content": "Thank you!! It seems like people are generally in favor… however, I will default to our original sponsors, @jackanorak and @mastermojo if you would like me to lower or remove the OP allocated towards yield source integrations and interfaces, let me know and I will do so. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.0625
                },
                {
                    "author_link": "https://gov.optimism.io/u/Leighton",
                    "index": "30",
                    "likes": "4",
                    "time": "02/11/2022-22:07:38",
                    "content": "@OPUser asked a further question via Discord and I wanted to answer it here for visibility.  What you want to built is clear from your last comment, but could you break this cost estimate, how did you reach to this number ? are you calculating Dev hours * hours rate, if so then how much.  There isn’t an Apples to Apples comparison since the OP tokens won’t be sold and generally shouldn’t be viewed as money. However, I do have some stats on past expenses of related activities. I know Pool Grants paid $25,000 for phase 1 development of the Web3 Savings card interface. This specific project was one developer working on a part-time basis. Ideally, what we would like to achieve on Optimism is much bigger… A direct to Optimism on-ramp with fiat conversion making it simple to use PoolTogether for someone who owns crypto but has never used a dapp. We anticipate this being a multi-person project because it would include front-end, web designer, and also back-end / smart contract integration work. So we are targeting having enough resources for a single large grant that can motivate a talented team. If the total amount requested (110,000 OP) wasn’t needed then I would anticipate any remainder could be used for some OP on-boarding incentives specifically for that interface. I believe that would be very effective. In terms of yield source’s integration our ideal path here would be working closely with a team to get them done. We’ve generally paid $15,000 per yield source integration. Yield sources always need a good audit which generally will cost about $30,000. I don’t expect an auditor would accept OP tokens as payment so likely that will be paid for by PoolTogether Inc and then OP tokens will incentive the actual integration work + the launch of the new pool. When new pools with new yield sources are created, they need to bootstrap deposit growth, so any tokens not needed for the actual growth can be used towards that. Hopefully this helps create some clarity! Let me know if it does! ",
                    "links": [
                        "https://web3savings.network/",
                        "https://gov.pooltogether.com/t/c4-audit-pooltogether-v4/1665"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.904523063143753
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "31",
                    "likes": "1",
                    "time": "02/11/2022-22:52:51",
                    "content": "This proposal and the team’s answers are clearly from people with a lot of time in crypto and they know what they are doing. Thank you for all your answers I’ll vote Yes on this proposal ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/FilterBySpam",
                    "index": "32",
                    "likes": "0",
                    "time": "03/11/2022-08:36:41",
                    "content": "It took some time to study the proposal; nonetheless, direct fiat on-ramp is a welcome addition to the protocol and to the L2 chain, and development effort is not the best use of OP funds. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 8.166666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "33",
                    "likes": "4",
                    "time": "03/11/2022-13:54:46",
                    "content": "Recommendation from DeFi committee C Details Clear and simple plan for usage of 70% of the OP requested for user rewards, with sufficient detail of the reason for the additional segments for UX and integrations. The proposers have responded to queries and shown willingness to expanded on sections that delegates have queried. Value-Add Pooltogether offers slightly better APRs than Aave and can attract significant TVL and users - similar as with their first grant proposal. TVL should stay & improve on Optimism and potentially more users should be attracted Traction Pooltogether has been a top project on Ethereum moved most of its liquidity ($35M) from Eth l1 to Optimism. They are used by thousands of addresses on Optimism daily. Amount 550K OP is a reasonable amount for the size of Pooltogether, further incentivizing liquidity & phasing out rewards. 385K OP (70%) will be spent on liquidity incentives over 19 weeks at a rate of 20K Op/week. The rest will be used for builder incentives, incl. 110K OP (20%) for new UIs and better onboarding of users & 55K OP (10%) for integrations on Optimism. Co-incentives The variable co-incentives are based on Pool Governance and likely amount to 500$ - 2000$ USDC per day which would in AVG result in 170K USD over 19 weeks. This is slightly low for the requested OP liquidity but Pooltogether is also open to fund additional grants for teams building on Pooltogether/Optimism. Allignment Great, moved their project & liquidity to Optimism and plan to further build there Recommendation:- YES Our past recommendation is available on committee recommendation thread ",
                    "links": [
                        "https://gov.optimism.io/t/defi-committee-c-season-2-recommendations/3437",
                        "https://gov.optimism.io/t/gfx-labs-delegate-communication-thread/2728/19",
                        "https://gov.optimism.io/t/defi-committee-c-season-2-recommendations/3437/14"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party or author is advertising proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.980731225296443
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "34",
                    "likes": "0",
                    "time": "03/11/2022-20:13:26",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "35",
                    "likes": "0",
                    "time": "03/11/2022-20:49:30",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/polynya",
                    "index": "36",
                    "likes": "0",
                    "time": "04/11/2022-04:57:13",
                    "content": "I’m abstaining from this proposal. I feel like much of the bootstrapping has already been done by the Partner’s Fund. At the same time, you have made an effort to mix things up by somewhat reducing incentives and allocating funds towards improving user experience. Still, it’s not enough - I want repeat proposals to be bolder, or at least come after a brief period to assess the effects without incentives. As an example, I would like to see much more focus on user acquisition through better user experiences and marketing, rather than liquidity mining. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party advertising proposal"
                    ],
                    "Sentiment": 5.642857142857142
                },
                {
                    "author_link": "https://gov.optimism.io/u/Leighton",
                    "index": "37",
                    "likes": "2",
                    "time": "04/11/2022-15:43:19",
                    "content": "Thanks for the input! As a point of general feedback on the process. It’s quite difficult as different voters clearly have different priorities. All the pushback we’ve gotten thus far is that we’ve allocated too much to building better user experiences… to the extent we almost completely cut out all the request for OP allocated towards it. One thing that would be helpful is if people put their voting weight in their names on discourse… that way feedback could be weighted appropriately based on voting power. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.590909090909091
                },
                {
                    "author_link": "https://gov.optimism.io/u/polynya",
                    "index": "38",
                    "likes": "1",
                    "time": "04/11/2022-15:54:25",
                    "content": "That’s a good idea. Meanwhile, you can find out here: Optimism | OP Token House - Delegate Voting Weight Tracker  (dune.com) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "39",
                    "likes": "1",
                    "time": "04/11/2022-17:51:44",
                    "content": "    Leighton:  ll the pushback we’ve gotten thus far is that we’ve allocated too much to building better user experiences… to the extent we almost completely cut out all the request for OP allocated towards it.   I can provide some input here, initially token allocated to builders was not clear. What you want to build, how did you reach to that specific number and how it will add value. Once you provided information to those, it was easy to support your proposal. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.802083333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/Leighton",
                    "index": "40",
                    "likes": "1",
                    "time": "04/11/2022-18:17:50",
                    "content": "Understood. Your issue wasn’t with the request type but rather the lack of details.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/katie",
                    "index": "41",
                    "likes": "1",
                    "time": "07/11/2022-18:23:03",
                    "content": "Voted yes - Following Defi Committee C recommendation and appreciate the report back on the effectiveness of the previous grant. Also a big fan of Pool Together and personally own 4 Poolys  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party is advertising proposal"
                    ],
                    "Sentiment": 5.433333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "42",
                    "likes": "2",
                    "time": "09/11/2022-13:27:04",
                    "content": "I really love PoolTogether and the Poolys but I am going to have to vote this proposal down and go against committee recommendation here, following a similar logic to my vote on Velodrome. The project has already received $450,000 $OP tokens from the foudnation partner fund and is now asking for another $550,000. I would love to see them stand in optimism on their own legs, see how the protocol fares without external incentivization help and make any further decisions from there and on. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely negative feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party advertising proposal"
                    ],
                    "Sentiment": 5.902777777777778
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "43",
                    "likes": "0",
                    "time": "14/11/2022-16:56:30",
                    "content": "Snapshot vote - passed ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "44",
                    "likes": "0",
                    "time": "14/11/2022-16:56:52",
                    "content": "@Leighton can you provide a Telegram handle or other contact method so the Optimism team can get in touch about paying out this grant! Feel free to comment on this thread, DM, or email palash@optimism.io ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party or author is advertising proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.609375
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "45",
                    "likes": "0",
                    "time": "14/11/2022-16:56:55",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "46",
                    "likes": "0",
                    "time": "09/01/2023-13:17:59",
                    "content": "Grant update here ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "302"
}