{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/review-gf-phase-1-proposal-isomorph-loans-archived-original/3933",
            "title": "[REVIEW] [GF: Phase 1 Proposal] Isomorph Loans [ARCHIVED ORIGINAL] ",
            "index": 3933,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Archive"
            ],
            "tags": [
                "season-3",
                "cycle-10"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/Kree",
                    "index": "1",
                    "likes": "12",
                    "time": "07/11/2022-13:14:04",
                    "content": "Project Name: Isomorph Loans https://isomorph.loans Author Name: Kree (On discord as kree#6291) Number of OP tokens requested: 110k OP Which Voting Cycle are you applying for?: Voting Cycle 10, Season 3 Grant category: Growth Experiment Sub-Committee I s this proposal applicable to a specific committee? Growth Experiment Sub-Committee L2 recipient address: 0xb1FcA41C466309eCea88eC0Bd4A56F879B816281 (Isomorph multi-sig) Relevant Usage Metrics: : (TVL, transactions, volume, unique addresses, etc.) N/A new project Project Description: Isomorph is an Optimism-native lending protocol. Loans mint a new stablecoin called isoUSD. We target collaterals which generate interest in order to make the demand for the loans self sustaining. Currently we support Lyra Liquidity Pool tokens, Velodrome pool tokens and Synthetix synths with plans to expand to other Optimism based projects. IsoUSD will be exchangable for USDC on Velodrome, making use of their bribes & voting system to allow us to incentivize liquidity in this pool at a sustainable rate. Is/Will this project be open source? Yes the repo is already public and licensed under MIT at our Isomorph github repo. Optimism native? Yes. Date of deployment/expected deployment on Optimism: The code is ready to launch and we are just awaiting funds necessary (i.e. this grant) to ensure that our isoUSD pool has enough liquidity to service users of our protocol. Ecosystem Value Proposition: Projects launching on Optimism must compete with Ethereum mainnet and other chains when it comes to the return they make users. If they cannot match or exceed the returns earnt on other chains then users will not supply capital. This has the knock on effect of then making the projects less competitive or viable for their role (i.e. with less options liquidity Lyra could not provide the depth they desire or trades on Velodrome would incur more slippage). By providing loans against income generating protocol assets Isomorph increases the capital efficiency of supported projects, enabling them to multiply the usable capital on their platforms. It also provides users with more options as they are not restricted to one protocol allowing them to reduce risk of total wipe out from smart contract bugs and reduce volatility in their returns. In doing so Optimism’s ecosystem will become more competitive on multiple different fronts, options, swaps and liquidity providing. Isomorph could also join the OP Quest program to further incentivize protocol engagement, with our integration with other projects we could then have goals which included interacting with 2 or 3 leading Optimism projects. EDIT: I believe the quest program has ended since this was written, we would be open to similar projects should they exist in the future. Has your project previously applied for an OP grant? No. Did the project apply for or receive OP tokens through the Foundation Partner Fund?: No. Optimism alignment Proposal for token distribution veVELO/Bribes of $200,000, this sum would enable us to attract enough capital in a Velodrome pool that loan users can buy or sell isoUSD as they need. $200,000 would buy us roughly 6mill VELO which if locked could generate ~178,000 weekly VELO emissions which should allow us to generate a 10% return on a pool with total liquidity of $2.63million. If prefered we can instead use this amount to bribe existing VELO voters to vote for us, meaning we would not need to sell the OP tokens relating to this. We would prefer to lock veVELO as this is currently far more capital efficient and would allow us to be eligible for extra ecosystem funds from Velodrome allowing us achieve more. Marketing/Design $15,000 Currently Isomorph has only been spreading by word of mouth, with this sum we can purchase spots on podcasts or sponsor Crypto youtubers to give their users a tutorial of Isomorph to improve outreach. These adverts would enable us to educate users about the possibilities available on Isomorph and how to transfer funds to Optimism. We have consistently seen in DeFi that sticky capital follows the best returns, Isomorph is designed to work without needing native LP mining so that any captured users remain longer. Some of these funds would be used improve the design of the website by hiring a UX/UI specialist to make the site more streamlined and user friendly, reducing the barriers to entry ensure our advertising push will be more effective. Please note due to recent volatility of the OP token we cannot accurately ask for this dollar amount, we would be open to returning any excess OP tokens over this value once the grant is received. How will this distribution incentivize usage and liquidity on Optimism? The distribution will increase the capital efficiency of other protocols, improving competition with other chain ecosystems. By providing competitive yields to Isomorph users we will be able to tempt new users to migrate to Optimism, making them more likely to check out other protocols available on Optimism. In addition it will allow users to access income streams while deferring tax payments, again helping improve competition of supported projects on Optimism. As a knock on by participating in the Velodrome bribing system via veVELO/Bribes we are demonstrating the friendliness of launching on Optimism for new projects and the community first design of protocols based on here. Why will the incentivized users and liquidity remain after incentives dry up? Once loans are opened the system will be generating income, this income can be used to bribe the isoUSD Velodrome pool instead of OP tokens. Or veVELO accrued during incentives round stays there after incentives end. Loan collaterals are interest generating and so have an incentive to borrow against their value to increase their return on capital. Over what period of time will the tokens be distributed? 1 year What milestones will the project track? Impact of Velodrome voting can be directly tracked to see the impact it has on liquidity, this can then be compared to the trading volume of the pool to find out the optimum level that balances user demand with the funds allocated. The marketing drive can be tracked by recording which sites direct traffic to our website https://isomorph.loans, we can then compare the uptick in traffic to the number of new users using Isomorph and the amount of new loans opened. How much will your project match in co-incentives? As a new project Isomorph has no capital to match incentives yet. However as the income from the project grows we should be able to shift the dynamic towards fees generated by Isomorph and in the future we may issue a token that could also be used to this effect. Resources: Our code is public at GitHub - kree-dotcom/isomorph: Isomorph: a layer 2 defi lending protocol We have a website at https://isomorph.loans where we currently have the project live on the Optimism Goerli testnet for users to try out. Discord Isomorph Audit from Sherlock Additional team member info: 0xMerlin: front-end developer AsparAugustus (Merlin) · GitHub Please link to any previous projects the team has meaningfully contributed to: Kree is also smart contract auditor, company details can be provided in private to Optimism. Also Kree has been involved with the Curve and Synthetix DAOs before having proposed the sLINK/LINK curve pool as well as writing and proposing SIP-107 . ",
                    "links": [
                        "https://github.com/kree-dotcom/isomorph",
                        "https://isomorph.loans/",
                        "https://github.com/kree-dotcom/isomorph",
                        "https://isomorph.loans/",
                        "https://discord.com/invite/Xv2SMBg55z",
                        "https://app.sherlock.xyz/audits/contests/22",
                        "https://github.com/AsparAugustus",
                        "https://github.com/Synthetixio/SIPs/blob/master/content/sips/sip-107.md",
                        "https://gov.optimism.io/t/gf-phase-1-proposal-isomorph/4972",
                        "https://gov.optimism.io/t/gf-phase-1-proposal-isomorph/4972/2",
                        "https://gov.optimism.io/t/grant-proposal-template/3233/23"
                    ],
                    "GPT-summary": "The post is a proposal for a lending protocol called Isomorph Loans, which is designed to be Optimism-native. The proposal explains the project's goals, target collaterals, and ecosystem value proposition. The author is requesting 110k OP tokens for the project and proposes to use $200,000 for token distribution and $15,000 for marketing and design. The post also includes information on the project's open-source status, deployment date, and team members. A 3rd party could provide constructive criticism or ask questions about the proposal, while the author is explaining and advertising the proposal.",
                    "GPT-proposal-categories": [
                        "Token economics",
                        "Interoperability and Scalability",
                        "Grants, Funding and resource allocation",
                        "Law and regulations",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal",
                        "None"
                    ],
                    "Sentiment": 5.5921431211065356
                },
                {
                    "author_link": "https://gov.optimism.io/u/gunboats",
                    "index": "2",
                    "likes": "3",
                    "time": "15/11/2022-19:24:49",
                    "content": "I supported this proposal here. isoUSD allows people to leverage against Synthetix synths and Lyra LP token, which as in times that I’m writing this, there is no platform to do such things yet. Competitor such as Tarot have limitation as Tarot required pairing to have stablecoin in Velodrome pair and borrow rate are designed around leverage farming VELO emission. Comparing against Mai Finance, currently Mai offering is only for Beefy vault and OP/ETH. Mai also has cross-chain risk so user can have more choice for borrowing in Optimism. Finally, more native protocol on Optimism means that incentive spent on will go towards user and cycle forward to the rollup itself. This is good proposal to support! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.097222222222223
                },
                {
                    "author_link": "https://gov.optimism.io/u/millie",
                    "index": "3",
                    "likes": "1",
                    "time": "16/11/2022-01:15:11",
                    "content": "I agree with all the things @gunboats stated. Some other things that I find great about this proposal is that the project is:  code complete and already on test-net open source front end and contracts exotic collateral types for two other OP native projects (Lyra LPs and Velodrome LPs) all funds requested are forward facing and designed to bring growth to Optimism Interest in integrating with the OP Quests Campaign  Over all I think the total amount of OP requested is appropriate for a code complete, test-net deployed project. I fully support this proposal and look forward to seeing IsoMorph deploy on Optimism Mainnet after the audit has been completed. Thanks @Kree! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Kree",
                    "index": "4",
                    "likes": "2",
                    "time": "17/11/2022-23:36:08",
                    "content": "Thanks for the replies! As Gunboats said our design is different to Tarot, we’re Optimism-native and so fully focused on the protocols that live here and because we have a collateral-backed stablecoin minted for loans we are able to provide lower borrowing rates than Tarot and scale to demand better I think. As for Mai, this project is more similar but after the initial launch we expect to be able to support all Velodrome USDC/Token pairs where the Token has a Chainlink price feed as well as expanding to WETH/Token pairs and we’re currently in the planning stages to allow the use of smaller tokens which do not have Chainlink feeds such as project governance tokens. For Millie’s feedback, currently the website front-end is not open source but if this is important we can make it open source  after release. I think the exotic collaterals we accept is the biggest difference we have to other projects, we have plans to expand this, the design of our code means that adding a new ERC20 collateral requires minimal design changes, mostly for the pricing mechanism only. Non-ERC20s are also supported as the Velodrome collateral design shows, meaning we can be very flexible in the new assets we accept. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.8404356060606055
                },
                {
                    "author_link": "https://gov.optimism.io/u/ksett",
                    "index": "5",
                    "likes": "2",
                    "time": "18/11/2022-16:34:23",
                    "content": "I second @millie and @gunboats comments. I am fully supportive of this proposal, Isomorph lending on Lyra’s LP tokens will unlock great capital efficiency for our Market Maker Vaults. Kree has proven to be a knowledgeable and talented developer who has been in this space for a long time. Looking forward to integrating with Isomorph across the OP ecosystem. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.950000000000001
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "6",
                    "likes": "2",
                    "time": "21/11/2022-21:35:39",
                    "content": "Thanks for the proposal! Wanted to flag that Token House delegates are currently in a Reflection Period, which will be followed by 2 Special Voting Cycles. This means that the next opportunity for grant proposals to be reviewed will be at the start of Season 3, which is set to begin on January 19th. We appreciate your patience as we’re taking this time to work through some changes that we hope will improve the proposer experience in Season 3. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.758928571428572
                },
                {
                    "author_link": "https://gov.optimism.io/u/mjs",
                    "index": "7",
                    "likes": "1",
                    "time": "24/11/2022-00:27:47",
                    "content": "As an Optimism delegate with voting power above the required threshold I believe this proposal is ready. My delegate commitment is here. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/mastermojo",
                    "index": "8",
                    "likes": "2",
                    "time": "02/01/2023-20:12:36",
                    "content": "Resurfacing this since the next season is about ready to start ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/Subli_Defi",
                    "index": "9",
                    "likes": "1",
                    "time": "12/01/2023-22:50:45",
                    "content": "I like the money lego being built on locomotives protocols of Optimism. It seems the team is already known by key/trustfull persons in the Defi ecosystem, which makes the project completely legit and confirming to provide added value to the ecosystem and users. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/Kree",
                    "index": "10",
                    "likes": "1",
                    "time": "21/01/2023-08:48:48",
                    "content": "Thank you for the comments again, we appreciate the support! I’ve updated the current grant request with a revised quantity and aims to fit the new voting requirements for season 3. We have had to remove some of our aims in order to match the requirements for the “Growth Experiment” sub-committee. If we are allowed to apply for general grants that do not fit the growth committee or builder committee could someone please let us know,  the information surrounding this is not very clear imo. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.289918414918415
                },
                {
                    "author_link": "https://gov.optimism.io/u/mastermojo",
                    "index": "11",
                    "likes": "0",
                    "time": "31/01/2023-15:32:40",
                    "content": "Kree; if you guys haven’t yet please go apply on the new Optimism Google Form.   twitter.com    Optimism Grants (✨🔴_🔴✨) @OptimismGrants  Season 3 is in full swing and the Grants Council has begun accepting applications.   If you are building on Optimism or looking to build on Optimism, apply here to be considered for Cycle 10:  rb.gy/e0fthv  Applications are due by Feb 1 at 19:00 GMT   6:00 PM - 30 Jan 2023           56                23            checkout the above tweet for guidance. ",
                    "links": [
                        "https://twitter.com/OptimismGrants/status/1620119698401808387?s=20&t=kVZTD0nb8i08RaEuxtAsrQ",
                        "https://twitter.com/OptimismGrants/status/1620119698401808387?s=20&t=kVZTD0nb8i08RaEuxtAsrQ",
                        "https://rb.gy/e0fthv",
                        "https://twitter.com/OptimismGrants/status/1620119698401808387?s=20&t=kVZTD0nb8i08RaEuxtAsrQ"
                    ],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.451704545454545
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "12",
                    "likes": "0",
                    "time": "01/02/2023-17:47:40",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "323"
}