{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/draft-gf-phase-1-proposal-the-optimistic-series/4911",
            "title": "[DRAFT] [GF: Phase 1 Proposal] The Optimistic Series ",
            "index": 4911,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Grants Council"
            ],
            "tags": [
                "cycle-10",
                "passed"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/Subli_Defi",
                    "index": "1",
                    "likes": "7",
                    "time": "31/01/2023-00:08:34",
                    "content": "Proposal modified on 06/02/23 to comply with the No-Sale rule of the Grant Proposal modified on 14/02/23 to bring more clarifications on the process to filter eligible users + rebalance of $OP allocation between Podcast & Newsletter Proposal modified on 21/02/23 to remove incentives to twitter space and allocate incentives to existing subscribers Proposal modified on 27/02/23 to address Increase of Sybil Resistance & task engagement Project name: The Optimistic Series Author name and contact info (please provide a reliable point of contact for the project): Subli_Defi I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: Yes I understand that I will be expected to following the public grant reporting requirements outlined here: Yes L2 recipient address: 0x6b492bbbe311f3c1e15e3d4ccc00cc2a412089ff Which Voting Cycle are you applying for?: Cycle 10 Which sub-committee should review your proposal? (Builders Grants, Growth Experiment Grants): Growth Experiment Grants Project description (please explain how your project works): The optimistic Series is providing unique content exclusively about the DEFI Optimism Ecosystem that does not exist yet, as far as i know. It will include the following Educational contents:  The Optimistic Newsletter: A bi-weekly newsletter covering the following topics:   Governance/Technical updates On-chain analysis Project Update Crypto Market review Farming strategy: (being an Interactive community section where i select the best farming strat that the community sends me).   The Optimistic Podcast: A weekly podcast, held on Twitter space, where i receive one or two projects, in order to go through:   Project current status Roadmap 2023 Optimism Position within the overall Defi ecosystem   Access to a Large Research database on the contents already produced on Notion by myself covering subjects such as:   Optimism project review Optimism project tutorials Defi macro analysis How to use Defi guide Basic knowledge of Defi - Impermanent Loss / Depg in a liquidity pool  All the above deliverables will be released on my twitter account (>10k followers, 1m impressions in January ‘23). Twitter: @subli_defi Discord/Discourse/Community: Subli#0257 Other relevant links (including any demos): The Optimistic Newsletter + Podcast: https://optimismbysublidefi.substack.com/ Research database: https://sublidefi.notion.site/Subli_Defi-c57a3141c983433ca74e785a0bf1bcd0| Additional team member info (please link): As the work above is tremendous, friends of mine are helping me to make all this content, while on my side, in addition to write articles, threads, and making the live space with projects, i also deal with business development & managing the overall project. This team is made up of: Pedro: Designer Charles: Analyst & Digger Axel/Guillaume: Traders Myself: Subli_Defi Please link to any previous projects the team has meaningfully contributed to: I’m deeply involved in the Optimism community since 2022, and very familiar with a lot of projects that have been deployed there. Thanks to my deep involvement,i’ve tied-in connections with a lot of Defi protocols which consider me as a legit, accountable person within the Defi ecosystem, and same goes for users as well. I’ve been involved as contributor into Velodrome, Kwenta, Synthetix, Lifi, Reaper Farm, Tarot and in the overall Optimism ecosystem as: Optimism Ambassador nominated End of 2022, with a nomination well supported by various Optimism projects (Discord) I’m also supporting and animating the french channel of various discord servers:  Main optimism discord Synthetix (where i’m also a country lead) Velodrome Kwenta Defi-France: A discord with +3k members focusing on DEFI in general CryptoFarmeur Discord - Optimism channel: French YT/CT focused on Defi (80k followers on Twitter)  Overall in 2022, i’ve covered various Defi protocols and Optimism growth as follows (more info in my Notion page - Optimism Category):  Optimism Grant: Twitter threads to cover sum-up cycle 2 to cycle 8 Optimism Quests: Detailed step by step tutorial on the 18 Optimism Quests → Oftenly referenced by the Optimism team on the discord server Twitter threads, Project presentation project, tutorials for the following projects: Reaper Farm, Yeran Finance, Beefy Finance, Kwenta, Velodrome Finance, Synthetix (the most detailed staking tutorial ever made in French & English), Tarot, Alchemix Twitter threads & videos for the first steps in DEFI & General knowledge How to Bridge ETH to optimism How to buy a token What is impermanent Loss Crypto Portfolio management Crosschain Swap Depeg mechanism in a liquidity Pool Crypto Market analysis …… And so much more | Relevant usage metrics (TVL, transactions, volume, unique addresses, etc. Optimism metrics preferred; please link to public sources such as Dune Analytics, etc.): Twitter account: 1m+ impressions in January ‘23, +10k followers: https://analytics.twitter.com/user/Subli_Defi/home Newsletter: 300 subscribers after 2nd release Podcast: Already signed-in with the following projects in less than 2 weeks (And more to come): Kwenta/dHedge - Done Lyra/Polynomial - Done Byte Masons Beethoven X Rocket Pool Alchemix/Yearn Finance Velodrome Finance / Liquity AAVE Thales/Overtime Etc…  Competitors, peers, or similar projects (please link): There are few project that are working towards Education, like Bankless, which i love the work. However, i don’t see any project proposing something similar to The Optimistic Series. Is/will this project be open sourced?: Yes Optimism native?: Yes Date of deployment/expected deployment on Optimism: 18/01/2023 What is the problem statement this proposal hopes to solve for the Optimism ecosystem? Evolution of Defi has been incredible in 2022 despite the market condition. While new layers 2 emerge (Metis, Arbitrum, Optimism), we will see in 2023 new additional chains that can compete with Optimism (starknet, Polygon ZK Rollup, DAPP Chain Layer 1 - Sei, Berachain, etc…). And despite having the right technology and the right ecosystem, Communication is key to spread the work and attract builders/users. Problem 1: As the amount of information in DEFI in general grows exponentially, collect, & data anlaysis necessary to be able to use/invest/farm in one ecosystem takes a tremendous amount of time, that most of the people do not have. So how do you connect to these people who just scroll twitter 15minutes per day? Problem 2: It’s also very similar on Project side, how to access users outside their own community to communicate on new milestones, upgrades, incentives, whether you’re an already fully operational project, or a new one that is still on testnet? Problem 3: And finally, if Optimism manages to attract users, how do you eduicate them and make them do their own research? Problem 4: Most of the time, projects might require to sponsor educational contents to Crypto Twitter influencers or KOL, but with the on-going market, marketing budget is oftenly squeezed, or not in the project philosophy. While for new projects that plan to launch (for example, see the number of projects that plan to launch build on top of Synthetix) they usually do not have the budget for this. On the other side, users need also to pay for newsletter, private group to usually access this type of insights/research/tools. How does your proposal offer a value proposition solving the above problem?: The main proposition value is to link Projects & Users in a single point of contact, with no financial incentives, being the Optimistic Series. Problem 1 => The answer is the Optimistic Newsletter Problem 2 => The answer is the Optimistic Podcast Problem 3 => The answer is the research database Problem 4 => The answer is the Optimistic Series receiving a Project Grant on this cycle Why will this solution be a source of growth for the Optimism ecosystem?: Education is Key, information is Power. By providing very high quality content you cannot find in such format, people will naturally start using Optimism projects for their own pleasure. We usually are more confident in what we know, in what we understand. The Optimistic series will provide knowledge and tools that will maintain user curiosity and appetite on Optimism. Has your project previously applied for an OP grant?: No Number of OP tokens requested: 30k $OP Did the project apply for or receive OP tokens through the Foundation Partner Fund?:Yes/No/In Process: No If OP tokens were requested from the Foundation Partner Fund, what was the amount?: No How much will your project match in co-incentives? (not required but recommended, when applicable): If you think that gathering news, analyzing and summarizing data, providing educational contents to the whole community has values, then the co-incentives will be all the produced deliverables. How will the OP tokens be distributed? (please include % allocated to different initiatives such as user rewards/marketing/liquidity mining. Please also include a justification as to why each of these initiatives align with the problem statement this proposal is solving.): Distribution schedule over 16 Weeks through an Optimistic Quest Journey that will drive the subscribers through a series of quest, letting them earn Badges. Only a selected Audience will be able to participate to the quest: Anyone who has bridged from The Most used bridges and are part of the OP Bridges Users list comprising of 1million wallets. Badges will be Soulbound Tokens, meaning they won’t be transferrable. Badge will give access to a certain reward allocation but will also grant access to a more difficult quest. Rewards will be then distributed based on the Earned Badges at the end of the campaign. Badges minting price will be <0.5$, so it’s another mechanism as explained earlier to increase Sybil Resistance whil generating using on Optimism. This Optimistic Campaign will be run in collaboration with Tide. Tide is a platform allowing communities to create engagement programs leveraging on-chain credentials to acquire, engage and retain users. They pioneered a permissionless, no-code campaign builder to launch web3 marketing campaigns with a few clicks. Thanks to their Audience System, I’m able to target relevant wallets and mitigate Sybil attacks. And finally, I will be able to access quest analytics to run data-driven marketing activities. The Quest Jouney will be set-up through 6 differents tasks ranked from Easy to Hard as follows:  Optimistic Quest Journey1917×1077 207 KB  Then the more difficult the task is, the more greater reward the Questoor will receive. I propose the following reward allocation schedule:  Reward allocation schedule1096×609 89.9 KB  The Subscriber who holds Badge 6 will be entitled to the allocation of SBT 6 (40%) based on his share depending on the amount of users holding SBT 6. The definition of tasks are subject to change but the difficulty level as set in the above example will be equivalent. Finally, in order to increase participation, i may also take a new snapshot in the middle of the Optimistic Journey to add more eligible wallets. The snapshot won’t be announced in advance to avoid people preparing for it. Over what period of time will the tokens be distributed for each initiative? Shorter timelines are preferable to longer timelines. Shorter timelines (on the order of weeks) allow teams to quickly demonstrate achievement of milestones, better facilitating additional grants via subsequent proposals: 16 weeks period. Distribution will be automatically managed through Tide Protocol to allocate the exact reward per user depending on their badge. Please clearly define the milestones you expect to achieve in order to receive milestone based installments. Please consider how each milestone relates to incentivizing sustainable usage and liquidity on Optimism. Progress towards each milestone must be trackable: Each month, we will release on @Subli_defi twitter account:  2 newsletters  The agreed milestones will be as follows: Distribution in 3 different segments. 1/10k to start and then: 2/Milestone 1: Reach 1k subscribers for the newsletter, and have consistently posted bi-weekly newsletters. 10k more distribution. 3/Milestone 2: Reach 2k subscribers for the newsletter and have consistently posted biweekly. Final 10k distribution. Why will incentivized users and liquidity on Optimism remain after incentives dry up?: It’s like riding a Bicycle, once you learn it, you never forget it! The Optimistic Series is here to access knowledge on how to ride on Defi, on Optimism. To conclude this application, crypto is already a Niche in the finance world, DEFI is also a Niche within crypto and is only accessible to people who spend time to make some research, understand finance, mathematics, tokenomics, etc… Providing simplified education to users will let them understand what are the different opportunities in a world where every 3 months a new narrative is coming out. Finally, i definitively trust that User Experience and Interfaces are key, and will really focus on talking about projects that EASE people life. Once people gets accommodated with Dapps on Optimism, and if the growth of optimism is linked to the underlying projects, users/investors will find everything they need to Use DEFI as if they were on Mainnet but with 1% of Mainnet Fees. Please provide any additional information that will facilitate accountability (smart contracts addresses relevant to the proposal, relevant organizational wallet addresses, etc.): I think the best people who will be able to talk about my accountability will be Project team i discussed with, so i will let them provide such information on the forum. Confirm you have read and agree to the Eligibility Restrictions (here): I have read the Eligibility Restrictions and agree to abide by their conditions ",
                    "links": [
                        "https://optimismbysublidefi.substack.com/",
                        "https://sublidefi.notion.site/Subli_Defi-c57a3141c983433ca74e785a0bf1bcd0%7C",
                        "https://discord.com/channels/667044843901681675/968188173039587408/1051840945865371731",
                        "https://analytics.twitter.com/user/Subli_Defi/home",
                        "https://twitter.com/Tide_web3",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/7/763e471f61dbd4cc78f271cccf61cff2fe7561ab.jpeg",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/1/1f35d43ee1bd0f082fef7e5ea6b7fbe50decbb70.png",
                        "https://gov.optimism.io/t/grant-proposal-template/3233",
                        "https://gov.optimism.io/t/cycle-10-final-grants-roundup/5418",
                        "https://gov.optimism.io/t/cycle-10-grant-review-roundup/5284"
                    ],
                    "GPT-summary": "The post is a grant proposal for a project called \"The Optimistic Series\" that aims to provide unique content exclusively about the DEFI Optimism Ecosystem. The proposal includes a description of the project, team member information, relevant usage metrics, competitors, peers, or similar projects, and how the project offers a value proposition solving the problem statement for the Optimism ecosystem. The post also includes information on how the OP tokens will be distributed, milestones, and additional information that will facilitate accountability.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Identity and reputation systems",
                        "Smart contract updates",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal",
                        "None"
                    ],
                    "Sentiment": 5.780008372131014
                },
                {
                    "author_link": "https://gov.optimism.io/u/Methodic",
                    "index": "2",
                    "likes": "2",
                    "time": "31/01/2023-12:43:53",
                    "content": "Subli’s efforts for the ecosystem have been invaluable and I’m excited for what’s to come. I support this proposal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://gov.optimism.io/u/omgcorn",
                    "index": "3",
                    "likes": "2",
                    "time": "31/01/2023-15:46:31",
                    "content": "I’ve been following Subli’s content around the curve ecosystem for a while now. Subli is a thorough researcher, a great content creator, and has a growing audience that will only get better with this partnership. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.625
                },
                {
                    "author_link": "https://gov.optimism.io/u/GuyWithKeyboard",
                    "index": "4",
                    "likes": "2",
                    "time": "31/01/2023-15:50:27",
                    "content": "Subli’s work for the Optimism ecosystem at large has been nothing short of excellent. He has demonstrated his ability to engage the public, provide timely insights, produce actionable research, and grow Optimism’s overall footprint for months. More community engagement and content will only serve to bring in more interested and knowledgeable users onto the Optimism blockchain. Furthermore, officially providing funding for content and research produced by a passionate member of the community will have exponentially positive effects. Not only does this provide recognition for Subli and all of his prior work for the community, but makes it possible for him to supercharge the growth of Optimism’s presence online. I fully support this proposal. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.943413729128015
                },
                {
                    "author_link": "https://gov.optimism.io/u/ksett",
                    "index": "5",
                    "likes": "1",
                    "time": "31/01/2023-18:40:58",
                    "content": "@Subli_Defi content is great, cant wait to see where they take it. fully support this ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Taminater",
                    "index": "6",
                    "likes": "1",
                    "time": "01/02/2023-23:52:22",
                    "content": "I have to agree with most of the points above. Great well thought out educational content. Subil is growing an outstanding following while connecting many Optimism projects together. I fully support this proposal. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.821428571428571
                },
                {
                    "author_link": "https://gov.optimism.io/u/Subli_Defi",
                    "index": "7",
                    "likes": "2",
                    "time": "05/02/2023-00:01:06",
                    "content": "@lavande following GC confirmation of an obligation to the No-Sale rule. I’d like to make the following modifications: Nb of OP requested: 27,600 $OP Distribution schedule over 6 months: Podcast estimated: 24 => Op distribution schedule: 50 $OP/podcast/winner, randomly distributed to 3x participants/listeners Total= 3,600 $OP Newsletter estimated: 12 Op distribution schedule: 2000 $OP/newsletter, distributed amongst all new subscribers => for this one, as the operation could be manually very time consuming, i would ask for some support to build an attestation station linked to my substack so thay i can easily extract the eligible addresses, and then using llamapay to distribute the rewards. Total= 24k $OP Happy to discuss this new distribution, that hopefully will meet GC requirements. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.6030303030303035
                },
                {
                    "author_link": "https://gov.optimism.io/u/FractalVisions",
                    "index": "8",
                    "likes": "1",
                    "time": "05/02/2023-01:59:15",
                    "content": "I would like to give you an open source and free solution for capturing your newsletter audience you could integrate with OP token rewards at the same time to kill two birds with one stone.  The first suggestion would be MAIL3DAO & QUEST3 together making a very powerful combination without the additional development of an attestation station.  You can integrate a mail3 subscription button onto your website for example and when people subscribe to your newsletter with Mail3me via the Quest3 platform they can subscribe & receive automatic OP token rewards with a free commemorative NFT as a sign of their membership.  The other suggestion I have is that you could utilize Mirror  article’s integration with Guild XYZ to not only give access to a private newsletter by holding the mirror NFT but also collect wallet address via Guild member snapshot capabilities that can be collected with ease for wallet address collection but then you would have to use a token distribution dApp like Bitbond to send out the token rewards. There are many other perks to using guild you could token gate different levels of membership with for access to higher level content as well!  Additionally you could direct the funds from secondary sales of the NFT associated with each article back to RPGF or a community vault for your own retroactive distribution back to your subscribers. I hope  this is useful in your future journey! Here is an example of how Mail3 makes it so easy for people to sign up.  image1125×1987 380 KB  ",
                    "links": [
                        "https://app.quest3.xyz/",
                        "https://tokentool.bitbond.com/",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/9/9aebe01c3e1b7aab0f9409099ce70619d7a73551.jpeg"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.746626984126984
                },
                {
                    "author_link": "https://gov.optimism.io/u/Subli_Defi",
                    "index": "9",
                    "likes": "1",
                    "time": "05/02/2023-08:51:06",
                    "content": "Terrific. Let me dig into this next week. Thanks so much for the idea ! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5625
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "10",
                    "likes": "1",
                    "time": "05/02/2023-11:30:55",
                    "content": "Hi @Subli_Defi! You can edit your post directly to make any updates now ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/FractalVisions",
                    "index": "11",
                    "likes": "2",
                    "time": "05/02/2023-14:58:47",
                    "content": "Anytime ! Happy to help and watch the OP ecosystem grow further… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Subli_Defi",
                    "index": "12",
                    "likes": "2",
                    "time": "14/02/2023-16:52:56",
                    "content": "@lavande @GrantsOps  Hello. For information, i have updated my proposal to bring some clarifications on the process to filter eligible users + rebalance of $OP allocation between Podcast + Newsletter. Hope you will appreciate these additional details. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Subli_Defi",
                    "index": "13",
                    "likes": "1",
                    "time": "21/02/2023-11:01:58",
                    "content": "@GrantsOps Hello Grant Council, I’d like to make a small update on the proposal and this it’s already in the final review, i’d like to seek for your approval first. I’d like to delete the grant distributed to listeners to Podcast. I’d like to add a retroactive grant to the already subscribed users to this newsletter, how i feel they also contribute a lot to the success of this journey. As of today i have 529 subscribers. I expect to have close to 800-1000 at the time of the grant will be distributed. And it will also let me promote these incentives on Social Network while preventing existing subscribers to unsuscribe and re-subscribe to it. The incentives for new subscribers will then be as follow: Existing Subs: 1000 => 10 $OP/subs => 10k $OP New subs: 250/newsletter => 10 $OP/New_Subs => 2,5k $OP/newsletter => 20k $OP distributed over 8 Newsletters, so distributed over 16 weeks instead of 6 months. Let me know your thoughts on this. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.432900432900433
                },
                {
                    "author_link": "https://gov.optimism.io/u/GrantsOps",
                    "index": "14",
                    "likes": "2",
                    "time": "21/02/2023-16:02:55",
                    "content": "You are free to make these changes. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Subli_Defi",
                    "index": "15",
                    "likes": "0",
                    "time": "21/02/2023-22:08:34",
                    "content": "Proposal modified accordingly. Looking forward to your comments, if any. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Michael",
                    "index": "16",
                    "likes": "1",
                    "time": "22/02/2023-22:58:52",
                    "content": "    Subli_Defi:  Please clearly define the milestones you expect to achieve in order to receive milestone based installments. Please consider how each milestone relates to incentivizing sustainable usage and liquidity on Optimism. Progress towards each milestone must be trackable:   Hi Subli. We wanted to provide some suggestions to make the proposal as strong as possible. These suggestions are optional and do not necessarily reflect the opinion of other council members, just my own. These milestones are simply suggestions. You know your project best and what is attainable:  Distribution in 3 different segments. 10k to start and then: Milestone 1:  Reach 1k subscribers for the newsletter, and have consistently posted bi-weekly newsletters. 10k more distribution. Milestone 2: Reach 2k subscribers for the newsletter and have consistently posted biweekly. Final 10k distribution.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.157051282051283
                },
                {
                    "author_link": "https://gov.optimism.io/u/Michael",
                    "index": "17",
                    "likes": "0",
                    "time": "22/02/2023-23:01:47",
                    "content": "    Subli_Defi:  Existing Subs: Allocation of 10k $OP   Also, it’s important to note that we explicitly discourage retroactive airdrops. I saw this as an amendment. Perhaps it might be better to incentivize all existing subscribers, whether they are new or not? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.7272727272727275
                },
                {
                    "author_link": "https://gov.optimism.io/u/Michael",
                    "index": "18",
                    "likes": "1",
                    "time": "22/02/2023-23:04:16",
                    "content": "    Subli_Defi:  2- I’m going to use tideprotocol platform to set-up a campaign:  Campaign link will only be available on the new subscription confirmation mail New subscriber will enter its email and approve the campaign Every 2 weeks, i will export the data Mail+Wallet and compare with the substacks data All verified emails will receive $OP airdrop as follows: Total eligible addresses/bi-weekly rewards  Not only this newsletter will educate people on OP but this campaign will also make them actually use the Optimism network through Tideprotocol.   And another thing, is there any sybil resistance to this method of distribution? What part specifically is preventing subscribers from using multiple addresses to capture more of the distribution? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.651515151515152
                },
                {
                    "author_link": "https://gov.optimism.io/u/Subli_Defi",
                    "index": "19",
                    "likes": "1",
                    "time": "23/02/2023-12:02:36",
                    "content": "Hello @Michael , thanks for your comments. Here are my answers: 1- Distribution in 3 different segments. 10k to start and then: Milestone 1: Reach 1k subscribers for the newsletter, and have consistently posted bi-weekly newsletters. 10k more distribution. Milestone 2: Reach 2k subscribers for the newsletter and have consistently posted biweekly. Final 10k distribution. => Subli: Agree on these milestones 2- Also, it’s important to note that we explicitly discourage retroactive airdrops. I saw this as an amendment. Perhaps it might be better to incentivize all existing subscribers, whether they are new or not? You’re right. The proposal is then amended to reward all subscribers one time (actually easier to manage). 1st airdrop 10k $OP, it will happen 2 weeks after the 1st newsletter informed about the start of the incentives program together with the launch of the quest. Then 2,5k $OP every two weeks 3- is there any sybil resistance to this method of distribution? What part specifically is preventing subscribers from using multiple addresses to capture more of the distribution? So the quest will run until incentives end up, meaning that you can record and link only one email for each wallet address. Every two weeks, I will export the date from the quest (Email + Wallet Address) and perform the following check:  No double entry email for the same address No double entry wallet for the same email Email participating to the quest will have to be on the Subscribers list of the newsletter  As of today, i’m not able to check if different addresses/emails belong to the same person. However, if you think it’s necessary based on your feedback from the quest campaign, i’d like to propose to add two following simple tasks:  Retweet one of my Post: https://twitter.com/Subli_Defi/status/1615759249065521152?s=20  Connect to Optimism Discord:  As an additional measure, the Tide Quest will request to mint a NFT at the end of the campaign, Tx cost few cts, discouraging people to mint from different wallets for $OP incentives that won’t be high / user. Hope this is meeting your expectations. Looking forward to your reply. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.487871057513915
                },
                {
                    "author_link": "https://gov.optimism.io/u/Subli_Defi",
                    "index": "20",
                    "likes": "1",
                    "time": "24/02/2023-10:56:38",
                    "content": "@Michael I have set up a trial quest if you would like to have a look and complete it. Here is the link of my quest: The Optimistic Series - Tide Quest Tasks: Discord + Twitter Award of the quest is a NFT, minting price will be <0.5$, so it’s another mechanism as explained earlier to prevent fake accounts to participate, in my opinion. And here the completion of the task page:  Capture602×712 50.1 KB  ",
                    "links": [
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/e/ed1d0619d197319b743a4ef9e3cf12c70958f72d.jpeg"
                    ],
                    "GPT-discussion-categories": [],
                    "Sentiment": 4.333333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/Subli_Defi",
                    "index": "21",
                    "likes": "1",
                    "time": "25/02/2023-20:54:41",
                    "content": "@Michael thiking again at the distribution schedule, i’d like to set up a fixed reward per subscriber of 10 $OP/SUBS. In this way, existing subscribers who do not see the quest immediately won’t de disavantaged, and last subscribers will have the same reward as thr early ones. On the other hand, it’s perfectly aligned with the milestones set previously. I’d like you to consider this option. Thanks ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.692708333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/Luckymonkey",
                    "index": "22",
                    "likes": "2",
                    "time": "26/02/2023-00:11:51",
                    "content": "Been following you on twitter ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Subli_Defi",
                    "index": "23",
                    "likes": "1",
                    "time": "27/02/2023-21:17:11",
                    "content": "@Michael Hello, Following GC observations, my proposal has been updated and is now ready for final review by the GC Members. The following has been updated:   Complete update/upgrade of the Tasks to be eligible for $OP incentives with the aim to maximize engagement and significantly increase Sybil Resistance   Revise $OP allocation schedule to reward subscribers based on their long-term engagement   Name of this new quest: The Optimistic Journey   Change of wallet address   I hope these modifications will meet your expectations. Subli ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.579545454545455
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "24",
                    "likes": "2",
                    "time": "05/03/2023-19:54:13",
                    "content": "Hi @Subli_Defi! Can you provide a Telegram handle or other contact method so the Optimism team can get in touch about paying out this grant! Feel free to DM or email lavande@optimism.io ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.609375
                },
                {
                    "author_link": "https://gov.optimism.io/u/Subli_Defi",
                    "index": "25",
                    "likes": "1",
                    "time": "05/03/2023-20:12:38",
                    "content": "Hi @lavande, i just sent you an email. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "451"
}