{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/op-as-an-mev-staking-token/3202",
            "title": "OP as an MEV staking token ",
            "index": 3202,
            "category": [],
            "tags": [
                "token"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/llllvvuu",
                    "index": "1",
                    "likes": "5",
                    "time": "02/08/2022-05:30:26",
                    "content": "Hi everyone, I wanted to make an alternate proposal than Enabling $OP as a gas token on Optimism Network!. This is an approach which mirrors PoS as well as Fuel Labs. This is not a token price scheme, please read the full post! EDIT: I found some relevant posts where implementation could be discussed: Use OP to decentralize the sequencer and Pragmatic first step towards decentralizing sequencer (this one has recent activity). I apologize for any duplication, although I think reviving the discussion of using $OP specifically (as a counter to less palatable proposals such as gas token) is still its own topic.  Major points  $OP as a gas token does not create revenue for $OP, it only creates velocity. Our objective is much more than to pump price via a monetary premium. Buy-and-burn is too manual, we should reserve monetary policy for spending needs. The revenue of a blockchain, when scalability expands to infinity, is MEV. Giving $OP tokenholders block-ordering rights directly securitizes the revenue into the token, which, in tandem with seigniorage and treasury diversification, allows the DAO to more flexibly fund public goods (real revenue does not always line up with the quantity of good projects to fund - we require monetary expansion and contraction of the treasury) Another benefit of decentralizing MEV is that you get better censorship resistance / liveness. Public goods funding should not have a centralized dependency on Optimism corporation. Although there are short-term gains to “double-dipping” by selling a token and keeping revenue, it’s not good for the long-term brand / ability to fundraise and attract projects   The Economics This may seem to reduce revenue for the ecosystem fund (what the team refers to as “public goods”), however it may actually increase fundedness since if the ecosystem fund holds e.g. 20% of the $OP supply then they go down from 100% to 20% of current revenue but they can sell up to 20% of all future revenue and even print themselves a larger stake. Hence, if we believe the ecosystem to generate a lot of revenue in the long-term then securitization is the most sustainable and flexible way to keep the ecosystem fund wealthy.  How can it be implemented? EDIT: The below was based on a mistaken assumption on my part that the current iteration of MEVA would be conducted off-chain and/or privately between proposer<->builder a la Flashbots. In fact, “we simply repurpose L1 miners and utilize them as block proposers” is a detail from the original MEVA post I had missed which simplifies the implementation as now the L1 contract directly can collect and distribute staking rewards, rather than a rotation of auctioneers. This also avoids randomness of returns for small stakers. See also @polynya 's comment.  sortition: give random $OP staker headstart in committing to L1 (get_beacon_proposer_index). should they also get an inactivity penalty? delegation: in-protocol delegation or in-protocol staking derivatives top-100 (Cosmos) vs slots (Ethereum)? there could be a tool like mev-boost so that the $OP staker can receive MEV blocks progressive decentralization: e.g. centralized entity still sequences 50% of the time  ",
                    "links": [
                        "https://maven11.substack.com/p/the-fuel-for-fast-execution?s=r",
                        "https://gov.optimism.io/t/use-op-to-decentralize-the-sequencer/2626",
                        "https://gov.optimism.io/t/pragmatic-first-step-towards-decentralizing-sequencer/2767",
                        "https://ethresear.ch/t/mev-auction-auctioning-transaction-ordering-rights-as-a-solution-to-miner-extractable-value/6788",
                        "https://gov.optimism.io/t/op-as-an-mev-staking-token/3202/16"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.61468253968254
                },
                {
                    "author_link": "https://gov.optimism.io/u/diligit",
                    "index": "2",
                    "likes": "1",
                    "time": "02/08/2022-09:31:39",
                    "content": "Create, develop, contribute to the Optimism Ecosystem, that’s how value is formed. Proposals like this create artificial value. Need more focus on the ecosystem, unique projects and ideas and very importantly the contributing community. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.99375
                },
                {
                    "author_link": "https://gov.optimism.io/u/llllvvuu",
                    "index": "4",
                    "likes": "1",
                    "time": "02/08/2022-18:47:54",
                    "content": "Sorry, can you be more specific? What role are you suggesting the $OP token plays? For example, why would one purchase an $OP token vs, say, joining the Citizens’ House? re: “artificial value”, please read and understand the proposal. It regards the long-term health of the DAO and its ability to fund public goods. Do you have an alternative to propose regarding funding the “ecosystem” and “contributing community”? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.4
                },
                {
                    "author_link": "https://gov.optimism.io/u/llllvvuu",
                    "index": "5",
                    "likes": "2",
                    "time": "02/08/2022-18:51:21",
                    "content": "Optimism already plans to use MEVA, like you said, to generate revenue. The auction software can instead be made available for $OP stakers to run themselves (much like PBS and/or mev-boost). This securitizes the revenue into the $OP token and, when combined with seigniorage for public goods, allows the DAO treasury to fund public goods more flexibly. If you read the original post, this proposal is, unlike the gas token proposal, explicitly about the long-term health of the DAO and not pumping the token price. The token price is only relevant insofar as the DAO can issue more tokens to raise cash for public goods. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.1875
                },
                {
                    "author_link": "https://gov.optimism.io/u/diligit",
                    "index": "6",
                    "likes": "2",
                    "time": "02/08/2022-19:17:46",
                    "content": "    llllvvuu:  Sorry, can you be more specific?   More specifically: there are development stages of Optimism, some proposals cannot be technically implemented at the moment, about other roles for the OP token, the same is a process. At the moment the role for the OP token has been established, and it is a vision. But any proposal is good for an objective discussion, but such proposals are only for discussion because there is no such proposal type “Establishing the role for the OP token” in the OPerating Manual.     llllvvuu:  joining the Citizens’ House?   *joining the Token House ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.447916666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/llllvvuu",
                    "index": "7",
                    "likes": "2",
                    "time": "02/08/2022-19:22:47",
                    "content": "    diligit:  there is no such proposal type   This is posted in “Ideas & Feedback”, not proposals. As far as “technically implemented”, ETH developers have been working on this, although I’ll let them provide technical feedback.     diligit:  *joining the Token House   You heard me right, I am asking why join the Token House vs the Citizen House, if the economic token does not serve some economic function such as staking and proposing blocks in a decentralized and censorship-resistant manner. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.491071428571428
                },
                {
                    "author_link": "https://gov.optimism.io/u/llllvvuu",
                    "index": "8",
                    "likes": "1",
                    "time": "02/08/2022-19:26:37",
                    "content": "    diligit:  the role for the OP token has been established, and it is a vision   Correct, the Optimism documentation has already described what I’m proposing:  Value accrues to tokenholders through the productive re-deployment of sequencer revenue.  What I’m describing is a realization of this vision. It’s preferable that this revenue is not collected and distributed by the centralized corporation, but directly generated by $OP stakers, which removes a centralized point of failure both from the revenue distribution and from sequencing itself. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.458333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/diligit",
                    "index": "9",
                    "likes": "1",
                    "time": "02/08/2022-19:49:33",
                    "content": "    llllvvuu:  this revenue is not collected and distributed by the centralized corporation   These revenues will be distributed by Citizens House on a decentralised basis.     llllvvuu:  proposing blocks in a decentralized and censorship-resistant manner.   As I said, there are stages of development, and sequencer decentralization is one stage.     llllvvuu:  What I’m describing is a realization of this vision   It’s not the same, what you described is the realization of your vision. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/diligit",
                    "index": "10",
                    "likes": "4",
                    "time": "02/08/2022-19:51:21",
                    "content": "    llllvvuu:  What I’m describing is a realization of this vision.   To tell you the truth, you have your own goals that are aimed at your interests at the moment: more value and utility for the OP token. I have my own goals and interests, I develop my projects on Optimism, without grants or other incentives, and I will never apply for grants because the grant is too much responsibility, and that’s why I understand and don’t propose ideas for artificial value, and I expect the OP token will accumulate value with the development and growth of the ecosystem as normal, ethereum is not the most valuable blockchain because every week adds a new utility to ETH, but due to it’s focus on development and growth of the ecosystem, getting any value takes time and work. I don’t rule out that your idea will be implemented in the future, but at the moment I don’t see that, and again there are certain steps. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.854437229437229
                },
                {
                    "author_link": "https://gov.optimism.io/u/llllvvuu",
                    "index": "12",
                    "likes": "1",
                    "time": "02/08/2022-21:22:09",
                    "content": "(post deleted by author) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/diligit",
                    "index": "13",
                    "likes": "1",
                    "time": "02/08/2022-21:58:47",
                    "content": "This is just my opinion, I like that it’s a new idea on the forum, but I don’t see the implementation of this idea now, maybe the OP team has a different opinion, or maybe the OP team is now working on implementing this idea. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.340909090909091
                },
                {
                    "author_link": "https://gov.optimism.io/u/llllvvuu",
                    "index": "15",
                    "likes": "3",
                    "time": "03/08/2022-17:20:04",
                    "content": "    raho:  Hello & gm @llllvvuu! I’d to apologize if I came off as rude or struck a nerve, as that was certainly not my intention.   Hi @raho no worries and I understand the defensiveness to any “tokenomics”.     raho:  It seems (based on your responses) that you’d be suggesting MEV Auctions (MEVA), is that correct?   Yeah, I think building off that past work would be a promising route. In their original post they mention the roles of “Block producers // Transaction Inclusion” (“Block proposers are most analogous to traditional blockchain miners.”) and “Sequencers // Transaction Ordering”. I think the “Block producers” role is a natural fit for something PoS-like (actually it sounds like they intentionally leave that part open-ended as to who the block producers could be?) using Ethereum-like leader selection (I think get_beacon_proposer_index). Of course, we would have to figure out whether to do the 32 ETH thing or the top 100 thing (Cosmos-style), but either way delegation would be required, because “at-home staking” might be challenging and not likely to get many blocks.     raho:  I am mostly curious if this implementation could have any negative effect on users.   If someone stakes and is inactive, then the rollup root could get committed a bit late, but I actually think this would be fine because 1) there’s already a 7-day dispute period, 2) could probably be discouraged with inactivity penalties. The broader risk is the $OP stakers produce worse blocks than the Optimism team. But I still think it’s good to decentralize it. Finally to be clear on the implementation difficulty resources, this is definitely a major research undertaking that is being worked on across Ethereum, Optimism, other rollups, Cosmos, etc in collaboration so it definitely wouldn’t be production-ready for a while! For example, I can’t find any recent update from the team regarding MEVA but I trust that they are still working on it (since it is their plan for public goods funding). So that’s why I’m only staging this to “Ideas & Feedback”. If I don’t start this discussion early, then much worse / less productive ideas will proliferate regarding what to do with $OP. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.32344470046083
                },
                {
                    "author_link": "https://gov.optimism.io/u/polynya",
                    "index": "16",
                    "likes": "4",
                    "time": "04/08/2022-03:11:23",
                    "content": "This is certainly a pragmatic approach, however I believe PoS and staking is sub-optimal for rollups. Ideally, there should only be 1 sequencer live at a given time, or maybe 2 or 3. 100 or whatever is extremely wasteful. A better approach is simply block producing auctions - which can be held in $OP or $ETH. The winning sequencers need to put up a slashable $OP bond. With some blacklists (whitelists at first) by governance so malicious entities are slashed and ejected. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.319805194805195
                },
                {
                    "author_link": "https://gov.optimism.io/u/llllvvuu",
                    "index": "17",
                    "likes": "1",
                    "time": "04/08/2022-17:42:48",
                    "content": "Ah, so the auction is conducted on L1? (perhaps Dutch?) In that case, I have definitely been overthinking it. My original proposal could just be replaced by a staking contract that gets paid out the rewards. The economic thrust of the proposal remains (though implemented much more simply), where it may seem to reduce revenue for the ecosystem fund (what the team refers to as “public goods”), however it may actually increase fundedness since if the ecosystem fund holds 20% of the $OP supply then they go down from 100% to 20% of current revenue but they can sell up to 20% of all future revenue and even print themselves a larger stake. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.417929292929293
                }
            ]
        }
    ],
    "group_index": "185"
}