{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/proof-of-existence-sybil-resistance/5492",
            "title": "Proof of Existence - Sybil Resistance ",
            "index": 5492,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Grants Council"
            ],
            "tags": [
                "growth",
                "cycle-11"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/Jeffthebaker",
                    "index": "1",
                    "likes": "3",
                    "time": "08/03/2023-00:53:30",
                    "content": "Basic Details Project name: Proof of Existence Author name and contact info (please provide a reliable point of contact for the project.): Zane Huffman (Discord: jeffthebaker#5798 Twitter: jeffthedunker) Jon Greenwood (Discord: Jgr33nwood#1742 Twitter: JonHoldsCrypto) L2 recipient address: 0xB472b4d0F141F495DF37D75c463842D4079125C0 Which Voting Cycle are you applying for?: cycle-11 I confirm that I have read the landing pages for the Builders and Growth Experiments Sub-Committees and that I have determined my proposal is best suited to be reviewed by the Growth Experiments Sub-Committee: [Yes/No]: Yes I understand that Growth Experiments grants are subject to a “no sale rule,” as explained in this post, and I have read the terms of the rule: [Yes/No]: Yes Project Details What are you building?: Proof of Existence is a Sybil Resistance protocol that utilizes biometrics in a privacy-preserving manner to demarcate wallet addresses as being owned by unique individuals on chain. Any project in the Optimism ecosystem can permissionlessly reference POE to gate smart contract interactions, create community privileges, or dole out governance power on a  “per person” basis. In other words, anyone can build without fear of sybil attacks with the inclusion of POE. The “tag” on-chain is a non-transferrable ERC20 token that users are able to mint themselves after they enroll. Sign up only takes a minute and new signups are batched multiple times a day and passed on-chain where users can then mint their tokens. With the help of this grant, we can launch “Proof of Existence v2” Optimism as the pioneer chain. V2 has significant technological improvements, UI/UX enhancements, and most importantly, a better decentralized approach to biometrics providers. These upgrades are outlined in the token distribution section. Why do you believe what you are building is going to succeed?: The importance of Sybil Resistance across the Optimism ecosystem and crypto as a whole is undisputed. Proof of Existence is the best solution on the market for SR and the market has significant demand for said solution - the grant will enable us to appease that demand. How many users does your project have currently? Please include how you arrived at this estimate: We launched the MVP for Proof of Existence in Q2 2021. There are over 1,000 users signed up and over a dozen successful integrations, primarily spanning airdrops and NFT mints. This can be proven using on-chain analytics. How will receiving a grant enable you to further the mission of maximizing the number of users interacting with Optimism? Please include a step-by-step flow of how you imagine this grant can lead to a greater number of user interactions with Optimism: Our grant utilization flow is very straightforward:  We offer an on-chain incentive of OP tokens when users mint their POE token on Optimism. Users sign up and enroll They mint their token after enrollment is processed.  With more users enrolled, our product becomes more powerful, at which point we utilize OP tokens as integration incentives for third party integrations and further entice users with meaningful privileges throughout the Optimism ecosystem .  Projects receive small portions of our OP grant for integration The project offers privileges (ex: minting whitelist) to POE signups More users sign up to chase those privileges Repeat  Tell us about the users you plan to target with this grant. Include any defining characteristics that will help you identify and target them.: Individuals: Crypto-comfortable, savvy individuals who have consistent activity on-chain. These users are looking for good opportunities and are active contributors across different projects and ecosystems. We offer them an OP incentive to get in the door (sign up) and keep them going through integrations where they benefit from their enrollment. Partners: Other projects in the Optimism ecosystem that require some reliable Sybil Resistance for some component of their project. We offer a very strong product that fits their needs and they can easily integrate with. We offer a small chunk of OP to incentivize the partner to opt-in to integrate. How would these users interact with Optimism? For how long?: Our model is a lifetime one: Once users sign up and projects integrate, it becomes a self-fulfilling prophecy that keeps itself going indefinitely into the future. As long as there are users signed up, projects will integrate and pass on privileges. As long as projects have privileges, users will sign up. Provide us with links to any of the following for the project:  Website: https://proofofexistence.xyz  Twitter: @Governor_DAO  Discord/Discourse/Community: Telegram - GovernorProject  Sign up, Documentation, and more may be found at the link above. Do you have any metrics on the project currently? (TVL, transactions, volume, unique addresses, etc. Optimism metrics preferred; please link to public sources such as Dune Analytics, etc.): Our primary Metric is total users. You can reference the number of unique holders of POE to get a reliable source for number of users. Contracts are found in our Docs: https://docs.governordao.org/products-and-services/proof-of-existence/poe-integration-overview Who are your competitors, and are they on Optimism?: Worldcoin Proof-of-Humanity BrightID None of these projects are on Optimism today. Please link to code audits (if any): N/A Team Zane Huffman (Project Lead) Jon Greenwood (Operations) Sidewinder (DevOps) Michael Saad (Growth) Michael Schricker (BizDev) Frenchie (Backend Dev) Urban (Fullstack Dev) Who are your founders?: Zane Huffman, Jon Greenwood What makes your team well-suited to carry out the project described in this proposal? We are the first-to-market in deploying a working, biometrics Sybil Resistance product to production with our MVP of POE v1. We know exactly what business we are in and exactly how to perform the actions required to be successful. Is this your first Web3 project?: No If not, what else have you built? (Share links, Github repository, or any other useful information.): Proof of Existence is part of Governor DAO Governor DAO is a fair launch DAO Collective pushing better standards in crypto project development and governance. Governor DAO is responsible for several build outs on-top-of and around Proof of Existence, including an end-to-end NFT Launchpad, fair token launch model, and a UBI system. A number of projects have utilized Governor DAO services. Last year ROBNESS used Governor DAO to launch his PFP NFT collection. Grant Request What is the size of the grant request? (250k OP max): 100,000 OP How do you justify the size of the grant?: The entirety of this grant is designated to incentivizing new user sign ups and third party protocol integrations. We anticipate that this will meaningfully incentivize 10,000+ unique individuals to sign up and opt-in to the broader Optimism ecosystem. Due to the nature of Proof of Existence, this is as pure of a user onboarding incentive as can be designed. Roadmap and Distribution Plan Describe in discrete steps how you will successfully implement your grant plan:  Integrate primary biometrics partner to Proof of Existence Integrate Optimism network into Proof of Existence sign up flow. Deploy Proof of Existence ERC-20 token contract to Optimism. Deploy Proof of Existence minting contract to Optimism. Create POE-gated OP claim contract to reward new POE signups. Introduce frontend for OP claiming on the Proof of Existence onboarding page. Allocate OP grant tokens to the claim contract and enable claims. Evangelize OP incentivized user onboarding program. Engage Optimism projects as third-party integrations of Proof of Existence.  How will the OP tokens be distributed? (please include % allocated to different initiatives such as user rewards/marketing/liquidity mining. Please also include a justification as to why each of these initiatives align with the problem statement this proposal is solving. Distribution should not include the sale of any tokens by the grantee or the use of tokens for compensation, protocol expenses, etc. See the no sale rule here): 86% (86,000 OP): Proof of Existence onboarding incentivization. The majority of this grant will be distributed outright to 100% unique individuals who onboard through Proof of Existence. Due to the nature of the onboarding, we have certainty that all of these tokens must be distribute to unique individuals. Incentive rewards will be distributed along a curve, further rewarding early signups to help evangelize the program. Users will receive OP on signup as follows: 1-500: 12 OP each (6,000 total) 501-2,500: 10 OP each (20,000 total) 2,501-10,000: 8 OP each (60,000 total) 14% (14,000 OP): Proof of Existence third-party integration incentives. Proof of Existence is a universal protocol that is intended for other projects to permissionlessly integrate into. We will pass on a small amount of OP tokens to incentivize independent third-party developers to integrate POE into their project in a meaningful manner. This can range from 500-2,000 OP per integration, and is intended to help to offset any costs associated with the deployment. Over what period of time will the tokens be distributed for each initiative?: Distribution is not time-gated. Rather, all OP tokens allocated will be incentivized according to real adoption of our Proof of Existence protocol. However, these terms are intended to be highly rewarding for participants. We anticipate it will take no longer than 6-8 weeks to distribute the entirety of the grant. Please provide benchmark milestones for this project. These milestones should guide the Optimism community on the progress of your project throughout your work on the project. Do not use distribution of the grant itself as a milestone:   User signups: The gross number of users signed up for Proof of Existence on Optimism. This can easily be viewed as token holders of POE. Since each wallet holder is a unique user, it is additionally a reliable indicator as to the breadth of exposure into the broader Optimism community. We are targeting 10,000 POE signups on Optimism per the grant.   Third Party integrations: Meaningful, on-chain integrations of Proof of Existence across independent projects across instances like democratic governance, one-per-person NFT minting, and so on. We are targeting 10 third party integrations incentivized through the grant.   Please define critical milestones for this project. Critical milestones are meant to show good-faith efforts to accomplish the project. Non-completion of these milestones could lead to revocation of remaining grant rewards. Do not use distribution of the grant itself as a milestone:  Deployment of Proof of Existence v2 and all associated parts (Biometric integration, smart contract deployment, frontend integration, OP claim contract deployment). Good faith marketing and evangelism efforts to spread Proof of Existence to end users.  This can be gauged by number of user sign ups.   Good faith business development efforts for third parties to integrate POE.  This can be gauged by number of third party integrations.    If the OP tokens are for direct distribution to users, why will incentivized users and liquidity on Optimism remain after incentives dry up?: Proof of Existence is interesting and valuable to numerous projects throughout the Optimism ecosystem and crypto as a whole. Our positioning as a universal solution (sign up once, enrolled for life) suggests that the more users sign up and the more projects integrate with POE, the more powerful the application ones. With the ball rolling, more and more projects will continue to drive sign ups towards POE. As the homebase for our POE v2, projects can only achieve the sybil resistance enforced by Proof of Existence on Optimism. New innovations will be unlocked that cannot exist elsewhere. Please provide any additional information that will facilitate accountability (smart contracts addresses relevant to the proposal, relevant organizational wallet addresses, etc.): In addition to the multi-sig listed above, the Deployer address will be performing deployment of POE to Optimism - 0x26e76280F0C4477726B8a1Dd9AC4996c5c7bADf8 Optimism Relationship Does your project solve a problem for the Optimism ecosystem? If so how?: Optimism has no on-chain, universal mechanism for projects to confidently assign wallet addresses as unique. This is immediately pertinent to the ongoing rounds of OP airdrop - where sybil farming remains at the top of everyone’s mind. Beyond that, developers of all crypto projects have constraints surrounding the inability to limit participation to one account per user. Novel mechanics surrounding token distribution, user incentivization, DAO governance, and more are infeasible due to sybil concerns. Proof of Existence is the only solution to Sybil Resistance that is universal, permissionless to integrate, and non-intrusive to users. Optimism lacks another solution that can readily be used for high stakes sybil defense. Why will this solution be a source of growth for the Optimism ecosystem?: Proof of Existence offers a universal solution for all projects, old and new, to unlock new mechanisms of consensus, distribution, gamification, and so on. New innovations may be introduced to the Optimism ecosystem that otherwise could not exist. Is your project Optimism Native?: The MVP for Proof of Existence was launched to mainnet in 2021. Pending grant approval, POE v2 will launch as an Optimism native buildout. Confirmations I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: [Yes/No]: Yes I understand that I will be expected to following the public grant reporting requirements outlined here: [Yes/No]: Yes ",
                    "links": [
                        "https://docs.governordao.org/products-and-services/proof-of-existence/poe-integration-overview"
                    ],
                    "GPT-summary": "The post is a proposal for a grant for the project \"Proof of Existence,\" which is a Sybil Resistance protocol that utilizes biometrics to demarcate wallet addresses as being owned by unique individuals on chain. The proposal explains the project, its importance, and how the grant will be used to incentivize new user sign-ups and third-party protocol integrations. The post also includes details on the team, competitors, and milestones.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Interoperability and Scaleability",
                        "Privacy, Security and risk management",
                        "Smart contract updates",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.941192001510793
                },
                {
                    "author_link": "https://gov.optimism.io/u/FractalVisions",
                    "index": "2",
                    "likes": "0",
                    "time": "08/03/2023-13:27:10",
                    "content": "Very cool. I love the passion for sybil resistance filtering. Can you explain to me if there is any sort of cross chain tracking mechanism that allows the detection of CEX off/on ramp or cash mixing loopholes that prevent someone from creating multiple accounts? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.19375
                },
                {
                    "author_link": "https://gov.optimism.io/u/Jeffthebaker",
                    "index": "3",
                    "likes": "0",
                    "time": "08/03/2023-16:03:14",
                    "content": "The signup is tethered to your wallet address but the resulting biometric hash that is output from signup is not impacted by the individual wallet. So if a user tries to sign up on a different network or on a different wallet, they will still be flagged as duplicate ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 4.875
                },
                {
                    "author_link": "https://gov.optimism.io/u/GFXlabs",
                    "index": "4",
                    "likes": "2",
                    "time": "14/03/2023-10:54:41",
                    "content": "Thank you for submitting this grant application! Throughout the application process, this forum thread will be one of the official means of communication. Please be sure to monitor it for updates over the course of the review period. At this stage, applications are mainly being reviewed for completeness, and nothing at this stage should be construed as support or opposition by any members of the Grants Council.     Jeffthebaker:  Please provide benchmark milestones for this project. These milestones should guide the Optimism community on the progress of your project throughout your work on the project. Do not use distribution of the grant itself as a milestone:   User signups: The gross number of users signed up for Proof of Existence on Optimism. This can easily be viewed as token holders of POE. Since each wallet holder is a unique user, it is additionally a reliable indicator as to the breadth of exposure into the broader Optimism community. We are targeting 10,000 POE signups on Optimism per the grant.   Third Party integrations: Meaningful, on-chain integrations of Proof of Existence across independent projects across instances like democratic governance, one-per-person NFT minting, and so on. We are targeting 10 third party integrations incentivized through the grant.     Thank you for providing clear numerical targets. To make this section even stronger, we recommend adding explicit dates or time periods (e.g. “within X weeks of grant receipt, there will be…”). Note that benchmark milestones are for the community to judge your progress only.     Jeffthebaker:  Please define critical milestones for this project. Critical milestones are meant to show good-faith efforts to accomplish the project. Non-completion of these milestones could lead to revocation of remaining grant rewards. Do not use distribution of the grant itself as a milestone:  Deployment of Proof of Existence v2 and all associated parts (Biometric integration, smart contract deployment, frontend integration, OP claim contract deployment). Good faith marketing and evangelism efforts to spread Proof of Existence to end users.  This can be gauged by number of user sign ups.   Good faith business development efforts for third parties to integrate POE.  This can be gauged by number of third party integrations.      We recommend greater specificity for critical milestones. While benchmark milestones are “soft” deliverables, critical milestones must be met in order to unlock funding as your grant plan progresses. For your own benefit, they should be very specific and unambiguous so that on X date, it is clear that milestones Y and Z have or have not been met. Further guidance on milestones can be found here: Milestone Assessment  Thank you, and GFX Labs or other Grants Council members will follow up here with any further questions throughout the process. Do not hesitate to ask questions here (tagging whichever Council Member a question is for, or @GrantsOps generally, will increase the speed of response). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.85969387755102
                },
                {
                    "author_link": "https://gov.optimism.io/u/Jeffthebaker",
                    "index": "5",
                    "likes": "1",
                    "time": "14/03/2023-22:02:31",
                    "content": "Thank you for the recommendations and apologies for our errors  We had submitted the original grant before the new form was created. I will work with my team to update ASAP ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.278409090909091
                },
                {
                    "author_link": "https://gov.optimism.io/u/GFXlabs",
                    "index": "6",
                    "likes": "1",
                    "time": "14/03/2023-22:30:37",
                    "content": "    Jeffthebaker:  Thank you for the recommendations and apologies for our errors    No problem, they’re not strictly errors. Part of our job on the Grants Council is to help applicants make stronger grant plans. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "577"
}