{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/is-it-necessary-to-be-on-discord-in-order-to-participate/3821",
            "title": "Is it necessary to be on discord in order to participate? ",
            "index": 3821,
            "category": [],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/DrChaos.eth",
                    "index": "1",
                    "likes": "1",
                    "time": "27/10/2022-10:51:11",
                    "content": "Hi, I self delegated my OP tokens so started to look into projects for cycle 8. Am I missing some important feedback or discussion taking place on discord for this projects? My plan is to vote on those projects I have a good insight, and those for I lack of criteria, I’ll follow the committees or delegates recommendations. Cheers ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/Netrim",
                    "index": "2",
                    "likes": "1",
                    "time": "27/10/2022-14:15:57",
                    "content": "The issue with Discord is that some discussions, specially back and forth become easier. All in all, I would say you are losing some useful information. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/DrChaos.eth",
                    "index": "3",
                    "likes": "0",
                    "time": "27/10/2022-20:42:28",
                    "content": "Oh man… I hate social media haha ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.055555555555555
                },
                {
                    "author_link": "https://gov.optimism.io/u/Netrim",
                    "index": "4",
                    "likes": "0",
                    "time": "27/10/2022-20:47:39",
                    "content": "Considering the length and information required, I am not sure how you can function in the current web3 landscape without discord ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.375
                },
                {
                    "author_link": "https://gov.optimism.io/u/Pelon_ES",
                    "index": "5",
                    "likes": "1",
                    "time": "30/10/2022-11:02:24",
                    "content": "Im sure there’s other means of communication one can do in order to obtain that info of the discussions or even having some spaces for those who aren’t really into discord due to work of other things they might have going on dnt u think? I mean we knw conversations in discord can get lost within min if many r sending messages at the same time n all talking bout dif things as well but there’s other alternatives to discord dnt u think? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.215277777777779
                },
                {
                    "author_link": "https://gov.optimism.io/u/DrChaos.eth",
                    "index": "6",
                    "likes": "0",
                    "time": "30/10/2022-18:00:26",
                    "content": "    Pelon_ES:  mean we knw conversations in discord can get lost within min if many r sending messages at the same time n all talking bout dif things as well but there’s other alternatives to discord dnt u think?   I believe we’re on a transition state for community communications. There is so much cost on being in every social network msg app… They’re all looking for our attention. F**** them all haha. I’m from forum old school. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.372395833333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "7",
                    "likes": "1",
                    "time": "30/10/2022-19:50:42",
                    "content": "Most of Proposal discussion going on this forum, we do use discord to get quick feedback but you’re not missing anything as anything discussed on the discord will reflect here as well, if it’s important for this governance ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.666666666666666
                }
            ]
        }
    ],
    "group_index": "315"
}