{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/pooltogether-grant-update/3531",
            "title": "PoolTogether Grant Update ",
            "index": 3531,
            "category": [
                "\\xf0\\x9f\\x93\\xa2 Updates and Announcements",
                "Grant Updates"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/Leighton",
                    "index": "1",
                    "likes": "20",
                    "time": "22/09/2022-15:22:08",
                    "content": " Summary: PoolTogether is striving to be the front door to DeFi on Optimism. A simple, decentralized protocol that combines social good with excitement. It’s the only DeFi protocol offering the chance for outsize returns without needing to risk your capital. After using PoolTogether, depositors will be ready to try more complicated DeFi protocols. PoolTogether received 450,000 OP tokens on July 20th to help kick-start growth on Optimism. This post updates Optimism governance on how those tokens have been used and the results seen so far.  Usage of $OP & Results: Thus far, PoolTogether has distributed 210,000 OP tokens over 8 weeks to Optimism depositors (average rate of 3,750 OP tokens per day). These OP tokens have been highly effective in driving substantial numbers of unique depositors and dollars deposited. During these 8 weeks, PoolTogether grew from near zero to a peak of $37 million in deposits and 7,140 unique depositors. This peak corresponded with OP price peaking at $2.00 around August 3rd. However, even with the OP price lower, the protocol still retains 6,465 unique depositors on Optimism and $30 million in deposits at the time of writing (September 18th). Optimism has become the #1 network for PoolTogether by deposits with 57% of all deposits on the Optimism network! All Optimism depositors are currently receiving the OP rewards vesting in weekly periods. In addition to the OP rewards, the depositors have a chance for daily prizes distributed by the protocol. As of September 18th, $95,201 in USDC savings prizes have been claimed on the Optimism network by 693 unique depositors. The underlying yield rate earned as averaged slightly over 3% Key Takeaways:  PoolTogether has shown an ability to attract and retain users on Optimism. These depositors and dollars have been both net new and also transferred from other networks. For example, $7 million in deposits on Optimism came from existing PoolTogether users on Polygon moving over. Compared to other DeFi projects like Aave, PoolTogether is far more effective at growing unique depositors. PoolTogether has 6,465 unique USDC depositors distributing 3,750 OP tokens per day. By comparison, Aave has 7,418 unique USDC depositors yet distributes 3.6x more OP tokens per day (13,805 per day to USDC depositors). In very rough numbers, PoolTogether has been able to attract $10 million in TVL for every 1,250 OP tokens distributed per day. This number represents the low end of what we’ve seen and is impacted by the price of $OP in dollar terms The rate of growth for both deposits and depositors has slowed (see stats) at current distribution levels and $OP price we are at a growth plateau The $OP incentives do attract whales that are likely to leave when the $OP rewards end. Currently the top 5 Optimism network depositors make up 28% of all deposited dollars   Looking Forward: There are 240,000 $OP tokens remaining to be distributed for the purpose of growing PoolTogether on Optimism. As we discuss how those tokens should be distributed, a few things should be kept in mind:  OP rewards on Aave are planned to end November 2nd 2022. It’s possible they are renewed but if they are not, we should expect underlying yield to decrease meaningfully on that date. Voting for Optimism governance cycle #7 ends October 20th, voting ends for cycle #8 November 10th. If Optimism governance authorizes more $OP rewards for PoolTogether depositors those would be the likely renewal dates Thus far, TWAB based distribution has been the only mechanism used.  Given the above, we are targeting an 8 week additional distribution. This will mean $OP rewards end November 15th. This date loosely corresponds to the end of $OP incentives on Aave (thus maximizing TVL while yield is high) and also provides ample time for the protocol to request renewed $OP rewards in either cycle #7 or #8. After 8 weeks we will know what yield is on Aave without incentives and can plan accordingly In terms of the distribution rate. We will maintain current rate of 27,500 $OP per week (3,928 per day). Increasing the $OP distribution rate with the goal of increasing prizes is tempting but the data shows us at this stage we are not attracting new depositors, we likely would simply see more whales deposit than we would when $OP rewards end. This would lead to a bump in prizes but also a harder fall if $OP rewards and less sustainable growth for the Optimism network. Alternatively, we could decrease $OP rewards but we risk losing our opportunity to capitalize on the current high Aave yield rates, we also risk needing to decrease overall prizes creating a negative growth feedback loop. Additionally, given the decline in $OP price this would further diminish effective yield at a time when it’s relatively low. The rate of 27,500 only constitutes 220,000 OP tokens, the remaining 20,000 OP tokens would be allocated to alternative growth mechanisms (bounties, Layer3, etc.). This will allow us to test other growth mechanisms.  Growing Prizes & Sustainability: The growth flywheel for the PoolTogether protocol is reliant on getting prizes large enough to attract organic growth in deposits, more deposits in turn make the prizes even larger!  1600×887 107 KB  This is not an exact science but the consensus in the PoolTogether community is that the growth flywheel will start turning when there is around $100,000 in weekly prizes. In the short term, additional incentives whether in the form of OP tokens or others should be designed to help the protocol bridge this gap before organic growth can take off (note the protocol does directly distribute additional USDC to aid this goal). With this in mind, the protocol should always be targeting growing prizes. Currently $4,200 is distributed in daily prizes, this gives us a nice round number to target boosting daily prizes to $5,000 when $40 million in Optimism network deposits are reached. This is a reasonable stretch goal that pushes us to reach an all time high in deposits on Optimism without relying on additional incentives. This goal is based on the assumption of a 3% yield rate on deposited funds. We ask the Optimism community to help us achieve this goal   Phase 2: Pending the results of the current distribution, we anticipate asking Optimism governance for additional $OP tokens to achieve the goal of building PoolTogether as the front door to DeFi on Optimism. We invite any feedback or questions on what has been done so far! ",
                    "links": [
                        "https://dune.com/pooltogether/weeklystats",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/5/55d230314639c4b94b8d90c8a05e21bbc1bf59aa.jpeg",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/9",
                        "https://gov.optimism.io/t/goverance-fund-accountability-an-overview/3591/5",
                        "https://gov.optimism.io/t/mean-finance-grant-update-1/4461",
                        "https://gov.optimism.io/t/7th-op-community-governance-call-october-25th-10am-pt-1pm-et-7pm-cet/3732/10",
                        "https://gov.optimism.io/t/review-gf-phase-1-pooltogether/3747/46",
                        "https://gov.optimism.io/t/review-gf-phase-1-pooltogether/3747"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.589196465299406
                },
                {
                    "author_link": "https://gov.optimism.io/u/grunt",
                    "index": "2",
                    "likes": "3",
                    "time": "23/09/2022-19:06:58",
                    "content": "You love to see it! The program generated a lot of buzz on crypto twitter - IIRC total yield was around 9% and people were very excited. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.854166666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/Leighton",
                    "index": "3",
                    "likes": "4",
                    "time": "25/09/2022-19:05:23",
                    "content": "Yes! In early August when OP price was higher effective yields rate was generally over 10% What I’ve found very encouraging is that even with the lower OP price and effective yields being much lower (less than 5%). We are not seeing churn in TVL and we are seeing increasing usage. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.145833333333332
                },
                {
                    "author_link": "https://gov.optimism.io/u/bagge99",
                    "index": "4",
                    "likes": "1",
                    "time": "27/12/2022-14:55:22",
                    "content": "Who should I delegate to? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/teaser",
                    "index": "5",
                    "likes": "1",
                    "time": "03/01/2023-23:14:18",
                    "content": "Will there be an updated statement about the latest situation? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/Tjark",
                    "index": "6",
                    "likes": "3",
                    "time": "11/01/2023-14:01:43",
                    "content": "    bagge99:  Who should I delegate to?   The PoolTogether community has the PoolCollective which is actively participating in token house governance. You can delegate to their multi-sig: 0x3D2d722B443A5cAE8E41877BB7cD649f3650937C     teaser:  Will there be an updated statement about the latest situation?   The current user incentives are continuing until March 28. You can view this Dune Dashboard for insight into the ongoing OP Rewards. A project building a gamified interface for the PoolTogether protocol on Optimism was funded with a small grant (9,500 OP, 50% distributed). I’m happy to share an update with a v1 of this very shortly. Unrelated to the grant, I’m excited to share some open-source work that PoolTogether Inc has been doing for the Ethereum & Optimism ecosystem: ERC-5164: Cross-Chain Execution. It’s in the review stage and has undergone an audit contest with Code4rena. ",
                    "links": [
                        "https://dune.com/pooltogether/weeklystats",
                        "https://eips.ethereum.org/EIPS/eip-5164",
                        "https://code4rena.com/contests/2022-12-pooltogether-contest"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9226190476190474
                },
                {
                    "author_link": "https://gov.optimism.io/u/Ryba",
                    "index": "7",
                    "likes": "1",
                    "time": "07/02/2023-20:02:54",
                    "content": "    Leighton:  oolTogether is striving to be the front door to DeFi on Optimism. A simple, decentralized protocol that combines social good with excitement . It’s the only DeFi protocol offering the chance for outsize returns without needing to risk your capital. After using PoolTogether, depositors will be ready to try more complicated DeFi protocols. PoolTogether received 450,000 OP tokens on July 20th to help kick-start growth on Optimism. This post updates Optimism governance on how those tokens have been used and the results seen so far. Usage of $OP & Results: Thus far, PoolTogether has distributed 210,000 OP tokens over 8 weeks to Optimis   i thought taht we are donating to OP and they are already distributing tokens on their own descisions. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.787878787878789
                },
                {
                    "author_link": "https://gov.optimism.io/u/Tjark",
                    "index": "8",
                    "likes": "2",
                    "time": "08/02/2023-12:11:50",
                    "content": "    Ryba:  i thought taht we are donating to OP and they are already distributing tokens on their own descisions.   Hey Ryba, this grant came out of the Partner Fund by the Optimism Foundation. You can learn more here. Even though this grant was not issued by the  community, we wanted to be transparent with the use and impact of the received funds. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/Fot63life2000val",
                    "index": "9",
                    "likes": "2",
                    "time": "10/02/2023-06:03:26",
                    "content": "I definitely like the pool together platform and am thankful yall are here! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/crypto23",
                    "index": "10",
                    "likes": "2",
                    "time": "11/02/2023-15:01:15",
                    "content": "Thank you for the grant update ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "265"
}