{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/request-for-community-input-decentragoras-stance-on-l2dao-allegations/5691",
            "title": "Request for Community Input: Decentragora's Stance on L2DAO Allegations ",
            "index": 5691,
            "category": [
                "\\xf0\\x9f\\x8f\\x9b Governance",
                "Grants"
            ],
            "tags": [
                "communication-thread"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/0xzenodotus",
                    "index": "1",
                    "likes": "7",
                    "time": "20/03/2023-23:24:33",
                    "content": " Addressing L2DAO Concerns and Seeking Community Guidance   Dear Optimism Collective and Community Members, I’m reaching out on behalf of Decentragora to address our concerns regarding the recent L2DAO grant. As an active and loyal participant in governance, I want to bring this to the public forum. Decentragora has decided to cut ties with L2DAO to uphold our transparency, ethics, and integrity values. Our project received 20.7% of the tokens in OPIncubator Round 6 (LTIP). The grant (27,500 OP) was allocated to three participating L2 ecosystem projects, as detailed in this DAO proposal. However, in light of the recent allegations surrounding L2DAO, including possible misappropriation and embezzlement of funds, we no longer feel comfortable holding these tokens in our multisig. Our mission at Decentragora is to help tend the infinite garden by building public goods and fostering a regenerative future. We want to distance ourselves from L2DAO and any actions that may cast a shadow on our collective values. Consequently, we are considering returning the OP tokens to the Optimism Foundation and seeking guidance from the Optimism Collective on this matter. As the co-founder of Decentragora, we must uphold our principles and maintain transparency with the community. We believe in the power of decentralized collaboration and want to ensure that our actions reflect our commitment to these ideals. We want to declare, in public, that Decentragora has no involvement in any actions of misappropriation, embezzlement, or misconduct possibly carried out by L2DAO and its affiliates. We strongly condemn such actions and remain committed to maintaining the highest ethical standards in our work, fostering a transparent and regenerative community that supports the growth and sustainability of the blockchain ecosystem. Please share your thoughts and opinions on how to proceed. We appreciate your input and support as we navigate this situation. Sincerely, 0xzenodotus, Co-founder of Decentragora ",
                    "links": [],
                    "GPT-summary": "The co-founder of Decentragora is seeking community input on the recent L2DAO grant and the decision to cut ties with L2DAO due to allegations of misappropriation and embezzlement of funds. The author explains the situation and the values of Decentragora, and asks for guidance on returning the tokens to the Optimism Foundation. The post also declares the author's commitment to maintaining ethical standards and fostering a transparent and regenerative community.",
                    "GPT-proposal-categories": [
                        "Community and engagement",
                        "Grants, Funding and resource allocation",
                        "Law and regulations",
                        "Privacy, Security and risk management",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.648148148148149
                },
                {
                    "author_link": "https://gov.optimism.io/u/Opurrrrrator",
                    "index": "2",
                    "likes": "2",
                    "time": "21/03/2023-01:35:36",
                    "content": "Thank you for raising the topic publicly in the forum. This is my first post on this forum as an outside party that is mainly interested in understanding this decentralized institution, its norms, processes, actors and other aspects, therefore I might excuse in advantage, if there are misunderstandings on my part, I am happy to be corrected. As far as the alleged, yet to be comprehensively proven misconduct of L2DAO and any affiliates goes, a relevant text I could find states:    Grant Proposal Template 📌 Policies and Templates   Phase 1 Proposal Template v2 All Governance Fund grant proposals will be processed by a Grants Council in Season 3. Please submit your application to the Grants Council here following the process outlined here.   ALL CYCLE 11 GRANT PROPOSALS SHOULD USE THE UPDATED TEMPLATE HERE.   Key information about Governance Fund grants 5.4% of the total initial token supply (231,928,234 OP) will be distributed to Optimism projects and communities via the Governance Fund.  A portion of the Governance Fund …      OP received through Growth Experiments Grants should not be sold by the grant recipient. […] Includes the grant recipient, their affiliates and any other related persons. These persons cannot receive OP for the purpose of selling (or if the grant recipient knows they intend to sell) the tokens. […] Includes the direct exchange of OP for crypto or fiat, […] Does not include using OP to incentivize usage  By my personal interpretation of those words and with my limited knowledge about the norms of the optimism collective, I think the question at hand is; if L2DAO had any a priori knowledge or suspicion of a receiver of an L2DAO grant, the affiliate, going to use the grant in a way not permitted by above statute, which as stated above has of course yet to be proven comprehensively and for the sake of fairness should be assumed to not be the case. In the case that by the processes at hand the opposite should be found, I personally would find it unfair to put receivers of an L2DAO grant that acted in accordance with the “no sale” rule and the norms of the Optimism Collective into an uncomfortable position, of possibly having to return a grant that could have already helped to grow the network. Regarding my personal curiosity, I read your snapshot and would like to understand if the different distribution proposals, like  3 months of training and onboarding new analysts ongoing infrastructure costs, including hosting data and any fees incurred marketing our safety rating initiative  were intended to give the OP received from L2DAO to third parties, which more than likely would sell those OP for fiat or crypto in the process, as one can hardly assume that an infrastructure provider accepts OP as means of payment to pay for his bills. If this was the case, that would by my understanding be a violation of the above statute and keeping the OP in the multisig, waiting for the appropriate actors determining how this case in its entirety should be further proceeded, is likely the best course of action for all organizations that received an L2DAO grant. ",
                    "links": [
                        "https://foul-porch-0eb.notion.site/Optimism-Grants-Council-090bb648d1854136b9630c608da7a8bc",
                        "https://foul-porch-0eb.notion.site/Grants-Council-Internal-Procedures-504521342ee0402980321c56f1488542",
                        "https://gov.optimism.io/t/grants-proposal-template-cycle-11/5291"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.30426517926518
                },
                {
                    "author_link": "https://gov.optimism.io/u/0xzenodotus",
                    "index": "3",
                    "likes": "1",
                    "time": "21/03/2023-02:06:18",
                    "content": "Very grateful for your input here! Thank you fren For clarity, we represent the second option of the three:  image1090×412 20.9 KB  And we initially gave forth this method of distribution:  image1408×756 73.1 KB  We did not know and was not made aware of a ‘no sale’ rule prior. We discovered it after the fact, deliberated as a team and decided we would strictly use the tokens for incentives only. As for other recipients of the incubator, I cannot confirm or deny, like others, I can only read optimistic etherscan and speculate — without further information of course. About this;     Opurrrrrator:  Regarding my personal curiosity, I read your snapshot and would like to understand if the different distribution proposals, like  3 months of training and onboarding new analysts ongoing infrastructure costs, including hosting data and any fees incurred marketing our safety rating initiative  were intended to give the OP received from L2DAO to third parties, which more than likely would sell those OP for fiat or crypto in the process, as one can hardly assume that an infrastructure provider accepts OP as means of payment to pay for his bills.   I’m uncertain but share the same assumptions as you. We were aware of the other grants in the incubator saying they would use funds for development and expenses; which is why we submitted the grant with the chosen distribution method and previous assumptions. This was the announcement I gave last month in our Discord about it:  image1714×916 209 KB  We just haven’t posted anything about an actual incentive program yet because we need to design it still and launch to OP mainnet. Again, really appreciate you giving some insight here  ",
                    "links": [
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/4/419ae18b87983f809ad880cd84cc5bbd12daa685.png",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/e/e1c8338a671eef3eb385c1655fc674852b6ee456.jpeg"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.190876152832674
                },
                {
                    "author_link": "https://gov.optimism.io/u/Exosphere",
                    "index": "4",
                    "likes": "1",
                    "time": "21/03/2023-05:43:26",
                    "content": "I just posted a response to the accusations from our point of view:    Layer2DAO response to allegations from Velodrome / OptiChads 🏛 Governance       Hi Optimism community! You might already know me, but if not, I’m Exosphere, one of the core team members of Layer2DAO. I co-founded Layer2DAO at the beginning of 2022 to provide the Ethereum L2 space a central community, coordinate promotional efforts to further the L2 space, and collaborate on projects. I’m also a delegate on Optimism.  Many of our efforts focused on Optimism, as one of the most promising L2 networks. We chose to launch an early adopter NFT collection on Optimism that allowed …     The Layer2DAO community believes in your project and voted to support you. We hope you keep the grant and fulfill your mission! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.104166666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/FractalVisions",
                    "index": "5",
                    "likes": "0",
                    "time": "21/03/2023-05:58:01",
                    "content": "We are also looking for ways to severe all ties with the L2DAO and NFTe after originally hearing their story on Twitter spaces earlier last year where other governance members and people within the community would meet on a regular basis. The original story to build a marketplace in place of Quix isn’t really needed any longer seeing as how the platform is staying in existence for now. Leading all the way up to this point there have been serious doubts about whether the original evidence gathered from another governance member of the forum and the ongoing research of “Where has the OP gone?” Or whether it was an accurate reflection of what’s happening with the grant money. Recent on chain analysis has shown that there has been some very suspicious activity from the grant that was distributed to NFTe and is now being asked about by other members of the governance and community. It is important to look at how these funds were used and it appears there was some sort of manipulation of the NFTe token itself. I suggest looking at the information that has been provided in the current forum that is being discussed or the Gov monitoring channel of Optimism discord where many members of the community and governance have asked about this ongoing topic. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.700520833333334
                }
            ]
        }
    ],
    "group_index": "629"
}