{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/input-on-distribution-of-citzenship/2334",
            "title": "Input on distribution of Citzenship ",
            "index": 2334,
            "category": [],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/Vikram",
                    "index": "1",
                    "likes": "4",
                    "time": "02/06/2022-03:43:09",
                    "content": "In the governance overview, it states: “The mechanism for distributing Citizenships will be determined by the Foundation with input from the Token House.” What input do you have for the Foundation? Governance Overview   Optimism Docs   What is the Optimism Collective? The Optimism Collective is a band of companies, communities, and citizens working together to reward public goods and build a sustainable future for Ethereum. Together we will disp      ",
                    "links": [
                        "https://community.optimism.io/docs/governance/"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/alex",
                    "index": "2",
                    "likes": "0",
                    "time": "02/06/2022-04:10:10",
                    "content": "When I think about “Citizenship” I think about it in terms of “who is a resident/local”? What immediately comes to mind is POAP token holders. That’s a quick answer and I think distribution of Citizenship should be more thought out - but that’s a start. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.083333333333332
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "3",
                    "likes": "2",
                    "time": "02/06/2022-10:26:47",
                    "content": "one important aspect would be tackling sybil so that one person can not posses more than one citizenship. BrightID might be a good option as one can get verified without providing any personal details, its not 100% full proof but its something.  Proof of Humanity comes under same category and but they require some initial fund and lot personal details which I dont support it. One thing is clear, it cant be on the basis of single thing. I am willing to attend and meet OP ecosystem conferences and meetups to prove my citizenship, here I believe my privacy is more preserved, but I am against creating a profile on PoH page as it exposes me to a unnecessary wider audience. Those felling comfortable, sure go ahead but what about audience like me ? Other helping factor might be involvement of the said citizen on this gov portal. I see citizens as someone who is part of the ecosystem and i would expect them to participate and show their involvement. Ideally, thats the end goal right? participation. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.191468253968254
                },
                {
                    "author_link": "https://gov.optimism.io/u/MinimalGravitas",
                    "index": "4",
                    "likes": "3",
                    "time": "02/06/2022-12:03:24",
                    "content": "Would it make sense to combine this thread with https://gov.optimism.io/t/lets-talk-about-identity-in-the-citizens-house ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Vikram",
                    "index": "5",
                    "likes": "0",
                    "time": "02/06/2022-15:19:12",
                    "content": "Personally I think distribution of citizenship should not be based solely on identity. Other factors should be considered like how to distribute to those that will be productive citizens? What criteria will we use to define and prove that a person will be a productive citizen? This is a more open discussion then just identity. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.46875
                },
                {
                    "author_link": "https://gov.optimism.io/u/NicoEsp",
                    "index": "6",
                    "likes": "1",
                    "time": "03/06/2022-13:18:28",
                    "content": "    Vikram:  What criteria will we use to define and prove that a person will be a productive citizen?   Totally agree with you. It can’t be only, for example, likes and comments in this forum because that type of things can be done by bots. We have to think of a better system to measure real participation of citizen. Something like a Productive Score  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.875
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "7",
                    "likes": "0",
                    "time": "13/09/2022-16:57:36",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "8",
                    "likes": "0",
                    "time": "13/09/2022-16:57:41",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "41"
}