{
    "poll_list": [
        {
            "id": "0x36cdf280fe8c3760561e76d57a9e7022cb383e789ce80b70ed791c6a68166afb",
            "title": "Proposal I: Governance Phase 1 - Saddle Finance ",
            "discussion": "https://gov.optimism.io/t/ready-gf-phase-1-proposal-saddle-finance/2842",
            "body": "This Governance Fund Phase 1 proposal has been marked ready and as such is eligible for voting in Cycle 3. This proposal HAS NOT been approved as ready for vote by a delegate, but may still be voted on if desired by delegates. For more info, check out Voting Cycle 3 Roundup: [https://gov.optimism.io/t/voting-cycle-3-roundup/2923/1](https://gov.optimism.io/t/voting-cycle-3-roundup/2923/1)\n\nLink to proposal: https://gov.optimism.io/t/ready-gf-phase-1-proposal-saddle-finance/2842",
            "choices": [
                "For",
                "Against",
                "Abstain"
            ],
            "scores": [
                3386850.9569746377,
                10465755.06028267,
                3553601.3770509395
            ],
            "start": 1657222705,
            "end": 1658345905,
            "snapshot": "14038462",
            "state": "closed",
            "author": "0x47C88bb92B409fF25F6587EA611fac4e55f76007",
            "space": {
                "id": "opcollective.eth",
                "name": "Optimism Collective"
            }
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/ready-gf-phase-1-proposal-saddle-finance/2842",
            "title": "[READY] [GF: Phase 1 Proposal] Saddle Finance ",
            "index": 2842,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Governance Fund: Phase 1"
            ],
            "tags": [
                "cycle-3",
                "not-passed"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/0xWeston",
                    "index": "1",
                    "likes": "12",
                    "time": "30/06/2022-18:52:46",
                    "content": " [GF: Phase 1 Proposal] Saddle Finance  Incentive Proposal Project Name: Saddle Finance Author Name: Weston Nelson - ENS: westonnelson.eth, Twitter: @westonnelson Number of OP tokens requested: 500,000 L2 Recipient Address: Gnosis Safe, 4/7 Multisig on Optimism: 0x2aBD4c0070bc784b7BFD18d947b9d28657070862 Relevant Usage Metrics: For general usage metrics regarding Saddle, please refer to the: Saddle Extended Dashboard on Dune Analytics As well as: DeFi LLama Optimism alignment: Saddle Finance is a decentralized stableswap protocol designed for pegged asset swaps and a team that is deeply aligned with the values of Ethereum and the Optimism Collective. One of Saddle’s core tenets is a commitment to opensource software and this consistent declaration by the team demonstrates how much Public Goods are valued by the Saddle team and community. Core value proposition is to be a leading provider of low slippage trades in pegged assets across multiple chains and be a reliable and trusted platform for many years to come in the DeFi ecosystem. Proposal for token distribution: The OP tokens will ultimately be used to incentivize the adoption of various liquidity pools across the Optimism deployment of Saddle and other potential pools as well, bringing more stablecoins, pegged assets such as $wBTC and $alETH for example, to Optimism’s L2. Saddle is already live on Optimism with 2 liquidity pools, and just yesterday announced a milestone partnership with Frax Finance where the additional deployment of 13 new pools is underway, with 3 of those coming to Optimism. So, attracting liquidity to Optimism is essential and as such the OP token will be used to incentivize ecosystem participants to stake their assets in Saddle’s LPs to earn OP incentives and also the additional incentives from the new $SDL tokenomic upgrade and unlock based largely on models popularized by Curve Finance and Ribbon Finance. How will the OP tokens be distributed? Propose the following distribution of the liquidity mining rewards to begin immediately but also give the team autonomy and flexibility to make changes if need arises due to gauge voting outcomes or new liquidity pools, market dynamics, etc.:  15% $OP - saddleFRAXBP, (FRAX, USDC) 15% $OP - saddleFRAXBP, (saddleFRAXBP, USDT) 30% $OP - saddleFRAXBP, (saddleFRAXBP, sUSD) [Synthetix] 40% $OP - Pools TBD (sETH/ETH, alETH, ETH, sETH, renBTC/wBTC, etc.)  There is also a mechanism is planned for implementation which is a highly creative, gamified mechanism to utilize the $OP tokens to attract additional TVL and users to Optimism in a swift manner. How will this distribution incentivize usage and liquidity on Optimism? Liquidity is highly needed right now on Optimism, and by supporting the Saddle team that is firing on all cylinders; this is an excellent way to signal both Optimism’s commitment to attracting user growth as well as drive real adoption to L2 because of the significant need for another stableswap protocol. Why will the incentivized users and liquidity remain after incentives dry up? Having deep liquidity on any chain is a critical component of long-term sustainability. These incentives will likely lead to significant TVL growth within the Saddle protocol on Optimism and also other protocols on Optimism as users become more comfortable with the L2 and begin to harvest rewards and engage with other protocols - this is a logical outcome when considering how reliable the UX for Optimism has been and volume and net new users is expected to grow significantly from Saddle’s value it brings to the ecosystem combined with the low cost of interacting on L2. Additionally, this also opens the door to multiple other synergies becoming possible. Over what period of time will the tokens be distributed? The OP tokens allocated will be distributed over a 3 month period, and would start from the date Saddle receives the tokens, they will be added to the pools immediately to incentivize user and TVL growth immediately. How much will your project match in co-incentives? Saddle is in the process of deploying significant incentives as the multi-chain partnership with Frax gets moving and gauge system goes into full effect. These are expecting to continue and adapt to market conditions to continually make sure incentives are best aligned with growing both Saddle and L2 adoption on Optimism. Please reference these two blog posts from Saddle for more information about $veSDL and the tokenomics:    Saddle – 28 Jun 22    Introducing a new standard for stability Saddle is happy to announce a deep integration with popular stablecoin provider Frax Finance by launching 13 new base pools and meta pools across various blockchains 🚀🌕. FRAXBP — Frax Base Pool: The New Standard for StabilityAs you might already...         Saddle – 23 Jun 22    Announcing $SDL Token Unlock and $veSDL: Vote-Escrowed SDL Bandits rejoice! The long awaited moment is here: $SDL is now tradable! 💸🤠🚀 It's been a rocky few months and we're all going through a lot right now, so the fact that the unlock and $veSDL is here is even more vital. It is the start of a new chapter,...         ",
                    "links": [
                        "https://etherscan.io/address/0xd131f1bcdd547e067af447dd3c36c99d6be9fdeb",
                        "https://twitter.com/westonnelson",
                        "https://optimistic.etherscan.io/address/0x2aBD4c0070bc784b7BFD18d947b9d28657070862",
                        "https://dune.com/alphast0rm/Saddle",
                        "https://defillama.com/protocol/saddle-finance",
                        "https://blog.saddle.finance/introducing-a-new-standard-for-stability/",
                        "https://blog.saddle.finance/introducing-a-new-standard-for-stability/",
                        "https://blog.saddle.finance/announcing-vesdl-vote-escrowed-saddle/",
                        "https://blog.saddle.finance/announcing-vesdl-vote-escrowed-saddle/",
                        "https://gov.optimism.io/t/voting-cycle-3-roundup/2923"
                    ],
                    "GPT-summary": "The post is a proposal for the distribution of 500,000 OP tokens to incentivize the adoption of various liquidity pools across the Optimism deployment of Saddle and other potential pools as well. The proposal explains the distribution of the tokens and how they will incentivize usage and liquidity on Optimism. The post also mentions a mechanism planned for implementation to utilize the OP tokens to attract additional TVL and users to Optimism in a swift manner. The proposal also addresses the long-term sustainability of the liquidity and the period of time over which the tokens will be distributed.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Interoperability and Scaleability",
                        "Token economics",
                        "Smart contract updates",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.659132917521076
                },
                {
                    "author_link": "https://gov.optimism.io/u/Exosphere",
                    "index": "2",
                    "likes": "3",
                    "time": "30/06/2022-19:27:26",
                    "content": "Great to see Saddle Finance investing into their Optimism expansion. This proposal seems to be comparable to the Balancer/Beethoven proposal, which is widely supported. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/solarcurve",
                    "index": "3",
                    "likes": "4",
                    "time": "30/06/2022-19:43:16",
                    "content": "I wouldn’t say it is very similar really. This proposal, once the OP is spent the liquidity will move on to the next yield farm. Balancer/BeethovenX proposal includes using protocol fees to bribe for pool emissions indefinitely. OP incentives will create artificially high protocol fees which will lead to continued emissions long after the OP has been fully spent. This is your vanilla print OP for Saddle liquidity mining proposal. That is fine of course but imo the Balancer/BeethovenX is quite a bit better compared to this. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.5703703703703695
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "4",
                    "likes": "2",
                    "time": "30/06/2022-20:46:06",
                    "content": "For for lazies, providing the stats from the link provided in the proposal. DefiLama  grafik491×587 26.5 KB  There are many chart on Dune related to different statistics but could not find any chart related to OP Chain. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://gov.optimism.io/u/ScaleWeb3",
                    "index": "5",
                    "likes": "4",
                    "time": "01/07/2022-12:10:40",
                    "content": "This proposal seems to be very short-term focused on liquidity and only broadly discusses co-incentives and long-term alignment with Optimism. In its current shape, we would not support it and recommend a shift in focus towards more sustainable growth on Optimism and long-termism, for example including builder incentives, tooling, co-growth initiatives - considering that Saddle adds only small additional value to the Op ecosystem with Uniswap, Curve and other DEXs already being present. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.215277777777779
                },
                {
                    "author_link": "https://gov.optimism.io/u/solarcurve",
                    "index": "6",
                    "likes": "0",
                    "time": "07/07/2022-22:42:52",
                    "content": "I’m abstaining as voting on a proposal that allocates 100% of OP towards liquidity on a competing exchange to Balancer/BeethovenX could be perceived as a conflict of interest. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/linda",
                    "index": "7",
                    "likes": "2",
                    "time": "08/07/2022-15:27:58",
                    "content": "I will be abstaining from this vote since my fund Scalar is an investor in Saddle. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Beta",
                    "index": "8",
                    "likes": "1",
                    "time": "09/07/2022-18:56:00",
                    "content": "But what about votes of your community? if you’re investor this is doesn’t mean automatically skip, have you already ‘checked a temperature of your voters’? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 3.4375
                },
                {
                    "author_link": "https://gov.optimism.io/u/0xWeston",
                    "index": "9",
                    "likes": "0",
                    "time": "09/07/2022-19:25:18",
                    "content": "Hi Linda - first just wanted to acknowledge you for stating this…this is progress to me…although we may have a long ways to go in improving towards the best governance; if we are here for long-term iteration of governance in the digital world…this kind of transparency is not likely to be ever found from the past/current setups in place…so      So I for one, sincerely appreciate the dedication being put on display here from @linda in regards to the understanding of Delegates’ responsibilities and ethical/moral implications.   I do have some thoughts on this though that I hope you might consider - can go deeper and share more details if necessary too if you would find it helpful, but personally, if I had invested in the Fund, I would then of course want you to be voting “For”; so now throw in this Proposal here, it like automatically puts you in a bit of a pickle no two ways about it!   If we go down the route of any external interests overpowering your influence as a Delegate, I don’t think that is the best path for Optimism because really then it opens the door to almost all Delegates likely having strong arguments made for/against them abstaining in almost all votes…which I just don’t see the best path forward for us all. I think most reasonable people understand this though; but would love to hear other thoughts as well.   With this in mind then, I genuinely don’t see anything wrong - in any capacity - voting for or against something here; in your capacity as a Delegate. As long as the Proposal isn’t clearly malicious; seems reasonable, etc. of course; but beyond that - to me - if the answer is that it passes those standards, my POV would be to vote on the Proposal as you see inclined; without a doubt.   Cheers! Weston  A quick sidenote that is important as well - wanted to get this feedback to the OP team as well as you and @OPUser @Exosphere, other Delegates, one other aspect that I am not sure if it is a bug or what but Abstaining actually seems to hurt Proposals rather than simply doing nothing if I am interpreting Snapshot correctly - so there is some sort of bug; or the Strategy is set incorrectly or something with the Snapshot set up.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.028198653198653
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "10",
                    "likes": "1",
                    "time": "09/07/2022-20:59:59",
                    "content": "    0xWeston:  A quick sidenote that is important as well - wanted to get this feedback to the OP team as well as you and @OPUser @Exosphere-Layer2DAO, other Delegates, one other aspect that I am not sure if it is a bug or what but Abstaining actually seems to hurt Proposals rather than simply doing nothing if I am interpreting Snapshot correctly   Why hurting? Why would you say so? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.166666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/0xWeston",
                    "index": "11",
                    "likes": "0",
                    "time": "09/07/2022-21:02:54",
                    "content": "Good question: So it appears to be set up to somehow change the overall status of the vote… …when to me; an Abstain should not have any impact. I will try to find some examples but hopefully that makes sense! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "12",
                    "likes": "1",
                    "time": "09/07/2022-21:05:54",
                    "content": "Hey @0xWeston thank you for taking the time to write a proposal to Optimism governance. I have some questions.         0xWeston:  One of Saddle’s core tenets is a commitment to opensource software and this consistent declaration by the team demonstrates how much Public Goods are valued by the Saddle team and community.   Your contracts are I guess opensource. Is your frontend and all UI code also?  co-incentives: I am not sure I understand. Can you specify in a few sentences what kind of co-incentives you plan to match the amount of 500,000 $OP with? What puts me off the proposal compared to similar proposals is the amount of tokens (half a mil $OP) and the short duration in which to burn them for incentives (3 months). I think it’s too little a time and too many tokens and the minute they dry up the mercenary users will dissapear.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.217803030303029
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "13",
                    "likes": "1",
                    "time": "09/07/2022-21:13:20",
                    "content": "Hey @0xWeston Thank you for tag and if I havent said this before, I really appreciate your proactive nature and I am not sure how many projects you are involved with but stay with us respective of the result of your proposal, we need community member like you. As far as your comment on abstain is concerned. Here is a comment form Bobby.  image2652×703 120 KB  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.550000000000001
                },
                {
                    "author_link": "https://gov.optimism.io/u/0xWeston",
                    "index": "14",
                    "likes": "0",
                    "time": "09/07/2022-21:23:21",
                    "content": "Cheers!   Wow that was fast lol - thank you for the update! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.166666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/linda",
                    "index": "15",
                    "likes": "2",
                    "time": "09/07/2022-21:33:04",
                    "content": "It’s a tricky position because when you say I should be able to vote for the proposal if it “seems reasonable,” it’s still all subjective based on the person. For those that strongly disagree with me on it, they might say that I was biased in the vote. Since abstaining from the vote does not count towards the voting total, I think this would be the best path at the time if I’m a direct investor in the project. I really don’t have any guidance on this to my knowledge and I would rather be on the conservative side. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.861111111111111
                },
                {
                    "author_link": "https://gov.optimism.io/u/0xWeston",
                    "index": "16",
                    "likes": "0",
                    "time": "09/07/2022-21:42:39",
                    "content": "@lefterisjp - excellent questions!!! #1 For me OSS is a huge part of Web3…which is why I personally took notice of Saddle. To answer your question, an emphatic YES!  Here is the Saddle Organization on GitHub and then the specific repositories for the smart contracts that make up the protocol are here and the frontend code here. This is very important to me personally as well. #2 To keep it brief (can go deeper if needed) - co-incentives are essence baked into Saddle’s $SDL emissions based on the mechanics of the $veSDL tokenomic design. It is quite clever in this regard because in order to vote for emissions you must hold and lock $SDL (and thus obtain governance voting power of thing such as emissions) - If there happened to be some freshly launched pools on Optimism that had appealing $OP incentives attached to them; if I put myself in a user’s shoes, and I have the ability to vote for an LP for more emissions of $SDL on any of the chains Saddle is deployed on and the pools available…would $OP incentives impact my decision? 100%; I’d likely come to Optimism. #3 I hear you in this regard - again could be a long answer  but to try and be brief: I believe we will see teams with massive OP allocations end up bringing virtually zero long-term value to Optimism, and many with less end up bringing substantial value. That being said; What I would say to get to the heart of the matter here is that the team at Saddle is quite nimble and this is what is most important; an example for instance: Arbitrum Odyssey is suddenly halted - probably makes sense to come together as a community and redirect incentives/new game plan. With the partnership in place with Frax. By consistently reviewing the effectiveness of the incentives and iterating on their distribution, as well as keeping a close eye to what is happening across the crypto ecosystem, I believe Saddle is as well equipped as any protocol to responsibly and effectively deploy incentives. I hope these answers are helpful to you; and thank you for the questions! Weston ",
                    "links": [
                        "https://github.com/saddle-finance/saddle-contract",
                        "https://github.com/saddle-finance/saddle-frontend"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.073901098901099
                },
                {
                    "author_link": "https://gov.optimism.io/u/0xWeston",
                    "index": "17",
                    "likes": "1",
                    "time": "09/07/2022-21:50:39",
                    "content": "Yes, I hear you completely here! I would agree with you that indeed “seems reasonable” … even that could open up more rabbit holes as well…although I would prefer it didn’t! I really don’t know the perfect answer here; it’s one I think about quite a bit though - gray areas can be so difficult to think through I feel. Regardless; to me this type of dialogue is a net-positive in my mind already.    ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 6.208333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "18",
                    "likes": "1",
                    "time": "09/07/2022-21:50:45",
                    "content": "As I am going through this proposal, I saw that we didnt get any comment on stats for OP chain.     OPUser:  There are many chart on Dune related to different statistics but could not find any chart related to OP Chain.   Second, on co-incentives, would you consider matching the number of token requested with $ value of $SDL ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "19",
                    "likes": "0",
                    "time": "09/07/2022-23:02:30",
                    "content": "this was answered also before since another proposal had this question in the previous round  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.083333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "20",
                    "likes": "1",
                    "time": "09/07/2022-23:08:32",
                    "content": "Thank you for your comments on opensource!     0xWeston:  That being said; What I would say to get to the heart of the matter here is that the team at Saddle is quite nimble and this is what is most important; an example for instance: Arbitrum Odyssey is suddenly halted - probably makes sense to come together as a community and redirect incentives/new game plan. With the partnership in place with Frax.   I am not sure I fully follow here. What is Arbitrum Odyssey? Why is it halted and how is that relevant to your proposal? You probably assume I know something I don’t      0xWeston:  I believe Saddle is as well equipped as any protocol to responsibly and effectively deploy incentives.   Does that mean you can consider increasing the duration of the emission of incentives? To say 12 months? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.631944444444445
                },
                {
                    "author_link": "https://gov.optimism.io/u/emerald",
                    "index": "21",
                    "likes": "2",
                    "time": "10/07/2022-11:29:45",
                    "content": "    lefterisjp:  What is Arbitrum Odyssey?   Arbitrum Odyssey is (or should I say, was) an 8-week event where users could finish “objectives” (lend, borrow, swap, etc.) using selected protocols on Arbitrum One and get NFTs as rewards. Put on hold after week 2 (after bridging week) congestion got out of control and fees rose beyond that of L1’s. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None"
                    ],
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/0xWeston",
                    "index": "22",
                    "likes": "0",
                    "time": "10/07/2022-12:18:26",
                    "content": "    lefterisjp:  Does that mean you can consider increasing the duration of the emission of incentives? To say 12 months?     Oh yes absolutely; I hope that this has been conveyed clearly that my focus on this Proposal for Saddle is less about setting strict deadlines and more about being able to be nimble and fluid in response to market conditions.   There may be times where it makes sense to pull incentives; there may be times to lay them all on the table; times to adjust emission schedules, etc. I think really we have the ability to gather feedback on what is working/not working so fast now that we don’t need all that much time to pinpoint: “here is what will bring explosive growth to Optimism” Just need a bit of trial and error and all will work out quite well in my personal opinion.   The important part here is that none of it is rigidly set in stone and if you have a qualified team in place than can effectively assess where some targeted incentives will likely attract TVL and Users…this is how you win. Not just Saddle, but Optimism. And that is what gets me pumped up.   I really do appreciate the engagement here btw @OPUser @Exosphere @linda and others…makes me as someone who wants to build on Optimism feel like my voice can be heard and responded to; gives everyone interested in the governance process a first row pass into how it actually works, and overall is helping flesh out details that we can iterate on moving forward to keep staying… well…      !!! Cheers again! -Weston ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.9811507936507935
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "23",
                    "likes": "1",
                    "time": "10/07/2022-14:44:07",
                    "content": "Voted: No  Number of token request is very high, current TVL on OP chain is $3K Token distribution duration is 3 months for 500K OP token As this proposal is focused on LP reward, I would like to see the number of token requested matched with project token as a co-incentives  Suggestion:  Match the incentives and I read in the comment that distribution duration can be extended further beyond 3 month which is good, please include that in the proposal. I dont see how user will stay once reward is over, so I would encourage to reduce number of token requested and submit another proposal with on-chain data.  ",
                    "links": [
                        "https://gov.optimism.io/t/voting-cycle-3-roundup/2923/8"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.135
                },
                {
                    "author_link": "https://gov.optimism.io/u/Cryptoz",
                    "index": "24",
                    "likes": "1",
                    "time": "10/07/2022-18:11:29",
                    "content": "I will be voting NO, because the amount of tokens requested is way to high for your TVL and you are using 100% of the funds for liquidity incentives. As soon as the liquidity incentives disappear so will any liquidity. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.8
                },
                {
                    "author_link": "https://gov.optimism.io/u/polynya",
                    "index": "25",
                    "likes": "0",
                    "time": "11/07/2022-03:39:24",
                    "content": "I’m abstaining as I’ve some locked SDL airdrops and it is a minor conflict of interest. However, my opinion is that 3 months distribution is too short. We’re still very early in Optimism’s development. Particularly if there are co-incentives with SDL and Frax/FXS (I’d also like to see more concrete information on that) a longer term campaign is appropriate. Edit: On second thoughts, I’ve changed my vote to Against, as that’s not really a conflict. I only have SDL airdrops and hold 0 tokens to competitors so gain nothing from voting against. Hope to vote for a future proposal with a longer term outlook and co-incentives clearly defined. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.581944444444444
                },
                {
                    "author_link": "https://gov.optimism.io/u/Exosphere",
                    "index": "26",
                    "likes": "1",
                    "time": "11/07/2022-04:13:26",
                    "content": "Voted : Yes Positive track record:  Tokens requested in range comparable to other projects:  Expected to grow Optimism ecosystem:  Great to see Saddle expanding on Optimism. Their TVL has been ballooning over the last few weeks (even as DeFi TVL has struggled as a whole), so I think giving them OP tokens to get jump started on Optimism is a good idea. I don’t agree with the argument that they don’t deserve this amount of tokens because their Optimism TVL is low, since they are very established on other chains and we are trying to draw some of that TVL to Optimism. Yes, some of that TVL will be transitory, as is to be expected with liquidity incentives, but hopefully much of it will remain on Optimism. Overall this proposal does align with the gov fund phase 1 objectives. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.599025974025974
                },
                {
                    "author_link": "https://gov.optimism.io/u/Defi_LATAM_axlvaz",
                    "index": "27",
                    "likes": "0",
                    "time": "12/07/2022-02:23:33",
                    "content": "I am not a delegate, but I am an active member of the DefiLATAM and OptimismESP community. The number of tokens requested is very high, for a $3k TVL and a distribution in 3 months I don’t think it will give good results in the future. ",
                    "links": [
                        "https://twitter.com/OptimismESP"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.968333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/Bobbay_StableLab",
                    "index": "28",
                    "likes": "1",
                    "time": "13/07/2022-08:29:23",
                    "content": "Vote: No It is a very short-term focus as it focuses solely on LM and only across 3 months. We would prefer to see another proposal that has a more long-term view. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.166666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/fewol",
                    "index": "29",
                    "likes": "0",
                    "time": "13/07/2022-14:20:12",
                    "content": "I voted NO  for this proposal. Project value: Good, decent TVL on other chains and I think stable coin projects can bring value for newcomers to crypto that want to hold stable coins Amount: Bad, very high for OP metrics and 3 months distribution is way to little OP distribution: Bad, incentives are short term boost with no long term value ",
                    "links": [
                        "https://gov.optimism.io/t/stablenode-delegate-thread/2973/4"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.659537037037037
                },
                {
                    "author_link": "https://gov.optimism.io/u/0xWeston",
                    "index": "30",
                    "likes": "0",
                    "time": "14/07/2022-04:41:10",
                    "content": "    polynya:  gain nothing from voting against.   Thank you for the feedback @polynya - although I personally find this disappointing to see, I do feel this serves as an example of how not to manage your responsibility as a Delegate of $OP Token Holders - this Proposal is not about you or your personal gain here…but the ecosystem of Optimism: If those are the words you choose to use; I can’t escape the belief that this is how you view things. I would very much appreciate it if you would read back through the Discord posts I shared and see how the discussion began with 12 months, moving to 6, then 3, to ultimately be the “most” effective way of having an incentive program best structured to iterate in cooperation and partnership with Optimism - which was done in reality to serve as the opposite of short-term planning; because this opens up more room for iteration along the journey. I am still here; ready willing and able to answer any questions or concerns on the matter. Weston ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.042307692307692
                },
                {
                    "author_link": "https://gov.optimism.io/u/polynya",
                    "index": "31",
                    "likes": "1",
                    "time": "14/07/2022-06:05:26",
                    "content": "I’m just adding a disclaimer and gauging if or not there’s a conflict of interest, the wording relates to that, not for governance voting at all. My conclusion is there’s not, so I can vote based on what I believe is the best use of Governance Fund Phase 1 - which is completely separate. Accusing me of voting only according to personal gain is a damning accusation. If you can offer more evidence, I’ll immediately resign from my position as a delegate. Thanks. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/0xWeston",
                    "index": "32",
                    "likes": "0",
                    "time": "14/07/2022-06:47:34",
                    "content": "Ok - well I would like to thank you then for adding additional clarification; I am in agreement that holding $SDL is not a conflict in your voting decisions as a Delegate; I see this the same. Also, my apologies re the question of personal gain then if that is not what you meant; reading the words exactly as you posted them left me thinking that was what you meant; I misunderstood there. I noticed that you rather Abstained, but then quickly changed this to Against… due to the timing of incentives being too short; and I have responded as to why this was done as such… It would very much appreciated if you would be willing to take some time to review the Discord again and perhaps some of the on-going updates happening with Saddle. It would really mean a lot to me as well personally as I have put quite a bit of time and effort into this Proposal and all with the best intentions for growing Optimism. Regardless, I do appreciate the engagement and so thank you for this. Weston ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.8060897435897445
                },
                {
                    "author_link": "https://gov.optimism.io/u/lvlojei",
                    "index": "33",
                    "likes": "1",
                    "time": "14/07/2022-09:25:13",
                    "content": "good  thank you for the update!  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.375
                },
                {
                    "author_link": "https://gov.optimism.io/u/0xWeston",
                    "index": "34",
                    "likes": "1",
                    "time": "14/07/2022-18:05:55",
                    "content": "Hey @Bobbay_StableLab  @ing you in here now! Thanks for your willingness to review in light of new information. Much appreciated Ser! The big thing again is the timing aspect - 3 months was decided as a means to iterate and partner in the most effective way possible with OP as opposed to just giving tokens for say an entire year and hoping for the best. Instead; Saddle would have the intent of resubmitting at the end; discuss what went well/didn’t and then iterate on the process and share for all other projects to hopefully benefit from as well! This keeps Saddle accountable to performance and is a win win for everyone. One other exciting item: quick read but if you could take just a sec to view this; i hope you find this encouraging as well!    Saddle Community – 13 Jul 22    [PROPOSAL] SIP-X: Add $sETH/$ETH Pool on Optimism Summary:  This is a proposal to launch a $sETH/$ETH pool on Optimism to create the deepest pair of Synthetic $ETH liquidity on Optimism 🔴   Background/Motivation:  Synthetix is the leading derivatives protocol in DeFi, and has been the most...      Also wanted to add this information as well - I have mentioned the Frax Partnership that Saddle announced last month a few times, but I think the potential impact of this may be being missed by many…so just wanted to highlight how important this could be - the Vote in Frax Governance to launch a FRAX/SDL FraxSwap Gauge just went live a couple hours ago… https://snapshot.org/#/frax.eth/proposal/0x83ba7cc4a38814bac173ba058858b5bb4b7946033f2de7c9b4a678003cd65730 Appreciate you again!  Weston ",
                    "links": [
                        "https://www.saddle.community/t/proposal-sip-x-add-seth-eth-pool-on-optimism/433",
                        "https://snapshot.org/#/frax.eth/proposal/0x83ba7cc4a38814bac173ba058858b5bb4b7946033f2de7c9b4a678003cd65730"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.257369894598154
                },
                {
                    "author_link": "https://gov.optimism.io/u/rasmuky",
                    "index": "35",
                    "likes": "1",
                    "time": "14/07/2022-21:04:46",
                    "content": "@0xWeston - Three primary questions:  Are any of the the swap pairs / pools you are bringing to Optimism unique to Saddle or not currently available on Optimism? For tokens already on Optimism, is there a good dashboard that illustrates the volume of swap activity or pool depth currently on Optimism for the tokens / pairs Saddle would be bringing onto Optimism? How much incremental liquidity would be added? I have seen a lot of comments re: “is Saddle also matching $OP grant rewards with $SDL?” Has that been addressed? Or is the current proposal still for the $OP grant to cover 100% of the liquidity rewards?  Thanks! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.078125
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "36",
                    "likes": "0",
                    "time": "15/07/2022-00:34:28",
                    "content": "I can answer this - of these pools,  Velodrome covers all of them, including Alchemix’s coin (we’ve been in contact with them since launch and have been directly influencing them to move toward Optimism sooner rather than later) The only one i think we don’t have substantial liquidity on is FRAX/USDT. I’d also take a moment to point out that to give Frax a foothold on Optimism we gifted them a veNFT on our launch, and if they desired they could costlessly direct votes to the USDT pool as well. There is currently roughly $2mm FRAX in our pools, ultimately incentivized at our expense. This means that Saddle would provide no new pools to Optimism under this proposal other than perhaps FRAX/USDT, and we’re already directly incentivizing many of these pools in coordination with the token issuers. Our own sETH/ETH pool, for instance, currently has $2.3mm of liquidity in it, also co-incentivized at our expense. I’m probably too conflicted to make any value judgements regarding this proposal, although I’ve seen others do as much without too much pushback, but I think I’m fine to offer factual context. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.757339015151515
                },
                {
                    "author_link": "https://gov.optimism.io/u/FantomFunhouse",
                    "index": "37",
                    "likes": "0",
                    "time": "15/07/2022-00:35:28",
                    "content": "It looks like you’ve decided to spit up some word salad about your project matching any amount of OP that is granted, instead of making a commitment of any kind. This proposal is heavily focused on extremely short term liquidity and as a result, any tokens deployed via grant to this cause will not result in any long-term growth or meaningful infrastructure on Optimism. Looks like you’re just asking the Optimism foundation to bribe your pools instead of fronting the money yourself. Very transparent handout begging. Voting no on this. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 6.1
                },
                {
                    "author_link": "https://gov.optimism.io/u/0xWeston",
                    "index": "38",
                    "likes": "0",
                    "time": "15/07/2022-05:02:55",
                    "content": "This is pretty clearly a fake account just created, to just cause negativity - can posts like this be deleted by @bobby or @vonnie610 or some sort of admin please? It really does hurt the process. Considering the name FantomFunhouse - I really wonder who would do such a thing and what their motivations might be?  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.15
                },
                {
                    "author_link": "https://gov.optimism.io/u/0xWeston",
                    "index": "39",
                    "likes": "0",
                    "time": "15/07/2022-05:24:00",
                    "content": "Thanks for your input @jackanorak - I think Frax Finance will be just fine though and they also are not relevant in this post you are responding to. I find it a bit concerning when someone seems consistently think they have 100% of the answers to every and all questions about DeFi, when in reality none of us do. I respect strong views and engagement; even heated debate; but what you are doing feels of a much different nature and I would appreciate keeping the tone positive. If you have something positive to add or constructive to say; please do; otherwise please refrain from engaging in negative dialogue. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.827272727272728
                },
                {
                    "author_link": "https://gov.optimism.io/u/Bobbay_StableLab",
                    "index": "40",
                    "likes": "1",
                    "time": "15/07/2022-08:55:10",
                    "content": "Hey. I understand your process for coming to 3 months but it is too high of an amount requested for such a short of a time to encourage adoption and might leave you vulnerable to farming mercenaries. If 3 months is your time to iterate, i’d suggest reducing your OP amount. You could request a smaller amount of OP and resubmit at the end of 3-6 months when you have a better idea of what went well. As a community, it seems that a lot of people prefer this path (from what I see in the discussions) Might be worth including all this info in your new submission. Hope this helps. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.372727272727272
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "41",
                    "likes": "1",
                    "time": "15/07/2022-11:56:34",
                    "content": " I respect strong views and engagement; even heated debate; but what you are doing feels of a much different nature and I would appreciate keeping the tone positive.  Because Weston has now maligned my character in multiple places and stood himself up as a defender of constructive feedback, I hope nobody minds a brief response to discuss his conflicts in doing so. Here’s Weston, a competitor, unprompted, commenting in response to a governance proposal made by Thales to partner with us:  image1250×124 23.6 KB   image1284×339 38.8 KB  Without disclosing his conflicts, he made up wild lies about my team, thinking we weren’t there to defend ourselves, and he couldn’t support any of his claims when we confronted him about them, instead continuing to insult us. I didn’t even know at the time he was at Saddle, and now things make a lot more sense. Here all I did was share inconvenient facts in response to a question. Instead of considering potential means of improving his proposal or offering different sorts of pools that would meet an unmet need on Optimism, more dissembling and unprovoked character attacks. I mentioned Frax because Weston had made leveraging their partnership with Frax to establish them on Optimism central to his case. Simply put, they’re already here, on Velodrome, on Uniswap, and on Perpetual Protocol (as collateral!). I will continue to withhold my thoughts about Saddle’s proposal. Out of respect for people’s attention, I’ll do my best not to respond further here. A final note: I wouldn’t hold myself up as a defender of DeFi and best practices in governance while multiple times trying to convince my VC to abandon her principles and vote for my proposal (much respect, @linda ) as Weston has done here. Shameful. ",
                    "links": [
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/1/15b779cd5822299897b6ded56f254c9727c459a7.png",
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-byte-mason-product-suite/2887/76"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.884370015948964
                },
                {
                    "author_link": "https://gov.optimism.io/u/0xWeston",
                    "index": "42",
                    "likes": "0",
                    "time": "16/07/2022-04:12:11",
                    "content": "Hey @jackanorak - thanks so much for the additional insight. Ultimately, agree to disagree. Onwards and upwards. Take care. Weston ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.666666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "43",
                    "likes": "1",
                    "time": "16/07/2022-09:11:10",
                    "content": "Hey Weston, As a proposal can’t change once it’s been to vote I will be forced to vote NO for now. I will echo others and say that you should either increase the duration to something more like 12 months, or if you really need to keep it at 3 months, please reduce the requested amount of OP tokens. 500,000 OP in 3 months is very hard to vote yes on especially with the current TVL on Optimism. Also I would recommend to match the incentives with SDL since this is to incentivize liquidity. I hope to see a revisited proposal from you, and definitely encourage you to take the feedack from the people here to create one. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0148809523809526
                },
                {
                    "author_link": "https://gov.optimism.io/u/quix",
                    "index": "44",
                    "likes": "1",
                    "time": "18/07/2022-18:07:11",
                    "content": "We voted no on this proposal because we don’t believe it’s the best use of funds when comparing the amount requested to the current usage on Optimism. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/SEED_LATAM_Joxes",
                    "index": "45",
                    "likes": "1",
                    "time": "19/07/2022-03:22:05",
                    "content": "[Final] Voting: No Amount not appropriate for its expected distribution.  Contribution: Standard  OP distribution: Neutral  Co-incentives: No (or not confirmed) Impact in LATAM: Neutral   Suggestions: Reducing the amount and including other pools made up of assets native to Optimism and not only pairing with FRAX would be a consideration. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.517857142857143
                },
                {
                    "author_link": "https://gov.optimism.io/u/oper20220601",
                    "index": "46",
                    "likes": "0",
                    "time": "19/07/2022-23:12:39",
                    "content": "you should against other than abstain ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.375
                },
                {
                    "author_link": "https://gov.optimism.io/u/Ruby",
                    "index": "47",
                    "likes": "1",
                    "time": "20/07/2022-22:33:47",
                    "content": "great to see Saddle coming to Op! looking at TVL on Op, cannot believe my eyes, the liquidity is really nothing.  Need to attract more users to Saddle! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 8.041666666666668
                },
                {
                    "author_link": "https://gov.optimism.io/u/vonnie610",
                    "index": "48",
                    "likes": "0",
                    "time": "21/07/2022-12:09:07",
                    "content": "Snapshot vote - not passed ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "49",
                    "likes": "0",
                    "time": "13/09/2022-18:33:22",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "122"
}