{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/grants-council-membership-information/4101",
            "title": "Grants Council Membership Information ",
            "index": 4101,
            "category": [
                "\\xf0\\x9f\\x8f\\x9b Governance",
                "Elections"
            ],
            "tags": [
                "season-3"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/system",
                    "index": "1",
                    "likes": "23",
                    "time": "29/11/2022-14:48:50",
                    "content": "A Council Lead will be selected by the Foundation and 8 Reviewers will be elected by the Token House in Special Voting Cycle #9b.  Lead Application  There is currently an open application process for the Council Lead. The Lead will work closely with top delegates and play an integral administrative and operational role in S3. The Foundation has pre-emptively started the application process as filing this role will help set the Council up for success. If you’re interested in applying to be the Council Lead, please read more about the role and apply here! Applications must be submitted by January 11th at 19:00 GMT.  Reviewer Elections  A total of 8 Reviewers will be elected by the Token House. Those that would like to nominate themselves for these roles must fill out the below template and post here by January 11th at 19:00 GMT . There is no minimum voting power requirement to be a Reviewer.   Council Reviewer Self-Nomination Template  Please keep your answers as concise as possible while conveying all relevant information. Council sub-committee: (Builders or Growth Experiments) If you are a delegate, please provide the link to your delegate commitment: If you are a delegate, please indicate what % of votable supply is delegated to you: (voting power can be referenced here) If you are a delegate, please indicate your voting participation rate in OP governance to date: (You may link to your profile on Karma, if applicable. If not, you can divide the number of Optimism votes under your Snapshot profile by 87, which is the number of Token House votes through Season 2.) Please link to your voting history and any voting rationale you’ve shared: (You may link to your Snapshot profile for voting history. You may link to your delegate communication thread, or any other medium you use to communicate with your delegators, to share your voting rationale.) Please outline any other contributions to the Optimism ecosystem to date: Do you have a technical background? If so, please elaborate: Did you serve on a committee in Season 2? If so, please specify which: Please demonstrate any experience you believe is relevant to this role: Please demonstrate expertise relevant to your Council sub-committee: Please describe your philosophy on what makes a good Governance Fund grant: What types of grant applications would you like to see or what RFPs would you create? This should incorporate your view on what the Optimism ecosystem needs to prioritize right now Please disclose any anticipated conflicts of interest: Please verify that you agree to abide by the delegate code of conduct: Yes Please verify that you understand KYC will be required to receive Council rewards at the end of Season 3: Yes Please verify that you are able to commit 12 hours / week to reviewing grant applications and other Council operations: Yes  Reviewers will be elected via a Snapshot vote in Special Voting Cycle #9b. These Snapshot votes will be Approval Votes, wherein each delegate would be able to vote for as many nominees as they see fit, for each Council sub-committee, with equal voting power. The nominees with the highest percentage of approval votes will be elected to the Council. While the code of conduct stipulates that delegates may not vote on their own candidacy in elections, in the case of approval/ranked choice votes, delegates may vote for themselves, so long as they also cast votes for the remaining elected positions. Example: I can vote for my own candidacy on the Growth Experiments committee, so long as I also cast 4 additional votes (a total of 5 votes, as there are 5 open positions on the sub-committee.) Self-nominations need to be posted here by 1/11/23. Special Voting Cycle #9b will run according to the above procedure from 1/12/23-1/18/23. Season 3 will begin on January 26th.  ",
                    "links": [
                        "https://plaid-cement-e44.notion.site/Council-Lead-Application-7e7e46391a6946a982083557271f2f7a",
                        "https://gov.optimism.io/t/grant-council-reviewer-nominations/4372",
                        "https://dune.com/optimismfnd/optimism-op-token-house",
                        "https://optimism.showkarma.xyz/",
                        "https://gov.optimism.io/t/delegate-code-of-conduct/3943",
                        "https://docs.snapshot.org/proposals/voting-types#approval-voting",
                        "https://gov.optimism.io/t/grant-council-reviewer-nominations/4372",
                        "https://gov.optimism.io/t/grant-council-reviewer-nominations/4372",
                        "https://gov.optimism.io/t/special-voting-cycle-9a-grants-council/4198",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/21",
                        "https://gov.optimism.io/t/recap-community-governance-call-december-6th/4268",
                        "https://gov.optimism.io/t/op-community-governance-call-december-6th-at-10am-pt-1pm-et-7pm-cet/4112"
                    ],
                    "GPT-summary": "The post provides information about the Grants Council Membership for the Optimism ecosystem. It explains the process of selecting a Council Lead and electing 8 Reviewers by the Token House. The post also includes a self-nomination template for those interested in becoming a Council Reviewer. The post does not advertise the proposal, but rather provides information and invites interested parties to apply or nominate themselves.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.696911196911197
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "2",
                    "likes": "0",
                    "time": "06/12/2022-20:30:11",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "3",
                    "likes": "5",
                    "time": "07/12/2022-22:24:53",
                    "content": "Hey Lavande thanks! Some comments.     system:  If you are a delegate, please indicate what % of votable supply is delegated to you:   Would be useful to link to a tool that can spit the result out     system:  If you are a delegate, please indicate your voting participation rate in OP governance to date:   Same here!     system:  Please link to your voting history (and delegate communication thread, if applicable):   Here explain if you just need a link to snapshot (where voting history). Some people like me do not write threads in the forums but:  respond to each vote post in the forum with a reasoning (I argue this is etter to not clutter the forum with delegate specific posts) Also make tweets with voting history for a season with explanations and links for each vote. Example: https://twitter.com/LefterisJP/status/1590314052655681537   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.6875
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "4",
                    "likes": "3",
                    "time": "09/12/2022-01:02:36",
                    "content": "Hey lefterisjp there is a tool created by an OP grant:    Karma - Optimism delegate dashboard   Active delegates of Optimism Find all the active delegates in Optimism DAO along with governance stats across off-chain, forum and discord.      You can link your % votable supply and % voting participation, also voting history and delegate commitment. If you have any feedback for this tool, this is the thread for it:    Karma - Grantee accountability+feedback thread 🏛 Governance       We have made good progress on development of both the tools. The Optimism delegate dashboard is up and running here https://optimism.showkarma.xyz/. This is currently hosted on our subdomain but it is an independent site that can be hosted on any domain. The tool currently displays   Delegates along with their voting percentage and voting power Lifetime and 30 day stats Delegate pitch/statement Voting history/how they voted on each proposal WIP: We will soon start displaying voting reason some d…     I know @mmurthy will be happy to read it. I agree with you on the delegate communication thread. I was lucky to do a specific thread for all my votes rationale, but I saw the utility in how you did it and it will be a pain in the a… if you had to pick every comment you made. ",
                    "links": [
                        "https://optimism.showkarma.xyz/",
                        "https://gov.optimism.io/t/karma-grantee-accountability-feedback-thread/3960/2",
                        "https://optimism.showkarma.xyz/"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving feedback on a tool related to the proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.87037037037037
                },
                {
                    "author_link": "https://gov.optimism.io/u/mmurthy",
                    "index": "5",
                    "likes": "3",
                    "time": "09/12/2022-04:18:21",
                    "content": "Thanks @Gonna.eth, hopefully our tool is useful here. We loaded all the delegate statements from the forum. Voting history: https://optimism.showkarma.xyz/profile/lefteris.eth#votinghistory Delegate statement: Delegates of Optimism DAO As Voting weight and voting pct also available on the site. You can see voting reason for some delegates who manage a dedicated thread too, ex: https://optimism.showkarma.xyz/profile/stablenodegov.eth#votinghistory Happy to add any features to make this process easy. ",
                    "links": [
                        "https://optimism.showkarma.xyz/profile/lefteris.eth#statement",
                        "https://optimism.showkarma.xyz/profile/stablenodegov.eth#votinghistory"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.133333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "6",
                    "likes": "4",
                    "time": "09/12/2022-15:02:21",
                    "content": "Parenthesis added to post to reflect feedback, thanks!   If you are a delegate, please indicate what % of votable supply is delegated to you: (voting power can be referenced here)   If you are a delegate, please indicate your voting participation rate in OP governance to date: (You may link to your profile on Karma, if applicable. If not, you can divide the number of Optimism votes under your Snapshot profile by 87, which is the number of Token House votes through Season 2.)   Please link to your voting history and any voting rationale you’ve shared: (You may link to your Snapshot profile for voting history. You may link to your delegate communication thread, or any other medium you use to communicate with your delegators, to share your voting rationale.)   ",
                    "links": [
                        "https://optimism.showkarma.xyz/"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 2.875
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "7",
                    "likes": "1",
                    "time": "19/12/2022-16:27:48",
                    "content": "    system:  Applications must be submitted by January 4th at 19:00 GMT.   Updated to include deadline for Council Lead application submissions ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "8",
                    "likes": "0",
                    "time": "21/12/2022-18:54:43",
                    "content": "Edited to reflect that the Grants Council proposal has passed in Special Voting Cycle #9a and to include a link to the forum post where nominees should post their self-nominations. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.7857142857142865
                }
            ]
        }
    ],
    "group_index": "358"
}