{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/growth-experiment-bored-town-nft-art-community/5612",
            "title": "Growth Experiment: Bored Town NFT Art Community ",
            "index": 5612,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Grants Council"
            ],
            "tags": [
                "cycle-11"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/sorryvrerror",
                    "index": "1",
                    "likes": "8",
                    "time": "14/03/2023-15:05:10",
                    "content": "Bored Town NFT Art Community Project name: Bored Town Author name and contact info: Slandha @sorryvrerror on behalf of Bored Town community. Twitter: https://twitter.com/BoredTownNFT L2 recipient address: 0x99a9cC2Aaf54F6bE94A437641692A72810f6E9d5 Which Voting Cycle are you applying for?: Cycle 11  IMG_4166 banner2.PNG1920×595 48.6 KB  Project Details What are you building?: Bored Town’s mission is “No utilities, no roadmap, just art” and we’ve grown into a thriving community on Optimism. We encourage engagement and contributions from members through quests, town halls, cross-promotions, and giveaways. Our active Discord and Twitter followings help us promote NFT art and support artists and collectors. We’re dedicated to supporting new artists by showcasing their work and providing resources and guidance. Recently, our founder launched the Bored 101 collection, the first-ever 1/1 art collection on Optimism. Our goal is to expand the reach of NFT art and foster its growth in the Optimism ecosystem. We seek a grant from Optimism to fund an art contest to create a new NFT art collection to promote Bored Town and Optimism. The contest will:  Showcase artists’ skills and creativity Promote NFT art and NFT community on Optimism Attract new collectors to the Optimism ecosystem  Use OP tokens to:  Reward participating artists Incentivize community participation in multiple steps of the contest Encourage the minting of the NFT collection Stimulate trade  By funding this art contest and utilizing OP tokens, Optimism can:  Support the growth of NFT art Promote the NFT community on Optimism Attract new users to the Optimism ecosystem  This collaboration will create a win-win situation for both Bored Town and Optimism.  BOP cover3000×1718 448 KB  Bored Town X Optimism Art Contest: Artists are invited to create Bored Town-inspired art featuring the OP logo. The contest will engage established members of the Optimism NFT community and attract new collectors to vote for their favorite artworks via Snapshot in multiple stages. The top vote-getting pieces will be showcased in a new NFT collection on Optimism. Additionally, a 1/1 art piece from each of the top 25 artists and exclusive NFT artwork from Bored Town will be presented in the collection, further enhancing the marketing prospects for both the artists and Optimism. Why is what you are going to build going to succeed?: Bored Town NFT art community has several key factors that make it well-positioned for success:   Strong Community-Driven Approach: By prioritizing the needs of artists and collectors and putting our community first, Bored Town is building a passionate and engaged user base that is invested in the success of the Optimism NFT community. We are proud to be one of the largest NFT communities on Optimism, with 30.4K Twitter followers, 17.1K Discord members, and 18.5K followers on Quest3. We are confident that our significant following will continue to contribute to the success of our project.   Proven Record: The founder of Bored Town, Sorryvrerror, has a reputation as a trustworthy NFT artist with a decade of experience running a physical business. Her successful NFT collections on OpenSea and Foundation have established her as a respected figure in the Thai NFT artist community. Sorryvrerror has shared her expertise on NFTs and web3 business development through lectures and workshops at Thai universities, and as a guest speaker at several NFT events. Bored Town is committed to fostering long-term growth and building upon its strong reputation in the future.   Incentive Programs for Collectors: Bored Town’s incentive program aims to foster engagement and contributions from the community while encouraging collectors to explore new artists and build diverse NFT art collections. This feedback loop encourages participation and cultivates a loyal and active community.   Growing Popularity of NFT Art: NFT art is a rapidly growing market attracting increasing interest from collectors and investors. As the popularity of NFT art continues to grow, communities like Bored Town are well-positioned to capture a share of this expanding market.   How many users does your project have currently? Please include how you arrived at this estimate: We currently have:  30.4K Twitter followers for Bored Town (Including OpenSea official account) 14.2K followers for founder and artist Sorryvrerror 17.1K Discord members 18.5K followers on Quest3 46.7k questers on Quest3 3,794 Bored Town holders (68% unique owners) 24k all collections holders   FnUslxYWAAYyG0O1200×675 164 KB  Trading volume on Optimism collection:  56.9 ETH trading volume on Bored Town genesis collection Bored Town | Quix  0.32 ETH trading volume on 1/1 art collection (The first 3 NFTs of the collection are sold at 0.11 ETH each) https://opensea.io/collection/bored-101  15.75 ETH trading volume on other Optimism collections: https://opensea.io/collection/boredsurvivors https://opensea.io/collection/bored-wow https://opensea.io/collection/bored-council https://opensea.io/collection/apewarrior https://opensea.io/collection/the-vintract https://opensea.io/collection/alpha-gal https://opensea.io/collection/mangmoom https://opensea.io/collection/xmas-abc   By continuing to onboard users from other blockchain ecosystems we have projects on, we believe we can drive Optimism’s significant growth and help establish it as one of the leading platforms for NFT creation and exchange.  FnUkBQwaMAAYE--1200×675 181 KB  Trading volume on collection outside Optimism:  35 ETH trading volume on Faceless Portraits collection (Ethereum chain) https://opensea.io/collection/faceless-portraits  15 ETH trading volume on Arbiturm One collection https://opensea.io/collection/robonautnft https://opensea.io/collection/novanaut https://opensea.io/collection/roboskull  18 ETH trading volume on Arbitrum Nova collection https://opensea.io/collection/nova-ape  2531 APT sale volume on Aptos collection Souffl3  Experimental collection on zkSync (testnet) Mint Square  Experimental collection on Solana https://opensea.io/collection/solonautsnft  Experimental collection on Base Goerli Bitza - Marketplace | Gamma   How will receiving a grant enable you to further the mission of maximizing the number of users interacting with Optimism? Please include a step-by-step flow of how you imagine this grant can lead to a greater number of user interactions with Optimism: The grant will enable us to organize an art contest to generate interest and engagement around the Optimism ecosystem, attract new users, and encourage existing ones to participate. We aim to maximize the number of users interacting with Optimism through this creative and engaging event. The following strategies will be implemented to achieve this:   Organize an inclusive and accessible art contest that attracts a diverse range of artists, including those new to NFTs and the Optimism ecosystem, offering support to artists who need assistance.   Encourage the artists’ supporters to participate in the contest by giving them voting tickets. This will help generate excitement and engagement around the contest and attract new users to Optimism.   Offer established Optimism community members voting privileges and target new members from the NFT art community to participate in the voting process. This will help engage existing users and attract new ones to Optimism.   Provide collectors with the opportunity to mint from the newly created NFT collection and receive incentives. This will incentivize collectors to participate in the contest.   Enable new users to learn about Optimism NFTs and onboard by offering trading incentives. This will encourage new users to explore Optimism and engage with the community.   Note: Submitting artwork and the multiple stages of voting will all require a transaction on Optimism. Tell us about the users you plan to target with this grant. Include any defining characteristics that will help you identify and target them: The art contest plan aims to target several categories of users with different defining characteristics. These include: 1. Artists: The art contest plan’s primary target is artists interested in creating NFTs on Optimism. These may include digital artists, graphic designers, and traditional artists who want to explore the NFT space. They will be identified through their online presence, social media, art communities, and online portfolios. 2. Art Collectors: The contest will also attract art collectors interested in collecting unique and creative NFTs. These individuals may be identified through their engagement in art communities, online marketplaces, and social media. 3. Existing Optimism Users: The contest will provide existing Optimism users opportunity to engage with the platform and potentially earn rewards. These users can be identified through their activity on the Optimism platform, social media engagement, and active participation in the community. 4. New Users: The art contest plan can also attract new users to the Optimism platform by allowing them to learn about NFTs and engage with the platform through a creative and engaging event. These users may be identified through their interest in art, NFTs, and blockchain technology, and can be reached through targeted advertising, social media campaigns, and online communities. How would these users interact with Optimism? For how long?: The art contest plan aims to target users who will interact with Optimism in various ways based on their interests and motivations. Here are some examples of how these users may engage with Optimism: Artists: Participating artists will interact with Optimism by creating and submitting NFTs inspired by Bored Town and Optimism. The duration of their interaction may vary depending on their progress in the contest, the support they receive from the community, and their interest in Optimism ecosystem. It’s worth noting that artists will be required to make transactions on Optimism at each stage of voting tickets for their supporters. Art Collectors: Art collectors participating in the contest will interact with Optimism by using their voting ticket, minting, and trading the NFT collection. They may also explore the platform’s marketplace to discover new and unique NFTs. The duration of their interaction may depend on the availability and desirability of NFT artwork in Optimism ecosystem. Existing Optimism Users: Existing users participating in the contest will interact with Optimism by using voting privileges, minting and trading the new NFT collection, and discovering new artists they want to collect in the future. New Users: New users who are attracted to the platform through the art contest will interact with Optimism by learning about new NFT projects and artists, exploring the platform’s features, voting, and minting the new NFT collection. Ideally, they will purchase other NFTs and participate in the community. The duration of their interaction may depend on their level of interest and satisfaction with Optimism ecosystem. By requiring transactions on Optimism and Twitter activity at each contest stage, we can drive traffic to Optimism and increase user interactions. We believe this will be a valuable opportunity to promote the ecosystem and attract new users while engaging existing ones. Provide us with links to any of the following for the project:  Website: NFTs  Twitter: https://twitter.com/BoredTownNFT  Quest3: Bored Town  Discord: Bored Town  LinkTree: Bored Town | Twitter | Linktree  OP Radio: OP Radio #16: Bored Town Original NFT Collection - YouTube   Do you have any metrics on the project currently? (TVL, transactions, volume, unique addresses, etc. Optimism metrics preferred; please link to public sources such as Dune Analytics, etc.):    NFTScan    Bored Town - Collection | Optimism NFTScan Bored Town is a collection of 5555 Bored Town Monsters living on the Optimism blockchain. Created by sorryvrerror, a Thai NFT artist. Bored Town holders have the chance to create derivative work whatever they put their mind to, both for personal and...      Who are your competitors, and are they on Optimism?: We believe there’s no direct competition among NFT projects as art is subjective and our style is unique. We see the success of all Optimism NFT projects mutually beneficial. Projects of similar size include Optichads, Ganland, and Apetimism. All of them are on Optimism. Please link to code audits (if any): -  IMGL56691920×1280 132 KB  Team Who are your founders?: Founder/artist: Slandha https://twitter.com/sorryvrerror_co Co-founder/CMO: Eric https://twitter.com/Noglamourboy What makes your team well-suited to carry out the project described in this proposal? Our team has made significant strides in the NFT community over the past two years, building a vast network through collaborations with various projects, artists, collectors, and developers across multiple platforms such as Solana, Near, and Tezos. In addition, we have provided NFT lectures to universities and corporations in Thailand, while also serving as mentors to several artists. These efforts have strengthened our connections and reputation within the thriving Thai-based web 3 community. Our use of Quest3 platform over the past few months has resulted in a significant following of 18,533 individuals. Additionally, we have amassed an impressive number of 46,694 questers who have joined us and eagerly anticipate our next quest. Our partners, Superposition, are also instrumental in blue-chip NFT projects on Ethereum, such as The Flower Girls (https://opensea.io/collection/the-flower-girls) and The Stoics by Gabe Weis (https://opensea.io/collection/thestoics) Omnisea Launchpad and Zonic Marketplace are partners that have already established within the Optimism ecosystem. Their objective is to provide support to NFT artists and foster the growth of the NFT ecosystem by creating incentives for both artists and collectors. Is this your first Web3 project?: No If not, what else have you built? (Share links, Github repository, or any other useful information.):  OpenSea    Faceless Portraits - Collection | OpenSea **“Faceless Portraits\"** is my genesis collection that I began as a way to calm my mind during the COVID-19 pandemic. I felt stressed due to the sudden changes in my life and the uncertainty surrounding it.   Inspired by my Buddhist heritage, the...         foundation.app    sorryvrerror (@sorryvrerror) | Foundation 'sorry, we're error' My error mode is what brought me to art, where I can focus my mind and express the things that I cannot put into words.         eth.co    The Faceless Portraits | sorryvrerror.eth “Faceless Portraits\" is my genesis collection that I began as a way to calm my mind during the COVID-19 pandemic. I felt stressed due to the sudden changes in my life and the uncertainty surrounding it. Inspired by my Buddhist heritage, the mandala...         |Superposition>    Superposition: Gamified Experiences and Token Rewards for Web3 Businesses Superposition is a platform for web3 businesses to activate their audience with gamified experiences and token rewards. We provide data-driven insights to help projects understand their users and optimize their products for the web3 world. Our goal...      Grant Request What is the size of the grant request?: 50,000 How do you justify the size of the grant?: We justify the grant size based on the potential influx of users, increased engagement opportunities, and promotion for the NFT community. Attracting quality artists to create on Optimism will enhance its reputation among NFT collectors and serve as a valuable advertisement for the platform. Our grant proposal aligns with past successful NFT community grants. It includes a sustained promotion and participation period to distribute the OP token to discourage mercenary behavior and foster a supportive community. Additionally, all of the royalties from the NFT collection will be donated to Public Goods. Roadmap and Distribution Plan Describe in discrete steps how you will successfully implement your grant plan: Week 1: Art contest preparation  Define the art contest guidelines, submission deadline, and theme. Promote the art contest to NFT artists and NFT communities.  Week 2-4: Bored Town derivative art contest submission  Invite NFT artists to participate and offer voting tickets to their supporters. Artists submit their artwork on Quest3.  Week 5-8: Bored Town derivative art contest 1st round  The team selects artworks that follow the rules. Artists who pass the 1st round receive rewards for their submissions. Giveaway voting tickets to artists’ supporters, Bored Town community members, and other NFT community members.  Week 9-12: Bored Town derivative art contest 2nd round  Voting ticket holders vote for the top 100 artworks. Announce the winners. Whitelist giveaway to voters.  Week 12-24: Bored Town derivative art collection  Create a collection of artworks that passed the 1st round. The compilation will also include an additional 1/1 art piece from the top 25 artists, and new, exclusive NFTs from Bored Town. Allow whitelisted wallets to mint on the Omnisea launchpad to receive mint-to-earn OP and shared royalties from the collection in the future. Let collectors trade on the Zonic marketplace to receive OP rewards  How will the OP tokens be distributed? (please include % allocated to different initiatives such as user rewards/marketing/liquidity mining. Please also include a justification as to why each of these initiatives align with the problem statement this proposal is solving. Distribution should not include the sale of any tokens by the grantee or the use of tokens for compensation, protocol expenses, etc. See the no sale rule here.):   30% for Bored Town Art Contest prizes.   20% for promoting the art contest partnering with Quest3 and Superposition to create a series of quests that require users to bridge their ETH to Optimism.   50% Incentivize Bored Town community and voters to mint, trade, and participate in quests by offering rewards.   Over what period of time will the tokens be distributed for each initiative? 6 months Please provide benchmark milestones for this project. These milestones should guide the Optimism community on the progress of your project throughout your work on the project. Do not use distribution of the grant itself as a milestone. Week 1: Finalize and publish the art contest guidelines and theme. Week 4: Deadline for artists to submit their artwork. Week 5-6: Complete the selection process of artworks that follow the rules. Week 7: Rewards are distributed to artists who passed the 1st round. Week 11: Winners of the art contest are announced. Week 12: Whitelist giveaway to voters. Week 24: Launch of the Bored Town derivative art collection, allowing whitelisted wallets to mint on the Omnisea launchpad to receive mint-to-earn OP and shared royalties from the collection in the future. Please define critical milestones for this project. Critical milestones are meant to show good-faith efforts to accomplish the project. Non-completion of these milestones could lead to revocation of remaining grant rewards. Do not use distribution of the grant itself as a milestone. Week 1: Finalizing and publishing the art contest guidelines and theme. This milestone is critical to ensure that artists clearly understand the rules and theme, allowing them to submit their artwork accordingly. Week 4: Deadline for artists to submit their artwork. This milestone is critical to ensure that all submissions are received on time and that the selection process can begin. Week 7: Distributing rewards to artists who passed the 1st round. This milestone is critical to ensure that artists receive their rewards as promised and are motivated to participate in future projects. Week 11: Announcing the winners of the art contest. This milestone is critical to ensure winners receive recognition and their artwork is showcased accordingly. Week 24: Launching the Bored Town derivative art collection. This milestone is critical to ensure that the project’s ultimate goal of creating a collection of high-quality derivative artwork is achieved, and that collectors can start trading on the Zonic marketplace to receive OP rewards. If the OP tokens are for direct distribution to users, why will incentivized users and liquidity on Optimism remain after incentives dry up? While the direct distribution of OP tokens may incentivize users to participate in the Bored Town community and liquidity on Optimism in the short term, it is essential to consider the long-term sustainability of these incentives. Once the incentives dry up, it is possible that some users may lose interest in the community and move on to other opportunities. To ensure that incentivized users and liquidity on Optimism remain after the incentives dry up, Bored Town focuses on creating a strong and engaged community committed to the project’s long-term success. This could involve:  Creating a culture of engagement and participation through regular community events, discussions, and collaborations. Offering ongoing support and resources to NFT artists to encourage the creation of high-quality and unique artwork. Continuously exploring and implementing new features and partnerships that enhance the user experience and increase the value of being a part of the Bored Town community. Building solid relationships with other communities and projects in the NFT and blockchain space to foster collaboration and grow the overall ecosystem.  By focusing on these strategies, Bored Town can build a sustainable and engaged community that is motivated to participate and contribute even after the initial incentives have dried up. Please provide any additional information that will facilitate accountability:(smart contracts addresses relevant to the proposal, relevant organizational wallet addresses, etc.)    Optimistic Ethereum L2 Explorer   Bored Town (BORED) Token Tracker | Optimism Bored Town (BORED) Token Tracker on Etherscan shows the price of the Token $0.0000, total supply 5,555, number of holders 3,789 and updated information of the token. The token tracker page also shows the analytics and historical data.      Optimism Relationship Does your project solve a problem for the Optimism ecosystem? If so how?: We aim to increase awareness of Optimism’s NFT space and onboard new users by filling a void in the community through an art-focused project. We aim to attract more talented artists and passionate collectors to create a stronger and more engaged community that spreads awareness of Optimism’s NFT space as a reliable and low-cost blockchain with a promising future. At present, we have partnered with three organizations to provide a range of resources and support for NFT artists: 1. Superposition - We are working with Superposition (https://app.superposition.to/), a unique NFT art-based quest platform, to provide artists with new and engaging ways to showcase their work and build a following within our community. 2. Omnisea - This is a no-code omnichain launchpad (https://omnisea.org/) that allows artists to easily create NFTs from their files without the need to navigate generative programs or deal with IPFS-related challenges. 3. Zonic - We have partnered with this layer 2-based marketplace (https://zonic.app/) to provide NFT artists with an additional platform to showcase and sell their work. Together, these partnerships allow us to provide a range of resources and tools for NFT artists, helping them to create and sell their work with ease while also engaging with our community in innovative and exciting ways. Thanks to the support of all our partners, we plan to introduce a range of incentives to reward collectors who actively support our artists by engaging in activities such as minting, trading, and contributing to quests. We also aim to encourage our community members to spread the word about our community, as we believe that our success is intrinsically tied to the success of our talented artists and their supporters. By providing these incentives and building a stronger, more engaged community, we believe we can create a vibrant and sustainable ecosystem for NFT art in the Bored Town NFT art community. Why will this solution be a source of growth for the Optimism ecosystem?: The solution outlined above has the potential to be a source of growth for the Optimism ecosystem in several ways: 1. Attracting new artists: By hosting an art contest, the Optimism ecosystem can attract new artists who are interested in creating NFTs on the platform. This strategic move can not only contribute to an upsurge in the quantity of NFTs being produced but also bring in new collectors to foster the growth of the ecosystem. 2. Generating interest and engagement: The art contest can generate interest and engagement from the wider NFT community, including artists, collectors, and art enthusiasts. This can help to create a buzz around the Optimism ecosystem and encourage more people to participate. Overall, by addressing the needs of both artists and collectors and building a strong, engaged community around NFT art, we believe that our solution can help to drive growth for the Optimism ecosystem and create a more sustainable and vibrant ecosystem for NFT art on the platform. Is your project Optimism Native?: Yes  Fqy4SKpaIAEhJOT1920×1080 459 KB   We offer something beyond numbers, a culture where people believe in something beyond measure. We’re creating an art community, a chill space to create and make friends, just like a park in the midst of a busy city  Confirmations I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: Yes I confirm that I have read the landing pages for the Builders and Growth Experiments Sub-Committees and that I have determined my proposal is best suited to be reviewed by the Growth Experiments Sub-Committee: Yes I understand that Growth Experiments grants are subject to a “no sale rule,” as explained in this post, and I have read the terms of the rule: Yes I agree to comply with the no sale rule: Yes I understand that I will be expected to following the public grant reporting requirements outlined here: Yes ",
                    "links": [
                        "https://twitter.com/BoredTownNFT",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/3/3d76b18dc54db3b76f466c747c34745dda8f301c.jpeg",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/3/32523576581dce6f80d1927caa852b794abe1b20.jpeg",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/2/2fa592e3d359c34e84bc2183540258c4f5f2afde.jpeg",
                        "https://qx.app/collection/boredtown",
                        "https://opensea.io/collection/bored-101",
                        "https://opensea.io/collection/boredsurvivors",
                        "https://opensea.io/collection/bored-wow",
                        "https://opensea.io/collection/bored-council",
                        "https://opensea.io/collection/apewarrior",
                        "https://opensea.io/collection/the-vintract",
                        "https://opensea.io/collection/alpha-gal",
                        "https://opensea.io/collection/mangmoom",
                        "https://opensea.io/collection/xmas-abc",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/3/3e4b8f000721bdafb5f39ec02d1dc1ccd6dd2741.jpeg",
                        "https://opensea.io/collection/faceless-portraits",
                        "https://opensea.io/collection/robonautnft",
                        "https://opensea.io/collection/novanaut",
                        "https://opensea.io/collection/roboskull",
                        "https://opensea.io/collection/nova-ape",
                        "https://souffl3.com/collection/2QBkgEbSVFK1KrYtQPKTon4oWQFzEYSkTjgYk9apX9s9f8fWb1B1BwYiTArz6waxh",
                        "https://mintsquare.io/collection/zksync-testnet/0xde5db4f4f88481f8e48be723abee968734196638/activities",
                        "https://opensea.io/collection/solonautsnft",
                        "https://gamma.io/collections/bitza",
                        "https://boredtown.app/nfts",
                        "https://twitter.com/BoredTownNFT",
                        "https://app.quest3.xyz/boredtown",
                        "https://discord.gg/boredtown",
                        "https://linktr.ee/boredtown",
                        "https://youtu.be/477UdeqmHgI",
                        "https://optimism.nftscan.com/0x8e56343adafa62dac9c9a8ac8c742851b0fb8b03",
                        "https://optimism.nftscan.com/0x8e56343adafa62dac9c9a8ac8c742851b0fb8b03",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/b/b78681b4bcc97183da7915166ecaffba364cf236.jpeg",
                        "https://twitter.com/sorryvrerror_co",
                        "https://twitter.com/Noglamourboy",
                        "https://opensea.io/collection/the-flower-girls",
                        "https://opensea.io/collection/thestoics",
                        "https://opensea.io/collection/faceless-portraits",
                        "https://opensea.io/collection/faceless-portraits",
                        "https://foundation.app/@sorryvrerror",
                        "https://foundation.app/@sorryvrerror",
                        "https://sorryvrerror.eth.co/showcase",
                        "https://sorryvrerror.eth.co/showcase",
                        "https://app.superposition.to/",
                        "https://app.superposition.to/",
                        "http://calendar.google.com/calendar/u/0/r?tab=mc",
                        "https://optimistic.etherscan.io/token/0x8E56343adAFA62DaC9C9A8ac8c742851B0fb8b03",
                        "https://optimistic.etherscan.io/token/0x8E56343adAFA62DaC9C9A8ac8c742851B0fb8b03",
                        "https://app.superposition.to/",
                        "https://omnisea.org/",
                        "https://zonic.app/",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/d/d397301146cccb7bf8b76fb69422e32c074449bb.jpeg",
                        "https://foul-porch-0eb.notion.site/Builders-Sub-Committee-02ba9da5b4534fbf955e6e4c8fcf1aa3",
                        "https://foul-porch-0eb.notion.site/Growth-Experiments-Sub-Committee-270d2f75ff0f410a869b2ba6a8324006",
                        "https://gov.optimism.io/t/grant-proposal-template/3233",
                        "https://gov.optimism.io/t/suggested-public-reporting-requirements-for-grantees/4176"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.151408825093036
                },
                {
                    "author_link": "https://gov.optimism.io/u/FractalVisions",
                    "index": "2",
                    "likes": "3",
                    "time": "14/03/2023-15:55:15",
                    "content": "Very nice job on the proposal. I am glad to see that you have re-submitted for the cycle 11. The more creativity on optimism. The better! I hope to see many new creators and users of the network come from your ecosystem. I see there are not specific dates on the milestones, so I think that would help out a lot if you can provide that information. Have a great day! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.525852272727272
                },
                {
                    "author_link": "https://gov.optimism.io/u/opti.domains",
                    "index": "3",
                    "likes": "5",
                    "time": "14/03/2023-17:57:53",
                    "content": "Looking forward to collaborate with your community! Looking forward to designing our campaigns to support this on our side. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/sorryvrerror",
                    "index": "4",
                    "likes": "2",
                    "time": "15/03/2023-01:42:07",
                    "content": "Thanks a lot! Looking forward to collaborate with you too! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5625
                },
                {
                    "author_link": "https://gov.optimism.io/u/sorryvrerror",
                    "index": "5",
                    "likes": "2",
                    "time": "15/03/2023-02:40:40",
                    "content": "Thanks a lot, brother! We appreciate you taking the time to read through and providing feedback. We’re really excited about the growth of Optimism and the prospect of attracting more artists and collectors. We’re not sure about specific dates yet since we have to start the project after receiving approval of the grant so we just gave the timeline by the week for now. If we are selected to the next round, we could update with more exact dates. Have a great day!  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.2124999999999995
                },
                {
                    "author_link": "https://gov.optimism.io/u/Desol",
                    "index": "6",
                    "likes": "3",
                    "time": "15/03/2023-14:53:37",
                    "content": "Thank you for creating Bored Town. Thank you Bored Town for creating a good society. thank you good society that creates good opportunities Thank you for the great opportunity that made us meet ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.583333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/Dicaso",
                    "index": "7",
                    "likes": "5",
                    "time": "15/03/2023-18:03:57",
                    "content": "Good proposal and I fully support it. Bored Town is one of the biggest NFT communities on Optimism. Last cycle no NFT projects got funding. This and many other factors such as the failiure of Quix has lead to Optimism NFT volume falling off a cliff, especially when compared to competitors like Arbitrum and Polygon that have prospered in the same period. Proposals like this are needed or the Optimism NFT ecosystem to succeed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.359375
                },
                {
                    "author_link": "https://gov.optimism.io/u/Mark_De.Fi",
                    "index": "8",
                    "likes": "3",
                    "time": "15/03/2023-19:01:26",
                    "content": "I think that is actually a great suggestion for the development of the Optimism ecosystem, because such simple projects also contain huge TVL in other ecosystems And I definitely see this project as a great option to develop the NFT market within the ecosystem as it is actually under active development Looking forward to updates on new art ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.939015151515151
                },
                {
                    "author_link": "https://gov.optimism.io/u/sorryvrerror",
                    "index": "9",
                    "likes": "2",
                    "time": "17/03/2023-14:39:35",
                    "content": "Thank you for supporting and believing in us kha  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/sorryvrerror",
                    "index": "10",
                    "likes": "2",
                    "time": "17/03/2023-14:40:08",
                    "content": "Thank you for supporting, brother! With luck, we can get this proposal approved. I think it would be a win for all of projects as we aim to generate more exposure for the Optimism NFT Community. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.6875
                },
                {
                    "author_link": "https://gov.optimism.io/u/sorryvrerror",
                    "index": "11",
                    "likes": "3",
                    "time": "17/03/2023-14:51:08",
                    "content": "Thank you for taking the time to review our project and for your support.  We believe that NFTs play a vital role in introducing new users to web3. NFTs offer a visual representation of what one is investing in, and with a wide range of styles available, there is likely to be something that appeals to them. By gaining an understanding of NFTs and how they operate within web3, they can then progress to explore DeFi and other dapps. With the low transaction fee and safety on Optimism, we believe it’s the good place for web3 newbies. The NFT community here is also so supportive. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.805681818181818
                },
                {
                    "author_link": "https://gov.optimism.io/u/Mark_De.Fi",
                    "index": "12",
                    "likes": "2",
                    "time": "17/03/2023-15:25:15",
                    "content": "Exactly, I fully support this approach. As in fact, it seems to me it is the popularization for example on opensea L2 NFT became much more popular Optimism is likely to make the NFT market even more accessible and popular     sorryvrerror:  We believe that NFTs play a vital role in introducing new users to web3   And of course I actually like the idea of introducing web3 to the NFT market, that’s actually a super interesting idea ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.622790404040404
                },
                {
                    "author_link": "https://gov.optimism.io/u/Michael",
                    "index": "13",
                    "likes": "2",
                    "time": "20/03/2023-03:33:28",
                    "content": "Thank you for submitting this grant application! Throughout the application process, this forum thread will be one of the official means of communication. Please be sure to monitor it for updates over the course of the review period. At this stage, applications are mainly being reviewed for completeness, and nothing at this stage should be construed as support or opposition by any members of the Grants Council. The main thing that needs to be updated is the milestone assessment. Please follow these guidelines: Milestone Assessment. There needs to be a specific measurable metric that we can use to distribute the remaining portion of the grant. Thanks for your submission and let me know if you have any questions! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.083333333333333
                }
            ]
        }
    ],
    "group_index": "612"
}