{
    "poll_list": [
        {
            "id": "0x219e6f3cc726c24e7eb100959abea6cc3a5c24a24ffec3072a7784d33f030096",
            "title": "Proposal A: Governance Phase 1 - Rocket Pool",
            "discussion": "https://gov.optimism.io/t/ready-gf-phase-1-rocket-pool/2822",
            "body": "This Governance Fund Phase 1 proposal has been marked ready and as such is eligible for voting in Cycle 4. This proposal HAS been approved as ready for vote by a delegate. For more info, check out Voting Cycle 4 Roundup: [https://gov.optimism.io/t/voting-cycle-4-roundup/3055](https://gov.optimism.io/t/voting-cycle-4-roundup/3055)\n\nLink to proposal: https://gov.optimism.io/t/ready-gf-phase-1-rocket-pool/2822",
            "choices": [
                "For",
                "Against",
                "Abstain"
            ],
            "scores": [
                17908270.531453848,
                75357.5905498584,
                1129916.1856257168
            ],
            "start": 1658430191,
            "end": 1659553391,
            "snapshot": "15277393",
            "state": "closed",
            "author": "0x47C88bb92B409fF25F6587EA611fac4e55f76007",
            "space": {
                "id": "opcollective.eth",
                "name": "Optimism Collective"
            }
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/ready-gf-phase-1-rocket-pool/2822",
            "title": "[Ready] [GF: Phase 1] Rocket Pool ",
            "index": 2822,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Governance Fund: Phase 1"
            ],
            "tags": [
                "cycle-4",
                "passed"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/langers",
                    "index": "1",
                    "likes": "30",
                    "time": "28/06/2022-03:53:17",
                    "content": "[GF: Phase 1] Rocket Pool Incentive Proposal Project Name: Rocket Pool  Author Name: halzen, langers (GM of Rocket Pool) Number of OP tokens requested: 600,000 L2 Recipient Address: TBD Multi-sig Relevant Usage Metrics: (TVL, transactions, volume, unique addresses, etc.) For general metrics: Defi Llama: https://defillama.com/protocol/rocket-pool?denomination=ETH Etherscan (rETH): https://etherscan.io/token/0xae78736cd615f374d3085123a210448e74fc6393 Rocketscan: https://rocketscan.io/ MakerDAO’s in-depth analysis of Rocket Pool:   The Maker Forum – 20 May 22    [rETH] Collateral Onboarding Risk Evaluation Legal Disclaimer: This communication is provided for information purposes only. The views expressed here are those of the individual quoted or who present said materials and are not the views of Maker Foundation (“Maker”) or its affiliates. This...  Reading time: 12 mins 🕑 Likes: 34 ❤       Optimism Alignment: Rocket Pool facilitates liquid staking, and the ability to become a node operator with less than 32 ETH, without compromising on Ethereum’s core values. Rocket Pool is open source, decentralised, permissionless, client diverse, and non-custodial. Node Operators: The Rocket Pool protocol currently has 1,261 permissionless node operators, making it the most decentralised liquid staking protocol. rETH stakers: Liquid stakers deposit ETH into Rocket Pool and receive rETH in return. In the event of a slashing, the node operator’s 16 ETH, and then their RPL collateral are penalised first, to protect rETH holders from this risk. Benefits: In light of recent discussions regarding self-limiting of staking pools above a certain threshold of staked ETH market share (15%, 22%, 33%), it is net positive to promote the growth of a decentralised liquid staking protocol below this threshold level. Promoting rETH liquidity on Layer 2 provides users with access to a liquid staking derivative (LSD) for ETH whilst also maintaining and supporting the decentralisation and security of Ethereum, and thus also Optimism. It further democratises access to ETH staking, by providing opportunity for users that cannot afford the transaction fees necessary to acquire rETH on Layer 1 mainnet. Proposal for token distribution: OP tokens will be utilised to incentivise adoption of rETH across the Optimism Layer 2 ecosystem through a targeted liquidity mining program. How will the OP tokens be distributed? rETH liquidity should primarily be targeted against ETH, in addition to the other major trading pairs on Optimism. Accordingly, we propose the following allocation of $OP for liquidity mining rewards:  70% $OP - A main Balancer/BeethovenX rETH/WETH pool 30% $OP - Velodrome rETH/WETH pair  How will this distribution incentivize usage and liquidity on Optimism? Liquidity for LSD’s is fundamental to achieving adoption, volume and TVL in the context of rETH liquidity pools on decentralised exchanges, and also to drive growth in other applications that integrate with rETH, and Optimism as a network. There is already 1,387 rETH on Optimism, and it is well positioned to incentivise further adoption. Additionally:  The ecosystem is becoming increasingly aware of the issues of centralisation, lack of client diversity, and concentration of staked ETH among a small number of staking providers. Increasing liquidity for rETH will attract users to Optimism, as it will provide an affordable route to access a decentralised liquid staked ETH token. Liquid staking derivatives are an essential money lego in any DeFi ecosystem, and promoting rETH liquidity increases the utility of Optimism applications for end users. rETH demand and adoption is growing, including recent integrations with Ribbon finance, and the final stages of integration with MakerDAO as a collateral option. We anticipate demand will continue to grow, and incentivising liquidity on Optimism will allow Optimism to capture this growth too.  Why will the incentivized users and liquidity remain after incentives dry up? Liquidity begets liquidity. The promotion of rETH liquidity on Optimism facilitates the possibility of further integrations, which create new usecases that drive further demand for rETH within the ecosystem and continue to promote liquidity. This has been evident on layer 1 mainnet, where current integrations are now being approved following the increased liquidity of rETH. We expect the incentivised liquidity to accelerate integrations which will allow rETH to be used as collateral in lending protocols, and as a yield bearing token in LP positions and other money legos in the defi ecosystem. The inherent staking yield for rETH means it is well positioned to sustain demand, and foster ongoing sticky liquidity and TVL on Optimism. Over what period of time will the tokens be distributed? The OP tokens allocated will be distributed over a 6 month period, commencing two weeks after the allocation of $OP grant tokens. How much will your project match in co-incentives? A Rocket Pool governance vote will be raised shortly to determine whether co-incentives will be issued from the Rocket Pool treasury. ",
                    "links": [
                        "https://forum.makerdao.com/t/reth-collateral-onboarding-risk-evaluation/15286",
                        "https://forum.makerdao.com/t/reth-collateral-onboarding-risk-evaluation/15286",
                        "https://gov.optimism.io/t/voting-cycle-4-roundup/3055",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-lido/2752/19",
                        "https://gov.optimism.io/t/draft-gf-phase-1-across-protocol/3163/47",
                        "https://gov.optimism.io/t/conflicts-of-interest-request-for-opinions/3350",
                        "https://gov.optimism.io/t/gfx-labs-delegate-communication-thread/2728/14",
                        "https://gov.optimism.io/t/jack-anorak-delegate-communication-thread/4367/2"
                    ],
                    "GPT-summary": "The post is an explanation of the Rocket Pool Incentive Proposal, which aims to incentivize the adoption of rETH across the Optimism Layer 2 ecosystem through a targeted liquidity mining program. The proposal includes details on how the OP tokens will be distributed and how they will incentivize usage and liquidity on Optimism. The post also mentions positive feedback from MakerDAO and the potential for further integrations and use cases for rETH.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Interoperability and Scaleability",
                        "Token economics",
                        "Smart contract updates",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.195182855339105
                },
                {
                    "author_link": "https://gov.optimism.io/u/panukresko",
                    "index": "2",
                    "likes": "1",
                    "time": "28/06/2022-20:04:41",
                    "content": "Highly appraise the project and the role it has in PoS. That said (and same applies to Lido proposal) - wouldn’t it make more sense to just incentivize majority to Curve LP’s and rest to USDC with a longer distribution? I do not understand the need for other pools, with the exception of rETH/wstETH. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.66875
                },
                {
                    "author_link": "https://gov.optimism.io/u/millie",
                    "index": "3",
                    "likes": "2",
                    "time": "28/06/2022-21:45:24",
                    "content": "This distribution is quite similar to the one in the Lido proposal, Is there a particular reason you think an rETH/ETH Curve pool is superior to a Uniswap V3 rETH/ETH pool? Is the plan to incentivize full range liquidity for the rETH/USDC pool and what staking mechanism will be used? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.520833333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/langers",
                    "index": "4",
                    "likes": "1",
                    "time": "29/06/2022-04:35:30",
                    "content": "    panukresko:  Highly appraise the project and the role it has in PoS. That said (and same applies to Lido proposal) - wouldn’t it make more sense to just incentivize majority to Curve LP’s and rest to USDC with a longer distribution? I do not understand the need for other pools, with the exception of rETH/wstETH.   Thank you for the feed back @panukresko The primary goal is to develop liquidity for integrations further enriching the Optimism ecosystem but a secondary goal is to establish rETH as a base pairing within the ecosystem. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 4.908333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/solarcurve",
                    "index": "5",
                    "likes": "3",
                    "time": "29/06/2022-13:00:59",
                    "content": "In support of this proposal. Balancer & BeethovenX plan to support rETH liquidity on our own even though we aren’t given an allocation in the proposal. At least that means I can vote for it without any conflict of interest I suppose  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving entirely positive feedback on proposal"
                    ],
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/Exosphere",
                    "index": "6",
                    "likes": "3",
                    "time": "30/06/2022-17:17:14",
                    "content": "Great to see this proposal. Building rETH liquidity on Optimism is a great use of $OP tokens, in my opinion. I am in favour of this proposal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/SEED_LATAM_Joxes",
                    "index": "7",
                    "likes": "1",
                    "time": "30/06/2022-19:27:17",
                    "content": "Context see our post in Lido Going through the feedback above, I’m thinking about these doubts and risks particularly on the centralized staking situation (I understand that rocket pool takes a more reasonable path and not purely centralized), which is a layer 1 issue that affects the Optimism Network in the worst case. I’m attentive to the Rocket pool forum for news and operations of the project itself. How about being a bit more meticulous (both RocketPool and OP governance) about reducing the amount of OP tokens (lets say 500k) and keeping the same expected period (6 months) and see what impact these services and stability have when the Merge finally happen and so on. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.254329004329005
                },
                {
                    "author_link": "https://gov.optimism.io/u/halzen",
                    "index": "8",
                    "likes": "7",
                    "time": "30/06/2022-23:10:31",
                    "content": "Thanks for your response @SEED_LATAM_Joxes. If you are concerned about the risks of centralisation, then we are on the same page! There is a very strong case that this proposal should be supported, precisely due to the risks of centralisation posed by Lido and Centralised Exchange staking providers. For clarity, Rocket Pool is decentralised.  There is over 1200 permissionless node operators on the Rocket Pool network, compared to approximately 30 permissioned node operators for Lido. The Rocket Pool team does not stake ETH on behalf of users, nor does it choose a small permissioned set of node operators perform this task. Anyone can be a node operator on Rocket Pool, if they have the appropriate amount of collateral (much the same as a solo validator on the beacon chain). It is non-custodial, Rocket Pool does not hold the ETH of stakers, nor have access to it. Neither does it manually match ETH from rETH stakers to node operators - this is performed by a smart contract. Similarly, when withdrawals are enabled, this will also performed by a smart contract. In terms of market share, Lido has approximately 31.8% of the total market share of staked ETH, compared to Rocket Pool at 1.8%.  I completely agree with your concerns around the risk of centralisation. In my opinion, supporting a decentralised staking pool, with a smaller market share, is the best possible way to address these risks, and protect the security and decentralisation of L1, and Optimism as an L2 which inherits these attributes. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5439223057644105
                },
                {
                    "author_link": "https://gov.optimism.io/u/ScaleWeb3",
                    "index": "9",
                    "likes": "3",
                    "time": "01/07/2022-11:17:20",
                    "content": "Staking is key to the security of Ethereum > Optimism. RocketPool is among the leaders in the liquid staking space and helps against the centralization of staking in Ethereum. This proposal establishes liquidity on Optimism, enables Optimism users & especially small Eth holders to participate and benefit from staking rewards, and potentially other apps to leverage this yield stream. Overall, this proposal is highly similar to the Lido proposal (except unclear co-incentives) and we strongly support the RocketPool proposal too. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.840277777777778
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "10",
                    "likes": "0",
                    "time": "05/07/2022-18:26:17",
                    "content": "As others has already mention, we need clarity on co-incentives. Raised same suggestion for Lido and will ask the same here too. Do you need 1M OP token with respect to Mean-Test :- ([DRAFT][GF: Phase 1 Proposal] Lido - #23 by OPUser) ",
                    "links": [
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-lido/2752/23"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 3.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/chloeee",
                    "index": "11",
                    "likes": "1",
                    "time": "06/07/2022-00:04:25",
                    "content": "Happy to find out I hold a small portion of 1,387 rETH on Optimism! In fact the first time I ever bridged ETH to Optimism is for doing the swap on Uniswap V3 here to get rETH. Rocket Pool’s market share is growing with the strong support of a value-aligned community. I’m sure this proposal will benefit both Rocket Pool and Optimism.  Hope the questions raised above can get addressed soon so I get to cast my vote(YES) . ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.392361111111111
                },
                {
                    "author_link": "https://gov.optimism.io/u/valdorff",
                    "index": "12",
                    "likes": "4",
                    "time": "06/07/2022-17:17:41",
                    "content": "Hi folks, I’m a Rocket Pool community member and wanted to toss out my 2 cents: We don’t have a budget to match a relevant amount of incentives. Perhaps a symbolic match could be possible if the goal is to see skin in the game?  LDO incentives budget (per a comment in the Lido proposal)  The Lido DAO’s budgets for incentives and rewards programs have been upwards of 4.5M LDO monthly (e.g.: april, june), with overwhelming majority geared towards stETH. Depending on markets and price, this amounts to between $3M and $22M in incentives monthly.  RPL pDAO budget Budget is ~11k RPL/month = $100k-$500k/month depending on markets. This is not RP’s budget for incentives, this is the total pDAO budget (the protocol dao is responsible for long term continued operations, which is a pretty big umbrella). At current market, matching 1M OP would cost more than 4 months of total pDAO budget, which I don’t think is realistic. Again for emphasis - this is not our incentives budget, nor even our marketing budget - this is our total budget.  I encourage folks to look at Rocket Pool as being a significantly different animal than Lido. We have opted to be extremely decentralized. This incurs real costs, especially requiring node operators to take on all the risk and needing to incentivize that. It also has real benefits for the health of Ethereum in general. I have real fears that liquid staking becomes winner take all and that the winner has far too much power. RP is different in kind at this time: (A) we are starting from an order of magnitude lower market share; (B) the community is likely willing to self-limit in some way - we have talked about such things willingly before; (C) in the worst case, the amount of power that they’d have as winners is much lower due to truly being decentralized - node operators need not even update their smart contracts if they don’t wish to. I think Rocket Pool is very well aligned with the Optimistic Vision - in the end, a more decentralized liquid staking solution is well worth the incremental cost because it increases network security. Viewed this way, supporting Rocket Pool is partly to popularize liquid yield-bearing ETH to users on Optimism (yay $) AND it is also a public good to most effectively help secure the L1 we all rely on (yay security and decentralization). ",
                    "links": [
                        "https://www.optimism.io/vision"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.6228354978354975
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "13",
                    "likes": "4",
                    "time": "06/07/2022-20:14:45",
                    "content": "    valdorff:  this is not our incentives budget, nor even our marketing budget - this is our total budget   Thank you for sharing this. If your project does not have a budget for co-incentives then its fine, at least in my opinion. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "None",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.194444444444445
                },
                {
                    "author_link": "https://gov.optimism.io/u/halzen",
                    "index": "14",
                    "likes": "1",
                    "time": "07/07/2022-00:51:58",
                    "content": "Thank you to everyone for your feedback so far. To echo @valdorff, and to provide some further context regarding the practical barriers to Rocket Pool providing co-incentives:   The Rocket Pool protocol DAO (pDAO) treasury earns 15% of the 5% annual inflation of the RPL token, which since launch amounts to a total treasury of 75,367 RPL at present, or $872,000 at current prices. Given the extremely constricted size of the pDAO treasury, it is not feasible to try and emulate Lido’s incentive strategy (which has a monthly incentives budget of $3m-$22m depending on market prices, which is many magnitudes larger than the entire Rocket Pool pDAO treasury)   The pDAO budget is undefined, and there is ongoing discussion regarding how to categorise the budget. There is not currently a budget for liquidity incentives at all, due to other priorities in a limited budget, including marketing, website design, and a community grants and bounties program.   Snapshot voting for pDAO initiatives and other governance processes are still in the process of being implemented.   The Rocket Pool community is strongly aligned with the values of Optimism and would love to offer matched incentives, however for the above reasons, it is probably unlikely that Rocket Pool will be able to provide matched incentives at this stage. I strongly believe that supporting rETH adoption is a worthy goal in itself, on the grounds of being a public good. Rocket Pool promotes the decentralisation of the beacon chain, whilst also acting as an essential counteracting force to Lido’s dominance of the LSD market. We continue to welcome feedback on our proposal, and we are working on how best to incorporate this prior to progressing our proposal to the READY phase. Please feel free to share any additional questions, comments, or concerns you might have. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.8191244239631335
                },
                {
                    "author_link": "https://gov.optimism.io/u/SEED_LATAM_Joxes",
                    "index": "15",
                    "likes": "1",
                    "time": "07/07/2022-01:13:22",
                    "content": "Hi @langers I was thinking a more about this proposal considering potential rejection due to high amount.     SEED_LATAM_Joxes:  How about being a bit more meticulous (both RocketPool and OP governance) about reducing the amount of OP tokens (lets say 500k) and keeping the same expected period (6 months)   Now I believe reducing amount to (by example) 600k in a time lapse of 4 month, this would be enough to later push for a next (2nd) proposal to focus on lending vaults, and continue with the appropriate growth. Let us know what do you think.     langers:  35% $OP - An Uniswap v3 rETH/USDC pool   Can you clarify if there is any particular strategy in which you plan to carry this out? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.616025641025642
                },
                {
                    "author_link": "https://gov.optimism.io/u/halzen",
                    "index": "16",
                    "likes": "1",
                    "time": "07/07/2022-03:44:47",
                    "content": "Hi @SEED_LATAM_Joxes, thanks for your feedback. We have been workshopping how we could amend our proposal in light of the feedback from the community here. We are considering a simplification of the scope of our proposal to focus on rETH/ETH liquidity, which would be a more efficient use of incentives. Additionally, given that Rocket Pool is likely unable to offer matched incentives, we are open to considering a reduction in the requested amount of $OP, as a reasonable compromise. By focusing on rETH/ETH liquidity, we should still be able to use a smaller grant request in an impactful way to foster rETH adoption on Optimism. @langers might have some further thoughts to share regarding this, and we will be sure to keep you updated. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.818181818181818
                },
                {
                    "author_link": "https://gov.optimism.io/u/langers",
                    "index": "17",
                    "likes": "5",
                    "time": "19/07/2022-01:48:49",
                    "content": "Thank you everyone for their feedback. We have taken on board the feedback and discussed at great length with our community. We have decided to:  Not provide co-incentives Because of this we will be reducing our application to 600k rather than 1mil Review the liquidity allocations  We have chosen to allocate $OP to Balancer/BeethovenX and Velodrome because we feel these options give us the best chance of long-term sustainable liquidity on Optimism. Balancer/BeethovenX is also best suited technically to how rETH works - because of its metastable pool feature. We look forward to bringing value to Optimism. This grant will go a long way to developing the liquidity required for integrations and thus rETH utility on Optimism. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPenthusiast",
                    "index": "18",
                    "likes": "2",
                    "time": "22/07/2022-02:28:41",
                    "content": "I appreciate you taking the feedback. With the lower grant request, I would approve this as Rocket Pool gives a good alternative staked ETH besides Lido and promoting competition is healthy. The DEX choices seem perfectly fine to me as it also diversifies staked ETH liquidity among the DEX’s available on Optimism ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.520833333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/emerald",
                    "index": "19",
                    "likes": "2",
                    "time": "22/07/2022-10:07:45",
                    "content": "I would love to see some deep liquidity for rETH/ETH and maybe even some ways to use rETH in DeFi on Optimism. It would be great to have a first mover advantage over the much larger (and less healthy to the staking ecosystem in general) Lido. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.208333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "20",
                    "likes": "3",
                    "time": "22/07/2022-11:24:42",
                    "content": "Voted:- Yes Reason:-  supporting this will boost liquidity of rETH on OP chain Distribution period is reasonable  Cons:- No co-incentives but its clear from @valdorff comment in this tread that team does not have sufficient fund to do so. ",
                    "links": [
                        "https://gov.optimism.io/t/voting-cycle-4-roundup/3055/12"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.916666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/rasmuky",
                    "index": "21",
                    "likes": "3",
                    "time": "22/07/2022-16:19:14",
                    "content": "I missed the comment period so won’t make any recommendations, but will support the proposal given the team was responsive to right-sizing the proposal and I generally think Rocketpool is a positive force for the ecosystem / staking as a service offering. As alluded to by others, it would be great to see future grants more focused on incentives for or marketing of rETH DeFi / general use cases on Optimism so users can earn yield on rETH and do more with the assets (which hopefully drives dedicated users to rETH and to Optimism). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.51948051948052
                },
                {
                    "author_link": "https://gov.optimism.io/u/katie",
                    "index": "22",
                    "likes": "2",
                    "time": "22/07/2022-21:56:15",
                    "content": "Voted yes - This proposal will drive ecosystem growth.  I would prefer if there were matching incentives but I appreciate you reducing the amount requested.  Thank you for the well thought out proposal and incorporating feedback! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/polynya",
                    "index": "23",
                    "likes": "3",
                    "time": "23/07/2022-03:40:20",
                    "content": "Access to Ethereum staking on Optimism is essential, and the concession made in $OP requested in lieu of co-incentives is reasonable, easy For. Somewhat unrelated to this proposal, would still like to see some liquidity on Uniswap V3, though. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.055555555555555
                },
                {
                    "author_link": "https://gov.optimism.io/u/linda",
                    "index": "24",
                    "likes": "2",
                    "time": "25/07/2022-20:18:36",
                    "content": "I’m voting yes on this proposal. I like that Rocket Pool is open source, non-custodial, and already has 1200+ permissionless node operators. I also like that there will at least be a governance vote to potentially provide co-incentives. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 4.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/Bobbay_StableLab",
                    "index": "25",
                    "likes": "1",
                    "time": "25/07/2022-21:42:52",
                    "content": "Vote: Yes Rocket pool has a large name and known for being open source and their staking pools. This is a great way to support liquidity in the op ecosystem. The duration of 6 months is a suitable amount of time too. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal"
                    ],
                    "Sentiment": 6.955357142857142
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "26",
                    "likes": "2",
                    "time": "26/07/2022-16:48:18",
                    "content": "I am going to be voting yes on your proposal. Pros  took on the feedback from the delegates and adjusted the proposal down to 600k OP tokens Rocketpool is a very good project, that tries to promote decentralized non-custodial staking. opensource  Cons  Lack of co-incentives, but I find the explanation on the why (no budget for it) sufficient. And really appreciate the transparency.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.068055555555556
                },
                {
                    "author_link": "https://gov.optimism.io/u/ScaleWeb3",
                    "index": "27",
                    "likes": "1",
                    "time": "26/07/2022-22:38:37",
                    "content": "Voting Yes since Rocket Pool is a quality project and it enables users on Optimism to tap into Eth yield Value-add: Good Amount: Okay Op distribution: Okay Co-incentives: None more info given already above in another comment. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 7.199999999999999
                },
                {
                    "author_link": "https://gov.optimism.io/u/quix",
                    "index": "28",
                    "likes": "3",
                    "time": "27/07/2022-00:16:43",
                    "content": "We voted yes on this proposal. The Rocket Pool team is well established, and we believe this proposal will help grow the Optimism ecosystem by making staking more accessible. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal"
                    ],
                    "Sentiment": 7.1875
                },
                {
                    "author_link": "https://gov.optimism.io/u/zengjiajun.eth",
                    "index": "29",
                    "likes": "2",
                    "time": "27/07/2022-23:06:50",
                    "content": "Rocket pool’s success is Ethereum’s success. I have voted yes for it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/empera22r",
                    "index": "30",
                    "likes": "0",
                    "time": "28/07/2022-05:36:03",
                    "content": "thats good awsome project ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/arabianhorses",
                    "index": "31",
                    "likes": "0",
                    "time": "29/07/2022-19:48:22",
                    "content": "My vote is FOR I LOVE ROCKET POOL also if this proposal pass I  will create a video content that describes how to make some OP by depositing your rETH and WETH into liquidation pools on Optimism. they are helping individuals also Ethereum ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/SEED_LATAM_Joxes",
                    "index": "32",
                    "likes": "3",
                    "time": "30/07/2022-21:05:46",
                    "content": "[Final] Voting: Yes Currently we see it as reasonable to support initiatives that indirectly diversify the current state of staking options in Ethereum, and Rocket Pool is a good example. Liquidity Bootstrapping is an obvious step and we are grateful that Rocket Pool has taken our considerations into account to adjust the amount requested.  Contribution: Positive  OP distribution: Appropriate  Co-incentives: Not confirmed  Impact in LATAM: Neutral   Tips: maintaining rETH liquidity over time in favor of new integrations and use cases is a clear challenge, let us know how we can help (with due pros and cons) in this regard. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.641098484848484
                },
                {
                    "author_link": "https://gov.optimism.io/u/lvlojei",
                    "index": "33",
                    "likes": "0",
                    "time": "03/08/2022-06:55:49",
                    "content": "Hi fam Thank you for sharing this  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/jrocki.eth",
                    "index": "34",
                    "likes": "2",
                    "time": "03/08/2022-13:15:40",
                    "content": "YES   Would like to see Rocket Pool gain traction as a competitor to Lido’s sETH as Rocket Pool is much more decentralized as of now. competition is good   Agree that incentivizing rETH will eventually lead to enough liquidity on OP to use as collateral. Additionally OP could become the place to be for taking out rETH loans as liquidity begets liquidity   Hopefully this good faith vote inspires Rocket Pool’s token holders to vote to match incentives   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 7.375
                },
                {
                    "author_link": "https://gov.optimism.io/u/krzkaczor",
                    "index": "35",
                    "likes": "1",
                    "time": "03/08/2022-16:41:22",
                    "content": "YES Project quality: High - well known and important protocol trying to break LDO monopoly Team quality: HIGH Amount requested: Reasonable OP distribution: Reasonable - rETH needs deep liquidity to be useful. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party giving entirely positive feedback on proposal"
                    ],
                    "Sentiment": 6.014285714285714
                },
                {
                    "author_link": "https://gov.optimism.io/u/vonnie610",
                    "index": "36",
                    "likes": "1",
                    "time": "04/08/2022-12:38:56",
                    "content": "Snapshot vote  - passed ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "37",
                    "likes": "0",
                    "time": "04/08/2022-17:14:37",
                    "content": "@langers can you provide a Telegram handle or other contact method so the Optimism team can get in touch about paying out this grant! Feel free to comment on this thread, DM, or email justine@optimism.io ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.609375
                },
                {
                    "author_link": "https://gov.optimism.io/u/langers",
                    "index": "38",
                    "likes": "0",
                    "time": "04/08/2022-22:58:53",
                    "content": "Hey @lavande I will give you an email, thanks! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/0xWeston",
                    "index": "39",
                    "likes": "2",
                    "time": "04/08/2022-23:17:49",
                    "content": "Rocket Pool is without a doubt the single best liquid staking solution for Ethereum. Very happy to see this! They have a remarkable team, code is opensource so any vulnerabilities are much likely to be discovered and addressed in a dramatically faster form than conpared to projects that choose to keep their source code hidden. Perhaps more important is that Rocket Pool is also leading the charge on decentralization. Lido, on the other hand is quite different here, and although I think Lido is still a net positive, if you believe that having 24 validators means they are decentralized; more study on what makes a protcol resistant to censorship is needed. Rocket Pool will winout in the end in this niche, as the collective drive for freedom enabled by web3 - that can only be attained through real decentralization - is perhaps the most powerful rocket fuel in the world. Can’t wait to support the Rocket Pool team!!!  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.558857349758085
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "40",
                    "likes": "0",
                    "time": "13/09/2022-19:55:16",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "119"
}