{
    "poll_list": [
        {
            "id": "0x2a7436c5bebeaee1a369e484a212a183da549dfce0393d6dc1f84837e8c5c79d",
            "title": "Season 2: Cycle 8: Mochi",
            "discussion": "https://gov.optimism.io/t/review-gf-phase-1-mochi/3427/3",
            "body": "This Governance Fund Phase 1 proposal is eligible for voting in Cycle 8. This is the last Voting Cycle of Season 2. \n\nThis proposal was reviewed by the [Tooling Committee](https://gov.optimism.io/t/tooling-committee-season-2-recommendations/3551)[.](https://gov.optimism.io/t/defi-committee-c-season-2-recommendations/3437/12?u=lavande) You can find committee recommendations below: [Tooling Committee Recommendations](https://gov.optimism.io/t/tooling-committee-season-2-recommendations/3551)\n\nBy approving committees, the Token House entered a social contract to entrust and delegate the bulk of decision-making to official committees. However, delegates may vote against the recommendation of official committees but should provide a justification to the community as to why they voted differently.",
            "choices": [
                "For",
                "Against",
                "Abstain"
            ],
            "scores": [
                15169759.193175675,
                565491.6435349709,
                61538.41386404833
            ],
            "start": 1667513870,
            "end": 1668111470,
            "snapshot": "30456637",
            "state": "closed",
            "author": "0x83E54889754e737Fb3CdF07BAaCC0eB9699B6Bdd",
            "space": {
                "id": "opcollective.eth",
                "name": "Optimism Collective"
            }
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/review-gf-phase-1-mochi/3427",
            "title": "[REVIEW] [GF: Phase 1] Mochi ",
            "index": 3427,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Governance Fund: Phase 1"
            ],
            "tags": [
                "season-2",
                "passed",
                "cycle-8"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/oftenfrequent",
                    "index": "1",
                    "likes": "1",
                    "time": "08/09/2022-15:22:57",
                    "content": "Project Name: Mochi Author Name: @oftenfrequent I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: Yes L2 Recipient Address: oeth:0x41693B7c0E41CBEa0d4F68Dc73898CB79e390f29 (Mochi multi-sig) Grant category: Governance Fund Is this proposal applicable to a specific committee?: Tooling Governance Committee Project Description: Mochi is a staked-coordination game for DAOs and remote teams. Modeled off of agile software development, Mochi is a protocol in which members of a DAO or decentralized team set goals relative to the organization, form teams, stake ether, and share insights to achieve their goals. Mochi enables permission-less contribution by having contributors stake against their performance. Every Monday-Friday, Mochi players respond to our Discord bot and receive tokens as incentive for sharing progress on their goal & planning ahead—while losing ether when failing to respond for the day (i.e. a slash). Players spend tokens on in-game items found in the Mochi Shop. Slashed ETH goes to a community pool, where the group can vote on how the funds are spent. Mochi is a simple protocol to encourage autonomy, accountability, self-reflection, goal-setting, building habits, working in public, and most of all, sticking together. Project Links:  Website: https://mochi.game/  Twitter: https://twitter.com/bondwithmochi  Game Guide: https://www.notion.so/mochi-world/Mochi-Game-Guide-d09f97ffca5e44aca0a86b936f9f87bc  Link3: https://link3.to/mochi   Additional team member info:  https://twitter.com/playerzer0x https://twitter.com/steadydrift  Please link to any previous projects the team has meaningfully contributed to:  Playerzer0x co-wrote Gnosis Whitepaper Playerzer0x and oftenfrequent worked on UjoMusic @ ConsenSys Steadydrift designed at Pocket & Firefox @ Mozilla  Relevant Usage Metrics:  55 ether staked in game (mainnet multi-sig) 20k checkin reports 10 communities actively playing (Cabin, Quadio, GEN.ART, SheFi, and more)  Competitors, peers, or similar projects:   Coordinape handles subjective rewards, we automate objective rewards  Metropolis (formerly Orca) handles permissioning for groups, we built an incentive model to encourage working together  RabbitHole rewards users for top-down objectives determined by the DAO or product, we enable rewards for both top-down and bottom-up objectives  Beeminder and StikK are single player “skin-in-the-game” goal trackers built with web2 payment processors, we built smart contract layers and bot features for both Discord and Slack We modeled our game on Agile software development and Mastermind mentoring groups   Is/will this project be open sourced?:  We aspire to be a public good Optimism native?: Has been tested on Optimistic-Kovan with plans on launching on Optimism Date of deployment/expected deployment on Optimism: Devcon Bogota Ecosystem Value Proposition:  If we don’t actively work to create new and novel systems in the web3 space, we will end up replicating the old models for “getting stuff done”. Mochi is a new system that over 20 communities and remote teams have experimented with. By building a protocol that rewards the habits of goal-setting, reflection and planning, we hope to encourage better participation to DAOs and remote teams through trust and accountability. Each community will have its own game contract deployed on Optimism to manage staked players and token allotments. Members can stake in Mainnet eth which will bridge to Optimism, effectively migrating funds to Optimism by playing Mochi. Once staked, the locked ether can be used to provide liquidity to Defi protocols.  Has your project previously applied for an OP grant?: No Number of OP tokens requested: 100,000 Did the project apply for or receive OP tokens through the Foundation Partner Fund?: No How much will your project match in co-incentives?  Each token will be granted on a 3-1 basis with Mochi tokens. We allocate Mochi tokens by seeding game contracts that in turn distribute tokens to individual members based on amount of ether staked and reporting performance. Each Mochi token earned by an individual member will earn 1 $OP for the community (DAO/remote team) and 2 $OP for the individual player. We took into account the customer acquisition cost for a company which is roughly $200 according to most figures. The majority of our players, play on a free-tier (soft mode) in which they are not actively bonded and therefore have nothing to lose, but also nothing to gain. We want to proliferate the meme of staking value towards aspirations. We plan to use OP tokens as additional incentives as we ramp up our user base.  Proposal for token distribution (under 1000 words):   How will the OP tokens be distributed?  Since Mochi is a growing network of remote teams and DAOs, we will use OP tokens to incentivize new players and partners. We allocate Mochi tokens for partner organizations to play and can match with OP tokens. We will also be using OP tokens to fund development of the Mochi protocol and application.  60% as Player Rewards (Individual players who stake ETH and earn Mochi tokens) 30% as Partner Rewards (DAOs and remote teams playing Mochi) 10% as Contributor Rewards (Mochi Core Contributors, Contractors, etc)   We are launching a campaign called Spawn Point: 100 Sticky DAOs in 40 Days. The initiative intends to spawn 100 DAOs that play Mochi for at least one 8 week Journey.  Player and Partner Incentives:  Players receive 2 $OP : 1 $MOCHI for every successful check-in DAOs receive 1 $OP for every successful check-in   Requirements  Players must play Mochi at Firm level or above to qualify (min bond: 0.025 ETH) to receive the Player $OP reward. DAOs must have at least 8 members (2 teams) playing Mochi to receive the DAO $OP reward. Players may quit the journey but forfeit their bond. Tokens will be awarded on Optimism.        Over what period of time will the tokens be distributed for each initiative?:  Partner and Player Rewards:  Assuming perfect play at our easiest level (Firm) with at least 40 new teams, we would distribute all OP tokens between 2-4 months. Since onboarding new teams and players takes time, we would like to pad the distribution expectations to be 4-6 months before funds are exhausted.   Contributor Rewards:  $OP will be allocated as a bonus to our core contributors on the basis of time saved using Mochi to coordinate asynchronous stand-ups. Assuming we save 20min per day by using Mochi in place of synchronous stand ups, we estimate $1,200 USD in time savings per contractor per Journey which translates to ~1,043 OP bonus per two month contract period. Assuming an 8 person team, the Contributor Reward allocation would be fully distributed in less than 3 months.      Please list the milestones/KPIs you expect to achieve for each initiative:  Partner and Player Rewards:  Before the end of 2022:  40 new communities playing Mochi 70 ether staked in-game 30k checkin reports   By end of Q1 2023  100 communities playing Mochi 100 ether staked in-game 50k checkin reports     Contributor Rewards:  We have been testing our game and token contracts on Optimistic-Kovan for the past several months and are awaiting legal clarity before we deploy contracts. Our goal for Devcon Bogota is to deploy our contracts live to Optimism.      Why will incentivized users and liquidity on Optimism remain after incentives dry up?:  Over the two years of game-play, less than 0.5eth of the 55eth total staked has ever been withdrawn by players. This means ether migrated to Optimism through the game will likely stay there. Mochi and Optimism Tokens earned via gameplay will be distributed to players adding another layer of incentive to interface with Ethereum on Optimism. Come for the earnings, stay for the transaction costs.    ",
                    "links": [
                        "https://mochi.game/",
                        "https://twitter.com/bondwithmochi",
                        "https://www.notion.so/Mochi-Game-Guide-d09f97ffca5e44aca0a86b936f9f87bc",
                        "https://link3.to/mochi",
                        "https://twitter.com/playerzer0x",
                        "https://twitter.com/steadydrift",
                        "https://etherscan.io/address/0x405a865e27296a98a865387a030e0e69eee0fac4",
                        "https://twitter.com/bondwithmochi/status/1563235991225536513",
                        "https://www.metropolis.space/",
                        "https://rabbithole.gg/",
                        "https://www.beeminder.com/",
                        "https://www.stickk.com/",
                        "https://en.wikipedia.org/wiki/Agile_software_development",
                        "https://en.wikipedia.org/wiki/Mastermind_group",
                        "https://kovan-optimistic.etherscan.io/address/0x4864e6218004777176D4b6C5422ba4EBFC730157",
                        "https://kovan-optimistic.etherscan.io/address/0x4864e6218004777176d4b6c5422ba4ebfc730157",
                        "https://gov.optimism.io/t/gfx-labs-delegate-communication-thread/2728/19"
                    ],
                    "GPT-summary": "The post is a proposal for a staked-coordination game called Mochi, which is designed for DAOs and remote teams. The proposal explains the project's goals, features, and usage metrics, as well as its ecosystem value proposition and token distribution plan. The post also includes information about the team members, relevant usage metrics, and milestones/KPIs. The proposal is open source and has been tested on Optimistic-Kovan, with plans to launch on Optimism. The post includes constructive criticism and questions from third parties, as well as an extension to the proposal.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Smart contract updates",
                        "Token economics",
                        "Interoperability and Scaleability"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.109478241057188
                },
                {
                    "author_link": "https://gov.optimism.io/u/ancientwarrior",
                    "index": "2",
                    "likes": "2",
                    "time": "16/09/2022-06:10:41",
                    "content": "Great concept, there is certainly a lack of collaborative DAO tools that aim to increase productivity.  Do you have plans to provide this as a stand-alone dApp? Is there a vetting process for onboarding new DAOs?  It would be interesting to see analytics from your current active communities regarding the number of members in the DAO and how productive this tool has been. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.2644300144300145
                },
                {
                    "author_link": "https://gov.optimism.io/u/oftenfrequent",
                    "index": "3",
                    "likes": "3",
                    "time": "16/09/2022-15:08:50",
                    "content": "Thanks for the feedback and questions @ancientwarrior.   Do you have plans to provide this as a stand-alone dApp?   We currently have a dApp where contributors can sign up and view past report data. Right now our focus is on building the functionality through Discord because that is where most of the interaction is between DAO contributors and builders. In the future, we hope to grant players the ability to check in on the website or another messaging platform of their choosing. However since there are punishments for not reporting, we need a way to notify users that they must report. Therefore, Discord is the best solution as of now. Here is a screenshot of my profile. It displays the last report from a journey I did with the Gen.Art community.  Screen Shot 2022-09-16 at 10.41.56 AM1920×1742 193 KB    Is there a vetting process for onboarding new DAOs?   At the moment yes, we tend to onboard new DAOs in an intentional manner. Our protocol is fairly opinionated and can be used in many ways so we want to make sure the prospective community has a plan to implement Mochi appropriately.  It would be interesting to see analytics from your current active communities regarding the number of members in the DAO and how productive this tool has been.  I would be happy to provide any analytics you are interested in seeing. Please comment and I can add here. In an attempt to share something of use, here is a breakdown since the start of 2022 of Report counts and percentages month by month. These are global rates but I can obtain community-specific ones if you are interested.              Month Missed Reports Completed Reports Tokens Awarded Report %   September 2022 62 277 394 81.7109%   August 2022 237 820 862 77.5781%   July 2022 263 863 649 76.6430%   June 2022 368 602 649 62.0619%   May 2022 225 793 747 77.8978%   April 2022 117 775 1113 86.8834%   March 2022 51 516 775 91.0053%   February 2022 42 359 662 89.5262%   January 2022 9 141 267 94.0000%     ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.398835291692434
                },
                {
                    "author_link": "https://gov.optimism.io/u/ceresstation",
                    "index": "4",
                    "likes": "2",
                    "time": "21/09/2022-23:03:11",
                    "content": "This is a really cool concept and having used it + interacted with the team I’m biased, but I’d be interested in seeing this go to vote. In general, most DAO tooling tends to focus on the subjective and social, I really like the move towards more concrete accountability and goal tracking. More specific to the proposal though:   Date of deployment is quite close, seems like progress has already been made   Team has consistent history of adding value in the ecosystem   Fan of focusing on player rewards given my experience has been positive with the player community   One thing I’d likely want to dive a bit deeper on is co-incentives though, and the economics of the overall network. Again, admitting I’m biased on this one but wanted to chime in. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.07521645021645
                },
                {
                    "author_link": "https://gov.optimism.io/u/jacob",
                    "index": "5",
                    "likes": "1",
                    "time": "31/10/2022-17:41:38",
                    "content": "Thanks for sharing this here @oftenfrequent! I had heard of Mochi so it was great to be able to learn a bit more about what you’re working on. In general, I’m a big fan of experiments and playing more with DAO coordination/goal setting, so happy to see this problem being tackled. You listed the Optimism deployment timeline as Devcon Bogota, just wanted to check in to see if that milestone had been met (or if you had an updated timeline) and if there was a place I could poke around to see the app in use? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.124999999999999
                },
                {
                    "author_link": "https://gov.optimism.io/u/oftenfrequent",
                    "index": "6",
                    "likes": "1",
                    "time": "01/11/2022-20:56:03",
                    "content": "Hey @jacob I appreciate your time and attention on our proposal. We also love experiments and believe that the only way we’ll find success in the DAO space is by playing with potential solutions and seeing what sticks.  You listed the Optimism deployment timeline as Devcon Bogota, just wanted to check in to see if that milestone had been met (or if you had an updated timeline)  In the milestones/KPI section I wrote:     oftenfrequent:  We have been testing our game and token contracts on Optimistic-Kovan  for the past several months and are awaiting legal clarity before we deploy contracts. Our goal for Devcon Bogota is to deploy our contracts live to Optimism.   Unfortunately there are a couple things that have been working against us. The first being that OP has moved from Kovan to Goelri as mentioned here. We have needed to allocate resources to ensure that our development environments remain functional so we can continue testing the product. The second being that we have not reached legal clarity on how to structure the product-portion of Mochi vs the DAO or Mochi. We want to deploy our token contract however it has been recommended we hold off until we gain that clarity.  if there was a place I could poke around to see the app in use?  Our website currently has an invite link to join our Discord where you can access the pow (proof-of-work) channel where you can see all the active members of the community currently in a journey. If you are interested in starting one yourself, you are welcome to join our next batch of Mochi members in Q1 2023! ",
                    "links": [
                        "https://dev.optimism.io/kovan-to-goerli/",
                        "https://mochi.game/"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.338257575757575
                },
                {
                    "author_link": "https://gov.optimism.io/u/linda",
                    "index": "7",
                    "likes": "2",
                    "time": "01/11/2022-23:57:42",
                    "content": "I am an Optimism delegate [Delegate Commitments - #37 by linda] with sufficient voting power and I believe this proposal is ready to move to a vote. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/ceresstation",
                    "index": "8",
                    "likes": "3",
                    "time": "02/11/2022-13:54:10",
                    "content": " 1. Presentation  We are an officially recognized Tooling Governance Committee, responsible for assessing proposals related to tooling and infrastructure (wallets, bridges etc.).  2- About the project  Mochi is a staked-coordination game for DAOs and remote teams. Modeled off of agile software development, Mochi is a protocol in which members of a DAO or decentralized team set goals relative to the organization, form teams, stake ether, and share insights to achieve their goals. Mochi enables permission-less contribution by having contributors stake against their performance. Every Monday-Friday, Mochi players respond to the Discord bot and receive tokens as incentive for sharing progress on their goal & planning ahead—while losing ether when failing to respond for the day (i.e. a slash). Players spend tokens on in-game items found in the Mochi Shop. Slashed ETH goes to a community pool, where the group can vote on how the funds are spent. Mochi is a simple protocol to encourage autonomy, accountability, self-reflection, goal-setting, building habits, working in public, and most of all, sticking together.  3- About the following  The proposal was published on September 8th asking for 100k OP tokens. There hasn’t been a ton of active discussion on the forum as yet, likely because there are such a large number of proposals to process. As a Tooling committee, the project was recently catalogued as “Tooling” in the Grant category, and so we’ve taken on the responsibility of issuing a recommendation.  4- About the proposal valuation    Added value (good to bad): good. In our view Mochi provides an opportunity to keep developers and other stakeholders in the Optimism engaged over time. It could also provide a way for different teams building on Optimism to track their objectives together and stay accountable to the broader community.  Impact or expected usage (high to low): medium. Adoption is still relatively low, but has been picking up significantly with the growth of the DAO ecosystem on Ethereum over the past 6-18 months.  Current Status [Development stage/Open Source?] (early to ready): ready. The project is active now and in use by a number of DAOs on Ethereum.  Expenditure plan and distribution (appropriate to inappropriate): reasonable for amount. We would love to better understand who incentives are being given to, and to ideally figure out ways to partition which Mochi journeys are eligible such that, similar to projects like Ethernaut, the average distribution per user is weighted according to some ‘success’ metric for a user in the Optimism ecosystem (i.e. a developer joining a project full time as a qualified builder).  Amount requested (high to low): medium. We don’t think this is “low” but in our view it’s a reasonable amount to bet on an emerging project, and isn’t high relative to the ambitions of the team given their track record.   5. KPIs and impact tracking We think the partner + player reward metrics set seem measurable and achievable, and would love to see Mochi using their own tooling to check in and showcase progress as they ramp up within the Optimism ecosystem.  6- FINAL RECOMMENDATION: Yes We are inclined to give an initial stipend given our understanding of the team’s history and previous work. ",
                    "links": [
                        "https://gov.optimism.io/t/gfx-labs-delegate-communication-thread/2728/19",
                        "https://gov.optimism.io/t/tooling-committee-season-2-recommendations/3551/15",
                        "https://gov.optimism.io/t/tooling-committee-season-2-recommendations/3551/12"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None"
                    ],
                    "Sentiment": 5.594211017740429
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "9",
                    "likes": "0",
                    "time": "03/11/2022-20:15:48",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "10",
                    "likes": "0",
                    "time": "03/11/2022-20:51:27",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/katie",
                    "index": "11",
                    "likes": "2",
                    "time": "06/11/2022-02:11:09",
                    "content": "Voted yes - Following the Tooling Committee recommendation.  This is also a reasonable request and I’m a supporter of DAO tooling. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "12",
                    "likes": "1",
                    "time": "09/11/2022-12:26:51",
                    "content": "I will be voting yes following the tooling committee recommendation of which I am a member.  We are inclined to give an initial stipend given our understanding of the team’s history and previous work  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 4.722222222222222
                },
                {
                    "author_link": "https://gov.optimism.io/u/Butterbum",
                    "index": "13",
                    "likes": "0",
                    "time": "10/11/2022-13:57:06",
                    "content": "Voted against I couldn’t get past this comment from the committee.   we would love to better understand who incentives are being given to, and to ideally   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.0625
                },
                {
                    "author_link": "https://gov.optimism.io/u/mteoptimism",
                    "index": "14",
                    "likes": "0",
                    "time": "13/11/2022-09:09:09",
                    "content": "Mochi has lacked substantially in providing any value to it’s own tokens and also no use cases. so i oppose as i think this proposal is just OP token grab for them to stay afloat. They didn’t do any activity on OP either. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "15",
                    "likes": "0",
                    "time": "14/11/2022-17:41:37",
                    "content": "Snapshot vote - passed ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "16",
                    "likes": "0",
                    "time": "14/11/2022-17:41:51",
                    "content": "@oftenfrequent can you provide a Telegram handle or other contact method so the Optimism team can get in touch about paying out this grant! Feel free to comment on this thread, DM, or email palash@optimism.io ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.609375
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "17",
                    "likes": "0",
                    "time": "14/11/2022-17:41:55",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "238"
}