{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/optimism-no-code-analytics-network-dashboards/5576",
            "title": "Optimism No-code Analytics & Network Dashboards ",
            "index": 5576,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Grants Council"
            ],
            "tags": [
                "builders",
                "cycle-11"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/Arif",
                    "index": "1",
                    "likes": "7",
                    "time": "12/03/2023-16:08:33",
                    "content": " Basic Details Project Name: Optimism No-Code Analytics and Network Dashboards Author name and forum name (please provide a reliable point of contact for the project): Forum name = Arif Contact =  Arif Kazi Abhay Singh  L2 recipient address: 0xCFAb1066c172c8F36DBb866d5402c07271f33C45 Which Voting Cycle are you applying for? Cycle 11 I confirm that I have read the landing pages for the Builders 25 and Growth Experiments 26 Sub-Committees and that I have determined my proposal is best suited to be reviewed by the Builders Sub-Committee: [Yes/No]: Yes Project Details What are you going to build? We aim to empower Optimism network users and Dapp developers to easily understand Optimism network data, do no-code analytics, and build beautiful charts and dashboards. DappLooker is a leading provider of web3 analytics for Dapps and networks, with a strong and consistent  growth. We provide analytics on 120+ million user data, 200+ Dapps, and 10+ networks and have established partnerships with several prominent projects in the web3 ecosystem. Our unique offerings, experienced team, and unique offerings position us well to capture a significant share of the web3 analytics market. Website Integrations Discover page The primary objectives of this project are: A. Integration between DappLooker and Optimism Network to provide Data Analytics & Visualization Platform with some of the notable features like below:   No-Code Analytics - Intuitive platform that does not require users to be tech-savvy to run on-chain analytics on Optimism Networks and Dapps. Visualize Optimism Network dapps data into an easy-to-understand tabular format. Build & Share custom-built dashboards anywhere you need. Forking of charts & dashboards by users  for the Optimism community.  Export smart contract and subgraph data in popular formats like CSV, XLS, and JSON.  Support of on-chain and off-chain analytics through CSV, JSON APIs Watermark-free embedding  B. Implement below network dashboards  EthernautDAO dashboard  Displays key metrics for dapps, such as transaction volume, TVL, DAU, and MAU, on the Optimism Network.   Optimism network tokens TVL dashboard Top Defi projects Dapps Dashboard Top NFT projects Dapps Dashboard Insights and analysis on user behavior through the user retention dashboard on the Optimism smart contracts. More dashboard will be built based on feedback and adoption  C. Moreover, this integration will provide the ability to analyze these metrics through our proposed dashboards:  Daily Active Users (DAU) Monthly Active Users (MAU) daily /weekly gas consumed TVL Transaction volume Cohort Analysis Retention Rate Churn Rate Funnel Analytics and other key metrics  These insights will provide valuable information to optimize user engagement and drive adoption within the Optimism Ecosystem. Why is what you are going to build going to succeed?  At DappLooker, we are confident that this integration will succeed because we have the necessary skills and experience to deliver a high-quality product. We provide analytics to 120M+ on chain users data on 10+ networks. Our 10+ team has worked with prominent DeFI/NFT projects such as the Graph Network, Aave V3, Connext,  and launched analytics. Optimism dashboards for Aave, Connext is already live on DappLooker. These projects have been well-received by their respective communities and have helped users better understand these platforms’ performance. Furthermore, we have a track record of success as grantees.  Listed below are our partner collaboration work: Graph Network Analytics Aave DeFi & User Retention Analytics Celo Network Analytics We are backed by multiple ecosystem funds and grant programmes:  Secured ecosystem grant from TheGraph foundation (https://twitter.com/MoonbeamNetwork/status/1442877904724144137) Received 2 grant from Celo foundation  Secured grant from Aave Grants DAO, Connext Network, Received grant from NEAR foundation   We believe that our web3 no-code analytics experience, combined with unique offerings for the blockchain industry, puts us in a strong position to succeed. We are committed to delivering a top-notch product that will provide value to the Optimism community. Is your project likely to bring new builders to the Optimism ecosystem? If so, please describe how:  We are confident that our project will attract new builders and developers to the Optimism ecosystem. We have a good community of data analysts, data scientists who have built 2000+ charts for multi-chain networks. By providing developers with detailed information on user behavior, transaction volumes, and other key metrics, DappLooker will help to attract more builders to the Optimism ecosystem. As developers, we understand the importance of having access to accurate and up-to-date data when building decentralized applications. By providing this data in a comprehensive dashboard, we aim to lower the barriers to entry for new builders and help them to create more innovative and successful projects on the Optimism network.  Is your project likely to improve the quality of developers in the Optimism ecosystem? If so, please describe how:  DappLooker, through its dashboards, provides developers with detailed insights and analytics that can help them improve the performance and user experience of their dapps. The integration will help developers make more informed decisions and create higher-quality applications by providing developers access to this valuable data. Furthermore, by providing a platform for developers to showcase their projects and metrics, DappLooker will encourage healthy competition and drive developers to create better and more innovative applications. This, in turn, will lead to a higher quality of developers in the Optimism ecosystem.  Is your project likely to improve developers’ commitment to the Optimism ecosystem? If so, please describe how:  We believe in data driven progress. Our intuitive tool will simplify analytics and will save lot of developers time. Developers will be able to run analytics on smart contracts, subgraph data easily. It will help them to make more informed decisions and create higher-quality applications for the Optimism ecosystem. They will be inspired to create more once they see the results. This will eventually improve the commitment of Developers in the Optimism Ecosystem.  Provide us with links to any of the following for the project:  Website: https://dapplooker.com/  Twitter: https://twitter.com/dapplooker  Discord: https://dapplooker.com/community  Github: https://github.com/dapplooker  Workshop: https://www.youtube.com/watch?v=JVgheSmgg1s   Do you have metrics on the project? (TVL, transactions, volume, unique addresses, etc.)  We have integration with 10+ networks and onboarded 200+ multi-chain projects. Community of data analysts have built 2000+ charts. Users can run analytics into 120M+ chain on-users’ data  Who are your competitors? Dune What differentiates you from your competitors? DappLooker is different from its competitor in the following ways:  No-Code Analytics  The platform’s visual SQL editor makes it easy for users to run complex queries and gain valuable insights into their project’s data, regardless of their technical background. The editor makes it easy for users to formulate queries and visualize the results without writing code.  Smart Contract & Subgraph Analytics  It allows for both smart contract/subgraph visualization and advanced analytics, which provides in-depth insights into the relationships and patterns within the data. The user-friendly UI allows users to easily explore smart contract/subgraph data in tabular form, making it accessible for data analysts and developers to gain valuable insights.  Analyze On-Chain and Off-Chain Data Together  Onchain data refers to data stored directly on the blockchain network, such as transaction details and smart contract events. On the other hand, off-chain data refers to the data stored outside the blockchain network but related to it, such as user behavior and market trends.  Export on-chain data to CSV/Excel  Ecosystem users can export complete dapp/network transaction data into excel or CSV.  Watermark-Free Embedding  Unlike other platforms that charge steep fees to remove their watermark, DappLooker offers this feature for free to both paid and non-paid users. This means businesses and individuals can create dashboards and charts on their websites, showcasing their insights and data without the hassle of any watermark.  Chart API  This API allows users to fetch and integrate chart data in JSON format, providing businesses with even more customization options and the ability to tailor their insights to their needs. This feature allows businesses to create custom dashboards and explorers with advanced UI, all while fetching data directly from the platform. Will your project be composable with other projects on Optimism? If so, please explain:   Yes. We understand the importance of composability in the blockchain ecosystem and its benefits to developers and users alike.   Developers can connect their smart contract, subgraph, JSON API for integration.   As such, we have designed DappLooker to be easily integrated with other projects and protocols on the Optimism network, allowing developers to leverage the data and insights provided by DappLooker in combination with other tools to build more powerful and innovative Dapps.   Team Who are your founders?:  Abhay Singh Abhinav Singh  What makes your founders well-positioned to accomplish your goals with this project (1-2 sentences on each)?: Co-founders has combined experience of 20+ years in product development. 6+ years in web3 and business analytics. Our founders’ extensive experience, proven track record, and deep commitment to the blockchain industry make them well-positioned to accomplish our goals with the DappLooker project. Tell us about the rest of your team (if there are more teammates):  Name of team leader   Abhay Singh Abhinav Singh   Names of team members   Vikas C. - Head of Engineering Arif K. - Growth Lead  Our team has 35+ years of combined experience. Believes in iterative development and fast execution. Is this your first Web3 project?: No. If not, what else have you built? (Share links, Github repository, or any other useful information.): Real-time Web3 Explorer & Visualizer  https://graphlooker.com/ Please find multi-chain analytics works:   Optimism dashboards for Aave, Connext is already live. Graph Network Analytics Aave DeFi & User Retention Analytics Celo Network Analytics Aave V3 User Retention Dashboard https://dapplooker.com/dashboard/aave-v3-polygon-user-retention-dashboard-231    I understand that Builders grants are subject to a 1-year lock-up, as explained further in this post 2: [Yes/No]: Yes Is your project funded? If so, provide an estimate of how many months of funding runway your project has: We are a profitable company backed by multiple ecosystems including TheGraph, Celo, Moonbeam, Aave, Connext and more. Grant Request What is the size of the grant request? 45k OP How do you justify the size of the grant? The grant covers below:  Optimism network ETL Indexer Development - 12000 OP Infrastructure Cost - 10000 OP Price Oracle Integration - 1000 OP  As part of integration support Optimism network tokens pricing data. The pricing data is available for download via CSV, excel, or JSON.   Optimism Network Integration Development with website - 5000 OP Network Dashboards Development - 6000 OP  Documentation to help the Optimism team and users for the integration of Optimism Dapps.   Onboard and integrate 5 Dapps  - 5000 OP Marketing & Operations - 6000 OP  Organize analytics bounty programme for optimism users Conduct workshops Documentation Twitter Blog Email Campaign    Roadmap Describe in discrete steps your plan for accomplishing your project:   Integration of Optimism Network for smart contract and subgraph analytics  Optimism network integration at the registration page. Optimism network users can register and sync their smart contracts and subgraphs using the registration page. Once registered, on-chain analytics can be done using drag and drop chart/dashboard builder    Implement multiple network dashboards mentioned above   Co-Marketing & Onboarding of Optimism Dapps   Please provide any additional information that will facilitate accountability:(smart contract addresses relevant to the proposal, relevant organizational wallet addresses, etc.) NA Does your plan depend on the receipt of OP tokens? No What is your plan for using the OP token after the one-year lock-up?  Onboard and integrate more Optimism Dapps and developers Based on community feedback, build network dashboards and analytics. Run bounty program for developers and data analysts Infrastructure upgrade  Upgrade infra to index Optimism network for analytics and visualization.   Conduct different programs like workshop, twitter space to educate users  Please provide benchmark milestones for this project. These milestones should guide the Optimism community on the progress of your project during the 1-year lock-up period. Milestone 1   Optimism network ETL Indexer Development - 3 months  Support indexer to index Optimism contracts & subgraphs data in visual SQL tables format for analytics. Implement transformations to Index Optimism project data in an easily queryable format.    Optimism Network Integration with website - Productization - 3 months   Infrastructure Upgrade   Price Oracle Integration  As part of integration support Optimism network tokens pricing data. The pricing data is available for download via CSV, excel, or JSON.    Milestone 2 - 4 months  Integration on Discover and integration page Network Dashboards Development mentioned above  Documentation to help the Optimism team and users for the integration of Optimism Dapps.   Onboard and integrate 5 Dapps Adoption  Milestone 3 - 2 months  Maintenance, Support, bug fixes Marketing & Operations  Documentation Twitter Blog * Conduct workshops Organize analytics bounty programme for optimism users Hackathons    Please define critical milestones for this project. Critical milestones are meant to show good-faith efforts to accomplish the project. Non-completion of these milestones could lead to the revocation of remaining grant rewards.  DappLooker integration with Optimism network Implementation of network dashboards mentioned above Onboarding of 5 Dapps for their on chain analytics  Optimism Relationship Does your project solve a problem for the Optimism ecosystem?:   Current Problem  Understanding raw web3 data is complex. Data & analytics is in hands of SQL developers and data scientists. Non tech savvy users find web3 analytics hard. No Analytics platform built for both technical and non technical users. Slow Queries, Data refresh issues, Analyze on-chain & offchain together    The current state of the Optimism ecosystem needs a comprehensive platform that enables real-time tracking of usage metrics and statistics.   This absence of a data & analytics tools results in missed opportunities to capture critical information that could help better understand user activity and behavior, such as churn rates, engagement rates, and other KPIs.   A unified platform would make it easier to monitor metrics such as TVL, daily and weekly transfer rates, etc., that could assist in decision-making processes.   Overall, the lack of a analytics platform for monitoring and analyzing data in real-time means that the Optimism ecosystem is missing out on crucial insights that could inform and guide development efforts and identify areas for improvement and growth.   Therefore, a comprehensive analytics and visualization platform for the Optimism ecosystem is imperative.   How does your proposal offer a value proposition for solving the above problem?:   No-Code Analytics  Visual SQL - Intuitive and saves time Drag & Drop Dashboard builder    Smart Contract & Subgraph Analytics   Custom transformations framework for faster queries   Analyze on chain & Off chain data together   Export data to CSV/Excel   External Integration - Chart APIs & Embedding   integrate Optimism Network & Index the data from Optimism smart contracts & subgraphs  Doing so enables us to present usage data in a visual format for real-time analytics and visualization. With DappLooker, users will gain access to essential retention metrics, including the number of active users, churn rate, and retention rate. This data will enable better decision-making and drive growth by helping identify improvement areas.    We are developing multiple network dashboard that will provide a snapshot of essential network statistics, such as  Daily/Weekly/Monthly transaction volumes, Daily/Weekly/Monthly gas consumption Daily/Weekly/Monthly TVL and other key metrics    This will allow network participants to monitor network activity and make informed decisions based on the latest information. Why will this solution be a source of growth for the Optimism ecosystem?:   After Integration, Optimism ecosystem users and community can build charts and dashboards using our drag and drop query builder on Optimism network data.   We understood from multiple Optimism stakeholders and Dapps that there is a strong need for no-code analytics solutions for Optimism Dapp’s owners and developers.   As more and more Dapps join the Optimism network, they must have an analytics solution to which they can reply for effective decision-making.   Create and fork dashboards using the drag-and-drop feature of dashboard builder. Gather info from multiple sources into a single dashboard. Share dashboards on a URL anywhere you need.   Export smart contract data in CSV or Excel   Write SQL queries using an intuitive visual SQL editor on the Optimism project dataset. Users can query, filter, join, and group on the Optimism project dataset. Community analytics can be done on an indexed Optimism dataset.   Analyzing key metrics can help the Optimism ecosystem identify areas to improve and grow. For example,  Tracking the number of active users and their behavior can provide insights into how people use the ecosystem and what features or services are most popular. Analyzing churn and retention rates can help the team understand how many users are leaving the ecosystem and why. If a high percentage of users are churning, the team can investigate the reasons behind it and take steps to address any issues or pain points. A high TVL and transaction volume suggest that people actively use and see value in the ecosystem. Analyzing these key metrics is essential for identifying growth opportunities and understanding user behavior within the Optimism ecosystem. Using these insights to optimize the ecosystem, the team can attract more users, increase adoption, and ultimately achieve long-term success.    How committed are you (and your team) to building on Optimism?:   We are fully committed to building on the Optimism network and contributing to the growth and success of the ecosystem.   Popular Optimism native projects which are already live on DappLooker are Aave, Connext   We recognize the tremendous potential of Optimism’s Layer 2 scaling solution to enable faster and more cost-effective transactions on the Ethereum network. We are excited about the opportunities this presents for dapp developers and users.   Our team has a proven track record of building successful projects on 10+ blockchain networks, including Ethereum, Celo, Polygon, Arbitrum  and more   We are excited to bring this experience and expertise to the Optimism network and believe that we can contribute to the growth and success of the ecosystem by building high-quality tools and resources that can benefit developers and users alike.   Is your project Optimism Native? Yes Confirmations I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: [Yes/No]: Yes I understand that I will be expected to following the public grant reporting requirements outlined here: [Yes/No]: Yes ",
                    "links": [
                        "https://foul-porch-0eb.notion.site/Growth-Experiments-Sub-Committee-270d2f75ff0f410a869b2ba6a8324006",
                        "https://dapplooker.com/",
                        "https://dapplooker.com/integration",
                        "https://dapplooker.com/browse/dashboards?sort=popular",
                        "https://dapplooker.com/browse/dashboards?sort=popular&pg=1&q=optimism",
                        "https://dapplooker.com/browse/dashboards?sort=popular&tags=thegraph&pg=1",
                        "https://dapplooker.com/browse/dashboards?sort=popular&pg=1&q=aave",
                        "https://dapplooker.com/browse/dashboards?sort=popular&pg=1&tags=celo",
                        "https://twitter.com/MoonbeamNetwork/status/1442877904724144137",
                        "https://twitter.com/dapplooker/status/1453364888135290883",
                        "https://twitter.com/ConnextNetwork/status/1460212491515056129",
                        "https://twitter.com/dapplooker/status/1527635695342440448?s=20&t=jYDQqXrWl1RPlWmAfhsc1w",
                        "https://dapplooker.com/",
                        "https://twitter.com/dapplooker",
                        "https://dapplooker.com/community",
                        "https://github.com/dapplooker",
                        "https://www.youtube.com/watch?v=JVgheSmgg1s",
                        "https://graphlooker.com/",
                        "https://dapplooker.com/browse/dashboards?sort=popular&pg=1&q=optimism",
                        "https://dapplooker.com/browse/dashboards?sort=popular&tags=thegraph&pg=1",
                        "https://dapplooker.com/browse/dashboards?sort=popular&pg=1&q=aave",
                        "https://dapplooker.com/browse/dashboards?sort=popular&pg=1&tags=celo",
                        "https://dapplooker.com/dashboard/aave-v3-polygon-user-retention-dashboard-231",
                        "https://gov.optimism.io/t/grant-token-lock-explainer/5060",
                        "https://dapplooker.com/browse/dashboards?sort=popular&pg=1&q=optimism",
                        "https://gov.optimism.io/t/suggested-public-reporting-requirements-for-grantees/4176"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.881415464380581
                },
                {
                    "author_link": "https://gov.optimism.io/u/Arif",
                    "index": "2",
                    "likes": "4",
                    "time": "13/03/2023-12:26:53",
                    "content": "In various instances in this Application, links to dashboards, grants, and social media handles were used. But I couldn’t post them in the forum as I am restricted to only 2 links in the post. Here is the application, inclusive of all links Forum post - All links included - Google Docs Edit : please ignore this comment . This was old comment when I wasn’t able to upload the links . Now all links are available in the forum post itself . ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.861111111111112
                },
                {
                    "author_link": "https://gov.optimism.io/u/kaereste",
                    "index": "3",
                    "likes": "3",
                    "time": "14/03/2023-08:05:21",
                    "content": "Hey @Arif, giving you a heads up that this will be the formal comms channel with the grant council builders subcommittee, which consists of @Gonna.eth @jackanorak @danelund.eth, and myself. We’ll make sure we’re around to address any questions you have in this process. We might also be asking additional questions here during the review process so please check this thread for updates on a regular basis. One thing to be mindful of is that in the Cycle 11 we require the milestones to be precisely defined into two categories - critical milestones and benchmark milestones as described in Milestone Assessment . Could you please restructure your milestones description to follow this structure? Furthermore, I’m a bit concerned about your grant distribution proposal. Although you confirmed, that you are aware of 1yr grant lockup it seems that within your grant distribution plan, you assume that the funds will be released to you upon achieving specific milestones and that you don’t have funding secured for the delivery of the project. Unfortunately, such a distribution is not possible within this grant program. Moreover, you can’t assume a specific OP price at the 1yr lockup end, so you can’t assume that you’ll receive a specific dollar amount within this grant. You can find more information here: Grant Token Lock Explainer. Please fix those points within your proposal. ",
                    "links": [
                        "https://gov.optimism.io/u/jackanorak",
                        "https://gov.optimism.io/u/danelund.eth",
                        "https://gov.optimism.io/t/milestone-assessment/5314",
                        "https://gov.optimism.io/t/grant-token-lock-explainer/5060"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.854166666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/Arif",
                    "index": "4",
                    "likes": "3",
                    "time": "17/03/2023-11:38:04",
                    "content": "Hey @kaereste, @Gonna.eth, @jackanorak, and @danelund.eth, I hope this message finds you well. I wanted to provide an update regarding my grant proposal and the feedback provided. I would like to inform you that I have carefully considered all the concerns and suggestions raised and made the necessary changes to the proposal to ensure that it meets the grant program’s requirements. Specifically, I have restructured the milestones description per the required structure and made additional changes to align the proposal with the grant program’s requirements. I kindly request that you review the updated proposal to ensure it meets all the grant program’s requirements. I would be happy to address any questions you may have and provide further clarification on any changes I have made. Additionally, I would like to request information on the next steps in the grant review process. Please let me know if there are any further actions I need to take or any additional information I need to provide. Thank you for your time and consideration, and I look forward to hearing back from you soon. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.8125
                }
            ]
        }
    ],
    "group_index": "602"
}