{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/gf-phase-1-proposal-intswap/4913",
            "title": "[GF: Phase 1 Proposal] Intswap ",
            "index": 4913,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Grants Council"
            ],
            "tags": [
                "cycle-10",
                "not-passed"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/intswapfornftamm",
                    "index": "1",
                    "likes": "1",
                    "time": "31/01/2023-00:48:24",
                    "content": "Project name: Intswap Author name and contact info (please provide a reliable point of contact for the project): Jason Chin@CEO and my email: intswapfornftamm@gmail.com I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: Yes I understand that I will be expected to following the public grant reporting requirements outlined here: Yes L2 recipient address: 0x70C56C0fba60b5A3Bb2F6BD37c635010d9FD3A97 Which Voting Cycle are you applying for?: Cycle 10 Which sub-committee should review your proposal? (Builders Grants, Growth Experiment Grants): Builders Grants Project description (please explain how your project works): Intswap is a decentralized NFT AMM as well as a liquidity solution for NFTs. Compared to the existing NFT Marketplaces, Intswap has three core designs making it more competitive, including aggregated Liquidity Providers (LPs), Concentrated Liquidity and Liquidity Mining incentive for NFT LPs. Hence, as an innovative NFT AMM, Intswap has the characteristics of noncustodial, higher capital efficiency and better trading experience. In addition, it brings a more sustainable token economic model to NFT stakeholders. Website: https://intswap.io/ Twitter: https://twitter.com/Intswap_amm Discord/Discourse/Community: Intswap Other relevant links (including any demos):whitepaper: DocSenddeck: DocSenddemo: https://test.intswap.io/app/collections Additional team member info (please link): I have a team with 6 members focusing on DEFI and the NFT sector, we all full time on the project and fully engage ourselves in the crypto industry . I am proud to say that each team member is a one-man army and fully equipped with expertise and experience, such as senior solidity developer, tokenomic designer and AMM algorithm engineers. Together, we’ve built several defi projects running well. Please link to any previous projects the team has meaningfully contributed to: Intswap is the first project we independently designed and implemented. Relevant usage metrics (TVL, transactions, volume, unique addresses, etc. Optimism metrics preferred; please link to public sources such as Dune Analytics, etc.):Intswap is the first project we independently designed and implemented. Competitors, peers, or similar projects (please link): sudoswap Is/will this project be open sourced?: Yes Optimism native?: No Date of deployment/expected deployment on Optimism: 5/1/2023 What is the problem statement this proposal hopes to solve for the Optimism ecosystem? We hope to introduce a new NFT AMM to the Optimism ecology, and with our advantages, stimulate NFT stakeholders to migrate to Optimism, and fully stimulate the NFT market potential of the Optimism ecology. How does your proposal offer a value proposition solving the above problem?: Since the value of automated market makers (AMM) in Fungible Token transactions are widely spread and recognized. In theory, the exchange ratio of the crypto assets pair is constructed through mathematical models during the exchange process. On the one hand, the simulation of matching the market based on the order book is realized at a lower execution cost. On the other hand, the restrictions on the performance and cost of the underlying chain infrastructure are greatly eliminated. We believe that AMM has great potential for marketplaces for NFTs without significant differences, such as PFP NFT Series. Base on this, we have designed a suitable NFT AMM Marketplace - Intswap. This Protocol has three major features:1. NFT AMM with Intswap Providers (LPs): In Intswap, all LPs provide liquidity to NFT AMMs in an aggregated way, earn market making fees in the form of compound interest, and use an interest-bearing LP Fungible Token as the provider’s liquidity certificate.2. Concentrated Liquidity: In order to meet the trading characteristics of the NFT market, we have designed a AMM with concentrated liquidity . AMM price ranges can be set to a specific range to reduce trading slippage. In addition, price ranges are allowed to be updated during the market making process, which greatly increases the flexibility.3. Liquidity Mining for NFT LP incentive: We have designed a modular NFT LP incentive platform and designed two specific incentive strategies. Intswap’s LPs can participate in profit sharing through STAKE LP Tokens to increase their mining revenue. Why will this solution be a source of growth for the Optimism ecosystem?: First of all, Intswap is a brand-new technology-driven NFT AMM, which effectively solves the three pain points faced by the NFT Marketplace, including insufficient liquidity, high degree of centralization, and poor business model, which helps to increase the brand value of Optimism. Secondly, because Intswap is highly interactive, it is very likely By becoming the NFT-Fi basic component in Optimism, and once again through innovative business models, such as Yield Farming, etc., it will greatly promote the entire NFT ecology of Optimism. Has your project previously applied for an OP grant?: No Number of OP tokens requested: 50k Did the project apply for or receive OP tokens through the Foundation Partner Fund?: No If OP tokens were requested from the Foundation Partner Fund, what was the amount?: 100k How much will your project match in co-incentives? (not required but recommended, when applicable): The first phase of our community incentives will all be used for project incentives on Optimsim. How will the OP tokens be distributed? (please include % allocated to different initiatives such as user rewards/marketing/liquidity mining. Please also include a justification as to why each of these initiatives align with the problem statement this proposal is solving.):  50% will be used for team salary payment:This part of the funds will be used to pay team salaries and complete project delivery.2. 30% will be used for marketing: This part of the funds will be used for user incentives in the marketing of the cold launch phase.3. 20% will be used for smart contract audit: In order to increase the security of the project, we need this part of the funds for smart contract audits to protect the safety of users’ funds.   Over what period of time will the tokens be distributed for each initiative? Shorter timelines are preferable to longer timelines. Shorter timelines (on the order of weeks) allow teams to quickly demonstrate achievement of milestones, better facilitating additional grants via subsequent proposals:  50% will be used for team salary payment: We hope to complete the code delivery within 2-3 weeks, including front-end and smart contract development, as well as the construction of related operating tools.2. 30% will be used for marketing: We hope to obtain the funds within 6 weeks and complete the distribution of user rewards for the first airdrop activity. The first airdrop activity will start in 3 weeks and last for 3 weeks.3. 20% will be used for smart contract audit: We hope to get that funding within 3-4 weeks for code audit.  Please clearly define the milestones you expect to achieve in order to receive milestone based installments. Please consider how each milestone relates to incentivizing sustainable usage and liquidity on Optimism. Progress towards each milestone must be trackable:  50% will be used for team salary payment: The milestone for this section is the code delivery, including front-end and smart contract development, as well as the construction of related operating tools.2. 30% will be used for marketing: The milestone for this section is that we finish our first airdrop activity.3. 20% will be used for smart contract audit: The milestone for this section is that we finish the development of smart contracts and find the right auditor.  Why will incentivized users and liquidity on Optimism remain after incentives dry up?: Intswap is very likely to become a NFT yield farming boom for the optimism ecology. At that time, it will break away from the early liquidity incentives. Many NFT Creators will update their business models to give incentives to their NFT LPs. This is a self-fulfilling process. At that time, Intswap will exist as an NFT-Fi infrastructure, just like the value of Uniswap to DeFi… Please provide any additional information that will facilitate accountability (smart contracts addresses relevant to the proposal, relevant organizational wallet addresses, etc.): Developer address for accepting tokens: 0x70C56C0fba60b5A3Bb2F6BD37c635010d9FD3A97 Confirm you have read and agree to the Eligibility Restrictions (here): I have read the Eligibility Restrictions and agree to abide by their conditions ",
                    "links": [
                        "https://intswap.io/",
                        "https://twitter.com/Intswap_amm",
                        "https://discord.com/invite/cvPJAz2Bms",
                        "https://docsend.com/view/z53i4vmytmmj4f2b",
                        "https://docsend.com/view/vfmh7daywzm3abny",
                        "https://test.intswap.io/app/collections",
                        "https://gov.optimism.io/t/grant-proposal-template/3233"
                    ],
                    "GPT-summary": "The post is a proposal for a new NFT AMM called Intswap, which aims to solve the pain points of the NFT marketplace, including insufficient liquidity, high degree of centralization, and poor business model. The proposal explains the features of Intswap, including aggregated Liquidity Providers, Concentrated Liquidity, and Liquidity Mining incentive for NFT LPs. The author also provides information about the team, relevant usage metrics, competitors, and the value proposition of the proposal. A 3rd party gives entirely positive feedback on the proposal and extends to it by asking about the distribution of OP tokens and milestones.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Interoperability and Scaleability",
                        "Token economics",
                        "Smart contract updates",
                        "Community and engagement"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.796315052700923
                },
                {
                    "author_link": "https://gov.optimism.io/u/FractalVisions",
                    "index": "2",
                    "likes": "0",
                    "time": "02/02/2023-00:21:52",
                    "content": "This is really cool I like your proposal it caught my eye. I would love to talk more with you about intswap and how we can work together! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.458333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/intswapfornftamm",
                    "index": "3",
                    "likes": "1",
                    "time": "06/02/2023-03:29:54",
                    "content": "Hi @lavande. I am from Intswap. Regarding Intswap’s proposal, we have some content that we hope can be adjusted: How will the OP tokens be distributed? (please include % allocated to different initiatives such as user rewards/marketing/liquidity mining. Please also include a justification as to why each of these initiatives align with the problem statement this proposal is solving.):  70% will be used for Intswap’s LP Mining rewards:  This part of the funds will be used to increase the APY of intswap’s lp mining, all OPs will be injected into Intswap’s LP Mining Pool.  30% will be used for marketing:  This part of the funds will be used for user incentives in the marketing of the cold launch phase. Over what period of time will the tokens be distributed for each initiative? Shorter timelines are preferable to longer timelines. Shorter timelines (on the order of weeks) allow teams to quickly demonstrate achievement of milestones, better facilitating additional grants via subsequent proposals:  70% will be used for Intswap’s LP Mining rewards:  We hope that this part of the tokens will be obtained immediately after one year of lockup, but this part of the tokens will be injected into Intswap’s LP Mining Pool and rewarded to the Intswap’s NFT LPs according to the predetermined Reward Rate.  30% will be used for marketing:  We hope that this part of the tokens will be obtained immediately after one year of lockup, this part of the tokens will be used for Intswap’s market activities. Please clearly define the milestones you expect to achieve in order to receive milestone based installments. Please consider how each milestone relates to incentivizing sustainable usage and liquidity on Optimism. Progress towards each milestone must be trackable:  70% will be used for Intswap’s LP Mining rewards:  The milestone for this section is the code delivery, including front-end and smart contract development, as well as the construction of related operating tools.  30% will be used for marketing:  The milestone for this section is that we finish our first airdrop activity. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.398809523809524
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "4",
                    "likes": "1",
                    "time": "14/02/2023-02:41:52",
                    "content": "this plan as designed is structurally unsuitable for the builder’s grant given the timing of the launch. Builder grants are subject to a one-year lockup of tokens, so, e.g., it would be impossible to use the grant to pay for an audit before launch. If yo uhave independent means of funding all this and can hit defined milestones, that would be in scope, but even then the milestones don’t really match the requirements. The milestones are there to assess the management and efficacy of the proposed programs. The 70% used for liquidity mining, for example, shouldn’t have as its milestone the construction of the protocol because whether you build it wouldn’t be what we use to assess whether the liquidity mining program was handed well or worked. More broadly, if you want this to be under a builder grant, you’ll want to be solving for onboarding new developers as opposed to users (with liquidity mining) or providing a uniquely useful piece of infrastructure that benefits optimism. As it stands it seems as though you’re looking for support in gaining users and solving for that, and as such you may want to consider resubmitting this for Growth Experiments later on. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.182765151515152
                },
                {
                    "author_link": "https://gov.optimism.io/u/intswapfornftamm",
                    "index": "5",
                    "likes": "1",
                    "time": "14/02/2023-04:42:10",
                    "content": "Hi @jackanorak , I see what you mean, I have modified the application: How will the OP tokens be distributed? (please include % allocated to different initiatives such as user rewards/marketing/liquidity mining. Please also include a justification as to why each of these initiatives align with the problem statement this proposal is solving.): We will use 100% of the tokens to increase the APY of intswap’s lp mining, all OPs will be injected into Intswap’s LP Mining Pool. We hope to launch our products on Optimism in Q3 of 2023. Tokens will be offered to LPs who provides liquidity in Intswap’s Swap Pool and stake the LP Token into the LP Mining Pool. Tokens will begin to be vested once they unlock after 1 year. Over what period of time will the tokens be distributed for each initiative? Shorter timelines are preferable to longer timelines. Shorter timelines (on the order of weeks) allow teams to quickly demonstrate achievement of milestones, better facilitating additional grants via subsequent proposals: We will allocate the full grant in our first month of launch. The tokens will slowly vest to LP stakers according to the staking proportion. Please clearly define the milestones you expect to achieve in order to receive milestone based installments. Please consider how each milestone relates to incentivizing sustainable usage and liquidity on Optimism. Progress towards each milestone must be trackable: We hope to launch our products on Optimism in Q3 of 2023. At that time, we will onboard NFT Creators in the Optimism ecosystem, and hope to establish Swap Pool in Intswap and use our Mining Pool service. If more than 5 NFT Swap Pools are successfully launched, we hope to use this as a milestone and obtain a grant to further attract more NFT users. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.9538690476190474
                }
            ]
        }
    ],
    "group_index": "453"
}