{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/gf-phase-0-proposal-aelin-protocol/1157",
            "title": "[GF: Phase 0 Proposal] Aelin Protocol ",
            "index": 1157,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Governance Fund: Phase 0"
            ],
            "tags": [
                "cycle-1",
                "passed"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/cb0x",
                    "index": "1",
                    "likes": "4",
                    "time": "26/05/2022-02:11:09",
                    "content": "Project Name: Aelin Protocol Author Name: cb0x, Ser Link, Alex the Lizard Defillama TVL (at snapshot): $14.5M Transactions/day (at snapshot): Variable depending on deal activity Tier: 3 Optimism native: Yes Revisions to metrics used: n/a Number of OP tokens to claim: 900,000 L2 Recipient Address: 0x5B8F3fb479571Eca6A06240b21926Db586Cdf10f Proposal for token distribution (under 1000 words): How will the OP tokens be distributed?  40% to LP stakers (AELIN/ETH), distributed weekly over a 6 month period 60% to a pool incentive program. Each new pool created on Optimism over $100,000 will be eligible for OP rewards if not disavowed by the Aelin council (see AELIP-21). An amount equivalent to 3% of the total value of the pool will be distributed at pro-rata to investors who accepted the deal.  How will this distribution incentivize usage and liquidity on Optimism? Incentivising LPs with OP tokens on top of the current AELIN incentives will significantly increase the number of stakers on Aelin Protocol, which will lead to an increase in volume on other protocols such as Uniswap and Arrakis. The pool incentive program will provide a 3% rebate of all accepted deals on the Aelin protocol. This amount will be sufficient to fully cover the Aelin protocol fee of 2% as well as an additional 1% which may offset the sponsor fee (if applicable) or simply provide an additional incentive to invest in the deal to obtain additional OP tokens. Aelin expects several deals will be conducted on the protocol over the next several months which will require investors to migrate capital to Optimism to participate in a meaningful way as the deals may be oversubscribed and require additional capital to attain their desired allocation in the deal. This incentive gives investors increased motivation to participate at a significantly reduced cost. Why will the incentivised users and liquidity remain after incentives dry up? Users who have already bridged to Optimism tend to stay and remain active, the key is to provide sufficient motivation for new users to bridge in the first place. Incentivising both liquidity providers and investors on Aelin will likely drive significant liquidity to be deposited onto Optimism. We expect a very high retention of this liquidity as new users discover the range of protocols that are already deployed to Optimism. Additionally, many of the deals conducted on Aelin include vesting terms which require the capital to stay on Optimism. Over what period of time will the tokens be distributed? The staking rewards program will be distributing 360,000 OP tokens over a 6 month period. The pool incentive program doesn’t have a time limit; however, is expected to support tens of millions in deal volume depending on the value of the OP token when the deal is accepted. How much will your project match in co-incentives? In the next few weeks, Aelin will be renewing its staking rewards program for 12 months, aiming to incentivise liquidity providers (AELIN/ETH). Incentivised pools on Optimism will receive 73 AELIN per month for a total of 876 AELIN altogether. Aelin also has a pool incentive program running that will provide 2-3% AELIN rewards for the investors and sponsors participating in a pool. ",
                    "links": [
                        "https://gov.optimism.io/t/voting-cycle-1-roundup/2619",
                        "https://gov.optimism.io/t/we-need-to-address-aelin-protocl-gf-phase-0-token-distribution/3484",
                        "https://gov.optimism.io/t/goverance-fund-accountability-an-overview/3591"
                    ],
                    "GPT-summary": "The post is a proposal for the Aelin Protocol, which includes details on how the OP tokens will be distributed and how this will incentivize usage and liquidity on Optimism. The author explains that incentivizing LPs and investors will increase the number of stakers on Aelin Protocol, leading to an increase in volume on other protocols. The post also includes information on the expected retention of incentivized users and liquidity. A third party could give constructive criticism or ask questions about the proposal, and the author is advertising the proposal.",
                    "GPT-proposal-categories": [
                        "Token economics",
                        "Interoperability and Scalability",
                        "Grants, Funding and resource allocation"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.469515151515152
                },
                {
                    "author_link": "https://gov.optimism.io/u/Justin",
                    "index": "2",
                    "likes": "0",
                    "time": "27/05/2022-06:31:10",
                    "content": "What i like about this proposal is that the incentive will force users to figure out what Aelin is - something that their website does not help very much with.  When users understand, they will appreciate the concept and realize that L2 has capabilities unavailable elsewhere.  I also like the 6 month timeframe so it is not just a flash in a pan. What needs improvement is that the focus on distribution only to ETH/Aelin LPs and not also the Aelin stakers.  I’d argue that Aelin stakers drive liquidity onto the chain and will continue to.  Yes, it locks it up whereas LPing makes the liquidity available, but … is that the rationale, that the staking pool will not drive liquidity?  Maybe the LP activity won’t be enduring whereas the stakers will come to Aelin / L2, realize the capabilities and stay.  The mercenaries will come and go no matter what, but the staking icentives would tend to bind the users into the community more. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.45
                },
                {
                    "author_link": "https://gov.optimism.io/u/kryos.eth",
                    "index": "3",
                    "likes": "0",
                    "time": "29/05/2022-02:50:35",
                    "content": "TBH Aelin I’m checking out your site, and with those juicy 149% APR LP rewards I might have to come on over before the Optimism rewards even kick in  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "5",
                    "likes": "0",
                    "time": "13/09/2022-18:25:47",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "5"
}