{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/solving-voter-apathy/2964",
            "title": "Solving voter apathy ",
            "index": 2964,
            "category": [],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/polynya",
                    "index": "1",
                    "likes": "18",
                    "time": "13/07/2022-04:09:13",
                    "content": "In the last round, only ~12% of circulating supply voted for proposals. We now have a single delegate that can pretty much override the entirety of active governance (effectively, a 51% attack on Optimism Collective). We are seeing many token holders not delegate at all, or delegate to inactive delegates. We have seen this be an issue with proof-of-stake chains. They solve this by basically bribing token holders to delegate their stake. A better way would be sharing sequencer revenues with delegators, though in this early stage, a small inflationary reward may be justified too, till the governance is adequately decentralized. The caveat being the token holders earn these rewards only if they delegate to active delegates who are voting on governance proposals. ",
                    "links": [
                        "https://gov.optimism.io/t/draft-gf-meta-proposal-to-reserve-a-share-of-gf-distribution-for-liquidity-backstopping-and-stronger-governance/2969/29",
                        "https://gov.optimism.io/t/temp-check-give-incentives-to-solve-voters-apathy/3926"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.654761904761905
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "2",
                    "likes": "8",
                    "time": "13/07/2022-05:06:52",
                    "content": "    polynya:  The caveat being the token holders earn these rewards only if they delegate to active delegates who are voting on governance proposals.   I love this approach. What do you think of this, looking at  impact = reward idea and delegates not being active here, put the delegates into RPGF domain and give some reward for their involvement and activities.  Better than paying a upfront reward. Motivate better engagement as you will be rewarding their impact, past actions, doing so we can avoid all unnecessary spam comments, challenge here is measuring the impact.  And circling back to your point, if a delegate get more reward compare to others, their delegators will also get more reward. There is more to it, but for initial conversation, lets keep it short. Ultimately, OP Foundation can decide which fund to use for this, but I am in favor of this. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.807291666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/polynya",
                    "index": "3",
                    "likes": "2",
                    "time": "13/07/2022-07:17:06",
                    "content": "The issue here is voter apathy and myopic thinking - so long-term retroactive rewards isn’t really going to help. The best incentive then should be to incentivize them upfront so token holders have no excuse not to delegate their tokens to an active delegate. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.364583333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/arabianhorses",
                    "index": "4",
                    "likes": "0",
                    "time": "13/07/2022-10:23:36",
                    "content": "    polynya:  A better way would be sharing sequencer revenues with delegators, though in this early stage, a small inflationary reward may be justified too, till the governance is adequately decentralized.   if this happens most of the people may delegate him/herself , if the target is this… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.319444444444445
                },
                {
                    "author_link": "https://gov.optimism.io/u/0xWeston",
                    "index": "5",
                    "likes": "1",
                    "time": "14/07/2022-10:43:22",
                    "content": "Well @OPUser I like where your head is at… seems like you generally keep suggesting good ideas; so I will be as straight to the point as I can be on this issue. It is blatantly obvious to me as to why there is apathy and lack of engagement. I see many creative solutions to this problem; but this requires collaboration; happy to dedicate my time, resources, and network of contacts to working on this issue if there is anyone interested in finding a long term solution. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.638888888888888
                },
                {
                    "author_link": "https://gov.optimism.io/u/fig",
                    "index": "6",
                    "likes": "9",
                    "time": "14/07/2022-14:02:12",
                    "content": "For a case study on rewards, Maker and Interest Protocol (built by @GFXlabs ) are good models. To combat voter apathy, I believe there are three solutions:   Simplicity - ease the vote load   Compensation - reward good engagement and participation   Documentation - make it abundantly clear where and how to delegate, vote, and comment   I hope this isn’t oversimplification but is a framework that most DAOs would be best off using as they grow. The biggest problems seem to be too much work, too many words, and too few rewards. Excited to see where this conversation goes and are glad to see the community discussing it early. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.034090909090908
                },
                {
                    "author_link": "https://gov.optimism.io/u/Daniel",
                    "index": "7",
                    "likes": "4",
                    "time": "15/07/2022-14:54:18",
                    "content": "“Show me the incentive and I’ll show you the outcome”. Agreed with Polynya - but we need to create not only the incentive to vote, but the incentive to vote in the best interest of the protocol and overall protocol growth.   Providing direct $OP rewards to voters or active delegates would provide immediate incentives and increase participation.  Right now, there is a vague long-term possibility of future $OP airdrop or citizenship, but that clearly has not been enough to create engagement.   There must be an economic link between voting and token value to incentivize good decision making.  Implementing a value accrual mechanism (e.g., buyback and burn, ETH payments to holders/stakers, etc.) provides at least an indirect feedback loop whereby ecosystem growth benefits token holders and voters.  Now - what incentive do I have beyond altruism to vote and what incentive do I have to consider my votes deeply?   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.518707482993197
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "8",
                    "likes": "5",
                    "time": "16/07/2022-19:30:57",
                    "content": "I think the problem with apathy is incentives. You simply can’t say: “Hey do all this work for free”. Very few people can and these people who can are already in a very privileged position (me included). So then governance ends up dominated by opinions of privileged people who can afford to do work for free. Incentives are everything. I like the idea of providing reward for both delegation and active participation as a delegate. Also for work in the forum etc. As to where those funds should come from I am not sure. Does the OP team have a governance funding treasury? Sequencer rewards sounds cool, but not sure who can decide about this. Optimism governance? Or the Optimism team? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.253703703703704
                },
                {
                    "author_link": "https://gov.optimism.io/u/polynya",
                    "index": "9",
                    "likes": "3",
                    "time": "17/07/2022-04:27:32",
                    "content": "Agreed. I’d assume this is something governance will have to sort out. For legal reasons, crypto foundations usually shy away from these types of decisions - though I don’t know the specific case for Optimism Foundation. Three areas where we can find incentives:  Sequencer revenue sharing 8.8% Unallocated ecosystem fund 2% inflation  Sequencer revenues would be the most sustainable, but will require significant work from the OP Labs team to enable. But it’ll eventually be required anyway. I suspect long term it’ll have to be a part of both 1) and 3). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4375
                },
                {
                    "author_link": "https://gov.optimism.io/u/MinimalGravitas",
                    "index": "10",
                    "likes": "4",
                    "time": "17/07/2022-17:00:15",
                    "content": "I like the idea of incentivizing OP holders to check in on the votes their delegates are making, even if it is just to check that they are voting at all that would probably be a good start. If there was a small inflation then it would really be a carrot and stick scenario for OP holders, as if their delegate didn’t vote then they would suffer the negative effects of inflation, whereas if their delegate was active then they would be presumably getting rewards at slightly above the inflation rate. I’ve been offline dealing with IRL stuff for over a week, and don’t think I’ve logged in here before today for that whole time, no contributions to anything, and yet it seems the same number of people have delegated to me as before. Surely a more rational system would have delegators scrutinizing us and reallocating their votes based on, for example, their delegate being AWOL for ages! Your suggestion seems worth trying to me. If it doesn’t help over a set time then we can always just try something else in the path to OPtimizing our governance. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.670833333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/kohei",
                    "index": "11",
                    "likes": "0",
                    "time": "17/07/2022-19:14:48",
                    "content": "Thanks for bringing this up to discuss @polynya delegation is the key to increasing the level of decentralization, so I love to not only talk about delegation like many other DAOs, but also discuss and take action. I think the right order to tackle this situation is first to enable an incentive mechanism for delegates  (as @fig mentioned Maker model is doing a good job) and then experiment to find the right incentive mechanism for delegators. (ex revenue share between delegates and delegators) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.22564935064935
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "12",
                    "likes": "1",
                    "time": "17/07/2022-22:35:27",
                    "content": "    polynya:  8.8% Unallocated ecosystem fund   This would be best choice right now and long term combination of all three as we grow in size and responsibility. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.059523809523808
                },
                {
                    "author_link": "https://gov.optimism.io/u/0xvividmirage",
                    "index": "13",
                    "likes": "1",
                    "time": "19/07/2022-22:53:11",
                    "content": "Main issue I see with voting is I have to tear out OP from my LPs just to vote. OP needs some type of liquid staking. Mai Finance allows you to vote with staked tokens, wallet tokens and via other protocols by staking on their platforms (liquid staking). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.104166666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/Bobbay_StableLab",
                    "index": "14",
                    "likes": "2",
                    "time": "23/07/2022-18:38:12",
                    "content": "We can probably use a bit of inspiration from the Maker model and overlap it with @polynya idea that token holders only receive the reward if they delegate to active delegates. By using participation metrics such as voting activity, we can quickly determine how active a delegate is every month. If a delegate votes for a minimum 90% of proposals, then the delegators receive the full reward through staking, with the sliding performer used in the MakerDAO. Any voting activity between 75% to 89% will receive a reduced amount of rewards. This would encourage delegators to delegate to trusted individuals who will vote monthly. The rewards for delegators shouldn’t be too large, but enough to encourage them to stake and delegate. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.394345238095238
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "15",
                    "likes": "2",
                    "time": "27/07/2022-13:27:21",
                    "content": "I think we also need to commit approved proposals to stay engaged in voting participation. If a project asks for some OP then they should participate in every voting cycle. We can even implement a release of some portion of requested tokens every time they cast their vote in future proposals. Keeping their commitment tied to the requested OP. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/0x000",
                    "index": "16",
                    "likes": "0",
                    "time": "06/11/2022-16:08:45",
                    "content": "I like this idea. Beneficiary projects should participate in governance too. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/0x000",
                    "index": "17",
                    "likes": "0",
                    "time": "06/11/2022-16:13:17",
                    "content": "Incentivizing both delegates and delegators is important, because governance participation takes valuable time and effort. It is also important to constantly  educate and inform the community. We can also take a look at gamifying forum participation and voting, with multipliers for activity levels and value added. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.333333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/raho",
                    "index": "18",
                    "likes": "4",
                    "time": "06/11/2022-18:03:23",
                    "content": "    polynya:  We are seeing many token holders not delegate at all   I agree that voter apathy is partially to blame here, but I think there is actually a larger issue. There is potential voting power being distributed via Token House funded grants in the form of liquidity mining, airdrops, etc., but there is nothing in place to capture the new OP holders. In order to claim the airdrop users had to either self-delegate or choose a delegate. As a result, all Airdropped OP that was claimed was delegated and we have our initial delegators/delegated tokens. However, the number of delegators will really only go down as initial airdrop recipients sell and new holders are not funneled into the delegation portal/claims page. Unless new OP holders or incentive recipients either: A) have already delegated/self-delegated to receive the airdrop (in which case the number of delegators remains the same but votable OP supply increases), or B) take the initiative to go to the claims page to delegate/self-delegate, the number of delegators will be down only. Additionally, unless current delegators drastically increase their OP holdings to cover the number of votable OP tokens sold by airdrop recipients, the votable OP supply will also be down only. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.100713012477717
                },
                {
                    "author_link": "https://gov.optimism.io/u/S4t0sh1",
                    "index": "19",
                    "likes": "1",
                    "time": "07/11/2022-10:31:14",
                    "content": "For me there are two “easy” solutions to this.  Incentive to vote. Give people a reward for delegating their voting power.  By incentive to vote I mean something like - in order to be eligible for future airdrops you must delegate your voting power. By giving people a reward and this includes being able to be eligible for future airdrops, I mean a reward upfront for example if you delegate your voting power you get X amount of tokens as a direct reward sent to your wallet. Another option coming to my mind is, if you want to encourage people to engage in the voting process you should also reward that. Let’s say there is a new proposal and the delegate you support is voting for it and after the voting process gets approved/implemented everybody gets rewarded (the delegate and the people behind it get a reward in form of OP tokens, just like the various dapps in the OP Summer incentive). One other issue I and I guess many others have is, if you use your OP tokens for buying/selling NFTs or staking them on the various defi platforms like Sonne, IronBank or Tarot they get locked up and in order to vote right before the snapshot you have to stop all of that just to delegate your voting power, which requires a lot of time and transaction cost in order to do so. With Zero benefit on the other side. Why should people delegate then? ",
                    "links": [
                        "https://gov.optimism.io/t/temp-check-give-incentives-to-solve-voters-apathy/3926/37"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.226803751803751
                },
                {
                    "author_link": "https://gov.optimism.io/u/S4t0sh1",
                    "index": "20",
                    "likes": "0",
                    "time": "07/11/2022-10:33:45",
                    "content": "I’d be on board in finding a long term solution to this. Here are some of my ideas. If you are guys still onto it. Might be outdated since this was posted in July already. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.8749999999999996
                }
            ]
        }
    ],
    "group_index": "154"
}