{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/forward-growth-experiment-cycle-11/5539",
            "title": "Forward: Growth Experiment - Cycle 11 ",
            "index": 5539,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Grants Council"
            ],
            "tags": [
                "cycle-11"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/HicoFP",
                    "index": "1",
                    "likes": "1",
                    "time": "08/03/2023-18:59:12",
                    "content": "Growth Experiments Form  Basic Details  Asset 8@4x2214×671 15.3 KB  Project name: Forward Author name and contact info (please provide a reliable point of contact for the project.): Karnika E. Yashwant: key@forwardprotocol.io L2 recipient address: 0x182CebAB47af1302F39A3dE67dA8BA3945341690 Which Voting Cycle are you applying for?: Cycle 11 I confirm that I have read the landing pages for the Builders  and Growth Experiments  Sub-Committees and that I have determined my proposal is best suited to be reviewed by the Growth Experiments Sub-Committee: [Yes/No]: Yes I understand that Growth Experiments grants are subject to a “no sale rule,” as explained in this post, and I have read the terms of the rule: [Yes/No]: Yes Project Details What are you building?: Forward Protocol is WordPress of Web3.0. Users with zero technical knowledge can build and deploy full-stack dApps in very little time and minimum cost involved with an easy-to-use, drag-and-drop no-code interface. These dApps can be deployed directly to Optimism. Blockchains and subnets can also be deployed through Forward so the OP SuperChain would be a great addition when integrated in future updates. Forward has an open marketplace where developers can build or upload their templates and set their own fees and monetization structure. Languages which we support are Solidity, with Rust and Move coming soon. Python, Go and Move are also on our roadmap.  ForwardFront-end1920×946 72.5 KB  Why do you believe what you are building is going to succeed?: Building and deploying dApps takes time, money and technical expertise. With Forward’s no-code drag-and-drop interface anyone can start building a full-stack dApp and deploy it to Optimism instantly. The open Forward Marketplace allows developers to upload their own templates for non-technical users to use. This simplicity is what every project and chain is looking to have and it’s essential for Blockchain as a whole to succeed. Forward is also able to build custom templates that can be used by your community to deploy dApps directly to Optimism. If Optimism has a specific area of focus to grow your ecosystem, we can build it. Or run a hackathon to the Optimism developer community to crowd source templates.  Forward Marketplace1280×797 67 KB  How many users does your project have currently? Please include how you arrived at this estimate: We tested with 250 users in Private Alpha and we have launched Public Alpha now. We estimate about 40,000 users from our current campaigns to join us in the next 60 days. How will receiving a grant enable you to further the mission of maximizing the number of users interacting with Optimism? Please include a step-by-step flow of how you imagine this grant can lead to a greater number of user interactions with Optimism: Once the grant is received we plan to do the following (Further elaboration in ‘Roadmap and Distribution Plan’):  30% will go towards dApp deployments on Optimism through Forward Optimism will get more users deploying dApps on Optimism. Users deploying dApps directly on Optimism will be rewarded for their deployments as a fee-rebate. 40% will go towards marketing by rewarding affiliates and referrals. Through this initiative affiliates and referrals will be rewarded for how many users they bring to Forward who are deploying and transacting/interacting with dApps on Optimism. 10% rewards will be given to audited contracts to ensure safety, security and quality of the Templates uploaded. 20% rewards will be used in hackathons to attract new templates.  Tell us about the users you plan to target with this grant. Include any defining characteristics that will help you identify and target them.: We are targeting business owners, entrepreneurs and others that have a real use case to deploy on Optimism. These are based on actual user business cases. Characteristics include but aren’t limited to:  Businesses wanting to move from Web2 to Web3. Businesses wanting to extend their reach to incorporate Web3 payments. Non-technical entrepreneurs wanting to build a business on Web3. Entrepreneurs that want to test their business ideas through the use of Web3 technology. Users that want to build and deploy dApps quickly, low cost and with minimal effort. New Web3 enthusiasts that want to get their hands dirty by building and deploying dApps. Smart contract developers and Web designers wanting to monetise their code by uploading their templates to the open Forward Marketplace.  How would these users interact with Optimism? For how long?: They would interact with Optimism by deploying dApps directly to Optimism or deploy dApps that hook into existing Optimism ecosystem projects. Once dApps are deployed to Optimism through Forward, any user is able to interact and transact with the deployed dApps as these are full-stack dApps, with a front-end and back-end functionality. Due to these dApps being live and available for anyone to use once deployed, users of the business who deployed it will keep interacting with it as our target users are real business cases. Developers uploading templates will also maintain their templates because they can set their own fees and monetization structure, so they are incentivized and inclined to stay on the platform. Provide us with links to any of the following for the project:  Demo: DocSend  Website: https://forwardprotocol.io/  Twitter: https://twitter.com/ForwardProtocol  Discord/Discourse/Community: Forward  Github: Forward Protocol · GitHub  Technical/Economic Documentation: Factory Projections - Cases - Google Sheets Other: Linktree: Forward Protocol | Twitter, Instagram, Facebook | Linktree  Deck: DocSend  Telegram: Telegram: Contact @forwardprotocolofficial  Facebook: Forward Protocol  LinkedIn: https://www.linkedin.com/company/forwardprotocol  YouTube: Forward Protocol - YouTube  CoinGecko: Forward Price: FORWARD Live Price Chart & News | CoinGecko  CoinMarketCap: Forward Protocol price today, FORWARD to USD live, marketcap and chart | CoinMarketCap WhitePaper: https://whitepaper.forwardprotocol.io/   Do you have any metrics on the project currently? (TVL, transactions, volume, unique addresses, etc. Optimism metrics preferred; please link to public sources such as Dune Analytics, etc.): Forward was in Private Alpha and just went public after extensive testing with 250 users. So these metrics are not available currently. Who are your competitors, and are they on Optimism?:  https://thirdweb.com/  https://moralis.io/ on Optimism. https://www.starton.io/ https://www.settlemint.com/ https://simbachain.com/  https://www.cookbook.dev/ on Optimism. https://enzyme.so/  https://www.quicknode.com/ on Optimism. https://www.lokicode.io/  Please link to code audits (if any): Forward Protocol - Final Audit Report.pdf - Google Drive Team Who are your founders?: Karnika E. Yashwant - https://www.linkedin.com/in/mrkey/ Mitch Rankin - https://www.linkedin.com/in/mitchrankin/ What makes your team well-suited to carry out the project described in this proposal? Karnika E. Yashwant (Mr. KEY) has been in the Blockchain space since 2013 and is the Founder of KEY Difference Media (Top 5 ICO Marketing Agencies of 2018), and CIO of Utopian Capital. He was a member of the prestigious Forbes Council and a contributor to articles on current Blockchain and marketing trends to various crypto media. He takes pleasure in 16 years of Content Marketing track record and 550m+ raised in ICOs for various clients. KEY has a hybrid of technical, business and marketing experience. Mitch Rankin is an entrepreneur who has decades of successful international business and investors relations experience and he’s the CEO of EnglishForward.com, the internet’s largest English learning community. Our co-Founders have a good balance between web2 and web3 to enable web2 users joining the web3 world successfully. KEY’s decade long experience in Blockchain industry working on projects has given him great connections in the space to make progress happen Is this your first Web3 project?: Yes If not, what else have you built? (Share links, Github repository, or any other useful information.): No Grant Request What is the size of the grant request? (250k OP max): 200k OP How do you justify the size of the grant?: We are confident that we can facilitate more dApp deployments and users interacting with the Optimism ecosystem. As we have a considerable following, we can promote the usage of Optimism on Forward to a large audience. We currently have 38.1k Twitter followers, 10.8k Telegram members, 15k Facebook followers, 617 Medium followers, 1365 Discord members and 5.53k YouTube subscribers. We are also affiliated with different media outlets like Cryptopolitan which has 1.4m traffic and over 100k+ social audiences. KEY Difference Media is one of the oldest blockchain marketing agencies founded by Mr. KEY, our co-founder, who has 90+ LinkedIn recommendations and 25,000+ Top Tier Global Connections is also involved in pushing the user growth of the ecosystem. We are in PUBLIC Alpha currently and busy arranging hackathons with user onboarding as well. Hackathons are being finalized with Dubai Blockchain Center, Jordan web3 and others. Roadmap and Distribution Plan Describe in discrete steps how you will successfully implement your grant plan: When the grant is received, Forward’s grant plan will be as follows:  Forward will start a marketing campaign on our social media channels spreading the word that anyone can join Forward for free and deploy full-stack dApps directly to Optimism. Forward will leverage Product Hunt, Media Partners, PR, hackathon, affiliate network and other efforts to attract users and developers. Users joining Forward can utilise any of the 12+ pre-built full-stack templates which are already listed on the Marketplace for free and deploy it directly to Optimism. Developers can also start building their own templates by uploading their smart contract and using the no-code drag-and-drop interface to build the front-end. They can then choose to list it to the Forward Marketplace and set their own fee and monetisation structure for the usage of their template or they can choose to keep it private. OP tokens will then be allocated to any user deploying a dApp to the Optimism mainnet. By using the free pre-built templates in the Marketplace. Using developer uploaded templates in the Marketplace. OP tokens will be allocated for any developer who uploads/ builds their own template and makes it FREELY available for usage in the Marketplace Once a user utilises the FREE (developer uploaded) template and deploys it to Optimism Mainnet, the developer will receive OP tokens. dApps with top user activity will also be dropped OP tokens to incentivize business users to continue promoting the dApp within their business case User feedback is collected on the type of templates they like to see on an ongoing basis and hackathons are conducted regularly to fulfill that in association with top-brands like Dubai Blockchain Center.  How will the OP tokens be distributed? (please include % allocated to different initiatives such as user rewards/marketing/liquidity mining. Please also include a justification as to why each of these initiatives align with the problem statement this proposal is solving. Distribution should not include the sale of any tokens by the grantee or the use of tokens for compensation, protocol expenses, etc. See the no sale rule here ): The OP token distributions will be allocated as follows:  30% allocation for dApp deployments, each user deploying a dApp to Optimism will be incentivized with OP tokens to the equivalent value of the deployment gas fees. Deployers will also receive the OP token equivalent of gas cost for transactions going through the deployed contract. As the usage and transactions increase, the deployer will receive additional OP tokens equating to a percentage of the transaction’s value. Template developers will receive OP tokens based on the amount of times their templates have been deployed to Optimism. For example, if a template gets deployed 10 times and has at least 20 transactions or $50 in transaction value, OP tokens will be dropped for the developer. 40% for marketing, OP tokens will be rewarded to people sharing Forward’s affiliate and referral links and on-boarding new users. For example, every person that gets 10 users to sign-up on the Forward platform will receive OP tokens and additional OP tokens for each user that deploys a dApp on Optimism. 20% for hackathons will be used as prizes for the developers uploading templates which have been assessed by the judges of the hackathon. For example, the first prize for the best hackathon template adjudicated by the judges will receive 500 OP tokens. 10% of tokens will act as a bonus for the developer and deployer if the uploaded template is officially audited before deployment. For example, the developer of the audited template will receive an additional OP token drop when deployed, with the deployer also receiving more OP tokens for using the audited template.  We are also open to discuss what amount of OP tokens should be dropped for each topic. Over what period of time will the tokens be distributed for each initiative?: With regards to the timeline, within 8 months the tokens will be distributed to users through dApp deployments, deployed dApp usage and marketing. Please provide benchmark milestones for this project. These milestones should guide the Optimism community on the progress of your project throughout your work on the project. Do not use distribution of the grant itself as a milestone:  Forward will have 300 users by the end of July ‘23 and 1000 by the end of December ‘23. Forward will have 40 developers uploading templates to the Marketplace by the end of July ‘23 and 200 by the end of December ‘23. Forward Marketplace will grow from 12 templates to having 30 templates by end of July ‘23 and aiming for 100 by end of December ‘23.  Please define critical milestones for this project. Critical milestones are meant to show good-faith efforts to accomplish the project. Non-completion of these milestones could lead to revocation of remaining grant rewards. Do not use distribution of the grant itself as a milestone:  Forward will have at least 20 dApp deployments on Optimism by the end of July ‘23 and over 50 by end of December ‘23. Forward will have at least 5 unique template deployments on Optimism by end of July ’23 and over 15 by end of December ‘23. dApp usage metrics on Optimism will be at least 50 transactions by end of July ‘23 and over 200 transactions by end of December ‘23. Forward will have cross-language (Solidity, RUST, GO, Python) auto-conversion by the end of August ‘23. Forward’s affiliation system will be integrated by the end of October ‘23. The EIP 2535 (Diamond Contract Deployment) will be integrated by the end of November ‘23.  With regards to metrics and time frames:   dApp deployments on Optimism: Dates: This is an ongoing and updating metric. We will provide MONTHLY updates on the 1st of every month showing the current stats. Source of truth: This can be verified on-chain, we can provide a list of dApp contract addresses for you to check. This can also be verified through our API directly for authorized users once our API’s are made public.   dApp templates being used to deploy on Optimism: Dates: This is an ongoing and updating metric. We will provide MONTHLY updates on the 1st of every month showing the current stats. Source of truth: This can be verified by logging into the Forward Factory as a user/developer to see the templates in the Marketplace. We will also see if any API can be provisioned towards this data.   dApp usage metrics on Optimism: Dates: This is an ongoing and updating metric. We will provide MONTHLY updates on the 1st of every month showing the current stats. Source of truth: This can be verified on-chain on the respective dApp contract addresses for you to check.   Both benchmark and critical milestones can be amplified by a factor of at least 3 if there is additional support from OP’s marketing team as a joint effort to onboarding developers and users with more joint activities If the OP tokens are for direct distribution to users, why will incentivized users and liquidity on Optimism remain after incentives dry up?: Users are deploying full-stack dApps (back-end and front-end) through Forward so they will be inclined to stay on the platform because their dApp is up & running and can be interacted with. We are targeting business owners, entrepreneurs and others that want a real use case to deploy on Optimism. These are based on actual user business cases so the users won’t ignore the business case and jump ship soon after deployment. The business owners and entrepreneurs deploying their dApps would continue marketing their project to ensure the usage of it for their monetary gain. OP incentivized developers would also remain because they would be incentivised on Forward for the usage of their templates. It is in their best interest to maintain their code so that their templates keep being used. All templates available in the Marketplace can be deployed to Optimism directly. Please provide any additional information that will facilitate accountability (smart contracts addresses relevant to the proposal, relevant organizational wallet addresses, etc.): N/A Optimism Relationship Does your project solve a problem for the Optimism ecosystem? If so how?: The problem that Forward is trying to solve is that Forward wants to make it easy, affordable and quick for any person to build and deploy a dApp directly to Optimism. Forward will benefit the Optimism ecosystem by allowing any person irrespective if they are technically inclined or not, to build and deploy full-stack dApps. dApps being deployed would be aimed at real world use and business cases where the deployers would promote and market their dApp to increase the usage of it. Developers can also upload their own templates and monetize the usage thereof. With more developers uploading templates in the Forward Marketplace, more unique dApp templates and deployments would occur. This would also drive more users to interact with the Optimism deployed dApps. Why will this solution be a source of growth for the Optimism ecosystem?: Anyone can start building dApps and deploy it directly to Optimism through Forward free of charge. Developers are also incentivized to stay on the platform and increase the quality of their templates to be used through the fee and monetization structure. Is your project Optimism Native?: No Confirmations I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: [Yes/No]: Yes I understand that I will be expected to following the public grant reporting requirements outlined here: [Yes/No]: Yes  ",
                    "links": [
                        "https://foul-porch-0eb.notion.site/Builders-Sub-Committee-02ba9da5b4534fbf955e6e4c8fcf1aa3",
                        "https://foul-porch-0eb.notion.site/Growth-Experiments-Sub-Committee-270d2f75ff0f410a869b2ba6a8324006",
                        "https://gov.optimism.io/t/grant-proposal-template/3233",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/f/ff1e7721cf3197ed9911f88ff8ba252ebc29ae63.jpeg",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/2/2609b26199f63285b44ae12faa49bc6b0127c609.jpeg",
                        "https://docsend.com/view/u8yfr45am8a8pn92",
                        "https://forwardprotocol.io/",
                        "https://twitter.com/ForwardProtocol",
                        "https://discord.com/invite/X6HYF8dHYQ",
                        "https://github.com/ForwardProtocol",
                        "https://docs.google.com/spreadsheets/d/1BNqvZUs6PTbpizM-FKmByJxgWMqwIbRQSjJD_wFQ9YM/edit#gid=1087372748",
                        "https://linktr.ee/ForwardProtocol",
                        "https://docsend.com/view/bf5qn3cu5ec8a49n",
                        "https://t.me/forwardprotocolofficial",
                        "https://www.facebook.com/ForwardProtocol",
                        "https://www.linkedin.com/company/forwardprotocol",
                        "https://www.youtube.com/forwardprotocol",
                        "https://www.coingecko.com/en/coins/forward",
                        "https://coinmarketcap.com/currencies/forward-protocol/ico/",
                        "https://whitepaper.forwardprotocol.io/",
                        "https://thirdweb.com/",
                        "https://moralis.io/",
                        "https://www.starton.io/",
                        "https://www.settlemint.com/",
                        "https://simbachain.com/",
                        "https://www.cookbook.dev/",
                        "https://enzyme.so/",
                        "https://www.quicknode.com/",
                        "https://www.lokicode.io/",
                        "https://drive.google.com/file/d/1z7kqcWqlq5lvbPt4G534JoXPHEJAtdPN/view",
                        "https://www.linkedin.com/in/mrkey/",
                        "https://www.linkedin.com/in/mitchrankin/",
                        "http://EnglishForward.com",
                        "https://foul-porch-0eb.notion.site/Proposer-AMA-February-3-2023-279db2774af249a8b07797d3cb9b5ef3",
                        "https://gov.optimism.io/t/suggested-public-reporting-requirements-for-grantees/4176"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.693680767761649
                },
                {
                    "author_link": "https://gov.optimism.io/u/MattL",
                    "index": "2",
                    "likes": "2",
                    "time": "16/03/2023-06:27:04",
                    "content": "Hello and thank you for your proposal! Throughout the application process, this forum thread will be one of the official means of communication. Please be sure to monitor it for updates over the course of the review period. At this stage, applications are mainly being reviewed for completeness, and nothing at this stage should be construed as support or opposition by any members of the Grants Council.     HicoFP:  What is the size of the grant request? (250k OP max): 250k OP   The grant request of 250k OP seems too large for a project in private alpha. Consider scaling down the requested amount or provide a detailed breakdown of how the funds will be used to justify the request.     HicoFP:   40% will go towards marketing by rewarding affiliates and referrals. Through this initiative affiliates and referrals will be rewarded for how many users they bring to Forward who are deploying and transacting/interacting with dApps on Optimism. 10% rewards will be given to audited contracts to ensure safety, security and quality of the Templates uploaded. 20% rewards will be used in hackathons to attract new templates.    It seems like this proposal is trying to do a LOT of different incentives to handle most of the expenses that will be incurred by the team. Marketing expenses, Audit Expenses, and Hackathon expenses would not fit within no-sale. The proposal does not provide a clear process for allocating the 30% of tokens intended for dApp deployments. To ensure quality submissions, please specify the criteria for receiving these incentives and any vetting process in place.     HicoFP:  Does your project solve a problem for the Optimism ecosystem? If so how?: Yes, Forward by nature is designed to increase dApp deployments and dApp usage on Optimism which means ecosystem growth.   The proposal does not clearly articulate the problem it is trying to solve within the Optimism ecosystem. Please provide a more detailed explanation of the need for this project and how it will benefit the ecosystem.     HicoFP:  Please provide benchmark milestones for this project. These milestones should guide the Optimism community on the progress of your project throughout your work on the project. Do not use distribution of the grant itself as a milestone: The milestones/KPI’s will be measured by the amount of dApps deployed, templates uploaded & deployed and the usage of deployed dApps on Optimism through Forward. With trackable deployments and user signups we can also analyse how many users we have gained and who are deploying on Optimism. With referral and affiliate links, Forward would also be able to track how many users a specific activity brings to the ecosystem. dApp deployment on Optimism: 1400+ dApp templates being used to deploy on Optimism: 350+ dApp usage metrics on Optimism: Based on business use-cases of the respective users On-boarding Optimism users: Based on business use-cases of the respective users On-boarding Optimism developers: 700+ Please define critical milestones for this project. Critical milestones are meant to show good-faith efforts to accomplish the project. Non-completion of these milestones could lead to revocation of remaining grant rewards. Do not use distribution of the grant itself as a milestone: dApp deployments on Optimism. dApp templates being used to deploy on Optimism dApp usage metrics on Optimism.   The provided metrics lack specificity and are not tied to clear timeframes. Without specific target dates, it is difficult to assess progress and hold the project accountable. Additionally, the critical milestones mentioned seem to be a subset of the benchmark milestones, which makes them redundant. Please revise the milestones to provide clearer and more measurable targets. Review the milestone assessment doc for more information. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.872864590606525
                },
                {
                    "author_link": "https://gov.optimism.io/u/HicoFP",
                    "index": "3",
                    "likes": "1",
                    "time": "20/03/2023-11:59:13",
                    "content": "Hey @MattL, thanks for your response and feedback. Apologies for the delay in my reply. Here are the answers to your questions. I will also update our proposal with these answers.  The grant request of 250k OP seems too large for a project in private alpha. Consider scaling down the requested amount or provide a detailed breakdown of how the funds will be used to justify the request.  We are in PUBLIC Alpha currently and busy arranging hackathons with user onboarding as well. Hackathons are being finalized with Dubai Blockchain Center, Jordan web3 and others. Thanks for the advice and will scale down from 250k to 200k.  It seems like this proposal is trying to do a LOT of different incentives to handle most of the expenses that will be incurred by the team. Marketing expenses, Audit Expenses, and Hackathon expenses would not fit within no-sale. The proposal does not provide a clear process for allocating the 30% of tokens intended for dApp deployments. To ensure quality submissions, please specify the criteria for receiving these incentives and any vetting process in place.  On the criteria for receiving OP incentives: Regarding the 30% allocation for dApp deployments, each user deploying a dApp to Optimism will be incentivized with OP tokens to the equivalent value of the deployment gas fees. Deployers will also receive the OP token equivalent of gas cost for transactions going through the deployed contract. As the usage and transactions increase, the deployer will receive additional OP tokens equating to a percentage of the transaction’s value. Template developers will receive OP tokens based on the amount of times their templates have been deployed to Optimism. For example, if a template gets deployed 10 times and has at least 20 transactions or $50 in transaction value, OP tokens will be dropped for the developer. With regards to the 40% for marketing, OP tokens will be rewarded to people sharing  Forward’s affiliate and referral links and on-boarding new users. For example, every person that gets 10 users to sign-up on the Forward platform will receive OP tokens and additional OP tokens for each user that deploys a dApp on Optimism. 20% for hackathons will be used as prizes for the developers uploading templates which have been assessed by the judges of the hackathon. For example, the first prize for the best hackathon template adjudicated by the judges will receive 500 OP tokens. The remaining 10% of tokens will act as a bonus for the developer and deployer if the uploaded template is officially audited before deployment. For example, the developer of the audited template will receive an additional OP token drop when deployed, with the deployer also receiving more OP tokens for using the audited template. We are also open to discuss what amount of OP tokens should be dropped for each topic.  The proposal does not clearly articulate the problem it is trying to solve within the Optimism ecosystem. Please provide a more detailed explanation of the need for this project and how it will benefit the ecosystem.  The problem that Forward is trying to solve is that Forward wants to make it easy, affordable and quick for any person to build and deploy a dApp directly to Optimism. Forward will benefit the Optimism ecosystem by allowing any person irrespective if they are technically inclined or not, to build and deploy full-stack dApps. dApps being deployed would be aimed at real world use and business cases where the deployers would promote and market their dApp to increase the usage of it. Developers can also upload their own templates and monetize the usage thereof. With more developers uploading templates in the Forward Marketplace, more unique dApp templates and deployments would occur. This would also drive more users to interact with the Optimism deployed dApps.  The provided metrics lack specificity and are not tied to clear timeframes. Without specific target dates, it is difficult to assess progress and hold the project accountable. Additionally, the critical milestones mentioned seem to be a subset of the benchmark milestones, which makes them redundant. Please revise the milestones to provide clearer and more measurable targets. Review the milestone assessment doc for more information. 1  Benchmark Milestones (revised):  Forward will have 300 users by the end of July ‘23 and 1000 by the end of December ‘23. Forward will have 40 developers uploading templates to the Marketplace by the end of July ‘23 and 200 by the end of December ‘23. Forward Marketplace will grow from 12 templates to having 30 templates by end of July ‘23 and aiming for 100 by end of December ‘23.  Critical Milestones (revised):  Forward will have at least 20 dApp deployments on Optimism by the end of July ‘23 and over 50 by end of December ‘23. Forward will have at least 5 unique template deployments on Optimism by end of July ’23 and over 15 by end of December ‘23. dApp usage metrics on Optimism will be at least 50 transactions by end of July ‘23 and over 200 transactions by end of December ‘23. Forward will have cross-language (Solidity, RUST, GO, Python) auto-conversion by the end of August ‘23. Forward’s affiliation system will be integrated by the end of October ‘23. The EIP 2535 (Diamond Contract Deployment) will be integrated by the end of November ‘23.  With regards to metrics and timeframes: dApp deployments on Optimism: Dates: This is an ongoing and updating metric. We will provide MONTHLY updates on the 1st of every month showing the current stats. Source of truth: This can be verified on-chain, we can provide a list of dApp contract addresses for you to check. This can also be verified through our API directly for authorized users once our API’s are made public. dApp templates being used to deploy on Optimism: Dates: This is an ongoing and updating metric. We will provide MONTHLY updates on the 1st of every month showing the current stats. Source of truth: This can be verified by logging into the Forward Factory as a user/developer to see the templates in the Marketplace. dApp usage metrics on Optimism: Dates: This is an ongoing and updating metric. We will provide MONTHLY updates on the 1st of every month showing the current stats. Source of truth: This can be verified on-chain on the respective dApp contract addresses for you to check. Both benchmark and critical milestones can be amplified by a factor of at least 3 if there is additional support from OP’s marketing team as a joint effort to on-boarding developers and users with more joint activities ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.665732580911152
                }
            ]
        }
    ],
    "group_index": "592"
}