{
    "poll_list": [
        {
            "id": "0xe98be83b9b3873aef54f8a19373afdc95028342cc9f2757af6099570034b093e",
            "title": "Season 2: Cycle 7: Yearn",
            "discussion": "https://gov.optimism.io/t/ready-gf-phase-1-proposal-yearn/3509/6",
            "body": "This Governance Fund Phase 1 proposal is eligible for voting in Cycle 7. \n\nThis proposal is was reviewed by [DeFi Committee A](https://gov.optimism.io/t/defi-committee-a-season-2-recommendations/3522/8). You can find committee recommendations below:\n\n[DeFi Committee A recommendations]([https://gov.optimism.io/t/defi-committee-a-season-2-recommendations/3522/8](https://gov.optimism.io/t/defi-committee-a-season-2-recommendations/3522/8))\n\nShadow DeFi Committee B is not an official committee but has posted their own recommendations here: [https://gov.optimism.io/t/defi-shadow-committee-season-2-recommendations/3549/11](https://gov.optimism.io/t/defi-shadow-committee-season-2-recommendations/3549/11)\n\nBy approving committees, the Token House entered a social contract to entrust and delegate the bulk of decision-making to official committees. However, delegates may vote against the recommendation of official committees but should provide a justification to the community as to why they voted differently.",
            "choices": [
                "For",
                "Against",
                "Abstain"
            ],
            "scores": [
                11339852.351883182,
                364767.6452673052,
                1076016.134766244
            ],
            "start": 1665693911,
            "end": 1666291511,
            "snapshot": "29194553",
            "state": "closed",
            "author": "0x47C88bb92B409fF25F6587EA611fac4e55f76007",
            "space": {
                "id": "opcollective.eth",
                "name": "Optimism Collective"
            }
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/ready-gf-phase-1-proposal-yearn/3509",
            "title": "[READY] [GF: Phase 1 Proposal] Yearn ",
            "index": 3509,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Governance Fund: Phase 1"
            ],
            "tags": [
                "cycle-7",
                "passed"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/omgcorn",
                    "index": "1",
                    "likes": "2",
                    "time": "20/09/2022-15:18:13",
                    "content": "Project name: Yearn Author name and contact info (please provide a reliable point of contact for the project): @omgcorn on telegram or twitter, corn@yearn.finance I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: Yes L2 recipient address: 0xF5d9D6133b698cE29567a90Ab35CfB874204B3A7 Which Voting Cycle are you applying for?: Voting Cycle 7 Grant category: DeFi Is this proposal applicable to a specific committee? DeFi Committee Project description (please explain how your project works): Yearn Finance is a suite of products in Decentralized Finance (DeFi) that provides yield generation, lending aggregation, and more on the blockchain. The protocol is maintained by various independent developers and is governed by YFI holders. Project links:  Website: yearn.finance Twitter: twitter.com/iearnfinance  Discord/Discourse/Community: discord.yearn.finance Please include all other relevant links below: docs.yearn.finance  Relevant usage metrics (TVL, transactions, volume, unique addresses, etc. Optimism metrics preferred; please link to public sources such as Dune Analytics, etc.):  TVL: $555.36m 32 partners/projects using yVaults in their products All-time Strategies created: 327 All-time Vaults created: 154 Chains: 3  Ethereum $532.08m Fantom $23.11m Arbitrum $173.01k    Is/will this project be open sourced? Yes Optimism native?: No Date of deployment/expected deployment on Optimism: Already deployed and we’ve already done 2 harvests behind the scenes testing. We’ll have Optimism available on yearn.finance soon. Once we add that users will have access to these vaults day 1:  DAI WBTC WETH USDC sUSD  Ecosystem Value Proposition:  What is the problem statement this proposal hopes to solve for the Optimism ecosystem?  There are 30 existing Yearn partners who are not on Optimism yet, but have yVaults built into or accessible through their products. Existing Yearn partners who are not on Optimism are more likely to make the move when they know the yVaults they trust are already built and available. Yearn strategies have become a seal of approval when it comes to protocol safety and usage.   How does your proposal offer a value proposition solving the above problem?  More than 80% of deposits into yVaults come through partner integrations. There are 32 projects offering their users access to yVaults today and only 2 (QiDao and Beethoven) of them are on Optimism. We see an opportunity for many of the ones we already work with to move to Optimism and build on top of new yVaults. Yearn has an 8-metric risk framework that we use to evaluate every potential strategy. We evaluate 3rd party audits, TVL impact, complexity, longevity, protocol safety, team knowledge, our own internal code review, and perform extensive testing.   Why will this solution be a source of growth for the Optimism ecosystem?  yVaults are viable only when there are high quality opportunities to farm. The following are viable farming opportunities already on Optimism that we already use on other chains. We’ll have strategies for these immediately:  Aave Velo Uniswap Curve Stargate Ironbank      Has your project previously applied for an OP grant? If successful, please link to your previous grant proposal and provide a brief update on milestones achieved with the grant. If unsuccessful, and this is a resubmission, please specify how you have incorporated significant changes in accordance with feedback. No Number of OP tokens requested: 1,000,000 Did the project apply for or receive OP tokens through the Foundation Partner Fund? No How much will your project match in co-incentives? (not required but recommended, when applicable): Our project does not have token emissions so we are not able to do this today. However, with the introduction of veYFI there may be an opportunity to provide additional incentives in the future. We’re leaving the door open for this one. Proposal for token distribution:  How will the OP tokens be distributed? (please include % allocated to different initiatives such as user rewards/marketing/liquidity mining. Please also include a justification as to why each of these initiatives align with the problem statement this proposal is solving.)  Yearn will distribute 100% of grant $OP tokens to yVault depositors to incentivize the move to Optimism.   Over what period of time will the tokens be distributed for each initiative? Shorter timelines are preferable to longer timelines. Shorter timelines (on the order of weeks) allow teams to quickly demonstrate achievement of milestones, better facilitating additional grants via subsequent proposals.  25,000 tokens per week for 40 weeks   Please list the milestones/KPIs you expect to achieve for each initiative, considering how each relates to incentivizing sustainable usage and liquidity on Optimism. Please keep in mind that progress towards these milestones/KPIs should be trackable.  This program will be successful when we:  Enable 10 new partners on Optimism Grow Optimism to our second highest TVL by chain     Why will incentivized users and liquidity on Optimism remain after incentives dry up?  40 weeks of incentives ensures a long enough window to measure success and to continue building more strategies and vaults in the ecosystem. Yearn on Ethereum is quite sticky and that’s because of the partners who have built on top of Yearn vaults. We’ll make sure all current Yearn partners are aware of this program and all vaults available on Optimism today so they can get to work building on Optimism too. Even after $OP token incentives are gone, there will be lending markets, swap fees, bridges, etc as high quality sources of yield. As long as farming opportunities remain active, so will the use of yVaults. We have been using strategies with projects mentioned above in the alignment section on mainnet for a long time, some since 2020.    Adding some of my responses from the threads below: Hey Salome nice to meet you and thank you for this thorough comment. I hope you don’t mind I omitted the competitor section. You’re right we do fit the Yield Aggregator category however we have a big shift in value for only offering risk-adjusted returns. For instance, in our single asset vaults on Optimism all are liquid, none of the strategies will give users exposure to IL, long locks, and all will pass our risk management framework. Good questions on incentives. When we added Fantom and Arbitrum over half of those deposits were from net-new users. I think we’re going to see more net-new Yearn and Optimism deposits. These are going to be channeled through our partners building on top of the 5 super high quality vaults we have going live. Those 5 single-asset deposit vaults are in high demand and have over $175 million in deposits on mainnet vaults. These are a really solid foundation to build on. If we have $30 million in DAI deposits at 3% we’re looking at ~$17,300 per week. If that vault has 25% the deposits and we give it 25% the 25,000 per week $OP reward I think that’s sufficient. I hope we have the problem of dwindling rewards because of high TVL and we can always discuss a subsequent proposal when the time comes. I think this is a great place to start. Thanks for putting in the time to look at this one Salome  All 5 vaults have already been pushed to production. Check out yearn.watch and select Optimism and you’ll see all the current v0.4.4 vaults have been deployed. All that needs to be done is add them to our native UI. We wanted to do a soft launch with a couple harvests and we’ve done that. A few more harvests and we’ll add it. For token distribution, we’re going to set a weekly % distribution for each vault. Week 1 we could start with 20% across each. I think we’ll see partners across all categories we’ve seen on mainnet today: CDP, leveraged yields, wallets, CEX earn sections, web3 banking products, fixed rate products, and anyone else you can imagine is looking for Yield as a Service. There’s no shortage of people building in DeFi today and I can confidently say this number is achievable.  Yes we’ve looked for a viable $OP strategy, but haven’t found one yet. We’re always looking for new strategies and vaults to add, so if anyone sees something with some promise please reach out!  Hey Marc – Thank you for the comment. At one point we had over $1 billion in Fantom. The biggest factor in that was great yield opportunities. Today Arbitrum has mostly options plays that are outside the risk profile we use for making strategies. Here on Optimism, there were opportunities for the 5 vaults I mentioned in the proposal that are key building blocks partners. Those 5 vaults are really the secret sauce to bringing others to Optimism and getting that network effect you’re referring to. The specific strategies we’re running are using: Aave, Velo, Uniswap, Curve, Stargate, and Ironbank. We’re always looking for new strategies and if there are any others on Optimism who would like to have us take a look and see if there’s something viable we can do together please reach out to me. To show Optimism continued support, we’re testing Vaults V3 on Optimism first, even before mainnet. This is still months from launching and will bring a new style of composable vaults for the first time. You can read more about Vaults V3 here: YearnV3: Motivation and design. After the brief overview of the next… | by jmonteer | Yearn | Medium  Hey OPUser thank you for the comment. I don’t think 20 weeks is enough time to see this through. What I think you’ll get with 20 weeks is a lot of depositors into Yearn Vaults directly who will be mercenary. With 40 weeks you’ll get these partners who I already have commitment from to build on Yearn Vaults on Optimism: Alchemix, QiDao, Swype, Rhino, Omni, Spool, Revest, Abra, DeFi Saver, Tapioca, and more coming. Partner integrations leads to usefulness and stickiness. Our Arbitrum deployment was Curve 2Pool, Curve Tricrypto, and Curve MIM 3Pool in the 8 or so months we’ve been there. There were no opportunities for single deposit vaults that make up the foundation of building on Yearn. We have many other partners I did not name above who are a little further down the road in terms of building on Optimism. I’ll keep them up to date on how things are going with the hope to accelerate their path. I will be on the lookout for more partners to integrate with including native Optimism projects who apply on your forum here. I think that could be a good list of leads who may need sources of yield. Thank you again for taking the time to think about this. I know there’s a lot of info here. Please feel free to dm me to chat more if you have questions too of course. ",
                    "links": [
                        "https://yearn.watch/risk",
                        "https://medium.com/iearn/yearnv3-motivation-and-design-107840cb4844",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-nukevaults/3483/5",
                        "https://gov.optimism.io/t/defi-committee-a-season-2-recommendations/3522/8",
                        "https://gov.optimism.io/t/gfx-labs-delegate-communication-thread/2728/17",
                        "https://gov.optimism.io/t/voting-cycle-7-roundup/3586/5",
                        "https://gov.optimism.io/t/defi-shadow-committee-b-season-2-recommendations/3549/16"
                    ],
                    "GPT-summary": "The post is a proposal for a grant for the Yearn Finance suite of products in Decentralized Finance (DeFi) that provides yield generation, lending aggregation, and more on the blockchain. The proposal aims to incentivize partners to move to Optimism and build on top of new yVaults. The post includes relevant usage metrics, the problem statement, value proposition, and token distribution. The author explains the proposal and responds to constructive criticism and questions from third parties.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Interoperability and Scaleability",
                        "Smart contract updates",
                        "Board composition",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.852014090133925
                },
                {
                    "author_link": "https://gov.optimism.io/u/Salome",
                    "index": "2",
                    "likes": "2",
                    "time": "21/09/2022-16:50:36",
                    "content": "Salome again from Prime Rating  Happy to share some insights from our latest review of Yearn. With an overall rating of A+ (89%) Yearn is in the top 10 of our rated projects and is seen as one of the torchbearers of the DeFi industry. They have an excellent technical score of 93% and a very good fundamental score of 84%. With regards to this proposal, I noticed that the section on competitors, peers, or similar projects, which is part of the template, was not highlighted here. However, that’s probably also a very obvious one. Some of these competitors are for example Harvest Finance, Beefy.Finance or Vesper. Another player that can be seen as a competitor is Convex Finance, which exceeds Yearn’s market capitalization at this point. However, there is a key difference between the two. While Yearn is a token-unspecific yield aggregator, Convex focuses solely on CRV. Nevertheless, 5 days ago a teaser of $yCRV (yCRV is the latest generation of Yearn’s liquid veCRV wrapper product) got released that indicates Yearn entering a new area. As mentioned in this proposal Yearn has expanded into other chain like Fantom and Arbitrum, the vast majority of the TVL however is still locked up on the Ethereum chain. I am wondering if there are enough incentives and support from the Yearn ecosystem to push for the OP infrastructure? Is there any forecast on how much the OP incentives will boost the yields on the vaults mentioned? As Yearn is a trusted player with a strong reputation and is well positioned to bring a lot of value to Optimism I am in support of this proposal. In addition, Yearn’s in-house talent is widely accepted as top-tier. Multiple core contributors are thought leaders and influencers in the DeFi sectors that can bring value to the OP ecosystem. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.227308802308803
                },
                {
                    "author_link": "https://gov.optimism.io/u/omgcorn",
                    "index": "3",
                    "likes": "2",
                    "time": "22/09/2022-14:52:43",
                    "content": "Hey Salome nice to meet you and thank you for this thorough comment. I hope you don’t mind I omitted the competitor section. You’re right we do fit the Yield Aggregator category however we have a big shift in value for only offering risk-adjusted returns. For instance, in our single asset vaults on Optimism all are liquid, none of the strategies will give users exposure to IL, long locks, and all will pass our risk management framework. Good questions on incentives. When we added Fantom and Arbitrum over half of those deposits were from net-new users. I think we’re going to see more net-new Yearn and Optimism deposits. These are going to be channeled through our partners building on top of the 5 super high quality vaults we have going live. Those 5 single-asset deposit vaults are in high demand and have over $175 million in deposits on mainnet vaults. These are a really solid foundation to build on. If we have $30 million in DAI deposits at 3% we’re looking at ~$17,300 per week. If that vault has 25% the deposits and we give it 25% the 25,000 per week $OP reward I think that’s sufficient. I hope we have the problem of dwindling rewards because of high TVL and we can always discuss a subsequent proposal when the time comes. I think this is a great place to start. Thanks for putting in the time to look at this one Salome ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.161829004329005
                },
                {
                    "author_link": "https://gov.optimism.io/u/mastermojo",
                    "index": "4",
                    "likes": "3",
                    "time": "22/09/2022-15:38:31",
                    "content": "Excited to have Yearn on Optimism. ",
                    "links": [
                        "https://gov.optimism.io/t/ready-gf-phase-1-cycle-8-proposal-alchemix/3764"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://gov.optimism.io/u/Defi_LATAM_axlvaz",
                    "index": "5",
                    "likes": "1",
                    "time": "26/09/2022-00:22:21",
                    "content": "Hi, I have some conusltas for you:  Do you have exact implementation date of Yearn in Optimism?  -Could you please detail the token distribution plan? which yVault will be incentivized and what % to each one?  What are the 10 potential partners you think will come to Optimism once Yearn is implemented?  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://gov.optimism.io/u/omgcorn",
                    "index": "6",
                    "likes": "0",
                    "time": "26/09/2022-12:58:59",
                    "content": "Hey thank you for commenting. All 5 vaults have already been pushed to production. Check out yearn.watch and select Optimism and you’ll see all the current v0.4.4 vaults have been deployed. All that needs to be done is add them to our native UI. We wanted to do a soft launch with a couple harvests and we’ve done that. A few more harvests and we’ll add it. For token distribution, we’re going to set a weekly % distribution for each vault. Week 1 we could start with 20% across each. I think we’ll see partners across all categories we’ve seen on mainnet today: CDP, leveraged yields, wallets, CEX earn sections, web3 banking products, fixed rate products, and anyone else you can imagine is looking for Yield as a Service. There’s no shortage of people building in DeFi today and I can confidently say this number is achievable. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/Tasyta.eth",
                    "index": "7",
                    "likes": "1",
                    "time": "26/09/2022-15:37:14",
                    "content": "Hey, I checked out yearn.watch and didn’t see a OP vault. Have you guys considered adding OP vault aswell? Would be cool since it is the native goverance token of Optimism. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/omgcorn",
                    "index": "8",
                    "likes": "0",
                    "time": "26/09/2022-15:51:55",
                    "content": "Yes we’ve looked for a viable $OP strategy, but haven’t found one yet. We’re always looking for new strategies and vaults to add, so if anyone sees something with some promise please reach out! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.852272727272727
                },
                {
                    "author_link": "https://gov.optimism.io/u/Defi_LATAM_axlvaz",
                    "index": "9",
                    "likes": "1",
                    "time": "26/09/2022-17:15:02",
                    "content": "    omgcorn:  Para la distribución de tokens, estableceremos una distribución porcentual semanal para cada bóveda. La semana 1 podríamos comenzar con un 20 % en cada uno.   I could add these details to the main proposal ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/marc",
                    "index": "10",
                    "likes": "3",
                    "time": "29/09/2022-14:45:42",
                    "content": "hello @omgcorn, it’s marc from Candide Wallet. Thank you for the proposal, and welcome to Yearn on Optimism! It’s exciting to see you coming given the talented contributors that Yearn nourishes and the framework that you have set to build one of the most trusted names on Ethereum. Overall, very solid proposal. I would encourage you add the competitors section to follow the template guideline, even if your competitors have different strategies in terms of yield and risk-adjusted. I have noticed that there’s notable difference in TLV between Fantom and Arbitrum.  Can you elaborate more how Yearn managed to be more successful on Fantom than on Arbitrum? What worked and what didn’t?  Adding more details to your proposal in terms of specific strategies of collaborations or other will help. Many protocols that are already deployed on Fantom are now starting to deploy on Optimism. Yearn coming to Optimism will increase that the network effect, especially with their partners. It remains to be seen if Yearn can encourage and work with protocols deployed on Mainnet to come to Optimism, where most of the TLV is currently sitting. With the amount requested, the expectations is that it would match somehow the amount deposited in the protocol and that you have showed some traction. I would recommend to either lower the ask at the current state, or wait for the next round until you have shown officially launched with more traction with optimism vaults. You would have both integrated on yearn.finance front-end, and on-boarded your partners to Optimism. I believe that the proposal would have a higher chance of getting through either way. Overall, I am in support of this proposal as Yearn will bring lots of value for Optimism, both with their yVault partners, and their active contributors to EVM infrastructure. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.304012345679012
                },
                {
                    "author_link": "https://gov.optimism.io/u/omgcorn",
                    "index": "11",
                    "likes": "2",
                    "time": "30/09/2022-12:42:29",
                    "content": "Hey Marc – Thank you for the comment. At one point we had over $1 billion in Fantom. The biggest factor in that was great yield opportunities. Today Arbitrum has mostly options plays that are outside the risk profile we use for making strategies. Here on Optimism, there were opportunities for the 5 vaults I mentioned in the proposal that are key building blocks partners. Those 5 vaults are really the secret sauce to bringing others to Optimism and getting that network effect you’re referring to. The specific strategies we’re running are using: Aave, Velo, Uniswap, Curve, Stargate, and Ironbank. We’re always looking for new strategies and if there are any others on Optimism who would like to have us take a look and see if there’s something viable we can do together please reach out to me. To show Optimism continued support, we’re testing Vaults V3 on Optimism first, even before mainnet. This is still months from launching and will bring a new style of composable vaults for the first time. You can read more about Vaults V3 here: YearnV3: Motivation and design. After the brief overview of the next… | by jmonteer | Yearn | Medium ",
                    "links": [
                        "https://gov.optimism.io/t/voting-cycle-7-roundup/3586/5"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.9125874125874125
                },
                {
                    "author_link": "https://gov.optimism.io/u/mastermojo",
                    "index": "12",
                    "likes": "1",
                    "time": "30/09/2022-13:12:28",
                    "content": "I am an Optimism delegate [Delegate Commitments - #65 by mastermojo] with sufficient voting power, and I believe this proposal is ready to move to a vote ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Ov3rkoalafied",
                    "index": "13",
                    "likes": "4",
                    "time": "02/10/2022-19:37:59",
                    "content": "Hey just wanted to say that when Yearn launches on Optimism Alchemix should be able to integrate them pretty quickly! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.944444444444445
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "14",
                    "likes": "4",
                    "time": "03/10/2022-19:00:24",
                    "content": "Chiming in that I would absolutely love to see Yearn in Optimism and that I am a delegate with sufficient voting power. Would love to see this go on a vote eventually. But I would also like to see some back and forth feedback of either of the DeFi committees first before including the proposal to the vote, to make sure all concerns, if any, are addressed and the proposal that does go to the vote is the one that everyone is happy with. Tagging @linda @katie (DeFi A) and @OPUser @SEED_LATAM_Joxes  (DeFi C) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.125
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "15",
                    "likes": "2",
                    "time": "03/10/2022-22:12:44",
                    "content": "Hi @lefterisjp , Thank you for the tag. Writing my personal opinion here. I would love to see Yearn live on OP, on UI. Second, I would also reduce the token duration to 5-6Months(20 Weeks) and adjust the amount requested accordingly. Proposal is mostly focused on vault depositor which might attract mercenary, came for reward and once rewards is gone they might hop to another project. There are many assumption on why users will stay once incentives are over and no co-incentives. Performance on Arbitrum is also not well received. A full deployment on OP will help with many open question and would be easy to valuate the proposal. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.459848484848485
                },
                {
                    "author_link": "https://gov.optimism.io/u/omgcorn",
                    "index": "16",
                    "likes": "1",
                    "time": "04/10/2022-12:17:27",
                    "content": "Hey OPUser thank you for the comment. I don’t think 20 weeks is enough time to see this through. What I think you’ll get with 20 weeks is a lot of depositors into Yearn Vaults directly who will be mercenary. With 40 weeks you’ll get these partners who I already have commitment from to build on Yearn Vaults on Optimism: Alchemix, QiDao, Swype, Rhino, Omni, Spool, Revest, Abra, DeFi Saver, Tapioca, and more coming. Partner integrations leads to usefulness and stickiness. Our Arbitrum deployment was Curve 2Pool, Curve Tricrypto, and Curve MIM 3Pool in the 8 or so months we’ve been there. There were no opportunities for single deposit vaults that make up the foundation of building on Yearn. We have many other partners I did not name above who are a little further down the road in terms of building on Optimism. I’ll keep them up to date on how things are going with the hope to accelerate their path. I will be on the lookout for more partners to integrate with including native Optimism projects who apply on your forum here. I think that could be a good list of leads who may need sources of yield. Thank you again for taking the time to think about this. I know there’s a lot of info here. Please feel free to dm me to chat more if you have questions too of course. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.950184240362812
                },
                {
                    "author_link": "https://gov.optimism.io/u/Jadmat.Eth-DefiLatam",
                    "index": "17",
                    "likes": "4",
                    "time": "04/10/2022-15:42:31",
                    "content": "Hey @omgcorn Happy to see the great Yearn on Optimsim Very clear everything, just one question, maybe a small request.     omgcorn:  Sin embargo, con la introducción de veYFI puede haber una oportunidad de proporcionar incentivos adicionales en el futuro. Dejamos la puerta abierta para este.   Can you define the introduction of veYfi, and how it will be what you comment? Could Yearn commit to this idea and attach it to your proposal? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.8500000000000005
                },
                {
                    "author_link": "https://gov.optimism.io/u/omgcorn",
                    "index": "18",
                    "likes": "1",
                    "time": "04/10/2022-16:53:15",
                    "content": "Thank you Jadmat. We are happy to be here. I think I know why you are asking that question! The answer is we are not going to be distributing $OP to veYFI holders. Just like in our proposal, we are going to distribute 100% of the $OP to yVault users. If you don’t mind I want to avoid any potential confusion and not comment on veYFI in this context/thread. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/linda",
                    "index": "19",
                    "likes": "2",
                    "time": "05/10/2022-02:54:21",
                    "content": "I reviewed the proposal and personally don’t have any issue with it (can’t speak for DeFi Committee A) and think this proposal will help grow the Optimism ecosystem so I’m supportive. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "20",
                    "likes": "3",
                    "time": "05/10/2022-14:14:58",
                    "content": "Yearn needs almost a full year to get partners to build on it? I’d imagine at least a few would sign up more quickly. I mean, just off the top of my head, Resonate could get you set up in a day, probably @RobAnon? And then within 20 weeks we could collectively reassess needs. A million OP for almost a year of runway strikes me as excessive, as much as I very much would like Yearn to come onboard ASAP. And if your target is partners, why not earmark the funds specifically for partner or joint programs/pools rather than overall liq mining? That strikes me as having more follow-on benefits and allows you to sidestep the question of incentivizing too much mercenary capital. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.567045454545454
                },
                {
                    "author_link": "https://gov.optimism.io/u/omgcorn",
                    "index": "21",
                    "likes": "3",
                    "time": "05/10/2022-14:51:28",
                    "content": "We’re definitely working with @RobAnon at Revest already and he’s aware of these vaults. I’ve included them in my list of partners who already committed to building on top of our vaults on Optimism: Alchemix, QiDao, Swype, Rhino, Omni, Spool, Revest, Abra, DeFi Saver, Tapioca. There will be many more. I’m trying to be realistic about development cycles. It takes time for things to be built. We’ve been working with @RobAnon on the ERC 4626 adapter he’s building for a few weeks now already and that’s just one part of what they’re building. You bring up a good point about earmarking for specific protocols. I think the length and partners here will naturally be less mercenary. If we don’t earmark for specific protocols I think it could be a catalyst for development to get onboard the Optimism train. The levers we do have are to incentivize vaults that partners are using the most. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.145833333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/RobAnon",
                    "index": "22",
                    "likes": "2",
                    "time": "05/10/2022-17:58:27",
                    "content": "Can confirm, we’re excited to build on the vaults yall have put together. Our ERC-4626 systems should be easy to get onboarded with your systems  And thanks for the shoutout to the both of you! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party wanting to collaborate on proposal"
                    ],
                    "Sentiment": 6.763888888888889
                },
                {
                    "author_link": "https://gov.optimism.io/u/katie",
                    "index": "23",
                    "likes": "2",
                    "time": "12/10/2022-16:22:46",
                    "content": " Defi Committee A Recommendation Voting recommendation: Yes Rationale: Yearn is a well established project with high TVL.  We support this proposal and believe it will drive ecosystem growth and is a good use of funds. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 7.1499999999999995
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "24",
                    "likes": "0",
                    "time": "12/10/2022-19:26:36",
                    "content": "The defi shadow committee  – which is not an official committee – recommends voting against this proposal. There are some limited but high-level changes we’d liked to have seen, but we affirm that in principle we want to do as much as is reasonable to support Yearn’s onboarding onto Optimism.  Recommendation We view Yearn as a key DeFi building block that Optimism would greatly benefit from. However, 1M OP over 40 weeks seems excessive, and we believe reducing the duration and size of this proposal to 500k OP over 20 weeks is more appropriate. This should be sufficient time for Yearn to show some positive traction and integrations, and the opportunity would be there to present a second proposal for another wave of incentives. Yearn has a stellar reputation in the Ethereum community as one of the original DeFi projects. Optimism stands to gain tremendously by helping Yearn grow a foothold here—not just from the TVL their vaults will bring but from the integrations that Yearn enables with other protocols. Other projects are likely to follow Yearn here to build on top of them. There is a great multiplier effect reaped from their mere involvement, which is not something we can say for every project. ",
                    "links": [
                        "https://gov.optimism.io/t/defi-shadow-committee-b-season-2-recommendations/3549/14"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 6.003544372294373
                },
                {
                    "author_link": "https://gov.optimism.io/u/katie",
                    "index": "25",
                    "likes": "1",
                    "time": "13/10/2022-20:38:50",
                    "content": "I am an Optimism delegate [Delegate Commitments - #18 by katie] with sufficient voting power and I believe this proposal is ready to move to a vote. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/katie",
                    "index": "26",
                    "likes": "1",
                    "time": "13/10/2022-21:44:29",
                    "content": "Voted yes - Following my own committee recommendation  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "27",
                    "likes": "2",
                    "time": "15/10/2022-18:16:42",
                    "content": "Voted Yes in accordance with committee recommendation. Short duration of 6 month would have been much better but their explanation with reference to Arbitrum support a longer duration. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPenthusiast",
                    "index": "28",
                    "likes": "0",
                    "time": "16/10/2022-08:10:58",
                    "content": "Yearn would be a great addition to OP but without an OP vault and with the reward rate being so high at 25,000 / week, I think the grant size should be significantly smaller. I am voting no and would like to see a revised proposal. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.6000000000000005
                },
                {
                    "author_link": "https://gov.optimism.io/u/berkery",
                    "index": "29",
                    "likes": "0",
                    "time": "17/10/2022-15:28:21",
                    "content": "Voted yes for this proposal ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "30",
                    "likes": "0",
                    "time": "20/10/2022-12:16:54",
                    "content": "I do agree with the commitee’s recommendation and believe yearn is a good match for this grant. But I will abstain from this vote since I am a yearn multisign signer and though I get no benefit or get in any way compensated for this role, it could be seen as a potential conflict of interest which I would like to avoid. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/SEED_LATAM_Joxes",
                    "index": "31",
                    "likes": "1",
                    "time": "20/10/2022-14:04:09",
                    "content": "[Final] Voting: Yes Following the DeFi A committee recommendation,our members considered this proposal as valuable for the DeFi ecosystem and Yearn’s good reputation. We’re aware of OP’s high amount requested but in general terms this proposal seems reasonable. Please set up a L2 recipient address as soon as possible for everyone to see where funds are going for. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.85
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "32",
                    "likes": "0",
                    "time": "21/10/2022-13:31:18",
                    "content": "Snapshot vote - passed ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "33",
                    "likes": "0",
                    "time": "21/10/2022-13:31:29",
                    "content": "@omgcorn can you provide a Telegram handle or other contact method so the Optimism team can get in touch about paying out this grant! Feel free to DM or email palash@optimism.io ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.609375
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "34",
                    "likes": "0",
                    "time": "21/10/2022-13:31:33",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "35",
                    "likes": "0",
                    "time": "14/11/2022-22:23:59",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "36",
                    "likes": "0",
                    "time": "17/11/2022-17:17:59",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "262"
}