{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/introducing-governance-committees/3238",
            "title": "Introducing Governance Committees ",
            "index": 3238,
            "category": [
                "\\xf0\\x9f\\x8f\\x9b Governance",
                "Metagovernance"
            ],
            "tags": [
                "season-2"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/ben-chain",
                    "index": "1",
                    "likes": "57",
                    "time": "05/08/2022-19:52:53",
                    "content": " Committees Hello community! This post will serve as a discussion thread to solve for one of the biggest challenges faced by the Token House so far. The main idea is to reduce delegate overload by introducing a notion of “committees” which are tasked by the collective to focus on specific subsets of proposals. If approved, this proposal will remain in effect for one season (~3 months)—think of it as an experiment. This will allow for testing and reflection on whether or not committees are beneficial to the governance process before making any decisions that are difficult to reverse.  Problems to Solve We heard lots of feedback from community members and delegates throughout Season 1. Committees attempt to solve the following problems:  1. Information Overload for Delegates There are currently a lot of proposals to be voted on by Token House delegates. Even for delegates that are very familiar with the context of these proposals and their applications, processing all these proposals is unsustainable. Providing feedback on proposal drafts and engaging on forum posts, while voting on active proposals, is currently an unmanageable workload for many delegates.  2. Purpose Mismatch for Delegates Delegates have different areas of specialty. While the majority of proposals to date have been related to DeFi, some delegates specialize in non-DeFi related topics such as public goods, tooling, and L2 infrastructure. These delegates don’t feel well-equipped to vote on DeFi proposals or aren’t interested in doing so.  Why committees should solve these problems This problem may be alleviated by segmenting the work of assessing proposals among smaller, focused groups (”committees”). These committees will primarily perform information filtering and synthesis so that delegates aren’t overloaded with information. Delegates that specialize in a particular topic can defer to the recommendation of relevant committees on topics outside their area of expertise/interest.  Introducing committees  In Season 2, we will experiment with a new proposal type: committee formation. Committee formation proposals may only be submitted by delegates with >0.5% of voting power and will be accepted only for Voting Cycle #5, requiring submission before 7p GMT on Aug 25 in order to be included in Voting Cycle #5. There is no requirement for all committee members to have >0.5% of votable supply, but at least one member must in order to submit the proposal. Phase 1 committee formation proposals should follow this template and should be posted for feedback 1 week in advance of the start of Voting Cycle #5. This proposal type may be added to the operating manual in Season 3. A maximum of 4 committee formation proposals will be ratified for the duration of Season 2. Up to 4 committee proposals (measured by OP voting “Yes”) will be implemented at the start of Season 2 (with Voting Cycle #6) on Sept 8. If more than 4 committees are proposed, the 4 committees with the most votes will be implemented. Votes will be ranked across all categories. We would like to encourage a diversity of committee types and recommend delegates only vote “yes” for their top 1-2 committees in each category. Committees will operate primarily via social contract and, apart from governance-approved OP rewards for committee participation, will not directly manage tokens. Instead, committees will vet, research, and discuss proposals, then make highly visible recommendations to non-committee delegates at the time of voting. Committee members will receive OP rewards to incentivize this work. By approving a committee, delegates are entering a social contract to entrust and delegate the bulk of decision-making to the committee. They are expected to follow the recommendation of committees, except in extreme circumstances, such as:  undisclosed conflict-of-interest by the committee perceived corruption or self-dealing suspected operational security compromise/committee accounts hacked  Committee members may vote against the recommendation of their own committee, but recommendations should include a list of any dissenting committee members along with their reasoning. Delegates not serving on committees will still be responsible for signing all their own votes. If delegates vote against the recommendation of the committee, they will be expected to post their reasoning in the forum roundup thread. To address concerns about a drop-off in non-committee delegate participation, the Optimism Foundation will track this data and re-evaluate the structure of committees if we see a meaningful decrease. We believe this approach will address the feedback we received in Season 1 in a governance-minimized way, limiting the complexity introduced into voting or proposal processes. The Foundation will continue to handle the administrative work of sending OP to governance-approved grant recipients, as in Season 1.  Foundation Recommendations While it’s the Token House’s ultimate decision on what this season’s four committees should specialize in, our initial recommendation is: 2 DeFi committees specializing in different focus areas, NFTs, and Tooling. If 4 committees are not necessary, fewer committees may be approved. We have updated the cap on the number of committees to accommodate the potential creation of two distinct DeFi committees. In the event that two DeFi committees are approved, each committee should handle proposals related to distinct focus areas. If >1 DeFi committee proposal is submitted, each committee should specify an area of specialization so that there would not be a case where two committees are making recommendations on the same proposal. While committees may provide recommendations for proposals that fall outside their domain, only the recommendation of the most directly relevant committee will be surfaced and included on Snapshot. In the event that there is a proposal that does not fall clearly within any of the approved committees, it will be up to the committees to decide which committee will provide a recommendation. These committees will dissolve at the end of Season 2, and the following Reflection Period will allow the Token House to renew existing committees or propose new ones. We put forward the following guidelines for committees:  Each committee must consist of a Committee Lead and up to 4 other Committee Members. Committee Leads will be responsible for general coordination of the committee and publishing recommendation analyses on behalf of the committee. Committees will self-determine how they reach consensus on the recommendations that are put forward to delegates. This process may be different across committees. Committees will be expected to operate transparently by communicating in open channels and sharing information in public forums. Even if decision-making processes differ, they should communicate similar information in a consistent place. Committees will also be expected to publish a report on their process, learnings, and outcomes at the end of the Season. If something is not clearly outlined in this post or the operating manual, committees have decision making authority over their own operations, and may decide to make exceptions for proposers at their discretion  Based on Reflection Period feedback, we are recommending the following compensation structure. This will be paid out of the Governance Fund in $OP. Each of the approved committees will receive a base level of rewards in the amount of $10k equivalent in $OP, to be distributed among committee members. This budget is meant to support 5 committee members, including a committee lead. Since workload is unlikely to be standardized across committees, at the end of the season, an additional $10k equivalent per committee in $OP rewards will be allocated between committees based on relative workload and contribution during the season. Please note that all committee members that receive compensation will need to be KYC’d. KYC information will be collected privately by the Optimism Foundation. Similar compensation discussions in other communities frequently gets heated and becomes unproductive. For this reason, and to avoid unnecessary conflict, the Optimism Foundation will make the final decision on committee compensation for Season 2. If the community feels that this structure is severely off the mark, they can voice that during this Reflection Period, but the Optimism Foundation will override if discussion becomes unproductive or loses civility. Incentives for non-committee delegates is out of scope for Season 2, but something on the roadmap for Season 3.  Open Questions What would the community like to see in the proposal template for the creation of a new committee? → You can provide feedback on the Phase 1 Committee Formation Proposal Template here What is the best way for committees to communicate with each other and with non-committee delegates to maximize transparency? → this is something to be specified in the proposal template What is the best mechanism by which to hold committees accountable at the end of, and during, a season? ",
                    "links": [
                        "https://gov.optimism.io/t/phase-1-committee-formation-proposal-template/3281",
                        "https://gov.optimism.io/t/phase-1-committee-formation-proposal-template/3281",
                        "https://gov.optimism.io/t/committees-next-steps-for-season-2/3436",
                        "https://gov.optimism.io/t/governance-fund-observations/3257",
                        "https://gov.optimism.io/t/draft-s02-committee-proposal-defi/3320/41",
                        "https://gov.optimism.io/t/special-voting-cycle-9a-grants-council/4198",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/9",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/12",
                        "https://gov.optimism.io/t/update-to-committee-operations/3571",
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-otterspace-v2/3583",
                        "https://gov.optimism.io/t/governance-update-3/3232",
                        "https://gov.optimism.io/t/draft-proposal-moving-to-a-grants-council/3945",
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-otterspace/3445",
                        "https://gov.optimism.io/t/draft-s02-committee-proposal-tooling-governance-committee/3333/27",
                        "https://gov.optimism.io/t/draft-s02-committee-proposal-tooling-governance-committee/3333/25",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/5",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/4",
                        "https://gov.optimism.io/t/governance-fund-observations/3257/2",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/2"
                    ],
                    "GPT-summary": "The author of the post is introducing the concept of \"committees\" to reduce delegate overload and purpose mismatch for delegates in the Token House governance process. The post explains the problems committees aim to solve, the proposed structure of committees, and the compensation structure for committee members. The post also includes open questions for feedback from the community.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.487261661559415
                },
                {
                    "author_link": "https://gov.optimism.io/u/timbeiko",
                    "index": "2",
                    "likes": "13",
                    "time": "05/08/2022-20:42:31",
                    "content": "    ben-chain:  Based on comparable roles in other Ethereum ecosystems, our initially suggested compensation for committees is 20,000 USD equivalent per month. Similar compensation discussions in other communities frequently gets heated and becomes unproductive. For this reason, and to avoid unnecessary conflict, the Optimism Foundation will make the final decision on committee compensation for Season 2, and will make it equal for all committees in the season.   This seems reasonable to minimise bikeshedding  ! For clarity, it’s probably worth specifying whether committees are expected to have full discretion over their 20,000 USD monthly budget, and whether this will be paid from the Governance Fund in $OP. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.104166666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/MoneyManDoug",
                    "index": "4",
                    "likes": "6",
                    "time": "05/08/2022-21:54:39",
                    "content": "The best way for committee’s and the community to communicate is likely discord, just keep both channels visible but only allow community typing permissions in the committee commune channel. On the topic of holding committees accountable I think we should hold votes and remove/replace committee members at the end of each cycle if necessary. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "5",
                    "likes": "12",
                    "time": "05/08/2022-22:08:46",
                    "content": "Hey thanks for the post @ben-chain. I have a few questions.  What is a committee supposed to be? Just a guidance for delegates on what they think should be voted for each type of proposal? So that delegates can have an easy way of voting?        ben-chain:  By approving a committee, delegates are entering a social contract to entrust and delegate the bulk of decision-making to the committee.   So if a delegate wants to keep voting on their own they should vote against the committee formations?     ben-chain:  If delegates vote against the recommendation of the committee, they will be expected to post their reasoning in the forum roundup thread.   That sounds like a more reasonable approach. Follow the committee unless you don’t want to for some reason in which case you should definitely explain why.         ben-chain:  our initially suggested compensation for committees is 20,000 USD equivalent per month.   This amount is for the entire committee I suppose? So if a committee has 5 members this would be $4k monthly per member, correct?  For your Open Questions     ben-chain:  What would the community like to see in the proposal template for the creation of a new committee?   It should revolve mainly around the subject of the committee and its definition in as detailed a way as possible. So say tooling, right? What is that? What is tooling in the context of Optimism and this governance forum. Example proposals that would fall under tooling etc. Then a suggestion on amount of committee members and perhaps even proposal for the members themselves. State if the committee would be open for “applications” or if the members would be hand-picked beforehand.     ben-chain:  What is the best way for committees to communicate with each other and with non-committee delegates to maximize transparency?   A publicly viewable but not publicly writable discord channel.     ben-chain:  What is the best mechanism by which to hold committees accountable at the end of, and during, a season?   Discord and forum I guess. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.912748917748917
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "6",
                    "likes": "13",
                    "time": "05/08/2022-22:09:21",
                    "content": " If delegates vote against the recommendation of the committee, they will be expected to post their reasoning in the forum roundup thread.  This was quite important, one thing i would like to add, when providing your reasoning, try to explain by writing few line, focus on “why” part along with what change you will need to see in their next proposal and any recommendation from your side.  What would the community like to see in the proposal template for the creation of a new committee?   I would like to see their past voting record from season 1, i want to see how they have voted and what was their reasoning for voting against or otherwise. Was their a simple yes/no or silent vote or detailed reasoning was provided. Their interest and projects they have been involved with.   What is the best way for committees to communicate with each other and with non-committee delegates to maximize transparency?   A discord channel for initial communication, once a committee is ready with their recommendation, it is mandatory to publish their report on this gov forum.   What is the best mechanism by which to hold committees accountable at the end of, and during, a season?   Now that reward is involved, first things comes to mind is some kind of reward ratio accountability. But, Ben, money is relative, most of us are taking part in this gov are motivated individual, believer is this cyber and decentralized space, we are here because we want to see some tangible change in DAO Gov, we believe in our two pillar gov model and we have a chance to be a part of this change with this DAO experiment by continuous iteration.  So what now ? One thing I like and would love to see is transparency, engagement and empathy from these committees. These committee should engage with the proposal proposer in timely manner, submits a proper recommendation report and document their view and opinion in public forum(committee as a whole and as a individual team member.) Connect these point with some kind of score card/number system and at the end of the season give this as an NFT, consider this a stepping stone of digital gov identity. Take some feedback from Proposal team too, may be from other committee as well. Point is keeping the feedback channel open and focus on iteration. This gov is a 4 year experiment, imagine if we iterate this just for few seasons, we will have an identity, an on-chain verifiable proof of trust. I believe, this identity can go long way and could be a major factor to keep this committee accountable. Ohh and we can also connect this score card with reward in long term. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.742009943181818
                },
                {
                    "author_link": "https://gov.optimism.io/u/polynya",
                    "index": "7",
                    "likes": "14",
                    "time": "06/08/2022-10:24:57",
                    "content": "On one hand, the equal compensation for committees and decided by OF makes sense; on the other the DeFi committee is probably going to end up being overworked and unhappy given the proposal distribution we expect. Perhaps there can be more than one DeFi committee, as DeFi itself is a vast space with sub-genres with their own experts. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.3125
                },
                {
                    "author_link": "https://gov.optimism.io/u/MinimalGravitas",
                    "index": "8",
                    "likes": "8",
                    "time": "06/08/2022-10:48:26",
                    "content": "Lots to take in with this, so apologies in advance if this is a little bit disjointed, just wanted to put some initial thoughts out there. Firstly, if the goal is to reduce delegate workload then having committees seems fantastically well aligned to that! Rather than deep diving into every proposal, those in a committee will only need to go deep into one segment of the proposals, and those not in a committee will have, it seems very little to do. As everyone’s workload is going to be reducing the introduction of compensation seems interesting. Obviously no one would say no to getting paid, but I wonder how necessary it is to set this before we know what the level of workload will be. Thinking about your 3rd question of accountability, might it make more sense to allocate funds to the different teams at the end of the season? I’m thinking in particular that it might be that, for example, the DeFi committee has been going flat out with dozens and dozens of proposals to work through, while the Tooling team had a whole 2 weeks off with nothing that fitted into their specialism for a voting round? Also worth considering is that there might be something of a centralization risk around giving the non-committee members too little to do. If delegates feel like they are effectively just rubber stamping the decisions of the committees then it seems likely we will see a drop off of engagement. If this occurs and we lose participants then next season there will be less people to chose committees from and it could end up ossifying into the same few people deciding everything. I don’t think that solving this is complex however, maybe just ensuring that there is a way for people in other committees (or not in a committee) to contribute to the discussion if they have some insight into a particular proposal. With regards to the communication channels, I quite like the idea of having them here so that they are in the same place as proposals, though I don’t know if it’s possible to create threads which only allow write access for certain people. If no the Discord channels like we have for ‘delegate-discussion’ would probably be fine, I guess that gives the added advantage of ‘threads’ allowing for some level of organization of the conversations. I’ll come back later with thoughts on the committee proposal templates format. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.248767006802721
                },
                {
                    "author_link": "https://gov.optimism.io/u/Prometheus",
                    "index": "9",
                    "likes": "8",
                    "time": "06/08/2022-11:20:04",
                    "content": "    MinimalGravitas:  Also worth considering is that there might be something of a centralization risk around giving the non-committee members too little to do. If delegates feel like they are effectively just rubber stamping the decisions of the committees then it seems likely we will see a drop off of engagement.   Indeed. I’m not inclined to committees because it seems we want decentralization but then we don’t like/want it. I understand the workload issue and why/how something like this can help but I also don’t really get where the issue is.  If a proposal goes into voting without enough support or feedback from the Collective or Committee the end result is the same. Bad proposals from teams/projects that think their proposal is fine will not change much in either case.  I could say more but since I don’t want the responsibility to be a delegate I will move on and keep the rest for myself. Edit: I will just add one note here for people thinking this is the only/best way to solve the workload issue. Why some delegates don’t just create small informal working groups (with people they trust) instead of this formal committees? Informal working groups and even delegates don’t need to be single entities (or just one person) they can be a superset of something else (people/teams/whatever). Team up and change your team as much as you like instead of:     ben-chain:  By approving a committee, delegates are entering a social contract to entrust and delegate the bulk of decision-making to the committee. They are expected to follow the recommendation of committees, except in extreme circumstances   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.2988445378151265
                },
                {
                    "author_link": "https://gov.optimism.io/u/diligit",
                    "index": "10",
                    "likes": "5",
                    "time": "06/08/2022-16:04:20",
                    "content": "I have another proposal instead of committees. Create Focus Group, for DeFi, NFTs & Identity, and Tooling, where all delegates (>0,5%) choose their area of expertise and be included in one of the Focus Group, and thus the delegates work will be segmented and more effective > delegates will focus on proposals where they have more knowledge. Arguments: The committees are made up of 4-5 delegates, 15 delegates in total, and only these delegates will be rewarded. As a result the rest of the delegates and Token House members will not get involved in the process and will move away from Governance. Voting based on the recommendation of the committees (5 people) centralizes the decision making process, and we cannot expect delegates who vote against the committees’ recommendation to post the rationale for this decision because delegates are socially engaged and not obligated. Plus, on discord there are some small conflicts about active, inactive delegates… As a consequence delegates who are not included in committees may vote against just because they do not receive rewards or are not “privileged” to be part of the committee, thus they may compromise the vote for personal reasons. *And without rewards. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.694444444444445
                },
                {
                    "author_link": "https://gov.optimism.io/u/MinimalGravitas",
                    "index": "11",
                    "likes": "2",
                    "time": "07/08/2022-09:57:44",
                    "content": "    diligit:  Create Focus Group, for DeFi, NFTs & Identity, and Tooling, where all delegates (>0,5%) choose their area of expertise and be included in one of the Focus Group, and thus the delegates work will be segmented and more effective > delegates will focus on proposals where they have more knowledge.   I think that one of the advantages of smaller committees is that they can be more efficient at decision making, in a group of 5 people it’s easy to divide up tasks and for members to know their roles. It’s also much easier to schedule meetings if that is desired, and to keep track of progress/accountability. On the other hand, I completely agree that having more opportunities for delegate participation is desirable. I think maybe the answer that serves both of these outcomes is simply to have more parallel committees.     polynya:  Perhaps there can be more than one DeFi committee, as DeFi itself is a vast space with sub-genres with their own experts.   I’m not sure exactly what the categories would be, but this seems like the most sensible option. Just as an example, we could have committees for:  Dex’s and liquidity farms; Lending/borrowing platforms; Futures (Options/Perpetuals etc); Everything else that doesn’t fit into those.  I’d also separate NFTs and Identity, as I think understanding the value proposition for something like Proof of Humanity or BrightID for example is almost entirely unrelated to understanding the value proposition of Bored Ape Yacht Club etc. So in addition to the 4 above, we’d also have commiities for:  NFTs; Identity; Tooling.  That division would mean 7 committees, and while I still think that each of the DeFi groups would probably be busier than the other categories at least the division of labour would be a little less extreme. In terms of engagement, if we stick to the 3-5 person limit, it would mean that up to 35 delegates could have a role, which coincidently works out just about the number of delegates with >0.5% of the vote. At the same time none of the committees would be any larger and so the benefits of small teams would be maintained. If there is going to be a financial reward for participation, then as I suggested yesterday, I think it makes more sense to determine this retroactively when the season ends. For example: if the Dex team have had 5x the number of proposals to review than the Identity team then they probably spent a lot more time and effort reviewing them, and therefore could be rewarded appropriately more. The disadvantage of this is that it doesn’t provide a reliable source of income, but none of the delegates will have yet set themselves up to rely on the financial compensation from participation here and so I don’t really see the harm. On the other hand it could be potentially much more disruptive to experiment with a variable reward in the future if delegates have got used to a regular income. TL:DR: More committees would mean more engagement from delegates, more even distribution of workload and would not sacrifice the benefits of smaller team efficiency. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.6726190476190474
                },
                {
                    "author_link": "https://gov.optimism.io/u/diligit",
                    "index": "12",
                    "likes": "2",
                    "time": "07/08/2022-10:18:17",
                    "content": "I support the creation of the committees, the delegates proposed to segment the work because they were too busy, and only a small number of delegates were actively involved in all the proposals. But I don’t want the consequence to be conflicts between delegates and this to influence the governance process or the vote. But as has been mentioned if committees are created then they will only be for one season, so if there are any negative issues, it will be decided to continue with the committees. If there are conflicts next season we will create the Sociology and Psychology Committee))) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.583333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/MinimalGravitas",
                    "index": "13",
                    "likes": "1",
                    "time": "07/08/2022-10:30:29",
                    "content": "    diligit:  If there are conflicts next season we will create the Sociology and Psychology Committee        diligit:  I support the creation of the committees, the delegates proposed to segment the work because they were too busy, and only a small number of delegates were actively involved in all the proposals.   Yea, absolutely. I assume that part of the reason some delegates were not very active is that they have bigger time commitments to other projects. This might discourage some of the most experienced and knowledgeable people from wanting to commit to a probably very demanding workload from a broad ‘DeFi’ committee, but they might be willing to participate if the requirements for that category of proposal were split out between a larger number of smaller, more specialized teams. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.633955505279035
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "14",
                    "likes": "1",
                    "time": "07/08/2022-11:29:51",
                    "content": " But I don’t want the consequence to be conflicts between delegates and this to influence the governance process or the vote  I didnt quite follow this ? conflict, how ?  If there are conflicts next season we will create the Sociology and Psychology Committee  making puns, straight to jail  That division would mean 7 committees  DeFi committee will obliviously getting more proposal, how about creating two DeFi subcommittee and limit the number of proposal they will review in one cycle ? Its not mandatory to review all of them in one, assign the proposal to DeFi committee on FiFo approach and put a max limit a committee will review in given cycle. This limit will apply to all the committees. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.2875000000000005
                },
                {
                    "author_link": "https://gov.optimism.io/u/Bobbay_StableLab",
                    "index": "15",
                    "likes": "4",
                    "time": "07/08/2022-14:52:48",
                    "content": "The introduction of committees is an ideal way to reduce friction for other delegates to get involved in governance, and I have outlined several thoughts below. Committee communication:  Using discourse to present their reasonings as we have done so in our thread. Discord channel for committee members to discuss (viewable but not writeable for non-committee members)  There shouldn’t be a need for non-committee members to discuss with committee members in a separate channel, as that should be in the forums. Accountability:   Reasonings for each recommendation   Reflection on the previous season; summary, what went well, and what can be improved   Infographic to show their votes for the past season.   We could use health cards similar to gitcoin steward health cards to determine a committee members “health” using Karma as each member should be participating in the forums to make an informed opinion.   This would help delegates identify which committee members are active in the forum. It would help token holders understand which committee members should be replaced in future committees if their participation rate drops. Payment concept: DeFi is the most popular, so they are more likely to be overworked. Maybe it is possible to use a formula to decide payment for each committee retroactively. i.e. $100k and 50 proposals: 30 defi, 10 NFTs, and 10 tooling DeFi is 60% of the total proposals, so it should receive 60% of the total pot allocated to committees. This is an example, but it does mean that these committee members would work without pay until the retroactive payment, which only those in a privileged position can do. This is just an idea, I’m not certain that it is the right way, but I thought I’d put it out there. The proposal template should include the following:  Committee Category Team roles - lead and reviewers Team background Each committee member’s current involvement in Optimism Their vision for optimism grants. (Are they going to be sparing or liberal?)  ",
                    "links": [
                        "https://www.daostewards.xyz/",
                        "https://www.showkarma.xyz/"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.384334415584416
                },
                {
                    "author_link": "https://gov.optimism.io/u/linda",
                    "index": "16",
                    "likes": "5",
                    "time": "08/08/2022-04:36:51",
                    "content": "I’m excited to see experimentation with governance committees. I think managing the workload for delegates and allowing them to focus on areas of specialty for proposal reviews would make for a more positive experience on both sides.     ben-chain:  What would the community like to see in the proposal template for the creation of a new committee?   I like the proposal template that @Bobbay_StableLab suggested plus I would like to see similar information that @OPUser referenced on having committee proposers share their past voting record and rationale for season 1 to see if they were active participants and if they communicated their reasoning for votes.     ben-chain:  What is the best way for committees to communicate with each other and with non-committee delegates to maximize transparency?   Agree with @Bobbay_StableLab. I know there was a comment made in the first governance call on wanting to move away from Discourse forums to Discord entirely but I find it really helpful to at least see rationales for final voting decisions on Discourse forums since reviewing Discord can be chaotic.     ben-chain:  What is the best mechanism by which to hold committees accountable at the end of, and during, a season?   Agree with @Bobbay_StableLab on this again. Additional feedback: Regarding the split of committees into the 3 suggested categories, I echo what a few delegates said that based on Season 1 there was a heavy focus on DeFi so there does not seem to be an equal balance of workload for each committee. Ideally compensation levels for committees would reflect a major difference in workload and/or the DeFi category is further split up to subcommittees. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.819715007215008
                },
                {
                    "author_link": "https://gov.optimism.io/u/fig",
                    "index": "17",
                    "likes": "2",
                    "time": "09/08/2022-17:13:27",
                    "content": "Hey Ben - thanks for thinking about this in a novel way. I enjoy the progressive deployment of different proposal types, forcing governance to stay engaging and fluid. At a glance - it seems to rally like-minded decision-making with similar values… $20,000 feels fair - and is needed to maintain the time and attention of large delegates. We recently wrote a piece on this, conveying the benefit of compensating delegates:  Should DAOs Pay Delegates? One note - the rigidity of the suggested committees makes sense but is limiting. It would be more interesting to see committees aligned on values vs. sectors. Worth discussing more? Will now answer the following questions:     ben-chain:  We’d love to get your feedback on several open questions before drafting a more formal proposal template for use in voting during Cycle #5.  What would the community like to see in the proposal template for the creation of a new committee? What is the best way for committees to communicate with each other and with non-committee delegates to maximize transparency? What is the best mechanism by which to hold committees accountable at the end of, and during, a season?     Decision-making process outlined, previous experience among committee members, and current relationship or role within Optimism.    A model which we have discussed is NFTs for gated communities. Say as a delegate I vote to approve the ‘DeFi Committee’ I can receive an NFT via the address I’ve used on Snapshot. Here committee members can kit up a gated channel, relaying updates on their decision-making process and progress. Additionally, it drives support for committees which create a more tailored / value-add experience.   A compensation model which rewards the best decision-making processes and communication. If a proposal endorsed by the DeFi committee is passed, then give them a multiple or a one-time bonus. This could also be true for committees who relay their rationale consistently, greater than other groups.   Hope this helps inform your thinking - excited to see how this discussion progresses. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.477255271610111
                },
                {
                    "author_link": "https://gov.optimism.io/u/SEED_LATAM_Joxes",
                    "index": "18",
                    "likes": "7",
                    "time": "09/08/2022-19:56:56",
                    "content": "After a review of the proposal in discussion with our community contributors, we believe that the following points should be preserved:   Committees are there to reduce the workload and to try to ensure that the proposals arrive as suitable as possible for discussion and decision by the delegates and the community.   This means that committees should not feel like an intrusive role in which delegates may feel that their responsibilities are being diminished or lose their sense of self.   Committees should not be made up of members who have a greater voting power so as not to discourage participation (let’s say stop at >30%).   So the question is how to insert the role of the committees so that it is as useful as possible and does not disfigure the role of the delegates. For this we have the following procedural vision: First of all, until now and as proposed in the Operating Manual v0.2:  Project made a proposal, then A team post in #gov-temp-check (Discord) to receive feedback from the entire community. Then they post in #proposals:governance-fund-phase-1-proposals in DRAFT mode, receiving more feedback. Change DRAFT to REVIEW to receive more feedback in a formal way. Two delegates with >0.5% voting power approve the proposal for snapshot voting.  In this case, step 2 and 3 looks redundant and certainly the tempcheck # channel today does not fulfill its mission in most cases (for whatever reasons). Precisely we believe that committees can replace or lead this section in which delegates commit to making initial major reviews so that delegates can receive a clean proposal ready for final discussion. With the committee introduction, we propose:  Project made a proposal, then A team post in #gov-commite-check (Discord by example) or another instance in the forum (focused in this initial discussion) to receive feedback from a committee in DRAFT mode. Committee and team work together to make changes and correct execution of the proposal in general. Committee here provides any sort of seal of approval to move to the following instance. Team post in #proposals:governance-fund-phase-1-proposals its proposal in REVIEW mode and committee post inmediately a final balance with recommendations, pros and cons about the proposal. Delegates and community review properly since here. Two delegates with >0.5% voting power approve the proposal for snapshot voting, as well committee members could also give the pass…  In this model review cycle can be reduced from 3 to 2 weeks as committee is working from day one. Please everyone feel free to discuss about if this could be an optimal approach to give range of action to a committee.  About number of committees, we agree that the DeFi category should be divided, for example, into 2 (seems better reach a consensus about splitting subcatterogies) and a kind of cross-audit in case the committees wish to do so. In this case we expect at leats 4 committee and then 20 delegates working (can a delegate be part of 2 topics?)     Bobbay_StableLab:  The proposal template should include the following:  Committee Category Team roles - lead and reviewers Team background Each committee member’s current involvement in Optimism Their vision for optimism grants. (Are they going to be sparing or liberal?)    This is a good approach.  Another question to be clarified, in this case for @ben-chain is about the origin of the funds, provided by the foundation or what part of the allocation, if it would be OP or another asset, and if it were the first case (OP tokens) clarify once again the issue of self-delegation, if it will be well seen or not. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.021735209235209
                },
                {
                    "author_link": "https://gov.optimism.io/u/ScaleWeb3",
                    "index": "19",
                    "likes": "2",
                    "time": "10/08/2022-14:59:39",
                    "content": "Absolutely in favor of committees to reduce overhead & make proposal process more straighforward. Committee categories: We agree with the 3 proposed committees and would categorize proposals in the following way.:  DeFi: Finance, Staking, Liquidity Mining NFT: Creator economy and Games Tech: Infrastructure, Tooling & Public Goods Other: Social, Identity, other apps (likely not needed yet, can be added to other categories for now)  We would NOT split up DeFi as previous proposals did not offer significant differences and it’s important to have 1 committee that is approachable and makes understandable decisions for new proposers. Committee formation & proposal assessments: We see it as necessary that there is some common understanding on how committees are to judge proposals. That will also help to avoid “unfair” assessments when we compare different categories and help other delegates to follow their recommendation or not. (The overall standpoint should be clear but small differences among committees are fine.) In order to not over-engineer this, we’d recommend that interested delegates can simply sign up to one of the proposed committees and each potential committee should meet, form a committee (3-7 people) and share an updated 1-pager detailling  Focus area (e.g. DeFi) Committee Lead + Members (incl. some (Op) background info; no need for spec. roles) Contact Proposal Work Flow Judgement Criteria  To make judgement criteria better understandable, it might be helpful to offer one exemplary, quality proposal with feedback that helps proposers to see the  required detail in proposals required alignment with Optimism required cost-return understanding criteria for assessments  Communication & Accountability:  A private committee channel to discuss processes and all things re proposals openly but internally. Discussing draft proposals published to the forum with proposers openly in a Discord channel that is read-only for others Updating other delegates & community through a simple Committee thread in the forum and “official feedback” below the proposals Concluding cycle with a brief report on assessing proposals & internal processes would be great.  This offers extensive committee discussions AND a public track record for accountability of committees. Utilizing health cards for delegates / committee members as @Bobbay_StableLab suggests is a great idea and could potentially be incorporated to Boardroom which is already working on delegate cards. PS: Our biggest committee interests  DeFi Analytics & DAO tooling Identity, Credentials, SocMedia & other apps Infrastructure & Web 3 projects (Public Goods) (NFTs & Gaming)  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.383499630450849
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "20",
                    "likes": "5",
                    "time": "11/08/2022-16:14:01",
                    "content": "Hey folks! Thanks for all the feedback, the engagement on this thread has been really helpful. We’ve made some updates, summarized below and viewable in their entirety via edit history, to incorporate your feedback:   Each committee must have a committee lead and may have up to 4 reviewers. Committee leads will be responsible for general coordination of the committee and publishing recommendation analyses on behalf of the committee. There is no requirement for all committee members to have >0.5% of votable supply, but at least one member must in order to submit the proposal.   We have updated the cap on the number of committees from 3 to 4 to accommodate the potential creation of two distinct DeFi committees. In the event that two DeFi committees are approved, each committee should handle proposals related to distinct focus areas. If >1 DeFi committee proposal is submitted, each committee should specify an area of specialization so that there would not be a case where two committees are making recommendations on the same proposal. In the event that there is a proposal that does not fall clearly within any of the approved committees, it will be up to the committees to decide which committee will provide a recommendation.   Each of 4 committees will received $10k equivalent in $OP, to be distributed among committee members. This budget is meant to support 5 committee members, including a committee lead. Since workload is unlikely to be standardized across committees, at the end of the season, an additional $40k equivalent in $OP will be allocated between committees based on relative workload and contribution during the season. These $OP rewards will come out of the Governance Fund.   Please note that all committee members that receive compensation will need to be KYC’d.   To address concerns around drop-off in non-committee delegate participation, the Optimism Foundation will track this data and re-evaluate the structure of committees if we see a meaningful decrease.   Committee formation proposals for Season 2 should follow this template and should be posted for feedback 1 week in advance of the start of Voting Cycle #5.   We’re excited to experiment with committees in Season 2 and are excited to see your proposals! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.591796875
                },
                {
                    "author_link": "https://gov.optimism.io/u/MinimalGravitas",
                    "index": "21",
                    "likes": "2",
                    "time": "11/08/2022-17:22:07",
                    "content": "    lavande:  Please note that all committee members that receive compensation will need to be KYC’d   Am I right to assume this just means KYC’d privately to the team, rather than in a public way. Outside of crypto I’ve been involved in some OsInt (Open source Intelligence) investigations around foreign Active Measures campaigns, Cambridge Analytica and some other stuff that means I really try pretty hard not to get ‘doxed’! Happy for the foundation to know my real details, but not if these have to be made publically available. In that has to be the case then if I get into a committee I’ll donate my pay. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.495642006802721
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "23",
                    "likes": "0",
                    "time": "11/08/2022-21:15:53",
                    "content": "yes, KYC will be with OP Foundation as mentioned here.     Phase 1 Committee Formation Proposal Template 🏛 Governance   Phase 1 Committee Formation Proposal Template Hey folks! This thread contains a draft of a new committee formation proposal template. We look forward to hearing your feedback!  *Please comment on the template below. If you have general comments about committees, please contribute to the conversation here.   What are Committees? Committees are an attempt to segment the work of assessing proposals among smaller, focused groups. These committees will primarily perform information filtering and syn…        Phase 1 Committee Formation Proposal Template   committee members that will receive compensation will be required to complete basic KYC with the Optimism Foundation.   I also assume it will be done by OF privately but comment from team could clear the assumption. ",
                    "links": [
                        "https://gov.optimism.io/t/introducing-governance-committees/3238/20",
                        "https://gov.optimism.io/t/phase-1-committee-formation-proposal-template/3281/1"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.512784090909091
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "24",
                    "likes": "1",
                    "time": "11/08/2022-22:55:54",
                    "content": "Will update to indicate KYC will be handled privately by the Foundation! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/MinimalGravitas",
                    "index": "25",
                    "likes": "0",
                    "time": "12/08/2022-07:39:13",
                    "content": "    lavande:  KYC will be handled privately by the Foundation!   Lovely, thanks for confirming. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.166666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/L2Maxi",
                    "index": "26",
                    "likes": "0",
                    "time": "18/08/2022-20:33:51",
                    "content": "I have noticed committee formation proposals have expired i planned on submitting one if thats not possible i am perfectly fine with giving feedback. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.041666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "27",
                    "likes": "2",
                    "time": "19/08/2022-00:09:39",
                    "content": "I recommend you to post it. No one is covering NFTs for example, better to have one late than none ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/L2Maxi",
                    "index": "28",
                    "likes": "0",
                    "time": "20/08/2022-17:44:55",
                    "content": "Any thought about having multiple person on same committee? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/L2Maxi",
                    "index": "29",
                    "likes": "0",
                    "time": "20/08/2022-17:45:34",
                    "content": "thank you i try but not many i know here ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/rasmuky",
                    "index": "30",
                    "likes": "7",
                    "time": "22/08/2022-03:15:04",
                    "content": "I like this framework:     SEED_LATAM_Joxes:  Precisely we believe that committees can replace or lead this section in which delegates commit to making initial major reviews so that delegates can receive a clean proposal ready for final discussion. With the committee introduction, we propose:  Project made a proposal, then A team post in #gov-commite-check (Discord by example) or another instance in the forum (focused in this initial discussion) to receive feedback from a committee in DRAFT mode. Committee and team work together to make changes and correct execution of the proposal in general. Committee here provides any sort of seal of approval to move to the following instance. Team post in #proposals:governance-fund-phase-1-proposals its proposal in REVIEW mode and committee post inmediately a final balance with recommendations, pros and cons about the proposal. Delegates and community review properly since here. Two delegates with >0.5% voting power approve the proposal for snapshot voting, as well committee members could also give the pass…    I like the concept of committees, but I get the sense in this and related threads that a lot of the focus is on tactics of the final recommendation. I’d like to see the committee value proposition center around (i) sector / subsector knowledge, (ii) balanced / objective case for and case against (or pros and cons list), and (iii) shaping the proposal funnel to push proposers to deliver to delegates a well organized, well supported, ready for review and vote proposal. Receipt of a final recommendation is useful, but even a 3 of 5 committee member majority (assuming that is the definition of majority, one committee member one vote) shouldn’t be blindly followed in my view. That is a recommendation based on a very small number of thinkers. I am concerned that delegates will blindly follow committee recommendations and not do the work. This might lead to the illusion of a diverse delegate base (i.e., lots of delegates with smaller $OP holdings, that just vote with committees which may be dominated by whale $OP holders). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.859601449275362
                },
                {
                    "author_link": "https://gov.optimism.io/u/Michael",
                    "index": "31",
                    "likes": "5",
                    "time": "22/08/2022-16:56:42",
                    "content": "Hi all, I may have missed some things but I have a few questions/concerns:   Are potential committees going to be voted on by the token house?   Is there an open process for selecting committee members, or is this all based on a proposal submission? My concern is that these committees may be formed by groups who already know each other and therefore won’t have the diversity of thought required for such an outsized influence.   One suggestion would be to first propose a committee, and then propose members individually instead of having everything as a package deal. For example, I think everyone agrees that there should be a DeFi community but if there is only one or two proposals we might think that there are better members for the committee. How would we vote in that instance? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.236111111111112
                },
                {
                    "author_link": "https://gov.optimism.io/u/Prometheus",
                    "index": "32",
                    "likes": "1",
                    "time": "22/08/2022-17:08:47",
                    "content": "    Michael:  Is there an open process for selecting committee members, or is this all based on a proposal submission?       Introducing Governance Committees 🏛 Governance   Committees Hello community! This post will serve as a discussion thread to solve for one of the biggest challenges faced by the Token House so far. The main idea is to reduce delegate overload by introducing a notion of “committees” which are tasked by the collective to focus on specific subsets of proposals.  If approved, this proposal will remain in effect for one season (~3 months)—think of it as an experiment. This will allow for testing and reflection on whether or not committees are benef…         Phase 1 Committee Formation Proposal Template 🏛 Governance   Phase 1 Committee Formation Proposal Template Hey folks! This thread contains a draft of a new committee formation proposal template. We look forward to hearing your feedback!  *Please comment on the template below. If you have general comments about committees, please contribute to the conversation here.  Thank you for your feedback, we will consider this template finalized (as of 8.18.22) so that teams may move forward with posting draft proposals for feedback.   What are Committees? Committe…     ",
                    "links": [
                        "https://gov.optimism.io/t/phase-1-committee-formation-proposal-template/3281",
                        "https://gov.optimism.io/t/introducing-governance-committees/3238/20"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.405934343434343
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "33",
                    "likes": "4",
                    "time": "22/08/2022-18:31:36",
                    "content": "I agree with the need to ensure groups are aligned more by expertise than by affinity. For what it’s worth, I can attest to the relative (if not perfect) independence of members on two of the three DeFi committee groups proposed. From what I can gather, the Tooling committee is similarly broad in its composition. Although I believe with more participation and formalization in governance we could/should explore this format you’re proposed, I’m personally comfortable with the arrangement we currently have as a first step to evaluate later. The defi group led by Katie Garcia - which has plenty of expertise - has a couple Maker vets, a seasoned defi investor and advisor in Linda Xie, Flipside Crypto, from whom I’ve personally seen some fantastic work, and Stablenode, which has broad governance & defi cred. My sense is that there’s enough diversity in background and interest here as well as deep commitment to best practices to more than ease fears about too tight a perspective. My impression of the proposed tooling committee is that it’s similarly broad in its members’ range of backgrounds. Although the proposed group led by sugma.eth has a few SNX ambassadors in Mastermojo and Matt, the members are in fact coming from several angles. Sugma has worked with a wide range of protocols and I don’t believe has any particular alignment within Optimism. As for me, I didn’t really know anybody before being asked by sugma to join this group, and in fact Solarcurve’s protocol, Beethoven, could in some respects be considered a competitor of Velodrome. This, by the way, ought to offset concerns about potential conflicts of interest. However, one point that’s been raised a few times has been sticking in my head - including experts external to the immediate Optimism community, kind of like board advisors. I think strongly recommending the inclusion of such an outside expert could in one fell swoop limit fears about groupthink as well as conflicts of interest, and it could offer existing committees the ability to address perceived gaps in their expertise. Could also do some member swaps after inking in the groups to ensure broad coverage (eg not multiple ppl from one protocol), though for this iteration I’d almost prioritize easy working relations over strict independence. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.714965986394558
                },
                {
                    "author_link": "https://gov.optimism.io/u/jrocki.eth",
                    "index": "34",
                    "likes": "0",
                    "time": "23/08/2022-03:57:58",
                    "content": "I am in the midst of writing up a proposal for an NFT committee as we speak. Would you you interested? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/Butterbum",
                    "index": "35",
                    "likes": "2",
                    "time": "23/08/2022-10:42:28",
                    "content": "Hey there @jrocki.eth if you have an open spot on the committee I’d love to participate in this experiment. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/jrocki.eth",
                    "index": "36",
                    "likes": "1",
                    "time": "23/08/2022-13:23:42",
                    "content": "Yes! of course! DM me on here or Twitter and we can discuss!  https://twitter.com/Reformed_Normie ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Seyed",
                    "index": "37",
                    "likes": "1",
                    "time": "26/08/2022-06:10:31",
                    "content": "completely agree with the idea ",
                    "links": [
                        "https://gov.optimism.io/t/recap-community-call-6-october-11th/3682"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/Seyed",
                    "index": "38",
                    "likes": "1",
                    "time": "26/08/2022-06:24:36",
                    "content": "oops, i missed last part. just read it. it feels a bit weird that incentives remove for season 2 and sorry to hear that ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.333333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/L2Maxi",
                    "index": "39",
                    "likes": "2",
                    "time": "26/08/2022-16:07:46",
                    "content": "hey thanks for the offer im not very into NFTs so its good i missed this, good luck with your committee! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.09375
                },
                {
                    "author_link": "https://gov.optimism.io/u/hank",
                    "index": "40",
                    "likes": "1",
                    "time": "27/08/2022-03:54:40",
                    "content": "How do we build a system we’re voters are incentivized to do real work and diligence to vote and vote the right, in a decentralized way? The voters should earn tokens from voting and could earn even more if they spend less OP, but still manage to create growth in the ecosystem. This is an example I came up with. Op should have issuance of tokens every month, based on user growth. Set in stone should be that 10% goes to the voters and 90% should be distributed by the voters to build the platform. So if voters, voted on proposals that gives OP more users and growth, the voter will earn more OP tokens. We want to make sure that the voters really care about how they vote. So we should reward the voter for each vote they make and according to the amount of OP tokens they are voting with. If voters only distribute half of OP tokens from that month, the rest will be vested for a year, after that year the system should decide what to do with tokens. If OP network has grown with users and activity the tokens should be released, 90% added to that months natural issuance and 10% should be airdropped to the voters that voted on that months proposals. Voters are rewarded for participance, each vote they make and according to the amount of OP tokens they are voting with. If the Network activity decreased over that period all the vested tokens will be burned. This will make the voter incentivized to vote in what is right for OP because they will gain directly from growing the network as efficiently as possible. The voter can show their commitment to OP by locking their tokens in stake for 1 year, 6 month or 3 month. By locking you will receive more weight in the vote and earn more of the voter reward. This will reward the most committed participant. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.093915343915343
                },
                {
                    "author_link": "https://gov.optimism.io/u/diligit",
                    "index": "42",
                    "likes": "2",
                    "time": "27/08/2022-13:46:07",
                    "content": "*I don’t like the idea, I want everyone to get involved and contribute without direct financial benefit, now the whole ecosystem is incentivized, and I would like to see more people who will get involved and contribute without rewards, at least in governance. Regarding voting and governance, we have delegates doing the hardest part of the governance process, analysing and working on proposals, now we will have committees, so every voting participant will be able to see a constructive analysis from the committees, and it’s just a matter of voting. Also each voter votes on which projects will receive grants that will then be allocated to users, i.e. each voter will be able to get rewards by getting involved in the projects they voted for, and the projects that will distribute rewards. At the moment the circle is complete, impact=profit. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Rods2000",
                    "index": "43",
                    "likes": "0",
                    "time": "27/08/2022-13:58:00",
                    "content": "Not keen on the idea. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Prometheus",
                    "index": "44",
                    "likes": "2",
                    "time": "27/08/2022-14:41:30",
                    "content": "    diligit:  Regarding voting and governance, we have delegates doing the hardest part of the governance process, analysing and working on proposals, now we will have committees, so every voting participant will be able to see a constructive analysis from the committees, and it’s just a matter of voting.   Exactly… “it’s just a matter of voting”. People don’t even need to think anymore. Sad but true. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.583333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/diligit",
                    "index": "45",
                    "likes": "1",
                    "time": "27/08/2022-14:56:42",
                    "content": "Committees help by providing constructive analysis for each proposal, but each person can analyse the proposals and make their own decisions. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Prometheus",
                    "index": "46",
                    "likes": "3",
                    "time": "27/08/2022-15:17:34",
                    "content": "    ben-chain:  Instead, committees will vet, research, and discuss proposals, then make highly visible recommendations to non-committee delegates at the time of voting.   Sure, people can analyse the proposal and vote against the highly visible recommendations but what’s the point? Once a committee gives a positive recommendation it’s done. From there, it’s just a matter of voting. Contrary opinions will get dismissed because who knows better than the committee. Fact is, committees are a central point of failure with influence. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.87900432900433
                },
                {
                    "author_link": "https://gov.optimism.io/u/diligit",
                    "index": "47",
                    "likes": "0",
                    "time": "27/08/2022-16:22:03",
                    "content": "That’s what I said, the committees provide enough analysis for each proposal for everyone to vote without wasting time. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/L2Maxi",
                    "index": "48",
                    "likes": "5",
                    "time": "28/08/2022-02:20:07",
                    "content": "we have 2 people now on two different commitees there needs to be rules for this because it is not smart to have echo chamber ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.732142857142857
                },
                {
                    "author_link": "https://gov.optimism.io/u/diligit",
                    "index": "49",
                    "likes": "1",
                    "time": "28/08/2022-09:35:14",
                    "content": "At the next Reflection Period the position of a delegate in several committees will be re-evaluated. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "50",
                    "likes": "1",
                    "time": "28/08/2022-19:31:07",
                    "content": "This we can definitely discuss in next cycle and open to suggestions. I am also curious about any other suggestions you have improve the overall governance process. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.8125
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "51",
                    "likes": "1",
                    "time": "29/08/2022-13:07:22",
                    "content": "What’s realistically changed from before? Anyone can always weigh in with contrary opinions (including dissenters within committees). On the margin you have some ability for some delegates to direct their focus away from areas they’re less sharp on, and even that lasts only as long as the committees’ reputations remain intact. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.758333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/Prometheus",
                    "index": "52",
                    "likes": "4",
                    "time": "29/08/2022-13:39:56",
                    "content": "    jackanorak:  What’s realistically changed from before?   Mainly this with all the side-effects…     ben-chain:  By approving a committee, delegates are entering a social contract to entrust and delegate the bulk of decision-making to the committee. They are expected to follow the recommendation of committees, except in extreme circumstances   If this doesn’t change anything to you then the answer is nothing changed. Realistically I don’t need to change your opinion nevertheless from my non-delegate perspective this is clearly a governance power shift in the Optimism DAO. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.074999999999999
                },
                {
                    "author_link": "https://gov.optimism.io/u/HuntTheFarmers",
                    "index": "53",
                    "likes": "1",
                    "time": "29/08/2022-17:56:31",
                    "content": "    L2Maxi:  2 people now on two different commitees   Wow. Are they getting paid 2x more than other committee members? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.59375
                },
                {
                    "author_link": "https://gov.optimism.io/u/krzkaczor",
                    "index": "54",
                    "likes": "2",
                    "time": "31/08/2022-08:00:36",
                    "content": "I hope so! They will do twice the amount of work. (@SEED_LATAM_Joxes is part of both the DeFi and Tooling committee). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Sweetu01",
                    "index": "55",
                    "likes": "0",
                    "time": "01/09/2022-09:18:02",
                    "content": "I agree this idea for future groth ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/jrocki.eth",
                    "index": "56",
                    "likes": "1",
                    "time": "01/09/2022-21:59:56",
                    "content": "That is a good point and I actually plan to informally reach out to other community members not on this committee to get their feedback on some proposals because this is a vast landscape and we do not indeed know everything ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.71875
                },
                {
                    "author_link": "https://gov.optimism.io/u/jrocki.eth",
                    "index": "57",
                    "likes": "1",
                    "time": "01/09/2022-22:05:29",
                    "content": "    Michael:  Is there an open process for selecting committee members, or is this all based on a proposal submission? My concern is that these committees may be formed by groups who already know each other and therefore won’t have the diversity of thought required for such an outsized influence.   It is funny that we actually (not on purpose) put the NFT & Gaming committee together this way. That is to say none of us other than fractal and I knew each other before we formed our committee ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.910714285714286
                },
                {
                    "author_link": "https://gov.optimism.io/u/MoneyManDoug",
                    "index": "58",
                    "likes": "2",
                    "time": "04/09/2022-14:59:28",
                    "content": "Should just be delegates holding themselves accountable for this, I think they should have to abstain from pay from one committee if they are on multiple, as they are just leaching money from the second committee they are in. This is especially the case with NFT and tooling as there will likely be few proposals to go over. This is the only way to disincentivize people from joining multiple committees which are supposed to be specialized. Already we have seen committees tainted by centralization and no one sees an issue with that. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.857142857142857
                },
                {
                    "author_link": "https://gov.optimism.io/u/0xTrevor",
                    "index": "59",
                    "likes": "0",
                    "time": "04/09/2022-21:36:40",
                    "content": "Bullish on governance ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/poopster",
                    "index": "60",
                    "likes": "4",
                    "time": "07/09/2022-19:31:52",
                    "content": "    MinimalGravitas:  If there is going to be a financial reward for participation, then as I suggested yesterday, I think it makes more sense to determine this retroactively when the season ends.   Agree, you could also use KPI options for this as well and just set your KPI’s beforehand then not have to worry about paying out ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/Shylsingh73",
                    "index": "61",
                    "likes": "1",
                    "time": "10/09/2022-03:17:43",
                    "content": "Agree to you Poopster, KPI options suits best to give out. The whole community benefits from this . ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "62",
                    "likes": "0",
                    "time": "13/09/2022-19:59:17",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "63",
                    "likes": "0",
                    "time": "13/10/2022-15:28:29",
                    "content": "Based on the community call on 10/11/22, added:  If something is not clearly outlined in this post or the operating manual, committees have decision making authority over their own operations, and may decide to make exceptions for proposers at their discretion  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving additional information on proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.375
                },
                {
                    "author_link": "https://gov.optimism.io/u/brex",
                    "index": "64",
                    "likes": "0",
                    "time": "24/10/2022-09:16:50",
                    "content": "is it possible to have all this info as onepager infographic? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/FantomFunhouse",
                    "index": "65",
                    "likes": "0",
                    "time": "28/10/2022-23:28:10",
                    "content": "Committees make zero sense and should be fully disbanded. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Newt",
                    "index": "66",
                    "likes": "0",
                    "time": "30/10/2022-06:36:34",
                    "content": "The information is very helpful, thank you. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/rmanojc",
                    "index": "67",
                    "likes": "0",
                    "time": "07/12/2022-09:55:55",
                    "content": "Dedicated committee seems to be a great backup in many ways. Not everyone involved pay attention to details or neither participate. The committee concept seems to be a great fit  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 8.125
                },
                {
                    "author_link": "https://gov.optimism.io/u/ebanatik228",
                    "index": "68",
                    "likes": "0",
                    "time": "08/12/2022-12:39:46",
                    "content": "On one hand, the equal compensation for committees and decided by OF makes sense; on the other the DeFi committee is probably going to end up being overworked and unhappy given the proposal distribution we expect.     ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 3.7916666666666665
                },
                {
                    "author_link": "https://gov.optimism.io/u/KARISHA1000",
                    "index": "69",
                    "likes": "0",
                    "time": "08/12/2022-12:41:57",
                    "content": "I have already participated in such a thing, so I have experience, but thanks anyway for such a reminder  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.333333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/wangshiwu0015",
                    "index": "70",
                    "likes": "0",
                    "time": "07/01/2023-16:48:30",
                    "content": "是否有考虑建设一个中文社区呢？ 中文区有大量的高质量用户，只是因为语言的障碍不能高频参与。 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/wanglaoba008",
                    "index": "71",
                    "likes": "0",
                    "time": "08/01/2023-11:36:29",
                    "content": "Nice to meet you all here. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/kyrkoslukrav",
                    "index": "72",
                    "likes": "0",
                    "time": "10/01/2023-03:45:03",
                    "content": "Token house is good to comunity. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/krechohrenb",
                    "index": "73",
                    "likes": "0",
                    "time": "14/01/2023-02:45:03",
                    "content": "Thanks for the post. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/TraderSamzy",
                    "index": "74",
                    "likes": "0",
                    "time": "15/01/2023-03:48:03",
                    "content": "Lets see how this pans out, ill keep watching for sure. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lokomoto",
                    "index": "76",
                    "likes": "1",
                    "time": "17/01/2023-11:37:41",
                    "content": "Phase 1 Committee Formation Proposal Template  check that  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/platko",
                    "index": "77",
                    "likes": "0",
                    "time": "17/01/2023-12:18:41",
                    "content": "    ben-chain:  Committees Hello community! This post will serve as a discussion thread to solve for one of the biggest challenges faced by the Token House so far. The main idea is to reduce delegate overload by introducing a notion of “committees” which are tasked by the collective to focus on specific subsets of proposals. If approved, this proposal will remain in effect for one season (~3 months)—think of it as an experiment. This will allow for testing and reflection on whether or not committees are beneficial to the governance process before making any decisions that are difficult to reverse. Problems to Solve We heard lots of feedback from community members and delegates throughout Season 1. Committees attempt to solve the following problems: 1. Information Overload for Delegates There are currently a lot of proposals to be voted on by Token House delegates. Even for delegates that are very familiar with the context of these proposals and their applications, processing all these proposals is unsustainable. Providing feedback on proposal drafts and engaging on forum posts, while voting on active proposals, is currently an unmanageable workload for many delegates. 2. Purpose Mismatch for Delegates Delegates have different areas of specialty. While the majority of proposals to date have been related to DeFi, some delegates specialize in non-DeFi related topics such as public goods, tooling, and L2 infrastructure. These delegates don’t feel well-equipped to vote on DeFi proposals or aren’t interested in doing so. Why committees should solve these problems This problem may be alleviated by segmenting the work of assessing proposals among smaller, focused groups (”committees”). These committees will primarily perform information filtering and synthesis so that delegates aren’t overloaded with information. Delegates that specialize in a particular topic can defer to the recommendation of relevant committees on topics outside their area of expertise/interest. Introducing committees In Season 2, we will experiment with a new proposal type: committee formation. Committee formation proposals may only be submitted by delegates with >0.5% of voting power and will be accepted only for Voting Cycle #5, requiring submission before 7p GMT on Aug 25 in order to be included in Voting Cycle #5. There is no requirement for all committee members to have >0.5% of votable supply, but at least one member must in order to submit the proposal. Phase 1 committee formation proposals should follow this template and should be posted for feedback 1 week in advance of the start of Voting Cycle #5. This proposal type may be added to the operating manual in Season 3. A maximum of 4 committee formation proposals will be ratified for the duration of Season 2. Up to 4 committee proposals (measured by OP voting “Yes”) will be implemented at the start of Season 2 (with Voting Cycle #6) on Sept 8. If more than 4 committees are proposed, the 4 committees with the most votes will be implemented. Votes will be ranked across all categories. We would like to encourage a diversity of committee types and recommend delegates only vote “yes” for their top 1-2 committees in each category. Committees will operate primarily via social contract and, apart from governance-approved OP rewards for committee participation, will not directly manage tokens. Instead, committees will vet, research, and discuss proposals, then make highly visible recommendations to non-committee delegates at the time of voting. Committee members will receive OP rewards to incentivize this work. By approving a committee, delegates are entering a social contract to entrust and delegate the bulk of decision-making to the committee. They are expected to follow the recommendation of committees, except in extreme circumstances, such as:  undisclosed conflict-of-interest by the committee perceived corruption or self-dealing suspected operational security compromise/committee accounts hacked  Committee members may vote against the recommendation of their own committee, but recommendations should include a list of any dissenting committee members along with their reasoning. Delegates not serving on committees will still be responsible for signing all their own votes. If delegates vote against the recommendation of the committee, they will be expected to post their reasoning in the forum roundup thread. To address concerns about a drop-off in non-committee delegate participation, the Optimism Foundation will track this data and re-evaluate the structure of committees if we see a meaningful decrease. We believe this approach will address the feedback we received in Season 1 in a governance-minimized way, limiting the complexity introduced into voting or proposal processes. The Foundation will continue to handle the administrative work of sending OP to governance-approved grant recipients, as in Season 1. Foundation Recommendations While it’s the Token House’s ultimate decision on what this season’s four committees should specialize in, our initial recommendation is: 2 DeFi committees specializing in different focus areas, NFTs, and Tooling. If 4 committees are not necessary, fewer committees may be approved. We have updated the cap on the number of committees to accommodate the potential creation of two distinct DeFi committees. In the event that two DeFi committees are approved, each committee should handle proposals related to distinct focus areas. If >1 DeFi committee proposal is submitted, each committee should specify an area of specialization so that there would not be a case where two committees are making recommendations on the same proposal. While committees may provide recommendations for proposals that fall outside their domain, only the recommendation of the most directly relevant committee will be surfaced and included on Snapshot. In the event that there is a proposal that does not fall clearly within any of the approved committees, it will be up to the committees to decide which committee will provide a recommendation. These committees will dissolve at the end of Season 2, and the following Reflection Period will allow the Token House to renew existing committees or propose new ones. We put forward the following guidelines for committees:  Each committee must consist of a Committee Lead and up to 4 other Committee Members. Committee Leads will be responsible for general coordination of the committee and publishing recommendation analyses on behalf of the committee. Committees will self-determine how they reach consensus on the recommendations that are put forward to delegates. This process may be different across committees. Committees will be expected to operate transparently by communicating in open channels and sharing information in public forums. Even if decision-making processes differ, they should communicate similar information in a consistent place. Committees will also be expected to publish a report on their process, learnings, and outcomes at the end of the Season. If something is not clearly outlined in this post or the operating manual, committees have decision making authority over their own operations, and may decide to make exceptions for proposers at their discretion  Based on Reflection Period feedback, we are recommending the following compensation structure. This will be paid out of the Governance Fund in $OP. Each of the approved committees will receive a base level of rewards in the amount of $10k equivalent in $OP, to be distributed among committee members. This budget is meant to support 5 committee members, including a committee lead. Since workload is unlikely to be standardized across committees, at the end of the season, an additional $10k equivalent per committee in $OP rewards will be allocated between committees based on relative workload and contribution during the season. Please note that all committee members that receive compensation will need to be KYC’d. KYC information will be collected privately by the Optimism Foundation. Similar compensation discussions in other communities frequently gets heated and becomes unproductive. For this reason, and to avoid unnecessary conflict, the Optimism Foundation will make the final decision on committee compensation for Season 2. If the community feels that this structure is severely off the mark, they can voice that during this Reflection Period, but the Optimism Foundation will override if discussion becomes unproductive or loses civility. Incentives for non-committee delegates is out of scope for Season 2, but something on the roadmap for Season 3. Open Questions What would the community like to see in the proposal template for the creation of a new committee? → You can provide feedback on the Phase 1 Committee Formation Proposal Template here What is the best way for committees to communicate with each other and with non-committee delegates to maximize transparency? → this is something to be specified in the proposal template What is the best mechanism by which to hold committees accountable at the end of, and during, a season?   Hello everyone, did anyone tell me that the Optimism token will be used to pay the commission? it’s true? thanks in advance  @MoneyManDoug ",
                    "links": [
                        "https://gov.optimism.io/t/phase-1-committee-formation-proposal-template/3281"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.506772394272394
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "78",
                    "likes": "0",
                    "time": "19/01/2023-15:38:51",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "193"
}