{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/draft-gf-phase-1-proposal-pairwise-tinder-ux-for-web3-community-signaling/5488",
            "title": "[DRAFT] [GF: Phase 1 Proposal] Pairwise: Tinder UX for web3 community signaling ",
            "index": 5488,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Grants Council"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/Zeptimus",
                    "index": "1",
                    "likes": "2",
                    "time": "07/03/2023-22:05:50",
                    "content": " Project name: Pairwise  Author name and forum name: Zeptimus/ Discord - Zeptimus#3359 / Telegram - @zeptimusq  L2 recipient address: 0xc8d65e1bd67f16522e3117b980e1c9d2caeb9dc3 (generalmagic.eth)  Which Voting Cycle are you applying for?: Cycle 11 - Builders  I confirm that I have read the landing pages for the Builders and Growth Experiments Sub-Committees and that I have determined my proposal is best suited to be reviewed by the Builders Sub-Committee: YES   Project Details  What are you building?: Description Say goodbye to endless forum scrolling and hello to easy, efficient and fun community signaling with Pairwise! Our open-source, snapshot-style voting dapp, based on the big brain algorithm research out of Colony in 2018, offers a fast-paced and intuitive experience, perfect for the next generation of DAOs. Join us in revolutionizing governance with the power of algorithms and give your community a fun way to engage in governance, as opposed to boring old voting. Pairwise makes web3 voting as easy as swiping on Tinder. Compatible with all EVM chains and fully open-source, our project is in active development but needs support! Problem Current voting mechanisms provide poor user experience and require a high cognitive overhead leading to intense voter apathy.  1149×1014 98 KB  As an ecosystem, we expect community members to spend a lot of time reading forum posts and have designed our tooling around this expectation. This will not scale. Solution Pairwise is a novel voting pattern and dapp that makes it easy and fun for web3 communities to signal their preferences. If this project can be well funded, it will enable much greater engagement for web3 communities across the ecosystem. Pairwise aims to make it easier for Web3 communities to signal their preferences and make informed decisions. Pairwise is designed to be user-friendly and intuitive, like a dating app, allowing users to choose between pairs of options to signal their preferences as opposed to having to read endless forum posts and vote within a set time period. The system converts these simple subjective inputs into objective, measurable outputs, minimizing the cost and cognitive burden of voting.  1147×628 305 KB  Pairwise will be implemented as a dapp with its own front end and an open-source backend that can be used in various contexts, such as community governance or project funding with custom front ends. Pairwise voting will be compatible with all Ethereum Virtual Machine (EVM) chains and the development will be fully open source, and will also include documentation for developers who want to use the system in their own projects. The goal of the project is to promote greater community engagement in DAO’s decision-making processes. But not only can Pairwise be used for governance with different snapshot strategies, but Pairwise can also be used to allocate budgets based on community signaling. And that’s just the beginning - we can’t wait to see how the community will discover and utilize all of the potential use cases for this tool. We are confident that this project has the potential to make a significant impact and we look forward to the opportunity to bring Pairwise voting to life with your support. Product Features  Make your own community space Make your own Pairwise votes  Add options Add a question   Extremely simple UX Multichain support  Validation  Testing within the Giveth ecosystem has been very successful with positive feedback  Progress  Video Demo We have a working demo and are doing our initial user testing with the Giveth Community. Check it out!  Why is what you are going to build going to succeed?: Pairwise offers a unique and innovative solution to the problem of low community engagement in governance within the Web3 ecosystem. By providing a fast and intuitive community signaling, similar to using a dating app, Pairwise can make it easier and more enjoyable for users to participate in decision-making processes. To participate in voting, we need algorithms that can easily signal our preferences, much like the way Web2 algorithms recommendation engines work (for Amazon, Netflix etc.). In the future, democratic processes may also evolve to incorporate more intuitive and user-friendly mechanisms for collective decision-making. These mechanisms may be integrated into everyday tasks and workflows, making it easy for individuals to contribute their preferences and opinions without feeling like they are “voting.” We are aleady in talks to use Pairwise with different projects such as Giveth, ENS and RnDAO  Is your project likely to bring new builders to the Optimism ecosystem? If so, please describe how: Pairwise is likely to bring new builders to the Optimism ecosystem in several ways:  Pairwise will gamify actions that the Optimism ecoystem wishes to incentivize. For example,  It can make the process of choosing a delegate on Optimism fun and engaging by allowing users to vote on what Languages and Interests they look for in a delegate, and having he algorithm choose the ideal delegate for them. It can allow users to vote on preferences for the RetroPGF initiative and allow signalling of where to send funds. It can allow users to compare traits within the Optimist NFT ecosystem (once it launches) and build demand. It can signal community preferences for any governance voting (funding proposals or otherwise)   Additionally, by providing an open-source backend that can be used in various contexts, Pairwise may serve as a valuable building block for other developers who are building decentralized applications on the Optimism network and can use tokens from superchain as power mechanisms in Pairwise.   Is your project likely to improve the quality of developers in the Optimism ecosystem? If so, please describe how: We believe that one of the main struggles for developers is bad UX. Pairwise is likely to improve the quality of developers in the Optimism ecosystem by providing an innovative and user-friendly solution to the problem of low community engagement in governance by providing a clean UX for any project that needs community signalling. By having a fun frontend layer for voting, developers can move faster and solve more complex problems, knowing they have buy-in from the community.  Is your project likely to improve the commitment of developers in the Optimism ecosystem? If so, please describe how: Pairwise can improve the commitment of developers in the Optimism ecosystem by providing better signaling of what the community wants. In that way, we think that integrating Pairwise within Optimism will make the community more “sticky” due to the gamified, fun UX of our platform. This improved community engagement can attract more developers to the Optimism ecosystem, as they can be assured that the projects they are building are in line with the community’s needs and wants. Additionally, Pairwise’s open-source backend can serve as a valuable building block for other developers who are building decentralized applications on the Optimism network, leading to more projects and collaborations within the ecosystem, greating a flywheel effect of composability.  Provide us with links to any of the following for the project:  Website:https://pairwise.generalmagic.io/  Twitter: @Generalmagicio  Technical/Economic Documentation:   Do you have any metrics on the project currently? (TVL, transactions, volume, unique addresses, etc. Optimism metrics preferred; please link to public sources such as Dune Analytics, etc.): N/A  Who are your competitors?: Pairwise is similar to Snapshot, but with a specific type of UX. Snapshot votes are built around the expectation that users will go do research in forums and read long-form discussions. Our approach leans into the fact that most community members don’t even going to skim most forum posts and will vote with their gut. The goal is to give a clearer signal of what the community wants through more engagement in fun and simple micro-decisions. Pairwise shouldn’t be used for EVERY decision, but we believe it is an important complement to the current voting applications that exist today.  What differentiates you from your competitors?: At General Magic, we believe in the power of collaboration in the open-source world. That’s why we would be thrilled if Snapshot chose to integrate Pairwise into their platform. Regardless, we are still committed to deploying this feature independently and integrating Snapshot’s (and any other governance tool’s) strategies into our system. We believe that this will benefit the entire governance ecosystem as we work together to create more efficient methods based on algorithms.  Will your project be composable with other projects on Optimism? If so, please explain: Yes, Pairwise is designed to be composable with other projects on Optimism. As an open-source project, Pairwise’s codebase will be available to other developers to use and integrate into their own projects. We truly believe in the OP Stack and Optimism’s Superchain roadmap. We will ensure that Pairwise works seamlessly within the OP stack and integrates across the ecosystem. Pairwise’s modular architecture will also make it easier to integrate with other projects on Optimism. For example, Pairwise could be used in conjunction with a prediction market platform to allow users to signal their preferences and make predictions based on community sentiment, as well as any other use case the community requires.   Team  Who are your founders?: Pairwise is a project built by General Magic with a lot of support from rockstar DAO OGs. @VitorMarthendal is the project lead with design by @markoprljic and @thegrifft  as the product owner. @mathsguy, @kronosapiens, @gichiba @AAbugosh, @ZeptimusQ, and the Giveth community are all supporting the effort as well.  What makes your founders well-positioned to accomplish your goals with this project: We are an already established project, General Magic provides solution services and product development to Impact DAO’s (including Giveth, the Commons Stack, the Token Enginnering Commons and ENS). We support commons-based organizations and public good projects. We build digital products, governance tools, and economic systems, General Magic has a proven track record and high success rate. Our team of designers, developers, system architects, researchers, writers, and seasoned Web3 professionals have the knowledge and insights to support the ever growing demands of Impact DAOs — both by integrating with existing teams and creating resources from scratch.  Is this your first Web3 project?: No  I understand that Builders grants are subject to a 1 year lock-up, as explained further in this post : YES  Is your project funded? The algorithm research was conducted by Colony in 2018 and they granted General Magic with 10k to kickstart development efforts to build a minimum loveable product, which is now available. In addition, we were awarded 1 ETH by ENS small grants. We recognize that our project has the potential to benefit the entire ecosystem, so we are actively seeking additional funding to bring a full-fledged product to market. This grant would help us achieve that goal and ensure maximal optimization for the Optimism ecosystem.   Grant Request  What is the size of the grant request? 31,250 OP  How do you justify the size of the grant? This grant will be retroactively funding Pairwise and we are already developing it seeking funding from different sources such as Aragon, Meebits, Nouns and more! Any extra funds from the budget will be used to improve the UX/UI and consider new desirable features for Pairwise Milestone 1: Platform development and implementation, including the improvement of the pairwise algorithm and interfaces for creating spaces, votes (with allowlists) and projects. Closed beta (20k OP)   Interface for creating spaces, votes and projects.   Interface for voting through allowlists.   Interface for viewing pairwise rankings.   Milestone 2: Addition of weighted votes and integration with Snapshot strategies (10K OP)   Addition to add snapshot strategies to allow voters in addition to the allowlist.   Addition of weighted votes based on snapshot strategies.   Support for multiple snapshot strategies composed in the same pairwise vote.   Milestone 3: Integration with decentralized storage solutions and ENS (10k OP)   Storage of pairwise results on decentralized storage solution   Generation of decentralized proof of votes (through IPFSn Ceramic or Arweave)   Creation and verification of spaces through ENS domains   Milestone 4: Creation of a voting incentive mechanism (7.5k OP)   Mechanism for budgeting voting incentives along with pairwise distributions   Anti-sybil voting mechanism   Milestone 5: Enhancing voting interfaces (15k OP) 1)Creation of new voting interfaces besides pairwise voting (such as list selection and ongoing updated voting).  Implementation of voting interfaces as modules, making it possible to use different voting interfaces for the same voting session    Roadmap      Project Milestone Type Milestone Source of Truth Deadline     Pairwise Critical Platform development and implementation Codebase 6 weeks   Pairwise Critical Addition of weighted votes and integration with Snapshot Codebase 6 weeks   Pairwise Critical Integration with decentralized storage solutions and ENS Codebase 12 weeks   Pairwise Critical Creating a mechanism for incentivizing voting Codebase 8 weeks   Pairwise Critical Enhancing voting interfaces Codebase 10 weeks   Pairwise Benchmark Pairwise adoption 5 DAOs EOY   Pairwise Benchmark Pairwise optimism implementation for community signaling Developers know what to build next EOY     Please provide any additional information that will facilitate accountability:(smart contracts addresses relevant to the proposal, relevant organizational wallet addresses, etc.) N/A  Does your plan depend on the receipt of OP tokens?: Our plan does not entirely depend on the receipt of OP tokens, acquiring them would significantly expedite and allow us to concentrate on expanding the OP and providing support for the OP developer community.  What is your plan for the use of the OP token after the 1 year lock-up?: We plan to sell and retroactively fund the project and utilize the OP tokens as efficiently and effectively as possible to further our goals of building out Optimism developments and support. We believe that our project will not only benefit from the OP token, but also contribute to its long-term success.  Please provide benchmark milestones for this project. These milestones should guide the Optimism community on the progress of your project during the 1-year lock-up period.  Integrate pairwise in 5 DAOs on Optimism including the Optimism community Use pairwise on optimism for community signaling and use it for development and governance   Please define critical milestones for this project. Critical milestones are meant to show good-faith efforts to accomplish the project. Non-completion of these milestones could lead to revocation of remaining grant rewards.  Milestone 1: Platform development and implementation, including the improvement of the pairwise algorithm and interfaces for creating spaces, votes (with allowlists) and projects. Closed beta Milestone 2: Addition of weighted votes and integration with Snapshot strategies Milestone 3: Integration with decentralized storage solutions and ENS Milestone 4: Creation of a voting incentive mechanism Milestone 5: Enhancing voting interfaces    Optimism Relationship  Does your project solve a problem for the Optimism ecosystem?: The Web3 ecosystem currently lacks a reliable way to gather community input and feedback, leaving it to a minority group to make important decisions without a complete understanding of what the community truly wants and needs. This can result in suboptimal decisions that may not align with the interests of the community. Our project aims to solve this problem by providing a platform for community signaling through pairwise comparisons, which is super easy and fun. With the outputs of this data,this group of experts can make informed decisions that align with the desires of the community, ultimately leading to a more engaged and committed developer ecosystem. By supporting Pairwise, you’ll not only be addressing a critical issue, but you’ll also be helping to ensure the long-term success of Optimism.  How does your proposal offer a value proposition solving the above problem?: Pairwise is a unique tool that has the potential to significantly improve the commitment of developers in the Optimism ecosystem by providing a platform for community signaling and feedback through pairwise comparisons. By enabling community members to voice their preferences in an easy, fun, and intuitive way, Pairwise will empower developers to build applications that are aligned with the community’s interests and needs. With the data generated by Pairwise, the Optimism community can make informed decisions that reflect the desires of the majority. This can lead to greater trust and participation in the decision-making processes, resulting in a more engaged and committed developer ecosystem. But that’s not all Pairwise has a long list of other use cases. For example, it can be used for fun and engaging activities within the community such as “Is your Optimism NFT hot or not?” and “Which one is the hottest?” With Pairwise, holders can decide in a fun and engaging way, simply by clicking their favorite option.  1600×820 135 KB   Why will this solution be a source of growth for the Optimism ecosystem?: Pairwise can be a valuable source of growth for the Optimism ecosystem for several reasons.  By providing an easy and fun way for the community to signal their preferences, Pairwise can encourage more people to get involved and have a say in the direction of the ecosystem. Pairwise can help identify and prioritize the most important and relevant features and developments for the ecosystem. By collecting and analyzing data on the community’s preferences, the Optimism team can make more informed decisions on which features to prioritize and which developments to focus on, ultimately leading to a more efficient and effective use of resources. Pairwise can be a valuable tool for allocating resources and funding to projects within the ecosystem. By enabling the community to signal their preferences on which projects to fund and which initiatives to support, Pairwise can help ensure that the most promising and impactful projects receive the necessary funding and resources to succeed.   How committed are you (and your team) to building on Optimism?: General Magic is very committed to building on Optimism and are excited about the vision of the Superchain. We believe that Optimism is one of the most promising Layer 2 solutions for Ethereum, and we are excited about the potential it offers for scaling and improving the overall user experience of decentralized applications. We have already invested significant time and resources into building out our demo, and we are eager to continue developing on the platform. We believe that the potential for Pairwise on Optimism is significant, and we are committed to leveraging this potential to bring value to the Optimism ecosystem  Is your project Optimism Native?: No   Confirmations  I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: YES  I understand that I will be expected to following the public grant reporting requirements outlined here: YES ",
                    "links": [
                        "https://foul-porch-0eb.notion.site/Builders-Sub-Committee-02ba9da5b4534fbf955e6e4c8fcf1aa3",
                        "https://foul-porch-0eb.notion.site/Growth-Experiments-Sub-Committee-270d2f75ff0f410a869b2ba6a8324006",
                        "https://blog.colony.io/introducing-budgetbox/",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/f/f4c01921888a77d499a8bc25e43f5a163edd4e8a.png",
                        "https://pairwise.generalmagic.io/",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/3/3d4a0e0f696eba257ff2a3a64145883c31f09c08.png",
                        "https://pairwise.generalmagic.io/",
                        "https://www.youtube.com/watch?v=KIn0jQZlLFQ",
                        "https://pairwise.generalmagic.io/",
                        "https://twitter.com/Generalmagicio",
                        "https://generalmagic.io/",
                        "https://twitter.com/VitorMarthendal",
                        "https://twitter.com/markoprljic",
                        "https://twitter.com/thegrifft",
                        "https://twitter.com/mathsguy",
                        "https://twitter.com/kronosapiens",
                        "https://twitter.com/gichiba",
                        "https://twitter.com/aabugosh",
                        "https://twitter.com/zeptimusQ",
                        "https://gov.optimism.io/t/grant-token-lock-explainer/5060",
                        "https://colony.io/",
                        "https://pairwise.generalmagic.io/",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/9/90b6226c342f45086b50ee4ca05ffe4024c5bf19.jpeg",
                        "https://gov.optimism.io/t/suggested-public-reporting-requirements-for-grantees/4176"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.936632349132349
                },
                {
                    "author_link": "https://gov.optimism.io/u/Vegayp",
                    "index": "2",
                    "likes": "1",
                    "time": "08/03/2023-09:58:29",
                    "content": "love to see you guys here! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.125
                },
                {
                    "author_link": "https://gov.optimism.io/u/FractalVisions",
                    "index": "3",
                    "likes": "1",
                    "time": "08/03/2023-14:15:45",
                    "content": "I’m really excited about this app. It was fun to read and the tinder line was total click bait that should bring attention to the grant proposal. Would you be able to add multiple proposals to one vote/abstain for a batch function to save time for larger groups or high volumes of proposals to review? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.953571428571428
                },
                {
                    "author_link": "https://gov.optimism.io/u/Zeptimus",
                    "index": "4",
                    "likes": "1",
                    "time": "13/03/2023-13:44:00",
                    "content": "Great question! Yes, you can add multiple proposals to one vote/abstain for a batch function to save time for larger groups or high volumes of proposals to review. The beauty of Pairwise is that the community feeds the algorithm with micro-decisions, which informs decision-makers what the community is signaling. The governance process will be up to every organization, but we want to make it as efficient and user-friendly as possible. Thanks for your excitement about Pairwise! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.174999999999999
                }
            ]
        }
    ],
    "group_index": "575"
}