{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/goverment-forum/2720",
            "title": "Goverment forum ",
            "index": 2720,
            "category": [],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/hank",
                    "index": "1",
                    "likes": "1",
                    "time": "18/06/2022-19:04:54",
                    "content": "The goal of the forum should be to bring out the ideas from the people of OP and realize them. How do we do this in the most optimal way? If we organize the proposals in one category “proposals”. The most liked posts, lets say top 5 every week, just as an example, goes out to be voted on in snapshot. The top 5 people in forum that produces the most proposals to reach the stage of snapshot, will be rewarded the a title and OP tokens. Every week a person reaching such a title can also lose it if a new top 5 appears. My next idea is that i think the OP token should be staked for a vote token that you get proportional to how long you stake. Lets say you have 3 stake levels 1 year 100% voting power 6 months 50% and 3 months 25%. If you do not want to stake you get 10% voting power. Staking should also give you reward in OP token the reward is proportional to your total voting power and the engagement in the voting process. Next idea is to bring value to the token. For example to support OP every protocol on OP can pay a minimum fee to OP. That fee should be used to buy OP tokens from the market and burn them. This will increase the market for OP tokens and increase the value of the token if the protocols on OP is used more. Best wishes Hank ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.7287878787878785
                },
                {
                    "author_link": "https://gov.optimism.io/u/hank",
                    "index": "2",
                    "likes": "0",
                    "time": "19/06/2022-19:17:53",
                    "content": "We wand engagement ment in the voting  process but don’t  want people to randomly vote on things just to maximize there’s  staking rewards. So connected to the vote should be a prose and a con side and before you cast you vote you should prove with correct answers that you understand the natur of the vote before you vote on the mater. You should also have the right to delegate your vote if you would like. And the deligate willl earn some of the staking rewards of the staker. With this system we have incentive for both the proposal maker and for the voters. A system creating engagement on both sides. And the a token optimized for governance and building the layer 2 even stronger. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.4642857142857135
                },
                {
                    "author_link": "https://gov.optimism.io/u/hank",
                    "index": "3",
                    "likes": "0",
                    "time": "24/06/2022-20:15:31",
                    "content": "We need to incentivize voters to vote on what is best for OPs growth. If we vote on the wrong things we will lose our platform a stronger one. Op should have issuance of tokens every-month based on user-growth  and set in stone should be that 10% goes to the voters and 90% should be distributed by the voters to build the platform. So if a voters “vote” gives OP more users the voter will earn more OP tokens. We want to make sure  that the voters really care about how they vote. So we should reward the voter for each vote they make and according to the amount of OP tokens they are voting with. If voters only vote yes on a few proposals the rest of OP tokens from that month will be vested a year, after that year the system should decide what to do with tokens. If OP network has grown with activity the tokens should be released 90% to that months  issuance and 10% should be airdropped to the voters that voted on that months proposals  rewarded for each vote they make and according to the amount of OP tokens they are voting with.  If the Network activity decreased over that period all the vested tokens will be burned. This will make the voter incentivized to vote in what is right for OP because the will gain directly from growing the network as cheaply as possible. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.8273809523809526
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "4",
                    "likes": "0",
                    "time": "13/09/2022-19:18:40",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "99"
}