{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/airdrop-ethereum-validators-beacon-chain-contract-depositors/134",
            "title": "Airdrop Ethereum Validators (Beacon Chain Contract Depositors) ",
            "index": 134,
            "category": [],
            "tags": [
                "airdrop"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/GLCstaked",
                    "index": "1",
                    "likes": "37",
                    "time": "28/04/2022-14:40:18",
                    "content": "Addresses that deposited to Beacon Chain Contract ( ETH validators ) should be included in further distributions I think this deserves its own thread so I created one as I think it will get buried under the airdrop #1 feedback purpose of this thread is to gauge interest and discuss before a governance proposal can be made. not to criticize airdrop #1, instead look forward and support rewarding beacon chain depositors in subsequent community distributions Why Beacon Chain depositors These actors have proven • 𝐥𝐨𝐧𝐠 𝐭𝐞𝐫𝐦 𝐚𝐥𝐢𝐠𝐧𝐦𝐞𝐧𝐭 𝐰𝐢𝐭𝐡 𝐄𝐭𝐡𝐞𝐫𝐞𝐮𝐦, 𝐞𝐬𝐩𝐞𝐜𝐢𝐚𝐥𝐥𝐲 𝐩𝐫𝐞-𝐦𝐞𝐫𝐠𝐞 • 𝐚𝐩𝐭𝐢𝐭𝐮𝐝𝐞 𝐭𝐨 𝐫𝐮𝐧 𝐧𝐨𝐝𝐞𝐬 /𝐬𝐞𝐫𝐯𝐢𝐜𝐞 𝐭𝐡𝐞 𝐧𝐞𝐭𝐰𝐨𝐫𝐤 • 𝐑𝐞𝐚𝐥 𝐫𝐞𝐬𝐨𝐮𝐫𝐜𝐞𝐬 𝐬𝐩𝐞𝐧𝐭 𝐭𝐨 𝐬𝐞𝐜𝐮𝐫𝐞 𝐭𝐡𝐞 𝐧𝐞𝐭𝐰𝐨𝐫𝐤, 𝐭𝐡𝐢𝐬 𝐜𝐚𝐧𝐧𝐨𝐭 𝐛𝐞 𝐒𝐲𝐛𝐢𝐥 𝐚𝐭𝐭𝐚𝐜𝐤𝐞𝐝 If OP plays a role in decentralisation of the sequencer then this makes even more sense, existing validators are most likely to run nodes for optimism. every validator I’ve spoken too, has expressed interest to run nodes on L2. Every airdrop eligibility criteria I have seen in this space can be gamed, but addresses in this set must have committed a non-trivial amount of capital until the merge, must be confident in the Ethereum communities’ ability to execute its roadmap and be positioned for long term success. must provide physical infrastructure or pay for it to keep the validator active on the Network, this must be persistent which incurs electricity costs, hardware costs, internet provider costs and time/effort for maintenance.   twitter.com    GLCstaked @GLCstaked  1) @optimismPBC Launched a Token, many of us predicted and prepared for this @BanklessHQ newsletter.banklesshq.com/p/how-to-get-r… Others are coming 𝐳𝐤𝐒𝐲𝐧𝐜, 𝐀𝐫𝐛𝐢𝐭𝐫𝐮𝐦, 𝐒𝐭𝐚𝐫𝐤𝐍𝐞𝐭 (@zksync @arbitrum @StarkWareLtd) what can you do now to prepare for an ‘airdrop’?   6:26 PM - 27 Apr 2022           7                2              twitter.com    boodle.eth 🐼 @0xboodle  #ETH2 Beacon Chain validators are the *perfect* #airdrop recipients for #L2 tokens, especially for a protocol that is looking to decentralize its sequencer or run a node @optimismPBC@arbitrum@zksync@StarkWareLtd  Am I biased in this thinking? yes, but it is true nonetheless👇   5:20 AM - 28 Apr 2022           13                2               reddit    r/ethfinance - Beacon Chain validators should be included in L2 airdrops 150 votes and 71 comments so far on Reddit      ",
                    "links": [
                        "https://twitter.com/GLCstaked/status/1519382570244390912",
                        "https://twitter.com/GLCstaked/status/1519382570244390912",
                        "https://twitter.com/optimismPBC",
                        "https://twitter.com/BanklessHQ",
                        "https://newsletter.banklesshq.com/p/how-to-get-ready-for-l2-tokens?s=r",
                        "https://twitter.com/arbitrum",
                        "https://twitter.com/StarkWareLtd",
                        "https://twitter.com/GLCstaked/status/1519382570244390912",
                        "https://twitter.com/0xboodle/status/1519547061036670979",
                        "https://twitter.com/0xboodle/status/1519547061036670979",
                        "https://twitter.com/0xboodle/status/1519547061036670979",
                        "https://twitter.com/search?q=%23ETH2",
                        "https://twitter.com/search?q=%23airdrop",
                        "https://twitter.com/search?q=%23L2",
                        "https://twitter.com/optimismPBC",
                        "https://twitter.com/arbitrum",
                        "https://twitter.com/zksync",
                        "https://twitter.com/StarkWareLtd",
                        "https://twitter.com/0xboodle/status/1519547061036670979",
                        "https://www.reddit.com/r/ethfinance/comments/udbwlm/beacon_chain_validators_should_be_included_in_l2/",
                        "https://www.reddit.com/r/ethfinance/comments/udbwlm/beacon_chain_validators_should_be_included_in_l2/",
                        "https://gov.optimism.io/t/draft-airdrop-2-proposal-ethereum-validator-node-operators/2962",
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-raptor/2547/41",
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-raptor/2547/39"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.372549019607843
                },
                {
                    "author_link": "https://gov.optimism.io/u/boodle",
                    "index": "2",
                    "likes": "18",
                    "time": "28/04/2022-21:24:27",
                    "content": "Yes! Thank you for posting this. The only thing that I would add are a few items to ward off the obvious criticisms. 1 - I think that testnet validators should be included here as best is possible. We don’t want the aesthetic that airdrops are only going to folks who already have at least 32 ETH. 2 - Exchanges (e.g. Coinbase, Kraken, Binance) and semi-centralized stake-as-a-service providers (e.g. Lido Finance) should be removed from consideration here. I think that it would be easy to filter depositing addresses (e.g. see pools.invis.cloud for a list of staking pools) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.583333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/kevster.eth",
                    "index": "3",
                    "likes": "14",
                    "time": "28/04/2022-21:35:02",
                    "content": "Wow, that’s actually a really good idea. However I do agree with Boodle that it might be problematic if the staking services also get these airdrops. Would nice to exclude or limit them somehow. Maybe airdropping a fixed amount to anyone running 1 or more validators is an option? That way it doesn’t matter if you run 1 or 1000 validators on your node. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/boodle",
                    "index": "4",
                    "likes": "5",
                    "time": "28/04/2022-22:09:54",
                    "content": "Yes, I agree that it would be a single flag for yes/no, would not depend on the number of deposits made. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.642857142857143
                },
                {
                    "author_link": "https://gov.optimism.io/u/GLCstaked",
                    "index": "5",
                    "likes": "11",
                    "time": "29/04/2022-14:40:02",
                    "content": "Good points Determining solo stakers : I agree that exchanges and LIDO should be excluded from distribution for the sake of decentralisation (these addresses are known and easy to implement) If controversial to completely exclude LIDO then there should be a decay of heavy penalty, at the end of the day they have provided a useful service to the network. In my opinion this should target solo stakers only, those providing and maintaining the resources backing the deposit @smartcontracts brought up an interesting concept of rewarding minority clients, I’m not sure how to match clients to address, if possible, maybe a bonus for using a non-majority client? High barrier to entry : Majority of Ethereum validators are early supporters of the ecosystem who have benefited from capital appreciation for that early support and risk. Rocketpool does reduce the barrier to almost half to join the beacon chain and validate. But maybe we should consider Gnosis chain validators, an Ethereum aligned sidechain with the same codebase and much lower staking requirement to solo validate 1GNO. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.890196078431373
                },
                {
                    "author_link": "https://gov.optimism.io/u/CryptoGnut",
                    "index": "6",
                    "likes": "6",
                    "time": "29/04/2022-17:14:34",
                    "content": "This is an opportunity to incentivize decentralized staking for the good of the entire ecosystem.  Incentive more people to actively stake their ETH in their own validator rather than passively through centralized providers. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.666666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/MinimalGravitas",
                    "index": "7",
                    "likes": "7",
                    "time": "29/04/2022-21:50:39",
                    "content": "That would fit with how the rest of the airdrop was distributed. It didn’t matter how many times you had donated to Gitcoin grants rounds, so it shouldn’t matter if you run 1 or 20 validators on the same machine. I would suggest RocketPool MiniPools should be included under the flag as well, as they provide the opportunity (via rETH) for small holders to stake without contributing to the centralization risk of Lido and CExs, however for full disclosure… I run one so might just be biased. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/kevster.eth",
                    "index": "8",
                    "likes": "5",
                    "time": "30/04/2022-10:33:14",
                    "content": "Something else that came to mind when thinking about this is that people who are running validators today, might also be the people who are interested in running nodes for Optimism in the future. If the OP token is somehow connected to decentralising the sequencer, then airdropping OP tokens to stakers might increase the participation in the future. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.416666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/GLCstaked",
                    "index": "9",
                    "likes": "5",
                    "time": "30/04/2022-12:21:02",
                    "content": "I run via rocketpool as well, The node account which handles the RPL rewards and ETH fees is just a standard address that RPL node operators are in full control off, which would be included in the Beacon Chain Contract deposit list. On Bias, I already got a generous allocation from Optimism, however if I’m truthful I absolutely gamed this, and know many of my peers did the same. the reason I’m advocating for validators is because it can’t be gamed, nobody is spinning up validators to speculate on airdrops and if they did they can’t do it without locking up capital and providing useful resources to the Ethereum network. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.321428571428571
                },
                {
                    "author_link": "https://gov.optimism.io/u/GLCstaked",
                    "index": "10",
                    "likes": "8",
                    "time": "30/04/2022-12:21:43",
                    "content": "100%, this is one of my main arguments for my position, I go into this on Ethereum Layer 2 Tokens — GLCstaked I’m part of a few groups that focus on node operation, the type of market participant here are developers, network engineers, more technical people who don’t care much for trading. Most are running ETH & Gnosis Chain, everyone is interested in running L2 nodes. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.011904761904762
                },
                {
                    "author_link": "https://gov.optimism.io/u/fornax",
                    "index": "11",
                    "likes": "9",
                    "time": "02/05/2022-02:13:57",
                    "content": "100% agree. I can’t think of a class of users that is more aligned with the future of the Ethereum ecosystem than validators, as they locked their assets not knowing for how long. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/Juanbug",
                    "index": "12",
                    "likes": "3",
                    "time": "03/05/2022-20:21:57",
                    "content": "I agree with this. However, not sure if Staking services should receive the airdrop ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/watchitexplode",
                    "index": "13",
                    "likes": "1",
                    "time": "03/05/2022-23:00:47",
                    "content": "If exchanges, Lido, etc. get the airdrop, wouldn’t their staking customers demand their share of the airdrop? Unless the majority of their staked ETH does not belong to customers, idk. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/kevster.eth",
                    "index": "14",
                    "likes": "3",
                    "time": "04/05/2022-12:01:24",
                    "content": "If the airdrop is the same for one validator vs 1000 validators, Lido will only get 21 airdrops for all the millions of ETH they stake. That’s basically ignorable for the end users ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/MinimalGravitas",
                    "index": "15",
                    "likes": "3",
                    "time": "07/05/2022-09:03:59",
                    "content": " Lido will only get 21 airdrops for all the millions of ETH they stake.  That sounds like a good outcome to be honest. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.166666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/MinimalGravitas",
                    "index": "16",
                    "likes": "3",
                    "time": "07/05/2022-09:37:40",
                    "content": "    GLCstaked:  nobody is spinning up validators to speculate on airdrops and if they did they can’t do it without locking up capital and providing useful resources to the Ethereum network.   Surely encouraging people to do this fits precisely with how the airdrop and Ethereum’s Phoenix are supposed to work. What better public good to incentivize for the ecosystem than getting more people to stake themselves (whether with a minipool or solo staking). With that in mind maybe this would be better for an airdrop nearer to when withdrawals are enabled for validators on the Beacon Chain, with the plan to issue some rewards on the same basis in the future. That way people who are currently using CEXs/Lido to stake would see home stakers be rewarded and be able to withdraw their funds from centralized services, set up their own validator and expect a future airdrop for doing so as a way to overcome the friction of effort it entails. EDIT - … but I don’t have any idea how many people with >16 or greater than >32 ether use centralized services and would therefore be targets for this. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.71875
                },
                {
                    "author_link": "https://gov.optimism.io/u/ajdarvv",
                    "index": "17",
                    "likes": "2",
                    "time": "07/05/2022-17:51:18",
                    "content": "I think perhaps a good way to reward Ethereum validators would be to use that as a bonus criteria multiplier in a future airdrop? So that we can determine that they are active on L2s and optimism in particular, then they can have an extra x amount of OP tokens? Rather than make being a validator a single criteria as a lot of people view that as someone who’s extremely wealthy in crypto already and it would maybe hurt the narrative of Optimism? Just a thought ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.829931972789115
                },
                {
                    "author_link": "https://gov.optimism.io/u/0ximistic",
                    "index": "18",
                    "likes": "1",
                    "time": "08/05/2022-10:30:27",
                    "content": "If the staking services such as Lido, Rocketpool etc commit to re-distribution among their depositors, we could let them receive the airdrop. That way, the 32ETH aesthetics problem flagged by @boodle is taken care of with also the smaller ETH2 stakers get their share. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Exosphere",
                    "index": "19",
                    "likes": "6",
                    "time": "08/05/2022-21:11:26",
                    "content": "Let’s be honest: some beacon chain node operators weren’t altruistic in locking up their ETH… they we trying to get some of that 8%+ staking yield that was available early on. But given that the merge has been continuously delayed and yield rates have dropped significantly, many of them are probably feeling some “pain” at this point and would be grateful for an OP relief package . And well deserving, considering they are providing the backbone to the PoS chain. Running the numbers on how much OP would be available to each of the 371,030 validators: Genesis token count is 4,294,967,296 OP, of which 14% (601,295,421) is still available to airdrops. If we allocation 10% of that (60,129,542) to retroactive beacon chain validators, that’s only 162 OP tokens per validator. Granted, some of those would be excluded if they are part of staking pools, but even with 50% cut out, that’s still “only” 324 OP tokens per validator. Maybe that’s fine, but definitely some food for thought. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.506944444444445
                },
                {
                    "author_link": "https://gov.optimism.io/u/MinimalGravitas",
                    "index": "20",
                    "likes": "4",
                    "time": "08/05/2022-21:22:21",
                    "content": " only” 324 OP tokens per validator.  That’s about the amount you got from Airdrop 1 for having been ‘priced out of Ethereum’ or voted in DAO governance previously, so seems a reasonable order of magnitude. It’s also worth bearing in mind that if the airdrop goes to nodes rather than validators (so you wouldn’t get 2x for running 2 validators on the same machine) then the number of recipients would be much lower, so much less of the airdroppable OP would be needed for this. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.261904761904762
                },
                {
                    "author_link": "https://gov.optimism.io/u/Exosphere",
                    "index": "22",
                    "likes": "6",
                    "time": "08/05/2022-21:31:01",
                    "content": "    MinimalGravitas:  It’s also worth bearing in mind that if the airdrop goes to nodes rather than validators (so you wouldn’t get 2x for running 2 validators on the same machine) then the number of recipients would be much lower, so much less of the airdroppable OP would be needed for this.   Good point about the reduced number of recipients; if we count operators instead of validators that decreases the number of recipients significantly and bumps of the airdrop amount even more. I just wanted to get us talking about some specific numbers to validate that this even makes sense, and it appears there’s a road to do so. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.192708333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "23",
                    "likes": "3",
                    "time": "10/05/2022-11:55:12",
                    "content": "These numbers look reasonable. I would definitely vote for something like these, broader distribution is always healthy. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.166666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/MinimalGravitas",
                    "index": "24",
                    "likes": "3",
                    "time": "12/05/2022-20:58:06",
                    "content": "I’ve been slow thinking about this for a few days and I’m not sure that I agree. People who liquid stake through a service like Lido or Rocketpool are not really in the same position as those who run the validators, precisely because they receive a liquid token (stETH or rETH) in return, whereas node operators are really locking away their assets, it’s much more of a long term commitment to the health of the chain. I’ve got some rETH, but if I decided to ditch Ethereum I could easily swap it for PonziCoin or whatever, it doesn’t demonstrate the same level of alignment as ether locked in a validator. I’m probably willing to be convinced to change my mind on this, as there are definitely arguments that make sense for both sides and it is an interesting question. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4940476190476195
                },
                {
                    "author_link": "https://gov.optimism.io/u/RockMan71",
                    "index": "25",
                    "likes": "4",
                    "time": "12/05/2022-21:18:33",
                    "content": "This is a great idea but I wouldn’t make it a multiplayer. Often a clean address is used for a node deposit, so it is unlikely that it would be used for anything else, including Optimism dapps. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.111111111111112
                },
                {
                    "author_link": "https://gov.optimism.io/u/MoneyManDoug",
                    "index": "26",
                    "likes": "2",
                    "time": "12/05/2022-21:52:54",
                    "content": "Most ETH2 validators are likely already eligible for the drop, imagine staking eth but not engaging with OP  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/polarpunklabs",
                    "index": "27",
                    "likes": "1",
                    "time": "17/05/2022-20:53:52",
                    "content": "To solve the Lido (etc.) issue we could simply airdrop to holders of stETH since this will be held by individual users who despited to Lido. We certainly should not exclude users of staking pools since they represent a large number of genuine users, who simply don’t have the resources to stake solo. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.69047619047619
                },
                {
                    "author_link": "https://gov.optimism.io/u/MinimalGravitas",
                    "index": "28",
                    "likes": "1",
                    "time": "17/05/2022-21:46:33",
                    "content": "If we are trying to retroactively reward people for locking up their ether, then what is the advantage to airdropping people holding a liquid staking token like stETH or rETH? How does that link to the concept that @GLCstaked is proposing? Like I said, I’d be happy to be convinced otherwise on this, maybe I’m missing something obvious? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/polarpunklabs",
                    "index": "29",
                    "likes": "1",
                    "time": "17/05/2022-22:07:14",
                    "content": "I am following the original post which does not mention anything about locking up Ether. However, it is worth noting that deposited Eth on Lido is locked. You can trade stEth, of course, but you have locked up Eth. I take it that the criteria is to be staking Ether. I can see no difference - from the perspective of an airdrop - between a user who solo stakes and a user who stakes using a pool. stEth is staked Eth on the Beacon chain, just from a different route. These users are securing the chain just as much as the solo stakers. We should probably be aiming for drops that are inclusionary rather than exclusionary when the terms are about helping out. We’re not talking about sybil farmers here, but users who are invested enough in Ethereum to engage in staking, just without solo staking capability. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.729166666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/MinimalGravitas",
                    "index": "30",
                    "likes": "3",
                    "time": "18/05/2022-08:02:23",
                    "content": "    GLCstaked:  Why Beacon Chain depositors These actors have proven • 𝐥𝐨𝐧𝐠 𝐭𝐞𝐫𝐦 𝐚𝐥𝐢𝐠𝐧𝐦𝐞𝐧𝐭 𝐰𝐢𝐭𝐡 𝐄𝐭𝐡𝐞𝐫𝐞𝐮𝐦, 𝐞𝐬𝐩𝐞𝐜𝐢𝐚𝐥𝐥𝐲 𝐩𝐫𝐞-𝐦𝐞𝐫𝐠𝐞 • 𝐚𝐩𝐭𝐢𝐭𝐮𝐝𝐞 𝐭𝐨 𝐫𝐮𝐧 𝐧𝐨𝐝𝐞𝐬 /𝐬𝐞𝐫𝐯𝐢𝐜𝐞 𝐭𝐡𝐞 𝐧𝐞𝐭𝐰𝐨𝐫𝐤 • 𝐑𝐞𝐚𝐥 𝐫𝐞𝐬𝐨𝐮𝐫𝐜𝐞𝐬 𝐬𝐩𝐞𝐧𝐭 𝐭𝐨 𝐬𝐞𝐜𝐮𝐫𝐞 𝐭𝐡𝐞 𝐧𝐞𝐭𝐰𝐨𝐫𝐤, 𝐭𝐡𝐢𝐬 𝐜𝐚𝐧𝐧𝐨𝐭 𝐛𝐞 𝐒𝐲𝐛𝐢𝐥 𝐚𝐭𝐭𝐚𝐜𝐤𝐞𝐝   I was going by these criteria from the original post, maybe ‘locking up ether’ is too imprecise a term. An example that might illustrate my point is the difference between running a RocketPool minipool (which needs 16 ether) vs holding 16 ether worth of rETH. With the former your ether is committed long term to the security of the network. You cannot unstake and there is not even a date set when this will be possible. Your stake is a demonstration of long term alignment to Ethereum. On the other hand, just holding rETH isn’t a long term commitment. At any time I can swap it for something else, if another chain looks like it might grow faster than Ethereum I can exchange my rETH today for a different token, I’m not tied to Ethereum in the same way. I do appreciate the desire to be inclusionary, but in my opinion if the goal is to encourage certain behaviors that provide the largest benefit then by being less specific with rewards the effect is diluted. What do you see as the advantage of airdropping to staking pool users? I think that’s maybe what I’m not understanding. [Edit - spelling] ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.172161172161172
                },
                {
                    "author_link": "https://gov.optimism.io/u/polarpunklabs",
                    "index": "31",
                    "likes": "3",
                    "time": "18/05/2022-08:17:51",
                    "content": "Perhaps there is a middle ground: to reward solo stakers with more tokens and pool stakers with fewer. The reasoning behind rewarding pool stakers is that they are still helping to secure the network. They have committed less resources, but nonetheless they are participating in staking, just in a less full-blown way. So they should be rewarded, but not nearly as much as a solo staker. More philosophically, I think it’s good we distribute in as inclusionary and wide a way as possible because it spreads the token around more, especially to users who may have less ETH or be less technically-savvy, which is really what most solo stakers are, people with less ETH and know-how, who nonetheless want to be involved in staking. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.591666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/MinimalGravitas",
                    "index": "32",
                    "likes": "3",
                    "time": "18/05/2022-08:28:22",
                    "content": "I appreciate the discussion on this, questions without obvious answers are the most interesting ones! I think I’m kind of stuck at the issue of liquid staking tokens. If I received stETH or rETH then it isn’t really about the amount of resources being committed but more whether they are actually committing anything. Following that logic though, maybe people who staked though exchanges like Coinbase, where your ether is locked up and you don’t get anything for it, should be considered eligible. Not quite sure that seems right either but maybe… it’s a complicated issue and I think I’ll take a step back and see what other contributors think for a bit. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9945054945054945
                },
                {
                    "author_link": "https://gov.optimism.io/u/kevster.eth",
                    "index": "33",
                    "likes": "2",
                    "time": "18/05/2022-10:18:16",
                    "content": "I would just completely leave out liquid staking holders. Even though I hold these myself, it doesn’t really feel like it will reach the right people. Sticking to Node Operator addresses is best, regardless of how many validators they run on it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.085714285714286
                },
                {
                    "author_link": "https://gov.optimism.io/u/kryos.eth",
                    "index": "34",
                    "likes": "1",
                    "time": "19/05/2022-10:29:32",
                    "content": "One idea could be to take all the tokens removed from all the sybil farmers and redistribute a portion of them to validators. It wouldnt even take any extra distribution, just a positive reallocation. Idk how many validators will truly participate in OP, or if its a good idea to keep dishing out governance tokens to gitcoin, validators, users of other main chains, and generally non users of their product… but I suppose very few airdrops have tried. It could work maybe, although it is gambling somewhat. I mean really you ideally reward real current users and incentivize them to stick around with the vast majority of stake. Validators do play a significant role in securing eth, which secures op as well. Thats why redistributing from sybil farmers makes sense, as it is certainly better allocated to anyone remotely related to OP than the guy basically attacking your governance and token (Mr. Sybil). Massive amounts of OP has been sybil farmed, even a small portion of these would probably result in a larger drop to validators than your average OP user. This should probably be reassesed and reperportioned more toward your current community and users with smaller amounts going to non users. Otherwise you are kind of incentivizing people not to use your product. Efficiency! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.7857165404040405
                },
                {
                    "author_link": "https://gov.optimism.io/u/polarpunklabs",
                    "index": "35",
                    "likes": "1",
                    "time": "19/05/2022-10:39:21",
                    "content": "I think I mostly disagree on the idea that staking ETH does not count as committing resources, just because you do it by a staking pool. Staking ETH = committing resources. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/Tuqui",
                    "index": "36",
                    "likes": "2",
                    "time": "19/05/2022-15:08:42",
                    "content": "I recall Binance doing airdrops -for other projects- to people that had tokens in their site. If people in Optimism wants to rewards everyone they can work with CEX or places like Lido/Rocketpool, but its more troublesome because all the conversations that needs to be done on both parts and arrange it. Im a small fish and i staked in Binance end of 2020 till today i have my BETH, i dont have that much $$ and so not much ETH to do half node or even if i did for Lido/Rocket Pool it would take some big part on fees given my small amounts (1 digit), so i continued in CEX. I know theres more people like me so i hope if this continues that you also take us into consideration!! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.394791666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/GLCstaked",
                    "index": "37",
                    "likes": "0",
                    "time": "20/05/2022-16:05:21",
                    "content": "I think its best the tokens removed from this, go back to the airdrop portion, to be decided later. I think validators, should get a large portion of the airdrop allocation, this becomes important later in decentralising Optimism, every validator I know has expressed interest to run L2 nodes when available. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.438775510204082
                },
                {
                    "author_link": "https://gov.optimism.io/u/GLCstaked",
                    "index": "38",
                    "likes": "5",
                    "time": "20/05/2022-16:09:12",
                    "content": "I think the consensus here is to count unique individual node operators (not number of validators) we have approximately +69k unique accounts which is a large distribution.    GitHub    GitHub - GLCNI/ETH-Validators-List: List of Addresses that Deposited the... List of Addresses that Deposited the Ethereum Beacon Chain Contract  - GitHub - GLCNI/ETH-Validators-List: List of Addresses that Deposited the Ethereum Beacon Chain Contract      glad to see discussion here, my intention is to target solo stakers (those running validators), stETH/rETH or similar holders, have liquidity and are not providing the same useful service to the network that node operators do, which is the physical infrastructure layer of Ethereum, without them it would not exist. Also much more difficult to implement, stETH is liquid, it’s on exchanges and Liquidity pools, holders can transfer and there’s multiple ways to obtain these tokens. Where validators have simply deposited into a contract and would be eligible. Another side effect This has the potential to encourage decentralisation of ETH staking, by introducing external incentives to run validators (even with RPL or obol/SSV ) more unique stakers backing nodes to secure the network, and reducing LIDOs increasing (and concerning) share of Ethereum staking. Other L2 networks, should think about this too, especially when decentralising the node set (sequencers), it will be important that distribution includes node runners, not just farmers. ",
                    "links": [
                        "https://github.com/GLCNI/ETH-Validators-List"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.662337662337662
                },
                {
                    "author_link": "https://gov.optimism.io/u/kevster.eth",
                    "index": "39",
                    "likes": "3",
                    "time": "21/05/2022-23:18:07",
                    "content": "I disagree. For example, stETH holders don’t have to care where the yield is coming from. They just use it because it gives them more value at the end of the day. People who stake with centralized exchanges probably care even less. Running a node/validator is much more than just depositing ETH in a contract. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.388888888888888
                },
                {
                    "author_link": "https://gov.optimism.io/u/karlyang",
                    "index": "40",
                    "likes": "3",
                    "time": "22/05/2022-05:02:50",
                    "content": "The purpose is not to give them much benefit, but to encourage such behavior. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/Yujisuk",
                    "index": "41",
                    "likes": "1",
                    "time": "22/05/2022-11:47:35",
                    "content": "Good very good point bro~ ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.025
                },
                {
                    "author_link": "https://gov.optimism.io/u/pama01",
                    "index": "42",
                    "likes": "0",
                    "time": "25/05/2022-20:50:18",
                    "content": "But this won’t give a true community driven token as Optimism wanted. Going through their Vitalik’s Soulbound proposal that’s Optimism is looking forward to adopt, one could say giving validators ones voting power won’t be useful( first it reduces the community and renders token holders useless as well). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/superphiz",
                    "index": "43",
                    "likes": "5",
                    "time": "26/05/2022-02:42:20",
                    "content": "Hi all! I’m a little late to the show, but I’m 100% in favor of rewarding stakers, ESPECIALLY if we can target solo stakers, which is admittedly difficult. Let’s err on the side of rewarding stakers and not focus on trying to exclude those who aren’t solo stakers. This is a fantastic way to support those who support the network. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.294642857142858
                },
                {
                    "author_link": "https://gov.optimism.io/u/polarpunklabs",
                    "index": "44",
                    "likes": "0",
                    "time": "27/05/2022-21:03:40",
                    "content": "100% agree with this sentiment here. Less exclusionary thinking! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.958333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/haomumu",
                    "index": "45",
                    "likes": "1",
                    "time": "01/06/2022-06:24:04",
                    "content": "Good points! I think airdrop for stakers is a good idea,especially solostaker and individual node operators of decentralized take pool.They are firm believers, participants and builders of blockchain.Personally safeguard the safety, stability and values of Ethereum, maintain the decentralization of the network, and make contributions to public infrastructure. The construction power is far greater than the speculative power. It will also be very beneficial to optimsim community in the future, with a good image and great value. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.670454545454545
                },
                {
                    "author_link": "https://gov.optimism.io/u/PeterLin",
                    "index": "46",
                    "likes": "1",
                    "time": "01/06/2022-09:48:23",
                    "content": "Yes,good.I think EthBeaconchainValidators is a forgotten group that should be airdropped. They are protecting the security of EthereumL1 and Optimsim. In particular, solostaker identified that he holds eth. I believe that those who can take out 32ETH and run beaconnode and validator by themselves are able to judge that they will pay the opportunity cost of investing in a bull market. And they took a lot of risks, especially the genesis validators. At that time, they took a lot of unknown risks and the whole chain failed.So I think this behavior should be encouraged no matter whether they are OptimismDao users or not, and it is beneficial to attract them to join optimismdao. In addition, we suggest that we should consider attracting them to accept OP as a tip in the future and give priority to providing L1 attestation for optimsim. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.638888888888889
                },
                {
                    "author_link": "https://gov.optimism.io/u/metaversewater",
                    "index": "47",
                    "likes": "1",
                    "time": "01/06/2022-10:04:58",
                    "content": "Yes, I agree that it would be a single flag for yes/no, would not depend on the number of deposits made. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.642857142857143
                },
                {
                    "author_link": "https://gov.optimism.io/u/haomumu",
                    "index": "48",
                    "likes": "0",
                    "time": "01/06/2022-17:10:23",
                    "content": "This problem can be solved by calculating Etherscan Eth2-Depositor address, Beacon Chain Genesis Depositor POAP poap, etc ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Majesty",
                    "index": "49",
                    "likes": "0",
                    "time": "01/06/2022-19:09:31",
                    "content": "I have done bridge eth and not eligible for Airdrop  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/optima02",
                    "index": "50",
                    "likes": "0",
                    "time": "01/06/2022-19:14:21",
                    "content": "I can not be agreeing with this transparence … all  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/GLCstaked",
                    "index": "51",
                    "likes": "6",
                    "time": "02/06/2022-13:33:08",
                    "content": "Updated the list, Next step is a formal proposal. GitHub - GLCNI/ETH-Validators-List: List of Addresses that Deposited the Ethereum Beacon Chain Contract The list includes, 8666 solo validator owned addresses in its current form (until end of April, I will update for month of May and monthly until the merge) If you are a validator, check for your address, or Rocketpool node account address is included Almost 9k addresses (likely more in coming months), is a large distribution especially considering quality of recipient, validators will add value to optimism network. As a genuine L2 (not sidechain) Optimism is an extension of ETH, validators are integral to the network and should have a say in Layer 2. Most likely to run full nodes on L2 and sequencers when available. Reality is most users do not run nodes and have no interest in doing so. If you aren’t in this list, because you don’t have enough ETH I strongly encourage you to support this, there are solutions around the corner to run ‘shared’ validators with as little as 4 ETH, eg:OBOL network and SSV. It is essential for the long-term success of Ethereum we do not allow the chain to be captured and monopolised by a few entities, external incentives such as this will have positive effect on decentralisation. In time the ROI of being a validator could outweigh minting liquid staking derivatives, as other layer 2s/projects will likely include validators in future distributions. ",
                    "links": [
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-raptor/2547/71",
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-raptor/2547/70"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.69008161976912
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "52",
                    "likes": "0",
                    "time": "02/06/2022-14:05:05",
                    "content": "Outstanding work mate thankyou! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.125
                },
                {
                    "author_link": "https://gov.optimism.io/u/MinimalGravitas",
                    "index": "53",
                    "likes": "3",
                    "time": "02/06/2022-18:14:46",
                    "content": "Great work, love the progress you’re making on this. This part is so important though:     GLCstaked:  If you aren’t in this list, because you don’t have enough ETH I strongly encourage you to support this, there are solutions around the corner to run ‘shared’ validators with as little as 4 ETH, eg:OBOL network and SSV. It is essential for the long-term success of Ethereum we do not allow the chain to be captured and monopolised by a few entities, external incentives such as this will have positive effect on decentralisation.   Lido is at 32.39 % [https://www.rated.network/] - anything we can do to encourage solo staking (or in fact anything other than Lido) at this point is an incredibly important public good. To keep it maximally relevant to this forum, if Ethereum is captured then Optimism’s base layer is no longer credibly neutral.    HackMD    The Risks of LSD - HackMD # The Risks of LSD  ### Liquid Staking Derivatives cannot safely exceed consensus thresholds  Liquid      ",
                    "links": [
                        "https://notes.ethereum.org/@djrtwo/risks-of-lsd",
                        "https://notes.ethereum.org/@djrtwo/risks-of-lsd"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.937026515151515
                },
                {
                    "author_link": "https://gov.optimism.io/u/erowind",
                    "index": "54",
                    "likes": "1",
                    "time": "03/06/2022-06:20:01",
                    "content": "Are operators running their validators through a service like allnodes going to be included or excluded from the address list? It’s not quite the same thing as someone using a service like Lido or coinbase as it’s non-custodial in nature, although, I understand if the ethos is still too stringent to include these validators. Something to keep in mind is that if there is a way to distinguish these operators the proportion of the airdrop allocated to them would reach them directly as individuals as allnodes is a non-custodial service. Full disclosure, I’m asking this as someone who can’t solo stake at home due to geographical limitations on my internets reliability and found renting server space to be the next best thing in terms of decentralization. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.104166666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/kevster.eth",
                    "index": "55",
                    "likes": "0",
                    "time": "03/06/2022-10:12:27",
                    "content": "If you deposit to Allnodes, does your address is used as the deposit address? Or are they collecting your ETH and then send it to the beaconchain themselves? I don’t know Allnodes that well. But if you send the ETH yourself then you should be in that list. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/GLCstaked",
                    "index": "56",
                    "likes": "3",
                    "time": "03/06/2022-13:04:00",
                    "content": "Can you try to find your address in this list and let me know? if you own the keys to this address and made the deposit yourself to the beacon chain, It should be included. i’m not sure what element of control allnodes has over your node, the ethos is to target solo validators supporting ethereum, they either have to provide resources: captial and infrastructure, or pay for it (VPS). there’s going to be some edge cases, contract addresses where excluded from this list, even with rocketpool, it wasn’t as simple as the node account creates a unique contract address which makes the deposit to the beacon chain. I had to get the rocketpool addresses from another contract. RPL operators obviously need to be included as they run and manage nodes/validators it’s just different in how the deposit is made. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.696428571428571
                },
                {
                    "author_link": "https://gov.optimism.io/u/chicco",
                    "index": "57",
                    "likes": "1",
                    "time": "03/06/2022-20:29:10",
                    "content": "I think that is a good thing! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.375
                },
                {
                    "author_link": "https://gov.optimism.io/u/PeterLin",
                    "index": "58",
                    "likes": "1",
                    "time": "04/06/2022-03:47:40",
                    "content": "Well done, the community is full of vitality because of your partner ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/erowind",
                    "index": "59",
                    "likes": "3",
                    "time": "04/06/2022-08:33:00",
                    "content": "I double checked, my address isn’t on the list. Clarification, I was mistaken to some extent. Allnodes could be classified as semi-custodial, they’re not in control my private key, but they do have a copy of my validator key. It is possible to shut off the linode server that is rented through Allnodes and move the validator to one’s own home server or another vps if a person desires. I do have custody of both my private key and validator keys. Allnodes simplifies the process to a fault in this case, and that might be what the issue is, as they suggest people use the abyss finance smart contract to deposit to the beaconchain contract address,  as it is more user friendly. (Allnodes does support depositing to the beaconchain contract directly though.) This is my validators ETH 1 address. (I’m fine disclosing all this information, especially if it helps the community at large.) (Link had to be broken up in order to post all 3 links) https:// etherscan .io/address/0x2ecB2e40762EDf33ff20EE9A37C5A8F6327aAe31 This is the deposit transaction that interfaced with the abyss finance contract and the beaconchain contract for my validators public key.    Ethereum (ETH) Blockchain Explorer    Ethereum Transaction Hash (Txhash) Details | Etherscan Ethereum (ETH) detailed transaction info for txhash 0x0a0f19182bab9138f926c60d6889493aac0a72fe71a72298a6256a353002756f. The transaction status, block confirmation, gas fee, Ether (ETH), and token transfer are shown.      And this is the beaconscan page showing that the validator is in fact mine, and the associated ETH 1 address is my address as provided in the first link.    Etherscan Beacon Chain (Phase 0) Ethereum 2.0 Explorer    Eth1 Deposits | Mainnet Beacon Chain (Phase 0) Ethereum 2.0 Explorer Eth1 Deposits shows the deposit to the Ethereum 1.0 Contract for validator participation to the Mainnet Beacon Chain.      As far as I can tell all the abyss finance contract does is take the ETH sent to it and immediately deposit it for a person onto the beaconchain in the same transaction. Personally I feel that staking on an allnodes vps fits the ethos to target solo validators as anyone using an allnodes vps can change servers at any time and use their validator keys elsewhere. Thankyou for your time ",
                    "links": [
                        "https://etherscan.io/tx/0x0a0f19182bab9138f926c60d6889493aac0a72fe71a72298a6256a353002756f",
                        "https://beaconscan.com/eth1deposits?eth1=0x2ecB2e40762EDf33ff20EE9A37C5A8F6327aAe31",
                        "https://beaconscan.com/eth1deposits?eth1=0x2ecB2e40762EDf33ff20EE9A37C5A8F6327aAe31"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6022256728778475
                },
                {
                    "author_link": "https://gov.optimism.io/u/erowind",
                    "index": "60",
                    "likes": "0",
                    "time": "04/06/2022-08:36:58",
                    "content": "An allnodes user sends the ETH themselves either through the abyss finance smart contract, which sends it to the deposit address (for their ETH 2 validator public key) or by sending the ETH directly to the deposit address. I wrote a detailed post above this one! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.595238095238095
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gsyseet",
                    "index": "61",
                    "likes": "0",
                    "time": "04/06/2022-16:52:00",
                    "content": "Good idea.This is what we should do, in line with our values. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/GLCstaked",
                    "index": "62",
                    "likes": "1",
                    "time": "27/06/2022-23:23:31",
                    "content": "Update on this, I will include June and May depositors this week in the airdrop list, a formal proposal will be published shortly after, targeting 1st week of July. if you wish to get involved, please get in touch I would be happy to get help some additional discussion on this forum post here: [READY] [GF: Phase 1 Proposal] Raptor - #69 by GLCstaked ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.3125
                },
                {
                    "author_link": "https://gov.optimism.io/u/Erudraeth",
                    "index": "63",
                    "likes": "1",
                    "time": "20/11/2022-23:05:33",
                    "content": "I like the sound of this. Ethereum validators have demonstrated authentic commitment to the network. Exchanges and Lido should definitely be excluded. RocketPool validators could perhaps be included though as they still contribute to decentralisation and this lowers the barrier for smaller solo stakers. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.125
                }
            ]
        }
    ],
    "group_index": "11"
}