{
    "poll_list": [
        {
            "id": "0xfba0828a2f887ce56f6c7a548e886fb2028cb062057ff3ca55c6eff95260c9a8",
            "title": "Season 2: Cycle 8: Curve ",
            "discussion": "https://gov.optimism.io/t/draft-gf-phase-1-proposal-curve/3089",
            "body": "This Governance Fund Phase 1 proposal is eligible for voting in Cycle 8. This is the last Voting Cycle of Season 2. \n    \nThis proposal was reviewed by [DeFi Committee C.](https://gov.optimism.io/t/defi-committee-c-season-2-recommendations/3437/12?u=lavande) You can find committee recommendations below: [DeFi Committee C Recommendations](https://gov.optimism.io/t/defi-committee-c-season-2-recommendations/3437/12?u=lavande)\n    \nShadow DeFi Committee B is not an official committee but posts their own recommendations here: [https://gov.optimism.io/t/defi-shadow-committee-season-2-recommendations/3549/11](https://gov.optimism.io/t/defi-shadow-committee-season-2-recommendations/3549/11)\n        \n By approving committees, the Token House entered a social contract to entrust and delegate the bulk of decision-making to official committees. However, delegates may vote against the recommendation of official committees but should provide a justification to the community as to why they voted differently.",
            "choices": [
                "For",
                "Against",
                "Abstain"
            ],
            "scores": [
                15593771.40920806,
                47960.76137744684,
                44118.018629832
            ],
            "start": 1667513467,
            "end": 1668111067,
            "snapshot": "30456637",
            "state": "closed",
            "author": "0x83E54889754e737Fb3CdF07BAaCC0eB9699B6Bdd",
            "space": {
                "id": "opcollective.eth",
                "name": "Optimism Collective"
            }
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/draft-gf-phase-1-proposal-curve/3089",
            "title": "[DRAFT] [GF: Phase 1 Proposal] Curve ",
            "index": 3089,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Governance Fund: Phase 1"
            ],
            "tags": [
                "season-2",
                "passed",
                "cycle-8"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/WormholeOracle",
                    "index": "1",
                    "likes": "24",
                    "time": "24/07/2022-19:46:54",
                    "content": "Project Name: Curve Author Name: WormholeOracle (Discord: WormholeOracle#6470, TG: @WormholeOracle) I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: Yes L2 Recipient Address: 0xD166EEdf272B860E991d331B71041799379185D5 Which Voting Cycle are you applying for?: Cycle #8 Grant category: DeFi Is this proposal applicable to a specific committee? DeFi committee Project description: Curve is a multichain AMM exchange specializing in concentrated liquidity. Curve is designed for extremely efficient stablecoin trading and low risk, supplemental fee income for liquidity providers. Project links: Website: https://curve.fi Twitter: @CurveFinance Discord/Discourse/Community: Discord: Curve Finance, Telegram: Contact @curvefi Please include all other relevant links below: Curve on Optimism- https://optimism.curve.fi/ Additional team member info: Curve Founder TG handle- @michwill Please link to any previous projects the team has meaningfully contributed to: Michael was a founder and CTO of NuCypher, now known as Threshold Network. Relevant Usage Metrics:   TVL on Optimism: $31.73m   TVL across all chains: $5.67B   Weekly volume on Optimism: $7,142,872   A fantastic Dune Analytics dashboard for Curve metrics   Data sourced on August 28, 2022 Competitors, peers, or similar projects: Uniswap Is/will this project be open sourced? Yes Optimism native?: No Date of deployment/expected deployment on Optimism: Currently Deployed Ecosystem Value Proposition: Curve is the backbone of the burgeoning DeFi industry. It touches every piece of the stack and strengthens every integrated protocol. There is opportunity for Optimism to leverage Curve’s foundational role to further support its vibrant ecosystem. Applications integrated into Curve have realized novel use cases. Synthetix heavily utilizes Curve for synth liquidity. Their atomic swap functionality recently integrated with Curve has produced staggering revenues for Synthetix stakers. The stableswap algorithm, well known for enabling deep liquidity and low slippage swaps, has built a reputation for stabilizing pegs and enhancing stablecoin utility. See: FRAX, 3CRV Curve has a number of integrations with lending markets and yield bearing derivatives. Swap fees compound the interest generated from these activities. See: Aave, stETH Highly configurable V2 pools are unlocking new potential for FX markets and volatile crypto pairs. The concentrated liquidity algorithm offers advantages to LPs and traders, combining a composable AMM design with low slippage swaps. See: Tricrypto, eursusd Curve also needs Optimism. A recent Delphi article demonstrated that although Curve regularly quotes better pricing than competitors, it underperforms on volume due to mainnet gas costs. Curve requires a scalable L2 where it can absorb liquidity and realize its potential. Optimism is the ideal partner in this regard. Has your project previously applied for an OP grant? No Number of OP tokens requested: 504,828 Did the project apply for or receive OP tokens through the Foundation Partner Fund?: In Process If OP tokens were requested from the Foundation Partner Fund, what was the amount?: Undetermined, in process How much will your project match in co-incentives? The distribution method will ensure that Curve matches incentives with its own emissions. As will be explained in the token distribution section, OP will be used as vote incentives to pay veCRV voters who gauge weight Optimism pools. While not possible to predict the dollar value of emissions from this strategy, historically >$1 of emissions are produced from $1 of reward deposits. It is commonly considered a capital efficient way to attract TVL, and would create a market dynamic that guarantees Curve will be offering co-incentives. Additionally, a virtuous cycle is created from the bootstrapping phase. Increased incentives attract LPs → Influx of liquidity stimulates utility of Optimism pools → Utility incentivizes veCRV to more heavily weight those pools → Incentives attract more LPs to Optimism. Curve’s inflation schedule takes place over the course of ~250 years, so Optimism can be confident that there are many years of incentives ahead. Proposal for token distribution: How will the OP tokens be distributed? 100% of OP will be distributed as vote incentives for veCRV voters who direct CRV emissions toward Optimism pools. Curve Gauge  veTokenomics, first implemented by Curve, give vote locked tokenholders control over directing inflationary token emissions. A popular strategy used by many protocols is to exchange their native token for Curve emissions to their pools. The OP will be distributed in much the same way, offered as incentives for “gauge weighting”. Curve uses a gauge weight mechanism, the process which directs CRV emissions. Pools receive a gauge by passing an on-chain DAO vote. veCRV owning governance participants vote weekly on where to allocate inflation, which may be pools on any network, including Optimism. Each week, the RootChainGauge on Ethereum mints all CRV emissions of the previous week and transfers them over the Optimism bridge where they are received to a ChildChainGauge contract deployed to the same address. After checkpointing, they are transferred to the ChildGaugeFactory, the contract which handles distribution to all gauges on Optimism.     Contract Name Contract Address     ChildGaugeFactory 0xabC000d88f23Bb45525E447528DBF656A9D55bf5    This decentralized mechanism for rewards distribution distributes CRV to LPs. There are currently five pools with gauge on Optimism (sUSD, sETH, sBTC, 3pool, and FraxBP), although the number of pools and opportunities for LPs will be increasing over time. Current Optimism Gauges Eligible for Incentives:     Pool Name Gauge Contract     sUSD 0xc5aE4B5F86332e70f3205a8151Ee9eD9F71e0797   sETH 0xCB8883D1D8c560003489Df43B30612AAbB8013bb   sBTC 0x172a5AF37f69C69CC59E748D090a70615830A5Dd   3pool 0x15F52286C0FF1d7A7dDbC9E300dd66628D46D4e6   FRAXBP 0x4B960396011A914B4ccCC3b33DFEE83A97A9D766    Votium  Votium is the most widely used service for participating in Curve vote incentives. Depositers can deposit a reward token and specify a specific gauge. Then, during each gauge weight round, CVX and veCRV tokenholders who voted for that gauge can claim their portion of the reward. Although this process has always taken place on mainnet, the Votium team has agreed to deploy their contracts to Optimism so that OP can be distributed on its native network. They generate a merkle proof from votes cast, so can easily determine the correct value each voter is entitled to, and therefore voters simply claim rewards from their Optimism address. Votium contracts deployed to Optimism:     Pool Name Gauge Contract     Gnosis Safe 0x3A84A0517F3175c0F84ac98DDF5045418D751fdd   Deposit address 0x3299Ef424fd225f07eF614B4C9E8a591490Fb564   Fee address 0x5F9f852d3B04c22a43B44EaC364c91252882C7e8   Merkle Distributor 0xA4cdaCBf6cD74eaFBB785064B03B9eD11ec377ff   Merkle Controller 0x25E39DE2678C59983738134d8DA1953D0191e53F    Distribution Plan  We plan to deposit OP each week as vote incentives to veCRV voters on Votium Optimism. The weekly allotment will be 42,069 OP/week for 12 weeks. The recipient address is a L2 vault smart contract deployed as part of Curve’s cross-chain governance system. Tokens sent to this vault are controlled by veCRV voters on mainnet via on-chain governance, making use of Optimism’s own messaging bridge to relay the data. Funds sent to the contract are only accessible by Curve DAO. A distribution contract will be deployed that trustlessly carries out the following strategy. This strategy will be initiated using the cross-chain governance system. The OP rewards will be evenly divided between all existing gauges and deposited each week as vote incentives to Votium Optimism. If a new gauge is added to the gauge controller, it will be added to the distribution in the following weekly cycle. There are currently 5 gauges on Optimism, so each would receive 8,413.8 OP/week of incentives. If a new gauge is voted in, making a total of 6 gauges, each would receive 7,011.5 OP in the next cycle. The median Votium incentives toward CVX in the last 5 bribe rounds has been ~$50k-90k/week by protocol. At current valuation (October 13,2022), the proposed incentive amounts to ~$33k/week, putting it slightly below the median. We expect to see an influx of LPs from mainnet to Optimism as gauge weighting shifts toward Optimism pools as a result of these incentives. Note that the proposed strategy for receiving and distributing OP never involves custody of funds by Curve team, some other admin, or any multisig. Management is handled entirely by Curve DAO and the use of trustless smart contracts. How will this distribution incentivize usage and liquidity on Optimism? Curve’s stableswap AMM excels for pools involving like-kind assets. LP’s are attracted to these pools as a way to earn real yield from swap fees, while mitigating the risk of impermanent loss (as assets supplied to Curve pools are expected to be mean reverting). This is an expectation of increased assets bridged to Optimism, largely stablecoins, as LPs seek superior yield opportunities on Curve. Users trust the design, implementation, and security of Curve’s contracts. Curve has been live on mainnet since early 2020, and has subsequently expanded to a number of side-chains and L2’s. Its system is robust and battletested. Thanks to the integrity of its team and its brand, Optimism will surely see LP’s onboard en masse to its incentivized pools. Once onboarded, the goal is to retain LPs on Optimism. Early converts incentivized with a stake in the network are more likely to express long term loyalty toward Optimism. Curve LPs are power users, some of the most capable at traversing the DeFi landscape. Whereas most protocols regard liquidity as mercenary, Curve has found an enduring alignment with its LPs, largely thanks to veTokenomics. Optimism has this opportunity to make allies of the best DeFi has to offer. Why will the incentivized users and liquidity remain after incentives dry up? Curve’s value proposition has not only attracted individual depositors, but has spawned new categories of DeFi application as protocols build their services around Curve. When these applications establish themselves, liquidity becomes anchored on Curve.   Use case 1: Synthetix and Curve have a deeply intertwined history that began with the need for Synthetix to offer low-slippage exposure to their sTokens. The partnership eventually expanded with the ability to accomplish cross-asset swaps using a combination of Curve and Synthetix. Now atomic swaps are fully realizing this functionality. For example, a user might swap USDC → sUSD on Curve, sUSD → sETH on Synthetix, and sETH → ETH on Curve, all in a single transaction. This is a powerful tool for LPs, who can provide liquidity in a single token without exposure to impermanent loss. Both Curve and Synthetix are seeing a surge in volumes thanks to this functionality.   Use case 2: Yearn was one of the first protocols built on Curve with their Y pool. They essentially invented the yield aggregator that kicked off the farming craze of 2020. Their service involves accepting user stablecoin deposits and optimizing yield on those assets across several lending applications (later expanding to a variety of other strategies). Its viability depends on Curve’s deep liquidity and the assurance that their users can withdraw their stables without suffering impermanent loss. This use case was simply not possible before Curve.   Use case 3: Lido has chosen Curve as the source of liquidity for their liquid staked ETH derivative, stETH. Their service involves accepting user deposits of ETH and staking them on the ETH2 beacon chain. While deposits are temporarily locked before the merge, the stETH pool allows depositors to exit their position back to ETH. The deep liquidity and composability offered by Curve’s stableswap AMM made it an excellent choice for Lido’s integration.   From these examples, it is evident that Curve is foundational to the DeFi ecosystem. It does not exist in isolation, but rather as a building block for novel use cases. Once those applications establish themselves, liquidity becomes firmly cemented within Curve, ultimately becoming the fuel that powers the Optimism flywheel. Over what period of time will the tokens be distributed? The distribution will take place over 12 weeks (42,069 OP will be distributed weekly for the total of 504,828 OP).  Feedback Summary from Discussion (Oct. 13, 2022)  feedback in bold, followed by author’s response The proposed 5 month distribution is too short, should increase duration. The proposed 1,000,000 OP is too much, should decrease requested amount. The proposal has been revised to be a shorter duration, requesting less funds. The intention is to show positive results for Optimism that will support a case for a second round of incentives in the future. Number of incentivized pools seems limited and mainly Synthetix pools. Core pools should have gauges, such as Tricrypto [ETH, BTC, USDT] and 3pool [USDT, USDC, DAI]. When the proposal was first written, only Synthetix pools had gauges on Optimism. Since then, 3pool and FraxBP have received gauges on Optimism. These are basepools and set a foundation for liquidity on Curve Optimism. Curve is not an Optimism native platform, so governance involving addition of gauges and gauge weighting (a requirement for pools to begin receiving OP) would require activity on main net Ethereum. Additionally, the admin fee returns 50% of swap fees to token holders on main net. This line of reasoning takes the position that Ethereum mainnet and Optimism are somehow in competition. While the argument involves ideology, ultimately it is the ambition for Optimism to absorb liquidity most effectively. It is clear that the liquidity Curve draws to Optimism through incentivized pools far outweighs any fees sent to mainnet. Votium will launch contracts for vote incentives on Optimism, so the incentive program will take place directly on Optimism. Gauge weighting is a decentralized mechanism collectively controlled by all veCRV. This makes a commitment of co-incentives from Curve side an uncertain proposition. The first draft of this proposal planned to distribute OP to Curve LPs, and had no way to predict co-incentives because the gauge weight system is decentralized. The updated proposal instead plans to distribute OP as vote incentives for gauge weighting so there will be an economic motive for voters to direct co-incentives toward Optimism pools. This process historically results in >$1 emissions per $1 of reward deposit (over 100% incentive matching). Bribes are a more cost effective way to increase TVL This proposal was updated from distribution to LPs to distribution as vote incentives. The Balancer proposal was used as a model for this updated proposal. OP reward should be proportional to the amount of CRV allocated to pools each week, as opposed to the fixed rate of distribution laid out in the proposal. This suggestion was made to ensure that CRV is adequately co-incentivizing the pools. The updated proposal addresses the request to guarantee co-incentives from Curve. veFunder multisig as recipient address is misleading. Members are not part of Curve core team and therefore possibly a higher risk recipient Although the official Curve Twitter voiced support of the proposal and veFunder as a recipient, we have opted to create a trustless solution whereby the recipient is a smart contract governed by Curve DAO. Distribution is also handled by a contract. There is no longer any question of recipient trust involved with this proposal. Distribution plan is clear and straightforward. OP is not retained by the team/protocol, but instead is distributed entirely to LPs who are Optimism’s user base. This praise was given to the first proposal, which planned to distribute OP to LPs. Now OP is planned to distribute to veCRV voters as gauge weighting rewards, and will be available for claim on Optimism. It remains true that no OP is retained by the team or protocol. Increased incentives on Curve could attract prominent partners such as Lido to make their products the primary venue on Optimism. Competition is not a zero sum game. Increasing TVL on Curve will benefit all trading venues on Optimism. ",
                    "links": [
                        "https://curve.fi",
                        "https://twitter.com/CurveFinance",
                        "https://discord.gg/NyFwFv4zjG",
                        "https://t.me/curvefi",
                        "https://optimism.curve.fi/",
                        "https://www.nucypher.com/",
                        "https://defillama.com/protocol/curve",
                        "https://defillama.com/protocol/curve",
                        "https://dune.com/queries/589055/1100570",
                        "https://dune.com/queries/589055/1100570",
                        "https://uniswap.org/",
                        "https://tokenterminal.com/terminal/projects/synthetix/key_metrics",
                        "https://curve.fi/files/stableswap-paper.pdf",
                        "https://curve.fi/frax",
                        "https://curve.fi/3pool",
                        "https://curve.fi/aave",
                        "https://curve.fi/steth",
                        "https://nagaking.substack.com/p/deep-dive-curve-v2-parameters",
                        "https://curve.fi/tricrypto2",
                        "https://curve.fi/eursusd",
                        "https://members.delphidigital.io/reports/uniswap-vs-curve-which-is-the-best-dex",
                        "https://dao.curve.fi/inflation",
                        "https://resources.curve.fi/reward-gauges/gauge-weights",
                        "https://optimistic.etherscan.io/address/0xabc000d88f23bb45525e447528dbf656a9d55bf5",
                        "https://optimism.curve.fi/factory/0",
                        "https://optimism.curve.fi/factory/10",
                        "https://optimism.curve.fi/factory/12",
                        "https://optimism.curve.fi/3pool",
                        "https://optimism.curve.fi/factory/16",
                        "https://optimistic.etherscan.io/address/0xc5ae4b5f86332e70f3205a8151ee9ed9f71e0797",
                        "https://optimistic.etherscan.io/address/0xcb8883d1d8c560003489df43b30612aabb8013bb",
                        "https://optimistic.etherscan.io/address/0x172a5af37f69c69cc59e748d090a70615830a5dd",
                        "https://optimistic.etherscan.io/address/0x15f52286c0ff1d7a7ddbc9e300dd66628d46d4e6",
                        "https://optimistic.etherscan.io/address/0x4B960396011A914B4ccCC3b33DFEE83A97A9D766",
                        "https://votium.app/",
                        "https://optimistic.etherscan.io/address/0x3A84A0517F3175c0F84ac98DDF5045418D751fdd",
                        "https://optimistic.etherscan.io/address/0x3299Ef424fd225f07eF614B4C9E8a591490Fb564",
                        "https://optimistic.etherscan.io/address/0x5F9f852d3B04c22a43B44EaC364c91252882C7e8",
                        "https://optimistic.etherscan.io/address/0xa4cdacbf6cd74eafbb785064b03b9ed11ec377ff",
                        "https://optimistic.etherscan.io/address/0x25e39de2678c59983738134d8da1953d0191e53f",
                        "https://github.com/curvefi/curve-xgov",
                        "https://curve.fi/iearn",
                        "https://curve.fi/steth",
                        "https://twitter.com/CurveFinance/status/1578118369437712384?s=20&t=YmiynVVry_6s1U-GO1tjkw",
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-abracadabra-money/2918/15",
                        "https://gov.optimism.io/t/defi-committee-c-season-2-recommendations/3437/12",
                        "https://gov.optimism.io/t/scaleweb3-delegate-communication-thread/3314/15",
                        "https://gov.optimism.io/t/gfx-labs-delegate-communication-thread/2728/19",
                        "https://gov.optimism.io/t/voting-cycle-8-roundup/3742/13",
                        "https://gov.optimism.io/t/voting-cycle-7-roundup/3586/13",
                        "https://gov.optimism.io/t/defi-committee-c-season-2-recommendations/3437/2"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.66534733495671
                },
                {
                    "author_link": "https://gov.optimism.io/u/mlich",
                    "index": "2",
                    "likes": "2",
                    "time": "24/07/2022-20:12:19",
                    "content": "Good proporsal  curve & optimism ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/diligit",
                    "index": "3",
                    "likes": "2",
                    "time": "24/07/2022-21:28:10",
                    "content": "I like the proposal. The information is complete. I especially appreciate the detailed information on how the OP tokens are distributed and the distribution period. I would have liked the OP tokens to be distributed over a longer period than 6 months, but 5 months, according to TVL, is acceptable. And I have more confidence that you didn’t rush to apply for governance funding in the first few voting cycles, this is an advantage that the Optimism community knows the project and have time to use the Curve Protocol. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.178571428571429
                },
                {
                    "author_link": "https://gov.optimism.io/u/frankrx15",
                    "index": "4",
                    "likes": "0",
                    "time": "25/07/2022-04:22:56",
                    "content": "Good proporsal and good team, I trust you ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "5",
                    "likes": "8",
                    "time": "25/07/2022-06:54:54",
                    "content": "Hey @WormholeOracle , Adding all the link here referred in the proposal. 3 Synthetix (SNX) | Dashboard | Token Terminal 4 https://curve.fi/files/stableswap-paper.pdf 5 Curve.fi 6 Curve.fi 7 Curve.fi 8 Curve.fi 9 Deep Dive: Curve v2 Parameters - nagaking 10 Curve.fi 11 Curve.fi 12 https://members.delphidigital.io/reports/uniswap-vs-curve-which-is-the-best-dex 13 Gauge Weights - Curve Finance 14 Contract Address 0xabc000d88f23bb45525e447528dbf656a9d55bf5 | Optimism 15 Curve.fi 16 Curve.fi 17 Curve.fi 18 Contract Address 0xc5ae4b5f86332e70f3205a8151ee9ed9f71e0797 | Optimism 19 Contract Address 0xcb8883d1d8c560003489df43b30612aabb8013bb | Optimism 20 Contract Address 0x172a5af37f69c69cc59e748d090a70615830a5dd | Optimism 21 Curve.fi 22 Curve.fi 23 https://dao.curve.fi/inflation ",
                    "links": [
                        "https://curve.fi/files/stableswap-paper.pdf",
                        "https://curve.fi/frax",
                        "https://curve.fi/3pool",
                        "https://curve.fi/aave",
                        "https://curve.fi/steth",
                        "https://nagaking.substack.com/p/deep-dive-curve-v2-parameters",
                        "https://curve.fi/tricrypto2",
                        "https://curve.fi/eursusd",
                        "https://members.delphidigital.io/reports/uniswap-vs-curve-which-is-the-best-dex",
                        "https://resources.curve.fi/reward-gauges/gauge-weights",
                        "https://optimistic.etherscan.io/address/0xabc000d88f23bb45525e447528dbf656a9d55bf5",
                        "https://optimism.curve.fi/factory/0",
                        "https://optimism.curve.fi/factory/10",
                        "https://optimism.curve.fi/factory/12",
                        "https://optimistic.etherscan.io/address/0xc5ae4b5f86332e70f3205a8151ee9ed9f71e0797",
                        "https://optimistic.etherscan.io/address/0xcb8883d1d8c560003489df43b30612aabb8013bb",
                        "https://optimistic.etherscan.io/address/0x172a5af37f69c69cc59e748d090a70615830a5dd",
                        "https://curve.fi/iearn",
                        "https://curve.fi/steth",
                        "https://dao.curve.fi/inflation"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/alexcutlerdoteth",
                    "index": "6",
                    "likes": "7",
                    "time": "25/07/2022-08:16:44",
                    "content": "Heya - Alex from the Velodrome Team here. Even though I’m Velodrome founder, I’m a big Curve and Convex fan. Got my start following and writing about them! I’ve got a few thoughts and questions.   @WormholeOracle are you a member of the Curve Team? How did this proposal come to be?   Am I correct in understanding all of the economic activity around staking veCRV, bribing for votes, and actual voting for Curve emissions would remain on main-net? So any projects looking to actually engage with the Curve ecosystem (outside of swapping or LPing) will need to do so off of Optimism?   I understand 50% of trading fees on Curve go to LPs and 50% go to veCRV holders, does this mean that 50% of the fees generated by this subsidized liquidity would be routinely transferred off Optimism?   When you say that “Curve is currently incentivizing liquidity on Optimism in the form of CRV emissions” you mean that there are veCRV lockers voting for pools such as sUSD-3CRV, right? The Curve Team itself isn’t currently voting for OP pools or offering any matching incentives.   Why would Curve be asking for 1M in $OP from governance solely to offer pool 2 rewards on Synthetix pools? Didn’t the Synthetix Team already received 7M OP to do just that?   Would be good to understand this before weighing in.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.186904761904762
                },
                {
                    "author_link": "https://gov.optimism.io/u/millie",
                    "index": "7",
                    "likes": "0",
                    "time": "25/07/2022-12:08:33",
                    "content": "The proposal didn’t say anything about SNX pool 2s to my knowledge… They seem to be directing all the rewards to their highest volume pools (the same L1 synth pools) which are pegged ETH, BTC and USD pools. Those pools generally have 2-3 assets other than synths in them as well. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.875
                },
                {
                    "author_link": "https://gov.optimism.io/u/alexcutlerdoteth",
                    "index": "8",
                    "likes": "0",
                    "time": "25/07/2022-12:44:58",
                    "content": "Yeah, apologies my note was unclear. I was more looking to understand why (as a Curve proposal) the focus is entirely on incentivizing s asset pools versus the 3pool or CRV or any of the other top main-net pools, especially given the 3M already granted by governance to Synthetix to do that (at least for sUSD). Is intended to be more of a joint Curve/Synthetix proposal?  image1457×1441 219 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.767857142857142
                },
                {
                    "author_link": "https://gov.optimism.io/u/fiddy",
                    "index": "9",
                    "likes": "3",
                    "time": "25/07/2022-15:32:02",
                    "content": "From Curve core. I’ll answer here:   @WormholeOracle are you a member of the Curve Team? How did this proposal come to be?   Wormhole is a distinguished community member, and a member of the Curve Grants council. He is not a curve core dev.   Am I correct in understanding all of the economic activity around staking veCRV, bribing for votes, and actual voting for Curve emissions would remain on main-net? So any projects looking to actually engage with the Curve ecosystem (outside of swapping or LPing) will need to do so off of Optimism?   Yes. Because no such service exists on Optimism (yet) due to technical reasons explained in the next question.   I understand 50% of trading fees on Curve go to LPs and 50% go to veCRV holders, does this mean that 50% of the fees generated by this subsidized liquidity would be routinely transferred off Optimism?   Yes this is by design, since there is a technical challenge that has a dependency on Ethereum EIP: https://notes.ethereum.org/@vbuterin/verkle_tree_eip, and could be updated once Ethereum core devs sunset Merkle Patricia Proofs and onboard Verkle Trees.   When you say that “Curve is currently incentivizing liquidity on Optimism in the form of CRV emissions” you mean that there are veCRV lockers voting for pools such as sUSD-3CRV, right? The Curve Team itself isn’t currently voting for OP pools or offering any matching incentives.   Curve Stakeholders and veCRV holders vote for sUSD-3CRV.   Why would Curve be asking for 1M in $OP from governance solely to offer pool 2 rewards on Synthetix pools? Didn’t the Synthetix Team already received 7M OP to do just that?   This is not a join Synthetix/Curve proposal: this should be clear.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.948660714285714
                },
                {
                    "author_link": "https://gov.optimism.io/u/chanho",
                    "index": "10",
                    "likes": "0",
                    "time": "25/07/2022-16:13:16",
                    "content": "The proposal is NOT focusing on incentivizing synth pools only.  This misunderstanding seems to arise from unfamiliarity with how CRV emissions work. Currently only the synth pools on Optimism are getting CRV emissions (see here).  This is why they were used for the example. The way emissions work is they are determined completely by voting from the DAO.  Once gauges are voted for inclusion in the periodic gauge weight votes, they will get CRV emissions based on the proportion of voting power they receive. Note however that the DAO voting power is comprised of large entities such as Convex, Yearn, etc., in addition to many smaller longtime holders.  While unanimous decisions can occur, results often are the result of much compromise and discussion amongst community members. ",
                    "links": [
                        "https://dao.curve.fi/gaugeweight"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.674603174603174
                },
                {
                    "author_link": "https://gov.optimism.io/u/alexcutlerdoteth",
                    "index": "11",
                    "likes": "0",
                    "time": "25/07/2022-17:17:57",
                    "content": "I understand, but I think this is a distinction without a difference at the moment. You are saying that until or unless the DAO votes for the inclusion of other non s asset pairs in the gauge weight votes (a process that takes time and buy-in), the requested incentives will only benefit the outlined s asset pools. And if any other ecosystem projects were to want to try to participate this process by getting their own gauges approved, participate in the gauge weight votes, or bribe for votes for that their only option to do this would be on mainnet. This essentially makes the program inaccessible to Optimism native protocols or new entrants that don’t have existing presences on mainnet or in Curve goveranance. This is all absolutely fine by the way, but at least in my opinion is not the kind of thing that governance should be directly incentivizing. At least until participation in Curve governance is actually possible on Optimism and there is no longer a need for 50% protocol revenue to be shipped off the chain. Perhaps Curve could apply for a grant through the partner fund to help to accelerate these kinds of efforts and revisit LP incentive boosts from goverance once they’re further along? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.358225108225109
                },
                {
                    "author_link": "https://gov.optimism.io/u/alexcutlerdoteth",
                    "index": "12",
                    "likes": "0",
                    "time": "25/07/2022-17:18:47",
                    "content": "This was very clear! Thank you. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.8125
                },
                {
                    "author_link": "https://gov.optimism.io/u/fiddy",
                    "index": "13",
                    "likes": "2",
                    "time": "25/07/2022-17:34:48",
                    "content": "    alexcutlerdoteth:  And if any other ecosystem projects were to want to try to participate this process by getting their own gauges approved, participate in the gauge weight votes, or bribe for votes for that their only option to do this would be on mainnet. This essentially makes the program inaccessible to Optimism native protocols or new entrants that don’t have existing presences on mainnet or in Curve goveranance.   This is factually incorrect, since protocols that build on Optimism are not forbidden to use Ethereum (the protocol that secures Optimism). So new protocols can just as easily participate in one of the most decentralised protocol governance processes on Ethereum mainnet to determine how its protocol on Optimism evolves. So I don’t see how it becomes suddenly ‘inaccessible’. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.933922558922559
                },
                {
                    "author_link": "https://gov.optimism.io/u/tao",
                    "index": "14",
                    "likes": "2",
                    "time": "25/07/2022-18:00:35",
                    "content": "Right, so all an Optimism protocol would need to do is lobby veCRV holders to get gauges approved for their token pairs, then lobby to get a share of the OP rewards. Once the OP incentives run out, they’d have to consistently bridge funds from Optimism to mainnet to build a veCRV position or bribe veCRV holders to continue incentivizing their liquidity. Best case for Curve, the CRV wars heat up among Optimism protocols and they all bridge funds to mainnet to compete. Eventually Curve attracts the majority of liquidity and trades on Optimism, and they all automatically route 50% of fees back to mainnet. As a Velodrome team member, I’m biased, but this is not what I’d like for the ecosystem. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.919642857142857
                },
                {
                    "author_link": "https://gov.optimism.io/u/FantomFunhouse",
                    "index": "15",
                    "likes": "0",
                    "time": "25/07/2022-18:15:33",
                    "content": "The proposal does not seem to have any incentive matching for protocols whose tokens are not already on gauges approved by the Curve DAO for CRV emissions. I don’t think CRV that may be approved in the future by the Curve DAO should be referenced as co-incentives supplied by the protocol in this proposal. The duration of the emission incentive program is also too short. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/alexcutlerdoteth",
                    "index": "16",
                    "likes": "0",
                    "time": "25/07/2022-18:16:43",
                    "content": "Fair enough. It is not inaccessible, it’s significantly less accessible. 1M in OP incentives that you can only access if you leave the chain and do some combination of purchasing and staking CRV, persuading mainnet voters to approve your gauge, vote or bribe voters to direct emissions to your pool, etc etc. Again, this is a fine behavior to ask for participation in Curve. But, not if Optimism is the one providing the incentives. There are plenty of existing native options that don’t have these limitations. I think any grant would be better served helping the Curve Team remove these barriers first. Then consider juicing the incentives to participation. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.208333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/chanho",
                    "index": "17",
                    "likes": "0",
                    "time": "25/07/2022-19:58:34",
                    "content": " Right, so all an Optimism protocol would need to do is lobby veCRV holders to get gauges approved for their token pairs, then lobby to get a share of the OP rewards.  There are other options than lobbying veCRV holders directly, but ultimately garnering support is necessary, as is the case for receiving any emissions from Curve.  As a Velodrome team member, I’m biased, but this is not what I’d like for the ecosystem.  You guys have already stated you understand the importance of working with Curve (and Convex) when you airdropped $VELO to veCRV and vlCVX holders:  “$VELO tokens will be distributed to the people who have played the biggest role in incubating Velodrome and those likeliest to contribute to its long-term success”  I assume you were aware all along this is how the protocol works when you airdropped to veCRV holders.  I would like to understand where this objection is coming from.  Are you are looking out for other protocols on Optimism?  They may not be able to marshall the efforts you guys were able to?  I would say let’s not underestimate others, including your potential competition.  Best case for Curve, the CRV wars heat up among Optimism protocols and they all bridge funds to mainnet to compete.  Best case perhaps in a static world. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.461904761904762
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "18",
                    "likes": "2",
                    "time": "25/07/2022-20:24:43",
                    "content": "I would love to take a moment to appreciate how beautifully written this proposal is . Distribution plan is clear with contact address and pool name along with number of token to be distributed in each pool. Author has left nothing to the readers imagination by providing 25 citation. Thank you @WormholeOracle, this was a good read. To be frank, I still find math behind curve mind boggling but worth a read nonetheless. Now coming back to proposal. On co-incentives, from what I understood, curve emission is part of the curve protocol, right ? Its not something special that you are doing only on OP chain ? Do you have project or DAO budget in form of CRV ? Will you be able to provide any form of co-incentives ? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.330357142857142
                },
                {
                    "author_link": "https://gov.optimism.io/u/tao",
                    "index": "19",
                    "likes": "2",
                    "time": "25/07/2022-21:26:19",
                    "content": "Curve is one of the best protocols in DeFi, and Velodrome exists thanks to it. That’s why we airdropped tokens to veCRV holders. The point though was to attract said veCRV holders into Optimism to participate in the ecosystem. As explained above, without being fully deployed on Optimism, Curve’s success would lead to a direct flow of capital AWAY from Optimism and into Mainnet in the form of fees, bribes, and veCRV acquisitions. This is not in the best interest of Optimism as it tries to grow while competing for resources with other L2s. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.484375
                },
                {
                    "author_link": "https://gov.optimism.io/u/chanho",
                    "index": "20",
                    "likes": "0",
                    "time": "25/07/2022-21:45:35",
                    "content": " Curve’s success would lead to a direct flow of capital AWAY from Optimism and into Mainnet in the form of fees, bribes, and veCRV acquisitions.  As any accountant will tell you, what’s important is net flow.  If you are saying this is the net result, that’s a (suspect) claim to know the future.  If you claim this is one flow of many, then ok. But keep in mind: the most important flow is from Mainnet to Optimism.  Curve will be a strong ally for that. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.424242424242424
                },
                {
                    "author_link": "https://gov.optimism.io/u/tao",
                    "index": "22",
                    "likes": "1",
                    "time": "25/07/2022-22:11:49",
                    "content": "As one of my favorite philosophers once said “The future ain’t what it used to be.” ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/fiddy",
                    "index": "23",
                    "likes": "2",
                    "time": "25/07/2022-22:15:39",
                    "content": "  Curve fees go to mainnet veCRV: this is true. But the incentivisation will also bring a lot of TVL from mainnet to Optimism. Also: Ethereum and Optimism are not competitors. It should be abundantly clear by now. This alone refutes any concerns about TVL leaving Optimism due to OP incentives offered to Curve.   In the case of this proposal, all of the incentives go to Optimism users, and none of it goes to any centralised dev team or core team. The proposal was also entirely written by a community member, and not a core team member asking to be paid to build on Optimism.   Finally: the Curve DAO from mainnet has the ability to co-incentivise LPs on Curve Optimism. Members of the DAO have already been doing this for a while, incentivising liquidity on Optimism significantly before Optimism even had a token: thus helping Optimism bootstrap liquidity in its embryonic stage.   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.583333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/thesleeper",
                    "index": "24",
                    "likes": "0",
                    "time": "26/07/2022-01:43:33",
                    "content": "Curve will bring TVL to Op ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/WormholeOracle",
                    "index": "25",
                    "likes": "3",
                    "time": "26/07/2022-01:44:25",
                    "content": "Hi, thank you for the kind review, and also for helping me in my time of need when I couldn’t post my links and spambot even going so far as to cancel my post temporarily (oops)! All links for the proposal listed here, for anyone interested:    [DRAFT] [GF: Phase 1 Proposal] Curve Governance Fund: Phase 1       Hey @WormholeOracle , Adding all the link here referred in the proposal.  3 Synthetix (SNX) | Dashboard | Token Terminal  4 https://curve.fi/files/stableswap-paper.pdf  5 Curve.fi  6 Curve.fi  7 Curve.fi  8 Curve.fi  9 Deep Dive: Curve v2 Parameters - nagaking  10 Curve.fi  11 Curve.fi  12 https://members.delphidigital.io/reports/uniswap-vs-curve-which-is-the-best-dex  13 Gauge Weights - Curve Finance  14 Contract Address 0xabc000d88f23bb45525e447528dbf656a9d55bf5 | Optimism  15 Curve.fi  16 Cur…       OPUser:  On co-incentives, from what I understood, curve emission is part of the curve protocol, right ? Its not something special that you are doing only on OP chain ?   Curve emission is fundamental to Curve protocol, yes. (I realize I’m going overboard with links, sry).Curve gauges can and do exist everywhere that Curve does. This is important to clarify because if it required custom built functionality to work with Optimism, I’d be a little suspicious about whether the dev overhead would be manageable. Actually, the integration with Optimism already exists, it’s even trivial and permissionless to deploy a gauge and create an on-chain vote to receive emissions (you can do this from the curve optimism UI).     OPUser:  Do you have project or DAO budget in form of CRV ? Will you be able to provide any form of co-incentives ?   I consider the gauge to be Curve’s budget, and is the exclusive method for Curve to incentivize its liquidity pools. Currently veCRV voters direct something like 600k CRV emissions/day. There is a DAO community fund, but this is reserved for community and ecosystem grants, not for liquidity incentivization. I can appreciate the uncertainty of whether pools will receive gauge weighting, but I am confident that the current Optimism gauges will be well utilized- Synthetix has indeed been actively incentivizing its sUSD gauge. Gauges become weighted when there is some value in it to someone - either an LP wanting to boost their rewards or a protocol wanting to establish its stablecoin, or a veCRV voter seeing high utilization of a particular pool and hoping to increase revenue. It’s also a protective mechanism, to make sure incentives are distributed where people collectively get most value from it. I hope also that out of this discussion will generate interest in creating new gauges by up and coming protocols on Optimism ",
                    "links": [
                        "https://tokenterminal.com/terminal/projects/synthetix/key_metrics",
                        "https://curve.fi/files/stableswap-paper.pdf",
                        "https://curve.fi/frax",
                        "https://curve.fi/3pool",
                        "https://curve.fi/aave",
                        "https://curve.fi/steth",
                        "https://nagaking.substack.com/p/deep-dive-curve-v2-parameters",
                        "https://curve.fi/tricrypto2",
                        "https://curve.fi/eursusd",
                        "https://members.delphidigital.io/reports/uniswap-vs-curve-which-is-the-best-dex",
                        "https://resources.curve.fi/reward-gauges/gauge-weights",
                        "https://optimistic.etherscan.io/address/0xabc000d88f23bb45525e447528dbf656a9d55bf5",
                        "https://optimism.curve.fi/factory/0",
                        "https://optimism.curve.fi/factory/10",
                        "https://curve.readthedocs.io/dao-gauges.html"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.708707415772634
                },
                {
                    "author_link": "https://gov.optimism.io/u/BuDong",
                    "index": "26",
                    "likes": "0",
                    "time": "26/07/2022-03:17:01",
                    "content": "Voted: Yes Bring TVL to Op ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/alexcutlerdoteth",
                    "index": "27",
                    "likes": "2",
                    "time": "26/07/2022-10:31:57",
                    "content": "So I guess the problem is that (as currently constructed), this proposal doesn’t really represent Curve doing anything to bring TVL to Optimism. It would be the 1M in OP rewards doing that. Drop 50k/week in direct LP incentives on Beethoven or Uni/Arrakis and you’d see similar results. Drop that much on Velodrome bribes, you’d likely be able to attract 2x the TVL. And any of those options wouldn’t come with the need for fees or bribes to head off chain. I’d like to see this proposal reflect some kind of mutual investment from Curve and/or it’s major stakeholders commensurate with the ask from Optimism Governance. I also continue to think that working with the foundation to explore a partner grant for a full Curve deployment on Optimism might be a better first step for all parties. Can help make intros there if helpful! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.177083333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/fiddy",
                    "index": "28",
                    "likes": "1",
                    "time": "26/07/2022-12:42:15",
                    "content": "  Thank you for offering your help to make intros. The dev team does not need any grant to build on Optimism (although if offered organically from Optimism’s side without us asking for it, we won’t say no). This proposal only wants incentives for Optimism users through Curve, and does not ask for any incentive to build on Optimism. Personally: dev teams asking for incentives to build is … not aligned with the ethos of crypto and open finance.   Our veCRV implementation is already deployed across all chains, but it hasn’t been activated yet for the reasons I mentioned earlier (dependency on a pending EIP that deprecates Merkle Patricia Trees in favor of Verkle Trees).   It is in Optimism’s best interests that a variety of markets be incentivised, since that diversifies liquidity. Aggregators take care of the rest.   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/jrocki.eth",
                    "index": "29",
                    "likes": "0",
                    "time": "26/07/2022-18:13:50",
                    "content": "Lido Finance is set to offer its staked Ether across all L2 networks starting with ARB and OP first out the gate. OP could become the main place to swap stETH if this Curve liquidity mining proposal goes through  as liquidity begets liquidity. This could be a massive benefit to the OP ecosystem. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.520833333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/Ganc",
                    "index": "30",
                    "likes": "0",
                    "time": "26/07/2022-18:19:38",
                    "content": "Is this a grant for Optimism growth or a fealty payment to Curve?  As others have mentioned, would it not require multiple other layers to be deployed onto Optimism to even get a functioning self contained Curve ecosystem on Optimism? Why only now when grants are on the table has Curve decided to actually make any movements with Optimism, especially since Curve is so well funded on its own? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.395833333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/chanho",
                    "index": "31",
                    "likes": "0",
                    "time": "26/07/2022-18:47:43",
                    "content": "If you’re going to post from other forums, please post enough context so participants here can understand my response:  Incidentally, this poster seems to have made some kind of generalization about me based on my support of this proposal that may be affecting his judgment:  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.791666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/Ganc",
                    "index": "32",
                    "likes": "0",
                    "time": "26/07/2022-18:59:42",
                    "content": "I was not sure if the Gov forum was family friendly so edited out my loose wording, thanks for providing the extra context though. I am highly skeptical of Op grants being easily granted to well capitalised projects where there is a large potential for it to be siphoned off chain and back to mainnet. See my expose on Perpetual Protocol that did something more explicit here:     Perpetual Protocol: Optimism Governance's First Failure 💌 Ideas & Feedback       Perpetual Protocol was granted 9,000,000 OP tokens (currently worth around $6.5 million) in a Phase 0 Grant, the proposal for which can be found here.  This large grant was voted through as a batch vote, and in my opinion I do not think enough due diligence was done when green lighting such a large amount of funds.  1. Perpetual Protocol v1 collapsed resulting in loss of customer funds to the tune of $44.6 million. Whilst it appears some progress has been made, there are still customers with out…     I can see a similar eventuality in this instance although not as blatant or as deliberate, but due to Curve’s main mechanisms being outside of Optimism. ",
                    "links": [
                        "https://gov.optimism.io/t/gf-phase-0-proposal-perpetual-protocol/201"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.15485347985348
                },
                {
                    "author_link": "https://gov.optimism.io/u/alexcutlerdoteth",
                    "index": "33",
                    "likes": "1",
                    "time": "26/07/2022-19:05:21",
                    "content": "Yeah, we’ve been working with Lido since launch. OP will certainly be the place to swap stETH, but we won’t need to send any more fees back to L1 than necessary to do that.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.892857142857143
                },
                {
                    "author_link": "https://gov.optimism.io/u/benny",
                    "index": "34",
                    "likes": "3",
                    "time": "27/07/2022-03:34:16",
                    "content": "As some have expressed concern over mercenary liquidity and all the benefits of the program going back to mainnet, it may be useful to look at a previous instance of Curve being the beneficiary of such an incentive program. From early October 2021 to January 2022, Curve was one of the protocols selected to receive a grant in WAVAX as part of Avalanche’s Rush program aimed at developing DeFi on the chain. The WAVAX grant was redistributed by Curve to liquidity providers of the aave (3pool equivalent with lending) and tricrypto pools. The chart below shows the TVL of these two pools over time, with the highlighted area denoting the duration of the Avalanche Rush program:  image754×397 43 KB  As you can see, the incentives (doubled with CRV incentives) proved extremely successful and helped drive the TVL from nothing to over 1 billion dollars. There was a TVL dip in both pools once the rewards ended, but this only proved temporary. By February both pools had recovered and the aave pool went to reach a new ATH in TVL and maintained deep liquidity until the recent market downturn. Not only did the incentivized pools maintain their TVL long after the incentive program had ended, they also did so in a more competitive environment. Another stableswap platform with veTokenomics, Platypus, launched on Avalanche in January and went on to reach over 100m TVL (they too, benefitted from incentives as part of the Avalanche Rush programs). This should assuage the concern raised by the Velo team above, as it shows that competition is not a zero-sum game It helped increase the overall TVL of the Avalanche protocol while both competitors also increased their TVL. A competitive ecosystem on Optimism will bring more users and more value than a single monopolistic player. Finally, one should note that the growth of Curve’s TVL as a result of the incentive programs also created many positive externalities as other projects built upon Curve. On Avalanche, Abracadabra, Beefy.finance, Blizz, Yeti.finance, Yield Yak are some of the protocols that offered products relying on Curve pools and yield, which themselves brought more users and liquidity to the chain. tl;dr Liquidity stays on Curve even after incentives are gone; Curve growth strongly contributes  to development of the chain’s ecosystem. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.726774891774892
                },
                {
                    "author_link": "https://gov.optimism.io/u/Ganc",
                    "index": "35",
                    "likes": "0",
                    "time": "27/07/2022-08:12:47",
                    "content": "I may have just woken up but that chart shows 4 months after incentives ended the TVL was less than where it started…  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.166666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/alexcutlerdoteth",
                    "index": "36",
                    "likes": "0",
                    "time": "27/07/2022-09:45:22",
                    "content": "I want to be clear: I think a fully deployed Curve would absolutely be good for both Optimism and Velodrome. Velodrome’s success depends 100% on the success of the ecosystem, which is why we’re increasingly vocal in governance. I think it is clear now that some of the early proposals led to less than ideal outcomes and that is something we’re committed to doing our best to help avoid going forward. Every new grant has an opportunity cost and dilutes those previously distributed, so we need to make sure the ROI is there as we continue to invest. For me personally, subsidizing TVL and volume that will ship 50% of fees off chain may be a deal breaker given the existence of alternatives (not just Velodrome) that don’t require this kind of value extraction. Likewise for the requirement  that projects will have to go to mainnet to engage in Curve governance to have a shot at having a gauge that might be eligible for the rewards. If in the future these obstacles are removed, I’ll feel differently. I think the future is on L2 and Optimism users should be able to get the full Curve experience if we’re going to drop 1M in incentives on it. That said, if these aren’t deal breakers for others here is something I think could make the proposal stronger. Choose a single public good pool (like tri crypto) and vote to make it eligible for CRV emissions on Optimism. Then work with a collection of Curve stakeholders to commit to a certain amount of voting power that would be dedicated to this pool over the duration of the incentive program. Then request an equal proportion of  OP incentives as a match or boost to those emissions. This way, you are growing Curve on Optimism with OP incentives in a way that doesn’t gatekeep participation to those with mainnet presences. You are also functionally matching the incentives that Optimism governance is granting you, demonstrating a commitment to ecosystem investment. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.209177489177488
                },
                {
                    "author_link": "https://gov.optimism.io/u/fiddy",
                    "index": "37",
                    "likes": "1",
                    "time": "27/07/2022-12:59:56",
                    "content": "Market nuked. Some coffee in the morning helps! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/WormholeOracle",
                    "index": "38",
                    "likes": "3",
                    "time": "27/07/2022-13:39:10",
                    "content": "    alexcutlerdoteth:  Choose a single public good pool (like tri crypto) and vote to make it eligible for CRV emissions on Optimism.   This is a good suggestion, thanks. (I hear this may actually be in the works already). We will discuss with Curve team about launching and gauging a tricrypto on Optimism. Tricrypto is indeed an important one imo ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.377551020408163
                },
                {
                    "author_link": "https://gov.optimism.io/u/nagaking",
                    "index": "39",
                    "likes": "1",
                    "time": "29/07/2022-15:09:11",
                    "content": "    alexcutlerdoteth:  For me personally, subsidizing TVL and volume that will ship 50% of fees off chain may be a deal breaker given the existence of alternatives (not just Velodrome) that don’t require this kind of value extraction.   To be clear, we’re talking about 0.02% of volume being sent to layer 1 (not some random other chain). Assuming ~$1m volume per day, that amounts to $73,000 per year. I think it’s a bit hyperbolic to call that deal-breaker level “value extraction”. Speculatively, traders could plausibly save that much on slippage alone. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.553571428571429
                },
                {
                    "author_link": "https://gov.optimism.io/u/FantomFunhouse",
                    "index": "40",
                    "likes": "0",
                    "time": "29/07/2022-18:17:49",
                    "content": " Not up to speed on this proposal but I saw this on the twitter feed. Pretty weird angle to take? Threatening to focus on a different L2 if they don’t get a grant? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.583333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/nagaking",
                    "index": "41",
                    "likes": "1",
                    "time": "29/07/2022-21:17:13",
                    "content": "    alexcutlerdoteth:  Velodrome’s success depends 100% on the success of the ecosystem, which is why we’re increasingly vocal in governance. I think it is clear now that some of the early proposals led to less than ideal outcomes and that is something we’re committed to doing our best to help avoid going forward.   I think it’s worth noting that the expected amount to be “extracted” to L1 is far less than the amount that Velodrome directly airdrops to veVELO lockers (~500,000 OP). These airdrops provide no direct value to the Optimism ecosystem and are essentially a subsidy to boost the price of VELO. Indeed, the majority of OP funds requested by Velodrome directly benefit Velodrome development with no direct benefits to the Optimism ecosystem more broadly. For example, 600,000 OP are allocated to “protocols that integrate Velodrome’s liquidity layer” and another 600,000 are allocated to developing a “vote delegation and autocompounding feature that is directly built into Velodrome”. By contrast, distributing OP tokens to LPs (as in this proposal) incentivizes liquidity on Optimism, a direct benefit to the ecosystem. Given these details, it’s hard to avoid the conclusion that Velodrome is trying to push a double standard to “lock out” their perceived competitor. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.703804347826087
                },
                {
                    "author_link": "https://gov.optimism.io/u/gabagool",
                    "index": "42",
                    "likes": "1",
                    "time": "29/07/2022-22:18:23",
                    "content": "So just so you know - we withdrew this grant request from governance after receiving 3m $OP from the partner fund. Those incentives have actually done a lot to help onboard a huge amount of TVL ($123m). By incentivizing veVELO lockers to vote, and direct emissions (of variable value, depending on token price), we are incentivizing liquidity. These airdrops provide a direct value to the Optimism ecosystem, as witnessed by Optimism’s climb from #15 to #11 on DefiLlama’s “All Chains TVL” rankings. We love Curve, and have repeatedly said that we are eager for Curve to continue expanding on Optimism once the technical hurdles presented by Curve team member’s above allow for it. Let me state publicly: I am not concerned in the slightest about the impact of a $1.6m grant in terms of any “competition” between Curve and Velodrome. I think our system is robust, and we are actively working to improve our UI, bribing contract, and other elements of our protocol. That should and will be our primary focus. Anyway, as Cryptoyieldinfo stated, our real fight is against the CEXs, not a protocol that we have long admired, and that I personally have been using faithfully since launch. I support granting curve OP to incentive their growth on Optimism. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.49702380952381
                },
                {
                    "author_link": "https://gov.optimism.io/u/chanho",
                    "index": "43",
                    "likes": "7",
                    "time": "29/07/2022-23:55:44",
                    "content": "Despite the furious back channeling, discord spamming, unrelentless tweeting, Velodrome team (apparently the frontline of Optimism governance) has yet to explain a very simple thing.  This misunderstanding (some would say FUD) was evident from the very start, has been elaborated on, and actively deflected with irrelevant, out-of-context screenshots from these other venues.  This form of engagement that Velodrome prefers has drawn praise from some quarters as “hustle” or “being passionate” and self-described as unavoidably part of “an inherently political process”:  I do believe it is worthwhile to cut through the noise.  Very rarely can one find the original causal force that starts a complex mass moving.  But sometimes you can find one screenshot:  Screen Shot 2022-07-29 at 6.50.44 PM613×738 85.1 KB  This “feeling” (less than one day after the draft proposal was posted) that value will entirely flow back to Mainnet is the initial, powerful impulse that has led to this wide-ranging discussion happening in multiple venues of social media.  Everything since then has been some form of elaboration or deflection on this basic feeling. So let’s put aside all the noise.  Let’s put aside the silly inaccuracy about pool2s in the tweet, which he repeated here, and let’s put aside the various leading questions asked by Alex Cutler in his posts here, including his strange screenshot of Mainnet pools, before he finally decided to “weigh in”. Let’s talk about this feeling that value will flow back to Mainnet.  Why would someone feel that 2 basis points of volume going back to Mainnet will result in everything else going back to Mainnet? On the face of it, this is an absurd claim. Rather than address why 2 basis points of volume is so crucial, they ask a related but quite different question, which is easier for them to defend.  In behavioral economics, this is called the substitution heuristic.  When faced with a hard question you can’t answer, you substitute a similar, but different question that is easy to answer.  It is quite deceptive and easy to pull off and funnily enough, not always done to you by others but by yourself.  Why? So that your smoll brain can avoid facing reality. Instead of asking the relevant question, they substitute with:  do you believe it’s right for value to flow back to Mainnet? do you believe Optimism should incentivize value to leave Optimism? do you believe people should be voting on Mainnet for something that affects Optimism? do you believe Curve should be doing more on Optimism? do you believe people should be allowed to use Curve on Mainnet if they use Curve on Optimism? isn’t it better to not use Mainnet at all?  Note how many of these questions have to do with beliefs, particularly about seemingly deep issues that when actually pondered are quite vapid.  For example, “do you believe Curve should be doing more on Optimism?”  Obviously more Curve LPs will come if there are more incentives. So the practical matter is, if you want Curve LPs to come, you give them more.  And why do you want them to come?  Because the more of them, the better the trading and more traders come too.  There is no deep philosophy here. That doesn’t matter if the purpose is to deflect of course.  Then the more absurd the better, as people get distracted from the real question: Would 2 basis points of all the volume Curve brings to Optimism going back to Mainnet result in everything else going back to Mainnet? So remember, next time the Velodrones ask you, “Something something value on Mainnet?” just ask them to answer this first.  This is in fact the most pertinent question if you are interested in making money trading on Optimism, not in holding some vague idealistic philosophy that happens to very coincidentally align with defending one protocol’s moat. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.529037267080746
                },
                {
                    "author_link": "https://gov.optimism.io/u/gabagool",
                    "index": "44",
                    "likes": "1",
                    "time": "29/07/2022-23:57:06",
                    "content": "hey just fyi in the above post I noted that I support granting Curve their requested $OP. We should certainly not rely on my “feelings”! Appreciate you laying out the numbers for us. I do hope that a revision of the proposal will provide more clarity around co-incentives and maybe outline something Curve can bring to Optimism in the near future (tricrypto, for ex, as mentioned above would be amazing.) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.761479591836735
                },
                {
                    "author_link": "https://gov.optimism.io/u/chanho",
                    "index": "45",
                    "likes": "1",
                    "time": "30/07/2022-00:20:43",
                    "content": "Been a bit busy… started writing that earlier and just posted it now, maybe after nobody cares anymore :). I think it still has some value though in reiterating what I believe to be the fundamental question here.  Thanks for your other post and your support. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.71875
                },
                {
                    "author_link": "https://gov.optimism.io/u/gabagool",
                    "index": "46",
                    "likes": "0",
                    "time": "30/07/2022-00:27:15",
                    "content": "I understand and appreciate your emphasis on numbers. I do disagree that our questions around this grant come from a place of fear / trying to maintain a competitive edge (ex: we have OP, they dont), but that the original points have been a bit lost in a nasty argument that I for one have zero interest in engaging in. I do think its important that grants consider carefully the structure of protocols that are multichain, I do think governance is a political process - it involves debate - as you have participated in! And I also think that Curve expanding their liquidity incentives to Optimism pools is a net positive for the ecosystem. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.188920454545455
                },
                {
                    "author_link": "https://gov.optimism.io/u/nagaking",
                    "index": "47",
                    "likes": "0",
                    "time": "30/07/2022-01:47:13",
                    "content": "Cool, we’ll just forget Velodrome deliberately misrepresented this proposal to protect their own interests. Happy to know we can trust your objectivity in co-governing this august enterprise ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.916666666666668
                },
                {
                    "author_link": "https://gov.optimism.io/u/gabagool",
                    "index": "48",
                    "likes": "1",
                    "time": "30/07/2022-02:00:13",
                    "content": "Hey nagaking, I don’t think that happened. I understand we are in disagreement here so not sure what will be gained from trying to change your mind. hope you have a nice night though - I certainly do look forward to co-governing this august enterprise with you! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.029761904761904
                },
                {
                    "author_link": "https://gov.optimism.io/u/gabagool",
                    "index": "49",
                    "likes": "0",
                    "time": "30/07/2022-02:01:26",
                    "content": "wanted to thank you @fiddy for laying out the reasons why veCRV hasn’t been implimented yet on Optimism. Point 3. also makes clear sense to me. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/SuRa",
                    "index": "50",
                    "likes": "1",
                    "time": "01/08/2022-05:03:17",
                    "content": "I believe a short discussion as above is better than a public CT rant and taking a dig at various protocols, looks like some will have fragile egos no matter how big they get. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.357142857142857
                },
                {
                    "author_link": "https://gov.optimism.io/u/icrypto",
                    "index": "51",
                    "likes": "0",
                    "time": "01/08/2022-07:25:23",
                    "content": "Great proposal. Looking forward to it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Kanku",
                    "index": "52",
                    "likes": "0",
                    "time": "14/08/2022-11:32:05",
                    "content": "Looks good for me. Just the security of protocol have to be improved ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/ScaleWeb3",
                    "index": "53",
                    "likes": "0",
                    "time": "15/08/2022-12:57:07",
                    "content": "We want “more Curve” on Optimism and look forward to aligned roadmaps & user incentivization. The proposal is well-written but lacks some detail in important areas such as alignment and collaboration between Op & Curve. Consequently, we’d like to see some more focus on (incentivizing) building on an Optimism deployment, moving users or pools sustainably to Optimism. Knowing that Curve is the place for deep stablecoin liquidity and consequently a foundational building block for many use cases, we can assume a big network effect of moving pools to Optimism - if truly aligned. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.357142857142857
                },
                {
                    "author_link": "https://gov.optimism.io/u/nagaking",
                    "index": "54",
                    "likes": "0",
                    "time": "19/08/2022-06:47:47",
                    "content": "I call em like I see em, ser At any rate, no ill-will here. I like velo and still hold my airdrop. Still, I will dispute falsehoods regardless. My best regards ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/WormholeOracle",
                    "index": "55",
                    "likes": "0",
                    "time": "24/08/2022-05:16:36",
                    "content": "Thank you all for the input and lively discussion. I have let this draft sit for some time to allow for Curve’s development on Optimism to speak for itself. Since the OP post one month ago, TVL is up from $17.33m to $39m and average weekly volume is up from $3.4m to $13.3m. Two new gauges have been voted in by the DAO: 3pool and FRAXBP. Both of these are foundational USD pools that can be used to create metapools in the pool factory. A tricrypto pool is in the works, and will be launched after some testing and parameter adjustment. The recipient address in the proposal is the Curve deployer address, which can be verified on Etherscan. I’m now switching this proposal to READY, and excited to work with you all to help bring deep stablecoin liquidity to Optimism! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.581439393939394
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "56",
                    "likes": "0",
                    "time": "24/08/2022-12:34:49",
                    "content": "I’ll vote yes on this proposal. Thank you @WormholeOracle for pushing this forward and @chanho for your substitution heuristic explanation. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/alexcutlerdoteth",
                    "index": "57",
                    "likes": "0",
                    "time": "24/08/2022-17:05:28",
                    "content": "There had been some discussion of shifting from a fixed quantity of $OP/week to a 1:1 match of $OP to $CRV emissions coming to Optimism to bring the proposal in closer alignment with asks made of other protocols who have requested governance funds and ensuring incentives were being fully matched. Was this adjustment considered and rejected? If so, curious to understand the thinking. Just to get a baseline, what is the current value of $CRV emissions on a weekly basis being directed to Optimism pools? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.84375
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "58",
                    "likes": "1",
                    "time": "24/08/2022-20:30:55",
                    "content": "Hi @WormholeOracle I am not sure if you are aware of this but you need to post this proposal in our discord new-gov-temp-check and also you might need to move this proposal to our new project proposal template. Making it Ready will not count anymore, with new rules you need approval from two delegate before you can make any proposal Ready. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5606060606060606
                },
                {
                    "author_link": "https://gov.optimism.io/u/WormholeOracle",
                    "index": "59",
                    "likes": "0",
                    "time": "28/08/2022-23:18:02",
                    "content": "    OPUser:  I am not sure if you are aware of this but you need to post this proposal in our discord new-gov-temp-check and also you might need to move this proposal to our new project proposal template. Making it Ready will not count anymore, with new rules you need approval from two delegate before you can make any proposal Ready.   Thanks for the info, I was not aware. I have submitted to the new-gov-temp-check discord and updated the proposal to the new template. I don’t know how to get approval from delegates or if there is anything else I’m missing, so please let me know if anything else is expected. I’d like this to go to vote on the 9/8 round.     alexcutlerdoteth:  There had been some discussion of shifting from a fixed quantity of $OP/week to a 1:1 match of $OP to $CRV emissions coming to Optimism…Was this adjustment considered and rejected?   We discussed the possibility of doing this, and actually resembles my initial idea for distribution. We decided a fixed quantity per week is preferable for simplicity. It provides certainty about how long the incentive program will last, and it avoids added complexity (also possible inaccuracy) of requiring an oracle or assuming a hardcoded relative value. I’m hoping to reduce as much friction as possible with this proposal. It should be easy for anyone to understand where the OP is going, how much, for how long etc. But if you have an alternative suggestion to the 50k OP/week for 20 weeks, I’d be interested to hear it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.301427738927739
                },
                {
                    "author_link": "https://gov.optimism.io/u/Niki",
                    "index": "60",
                    "likes": "0",
                    "time": "29/08/2022-04:13:50",
                    "content": "Curve s a nice project! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "61",
                    "likes": "0",
                    "time": "29/08/2022-10:09:04",
                    "content": "    WormholeOracle:  I don’t know how to get approval from delegates or if there is anything else I’m missing, so please let me know if anything else is expected   that is a good question, now the process is 3 weeks long.  feedback here from community. feedback from delegate in second week , once you have approval from 2 delegate, you can mark your proposal as ready voting  This is short summary, highly recommend to read in detail here: -Operating Manual of the Optimism Collective (v0.2.0) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4437500000000005
                },
                {
                    "author_link": "https://gov.optimism.io/u/alexcutlerdoteth",
                    "index": "62",
                    "likes": "0",
                    "time": "09/09/2022-12:51:44",
                    "content": " “We discussed the possibility of doing this, and actually resembles my initial idea for distribution. We decided a fixed quantity per week is preferable for simplicity. It provides certainty about how long the incentive program will last, and it avoids added complexity (also possible inaccuracy) of requiring an oracle or assuming a hardcoded relative value. I’m hoping to reduce as much friction as possible with this proposal. It should be easy for anyone to understand where the OP is going, how much, for how long etc. But if you have an alternative suggestion to the 50k OP/week for 20 weeks, I’d be interested to hear it.”  Do you have a sense of (roughly) what the avg dollar value is of weekly CRV emissions currently being directed to Optimism pools? That might help us understand how the ratio of rewards ($ in OP: $ in CRV) would look as currently written. Overall, I think it may still be worth considering adjusting the distribution mechanism to reflect (at least roughly) a 1:1 match of CRV emissions to OP emissions. This is the kind of thing that governance has pushed a lot protocol proposals on to ensure that the investment governance is making is being reciprocated. If you were to make that adjustment, it would be added incentive for veCRV voters to vote for Optimism pools (increasing emissions flowing into the Optimism ecosystem) as they would know the value of the rewards flowing to LPs would be doubled over other pools (boosting Curve’s overall TVL and fee generation). Since it sounds like bribes and fees will need to continue to flow to main-net for the time being, this would be a good way to show that this is about bringing more value to both Curve and Optimism versus being overly weighted one way or another. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.511666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "63",
                    "likes": "0",
                    "time": "12/09/2022-23:54:53",
                    "content": "Thanks for the proposal! Under the ‘Grant category:’ field, please specify which committee should review your proposal (NFTs and Gaming, Tooling, or DeFi). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/Defi_LATAM_axlvaz",
                    "index": "64",
                    "likes": "1",
                    "time": "19/09/2022-20:48:45",
                    "content": "    WormholeOracle:  Did the project apply for or receive OP tokens through the Foundation Partner Fund?: In Process If OP tokens were requested from the Foundation Partner Fund, what was the amount?: Undetermined, in process   Can you indicate exactly how much was requested from the Foundation Partner Fund? And on what date have you applied? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.125
                },
                {
                    "author_link": "https://gov.optimism.io/u/marko",
                    "index": "65",
                    "likes": "0",
                    "time": "23/09/2022-09:00:15",
                    "content": "Curve is one of the best project so far in blockchain. It will add value to Optimism and will bring new users. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0606060606060606
                },
                {
                    "author_link": "https://gov.optimism.io/u/WormholeOracle",
                    "index": "66",
                    "likes": "0",
                    "time": "24/09/2022-03:48:17",
                    "content": "No amount specified, I submitted information for someone from Optimism to contact Curve team and/or Discord support. To my knowledge, no one has gotten back to them yet. That was probably around mid-August. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "67",
                    "likes": "1",
                    "time": "24/09/2022-09:17:30",
                    "content": "Hi @WormholeOracle  Have you thought about deadlock ? Foundation might be waiting to see how this proposal is doing and you/we are waiting for foundation response. I would have loved to support this proposal in current form but even after my multiple request you did not summarize the feedback or asked for support from other delegates. I am not gonna jump to conclusion but this lack of engagement from Curve side does bring my confidence down in your proposal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.419444444444444
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPGovWatch",
                    "index": "68",
                    "likes": "1",
                    "time": "24/09/2022-13:45:44",
                    "content": "How will protocols with no veCRV positions to create gauges benefit from this grant? 25,000 OP/week for LPs is a lot. What percentage of incentives is Curve to match in CRV? What is the Curve roadmap on Optimism? How we avoid the fate of Curve on Fantom and Avalanche? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/WormholeOracle",
                    "index": "69",
                    "likes": "1",
                    "time": "24/09/2022-19:49:36",
                    "content": "Feedback summary is at the bottom of the proposal, as you requested, or did I misunderstand where feedback should be posted? I’m trying to navigate my way around Optimism’s governance process, but the expectations have been changing and I’m doing my best to keep up with it. I didn’t know I needed to solicit other delegates, or the best way to contact them? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.125
                },
                {
                    "author_link": "https://gov.optimism.io/u/theenlightened",
                    "index": "70",
                    "likes": "1",
                    "time": "24/09/2022-23:05:39",
                    "content": "You asked the right questions; thank you mate.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.428571428571428
                },
                {
                    "author_link": "https://gov.optimism.io/u/theenlightened",
                    "index": "71",
                    "likes": "1",
                    "time": "24/09/2022-23:08:06",
                    "content": "Curve is a great project but we shouldn’t be beclouded by that and not ask the right question(s) as to how ‘‘it’’ proposal will meaningfully aid the Optimism ecosystem. 1,000,000 $OP is a lot. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.642857142857142
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPGovWatch",
                    "index": "72",
                    "likes": "0",
                    "time": "25/09/2022-13:13:50",
                    "content": "To follow up here, the most recent Governance Update suggests the following:  It is not the intended purpose of the governance fund to retroactively fund public goods without an expectation of future work  What is the future work Curve is committing to?  To the extent that Ethereum has legitimate usage on L1, we should seek to migrate that usage to Optimism.  Can we expect to Curve to migrate governance, fees, and bribing capabilities to Optimism? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.416666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/Defi_LATAM_axlvaz",
                    "index": "73",
                    "likes": "0",
                    "time": "25/09/2022-23:30:42",
                    "content": "It would be helpful if someone from the foundation could update the status of the Curve proposal. @bobby @vonnie610 ? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/WormholeOracle",
                    "index": "74",
                    "likes": "0",
                    "time": "27/09/2022-00:09:23",
                    "content": "    OPGovWatch:  How will protocols with no veCRV positions to create gauges benefit from this grant?   You dont need veCRV to create a gauge. Anyone is welcome to create a proposal for a gauge that receives CRV emissions at gov.curve.fi. Protocols that have demonstrated a good track record and demand for their product generally have a good shot a passing a vote, even if they have no veCRV position.     OPGovWatch:  25,000 OP/week for LPs is a lot. What percentage of incentives is Curve to match in CRV?   25k/week, to be clear, is the total split between all gauged pools. Curve matches incentives based on veCRV gauge weighting, which is decentralized and therefore I’m unable to give a concrete percentage. If Optimism becomes the dominant network for liquidity and trading, gauge weighting will likely shift toward Optimism, and CRV emissions last for hundreds of years. We are in the bootstrapping phase now to draw initial liquidity.     OPGovWatch:  What is the Curve roadmap on Optimism?   I am not a Curve team member, so I can’t answer that authoritatively. What I believe personally is that liquidity should shift toward L2’s to achieve scalability. This article by Delphi Digital shows how Curve would be much more competitive in a low gas fee environment. Also, L2’s also make more dense metapools viable, for example a [tricrypto, 3pool] pool (ETH, BTC, USDT, USDC, DAI), which is too gas intensive for mainnet.     OPGovWatch:  How we avoid the fate of Curve on Fantom and Avalanche?   From what I see, the “fate of Fantom and Avalanche” was that these were alt L1’s that were uber-hyped during a bull market that favored the Ethereum killer narrative, and when I look at charts of TVL for other DeFi apps on those networks, it’s the same story. Avoiding the same fate really comes down to building a network that is resilient and scalable where people feel comfortable keeping most of their money. Again, my personal opinion is the L2’s are better positioned to become the dominant application layer after all the hype cycles.     OPGovWatch:  What is the future work Curve is committing to?   I’m not sure that your quote from the Governance Update applies to this situation. I would think that applies if a proposer is requesting compensation for a public good they’ve created for Optimism. Curve is also a public good, but the proposal is not requesting compensation to Curve for their work. This is entirely being passed onto LP’s, who are Optimism’s user base, many of whom are in this thread and who will directly benefit from an incentive program. Again, not a Curve team member, but I know Curve has plans to add features to Optimism in the future. That includes a V2 pool factory and CRV LP boosting capability.     OPGovWatch:  Can we expect to Curve to migrate governance, fees, and bribing capabilities to Optimism?   Migrating core governance probably wont be on the table for the forseeable future for security reasons. What I imagine could be possible in the medium term as cross chain interoperability improves, a user’s voter power could be read from main net and used to allocate fees and bribes directly on Optimism. Curve is limited currently by the rudimentary tools available to access data across chains, which is a big pain point for all of DeFi right now. ",
                    "links": [
                        "https://members.delphidigital.io/reports/uniswap-vs-curve-which-is-the-best-dex/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.739836410754778
                },
                {
                    "author_link": "https://gov.optimism.io/u/WormholeOracle",
                    "index": "75",
                    "likes": "3",
                    "time": "27/09/2022-00:20:59",
                    "content": "I’ve been informed that I missed cycle 6 because there need to be two delegates that verbalize support for the proposal before it goes to vote. So I have edited the title to [DRAFT] and specified this is for cycle #7. I’ve worked hard and long to write, revise, and engage with this proposal process, I would love it if delegates would be willing to offer their support to bring this to a vote. If you’re willing to offer support conditionally, let me know what you need to see first and I’m happy to work it out with you. I’m only being diligent about this proposal because I believe this is a good deal for both Optimism and Curve. If I thought it was value extractive and only benefits Curve, I wouldn’t even bother with it. This OP is 100% going back to Optimism users and seeks to bootstrap liquidity and trade activity on Optimism. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.09469696969697
                },
                {
                    "author_link": "https://gov.optimism.io/u/diligit",
                    "index": "76",
                    "likes": "1",
                    "time": "27/09/2022-07:27:35",
                    "content": "I appreciate your proposal for the full information. Please update your proposal according to this template, and the information that you are applying for cycle #7 is indicated in the proposal description, not in the title, (see template). And probably the proposal is applicable for the DeFi committee. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPGovWatch",
                    "index": "77",
                    "likes": "0",
                    "time": "28/09/2022-13:32:53",
                    "content": "Thank you for the replies @WormholeOracle. For the next version of the proposal, I would suggest either finding a way to bring further details or commitments around co-incentives (or other investments into Optimism) or significantly lowering the initial ask. It might also help to review a few other protocol’s successful proposals and the discussion around them. Generally speaking, governance has insisted on more details on co-incentives than is currently being offered in this proposal. I understand why that might be challenging given Curve’s design, but it seems critical given the size of the ask. Just as one example, here was the passed proposal from Balancer & Beethoven.     [READY] [GF: Phase 1 Proposal] Balancer & BeethovenX Governance Fund: Phase 1       Project Name: BeethovenX, powered by Balancer  Author Name: Solarcurve (BalancerDAO contributor, BeethovenX advisor)  Number of OP tokens requested: 500,000  L2 Recipient Address: 0x2a185C8A3C63d7bFe63aD5d950244FFe9d0a4b60  Relevant Usage Metrics: Balancer has ~$1.4B TVL and does ~$500M volume per week. This is the network OP incentives would be competing in through the veBAL gauge vote.  Currently on OP we have ~$4.8M TVL, ~$500k daily volume, ~$3-4k daily fees,  ~2k daily tx’s.  Balancer & Bee…     ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.611842105263158
                },
                {
                    "author_link": "https://gov.optimism.io/u/WormholeOracle",
                    "index": "78",
                    "likes": "1",
                    "time": "28/09/2022-16:47:38",
                    "content": "Hi @OPGovWatch If you are more agreeable to it, I would revise the distribution to instead be used to bribe gauge weighting from veCRV. That would alleviate your concern on co-incentives, as you can get expect >$1 emissions per $1 of bribe. It is commonly cited as the more efficient method of attracting TVL, and is the strategy proposed in Balancer’s proposal. If this strategy provides greater assurance to Optimism that both parties will carry their weight, I will propose to evenly split the weekly distribution on bribes between all gauged pools on Optimism. How does that sound to you? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.6000000000000005
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPGovWatch",
                    "index": "79",
                    "likes": "0",
                    "time": "28/09/2022-16:54:03",
                    "content": "An interesting idea! Is bribing with OP possible on Curve? I do not believe it can be bridged. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5625
                },
                {
                    "author_link": "https://gov.optimism.io/u/0xTrevor",
                    "index": "80",
                    "likes": "0",
                    "time": "28/09/2022-17:23:28",
                    "content": "    theenlightened:  Curve is a great project   Curve is a great project! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/WormholeOracle",
                    "index": "81",
                    "likes": "0",
                    "time": "28/09/2022-17:30:48",
                    "content": "Yeah, so you might like this! I’m speaking with Votium team, they say they can setup deposit and claim contracts on Optimism, and they generate a merkle proof for voter distribution. Voters can then claim OP directly from Optimism ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPGovWatch",
                    "index": "82",
                    "likes": "1",
                    "time": "28/09/2022-17:45:54",
                    "content": "I think this would represent a substantial improvement on the proposal if it can be implemented! Though I might still suggest the overall ask be brought to something more in line with the Balancer / Beethoven grant. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/Capt-Holt",
                    "index": "83",
                    "likes": "0",
                    "time": "29/09/2022-11:19:23",
                    "content": "Both are very different. One has more use in the market, its use is bigger. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPGovWatch",
                    "index": "84",
                    "likes": "0",
                    "time": "29/09/2022-15:49:27",
                    "content": "You are correct. However, if you look at the proposals that have passed most recently you will see that a 1,000,000 OP is an extremely high ask especially for LP incentives which have often been contentious. I think a lower ask would make it more likely the proposal will receive delegate endorsements and committee approvals. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.966666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/WormholeOracle",
                    "index": "85",
                    "likes": "1",
                    "time": "30/09/2022-05:11:34",
                    "content": "Please review updated proposal, which changes distribution from liquidity mining to vote incentives, and reduces requested OP. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPGovWatch",
                    "index": "86",
                    "likes": "0",
                    "time": "30/09/2022-14:45:54",
                    "content": "Thank you. I am reviewing now. Would it be possible to add an Optimism gauge for a TriCrypto pool and ensure it is bribed as well? That would benefit the whole ecosystem. How would these incentives appear within Votium? Would they appear as bribes? Would their auto-vote optimizer distribute votes accordingly? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/WormholeOracle",
                    "index": "87",
                    "likes": "0",
                    "time": "01/10/2022-07:37:03",
                    "content": "Yes Tricrypto pool is going to be deployed soon, which I’m sure will quickly be followed by gauge vote, so will be eligible to receive bribes. Incentives appear as rewards in Votium for voting on a specific gauge. Votium has two services, one pays to CVX and the other to veCRV. They have tens of millions of CVX delegated to them, so would auto optimize votes with CVX. But veCRV there is no delegation, so voters would have to actively vote. OTOH, bribes are more crowded on CVX, so it’s possible you get a better deal going with veCRV. I don’t have a strong preference for one or the other, sounds like maybe Votium’s auto optimizer is more appealing to you? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.201388888888889
                },
                {
                    "author_link": "https://gov.optimism.io/u/WormholeOracle",
                    "index": "88",
                    "likes": "1",
                    "time": "05/10/2022-01:33:15",
                    "content": "Hi @OPUser, @MinimalGravitas, @katie:  I’m not asking for officially Sponsorship or approval of proposal but I just need verbal delegate support so that my proposal can get proper committee review for cycle-7. Thank you ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/mastermojo",
                    "index": "89",
                    "likes": "1",
                    "time": "05/10/2022-01:50:28",
                    "content": "I am an Optimism delegate [Delegate Commitments - #65 by mastermojo ] with sufficient voting power, and I believe this proposal is ready to move to a vote. ",
                    "links": [
                        "https://gov.optimism.io/t/voting-cycle-7-roundup/3586/13"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/mastermojo",
                    "index": "90",
                    "likes": "1",
                    "time": "05/10/2022-01:51:34",
                    "content": "Remember the Synthetix Ambassadors are Delegates too. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Defi_LATAM_axlvaz",
                    "index": "91",
                    "likes": "0",
                    "time": "05/10/2022-02:02:37",
                    "content": "    WormholeOracle:  L2 Recipient Address: [Work in Progress]   can make available address ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.125
                },
                {
                    "author_link": "https://gov.optimism.io/u/SEED_LATAM_Joxes",
                    "index": "92",
                    "likes": "0",
                    "time": "05/10/2022-02:07:19",
                    "content": "Hi @WormholeOracle     WormholeOracle:  L2 Recipient Address: [Work in Progress]   I strongly suggest add an L2 recipient before going forward or receive any approval, just for safety. Thanks! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.888888888888888
                },
                {
                    "author_link": "https://gov.optimism.io/u/WormholeOracle",
                    "index": "93",
                    "likes": "1",
                    "time": "05/10/2022-02:53:53",
                    "content": "@Defi_LATAM_axlvaz @SEED_LATAM_Joxes Thank you, I’ve made recipient address available. It’s a gnosis safe composed of long time Cure community members who manage an organization called veFunder, which is a small scale grants org that creates bounties and compensates individuals for their work. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/katie",
                    "index": "94",
                    "likes": "2",
                    "time": "05/10/2022-03:13:50",
                    "content": "I am an Optimism delegate [Delegate Commitments - #18 by katie] with sufficient voting power and I believe this proposal is ready to move to a vote. ",
                    "links": [
                        "https://gov.optimism.io/t/voting-cycle-7-roundup/3586/13"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPGovWatch",
                    "index": "95",
                    "likes": "2",
                    "time": "05/10/2022-13:11:42",
                    "content": " 0x3AC79C427F2c6C015E791Cd6ad2578225ed5B6a6 (3/5 Multisig composed of Curve community members: Wormhole, Chanho, Naga, Amadeo, and Knows. Members are all involved with the veFunder Curve bounties program)  So this grant is not actually going to anyone associated with the Curve Team? I’m not sure there is a precedent for this. Why was this only disclosed at the last minute? Is there a legal entity associated with the group requesting the grant? Are the members willing to KYC? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.166666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPGovWatch",
                    "index": "96",
                    "likes": "1",
                    "time": "05/10/2022-14:10:50",
                    "content": "I think this proposal likely needs to edited to reflect that the project/team requesting the grant is actually veFunder not Curve. There is nothing intrinsically wrong with a project requesting funds to support another project but I think that distinction needs to be clear in the proposal. The risk profile feels higher to me if Curve is not reputationally on the hook for the proper management and distribution of the 720,000 OP. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.875
                },
                {
                    "author_link": "https://gov.optimism.io/u/TommyGenesis",
                    "index": "97",
                    "likes": "1",
                    "time": "05/10/2022-21:06:07",
                    "content": "Hi, Tommy from Votium here. The incentives would appear as voter rewards (commonly referred to as “bribes”). The depositing address would have the choice of rewarding non-Convex veCRV voters, and/or Convex vlCVX voters. As WormholeOracle mentioned, we are able to optimize vlCVX votes through delegation, but we are unable to do the same for veCRV votes. Currently we are deployed to mainnet for veCRV and vlCVX, and also on fantom for vlCVX. We haven’t deployed to other networks due to a lack of previous demand. Thank you to the proposal authors and to the optimism team for your interest. We are on board to deploy on Optimism to help bring volume to Curve<->Optimism! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.970833333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "98",
                    "likes": "0",
                    "time": "06/10/2022-11:24:58",
                    "content": "Hi Tommy, happy to see you here.  will it be possible to put a estimate date on deployment ? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/TommyGenesis",
                    "index": "99",
                    "likes": "0",
                    "time": "08/10/2022-02:18:12",
                    "content": "Deployment shouldn’t take more than a week or so. Changes to UI might be a tad bit longer due to scheduling, maybe about 30 days give or take. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9375
                },
                {
                    "author_link": "https://gov.optimism.io/u/theenlightened",
                    "index": "100",
                    "likes": "0",
                    "time": "08/10/2022-10:05:44",
                    "content": "I hope these concerns are well addressed at the committee review level since 2 delegates have already pushed it up.The reply from Tommy below in my opinion did not address the concerns raised. There should be a good precedence. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPGovWatch",
                    "index": "101",
                    "likes": "0",
                    "time": "08/10/2022-13:33:56",
                    "content": "The proposal will be resubmitted as core details as to who the requesting parties were changed after the delegate approvals. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/WormholeOracle",
                    "index": "102",
                    "likes": "1",
                    "time": "08/10/2022-15:45:11",
                    "content": "I’m changing the proposal back to [DRAFT] and going to update the recipient address. There has been confusion about the distinction between Curve team/community, who is veFunder and are they endorsed by Curve? Curve has tweeted a response to these questions that acknowledges the proposal and endorses veFunder multisig as a good recipient address:   twitter.com    Curve Finance @CurveFinance  Some noticed that this proposal about OP grant for @optimismFND is coming not from Curve team but from the community.  Curve team cannot legally be a financial intermediary even for this one. The best is to fund a smart contract directly, or the multisig.  gov.optimism.io/t/review-gf-ph…   8:21 PM - 6 Oct 2022           42                13            However, we’ve discussed more on the possibility of doing this with a trustless contract, which would alleviate any questions about who the recipient is. A Curve core dev is writing and deploying the contract. To be clear, the requesting party of this grant is Curve, and that won’t be changed. This method to receive grant funds trustlessly can also be referenced in the future for other teams who have legal concerns around custody of user funds, or who are unable to kyc. ",
                    "links": [
                        "https://twitter.com/CurveFinance/status/1578118369437712384?s=20&t=YmiynVVry_6s1U-GO1tjkw",
                        "https://twitter.com/CurveFinance/status/1578118369437712384?s=20&t=YmiynVVry_6s1U-GO1tjkw",
                        "https://twitter.com/optimismFND",
                        "https://gov.optimism.io/t/review-gf-phase-1-proposal-curve/3089",
                        "https://twitter.com/CurveFinance/status/1578118369437712384?s=20&t=YmiynVVry_6s1U-GO1tjkw"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9122023809523805
                },
                {
                    "author_link": "https://gov.optimism.io/u/katie",
                    "index": "103",
                    "likes": "2",
                    "time": "09/10/2022-15:45:25",
                    "content": "I am withdrawing my approval of this proposal due to significant changes being made after receiving delegate approval. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://gov.optimism.io/u/WormholeOracle",
                    "index": "104",
                    "likes": "2",
                    "time": "14/10/2022-05:13:38",
                    "content": "Proposal has been updated with some important information: Curve has deployed a cross-chain governance solution that allow it to trustlessly manage OP on Optimism. The recipient address has been updated to be the L2 vault contract. Votium has deployed its contracts for vote incentivization on Optimism. This allows any protocol to deposit incentives for any Curve gauge, and veCRV voters can claim rewards after voting for respective gauges. Proposal is seeking to be included in cycle-8. ",
                    "links": [
                        "https://optimistic.etherscan.io/address/0xD166EEdf272B860E991d331B71041799379185D5"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPenthusiast",
                    "index": "105",
                    "likes": "0",
                    "time": "16/10/2022-08:16:00",
                    "content": "Voting no due to the confusion and lack of clarity about the author and where the responsibility of this proposal is from as pointed out by many others. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.40625
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPGovWatch",
                    "index": "106",
                    "likes": "0",
                    "time": "22/10/2022-15:29:48",
                    "content": "Will bribing on Optimism be available for all protocols? Or will it only be used for this grant? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/GFXlabs",
                    "index": "107",
                    "likes": "0",
                    "time": "25/10/2022-19:13:01",
                    "content": "I am an Optimism delegate with sufficient voting power and I believe this proposal is ready to move to a vote. ",
                    "links": [
                        "https://gov.optimism.io/t/voting-cycle-8-roundup/3742/13"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/mastermojo",
                    "index": "108",
                    "likes": "0",
                    "time": "25/10/2022-19:16:45",
                    "content": "I am one of the Synthetix Ambassadors, and a member of the Defi Shadow Committee. I am an Optimism delegate [Delegate Commitments - #65 by mastermojo ] with sufficient voting power, and I believe this proposal is ready to move to a vote. ",
                    "links": [
                        "https://gov.optimism.io/t/voting-cycle-8-roundup/3742/13"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/TommyGenesis",
                    "index": "109",
                    "likes": "0",
                    "time": "01/11/2022-23:41:03",
                    "content": "Available for all protocols. For now, only $OP is whitelisted for deposits, but we are open to adding other assets as well, so long as they meet our liquidity requirements for listing. Due to minimum vote requirements on Convex, for now we’ve only added Optimism for veCRV votes per a conversation with the proposal authors, but we are still open to adding it for vlCVX down the road if there is demand for it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.072222222222223
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "110",
                    "likes": "2",
                    "time": "02/11/2022-20:39:59",
                    "content": "Recommendation from DeFi committee C Details Detailed proposal to distribute a fixed quantity of Op per week. Distribution depends somewhat on pools & veCRV voters. Value-Add Curve is already very well established as a key DeFi platform and is integrated with many other projects. Strong market fit has been demonstrated. Traction Roughly 4,000 addresses have used Curve on Optimism and the current TVL is ~$56 million. Very strong track record on all counts. Amount 504,828 OP 42,069 OP/Week for 12 weeks between 5 gauges Co-incentives Yes, but variable based on veCRV voting. Alignment Not Optimism native, but states that their goals and future success depend on the reduced fees available on L2. Already deployed on a lot of L1s and L2s, Votium deplyment is alligned with OPtimism KPIs TVL growth & Market Share on Optimism Recommendation:- YES Although $OP requested by this grant is focused towards liquidity, we are happy to support.  Target L1 applications with PMF - Foundation Guidelines  From last community call, it seems protocol trusted protocol, like AAVE, are more successful with OP grant and as a time tested protocol Curve has earned community trust.  Our past recommendation is available on committee recommendation thread ",
                    "links": [
                        "https://gov.optimism.io/t/governance-update-4/3435",
                        "https://drive.google.com/file/d/1xJbicknAAN43jMQK4caN9ju3aJwHvbm7/view",
                        "https://gov.optimism.io/t/defi-committee-c-season-2-recommendations/3437",
                        "https://gov.optimism.io/t/defi-committee-c-season-2-recommendations/3437/12",
                        "https://gov.optimism.io/t/gfx-labs-delegate-communication-thread/2728/19"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.317916666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "111",
                    "likes": "0",
                    "time": "03/11/2022-20:13:14",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "112",
                    "likes": "0",
                    "time": "03/11/2022-20:50:21",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/katie",
                    "index": "113",
                    "likes": "1",
                    "time": "07/11/2022-18:25:38",
                    "content": "Voted yes - Following Defi Committee C recommendation and appreciate feedback being incorporated and the proposal being updated, thank you! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "114",
                    "likes": "1",
                    "time": "09/11/2022-13:33:21",
                    "content": "I am going to follow committee recommendation here and vote for this. Nice to see the team take feedback into account and looking forward to seeing the implementation of this proposal.     OPUser:  Details Detailed proposal to distribute a fixed quantity of Op per week. Distribution depends somewhat on pools & veCRV voters. Value-Add Curve is already very well established as a key DeFi platform and is integrated with many other projects. Strong market fit has been demonstrated. Traction Roughly 4,000 addresses have used Curve on Optimism and the current TVL is ~$56 million. Very strong track record on all counts. Amount 504,828 OP 42,069 OP/Week for 12 weeks between 5 gauges Co-incentives Yes, but variable based on veCRV voting. Alignment Not Optimism native, but states that their goals and future success depend on the reduced fees available on L2. Already deployed on a lot of L1s and L2s, Votium deplyment is alligned with OPtimism KPIs TVL growth & Market Share on Optimism Recommendation:- YES Although $OP requested by this grant is focused towards liquidity, we are happy to support.  Target L1 applications with PMF - Foundation Guidelines   From last community call, it seems protocol trusted protocol, like AAVE, are more successful with OP grant and as a time tested protocol Curve has earned community trust.    ",
                    "links": [
                        "https://drive.google.com/file/d/1xJbicknAAN43jMQK4caN9ju3aJwHvbm7/view"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.505701754385965
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "115",
                    "likes": "0",
                    "time": "14/11/2022-16:45:40",
                    "content": "Snapshot vote - passed ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "116",
                    "likes": "0",
                    "time": "14/11/2022-16:46:13",
                    "content": "@WormholeOracle can you provide a Telegram handle or other contact method so the Optimism team can get in touch about paying out this grant! Feel free to comment on this thread, DM, or email palash@optimism.io ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.609375
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "117",
                    "likes": "0",
                    "time": "14/11/2022-16:46:16",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "175"
}