{
    "poll_list": [
        {
            "id": "0x1fda82a16813cb299b031a6a543550f2cd792dd47168671519d9ae5d40351667",
            "title": "Season 2 Governance Fund Proposal: Revert Compoundor",
            "discussion": "https://gov.optimism.io/t/ready-gf-phase-1-revert-finance-compoundor/3242",
            "body": "This Governance Fund Phase 1 proposal is eligible for voting in Cycle 6. For a complete list, check out [Voting Cycle 6 Roundup](https://gov.optimism.io/t/voting-cycle-6-roundup/3481).\n\nThis proposal is slated for review and recommendation by [committee name/link]. Please refer to [their thread] for this cycle to read more. Committees will post their recommendations by the 3rd day of the Voting Week. \n\nAs a reminder, since this is the first vote since the [introduction of committees](https://gov.optimism.io/t/introducing-governance-committees/3238): by approving committees, the Token House entered a social contract to entrust and delegate the bulk of decision-making to the committee. Therefore, any delegates voting against the committee recommendation are expected to provide a justification to the community as to why they voted differently.",
            "choices": [
                "For",
                "Against",
                "Abstain"
            ],
            "scores": [
                11474458.213862265,
                58354.464823150185,
                58099.58384871468
            ],
            "start": 1663873702,
            "end": 1664392102,
            "snapshot": "24630097",
            "state": "closed",
            "author": "0x47C88bb92B409fF25F6587EA611fac4e55f76007",
            "space": {
                "id": "opcollective.eth",
                "name": "Optimism Collective"
            }
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/ready-gf-phase-1-revert-finance-compoundor/3242",
            "title": "[READY] [GF: Phase 1] Revert Finance Compoundor ",
            "index": 3242,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Governance Fund: Phase 1"
            ],
            "tags": [
                "cycle-6",
                "passed"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/mariorz",
                    "index": "1",
                    "likes": "11",
                    "time": "06/08/2022-20:31:06",
                    "content": "Project Name: Revert Compoundor Author Name: @mariorz I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: Yes, grant recipient is Revert Labs Inc. L2 Recipient Address: 0x8cadb20a4811f363dadb863a190708bed26245f8 Grant category: Governance Fund, Phase 1 Is this proposal applicable to a specific committee? Yes, the proposal falls under the DeFi committee. Perhaps also the Tooling Committee if they are willing to review. Project description: Revert’s mission is to build powerful analytic tools for liquidity providers in AMM protocols while keeping them open and accessible by everyone. This proposal focuses on the “Revert Compoundor” a protocol to automate compounding of fees for LPs on Uniswap v3. The Revert auto-compounder allows LPs to automate the compounding of the accrued fees in exchange for a fixed percentage of the compounded fees. This serves to incentivize a maximum number of compounds at optimal times with regards to gas costs. Depending on the fee APR and size of positions this can significantly improve returns. Project links:  Website: https://revert.finance/  Gitcoin: Revert | Grants | Gitcoin  Docs: Auto-compounder - Revert  Whitepaper: Revert Compoundor - HackMD  Twitter: https://twitter.com/revertfinance  Discord/Discourse/Community: Discord  Please include all other relevant links below: Revert on Defilama   Additional team member info: Founder: @mariorz Relevant Usage Metrics:   Revert Compoundor:  $1,500,000 USD across all chains, latest TVL can be checked on Defi Llama $200,000 on Optimism    Revert App Connected accounts:  Over $940,000,000 USD across all chains Over $2,000,000 USD on Optimism    Is this project be open sourced? Yes, the compoundor contract and related projects (comopoundor-js) are open sourced along side other open sourced repos Revert · GitHub Optimism native?: No Date of deployment/expected deployment on Optimism: Revert Compoundor has been live on Optimism since July 18th. Ecosystem Value Proposition: Our mission is to build powerful tools for liquidity providers in AMM protocols. We believe AMMs are going to become a fundamental part of financial markets in the coming years, this will create new investment opportunities for retail investors but will also require open, transparent, and accessible tools for everyone. Optimism, by lowering gas costs, makes LPing more accessible to a much larger number of users, also making more active strategies viable for non-whales, which in turn makes tools like the sort we build required by a larger number of users.  So far we’ve built and integrated with Optimism the following tools:  Uniswap v3 position analytics Uniswap v3 initiator: backtest and initiate positions on Uniswap v3 https://revert.finance/#/initiator?fee&network=optimism&token0&token1   Top positions: browse top performing v3 positions and filter/sort by different criteria Compoundor: Protocol to automate compounding of LP fees for Uniswap v3 positions This is what we are hoping to incentivize in driving liquidity towards Optimism. More info on our docs: https://docs.revert.finance    Has your project previously applied for an OP grant? No Number of OP tokens requested: 240,000 After reviewing other incentivized projects, we believe this is a reasonable amount to validate the strategy proposed with the goal of migrating sticky liquidity from mainnet towards Optimism. With ~300,000K USD to distribute over a 3 month period we believe we should be able to increase Uniswap liquidity on Optimism by over ~20m USD (total liquidity is currently around 60m). This would be measurable separate from Uniswap growth by measuring the TVL of the Revert Compoundor itself. Did the project apply for or receive OP tokens through the Foundation Partner Fund?: We have not. How much will your project match in co-incentives?: We have already done the heavy lifting in the sense that we are fully integrated with Optimism. But we will promote the OP rewards program with our users and the expected APR improvements in migrating their existing liquidity and make that as easy as possible. Revert will also contribute with a significant marketing push over our community and user base by promoting this program on our Twitter account, Discord server, Mirror blog, and more importantly in-product, highly directed, communication on our app. Proposal for token distribution:   How will the OP tokens be distributed? 100% will go to Uniswap v3 LPs on the Revert Compoundor Protocol on Optimism.  All LPs will be eligible to join the program, except team wallets which will be excluded. The distribution will be done in tranches via merkle airdrops. We will iterate on the criteria and parameters for the distribution, but they will be based on TVL, compounded amounts, and forms of vesting or minimum timeframes.  The specific criteria and scripts will of course be made public. We will likely favor popular assets, or otherwise make sure valueless pairs are not a vector for exploiting the program.   Over what period of time will the tokens be distributed?  We are targeting 3 months, but we will adjust the period to try to incentivize more sticky liquidity as we learn from the results. Also explained in the previous answer.    How will this distribution incentivize usage and liquidity on Optimism?  It will make LPing any specific asset pair on Optimism more attractive, particularly more so for positions with a high fee-apr which would imply in-range liquidity and pools that have low liquidity relative to volume. In other words it will incentivize liquidity in Uniswap in the pools and ranges where it is more needed.    Why will the incentivized users and liquidity remain after incentives dry up?  Ultimately we believe our users as LPs will flow towards the pools that offer the best returns. However, because compounding has a cost of gas and compoundor (keeper) fees, there is a period until using the autocompoundor reaches break-even. In general our protocol is more attractive to positions that have longer time frame expectations. We go into this in our whitepaper. We will target the distribution rate of the rewards so that it incentivizes existing liquidity on Ethereum towards the Optimism pools, without being high enough to attract temporary “farming” liquidity. So the period over which the period will be distributed will be adjusted accordingly. We will also analyze and share the results of the incentives program, in terms of attracting long-term liquidity to Optimism, as a case study from which we can all learn from.    Please list the milestones/KPIs you expect to achieve for each initiative, considering how each relates to incentivizing sustainable usage and liquidity on Optimism.  With the requested amount, we expect to increase Compoundor TVL on Optimism by at least 20m. We will evaluate and publish results of 3 iterations of setting and parameters to maximize the amount of sticky liquidity we can bring to Optimism.    Please provide any additional information that will facilitate accountability: Revert Compoundor Address: 0x5411894842e610C4D0F6Ed4C232DA689400f94A1 ",
                    "links": [
                        "https://gitcoin.co/grants/2983/revert",
                        "https://docs.revert.finance/revert/auto-compounder",
                        "https://hackmd.io/@revert/BJcGIJQ35",
                        "https://twitter.com/revertfinance",
                        "https://discord.gg/HXfxKHrRmf",
                        "https://defillama.com/protocol/revert-compoundor",
                        "https://twitter.com/mariorz",
                        "https://github.com/revert-finance",
                        "https://revert.finance/#/initiator?fee&network=optimism&token0&token1",
                        "https://docs.revert.finance/",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/9",
                        "https://gov.optimism.io/t/protocol-delegation-self-nominations/4357/8",
                        "https://gov.optimism.io/t/defi-latam-delegate-communication-thread/2950/8",
                        "https://gov.optimism.io/t/gfx-labs-delegate-communication-thread/2728/16",
                        "https://gov.optimism.io/t/defi-shadow-committee-b-season-2-recommendations/3549/3",
                        "https://gov.optimism.io/t/voting-cycle-6-roundup/3481/11"
                    ],
                    "GPT-summary": "The post is a proposal for a grant from the Optimism Foundation for the Revert Compoundor, a protocol to automate compounding of fees for liquidity providers on Uniswap v3. The proposal includes information on the project, its mission, usage metrics, and ecosystem value proposition. The author explains how the grant will be used to incentivize liquidity on Optimism and provides details on the token distribution and milestones/KPIs. The post does not include any negative feedback or constructive criticism.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Interoperability and Scaleability",
                        "Smart contract updates",
                        "Community and engagement",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.842709563164109
                },
                {
                    "author_link": "https://gov.optimism.io/u/MinimalGravitas",
                    "index": "2",
                    "likes": "4",
                    "time": "09/08/2022-20:44:42",
                    "content": "Hi Mariorz, thanks for posting this proposal. The analytics side of things looks really interesting, and I can see why this would be useful especially for Uniswap V3 which does make liquidity providing more complex than it used to be! Please can you help me understand your TVL, I’m obviously missing some fundemental concept, but what exactly is it measuring? Is it the positions that have been set up using the ‘Initiator’, or ‘Compoundor’ or both? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving positive feedback on proposal"
                    ],
                    "Sentiment": 5.734375
                },
                {
                    "author_link": "https://gov.optimism.io/u/clooz",
                    "index": "3",
                    "likes": "0",
                    "time": "09/08/2022-21:05:16",
                    "content": "It’s cool Opt nft maxis should have at least a tiny room ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.083333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/mariorz",
                    "index": "4",
                    "likes": "1",
                    "time": "09/08/2022-21:39:19",
                    "content": "Hi @MinimalGravitas, thank you! The TVL is tracking the value of Uniswap v3 positions that have activated auto-compounding with the Compoundor protocol and by doing so moved their position into the Compoundor contract. Positions that have been started using the initiator would be a seperate metric. For more clarity, as proposed the OP rewards would be distributed to LPs with positions on the Compoundor protocol on Optimism, not those that were started using the initiator. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/MinimalGravitas",
                    "index": "5",
                    "likes": "1",
                    "time": "10/08/2022-18:48:12",
                    "content": "Thanks for the clarification. It seems then that the amount of OP you’re requesting is quite a lot higher than your TVL. On the other hand you are growing really quickly and it seems like your metrics are already out of date… DeFi Llama is showing ~$930k across all chains and ~$230k on Optimism (up over 40% in 4 days). I guess if that carries on then the 300,000 OP you’re requesting might seem much more reasonable by the time the next season of proposal voting happens, however as it stands the amount requested seems out of proportion.     mariorz:  We will target the distribution rate of the rewards so that it incentivizes existing liquidity on Ethereum towards the Optimism pools   This goal sees pretty well defined, and probably a win-win for your users as once they are on optimism the benefit of lower gas fees presumably will keep them here after rewards run out. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.005208333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/mariorz",
                    "index": "6",
                    "likes": "1",
                    "time": "11/08/2022-04:09:11",
                    "content": " I guess if that carries on then the 300,000 OP you’re requesting might seem much more reasonable by the time the next season of proposal voting happens, however as it stands the amount requested seems out of proportion.  Fair point. The way I’m thinking about it is that regardless of our current TVL on Optimism, the rate at which it would be distributed would be adjusted to incentivize migration of liquidity without being too high where it would attract more temporary liquidity. So perhaps it would take us a year to distribute the OP given that constraint. But certainly reducing the amount of OP requested sounds reasonable.  This goal sees pretty well defined, and probably a win-win for your users as once they are on optimism the benefit of lower gas fees presumably will keep them here after rewards run out.  I think so as well. Would also like to highlight the aspect of us analyzing and sharing the results of the proposed OP distribution with the above goals in mind. Analytics is at the core of what we do, and have previously done analysis on liquidity incentives programs https://medium.com/@revert_finance/onetickdao-eth-and-the-narrow-rangers-f9a376f7f0c9 Appreciate the feedback above! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.983699633699634
                },
                {
                    "author_link": "https://gov.optimism.io/u/mariorz",
                    "index": "7",
                    "likes": "1",
                    "time": "17/08/2022-21:44:30",
                    "content": "Hi folks just wanted to update the post with a security update that might be relevant given that our protocol is quite new. We just finished an audit process with PeckShield publications/PeckShield-Audit-Report-Revert-Compoundor-v1.0.pdf at master · peckshield/publications · GitHub The issues raised were informational and of low severity, and have also been addressed. More info here https://twitter.com/revertfinance/status/1560014215292882945 ",
                    "links": [
                        "https://twitter.com/revertfinance/status/1560014215292882945"
                    ],
                    "GPT-discussion-categories": [
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.295454545454545
                },
                {
                    "author_link": "https://gov.optimism.io/u/Defi_LATAM_axlvaz",
                    "index": "8",
                    "likes": "1",
                    "time": "18/08/2022-00:54:28",
                    "content": "I have had the opportunity to join the Revert team in the communities! Great tool. Very good that you are in Optimism ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.275
                },
                {
                    "author_link": "https://gov.optimism.io/u/mariorz",
                    "index": "9",
                    "likes": "1",
                    "time": "23/08/2022-22:28:31",
                    "content": "Hey folks, appreciate the feedback we’ve gotten so far. In particular @MinimalGravitas suggested we reduce the ask amount. Following suggestion have made the following updates:   Reduced the asked amount from 300,000 OP to 240,000 OP   Added app metrics of people using our analytics solutions to manage their positions. Admittedly not verifiable by a 3rd party so originally did not want to include, but hoping it might help show we believe with the OP incentives in place we could move a lot of liquidity from mainnet to OP   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.534722222222222
                },
                {
                    "author_link": "https://gov.optimism.io/u/mariorz",
                    "index": "10",
                    "likes": "0",
                    "time": "29/08/2022-18:42:25",
                    "content": "Following the guidelines for proposal creation here: Governance Fund Phase 1: How to Create a Proposal  and incorporating the feedback received here, changing the proposal from DRAFT to READY so that it may be included in the next round of votes. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/GFXlabs",
                    "index": "11",
                    "likes": "2",
                    "time": "09/09/2022-14:57:59",
                    "content": "GFX Labs would like to see this come up for a vote when the author is ready We are an Optimism delegate with sufficient voting power and we believe this proposal is ready to move to a vote. ",
                    "links": [
                        "https://gov.optimism.io/t/voting-cycle-6-roundup/3481/11"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "12",
                    "likes": "1",
                    "time": "11/09/2022-05:29:45",
                    "content": "Hey, big fan. On this proposal, I appreciate the short horizon and your commitment to the consistent evaluation and adjustment of distribution settings. To date there’s been, imo, overreliance on longer timeframes and larger disbursements when we’re working off limited data. The one thing I’m curious about is how you work out the effect of incremental incentives on TVL. Let’s say you do 80k OP per month as incentives. How do these incentives get Compoundor to add 20 mm TVL, and on which pools? And given your existing crosschain footprint, have you seen evidence of new capital bridging chains when certain pools become especially favorable? (Understood if not enough data’s been accumulated to make any real determinations.) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.286009445100354
                },
                {
                    "author_link": "https://gov.optimism.io/u/cryptokitty",
                    "index": "13",
                    "likes": "0",
                    "time": "11/09/2022-18:11:51",
                    "content": "  twitter.com    revert 🦇🔊 @revertfinance  @BP_Gamma @Uniswap Oh lies, how unsurprising. Explicitly told you would not integrate your protocol and you insisted on giving us the \"a grant\". Dumped those tokens promptly after you accused me of publishing my own research. If you were more successful you'd be a liability to this industry.   9:19 PM - 10 Sep 2022           1            Hey @mariorz.  This a concerning tweet that was posted by your account on Twitter recently.  It seems like you had a spat with another protocol (Gamma Strategies) which gave you a grant for a revert integration, but you never provided the service due to some unrelated conflict regarding publishing rights. You stated that you “dumped” those tokens and had no intention of providing the integration. Can you explain why you didn’t simply return the grant funds if you had no intention of fulfilling the service? If you didn’t provide the integration, but simply dumped the tokens, doesn’t that equate to stealing?   The publishing dispute should not have given you the right to take grant funds without providing the service. You could have simply returned the grant funds correct?  After you dumped the tokens, did you pocket the proceeds or return them? I think we need to have these questions answered given that this is another grant on a larger scale. Edit: Did some more digging and it seems like you had the intention of doing the integration with Gamma (formerly known as Visor)  ",
                    "links": [
                        "https://twitter.com/revertfinance/status/1568710851422453763?s=20&t=0-4jjtSxjnFSxbBe3-NyoQ",
                        "https://twitter.com/revertfinance/status/1568710851422453763?s=20&t=0-4jjtSxjnFSxbBe3-NyoQ",
                        "https://twitter.com/BP_Gamma",
                        "https://twitter.com/Uniswap",
                        "https://twitter.com/revertfinance/status/1568710851422453763?s=20&t=0-4jjtSxjnFSxbBe3-NyoQ"
                    ],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 6.0461309523809526
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "14",
                    "likes": "1",
                    "time": "11/09/2022-18:39:11",
                    "content": "@cryptokitty , are you in any way affiliated with Gamma Strategies? Perhaps you can lend some more context. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/mariorz",
                    "index": "15",
                    "likes": "0",
                    "time": "11/09/2022-19:01:26",
                    "content": "Hi @cryptokitty. Regrettable to receive accusations of this sort from an organization with the low ethics as Gamma, previously known as Visor.   There was never an agreement on our part to integrate the protocol in exchange for a grant, Visor approached us, asked for an integration, we explicitly told them we would probably integrate liquidity manager protocols in the future, but not at that time.   Nevertheless they insisted in giving us a grant of 8,200 VISR (at current gamma price, the total is about 500 USD) which we immediately deposited into one of their vaults and left it there and was never withdrawn. This was in June 2021, here are the relevant txs:    Ethereum Transaction Hash (Txhash) Details | Etherscan Ethereum Transaction Hash (Txhash) Details | Etherscan    In December 2021 I wrote an article, linked on this thread, on how the Uniswap liquidity mining program for Ribbon had been exploited by a few accounts taking most of the rewards. They baselessly accused me of plagiarism even though the article was researched and written in full by myself (after they pinged me to ask about the situation)   Towards the end of that month their protocol was hacked, iirc for the third time, and they rebranded with a new token now called Gamma. Supposedly a different team, but very likely just the same people, and airdropped it to  vault depositors. We had no agreement in place with the original Visor grant, and no agreement in place with the new Gamma project. And definitely did not want to have any more dealings with them. I dumped those tokens, and good riddance.   I’ll end by saying that I would advice caution in any dealings with that project, beyond these false accusations against myself, the way they have conducted their protocol’s own security issues should be alarming enough as to what their character is. ",
                    "links": [
                        "https://etherscan.io/tx/0x066a70c1a28d30ec534d1dc01579c61607e4b21a98c702c7698a514483814916",
                        "https://medium.com/@revert_finance/onetickdao-eth-and-the-narrow-rangers-f9a376f7f0c9"
                    ],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.589804292929292
                },
                {
                    "author_link": "https://gov.optimism.io/u/mariorz",
                    "index": "16",
                    "likes": "0",
                    "time": "11/09/2022-20:28:46",
                    "content": " The one thing I’m curious about is how you work out the effect of incremental incentives on TVL. Let’s say you do 80k OP per month as incentives. How do these incentives get Compoundor to add 20 mm TVL, and on which pools?  Hi jack, thanks! We arrived at the number by going backwards. I think one of the common pitfalls of a lot of liquidity mining programs is that they over assign rewards that increment the LPs APR drastically in a way that attracts temporary capital that is only LPing for the rewards. Distributing 80,000 OP (~100k USD) in a month would be enough to increase the APR of ~20,000,000 in capital by about 6%. As described in the post the specific parameters are to be dermined and iterated on, but we believe we can attract that amount of capital from Mainnet to Optimism with the amount requested. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 4.875
                },
                {
                    "author_link": "https://gov.optimism.io/u/BP_Gamma",
                    "index": "17",
                    "likes": "1",
                    "time": "11/09/2022-21:27:39",
                    "content": "Hey everyone, I’m Brian, and I lead business development at Gamma Strategies.  I was just notified that this discussion was taking place here by one of our community members. Our intention was not to go public with any of this information until it had become evident that @mariorz was attacking our character which prompted us to respond.  My aim here is to be as forthcoming as possible about our interactions with @mariorz (also known as Wario) and provide as much actual evidence of our interactions, so that it would be helpful to anyone who is doing business with him. Just for some context, we had reached out to Wario back in June 2021 regarding an integration where Revert would provide analytics for Visor Finance (now known as Gamma), and Visor would be giving him a grant to do so.     mariorz:  There was never an agreement on our part to integrate the protocol in exchange for a grant, Visor approached us, asked for an integration, we explicitly told them we would probably integrate liquidity manager protocols in the future, but not at that time.   Contrary to what he has stated here, there was most certainly an agreement in writing on Telegram.  image693×867 53.8 KB   At this point, we had already given the grant to @mariorz who had promised us that we would be the first Uniswap v3 vaults for integration, and that he was excited by working with us to get analytics on revert.  He even gave us a target date for when this would be ready.     mariorz:   Nevertheless they insisted in giving us a grant of 8,200 VISR (at current gamma price, the total is about 500 USD) which we immediately deposited into one of their vaults and left it there and was never withdrawn. This was in June 2021, here are the relevant txs:   Ethereum Transaction Hash (Txhash) Details | Etherscan  Ethereum Transaction Hash (Txhash) Details | Etherscan     He is correct that he received 8,200 VISR, but that was worth $10,563.56 on the day of transfer.  image1280×1068 72.3 KB  He is correct in that we did do a token migration in December in which all VISR holders were given a 1:1 exchange for GAMMA tokens. Despite his saying that the GAMMA price is worth 500 USD, this is obfuscating the fact that he had sold the GAMMA for 5,494 USDC on December 29th, 2021, and those funds have never been returned to us.  He has also refused to do any integration despite monetizing the grant.  See the sale transaction below:    Ethereum (ETH) Blockchain Explorer    Ethereum Transaction Hash (Txhash) Details | Etherscan Ethereum (ETH) detailed transaction info for txhash 0x4141130de776a9516dbc56ef11e9448bbd75d5ff8dd7211b7962c0c0d0755922. The transaction status, block confirmation, gas fee, Ether (ETH), and token transfer are shown.          mariorz:  In December 2021 we wrote an article, linked on this thread, on how the Uniswap liquidity mining program for Ribbon had been exploited by a few accounts taking most of the rewards. They baselessly accused me of plagiarism even though the article was researched and written in full by myself (after they pinged me to ask about the situation)   We never accused him of plagiarism.  We accused of him of failing to give credit where it is due.  We had consulted him for a research article that we were writing on the Ribbon incident.  However, during the middle of the conversations, he frontran the publication of the article, solely crediting himself and then subsequently asked the public to donate to his gitcoin grants for his publication. https://twitter.com/revertfinance/status/1468667993831915528?s=20&t=_p50abJ6jEdTQvDkBTY6zw. Here is where we explicitly told @mariorz that we were doing a write up on the exploit of Ribbon’s Uni v3 staker contract.  See my team member’s statement below where he states, \"We are doing a write up on the 1tickdao.eth “EXPLOITER” on Ribbon’s staking contract.  image571×522 29.8 KB  I do not want to bore everyone with the entire conversation but we literally had pages of dialogue of joint research for this article.  In this text here, we had mutually agreed on a joint publication.  It was very obvious that this was going to be a joint publication based on the entirety of the conversations  image564×651 40.2 KB   image605×1066 73.4 KB   image574×881 66 KB  We had pages of dialogue after his initial suggestion that we have a meeting on Monday to discuss.  Yet, his main reason for writing the article without any credit to our contributions was that we didn’t actually schedule the Monday meeting.  That reasoning is completely absurd and illogical given all the dialogue and joint work that we’ve done.     mariorz:  Towards the end of that month their protocol was hacked, iirc for the third time, and they rebranded with a new token now called Gamma. Supposedly a different team, but very likely just the same people, and airdropped it to vault depositors. We had no agreement in place with the original Visor grant, and no agreement in place with the new Gamma project. And definitely did not want to have any more dealings with them. I dumped the tokens, and good riddance.   This is completely irrelevant and a straw man argument to whether he wrongfully accepted and monetized grant funds and whether he wrongfully took sole credit for a joint publication.  However, I will still address it given that we are part of the Optimism ecosystem.  Uniswap v3 management was a bleeding new space, and we were the original authors of our position manager contracts.  As with many contracts that have been written for the first time, they have been exploited, and we took full responsibility and accountability.  We spent hundreds of thousands on new audits by Arbitrary Execution (hypervisor/AE_Gamma_audit_09_03_22.pdf at master · GammaStrategies/hypervisor · GitHub) and a 4-week intensive audit by ConsenSys Diligence (Gamma | ConsenSys Diligence), the best in the business.  In our rebrand to Gamma, we onboarded new security advisors and strategists specifically tailored to bolstering the safety of our contracts.     mariorz:  We had no agreement in place with the original Visor grant, and no agreement in place with the new Gamma project. And definitely did not want to have any more dealings with them. I dumped those tokens, and good riddance.   Based on the totality of the evidence, this is egregiously false.  And I don’t think @mariorz is realizing that he dumped the tokens and monetized despite admitting to not providing any service at all.  That is theft if I’m not mistaken.     mariorz:  I’ll end by saying that I would advice caution in any dealings with that project, beyond their disparaging and false accusation against myself, the way they have conducted their protocol’s own security issues should be alarming enough as to what their character is.   Quite the contrary to what he has stated, all the evidence points to his duplicity in our business dealings.  Our own security issues that he keeps referring to is a textbook strawman argument. In conclusion, we never intended to air this dirty laundry evidenced by the fact that we never went public with any of this information despite this happening in December 2021.  In my last DM to him, I said the following:  image568×564 35.5 KB  Again, I would like to thank him for revealing his character to us.  For us personally, we will never do business with this individual again. Apologies for the negative energy, but I feel that this must be stated as he has consistently shown himself to be an unethical individual. ",
                    "links": [
                        "https://etherscan.io/tx/0x7ff8ffb6de65d3928e6d9232bbf4638745476bf8b51962e02a375ac891638491",
                        "https://etherscan.io/tx/0x066a70c1a28d30ec534d1dc01579c61607e4b21a98c702c7698a514483814916",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/a/a2558b89bf0823cc2372194a769c5ef08abad40b.jpeg",
                        "https://etherscan.io/tx/0x4141130de776a9516dbc56ef11e9448bbd75d5ff8dd7211b7962c0c0d0755922",
                        "https://etherscan.io/tx/0x4141130de776a9516dbc56ef11e9448bbd75d5ff8dd7211b7962c0c0d0755922",
                        "https://twitter.com/revertfinance/status/1468667993831915528?s=20&t=_p50abJ6jEdTQvDkBTY6zw",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/1/1d411b8c31fdff163310adf7bb241a2c6c61a62e.png",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/a/a0fa4e61e38f525e66dd1f9c8a40440f486c46bd.png",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/b/b7c438b5009c56f9822f09716df491c111d1e359.png",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/7/7167f62c2f6e6e49b534e4d4e7e7e9d41af95ee7.png",
                        "https://github.com/GammaStrategies/hypervisor/blob/master/AE_Gamma_audit_09_03_22.pdf",
                        "https://consensys.net/diligence/audits/2022/02/gamma/",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/8/88fc5de891fb7147562549a5b421f99b3fc2cd94.png"
                    ],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.600968095831109
                },
                {
                    "author_link": "https://gov.optimism.io/u/mariorz",
                    "index": "18",
                    "likes": "0",
                    "time": "11/09/2022-21:43:32",
                    "content": "This is pretty manipulative and I’m sorry this has to pollute this proposal. I’ll keep it short as Gamma’s stratgy is to drown the signal with a deluge of lies and out of context chat fragmets.   In none of the screenshots does it say we agreed to receive payment for integrating their protocol. I would def have not accepted what would have been “a contract” to integrate their protocol. They did reach out to me, and insist on giving us “the grant”, and there is on-chain evidence that it was never spent, though in hindsight I should have never accepted it. This is the tx where I deposited the full amount into their vault and just left it there, all while their token price was in free fall. (At that point I had not yet realized the type of persons I was dealing with) Ethereum Transaction Hash (Txhash) Details | Etherscan   WRT to the article, there was absolutely no agreement on a joint publication. They already went the road of posting out-of-context fragments so they should perhaps publish that section. On the contrary,  what they likely wanted to do is publish an article that would shill their protocol as a solution to the exploit of the uniswap staker.   this “negative energy” and lies were brought here by an obvious gamma sockpuppet, just by looking at their profile they have participated in this thread and on gammas own proposal, supporting it, and disputing concerns by external participants Profile - cryptokitty - Optimism Collective   ",
                    "links": [
                        "https://gov.optimism.io/u/cryptokitty"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/BP_Gamma",
                    "index": "19",
                    "likes": "1",
                    "time": "11/09/2022-21:53:08",
                    "content": "    mariorz:  In none of the screenshots does it say we agreed to receive payment for integrating their protocol. There is on-chain evidence that we never spent the grant, which in hindsight we have should have never accepted. This is the tx where we deposited the full amount into their vault and never withdrew Ethereum Transaction Hash (Txhash) Details | Etherscan   The reality is that you have accepted the payments and explicitly sold the GAMMA you received in exchange for the VISR that you had deposited into the VISR staking contract.  That is why you sold 8,392.3687 GAMMA, which represents the 8,200 VISR received + the interest earned from the staking contract.     mariorz:  WRT to the article, there was absolutely no agreement on a joint publication. They already went the road of posting out-of-context fragments so they should perhaps publish that section. On the contrary, what they likely wanted to do is publish an article that would shill their protocol as a solution to exploit of the uniswap staker.   It was abundantly obvious to everyone, but inconvenient to you, that this was a joint effort.  I didn’t take snapshots of everything because there’s literally pages of text.  If anyone wants to see the entirety of it, I’d happy to send it to you via DM.     mariorz:  this “negative energy” and lies was brought here by an obvious gamma sockpuppet, just by looking at their profile they have participated in this thread and on gammas own proposal, supporting it, and disputing concerns by external participants Profile - cryptokitty - Optimism Collective   That individual is a longtime community member and very likely a GAMMA holder, so take his opinion and all the evidence presented with that in mind.  But for the most part, the presented evidence should speak for itself, especially his own admitting (as well as on-chain evidence) to selling the grant funds without providing any of the services. ",
                    "links": [
                        "https://gov.optimism.io/u/cryptokitty"
                    ],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.779411764705882
                },
                {
                    "author_link": "https://gov.optimism.io/u/mariorz",
                    "index": "20",
                    "likes": "0",
                    "time": "12/09/2022-00:13:31",
                    "content": "Replying to this message would be repetitive except to say that prior to yesterday’s Twitter feud with the Gamma team there was never any private or public message from them indicating that:   they felt some kind of paid-for service wasn’t rendered on my part, because they were fully aware the VISR grant was not received as payment for a service to be rendered. And again those grant tokens were never sold and were just deposited and left in their vault, all while the token price was crashing.   they wanted the airdropped GAMMA back, which they for sure would have gotten. Why did they even include the address in the airdrop if that was the case? What I was thinking of when dumping their airdropped tokens was that I did not look forward to having any more interactions with that team/project. (so much for that)   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.818181818181818
                },
                {
                    "author_link": "https://gov.optimism.io/u/bobby",
                    "index": "21",
                    "likes": "3",
                    "time": "13/09/2022-02:21:32",
                    "content": "Hi squad – please keep the conversation focused on the merits of the proposal at hand. This isn’t the forum to re-hash a past partnership. If you have any questions please feel free to DM me. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.375
                },
                {
                    "author_link": "https://gov.optimism.io/u/StrategicReserve",
                    "index": "22",
                    "likes": "0",
                    "time": "13/09/2022-03:44:23",
                    "content": "A grant applicant’s personal history and prior actions are relevant to the proposal’s merits. This proposal is not asking for funding for a DAO. It’s funding going directly to revertfinance.eth. The same account that was used to steal funding we provided him. @mariorz has complete control over that account and any crypto that touches it. If I recall, a proposal by Byte Masons was strongly reconsidered after @lefterisjp released a statement saying the team had conducted themselves unprofessionally in the past. If @mariorz was a representative a DAO or organization he had no control over, that would be different. @mariorz first response to this accusation was a lie.  Nevertheless they insisted in giving us a grant of 8,200 VISR (at current gamma price, the total is about 500 USD  The grant was $10,000. He then later admitted to dumping the tokens out of spite multiple times.  And definitely did not want to have any more dealings with them. I dumped those tokens and good riddance.   And again those grant tokens were never sold and were just deposited and left in their vault, all while the token price was crashing.   What I was thinking of when dumping their airdropped tokens was that I did not look forward to having any more interactions with that team/project. (so much for that)  Instead of providing an explanation, @mariorz has attempted to discredit us personally and professionally. There is no explanation besides he took a grant with the stipulation that no work would be done, which is absurd, and refuted by our screenshots. This proposal is asking for over $300,000+ to be handed over to him unilaterally. If any delegate is considering approving this, I strongly would recommend that any funds be put on a multi-sig with OPLabs team access. That’s the bare minimum of due diligence that should be done for someone who has admitted in plain English to stealing a protocol’s funds. Nor is it fair to the other applicants, as their character and past actions were absolutely taken into consideration when evaluating their grants. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.409451659451659
                },
                {
                    "author_link": "https://gov.optimism.io/u/mariorz",
                    "index": "23",
                    "likes": "0",
                    "time": "13/09/2022-04:12:31",
                    "content": "As I have explained above, there was no agreement for any services to be rendered. It is a lie that any of the screenshots show an agreement of receiving this grant as payment for the servIce. They approached me, asked about us integrating their protocol, I said we would along with other protocols following our own roadmap and not at that time. They insisted on giving the grant “with no strings attached”. More so, I just took that grant and deposited into their own vault and left it there. So it is ridiculous to say that there was intention to profit from it, more so when during that period the price of that token grant was in free fall. I honestly did not care to use these funds, and they would not have, then or now, made any material difference to our team’s runway. More than 6 months later, after they had already accused me of “frontrunning” and “stealing” an article I researched and wrote alone, they airdrop me (and all vault depositors) a new token which I immediately dumped. At no moment did they indicate they wanted any of these tokens they airdropped themselves back, or that they were payment for anything. It should be evident to anyone who does a background check on the gamma team the dishonest way in which they operate. They have already received a grant approval for over a million dollars, in no part of that proposal do they explain that they are a team that rebranded after three consecutive “hacks” under circumstances that are only explained by extreme negligence or worse.   Private key was compromised, they blamed an auditor https://twitter.com/ChrisBlec/status/1407073749199958026   Basic mistake of trusting a dex spot price, called it an arb https://twitter.com/Mudit__Gupta/status/1464657487081005060   Contract jus trusted msg.sender, they rebranded  https://twitter.com/storming0x/status/1473321779250802693   In none of these incidents do they ever take responsibility, and instead end up with a rebrand and proceed to pivot to ask for money from DAOS without disclosing their very relevant and problematic history. Here they have used an obvious sockpuppet, and their own accounts (which btw nothing wrong with being anonymous, but while they use names like “Brian”, they seem to be anons with no seeming background, and twitter accounts created in 2021), to falsely accuse and malign me. I’ve worked in this Industry since 2016. For anyone that wants to look into my background,  twitter account https://twitter.com/mariorz  blog https://romero.fm/   For any delegates, more than happy to provide references of  folks in the industry I have actually worked with and collaborated over years. ",
                    "links": [
                        "https://twitter.com/ChrisBlec/status/1407073749199958026",
                        "https://twitter.com/Mudit__Gupta/status/1464657487081005060",
                        "https://twitter.com/storming0x/status/1473321779250802693",
                        "https://twitter.com/mariorz",
                        "https://romero.fm/"
                    ],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.706723484848485
                },
                {
                    "author_link": "https://gov.optimism.io/u/StrategicReserve",
                    "index": "24",
                    "likes": "0",
                    "time": "13/09/2022-06:18:36",
                    "content": " I honestly did not care to use these funds, and they would not have, then or now, made any material difference to our team’s runway  The Blockchain says you received $10,000 in tokens, then you dumped it for $5,494 in tokens, then you moved it to Coinbase. You put that money in your own pocket. Clearly you did care to use those funds, for yourself. That’s all on chain. That is theft. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely negative feedback on proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 7.166666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/mariorz",
                    "index": "25",
                    "likes": "0",
                    "time": "13/09/2022-06:28:01",
                    "content": "You are intentionally misleading.  The grant tokens were just deposited and left in your own vault.  Ethereum Transaction Hash (Txhash) Details | Etherscan  The tokens you airdropped 6 months later were sold for 5k, the withdrawls you link are for 10k. This public account linked has had then and now more money than that. Ethereum Transaction Hash (Txhash) Details | Etherscan   I’ve already replied to your false accusations here multiple times. And at no point had you requested any of these tokens back or that you expected a delivery of any service rendered for the grant. ",
                    "links": [
                        "https://etherscan.io/tx/0x4141130de776a9516dbc56ef11e9448bbd75d5ff8dd7211b7962c0c0d0755922"
                    ],
                    "GPT-discussion-categories": [
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.333333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/BP_Gamma",
                    "index": "26",
                    "likes": "1",
                    "time": "13/09/2022-06:35:07",
                    "content": "    bobby:  Hi squad – please keep the conversation focused on the merits of the proposal at hand. This isn’t the forum to re-hash a past partnership.   Hi @bobby , Apologies for what seems to be re-hashing a past partnership. I had responded with my comments above mainly for two reasons   @mariorz mentioned us first by name both on Twitter and on this forum in a derogatory light, to which we were forced to respond and clarify with evidence.   To reveal that in a prior grant context, he had never fulfilled his end of the bargain and acted dishonestly.   Again, we never asked to be dragged in here, but his constant mentioning of our name forced us to respond.  All our past security issues are out of scope for the relevance of how @mariorz 's personal history and prior action affect his own proposal’s merits. To keep the dialogue relevant, he 100% did receive a grant from us for an integration that he promised us would take place.  Those services never took place, and he never returned the grant funds. The context of our grant program can be found here: Introducing Gamma: An organization dedicated to funding ‘Active LP’ strategies and research | by Visor Finance | Visor Finance | Medium If anyone would like to go into any details on us, our security incidents in the past, or our interactions with @mariorz please ask, and I will be happy to do so. Thank you, Brian ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None"
                    ],
                    "Sentiment": 5.214912280701754
                },
                {
                    "author_link": "https://gov.optimism.io/u/StrategicReserve",
                    "index": "27",
                    "likes": "0",
                    "time": "13/09/2022-07:07:23",
                    "content": " The grant tokens were just deposited and left in your own vault  This is getting absurd. You had custody of the funds and then moved them into our staking platform to accrue rewards. You could do whatever you wanted with them at that point.  image1145×187 15.4 KB   the tokens you airdropped 6 months later were sold for 5k,  Yes, we know you dumped the grant tokens.  the withdrawals you link are for 10k.   image1468×204 20.1 KB   image1538×193 12.3 KB  You took the $5,494 you stole, combined it with other USDC, moved it to Coinbase, and paid yourself.  that you expected delivery of any service rendered for the grant.  That’s where we are at. You’re claiming the money was free and that you didn’t have to do anything. Don’t you understand why it’s a little concerning that you’re asking for $300,000 in OP to be deposited into your account revertfinance.eth?  ",
                    "links": [
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/8/89c7526c0b269df72b53d8b9c108acc1a29773d0.png",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/4/4e957c053718db2ab5b1bb3c872674ea55cde6d4.png"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0546875
                },
                {
                    "author_link": "https://gov.optimism.io/u/mariorz",
                    "index": "28",
                    "likes": "0",
                    "time": "13/09/2022-07:12:55",
                    "content": "I did not apply to any grant program of yours. You approached me. I did not agree to render any paid for service for the grant, you insisted on giving a no strings attached grant and ostensibly a relationship of collaboration going forward. I deposited the grant tokens into your vault out of respect, I still had at that point, and with no intentions of using them. Looking at it now it would have been ridiculous to care about your vault yield when your token price was crashing for the following months. Those tokens remain there. If you actually thought the tokens were a payment for some service undelivered you could have asked me to return them, which I would have immediately done. You bring this up now, when this grant was in june 2021, and make these false accusations, only after I warn on Twitter that you are a rebrand of a protocol that was “hacked” 3 times under alarming and suspicious circumstances and should probably shut down at this point. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 4.293650793650794
                },
                {
                    "author_link": "https://gov.optimism.io/u/Dicaso",
                    "index": "29",
                    "likes": "0",
                    "time": "13/09/2022-09:52:33",
                    "content": " … ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Prometheus",
                    "index": "30",
                    "likes": "1",
                    "time": "13/09/2022-10:36:02",
                    "content": "@Dicaso please, in the future refrain from this kind of participation.  It doesn’t help It adds nothing      BP_Gamma:  To keep the dialogue relevant, he 100% did receive a grant from us for an integration that he promised us would take place. Those services never took place, and he never returned the grant funds.   To keep the debate even more relevant and free of Drama can you explicitly point to what the issue is, with this specific proposal? This proposal isn’t about building something new and failing with that goal  so if people really want to continue this kind of discussion we need to know exactly what the concern is. Are you suggesting @mariorz is going to vanish with this funds? Without…     mariorz:  Proposal for token distribution:  How will the OP tokens be distributed?100% will go to Uniswap v3 LPs on the Revert Compoundor Protocol on Optimism. All LPs will be eligible to join the program, except team wallets which will be excluded. The distribution will be done in tranches via merkle airdrops. We will iterate on the criteria and parameters for the distribution, but they will be based on TVL, compounded amounts, and forms of vesting or minimum timeframes. The specific criteria and scripts will of course be made public. We will likely favor popular assets, or otherwise make sure valueless pairs are not a vector for exploiting the program. Over what period of time will the tokens be distributed?  We are targeting 3 months, but we will adjust the period to try to incentivize more sticky liquidity as we learn from the results. Also explained in the previous answer.      I understand this…     BP_Gamma:  Again, I would like to thank him for revealing his character to us. For us personally, we will never do business with this individual again. Apologies for the negative energy, but I feel that this must be stated as he has consistently shown himself to be an unethical individual.   But I don’t understand why it matters. I’m not suggesting this is true or false but that there’s plenty of dubious characters out there and they still deliver. If the issue is the character (unethical individual) then you made your point. If the issue is that @mariorz will keep the funds for himself then please back your claims with more facts. We need much more than what you just presented on a “failed collaboration”. This kind of issues happen frequently in “collaborations” (or whatever since I’m not even convinced it was really a collaboration), it’s nothing new or revealing. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.038797061524334
                },
                {
                    "author_link": "https://gov.optimism.io/u/BP_Gamma",
                    "index": "31",
                    "likes": "1",
                    "time": "13/09/2022-11:34:55",
                    "content": "    Prometheus:  To keep the debate even more relevant and free of Drama can you explicitly point to what the issue is, with this specific proposal? This proposal isn’t about building something new and failing with that goal so if people really want to continue this kind of discussion we need to know exactly what the concern is. Are you suggesting @mariorz is going to vanish with this funds?   It is mainly concerning the character and past history of @mariorz , proposer of this proposal. That is all. If everything here is done through multisigs, deterministic smart contracts, etc then I would agree with you that it is less of a concern. But the recipient address is an EOA, and he is more or less in full control of the grant funds if he were to be given them. I am merely speaking as someone who has worked and dealt with this individual in the past, so take that for what it is worth. As I mentioned before, the reason for my participation here was twofold: (1) defend against his allegations and claims against us and (2) illustrate as much as possible our working relationship with him where we have given him a grant.     Prometheus:  But I don’t understand why it matters. I’m not suggesting this is true or false but that there’s plenty of dubious characters out there and they still deliver. If the issue is the character (unethical individual) then you made your point. If the issue is that @mariorz will keep the funds for himself then please back your claims with more facts. We need much more than what you just presented on a “failed collaboration”   Yes, the main reason was his character. This was much more than a “failed collaboration”. The main facts are that he received grant funds to his EOA, he never performed any services for us, and he admits to selling such funds and transferring the proceeds to his fiat account. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5995670995671
                },
                {
                    "author_link": "https://gov.optimism.io/u/Prometheus",
                    "index": "32",
                    "likes": "1",
                    "time": "13/09/2022-11:47:05",
                    "content": "    BP_Gamma:  It is mainly concerning the character and past history of @mariorz , proposer of this proposal. That is all.   Thanks, if you don’t have anything to say about the proposal we can move on. I’m not convinced he did anything wrong and I don’t even know who gives 100% of a dev grant allocation (upfront) without deliveries (unless they are playing games). I don’t need and I don’t want to say more. Let’s move on. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.116666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/BP_Gamma",
                    "index": "33",
                    "likes": "1",
                    "time": "13/09/2022-11:58:24",
                    "content": "    Prometheus:  I don’t even know who gives 100% of a dev grant allocation (upfront) without deliveries (unless they are playing games).   Just to address this one point, our grants were between $5k-$15k. And they were to fund research and analytics for active LP management where there just was not enough activity at the time. It was certainly not to play games, but they were risk-adjusted according to size, and we liked what we saw in terms of his webapp. We ourselves have received grants without deliveries as well such as the Polygon Ecosystem Grant which was similarly sized. Other, incubator type orgs have given similar size grants up front. Its fairly common for grants of that size. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.963624338624339
                },
                {
                    "author_link": "https://gov.optimism.io/u/Prometheus",
                    "index": "34",
                    "likes": "1",
                    "time": "13/09/2022-12:03:57",
                    "content": "I don’t need to explain how grants work but there’s different type of grants (some don’t require early deliveries). The one you use as reference (development, that should be backed with documentation and more) is completely different from the one we are discussing here. Not to mention that you didn’t even claim @mariorz will vanish with the funds. I don’t see any value in continuing this specific discussion. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None",
                        "None",
                        "None",
                        "3rd party giving constructive criticism of proposal",
                        "None"
                    ],
                    "Sentiment": 5.6000000000000005
                },
                {
                    "author_link": "https://gov.optimism.io/u/BP_Gamma",
                    "index": "35",
                    "likes": "0",
                    "time": "13/09/2022-12:11:10",
                    "content": "@Prometheus Believe me, I am trying not to continue this conversation, but you had implied something along the lines that this was not a legitimate grant, so I had to respond. See here for the full details of our grants program:  Introducing Gamma: An organization dedicated to funding ‘Active LP’ strategies and research | by Visor Finance | Visor Finance | Medium Like I said before, the Polygon Ecosystem Grant for our original launch on Polygon was prior to our launch of our Polygon contracts. This was similarly focused on integrating our smart contracts on the Revert platform. Edit:  @Prometheus happy to take this discussion offline if you would like to know more about this specific grants program. Don’t want to keep taking this further off track. I think more than enough has been said ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.245129870129871
                },
                {
                    "author_link": "https://gov.optimism.io/u/Prometheus",
                    "index": "36",
                    "likes": "1",
                    "time": "13/09/2022-12:40:05",
                    "content": "    BP_Gamma:  @Prometheus Believe me, I am trying not to continue this conversation, but you had implied something along the lines that this was not a legitimate grant, so I had to respond.       BP_Gamma:  See here for the full details of our grants program: Introducing Gamma: An organization dedicated to funding ‘Active LP’ strategies and research | by Visor Finance | Visor Finance | Medium   If you share a medium with a form application but you defend the application with:     BP_Gamma:  Contrary to what he has stated here, there was most certainly an agreement in writing on Telegram.   I don’t need to imply anything at all. To me this looks more like…     BP_Gamma:  Just for some context, we had reached out to Wario back in June 2021   and things didn’t play how you expected. Meanwhile some of you believe this whole thing is worth our time instead of focusing on the current proposal. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.091269841269842
                },
                {
                    "author_link": "https://gov.optimism.io/u/BP_Gamma",
                    "index": "37",
                    "likes": "1",
                    "time": "13/09/2022-12:48:47",
                    "content": "Yes, we did both reach outs for grants as well as grant applications. The link that I sent was regarding the scope of the grants program. Lets take this offline if you want to know further, but I think enough has been said on this topic. But what is provable is that he received grant funds, did not provide services, and monetized the tokens. That is all onchain ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Dicaso",
                    "index": "38",
                    "likes": "3",
                    "time": "13/09/2022-12:49:32",
                    "content": "These allegations are becoming unprovable “he said, she said” and are totally irrelevant to the original post which should be the focus. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.541666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/Prometheus",
                    "index": "39",
                    "likes": "2",
                    "time": "13/09/2022-12:52:20",
                    "content": "This is way more valuable. Thanks ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "40",
                    "likes": "2",
                    "time": "13/09/2022-12:53:53",
                    "content": "Hi @mariorz , Thank you for your proposal and active participation. This is a solid move and also gives confidence that you are focusing on project rather than team funding.  All LPs will be eligible to join the program, except team wallets which will be excluded  This is where I think there are some scope of improvement, three distribution with 100K each might bring the liquidity but there is nothing to hold them long term.  it would take us a year to distribute the OP  You also mention in this thread that this distribution might last for 1 year, so which one we should consider ? 3 month or one year ? As per your KPI if you are able to on-board and hold 20M on OP chain, I am happy with number of token requested but it all depends on your distribution plan. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.930555555555555
                },
                {
                    "author_link": "https://gov.optimism.io/u/mariorz",
                    "index": "41",
                    "likes": "1",
                    "time": "13/09/2022-17:30:35",
                    "content": "First thank you @OPUser @Prometheus and @Dicaso for the help in bringing us back to topic.  This is where I think there are some scope of improvement, three distribution with 100K each might bring the liquidity but there is nothing to hold them long term.  I believe this is the crucial question. I think we agree that attracting liquidity by distributing money is easy enough, as has been proven by multiple liquidy mining programs, keeping at least a very significant portion of it is really the problem to solve. So what makes liquidity stay or leave? Phrases like “mercenary liquidity” are often used. If we drill down to it, the issue starts from what type of liquidity you are attracting with the incentives. As example, if you were to do a liquidity mining program on a hypothetical WBTC/WETH pool on Optimism that resulted in people getting +100% APR improvement, that pool will attract A LOT of liquidity fast. It will migrate liquidity from mainnet for sure, but It will also attract  liquidity that was not previously LPing on that pair at all, it will even attract liquidity that might not even hold one or both of these tokens. The last two cases are liquidity that will very likely leave as soon as incentives stop. An an example on the other end, if you do a liquidity mining program on that same pool that results in a modest, say 6%, increase in APR over the pair on mainnet. I believe that it would be an attractive enough proposition for a lot of existing LPs on mainnet to migrate. It is much less attractive for people that did not previously think LPing on that pair was attractive, or those who might not even own some of the assets. So by keeping the extra incentives APR to a reasonable level, you select for liquidity that is more likely to be sticky. Granted, this would be the first liquidity mining program we run, so this thesis is to be validated.  You also mention in this thread that this distribution might last for 1 year, so which one we should consider ? 3 month or one year ?  So the timeframe of the distribution could be extended with the intention of not allowing the extra APR to get too high. However, by directly and clearly explaining the APR improvement to existing LPs on mainnet that use our app, I believe we can migrate the 20m in a 3 month time frame without problems ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.812538580246914
                },
                {
                    "author_link": "https://gov.optimism.io/u/mariorz",
                    "index": "42",
                    "likes": "2",
                    "time": "13/09/2022-19:07:42",
                    "content": "Chatted some more with @OPUser via discord about the proposal (thank you!),  Encouraged us to explain a bit about the distribution happening in tranches and iterating over the parameters that will be used for the merkle airdrop at the end of each period. The point is of doing this is to learn in each iteration with the goal of maximizing sticky liquidity. If possible it might be even ideal to shorten the periods to 2-3 weeks to have more iterations.  Worth mentioning also that while the rules for the distribution will be fair, transparent, and with a clearly defined goal, the parameters might not be made public until after each iteration to minimize possible gaming if required. Also including a summary of previously requested and incorporated changes.  Reduced requested amount Explanation on how we arrived at the requested amount of OP. Provided a more detailed explanation of the intended promotions to our users. Provided a more detailed explanation of eligible accounts Addition of KPIs  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.699404761904761
                },
                {
                    "author_link": "https://gov.optimism.io/u/katie",
                    "index": "43",
                    "likes": "1",
                    "time": "21/09/2022-19:32:25",
                    "content": "I am an Optimism delegate [Delegate Commitments - #18 by katie] with sufficient voting power and I believe this proposal is ready to move to a vote. ",
                    "links": [
                        "https://gov.optimism.io/t/voting-cycle-6-roundup/3481/11"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "44",
                    "likes": "2",
                    "time": "23/09/2022-14:58:29",
                    "content": "Voted :- For Reward is going towards V3 liquidity, value proposition is aligned with long term sustainable growth. Amount of token request is reasonable, distribution is based on trenches and not including team wallet from reward is a welcome move. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.583333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/mariorz",
                    "index": "45",
                    "likes": "1",
                    "time": "23/09/2022-15:11:28",
                    "content": "Thanks very much also for you feedback in shaping up this proposal ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.15
                },
                {
                    "author_link": "https://gov.optimism.io/u/katie",
                    "index": "46",
                    "likes": "2",
                    "time": "24/09/2022-19:51:41",
                    "content": " Defi Committee A Recommendation  Voting recommendation: Yes Rationale: We are aware of the debate in the comments, however, we are focusing on the merits of the proposal itself. The amount requested is reasonable, the funds ultimately go to Uniswap v3 LPs on Optimism which we support, and we believe the proposal would drive Optimism ecosystem growth. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "47",
                    "likes": "3",
                    "time": "25/09/2022-04:25:28",
                    "content": "Recommendation from the defi shadow committee  – which is not an official committee – is yes. We support this proposal as a measured bet on a specific type of active user migrating to Optimism from Mainnet as a result of granted OP. We would appreciate more presentation of data supporting the likelihood of this bet panning out but are optimistic the Revert team will provide it. ",
                    "links": [
                        "https://gov.optimism.io/t/defi-shadow-committee-b-season-2-recommendations/3549/3"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.770833333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "48",
                    "likes": "1",
                    "time": "26/09/2022-21:20:44",
                    "content": "Voting yes following the Defi Commitee A recommendation. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "49",
                    "likes": "0",
                    "time": "27/09/2022-00:20:45",
                    "content": "Repasting a response by @mariorz to a review in this thread so readers can have context and to keep info in one place  Hi @jackanorak, First appreciate the recommendation on our proposal. Adding more background to give context to your feedback. As mentioned in our proposal, we believe there are clear aligned incentives between the Compoundor and Optimism in that the lower gas prices mean that some positions that are too small to compound profitably on mainnet can be profitably compounded on Optimism. So migrating this liquidity from mainnet to optimism effectively increases the addressable market for the compoundor protocol.  We think that KPIs tracking the migration of the ‘sticky’ marginal capital would cover this better than the simple TVL measure proposed.  I have to disagree though with the suggestion of changing the KPI to this specific type of liquidity. The rewards will be distributed in a way that does not exclude larger positions, so we should expect these positions to also contribute to the growth in TVL and Uniswap liquidity on Optimism (which we consider a good in itself). We do look forward to keep building on Optimism, and sharing the results of the proposed liquidity mining program in the context of our proposed KPI, though I also think doing analysis by different forms of cohorts, as the one proposed by the shadow committee is certainly worth looking into, and we will. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.918269230769231
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "50",
                    "likes": "2",
                    "time": "27/09/2022-00:24:29",
                    "content": "thanks for the color on this, @mariorz . Just speaking for myself here but definitely see where you’re coming from re needing to cover all types of capital, so TVL could be in play. But I do also appreciate your openness to tracking different cohorts to see whether there are meaningful divergences in behavior. Think it’d be interesting to see - and not just for revert. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.2
                },
                {
                    "author_link": "https://gov.optimism.io/u/Bobbay_StableLab",
                    "index": "51",
                    "likes": "1",
                    "time": "27/09/2022-11:59:20",
                    "content": "Vote: Yes Rationale: Following the recommendation we made in DeFi committee A. Ultimately, the proposal was strong and will add value to the OP ecosystem. Regardless of the drama within the proposal comments, we base our vote on the merits of the proposal itself. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 4.541666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/Tjark",
                    "index": "52",
                    "likes": "1",
                    "time": "28/09/2022-09:06:34",
                    "content": "The PoolCollective voted yes, following the recommendation of DeFi Committee A. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "53",
                    "likes": "0",
                    "time": "29/09/2022-19:11:38",
                    "content": "Snapshot vote - passed ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "54",
                    "likes": "0",
                    "time": "29/09/2022-19:11:40",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "55",
                    "likes": "0",
                    "time": "30/09/2022-21:25:46",
                    "content": "@mariorz can you provide a Telegram handle or other contact method so the Optimism team can get in touch about paying out this grant! Feel free to comment on this thread, DM, or email palash@optimism.io ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.609375
                }
            ]
        }
    ],
    "group_index": "195"
}