{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/draft-gf-phase-1-proposal-galleon/2729",
            "title": "[DRAFT][GF: Phase 1 Proposal] Galleon ",
            "index": 2729,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Governance Fund: Phase 1"
            ],
            "tags": [
                "cycle-6"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/duck",
                    "index": "1",
                    "likes": "2",
                    "time": "21/06/2022-13:37:40",
                    "content": "[GF: Phase 1 Proposal] Galleon  Incentive Proposal Template Project Name: Galleon Author Name: duck Number of OP tokens requested: 300,000 L2 Recipient Address: 0x4a1F29f70E6bA7b11bD34061461f3638cd31C5aE Relevant Usage Metrics: TVL - $700k on Ethereum / 201 - unique addresses. TVL - $368k on Optimism / 37 - unique addresses. Optimism alignment (up to 200 word explanation): Galleon is a methodologist guild that focuses on building the best-in-class structured products in the cryptocurrency market, we’re are only 5 months old, but have launched three innovative products to date. A proof of concept, alternate L1 index (SOLUNAVAX) with flash issuance on Optimism, The ETH Max Yield Index ($ETHMAXY) a 1x net ETH exposure with 3x leveraged, autocompounding yield available on mainnet, which launched 10th March 2022 and notably was the first recursive lending product utilizing stETH/astETH in the market (currently $700k TVL, was $5m at its peak). Finally now, the Basis Yield ETH Index is our latest flagship product that we are excited to bring to life on the Optimism network. The Basis Yield ETH Index ($BYE) is built using Set’s integration with Perpetual Protocol on Optimism and automates a perpetual basis trading strategy that returns a delta-neutral, levered high yield index to those that hold the token. We believe this product and the wider “suite” of Basis Yield products will be able to attract in excess of $10m+ TVL on the optimism chain.  1600×800 186 KB  We would like to propose an initial allocation of:  OP allocation of 300k tokens.  Galleon is a small DAO, but we have an incredible team and these tokens would go a long way to support us in building more innovative structured products, helping to generate fees for ecosystem partners like Perpetual protocol and securing more TVL on the Optimism network. Proposal for token distribution (under 1000 words): The OP tokens will be used for Incentives (50%) alongside our own governance token $DBL (we have already approached the Perpetual Protocol Team joint incentives with (PERP) as well). The remaining 50% of the tokens will be split between (35%) development funding, and (15%) provisioning product liquidity for the Basis Yield suite on Optimism. How will this distribution incentivize usage and liquidity on Optimism? As per the historic funding APR rates from R72.fi, ETH:USD on Perpetual protocol last year was 40.9% APY. BYE therefore would have generated 27% while remaining completely market neutral. Our backtesting between Nov 21 and Feb 22, also provided equally promising results. The OP incentives would be used to help to bolster the liquidity of our product, by providing additional APR% on top of our BYE product, (which by itself is the best yield generating market-neutral strategy in the market). Why will the incentivized users and liquidity remain after incentives dry up? We believe even after the incentives have finished, capital will remain in the product suite as the product is one of the most organic sources of yield in DeFi today (basis trading) with a very low risk profile compared to most yield opportunities seen historically. Due to the current market volatile conditions (which we expect to continue at least for the next 12 months) we hypothesize that low risk, neutral exposure yield strategies like BYE will continue to attract sticky, organic TVL to Galleon, Perpetual Protocol & Optimism. Over what period of time will the tokens be distributed? We plan to run a 12-24 month incentives programme. How much will your project match in co-incentives? Galleon will target to be incentivising equally in parallel but as the DAO is at a very early stage and at a very small total capitalisation, the incentives may vary initially. ",
                    "links": [
                        "https://www.r72.fi/derivative/perpetual_protocol/ETH%3AUSD?"
                    ],
                    "GPT-summary": "The post is a proposal for the Galleon Incentive Template Project, requesting 300,000 L2 tokens. The proposal explains the Galleon methodologist guild and its innovative products, including the Basis Yield ETH Index, which is the latest flagship product. The tokens will be used for incentives, development funding, and product liquidity. The proposal also discusses how the distribution of tokens will incentivize usage and liquidity on Optimism and how the incentivized users and liquidity will remain after incentives dry up. The post also invites feedback and questions from third parties.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Token economics",
                        "Interoperability and Scaleability",
                        "Smart contract updates",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.827951388888889
                },
                {
                    "author_link": "https://gov.optimism.io/u/Justin",
                    "index": "2",
                    "likes": "2",
                    "time": "22/06/2022-05:46:26",
                    "content": "Hi.  I have some questions and suggestions: Please include your URL in your proposal so that OP holders can learn more. I appreciate your milestone structure, but wonder whether 900K OP tokens is disproportionate to your TVL.  Hashflow is the only Phase 1 proposal that has requested more tokens (1,000K) but their still modest TVL is 30x Galleon’s. Your token allocations total 105%. Your proposal said that you approached the Perpetual team.  What did they say?  What is the expected outcome of your conversations? For the 50% of tokens designed for incentives, can you articulate in more detail the structure of the incentives.  What specifically will you incentivize and how will the incentive be designed? What would trigger the 20% “potential extension of incentives”?  And if you don’t use this 20% for incentives, what would you use it for? A lot of questions, sorry.  Hope the answers will help everyone evaluate your Proposal. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://gov.optimism.io/u/duck",
                    "index": "3",
                    "likes": "1",
                    "time": "22/06/2022-09:06:56",
                    "content": "Hi Justin, thank you for your questions, really appreciate it.   Here is a link to (https://galleon.community) you’ll be able to find information about us, our app and documents including our product pages. I would of included it in the original post but I was limited to one link and felt the historical yield data was required.   I’ve amended the token allocations total to 100% it should have always been a 15% allocation for potential extension.       Justin:  I appreciate your milestone structure, but wonder whether 900K OP tokens is disproportionate to your TVL. Hashflow is the only Phase 1 proposal that has requested more tokens (1,000K) but their still modest TVL is 30x Galleon’s.   Firstly I understand the TVL comparison and that’s exactly why I want to loop back to the milestone structure, the whole reason for using a milestone approach is so a team / project doesn’t reap more than they sow, its a structure literally created to reward progress. So in that vein although the request is for 900k tokens, these will not all be paid out unless the milestones are met. Yes, right now, we can agree our current TVL isn’t remotely comparable to hashflows. However as per the conditions of the milestones the remaining 600k OP would only be paid (in two payments) at $8m and $15m TVL respectively, at these thresholds hashflow would be at only 2.75x and 1.46x our products TVL. It would also put us in “tier 2” category from the phase 0, which is what we have been using as a benchmark for the request. Currently our product hasn’t “officially” launched and we already have $220k TVL. Link below:  image1144×157 18.6 KB    TokenSets    TokenSets - Asset Management Simplified Use Set’s battle-tested asset management tools and infrastructure to easily manage your crypto portfolios.          Justin:  Your proposal said that you approached the Perpetual team. What did they say? What is the expected outcome of your conversations?   We spoke at length with the Perpetual Team and they have agreed to a grant for our BYE product, as with this proposal it is milestone aligned, the criteria is based on fees generated on their platform oppose to TVL accrued.     Justin:  For the 50% of tokens designed for incentives, can you articulate in more detail the structure of the incentives. What specifically will you incentivize and how will the incentive be designed?   These would be used either on xtoken terminal for incentivised LP on optimism, or alternatively Arrakis (formerly sorbet finance) we can create a v3 position and incentivise the vault. These incentives will most likely run between 6-12 months (we’re leaning more toward the latter end). Why would we incentivise the vault? It increases APR and creates sticky capital effect, the benefit being:  A larger liquidity pool. Easier access for more entrants into the product. Which then accrues more TVL.  It’s a fantastic positive feedback loop for the product, benefits Perpetual Protocol with more fees on their platform and increases TVL on the Optimism Network.     Justin:  What would trigger the 20% “potential extension of incentives”? And if you don’t use this 20% for incentives, what would you use it for?   This will come down to a number of factors, how well the product is doing, how far we’re into the original incentives, does the team feel the product requires the incentives extension, or is the yield attractive enough by itself to keep the TVL it has? Once the team has evaluated these factors, we would make an informed decision. It’s worth mentioning that this number would most likely be fluid (15%) is assigned, however perhaps we might use half, or alternatively we might move 10% from the development funding and use a total of 25% for the extension. It all depends on the factors highlighted above. If we do not use them for an extension, then the allocation would most likely be rolled into both development funding and provisioning product liquidity, the reason being is that we’re launching a suite of these Basis Yield products, this is just the first. Hope that covers off your points, again happy to answer any follow ups or clarify any points. ",
                    "links": [
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/a/aeba94fa4058ecf4d17ee04176b87846d8462436.png",
                        "https://www.tokensets.com/portfolio/optimism/bye",
                        "https://www.tokensets.com/portfolio/optimism/bye"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.985833610833611
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "4",
                    "likes": "2",
                    "time": "22/06/2022-10:37:41",
                    "content": "    duck:  Initial OP allocation of 300k tokens, as per tier 3 (from phase 0).   This one I did not understood, isnt Phase 0 over ? Or you mean, you are OP native and that is why 300K token? Could you please help me with this ? Idea of milestone based token allocation is a good move, with this proposal, are you asking 600K token for that and that will be distributed over 6-12 Months, right ? Out of 600K, 300K will be distributed as an incentive(for ?? as a user what do i need to do get the incentive ?), again in next 6-12 month and your goal is reach 15M of TVL, right ?  (15%) potential extension of incentives  so now there is a chance that you will use more 45000 OP token to incentive the users. Total token used for incentives are now (345000) used during 6-12 month just an user incentive? When I see this number, I see artificial users rushing just for rewards. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.429464285714286
                },
                {
                    "author_link": "https://gov.optimism.io/u/duck",
                    "index": "5",
                    "likes": "1",
                    "time": "22/06/2022-11:00:59",
                    "content": "Hi @OPUser,     OPUser:      duck:  Initial OP allocation of 300k tokens, as per tier 3 (from phase 0).   This one I did not understood, isnt Phase 0 over ? Or you mean, you are OP native and that is why 300K token? Could you please help me with this ?   You’re correct, phase 0 is over, however we were using the below metrics for our proposal:  Therefore the initial “tier 3” criteria allocation of 300k tokens would be upfront and would be used in the same categories as highlighted previously:  50% Incentives (6-12 months) either xtokenterminal or Arrakis (formerly sorbet finance) v3 vault. 30% Development funding. 15% Liquidity Provisioning. 5% Potential Incentives Extension.      OPUser:  Idea of milestone based token allocation is a good move, with this proposal, are you asking 600K token for that and that will be distributed over 6-12 Months, right ? Out of 600K, 300K will be distributed as an incentive(for ?? as a user what do i need to do get the incentive ?), again in next 6-12 month and your goal is reach 15M of TVL, right ?   The remaining 600k will only be provided if the milestones are met, each allocation of OP when provided 50% will be added to the incentives pool, so again would only be distributed over 6-12 months. Perhaps a longer distribution period of the incentives 12-24 months would be better suited? This way those who are interested in the incentives are more long term aligned with the Optimism Network, Perpetual Protocol and Galleon. To clarify we would happily extend to 12-24 months, it is actually better for us. We originally only chose 6-12 months after reviewing a number of existing proposals on the forum and it seemed to be the standard timeframe.     OPUser:   (15%) potential extension of incentives  so now there is a chance that you will use more 45000 OP token to incentive the users. Total token used for incentives are now (345000) used during 6-12 month just an user incentive? When I see this number, I see artificial users rushing just for rewards.   As I mentioned to Justin, this figure is fluid and could quite easily be re-allocated to development funding and liquidity provisioning for our other Suite products. Perhaps if we adjusted to 5% you would be more comfortable? With current market conditions, liquidity in the market is quite scarce but since our product is delta-neutral which removes market price risk we feel that the TVL is achievable within 6 months. That is an aggressive target, but ultimately should provide a reasonable time estimate for our milestone completion. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.566264005602241
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "6",
                    "likes": "1",
                    "time": "22/06/2022-11:25:54",
                    "content": "Hi @duck, Thank you providing detailed answer: - I don’t think you can use Phase 0 metrics, if we allow this to one project other will follow the same. You need to check this with OP Team and provide us the evidence, also provide an evidence if its already allowed, in the current form, I would vote against it. On milestones, if you are planning to only use the token once a milestone is reached, will it make more sense to ask for less amount of token, use it and come back again with new proposal, here the plus point is that you have data from your last proposal to support your new proposal. Even if we give them to you, you are not gonna use it unless the milestone is reached, so the token will be sitting on your address. But if OP Gov has this token, there is a possibility that we will give this to next eligible project and that will encourage competition, which is a positive thing. Regarding time frame, its highly depends on projects and person reading the proposal. If I see that this project does not need all the funding at once (especially new projects on OP chain or project having less amount of data to back their proposal), I will highly encourage them to submit multiple proposal. Again, my personal opinion, check with other delegates  too. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.335569985569986
                },
                {
                    "author_link": "https://gov.optimism.io/u/duck",
                    "index": "7",
                    "likes": "0",
                    "time": "22/06/2022-12:03:47",
                    "content": "    OPUser:  I don’t think you can use Phase 0 metrics, if we allow this to one project other will follow the same. You need to check this with OP Team and provide us the evidence, also provide an evidence if its already allowed, in the current form, I would vote against it.   Generally curious as to why you would vote against it, it seems like a fair, genuine metric to use.     OPUser:  On milestones, if you are planning to only use the token once a milestone is reached, will it make more sense to ask for less amount of token, use it and come back again with new proposal, here the plus point is that you have data from your last proposal to support your new proposal. Even if we give them to you, you are not gonna use it unless the milestone is reached, so the token will be sitting on your address. But if OP Gov has this token, there is a possibility that we will give this to next eligible project and that will encourage competition, which is a positive thing.   I think there is some confusion here, the whole purpose of the milestones is that the additional tokens are only paid once each individual milestone has been hit. To clarify we’re not asking for 900k tokens upfront. As previously mentioned milestones are a structure created to reward progress, and using this method in our proposal removes the need to submit multiple proposals. If we hit the milestones, the additional OP tokens are awarded in their respective batches, if we do not hit the milestones then the OP tokens are not awarded. It’s really that simple. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.422101449275363
                },
                {
                    "author_link": "https://gov.optimism.io/u/duck",
                    "index": "8",
                    "likes": "0",
                    "time": "22/06/2022-12:14:38",
                    "content": "    duck:   50% Incentives (6-12 months) either xtokenterminal or Arrakis (formerly sorbet finance) v3 vault. 30% Development funding. 15% Liquidity Provisioning. 5% Potential Incentives Extension.    I’ve also amended the above breakdown, reducing incentives extension from 15% → 5% and Development funding from 20% → 30%.     duck:  Over what period of time will the tokens be distributed? We plan to run a 12-24 month incentives programme, with a possible extension.   Additionally following this discussion I’ve amended the distribution of incentives from 6-12 months to 12-24 months, as this aligns over a longer term which is better for all parties involved. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.416666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "9",
                    "likes": "0",
                    "time": "22/06/2022-12:24:12",
                    "content": "    duck:  Generally curious as to why you would vote against it, it seems like a fair, genuine metric to use.   Simply because its not mentioned in the guideline of Phase 1 proposal, Governance Fund Phase 1: How to Create a Proposal. Unless I am missing something here, 300K is a huge number and I would expect OP team to mention this if this was allowed. I would suggest ask this question on discord temp-gov-channel, you can also tag me there if you want. This will help all of us.  I think there is some confusion here  I agree, I understood it wrong. This is now fine with me. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.697916666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/Cryptoz",
                    "index": "10",
                    "likes": "1",
                    "time": "22/06/2022-12:56:29",
                    "content": "You mention that this will be done in milestones, wouldn’t it be best to split this up into multiple proposals for each milestone when the time comes? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/duck",
                    "index": "11",
                    "likes": "0",
                    "time": "22/06/2022-13:15:23",
                    "content": "Personally, I think the milestones approach is better for the main purpose that it requires actual delivery. If we don’t deliver, then we don’t get rewarded the OP tokens. It’s also more straightforward, it seems unnecessary to run multiple proposals for the same objective outcome when it can just be covered with one proposal with required milestones deliverables. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.570833333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/Cryptoz",
                    "index": "12",
                    "likes": "1",
                    "time": "22/06/2022-13:18:32",
                    "content": "The thing is these funds are given 100% of funds up front from my knowledge and there is know one to release/check milestones for delivery. Please someone correct me if I am wrong. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 2.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/duck",
                    "index": "13",
                    "likes": "0",
                    "time": "22/06/2022-13:21:20",
                    "content": "Ah I see, I did not know this. Yes, perhaps the team can clarify. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Takeshi_Kovacs",
                    "index": "14",
                    "likes": "1",
                    "time": "23/06/2022-05:18:31",
                    "content": "I think I read somewhere that the delegates or team was going to check? I’m not sure, I’ve only seen a few on the forums but there would have to be some checking mechanism. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/millie",
                    "index": "15",
                    "likes": "3",
                    "time": "27/06/2022-17:44:26",
                    "content": "hey @duck thanks for the well written proposal. My main suggestion for this proposal is that it can be split into 3 separate applications based on the 3 milestones that are being referenced. Given that the expected timeline for distribution of the funds is between 12-24 months, I think it would make sense to break down the 900k requested over that period and apply for more funding after each milestone is achieved. As mentioned by others in the forum, there is no means by which delegates can checkpoint the development of Galleon and approve or recall the funds after they’ve been distributed. In my opinion the correct way to go about this proposal is to prepare a unique application for each milestone that represents a request for funding and re-propose it when the corresponding milestone is met. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.8217592592592595
                },
                {
                    "author_link": "https://gov.optimism.io/u/duck",
                    "index": "16",
                    "likes": "1",
                    "time": "28/06/2022-17:29:28",
                    "content": "Thanks for your replay @millie very much appreciated.     millie:  As mentioned by others in the forum, there is no means by which delegates can checkpoint the development of Galleon and approve or recall the funds after they’ve been distributed.   Following the general consensus I think you’re right, and I will look to amend this application to just the initial 300k OP. We will re-apply for additional grants as we grow our TVL. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.613095238095238
                },
                {
                    "author_link": "https://gov.optimism.io/u/duck",
                    "index": "17",
                    "likes": "1",
                    "time": "29/06/2022-13:06:30",
                    "content": "I have amended the proposal to exclude the milestones as these will be put into separate proposal applications as we grow our TVL. Proposal changes:  Request of 900k → 300k tokens, with milestones removed. Removed the (5%) incentives extension and reallocated it to dev funding from (30%) → (35%).  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/ScaleWeb3",
                    "index": "18",
                    "likes": "2",
                    "time": "01/07/2022-14:55:31",
                    "content": "We’d be happy to see IndexCoop, Galleon and your innovative products on Optimism as we see big potential in simplified financial products easily purchasable for the masses (->l2, exchanges). Your initial ask was way out of scope for the size of your project. The adjusted ask is on the high end compared to other funding amounts but more in line. When we consider funding small projects, we do not focus on co-incentives (nice to have) but mainly look for products/tools with value-add for the Op ecosystem, network effects, and long-term builders in the ecosystem. Generally, we like milestone funding but in this early Optimism governance phase it’s easier to fully focus on a first proposal in Phase 1. More potential collaborations in the future incl. new proposals and co-growth initiatives show certainly good long-term alignment and faciliate our assessment  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.076515151515151
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "19",
                    "likes": "2",
                    "time": "01/07/2022-17:26:42",
                    "content": "thank you for updating the proposal, this one look better. I wanted to check where are you planning to spend 35 of Dev funding? Developing something new on OP chain? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.590909090909091
                },
                {
                    "author_link": "https://gov.optimism.io/u/duck",
                    "index": "20",
                    "likes": "0",
                    "time": "07/07/2022-09:47:50",
                    "content": "    ScaleWeb3:  Your initial ask was way out of scope for the size of your project. The adjusted ask is on the high end compared to other funding amounts but more in line. When we consider funding small projects, we do not focus on co-incentives (nice to have) but mainly look for products/tools with value-add for the Op ecosystem, network effects, and long-term builders in the ecosystem.   Appreciate the feedback, the original ask was only ever to be realised once we had hit the milestones. Obviously that has been scrapped for now, however, we will be creating more proposals as we grow our TVL. Our first product was actually launched in February and on Optimism long before any airdrop was announced. So we feel we’re fully long-term aligned with both Optimism and Perpetual Protocol. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.7595238095238095
                },
                {
                    "author_link": "https://gov.optimism.io/u/duck",
                    "index": "21",
                    "likes": "1",
                    "time": "07/07/2022-09:50:40",
                    "content": "    OPUser:  I wanted to check where are you planning to spend 35 of Dev funding? Developing something new on OP chain?   That’s correct, we will be building a suite of these delta-neutral products and just in general will be launching more products on optimism utilizing PERP v2 (we’re fans of the protocol). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.143939393939394
                },
                {
                    "author_link": "https://gov.optimism.io/u/duck",
                    "index": "22",
                    "likes": "0",
                    "time": "28/07/2022-16:30:37",
                    "content": "Bumping this, would be good to know whether we can move to next steps. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/katie",
                    "index": "23",
                    "likes": "1",
                    "time": "07/08/2022-18:14:30",
                    "content": "    duck:  Galleon will target to be incentivising equally in parallel but as the DAO is at a very early stage and at a very small total capitalisation, the incentives may vary initially.   This is pretty vague, can you please expand on this? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.682142857142857
                },
                {
                    "author_link": "https://gov.optimism.io/u/duck",
                    "index": "25",
                    "likes": "0",
                    "time": "09/08/2022-10:19:16",
                    "content": "    katie:      duck:  Galleon will target to be incentivising equally in parallel but as the DAO is at a very early stage and at a very small total capitalisation, the incentives may vary initially.   This is pretty vague, can you please expand on this?   Sure, we would love to incentivise 1:1 rewards however because we’re a sub <1m market cap project, we have to stretch our incentives over a longer time frame than the OP incentives. Our rewards were going to be 24-36 months, and OP was 6-12, however we have since amended the OP incentives to 12-24. Hope that makes sense? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.308333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "26",
                    "likes": "1",
                    "time": "29/09/2022-02:14:49",
                    "content": "hey wanted to check in to see where you all are at with this ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/duck",
                    "index": "27",
                    "likes": "0",
                    "time": "31/10/2022-13:41:28",
                    "content": "Hi @jackanorak Thanks for following up, our application is still open. Due to market conditions we’ve not been promoting our Basis Yield ETH product since the whole market was shorting (until recently) which isn’t ideal conditions for the product. We do have a dynamic leverage ETH product which will be launching on Optimism, most likely planned for early in the new year which we think will be an attractive product which should draw decent TVL to Optimism. We again would utilize the Optimism to incentivise this product at launch. Would love to know if there is any further requirements or information delegates require to get support on the proposal? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.05563446969697
                }
            ]
        }
    ],
    "group_index": "104"
}