{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/who-should-i-delegate-to/2546",
            "title": "Who should I delegate to? ",
            "index": 2546,
            "category": [],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/HaOm",
                    "index": "1",
                    "likes": "9",
                    "time": "07/06/2022-10:17:50",
                    "content": "Who should I delegate to? This is no endorsement on my part. Just a discussion to see what you Optimists think regarding your voting power. I for one have nominated myself, this was not an easy decision. I don’t think I’m fully capable of understanding all the requirements and responsibilities, yet. But I do think this will encourage me to participate more and ideally be of some use. What are your thoughts on decision-making? Will you also be nominating yourself for voting? Or will you be delegating your vote to any of the well-presented candidates? Stay Optimistic! ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.666666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/MinimalGravitas",
                    "index": "2",
                    "likes": "3",
                    "time": "07/06/2022-10:20:36",
                    "content": "    HaOm:  I for one have nominated myself, this was not an easy decision. I don’t think I’m fully capable of understanding all the requirements and responsibilities, yet. But I do think this will encourage me to participate more and ideally be of some use.   Sounds like a great attitude! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.033333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/HaOm",
                    "index": "3",
                    "likes": "1",
                    "time": "07/06/2022-10:22:06",
                    "content": "Might just be my bravado typing, but I’m optimistic to make a difference! Like-minded folks like yourself are a great influence! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "4",
                    "likes": "3",
                    "time": "07/06/2022-11:45:58",
                    "content": "This is what I wish to see, delegating your token/voting power is cool concept but it can also leads to centralized voting power, give that many people choose to vote selected few people. Right now we have approx 8K delegates, I cant wait to see it change to 10K, 20K and so on. More option, more thoughts and opinion might lead us to a better decentralized ecosystem. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.739795918367346
                },
                {
                    "author_link": "https://gov.optimism.io/u/HaOm",
                    "index": "5",
                    "likes": "2",
                    "time": "07/06/2022-11:50:21",
                    "content": "That’s a very valid point. Early on the idea of delegating makes sense, but to scale we might need to think more in numbers. Perhaps once voting is live and the decisions begin to create an impact this may encourage more people to take action! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.301136363636363
                },
                {
                    "author_link": "https://gov.optimism.io/u/ens0",
                    "index": "6",
                    "likes": "4",
                    "time": "08/06/2022-10:03:39",
                    "content": "I had delegated my vote to someone else. but now i will use it myself. I think the more decentralized the governance, the better. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "7",
                    "likes": "3",
                    "time": "08/06/2022-15:14:50",
                    "content": "there are very few comment on this gov portal that i can recall since i joined and this is gonna be one of them. Its like running a solo validator node just to support decentralization. Kudos and welcome ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.35
                },
                {
                    "author_link": "https://gov.optimism.io/u/ens0",
                    "index": "8",
                    "likes": "3",
                    "time": "10/06/2022-21:38:11",
                    "content": "thnx ser. together we will bring this protocol to better places ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/coyaj21",
                    "index": "9",
                    "likes": "1",
                    "time": "05/07/2022-23:49:01",
                    "content": "I personally prefer to self delegate, although I don’t think I can find time to take part in every vote  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/0xzenodotus",
                    "index": "10",
                    "likes": "3",
                    "time": "07/07/2022-17:05:56",
                    "content": "I’ve been a fan of Optimism from the very beginning, seeing the level of care and attention that Optimism has put towards governance has not only impressed me but it compounded my conviction for transparent, decentralized governance. When it comes to governance, I think it’s important to consider the level of decentralization for the council of delegates. It’s also prudent to consider the underlying connections and attachments of the delegates and whether there are conflicting views, biases or other. I suspect the vast majority will remain ethical and mindful of their influence. However, we must not inherently place trust in groups or persons in this industry — or most other industries. Trust should be earned and visibility does not equate to a consistent trust factor. Verifiable actions, words and results are the foremost indicator for trust. With that being said, it will become easier in time to recognize honest actors active within governance. By sharing our opinions and being consistent with ethics, morals and virtues, it becomes much easier to express ourselves and critique one another— without much fears of being shunned, turned away directly or discouraged. If anyone doesn’t feel they can give enough time to direct governance, I’m more than willing to step up and be a delegate. I take pride in my work in general and governance is one component of this space that drew me in and got me hooked.  I did write a blurb on the delegates commitment page: Delegate Commitments - #117 by knowledgeable-idiot ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.051587301587301
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "11",
                    "likes": "0",
                    "time": "13/09/2022-16:52:18",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "12",
                    "likes": "0",
                    "time": "13/09/2022-19:35:51",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/vanzoo",
                    "index": "13",
                    "likes": "0",
                    "time": "25/10/2022-11:43:48",
                    "content": "Is there a list of delegates with info? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Tjark",
                    "index": "14",
                    "likes": "4",
                    "time": "25/10/2022-12:51:52",
                    "content": "There is! It’s here: Delegate Commitments Or here (this one only gets updated once per Season). ",
                    "links": [
                        "https://app.optimism.io/delegates"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/jaemokha",
                    "index": "15",
                    "likes": "2",
                    "time": "17/01/2023-06:18:50",
                    "content": "It looks good to delegate when it’s hard to judge. Let’s delegate it to people with good ideas. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.847222222222222
                }
            ]
        }
    ],
    "group_index": "77"
}