{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/draft-gf-phase-1-proposal-myoptiboyz-nft/4866",
            "title": "[DRAFT] [GF: PHASE 1 Proposal] Myoptiboyz NFT ",
            "index": 4866,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Governance Fund: Phase 1"
            ],
            "tags": [
                "season-3",
                "cycle-10",
                "not-passed"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/SUMIT",
                    "index": "1",
                    "likes": "4",
                    "time": "29/01/2023-12:28:17",
                    "content": "Project name: MyOptiBoyz NFT Author name:Sumit on behalf of Myoptiboyz NFT L2 recipient address: 0xF6BEFcFDe07bbFfE58A9a579804bD72d1e192723 Grant category: NFTs & Gaming Number of OP tokens requested: 10,000 Is/will this project be open sourced? Yes. We are CC0. I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: Yes Is this proposal applicable to a specific committee? Yes  IMG_20230129_150227798×797 130 KB  Project description: A 2555 PFP Cool Boyz,  project encouraging Cool Health , Good Looking & Wellness in Web3. Project links: MyOptiBoyz NFT 🔴✨ | Quix   OpenSea    MyOptiBoyz NFT - Collection | OpenSea Let's Enjoy With Cool Boyz Collection of 2555 OptiBoyz ! No Roadmap no promises, only cool boys enough for vibe , we want to give you all a unique pfp .      https://twitter.com/MyOptiBoyzNFT?t=jtyLsKCpdaz2W2OMNaVBQg&s=09 Additional team member info: There’s Have only one man on team , AngrySumit#6512 he is the Artist & Dev , we are not a popular known on OP NFT . just trying to learn more about OP Ecosystem OP NFT community. Relevant usage metrics: 472 Unique Holders 350 Trades 0.29 E Trading Volume Smart Contract: The Contract Address: 00x2D40eB17E68d790940e1005A736D7b878A81F471 Optimism native? Yes. Ecosystem Value Proposition: Our focus is improving Our Youngers and teenagers  Boyz Coolest personalty & Wellness in Web3 through our art. We have a very active and passionate community of Boyz focused on self improvement in and out in Selfies or through some videos , Through community efforts such as giveaways and  challenges, we want to grow some more to be near of the top NFT projects on Optimism . As we scale we plan to introduce more and more benefits to our holders such as fitness and wellness/mental health counseling, Show the priority and Joy of our teenagers boyz , The art was hand drawn with generated by myself with attention to detail in mind - with the goal of bringing more normal users, as well as degenerates into Optimism. we are a community of like minded fitness and to be Handsome lovers and are working to bring more users into Optimism with our existing relationships and by building new ones. Optimism cannot succeed without a vibrant NFT community. NFTs bring new entrants into the ecosystem, hype, and stickiness. These are things we need to develop and foster together! \"Proposal for token distribution:\" We’ve partnered with https://quest3.xyz/ a Web3 Quest and event platform, and will use their service to do a series of fitness related contests where we can reward our NFT holders OP provided they completed the tasks. The Quest3 incentives would be the first of their kind, essentially the NFT community’s equivalent to DeFi’s incentivized liquidity mining as I see it. For verification we are able to review submissions manually through the platform before rewards are dispersed.We plan to use some of the funds to set a reward of 1 OP for users who follow our social media channels.This direct marketing approach is a more effective and efficient use of capital by leveraging Web3. The result should be exponential growth and awareness, and a positive network effect. We would like to have a series of weekly quests over a period of 2 months, beginning with a contest that rewards holders who have done a certain amount of steps, followed by a Wear a Sunglass and they Looking Cool like our nfts chalange and the next week, etc. ",
                    "links": [
                        "https://qx.app/collection/optiboyz-collection",
                        "https://opensea.io/collection/my-optiboyznft",
                        "https://opensea.io/collection/my-optiboyznft",
                        "https://twitter.com/MyOptiBoyzNFT?t=jtyLsKCpdaz2W2OMNaVBQg&s=09",
                        "https://quest3.xyz/"
                    ],
                    "GPT-summary": "The post is a draft proposal for a project called MyOptiBoyz NFT, which is a collection of 2555 PFP Cool Boyz NFTs. The author provides details about the project, including the team, usage metrics, and ecosystem value proposition. The proposal includes a plan for token distribution, which involves partnering with a Web3 Quest and event platform to do a series of fitness-related contests to reward NFT holders. The post could be categorized as an explanation of the proposal, with positive feedback and constructive criticism from third parties, as well as advertising the proposal and answering questions about it.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "NFTs & Gaming",
                        "Community and engagement",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 6.205919687950939
                },
                {
                    "author_link": "https://gov.optimism.io/u/Ftm_Rich",
                    "index": "2",
                    "likes": "1",
                    "time": "29/01/2023-20:00:34",
                    "content": "this collection is awesome! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Foruse959",
                    "index": "3",
                    "likes": "1",
                    "time": "30/01/2023-03:16:40",
                    "content": "It they got fund they can do more better. Op team should need to look at this and help small community to grow. Atleast allot some small op token team ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://gov.optimism.io/u/GrantsOps",
                    "index": "4",
                    "likes": "0",
                    "time": "31/01/2023-15:57:03",
                    "content": "Please note that the form for Season 3 has requirements that have not been filled out here. Feel free to update this form to include the questions in the Season 3 proposal template or to submit a new application here. ",
                    "links": [
                        "https://foul-porch-0eb.notion.site/Application-2d47da131a004e94a74e56af9438026b"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.5606060606060606
                }
            ]
        }
    ],
    "group_index": "450"
}