{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/infrastructure-dependencies-nominations-for-rpgf2/4637",
            "title": "Infrastructure & Dependencies nominations for RPGF2 ",
            "index": 4637,
            "category": [
                "\\xf0\\x9f\\x94\\xb4 RetroPGF"
            ],
            "tags": [
                "nominations",
                "rpgf2"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/system",
                    "index": "1",
                    "likes": "109",
                    "time": "17/01/2023-20:39:43",
                    "content": " Infrastructure & Dependencies nominations for RetroPGF2 This is the thread to nominate projects for the Infrastructure and dependencies category of RetroPGF round 2. Please familiarize yourself with the Nominations process for RetroPGF round 2.   Overview of Timelines  Project nominations: Jan 17 19:00 GMT - Jan 31 19:00 GMT Final project opt-in deadline: Feb 21 Voting: Mar 7 - Mar 21   image1920×960 32.1 KB    Scope of this round RetroPGF round 2 is dedicated to projects that support development and usage of the OP Stack. For the category of Infrastructure + Dependencies you may nominate:  Software used to build or deploy the OP Stack; Contributions to protocols or standards upon which the OP Stack runs Experiments that support future development of the core OP Stack protocol  Note: The OP Stack refers to the OSS code powering Optimism. Today, this means the Optimism monorepo and its dependencies. Eligible projects need not be exclusive to the Optimism ecosystem, but there should be a connection. For example,   go-ethereum is an important dependency of the OP Stack, but is not Optimism-specific.  Ethereum L2 explorer pages which give stats on various L2s provide educational impact for the OP Stack, but are not Optimism-specific    How to Nominate a Project Things to consider when nominating a project:  Try to describe as best as you can how this project has delivered impact relating to the scope of this round. Make sure to nominate projects in the relevant category Before nominating a project please see if this project has been nominated already, so we can avoid duplication.  For Projects:  If you are a project looking to participate in this round please have a read of the Project Manual, it has an overview of the process and an FAQ section to answer questions that might come up. For your project to be eligible you will need to opt into the round and complete a project profile in the RetroPGF application manager by Feb 21 - 19:00 GMT. This will include providing more information about your project and verifying your Github or Twitter account. The application manager will be launched by end of Jan, more details to follow on this soon! Any project without a correctly verified GitHub or Twitter account, any project impersonating another team, any project not relating to the scope of the round, or any project without a complete profile may be hidden from the voting round at the Foundation’s discretion. Projects are allowed to nominate themselves. Here the term “project” can describe work that has been done by both an individual or a group. Collections, a term used to describe projects without a single person or entity that can be verified via GitHub or Twitter, may only be nominated by the Optimism Foundation.   Please use this template to Nominate a project:   The projects name:  A description of how the project has supported development and usage of the OP Stack:  A link to the project’s GitHub or Twitter:  (optional) contact info for the project or project lead:  Project Nominations will close by Jan 31 at 19:00 GMT ",
                    "links": [
                        "https://gov.optimism.io/t/nominations-for-retropgf2/4636",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/9/92641e36df38e211a100c529eb4a756c9d3001d6.png",
                        "https://oplabs.notion.site/Optimism-RetroPGF-2-Project-Manual-0a2e741133cd49b0b005ff759934b998",
                        "https://app.optimism.io/retropgf-manager",
                        "https://gov.optimism.io/t/where-can-i-nominate-for-round-2/4699/2",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/28",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/29"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.209020146520147
                },
                {
                    "author_link": "https://gov.optimism.io/u/DanieleSalatti",
                    "index": "2",
                    "likes": "59",
                    "time": "17/01/2023-22:13:13",
                    "content": "I’ll get the ball rolling    The projects name: Optimism DAppNode Package   A description of how the project has supported development and usage of the OP Stack: This is a package I created that lets home users easily run an Optimism node on their DAppNode. 3 clicks (and a few days while it syncs) will get you a full node. It is now part of the official collection of packages in the DAppStore.   A link to the project’s GitHub or Twitter: https://github.com/DanieleSalatti/DAppNodePackage-optimism   Contact info for the project or project lead: Myself - you can message me here or on Twitter @DanieleSalatti   ",
                    "links": [
                        "https://twitter.com/DanieleSalatti"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.972222222222222
                },
                {
                    "author_link": "https://gov.optimism.io/u/FractalVisions",
                    "index": "3",
                    "likes": "91",
                    "time": "18/01/2023-01:49:54",
                    "content": "Happy to be here on Optimism!   The projects name: Fractal Visions NFT Marketplace   A description of how the project has supported development and usage of the OP Stack: The need for prevailing NFT marketplaces has been an integral part of the Optimism ecosystem and we have worked very hard to establish a high level of social recognition for the OP NFT community with the use of optimistic blockchain scaling technology by constantly expanding our user base & key partners within our own network.     Ecosystem Awareness - The growth we have seen over the most recent Q4 of 2022 has been exceptional with close to 100,000 free NFT claims on layer two via Galxe & Quest3 platforms.   Retropgf.eth donations - Besides the educational based quests we also have 8 different NFT projects that continue to contribute directly to the Retropgf.eth address and we will continue to expand this aspect of our project with educational efforts as we onboard new users.     Current development of an Optimism centric NFT marketplace to house our core native ecosystem NFT collections from Fractal Visions will assist in the initial formation of committee members for our future DAO voting structure related to the NFT market. This will expand into a high level niche category art & music marketplace as we curate the artists who join the layer two ecosystem after our initial launch and begin implementation of off chain voting via snapshot for artist curation with the community after the initial artist line up has been established.   Dedicated tooling for an Optimism NFT Launchpad are also in the plans of development once our secondary marketplace operations have officially opened to the public. Recently the addition of the “Attestation Station” has also become another integration we are going to plan on implementing with our marketplace.   Our goal is to help educate or assist other creators about crucial information and proper guidance when choosing deployment on the Optimism network for NFTs. This begins with basic 101 eduction on safety & security about blockchain technology before bringing them into the ecosystem.     A link to the project’s GitHub or Twitter: FRACTAL VISIONS TWITTER   Contact info for the project or project lead: Myself - You can message my business account or personal account on Twitter @iglivision    ",
                    "links": [
                        "https://twitter.com/iglivision"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4018480257116614
                },
                {
                    "author_link": "https://gov.optimism.io/u/diligit",
                    "index": "7",
                    "likes": "42",
                    "time": "18/01/2023-09:22:30",
                    "content": "The projects name: Lattice A description of how the project has supported development and usage of the OP Stack: The Lattice team built an Autonomous World - OP Craft, a 3D voxel-on-chain world on top of the OP Stack, for me and for all optimists the first OP Chain we could test and explore, and a first step towards the infinite possibilities and ideas that can be realised on the OP Stack. A link to the project’s GitHub or Twitter: GitHub - latticexyz/opcraft (optional) contact info for the project or project lead: https://twitter.com/latticexyz ",
                    "links": [
                        "https://github.com/latticexyz/opcraft",
                        "https://twitter.com/latticexyz"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/cryptobitten",
                    "index": "8",
                    "likes": "22",
                    "time": "18/01/2023-10:06:32",
                    "content": "Project name: Nested Nested is the first one-stop DeFi app to build, manage and monetize portfolios. Very simple and intuitive app. Site: app.nested.fi ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://gov.optimism.io/u/Thong",
                    "index": "9",
                    "likes": "27",
                    "time": "18/01/2023-10:16:52",
                    "content": "  The projects name: Nested  A description of how the project has supported development and usage of the OP Stack: Nested help an average users to onboard DeFi in less than 5 minutes.   Nested abstract the nitty gritty of DeFi learning curve bottleneck that keep average internet users shy from interacting with the Decentralize Finance world. Interacting and managing crypto assets on OP with Nested is an enjoyable experience to view portfolio, edit allocations, and research other’s portfolio movements and strategies.    A link to the project’s GitHub or Twitter: https://twitter.com/Nestedfi   (optional) contact info for the project or project lead: https://twitter.com/RudyKadoch   ",
                    "links": [
                        "https://twitter.com/RudyKadoch"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.5773809523809526
                },
                {
                    "author_link": "https://gov.optimism.io/u/sosmart",
                    "index": "10",
                    "likes": "15",
                    "time": "18/01/2023-10:23:12",
                    "content": "Project name:NestedFi NestedFi a unique project in the optimism ecosystem that combines the amazing technologies of NFT+DEFI+Social.The project has no competitors and attracts new users to the ecosystem because of its simplified interaction with the platform.Nested added the optimism network back in April 2022, indicating early support for the optimism ecosystem.At the moment, in the network optimism created 1460 investment portfolios, supporting the project grant it will be able to expand its user base, and therefore benefit optimism.The protocol team is creating something unique that aims to expand the DEFI ecosystem through social interaction. My personal opinion is that a grant from optimism will help the protocol create a flywheel to attract new users to the ecosystem. https://twitter.com/NestedFi https://twitter.com/RudyKadoch  - The founder of the project ",
                    "links": [
                        "https://twitter.com/RudyKadoch"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.710858585858586
                },
                {
                    "author_link": "https://gov.optimism.io/u/norswap",
                    "index": "15",
                    "likes": "19",
                    "time": "18/01/2023-15:32:54",
                    "content": "I also want to add my vote to Lattice (I know we’re not voting, this is a manner of speaking). I’ll add two things:  They’re also to credit for the creation of MUD (https://mud.dev/) an entity-component-system (ECS) framework for fully on-chain. There are already multiple games building on MUD, including OPCraft and SkyStrife. As a grant-funded organization, it’s certain that Lattice’s impact has been greater than its profits.  ",
                    "links": [
                        "https://www.youtube.com/watch?v=NVXcfS2oMlE"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.190476190476191
                },
                {
                    "author_link": "https://gov.optimism.io/u/Muzafar18",
                    "index": "20",
                    "likes": "7",
                    "time": "18/01/2023-19:29:34",
                    "content": "Project name: Nested Nested is the first one-stop DeFi app to build, manage and monetize portfolios. Very simple and intuitive app. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://gov.optimism.io/u/drahlraigon",
                    "index": "22",
                    "likes": "9",
                    "time": "18/01/2023-21:34:57",
                    "content": " The projects name**: Nested fi Description of the projects development and usage of the OP Stack:    Nested helps the new and shy users to onboard the world of Decentralised Finance.   Interacting and managing crypto assets on OP with Nested is an enjoyable experience to view portfolio, edit allocations, and research other’s portfolio movements and strategies.   A link to their Twitter: https://twitter.com/Nestedfi   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.014204545454546
                },
                {
                    "author_link": "https://gov.optimism.io/u/Elodhan",
                    "index": "23",
                    "likes": "6",
                    "time": "18/01/2023-21:56:34",
                    "content": "NestedFi It is a variation of Optimistic Rollup which uses a nested structure of rollups to enable more complex use cases such as general state channels, flash loans, and more. The idea behind NestedFi is to create more flexible layer 2 scaling solution by adding more layer 2 scaling on top of an existing layer 2 scaling NestedFi Twitter NestedFi ",
                    "links": [
                        "https://nested.fi/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.027777777777778
                },
                {
                    "author_link": "https://gov.optimism.io/u/Grandad777",
                    "index": "28",
                    "likes": "7",
                    "time": "19/01/2023-12:58:50",
                    "content": "I want to nominate The Granary https://granary.finance/ I found this project during the OP quests, which i really love. I’m so bullish on Optimism going forward ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/boerbasss",
                    "index": "30",
                    "likes": "5",
                    "time": "19/01/2023-21:50:36",
                    "content": "The projects name Quix NFT platform A description of how the project has supported development and usage of the OP Stack Its a platform where you can buy and sell NFTS with OPTIMISM network Its very cheap in gas fees and very fast They use Optimism network and with that way they use the OP stack and support OP very well! A link to the project’s GitHub or Twitter https://twitter.com/qx_app contact info for the project or project lead https://twitter.com/qx_app ",
                    "links": [
                        "https://twitter.com/qx_app"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.716666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/arabianhorses",
                    "index": "31",
                    "likes": "6",
                    "time": "19/01/2023-22:17:05",
                    "content": "  The projects name: L2Planet  A description of how the project has supported development and usage of the OP Stack: -Sharing news and developments in our bi-weekly issues Superchain Article  (English) -Running ‘OptimismTR’ Twitter and Youtube accounts. OptimismTR Twitter - (Turkish) -Preparing tutorial videos for special events like Quest Warden Swap OP Incentives Guide (Turkish) -Recording bi-weekly videos that cover governance and technical things Bi-weekly series Episode 4 (Turkish) -Building Optimism dApp store and dashboard (under construction) on our website L2planet Optimism (English)  A link to the project’s GitHub or Twitter: Github - Twitter   (optional) contact info for the project or project lead: Discord: 0xemre#5457 Telegram   Transparency note: I am a member of layer2planet team, we are 8 people in total. ",
                    "links": [
                        "https://twitter.com/OptimismTR",
                        "https://www.youtube.com/watch?v=SHxJmT87ERM",
                        "https://www.youtube.com/watch?v=dVJOtdUH_m4&t=273s",
                        "https://l2planet.xyz/layer2s?id=optimism",
                        "https://github.com/l2planet",
                        "https://twitter.com/layer2planet",
                        "https://t.me/layer2emre"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.357142857142857
                },
                {
                    "author_link": "https://gov.optimism.io/u/tynes",
                    "index": "32",
                    "likes": "9",
                    "time": "20/01/2023-01:58:16",
                    "content": "The projects name: The Linux Foundation A description of how the project has supported development and usage of the OP Stack: The Linux Foundation supports the development of Linux, which is heavily used by the cloud infrastructure required to run mainnet Optimism. Without the years of open source work done on the LInux kernel, we would be in a world where proprietary operating systems are the norm in cloud computing. Recent additions to the Linux kernel are speeding up disk i/o, which is a major bottleneck for execution.  It is definitely possible to squeeze out more performance of go-ethereum by optimizing the operating system it runs on. The Linux Foundation has tiers of sponsors: Platinum Membership\t$500,000\t Gold Membership\t$100,000\t Silver Membership\t$5,000 You can see who the various members are here A link to the project’s GitHub or Twitter:   GitHub    GitHub - torvalds/linux: Linux kernel source tree Linux kernel source tree. Contribute to torvalds/linux development by creating an account on GitHub.      (optional) contact info for the project or project lead: ",
                    "links": [
                        "https://github.com/torvalds/linux",
                        "https://github.com/torvalds/linux"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.258928571428571
                },
                {
                    "author_link": "https://gov.optimism.io/u/relliownptah22",
                    "index": "33",
                    "likes": "3",
                    "time": "20/01/2023-04:29:56",
                    "content": "Project name: Pool together Pool together is a lossless prize savings protocol. Found this doing the quests https://twitter.com/PoolTogether_ ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/AyDUNE",
                    "index": "34",
                    "likes": "7",
                    "time": "20/01/2023-13:45:39",
                    "content": "  The projects name: Fractal Visions NFT Marketplace   A description of how the project has supported development and usage of the OP Stack: The need for prevailing NFT marketplaces has been an integral part of the Optimism ecosystem and we have worked very hard to establish a high level of social recognition for the OP NFT community with the use of optimistic blockchain scaling technology by constantly expanding our user base & key partners within our own network.   Ecosystem Awareness - The growth we have seen over the most recent Q4 of 2022 has been exceptional with close to 100,000 free NFT claims on layer two via Galxe & Quest3 platforms.   Retropgf.eth donations - Besides the educational based quests we also have 8 different NFT projects that continue to contribute directly to the Retropgf.eth address and we will continue to expand this aspect of our project with educational efforts as we onboard new users.    Current development of an Optimism centric NFT marketplace to house our core native ecosystem NFT collections from Fractal Visions will assist in the initial formation of committee members for our future DAO voting structure related to the NFT market. This will expand into a high level niche category art & music marketplace as we curate the artists who join the layer two ecosystem after our initial launch and begin implementation of off chain voting via snapshot for artist curation with the community after the initial artist line up has been established. Dedicated tooling for an Optimism NFT Launchpad are also in the plans of development once our secondary marketplace operations have officially opened to the public. Recently the addition of the “Attestation Station” has also become another integration we are going to plan on implementing with our marketplace. Our goal is to help educate or assist other creators about crucial information and proper guidance when choosing deployment on the Optimism network for NFTs. This begins with basic 101 eduction on safety & security about blockchain technology before bringing them into the ecosystem.   A link to the project’s GitHub or Twitter: FRACTAL VISIONS TWITTER   Contact info for the project or project lead: Myself - You can message my business account or personal account on Twitter @iglivision   ",
                    "links": [
                        "https://twitter.com/iglivision"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.258155776515151
                },
                {
                    "author_link": "https://gov.optimism.io/u/Nelli",
                    "index": "38",
                    "likes": "0",
                    "time": "20/01/2023-19:53:32",
                    "content": "sounds useful, and i like how you added your two things so we can have a bigger picture about the project. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/ceresstation",
                    "index": "39",
                    "likes": "0",
                    "time": "20/01/2023-23:39:46",
                    "content": "(post deleted by author) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/ceresstation",
                    "index": "40",
                    "likes": "8",
                    "time": "20/01/2023-23:47:22",
                    "content": "  The project name: go-ethereum   A description of how the project has supported development and usage of the OP Stack:  go-ethereum is a core dependency and actually straight up one of the examples given, so I figured it should of course be nominated it’s a perfect example because it’s such a core piece of tech in the Ethereum ecosystem, and Peter has stayed the course to maintain it even in the face of many opportunities to work on more lucrative projects in general, many core devs are underfunded and hopefully this nomination will be the first of many in the round that considers some of the builders whose shoulders we’ve almost all stood on    A link to the project’s GitHub or Twitter:  GitHub: go-ethereum · GitHub  Twitter: https://twitter.com/peter_szilagyi     ",
                    "links": [
                        "https://github.com/ethereum/go-ethereum",
                        "https://twitter.com/peter_szilagyi"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.65
                },
                {
                    "author_link": "https://gov.optimism.io/u/0xtootoo",
                    "index": "41",
                    "likes": "10",
                    "time": "21/01/2023-02:15:00",
                    "content": "Honor to be here on Optimism！Here’s my nomination：   The projects name: DefiLIama   A description of how the project has supported development and usage of the OP Stack:  Defi Llama, as the name suggests, is an information platform for Defi data. We can get a lot of updated and rich Defi data on Defi Llama, including the most commonly discussed TVL, various decentralized （Protocol）, current Airdrop scenarios, and changes in different chains of currencies. The Defi is also categorized by function, allowing users to quickly find the current changes in the target asset. Users can view the data of each Dapp under OP through DefiLIama and make their judgment based on these data. By comparing, users can better discover the potential projects under OP and give strong support, instead of unconsciously coming for airdrops led by KOL.    A link to the project’s GitHub or Twitter:DefiLIama Twitter   contact info for the project or project lead:Twitter @LIamaNodes   ",
                    "links": [
                        "https://twitter.com/DefiLlama?s=20&t=DI8GVyiIBJ2ETfy-o9nZ9Q"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.837121212121213
                },
                {
                    "author_link": "https://gov.optimism.io/u/Ayush",
                    "index": "42",
                    "likes": "3",
                    "time": "21/01/2023-06:07:53",
                    "content": "The projects name: Nested About: Nested is a social trading platform that intends to revolutionize DeFi for good by making it social – hence rendering it accessible to CeFi users. In that sense, Nested is trailblazing SocialFi to open up crypto investment to the world. Nested allows DeFi newbies to copy strategies that correspond to what they are looking for while giving the opportunity to more experienced DeFi traders, such as community leaders, to earn royalties every time one of their portfolios is copied — and enjoy a seamless asset management experience. The company’s solution makes crypto investment easier, more social, versatile, and affordable thanks to its use of NFT technology that reduces transaction fees and facilitates management – with only one transaction needed for up to twelve assets. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.3125
                },
                {
                    "author_link": "https://gov.optimism.io/u/kelvin",
                    "index": "43",
                    "likes": "14",
                    "time": "21/01/2023-21:02:34",
                    "content": "Project Name Otterscan Description Otterscan is a fast, local, free & open source Ethereum block explorer. Otterscan is designed to run on consumer hardware so that it can be utilized locally. Otterscan therefore reduces the trust assumption that many of us implicitly place on third-party block explorers, a critical point of failure in the current Ethereum ecosystem. Furthermore, existing block explorers understand their dominant position within the space and are able to charge large fees to run hosted explorers for chains. Ethereum wins when good infrastructure is cheap and open source, and Otterscan has embodied this concept for years. Otterscan currently relies on a connection to an Erigon node. With the Bedrock upgrade, Optimism will be one of the only chains other than Ethereum that can support an Erigon node (development on op-erigon is already under way). This means Optimism will be uniquely positioned to benefit from Otterscan’s work in the short term. As a result, supporting Otterscan for its past impact on Ethereum will also directly help create future impact on Optimism. Otterscan’s design philosophy also helps other teams outside of Otterscan to create impact. For example, Otterscan’s UI is cleanly decoupled from its API so that anyone can easily fork Otterscan’s interface and add new features or fix bugs. Otterscan also actively pushes for decentralization by integrating tools like Sourcify, a decentralized alternative to Etherscan contract verification. Otterscan is currently being developed by a single developer, Willian Mitsuda, with a small amount of financial support from the Erigon team. Rewarding Otterscan through RetroPGF would allow the Otterscan team to grow and create even more impact for both Optimism and Ethereum. In my opinion, open source infrastructure like Otterscan is the perfect candidate for RetroPGF. Links  Otterscan on Twitter Otterscan on GitHub Willian Mitsuda on Twitter  Contact  Willian Mitsuda on Twitter  Disclaimers I work for OP Labs. I am making this nomination in my capacity as an individual and not on behalf of OP Labs. I have been in contact with Willian Mitsuda for a few months to talk about potential sources of funding (including RetroPGF) for Otterscan. I had no relationship with Otterscan prior to those discussions other than being a fan of the project from afar. Willian was given the opportunity to review this nomination and provide additional data that would help inform its content, but I retained final say over all content in the post. ",
                    "links": [
                        "https://github.com/wmitsuda/otterscan",
                        "https://twitter.com/wmitsuda",
                        "https://twitter.com/otterscan",
                        "https://github.com/wmitsuda/otterscan",
                        "https://twitter.com/wmitsuda",
                        "https://twitter.com/wmitsuda"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.597691197691198
                },
                {
                    "author_link": "https://gov.optimism.io/u/tynes",
                    "index": "45",
                    "likes": "4",
                    "time": "22/01/2023-17:27:51",
                    "content": "The projects name ethers-js A description ethers-js is a Typescript library that makes Ethereum development really easy. It has all of the pieces required to interact with the blockchain. It is heavily used by Optimism, in particular for contract deployments and some offchain services. It is one of the easiest libraries to get up and going with for new developers to the Ethereum ecosystem. v6 was just released as beta, the project has been getting continuous development. A link to the project’s GitHub or Twitter:   GitHub    GitHub - ethers-io/ethers.js: Complete Ethereum library and wallet... Complete Ethereum library and wallet implementation in JavaScript. - GitHub - ethers-io/ethers.js: Complete Ethereum library and wallet implementation in JavaScript.      (optional) contact info for the project or project lead: twitter com/ricmoo ",
                    "links": [
                        "https://github.com/ethers-io/ethers.js",
                        "https://github.com/ethers-io/ethers.js"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.597402597402597
                },
                {
                    "author_link": "https://gov.optimism.io/u/zkjew",
                    "index": "46",
                    "likes": "8",
                    "time": "22/01/2023-18:27:26",
                    "content": "Project: Gnosis Safe Gnosis Safe is a multisignature smart contract that I am sure every voter knows about and uses. I cannot believe it hasn’t been nominated yet, it is one of the most true public goods made in a way perfect for Retroactive Public Goods funding. For context, Gnosis Safe is a non-custodial wallet solution built on the Ethereum blockchain that allows users to securely store, manage, and interact with their cryptocurrency and digital assets. It is considered a public good on the Ethereum blockchain as it provides a secure and user-friendly interface for users to interact with their digital assets, which helps to promote greater adoption and usage of the Ethereum ecosystem. Additionally, the Gnosis Safe is built on the Optimism layer 2 scaling solution, which allows for faster and cheaper transactions on the Ethereum network, further promoting the use of the blockchain for everyday transactions. Link to app:   app.safe.global    Safe Safe (prev. Gnosis Safe) is the most trusted platform to manage digital assets on Ethereum and multiple EVMs. Over $40B secured.       Link to github:   GitHub    GitHub - safe-global/safe-contracts: Gnosis Safe allows secure management of... Gnosis Safe allows secure management of blockchain assets.  - GitHub - safe-global/safe-contracts: Gnosis Safe allows secure management of blockchain assets.      ",
                    "links": [
                        "https://app.safe.global/new-safe/create?chain=oeth",
                        "https://github.com/safe-global/safe-contracts",
                        "https://github.com/safe-global/safe-contracts"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.728794642857143
                },
                {
                    "author_link": "https://gov.optimism.io/u/zkjew",
                    "index": "47",
                    "likes": "8",
                    "time": "22/01/2023-18:46:14",
                    "content": "Project: Hop Exchange I would like to nominate the Hop bridge as critical infrustructure. Here is a description of hop: Hop Exchange Bridge is a protocol that allows users to move digital assets between different blockchain networks, such as Ethereum and Optimism, with minimal fees and high security. It enables cross-chain interoperability, enabling assets to be moved across different networks in a decentralized manner. The Hop Exchange Bridge protocol is based on a system of “bridges” that connect different blockchain networks. Each bridge is a smart contract on one blockchain that is connected to a smart contract on another blockchain. When a user wants to move an asset from one blockchain to another, they send the asset to the bridge smart contract on the originating blockchain. The bridge smart contract then locks the asset and sends a message to the bridge smart contract on the destination blockchain, which releases the corresponding asset on the destination blockchain. The protocol uses a mechanism called “proof of custody” to ensure that the assets are securely transferred from one network to another. This mechanism uses a combination of smart contracts and cryptographic techniques to ensure that the assets are transferred in a secure and decentralized manner. The Hop Exchange Bridge enables users to move assets across different blockchain networks with minimal fees and high security, making it a valuable tool for trading, liquidity provision, and cross-chain DeFi. As a result, Hop Exchange is considered a public good for Optimism because it increases the interoperability of layer 2 solutions, enabling them to communicate and exchange assets with each other. This allows more people to use the Ethereum network and enables a wider range of decentralized applications to be built. It also allows for more efficient use of resources, as it allows different layer 2 solutions to specialize in different types of transactions, rather than each one trying to do everything. Hop Exchange:   app.hop.exchange   Hop Exchange Send your tokens across Ethereum scaling solutions       Hop Github:   GitHub    Hop 🐰 Hop Protocol. Hop has 23 repositories available. Follow their code on GitHub.      ",
                    "links": [
                        "https://app.hop.exchange/",
                        "https://github.com/hop-protocol",
                        "https://github.com/hop-protocol"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.782270408163265
                },
                {
                    "author_link": "https://gov.optimism.io/u/culturestream",
                    "index": "51",
                    "likes": "4",
                    "time": "23/01/2023-22:27:02",
                    "content": "  The projects name: blst  A description of how the project has supported development and usage of the OP Stack: blst is a cryptography library used for PoS consensus on Ethereum. It is also the cryptography library that supports EIP-4844. blst is a core part of the Ethereum stack used by Optimism, and EIP-4844 will help to lower transaction costs for Optimism (and other rollup) users.  A link to the project’s GitHub or Twitter: GitHub - supranational/blst: Multilingual BLS12-381 signature library   (optional) contact info for the project or project lead: www.supranational.net   ",
                    "links": [
                        "http://www.supranational.net"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.375
                },
                {
                    "author_link": "https://gov.optimism.io/u/Floydify",
                    "index": "52",
                    "likes": "6",
                    "time": "23/01/2023-23:28:23",
                    "content": "  I would like to recommend Clipper Exchange (https://clipper.exchange/), which offers more than just a basic decentralized exchange.   The user experience is well-designed, starting with the loading screen and continuing through deposits and withdrawals.   Additionally, the project encourages users to educate themselves before using the platform’s features, such as a pop-up quiz that must be completed before locking funds.   Overall, Clipper elevates the user’s experience on the web3 stack. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "54",
                    "likes": "0",
                    "time": "24/01/2023-08:11:05",
                    "content": "I second this nomination  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "55",
                    "likes": "6",
                    "time": "24/01/2023-08:20:39",
                    "content": "I am nominating Trueblocks and the unchained index. One of the most underfunded, overlooked, yet most important projects out there.   The projects name: Trueblocks.  A description of how the project has supported development and usage of the OP Stack: Trueblocks and the unchained index, have not yet started working on optimism but I know they have experimented with multi-evm and polygon so optimism is definitely a possible and much needed extension. Trueblocks  answers a simple question. For a given address, give me all possible transactions that “touch” it. From/to, token transfers, address just randomly appearing somewhere in the input data. All of those will be returned. It achieves that by creating an extra index over either a full or an archive node. This is a major missing piece from all evm chains. This allows you to simply get “all your transactions” without relying on 3rd party APIs or having to install and index one subgraph per protocol you used and miss transactions you may have done and forgot. In my honest opinion we need to support their work and expansion to all evm chains so that it becomes easy as pie to use them and finally have a decentralized way of querying for our transactions.  A link to the project’s GitHub or Twitter:  Github: GitHub - TrueBlocks/trueblocks-core: The main repository for the TrueBlocks system  Twitter: https://twitter.com/trueblocks  Website: https://trueblocks.io/     (optional) contact info for the project or project lead:  Thomas Jay Rush: https://twitter.com/tjayrush  Can also provide email or TG via DMs    ",
                    "links": [
                        "https://twitter.com/trueblocks",
                        "https://trueblocks.io/",
                        "https://twitter.com/tjayrush"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.697916666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "56",
                    "likes": "3",
                    "time": "24/01/2023-08:24:17",
                    "content": "Safe is cool and all, but they raised $100M just last year. RetroPGF is for projects that have either very little or no other funding. I see quite many questionable nominations in here. Anyone can nominate anyone ofc, but guys if projects are already funded in the tens or hundreds of millions for god’s sake they don’t belong here. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.477678571428571
                },
                {
                    "author_link": "https://gov.optimism.io/u/NicoEsp",
                    "index": "58",
                    "likes": "2",
                    "time": "24/01/2023-12:45:22",
                    "content": "Hello rrigo, gm What is the relationship between Velodrome and the OP Stack? And between Sonne Finance and the OP Stack? This is not hate. But the explanation you gave has no relation to the capabilities of the OP Stack ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/rrigo",
                    "index": "59",
                    "likes": "2",
                    "time": "24/01/2023-13:18:41",
                    "content": "Gm fren, you’re totally right, sorry, It was a mistake, my bad. I’ll delete my post. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.4761904761904763
                },
                {
                    "author_link": "https://gov.optimism.io/u/jessepollak",
                    "index": "60",
                    "likes": "3",
                    "time": "24/01/2023-14:03:05",
                    "content": "Hello all - excited to make some nominations. Disclaimer: I’m doing this in my personal capacity, not as a representative of Coinbase. I’m going to make a number of nominations. NOTE: I am restricted from adding too many links, so managing around that. go-ethereum  I’d like to +1 the go-ethereum nomination. Given the critical role this plays in Optimism, this feels very well deserved. The nomination above has other information.  Blobscan  A description of how the project has supported development and usage of the OP Stack: Blobscan is an explorer built for EIP4844 blob data. It was built during a hackathon and has been used by teams as we’ve built out the EIP4844 specification. EIP4844 will enable cheaper, more scalable L2s, which will benefit the Optimism ecosystem, and Blobscan was contribution to that effort. A link to the project’s GitHub or Twitter: github.com/Blobscan/blobscan  Now, for a few ones that may be more controversial, but which I believe deserve discussion and consideration. I understand that there may be disagreement, and some of these may not qualify, but I would rather we over-nominate and then decide from there. Arbitrum  A description of how the project has supported development and usage of the OP Stack: Arbitrum is another optimistic rollup implementation. They have made significant progress, including having working fault proofs in production. They’ve done this work fully open source and documented their thinking in a way that the community can learn from. I believe that these contributions have been invaluable for pushing forward the broader L2 ecosystem forward, which has significant benefit to Optimism. A link to the project’s GitHub or Twitter: twitter.com/arbitrumdevs  Polygon  A description of how the project has supported development and usage of the OP Stack: Polygon as made a number of significant open source contributions to the overall Ethereum scaling space. In particular, their work on the Polygon zkEVM has been invaluable in pushing forward the possibility of rollups with ZK validity provers. I believe that these contributions have been invaluable for pushing forward the broader L2 ecosystem forward, which has significant benefit to Optimism. A link to the project’s GitHub or Twitter: twitter.com/0xPolygonHermez  Scroll  A description of how the project has supported development and usage of the OP Stack: Scroll is building an open source, Apache / MIT zkEVM, in close collaboration with the Ethereum Foundation Privacy & Scaling Experiments group. They are optimizing for full EVM compatibility and pushing the limits of what we’ve historically thought was possible. I believe that these contributions have been invaluable for pushing forward the broader L2 ecosystem forward, which has significant benefit to Optimism. A link to the project’s GitHub or Twitter: twitter.com/Scroll_ZKP  I look forward to seeing the discussion about and results of this RetroPGF round. Thanks for making this happen! ",
                    "links": [
                        "https://github.com/scroll-tech/scroll-zkevm"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9118589743589745
                },
                {
                    "author_link": "https://gov.optimism.io/u/Tommy1",
                    "index": "61",
                    "likes": "3",
                    "time": "24/01/2023-17:00:37",
                    "content": "  The projects name: Velodrome Finance  A description of how the project has supported development and usage of the OP Stack: Velodrome is AMM fork of Solidly, that designed to provide liquidity and minimal slippages on platform.  Velodrome is helping to expand Optimism ecosystem by providing liquidity and gives user able to vote which pair should get that liquidity.  A link to the project’s GitHub or Twitter: https://twitter.com/VelodromeFi   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.666666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/Takanome",
                    "index": "63",
                    "likes": "3",
                    "time": "24/01/2023-17:31:45",
                    "content": "the Project name : LAYER3 description of how the project has supported development and usage of the OP Stack : Layer3, a unique quest-based platform that focuses on on-chain activities, will be able to bring more users into the optism ecosystem in the future. layer3 platform which is very useful for web3 users by carrying out user quest activities also gets awards starting from NFT, token airdrop and of course this is good for the future development of the optism ecosystem   A link to the project’s GitHub or Twitter: https://twitter.com/layer3xyz   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.540625
                },
                {
                    "author_link": "https://gov.optimism.io/u/Aruna",
                    "index": "65",
                    "likes": "2",
                    "time": "24/01/2023-18:14:52",
                    "content": "The projects name : Quix NFT Marketplace Quix is the largest NFT marketplace on Optimism so far. Their website performance is so smooth. Launchpad worked perfectly. In my opinion, NFT is the best option to grow up community and Quix provide the best and largest NFT marketplace on Optimism. website : https://qx.app ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/Nithin",
                    "index": "67",
                    "likes": "10",
                    "time": "24/01/2023-19:12:03",
                    "content": "  The projects name: Across Protocol   Description of how the project has supported development and usage of the OP Stack: I would like to nominate Across for the Infrastructure and dependencies category of RetroPGF round 2 as Across is a cross-chain bridge for L2s such as Optimism and rollups secured by UMA’s optimistic oracle. It is optimized for capital efficiency with a single liquidity pool, a competitive relayer landscape, and a no-slippage fee model. Across is one of the the fastest, cheapest and most secure bridge. In short, Across is building the bridge Ethereum deserves. Across is a public good for Optimism as it has hepled users bridge a total of $138M to Optimism with low fees, fast bridging and highly secure transactions.   A link to the project’s GitHub or Twitter: https://twitter.com/AcrossProtocol Across Protocol · GitHub   contact info for the project or project lead : rcarman@umaproject. org   ",
                    "links": [
                        "https://github.com/across-protocol"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.803571428571428
                },
                {
                    "author_link": "https://gov.optimism.io/u/kcorstor",
                    "index": "68",
                    "likes": "3",
                    "time": "24/01/2023-20:49:48",
                    "content": "Projects name: API3 DAO A description of how the project has supported development and usage of the OP Stack: API3 DAO delivers transparent and secure first-party oracles that are operated by API Providers. Through the first-party architecture, API3 is developing infrastructure that enables real-world data to be accessed at scale by smart contracts in a decentralized fashion. API3’s current support for the Optimism ecosystem includes the launch of the oracle integration tooling ChainAPI and public good Quantum RNG.   ChainAPI Airnode integration tool: Through ChainAPI an API endpoint can be made requestable in under 30 minutes, with little technical lifting. As such Optimism builders can access any REST API endpoint off-chain data through a REST API.   API3 launched the public good Quantum Random Number Generator oracle service, API3 QRNG. This service provides builders permissionless access to quantum RNG, where users just need to fund a sponsor wallet to cover gas fees.   API3 will launch our decentralized API (dAPI) oracle service for Optimism’s DeFi ecosystem across 2023.   dAPIs will provide access to a range of DeFi data feeds powered by reputable data providers. The flexibility of first-party means data availability can scale quickly whilst enabling builders to choose the number of sources (decentralisation) for their DeFi application.   dAPIs will initially serve self-funded & managed service data feeds.   Alongside dAPIs, Optimism builders will be able to realize access Oracle Extractable Value. OEV enables DeFi protocols to capture and channel proceeds in using similar tooling & processes to that of Maximum Extractable Value.   A link to the project’s GitHub or Twitter:   GitHub    API3 Decentralized APIs for Web 3.0. API3 has 36 repositories available. Follow their code on GitHub.      ",
                    "links": [
                        "https://github.com/api3dao"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.900035014005603
                },
                {
                    "author_link": "https://gov.optimism.io/u/0xGabi",
                    "index": "69",
                    "likes": "1",
                    "time": "24/01/2023-21:42:23",
                    "content": "Thank you for nominating Blobscan @jessepollak. Here are my contact details and the project roadmap:  Contact info for the project or project lead: @0xGabi  Project’s roadmap: Blobscan Project Roadmap - HackMD  Project’s GitHub: Blobscan · GitHub   ",
                    "links": [
                        "https://github.com/Blobscan?type=source"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Vooxka",
                    "index": "70",
                    "likes": "1",
                    "time": "24/01/2023-21:47:43",
                    "content": "The projects name: Sonne Finance Description of how the project has supported development and usage of the OP Stack: Sonne Finance is an EVM-compatible lending/borrowing protocol that launched on Optimism. Sonne Finance provides peer-to-peer lending solutions that are fully decentralized, transparent, and non-custodial. Similar to (and based on) existing lending platforms, users can lend any supported assets on our platform and use their capital to borrow supported assets. Currently supported assets: DAI USDT USDC WETH OP sUSD WBTC SNX Sonne aims to be the prime lending platform on Optimism by offering the highest competitive incentives for money markets, having the deepest liquidity, and being native to Optimism. Sonne innovates on revenue sharing and tokenomics, where stakers of the protocol get 2 different types of revenues (VELO and SONNE or USDC), as well as being able to choose the reward asset between SONNE and USDC. A link to the project’s GitHub or Twitter: https://twitter.com/SonneFinance ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://gov.optimism.io/u/roodsant",
                    "index": "75",
                    "likes": "2",
                    "time": "25/01/2023-09:12:39",
                    "content": "Project: Hop Change I would like to nominate the Hop bridge as a critical infrastructure. Here is a description of the hops: Hop Exchange Bridge is a protocol that allows users to move digital assets between different blockchain networks like Ethereum and Optimism with minimal fees and high security. Supports cross-chain interoperability, allowing assets to move decentrally between different networks. The Hop Exchange Bridge protocol is based on a system of “bridges” that connect different blockchain networks. Each bridge is a smart contract on one blockchain connected to a smart contract on another blockchain. When a user wants to transfer funds from one blockchain to another, they send funds to a bridging smart contract on the original blockchain. The bridging smart contract then locks the asset and sends a message to the bridging smart contract on the destination blockchain, thereby releasing the corresponding asset on the destination blockchain. The protocol uses a mechanism called “Proof of Storage” to ensure the secure transfer of assets from one network to another. The mechanism uses a combination of smart contracts and cryptography to ensure that assets are transferred in a secure and decentralized manner. The Hop Exchange Bridge allows users to move assets between different blockchain networks with minimal fees and high security, making it an invaluable tool for cross-chain trading, liquidity, and DeFi. hop exchange github hop ",
                    "links": [
                        "https://github.com/hop-protocol"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.695178571428572
                },
                {
                    "author_link": "https://gov.optimism.io/u/Imperator",
                    "index": "77",
                    "likes": "2",
                    "time": "25/01/2023-14:08:12",
                    "content": "  The project name: Sonne Finance   A description of how the project has supported development and usage of the OP Stack:   Sonne Finance is a lending and borrowing protocol on the Optimism ecosystem that aims to provide decentralized, transparent, and non-custodial peer-to-peer lending solutions. It supports assets such as DAI, USDT, USDC, WETH, OP, sUSD, WBTC, and SNX. The team behind Sonne Finance has previous experience working on other projects in the DeFi space, and the project’s goal is to be the prime lending platform on Optimism by providing the highest competitive incentives, deep liquidity, and being native to Optimism. The team is also focused on innovating on revenue sharing and tokenomics, and plans to attract capital from other chains and bring new users to the ecosystem by providing a top-tier blockchain experience. The project has not previously applied for an OP grant, and is requesting 300,000 OP tokens.   A link to the project’s GitHub or Twitter: https://twitter.com/SonneFinance sonne-finance · GitHub   ",
                    "links": [
                        "https://github.com/sonne-finance"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.6268939393939394
                },
                {
                    "author_link": "https://gov.optimism.io/u/krzkaczor",
                    "index": "78",
                    "likes": "5",
                    "time": "25/01/2023-14:21:49",
                    "content": "  The projects name: Erigon   A description of how the project has supported development and usage of the OP Stack: Erigon is the fastest ethereum node out there, pushing boundaries of what can be done. Many decisions made by the Erigon team were very influential to the whole space hence Optimism connection.  A link to the project’s GitHub or Twitter:  GitHub - ledgerwatch/erigon: Ethereum implementation on the efficiency frontier   (optional) contact info for the project or project lead:  ",
                    "links": [
                        "https://github.com/ledgerwatch/erigon"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/Crystalminer",
                    "index": "79",
                    "likes": "1",
                    "time": "25/01/2023-15:51:50",
                    "content": "I really like your initiative! The projects name: Mai Finance A description of how the project has supported development and usage of the OP Stack :  Mai Finance is an open source and non-custodial stable protocol for extracting value out of priced assets. They have created a way to keep your crypto and still be able to spend its value. That means you’re able to mint stablecoins without having to sell your crypto assets, and do so at 0% interest. The process is very simple: create a vault, deposit your crypto assets, and start borrowing stablecoins against your collateral’s value.  A link to the project’s Twitter : https://twitter.com/QiDaoProtocol ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/Lloydhewitt",
                    "index": "80",
                    "likes": "2",
                    "time": "25/01/2023-19:29:40",
                    "content": "The projects name: PoolTogether A description of how the project has supported development and usage of the OP Stack: PoolTogether is a prize saving protocol. Daily and weekly prizes can be won on a lossless basis allowing you to withdraw your funds even if you don’t win. You can also earn OP whilst your dollars are deposited. A link to the project’s GitHub or Twitter: https://twitter.com/PoolTogether_ ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/krzkaczor",
                    "index": "81",
                    "likes": "1",
                    "time": "25/01/2023-20:03:45",
                    "content": "The projects name: dETH / TypeChain / dEth Code A description of how the project has supported development and usage of the OP Stack: dETH created multiple popular projects among Ethereum devs. TypeChain is used across Optimism codebase to enable type-safe interactions with smart contracts. deth Code supports the optimism network. A link to the project’s GitHub or Twitter: ☠️ dΞth · GitHub (optional) contact info for the project or project lead: it’s me! (@krzkaczor) ",
                    "links": [
                        "https://github.com/dethcrypto/TypeChain",
                        "https://github.com/dethcrypto/dethcode",
                        "https://github.com/dethcrypto?type=source",
                        "http://twitter.com/krzKaczor"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.446428571428572
                },
                {
                    "author_link": "https://gov.optimism.io/u/acro25",
                    "index": "82",
                    "likes": "1",
                    "time": "25/01/2023-21:30:33",
                    "content": "The projects name: TallyHo Wallet A description :a web3 wallet new on the radar, with an upcoming community and focused on decentralization and focused of creating a dao .Two of the main characteristics of optimism ecosystem. Made various campaigns for different blockchains  and of course for optimism chain too. Many optimism users started using it. A link to the project’s github: GitHub - tallyhowallet/tallyho.org: The primary website for Tally Ho, the community owned and operated Web3 wallet. Contact info for the project : https://twitter.com/TallyHoOfficial ",
                    "links": [
                        "https://twitter.com/TallyHoOfficial"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.002525252525253
                },
                {
                    "author_link": "https://gov.optimism.io/u/undercreuse",
                    "index": "83",
                    "likes": "2",
                    "time": "25/01/2023-22:00:34",
                    "content": "Hi all, thanks to Op team for the idea   The projects name: Beethoven X   A description of how the project has supported development and usage of the OP Stack: Beethoven X aims to provide a comprehensive, decentralized investment platform for DeFi using cutting-edge protocols. By utilizing the most advanced DeFi protocols, we offer unique decentralized investment options. With its foundation on Balancer V2 and integration on Optimism, Beethoven X is a pioneering next-generation AMM protocol.   A link to the project’s GitHub or Twitter: https://twitter.com/beethoven_x beethovenxfi · GitHub   ",
                    "links": [
                        "https://github.com/beethovenxfi"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.84375
                },
                {
                    "author_link": "https://gov.optimism.io/u/metox",
                    "index": "84",
                    "likes": "1",
                    "time": "25/01/2023-22:18:59",
                    "content": "hi im very happy to be here project name: quix nft marketplace A description of how the project has supported development and usage of the OP Stack: Quix is a decentralized NFT marketplace built on the Ethereum blockchain and running on the Optimism protocol. It aims to provide a fast and user-friendly platform for buying, selling, and trading NFTs. Some of its features include:  Creator minting: Creators can mint their own NFTs and set their own prices, providing a platform for creators to easily and directly monetize their work. User-friendly interface: Quix is designed to be easy to use, making it accessible to both experienced and new users. Efficient: by using Optimism, Quix is able to process transactions much faster and at a fraction of the cost of a traditional Ethereum transaction. Decentralized: Quix is built on the Ethereum blockchain, which provides a secure and decentralized platform for buying and selling NFTs.  Overall, Quix aims to be a one-stop-shop for all things NFTs, by providing a user-friendly and efficient marketplace for buying, selling, and trading NFTs, and a platform for creators to mint and monetize their work. A link to the project’s GitHub or Twitter: https://twitter.com/qx_app (optional) contact info for the project or project lead :https://twitter.com/qx_app ",
                    "links": [
                        "https://twitter.com/qx_app"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.9260101010101005
                },
                {
                    "author_link": "https://gov.optimism.io/u/kevthedev",
                    "index": "85",
                    "likes": "3",
                    "time": "25/01/2023-22:29:38",
                    "content": "Project name: crate-crypto Description: A collection of open source cryprographic implementations and documentation, including but not limited to EIP4844 and verkle tries. Github link: Crate Crypto · GitHub Contact info for lead: Telegram Discord : Kev#6900 ",
                    "links": [
                        "https://t.me/kevaundray"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.892857142857142
                },
                {
                    "author_link": "https://gov.optimism.io/u/tonyrob",
                    "index": "87",
                    "likes": "1",
                    "time": "25/01/2023-22:55:18",
                    "content": "The projects name: GranaryFinance A description of how the project has supported development and usage of the OP Stack: Granary is a decentralized finance (DeFi) platform that allows users to deposit their digital assets and earn interest on them. It is built on the Ethereum blockchain and utilizes the Optimism protocol to improve the speed and reduce the cost of transactions. Users can deposit various types of digital assets, such as cryptocurrencies, and earn interest in the form of the platform’s native token, GRAIN. Granary also offers yield farming, where users can deposit their assets and earn interest, liquidity pools, where users can provide liquidity in exchange for a share of the trading fees and rewards, and staking, where users can stake their GRAIN tokens to earn more rewards. A link to the project’s GitHub or Twitter: https://twitter.com/GranaryFinance ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/tylrha",
                    "index": "91",
                    "likes": "2",
                    "time": "26/01/2023-10:38:24",
                    "content": "The projects name: GranaryFinance A description of how the project has supported development and usage of the OP Stack: Granary is a * It is built on the Ethereum blockchain and utilizes the Optimism protocol to improve the speed and reduce the cost of transactions.   Users can deposit various types of digital assets, such as cryptocurrencies, and earn interest in the form of the platform’s native token, GRAIN.   Granary also offers yield farming, where users can deposit their assets and earn interest, liquidity pools, where users can provide liquidity in exchange for a share of the trading fees and rewards, and staking, where users can stake their GRAIN tokens to earn more rewards.   A link to the project’s GitHub or Twitter: https://twitter.com/GranaryFinance ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6000000000000005
                },
                {
                    "author_link": "https://gov.optimism.io/u/KristianGeo",
                    "index": "92",
                    "likes": "2",
                    "time": "26/01/2023-11:22:22",
                    "content": "The projects name: Bware Labs A description of how the project has supported development and usage of the OP Stack: Bware Labs (https://bwarelabs.com/) is a web3 infrastructure company providing decentralized RPC/WSS APIs, validator, indexing and bridge operator services. Our core objective is to improve the developer experience within a blockchain ecosystem. Bware Labs has supported development and usage of the OP Stack by integrating Optimism blockchain into our product Blast (https://blastapi.io/), a decentralized API platform with multichain support. Using Blast, Optimism blockchain developers are able to bypass all the hurdles involved in running their own infrastructure thus reducing both their outage risks and infrastructure costs. Services provided for Optimism blockchain developers through our Blast API platform:  Support for the Optimism Blockchain within the Blast platform for individual user accounts(https://blastapi.io/) Blast Public API for Optimism Mainnet and Testnet: Optimism Public API - Blast API  RPC and WSS support. 12 Million API calls/month with a throughput of 25 API calls/second offered for free to Optimism users on each Blast account. 25 API calls/second offered for free via the Public API. Multi-region node hosting (US, EU, APAC) with automated traffic routing for optimal response times. 24/7 Monitoring and alerting. 24/7 On-call engineering support. Developer support on Bware Labs Discord Channels. An overall SLA of 99.9%. Promotional developer campaigns.  A link to the project’s GitHub or Twitter: Twitter: https://twitter.com/BwareLabs GitHub: Bware Labs · GitHub contact info for the project or project lead: email: kristian@bwarelabs.com Discord: Kristian | bwarelabs.com#9616 ",
                    "links": [
                        "https://blastapi.io/",
                        "https://blastapi.io/",
                        "https://blastapi.io/public-api/optimism",
                        "https://twitter.com/BwareLabs",
                        "https://github.com/bwarelabs",
                        "http://bwarelabs.com#9616"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.949999999999999
                },
                {
                    "author_link": "https://gov.optimism.io/u/satomiss",
                    "index": "93",
                    "likes": "1",
                    "time": "26/01/2023-13:33:20",
                    "content": "  The projects name:Pika  A description of how the project has supported development and usage of the OP Stack: A simple site design may be very plain. It is easy to use it very much. It is my favorite project. Recommended.  A link to the project’s GitHub or Twitter: https://twitter.com/PikaProtocol   (optional) contact info for the project or project lead: https://twitter.com/satopachis   ",
                    "links": [
                        "https://twitter.com/satopachis"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.818452380952381
                },
                {
                    "author_link": "https://gov.optimism.io/u/ppllz",
                    "index": "94",
                    "likes": "2",
                    "time": "26/01/2023-14:37:12",
                    "content": "Hi Everyone! I’d like to nominate this project: The projects name: GranaryFinance A description of how the project has supported development and usage of the OP Stack: Granary is a * It is built on the Ethereum blockchain and utilizes the Optimism protocol to improve the speed and reduce the cost of transactions.  Users can deposit various types of digital assets, such as cryptocurrencies, and earn interest in the form of the platform’s native token, GRAIN. Granary also offers yield farming, where users can deposit their assets and earn interest, liquidity pools, where users can provide liquidity in exchange for a share of the trading fees and rewards, and staking, where users can stake their GRAIN tokens to earn more rewards.  A link to the project’s GitHub or Twitter: https://twitter.com/GranaryFinance Thank you ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6000000000000005
                },
                {
                    "author_link": "https://gov.optimism.io/u/Topkrs",
                    "index": "95",
                    "likes": "2",
                    "time": "26/01/2023-16:12:35",
                    "content": "The projects name: Hop A description of how the project has supported development and usage of the OP Stack: Hop is the first bridge I used to transfer my fund from mainnet to Optimism, everything looks simple and very fast interaction. Project focus on security which is the main thing that I agree with, Bonders take part of this and also good liquidity. I trust Hop more than others by providing liquidity with them for months. Don’t believe me, juist try it yourself. A link to the project’s GitHub or Twitter: https://hop.exchange/ ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.563888888888889
                },
                {
                    "author_link": "https://gov.optimism.io/u/kienthach99",
                    "index": "96",
                    "likes": "3",
                    "time": "26/01/2023-16:21:09",
                    "content": "Project Name : coinmap.tech Description :  The first decentralized exchange allows comprehensive analysis of every token in the BNB chain and others chain ( in the future). With leading-edge analytics instruments and On-chain date, an effective crypto trading method is waiting for you to customize with Coinmap Dex Trading Supporting to view candlestick chart and updating price continously for all BEP20 tokens, with neccessary timeframes and real-time price update according to the On-chain liquidity pool. Order management: market orders, pending orders, custom orders due to individual ideals, swap and limit orders, assistant alert, copy best trader, follow shark move. Trading optimization: for traders with fundamental analysis and technical analysis.  A link to the project’s GitHub or Twitter: https://twitter.com/CoinmapTrading ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.234375
                },
                {
                    "author_link": "https://gov.optimism.io/u/NASA",
                    "index": "97",
                    "likes": "2",
                    "time": "26/01/2023-18:44:47",
                    "content": "The projects name: Gnosis Safe A description of how the project has supported development and usage of the OP Stack: Gnosis Safe is a multisignature smart contract that I’m sure every namer knows about and uses. I can not believe it has n’t been nominated yet, it’s one of the most true public goods made in a way perfect for Retroactive Public Goods backing. For environment, Gnosis Safe is anon-custodial portmanteau result erected on the Ethereum blockchain that allows druggies to securely store, manage, and interact with their cryptocurrency and digital means. It’s considered a public good on the Ethereum blockchain as it provides a secure and stoner-friendly interface for druggies to interact with their digital means, which helps to promote lesser relinquishment and operation of the Ethereum ecosystem. also, the Gnosis Safe is erected on the sanguinity subcaste 2 scaling result, which allows for faster and cheaper deals on the Ethereum network, farther promoting the use of the blockchain for everyday deals. A link to the project’s GitHub or Twitter: https://app.safe.global/ (optional) contact info for the project or project lead: GitHub - safe-global/safe-contracts: Gnosis Safe allows secure management of blockchain assets. ",
                    "links": [
                        "https://github.com/safe-global/safe-contracts"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.6105442176870755
                },
                {
                    "author_link": "https://gov.optimism.io/u/boerbasss",
                    "index": "99",
                    "likes": "2",
                    "time": "26/01/2023-20:29:36",
                    "content": "  The projects name: Polynomial   A description of how the project has supported development and usage of the OP Stack: Optimism is a layer two scaling platform that inherits the security of Ethereum by being a rollup. Optimistic Rollups have been quicker to provide a generalized environment where multiple applications can exist. Also, the transactions are so fast and the low gas fees. This is the best reason why Polynomial uses Optimism network. By this way they use the OP Stack.   A link to the project’s GitHub or Twitter: https://twitter.com/PolynomialFi   (optional) contact info for the project or project lead: https://twitter.com/0xmubaris   ",
                    "links": [
                        "https://twitter.com/0xmubaris"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/Janos",
                    "index": "101",
                    "likes": "2",
                    "time": "26/01/2023-21:04:53",
                    "content": "  The projects name: Optimism bridge  A description of how the project has supported development and usage of the OP Stack: Optimism is a fast, stable, and scalable L2 blockchain built by Ethereum developers The optimism bridge allows you to transfer assets between L1 solution and Optimism  A link to the project’s GitHub or Twitter: https://twitter.com/optimismFND Optimism · GitHub https://discord-gateway.optimism.io/   (optional) contact info for the project or project lead: OΞ Get In Touch   ",
                    "links": [
                        "https://github.com/ethereum-optimism",
                        "https://discord-gateway.optimism.io/",
                        "https://oplabs.typeform.com/get-in-touch?typeform-source=www.optimism.io"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/funnymoneyNFTEARTH",
                    "index": "103",
                    "likes": "11",
                    "time": "27/01/2023-02:22:34",
                    "content": "  The projects name: NFTEARTH A description of how the project has supported development and usage of the OP Stack  NFTEarth is going to be the Layer2 Ethereum hub for buying and selling NFTs ! Built initially on Optimism and with the ambition of serving the entire layer2 ecosystem. This community driven Dao based NFT marketplace was incubated in an effort to revive the Layer2 NFT ecosystem! From integrating with some of the most innovative web3 applications like snapshot, quest3 .xyz, Guild.xyz, wonderverse, unlock protocol, ENS domains, punk domains to give users and contributors alike a superior user experience, to building necessary API infrastructure that can be referenced by protocols to use in the future to onboarding tools to migrate some of Ethereum’s layer 1 most unique and prominent NFT collections to the optimism ecosystem allowing for their existing communities to enjoy the countless benefits of optimism and optimism users exposure to new and unique artist the NFT space has to offer Founded by Optimisms Favorite community based Dao Layer2Dao **A link to the project’s GitHub and Twitter & Medium article ** Linktree to NFTEarth’s Twitter, Github and other web3 integrations and resources: NFTEarth linktree NFTEarth Medium Article: NFTEarth – Medium Founder Weston and NFTEarth team contact : NFTEarth contact  image1200×480 149 KB  ",
                    "links": [
                        "https://medium.com/@nftearth",
                        "https://discord.gg/nftearth",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/9/93de251bdea67cf0630a75928860fa8a7c772fb6.jpeg"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.362926136363636
                },
                {
                    "author_link": "https://gov.optimism.io/u/VISION",
                    "index": "104",
                    "likes": "2",
                    "time": "27/01/2023-10:07:54",
                    "content": "Yeah this NFTEARTH NFT marketplace will play a vital role for Optimism NFT’S. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/eelbbllea",
                    "index": "106",
                    "likes": "2",
                    "time": "27/01/2023-10:36:21",
                    "content": "o * The projects name: Optimism Collective(qx.app)   A description of how the project has supported development and usage of the OP Stack:  They created the first no-code NFT launchpad in the ecosystem.  They 're seeing upwards of 4k exchanges per day.  A link to the project’s GitHub or Twitter:https://twitter.com/qx_app   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/Izrael",
                    "index": "107",
                    "likes": "2",
                    "time": "27/01/2023-12:19:56",
                    "content": "The NFTEarth is trying to fill in the void left by the exit of Optimism NFT marketplace platform - Quix, amongst other added utilities, would be great to see NFTs onboarded in good numbers onto the Optimism ecosystem ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.71875
                },
                {
                    "author_link": "https://gov.optimism.io/u/q9f",
                    "index": "108",
                    "likes": "5",
                    "time": "27/01/2023-13:12:35",
                    "content": "  Name: Goerli Testnet   Description: The Goerli testnet was the first public Ethereum testnet launch by and with the community. It is supposed to be inclusive with the entire Ethereum developer stack both horizontally and vertically. In 2023, the Holli testnet will replace Goerli.  OP Stack: The Optimism testnet (Optimism Goerli) is now fully integrated with and based on the Goerli testnet infrastructure.  GitHub: GitHub - eth-clients/goerli: the goerli/prater testnet configurations.   Contact: @q9f   Thanks  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5625
                },
                {
                    "author_link": "https://gov.optimism.io/u/Ownity",
                    "index": "109",
                    "likes": "2",
                    "time": "27/01/2023-14:48:41",
                    "content": "Ownity is a groundbreaking co-ownership & aggregator platform for all things NFT. Ownity is poised to pulverize barriers to entry so that anyone can join the NFT ecosystem to start investing in the world’s most prized collections and explore up-and-coming ones. Ownity enables a next-level NFT ownership & management experience  Find any NFT from the hottest collections listed on major marketplaces Fractionalize & co-own them Trade your NFT fractions DAO-sell fractionalized NFTs on major marketplaces Buy whole NFTs  Ownity’s aggregator functionality empowers you to access all of your favorite NFT collections from one place without ever having to jump back and forth between marketplaces, searching for the right listing and price.  Ownity  Is built on the Ethereum blockchain , with support for EVM-compatible chains in the works. Optimism coming soon Aggregates NFT listings from OpenSea, LooksRare, and X2Y2, with other major marketplaces coming soon Supports both ERC721 (on-of-a-kind) & ERC1155 (limited-series) NFTs Supports ERC20 tokens  https://twitter.com/ownity_io   Telegram    Ownity You can contact @Ownity right away.      ",
                    "links": [
                        "https://t.me/Ownity",
                        "https://t.me/Ownity"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.916964285714286
                },
                {
                    "author_link": "https://gov.optimism.io/u/butta",
                    "index": "111",
                    "likes": "2",
                    "time": "27/01/2023-18:21:33",
                    "content": "The projects name: beaconcha.in A description of how the project has supported development and usage of the OP Stack: beaconcha.in is an open source explorer that provides users an easy and accessible way to explore the Ethereum network. Our explorer is designed to be user-friendly and is the visual backbone of the Ethereum ecosystem by making it accessible to non-technical users. It visualizes the Execution & Consensus Layer in a single explorer. In addition to our web-based explorer, we also offer an open source mobile app for iOS and Android. A link to the project’s Twitter: https://twitter.com/beaconcha_in (optional) contact info for the project or project lead: @Butta_eth on Twitter or Discord: Butta#8883 ",
                    "links": [
                        "https://twitter.com/beaconcha_in"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.79421768707483
                },
                {
                    "author_link": "https://gov.optimism.io/u/Momo",
                    "index": "114",
                    "likes": "1",
                    "time": "27/01/2023-19:33:24",
                    "content": "As the nature of tokens the most frequently used feature is swapping them. So it is not a surprise to see DeFi platforms are the most popular ones. Although there are dozens of different platforms not all of them are appealing. I swap a lot and had chance to try many of those but my recent favorite and most used one is Odos so far. This is why I am going to nominate Odos. Odos is a multichain aggregator, it searches among all the integrated pools and find for you the best path to swap. It supports lots of different platforms and pools, so the options are varied. You can always find reasonable/profitable paths to swap. Until now I probably swapped 300+ times there on Optimism alone and significant number of those swaps ended with positive slippage. While this is the case, I can’t find much reason to use other platforms and I nominate Odos, which I use most on Optimism. https://twitter.com/odosprotocol ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.660353535353536
                },
                {
                    "author_link": "https://gov.optimism.io/u/trent",
                    "index": "118",
                    "likes": "9",
                    "time": "28/01/2023-15:40:50",
                    "content": " Protocol Guild Protocol Guild is a collective of 128 individuals who steward the Ethereum protocol. Its members come from 23 teams across the ecosystem:  Client & Infrastructure teams, such as EthereumJS, Erigon, Geth, Hyperledger Besu, Lighthouse, Lodestar, Nethermind, Nimbus, Portal Network, Prysm, Solidity, Teku Research orgs thinking about how to shape the protocol: EF Research, Ipsilon, Privacy & Scaling Explorations (PSE), Robust Incentives Group (RIG), TXRX Coordination & Support for network upgrades and the teams listed above: EF Security, EF Protocol Support, EF Testing, EF DevOps, Ethereum Cat Herders  See the full list of individuals here. Two notes:  This should not be interpreted as an exhaustive list of all Ethereum contributors. Protocol Guild membership is opt-in and there are eligible core contributors who have decided to not participate for various reasons. Expect the membership to change over time - it’s regularly updated through member curation and adjustments to the eligibility framework. However, even on a longer timeframe, we don’t expect PG’s membership to increase significantly.  The idea for the mechanism originated in 2021. It came about in response to recurring challenges related to the ecosystem being able to holistically fund core Ethereum infrastructure, with a specific consideration towards rebalancing the incentives towards contributing to the Ethereum protocol. To learn more, check out the docs.  Ethereum X Optimism As a rollup, Optimism will leverage Ethereum for settlement & security assurances. Optimism also hopes to make use of new scaling mechanisms like proto-danksharding (EIP-4844). These will reduce rollup user fees, which broadens access to Ethereum’s trust assurances to as many people around the world.  Protocol Guild members are intimately engaged in both the long-term work required to maintain the network, as well as building these newer constructions. Given the mutual relationship between this work and the goals of the Optimism community, it makes sense to directly fund the people doing this infrastructure work. Long-term thinking is baked into Protocol Guild’s architecture. Our members’ protocol contributions range from 9 months to 8 years, with the median having ~3 years. When any funding is received, this value is used as a “time-weighting” to allocate each members’ share relative to the whole membership. This ensures long-term contributors are properly recognized, and closely aligns with the retroactive aspect of RPGF. We also vest any funding (eg. 1 year in the Pilot, 4 years for future iterations), which will hopefully lead to a more stable set of contributors over time. Learn more about the smart contracts here. We’re excited to be considered for this retroactive round! Your support as a prominent ecosystem participant helps to maintain the Public Good funding norms both communities should aspire to, while also rebalancing the incentives for individuals contributing to foundational infrastructure. Please reply with any questions here or on twitter and we’d be happy to answer them! ",
                    "links": [
                        "https://protocol-guild.readthedocs.io/en/latest/index.html",
                        "https://www.eip4844.com/",
                        "https://protocol-guild.readthedocs.io/en/latest/5-initial-pilot.html",
                        "https://protocol-guild.readthedocs.io/en/latest/3-smart-contract.html",
                        "https://mobile.twitter.com/protocolguild"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.185305435305435
                },
                {
                    "author_link": "https://gov.optimism.io/u/kelvin",
                    "index": "119",
                    "likes": "6",
                    "time": "29/01/2023-02:43:29",
                    "content": "Project Name Ethers.js Description Ethers.js is a popular and widely-used JavaScript library for interacting with the Ethereum blockchain. It provides a simple, yet powerful API for building decentralized applications and smart contracts, making it easier for developers to build on Ethereum. Ethers.js has made a significant impact on the Ethereum ecosystem by providing a streamlined and user-friendly way for developers to build decentralized applications and smart contracts. It has helped to lower the barriers to entry for developers and has encouraged more individuals and companies to build on the Ethereum blockchain. Additionally, Ethers.js is open source and has a large and active community of developers who contribute to its ongoing development and improvement. This has helped to ensure that the library continues to evolve and meet the needs of the Ethereum community. Overall, Ethers.js has had a major positive impact on the Ethereum ecosystem and is a deserving candidate for RetroPGF funding. Links  Ethers.js  Contact  Unsure  Disclaimers I work for OP Labs. I am making this nomination in my capacity as an individual and not on behalf of OP Labs. This entire nomination was written by ChatGPT because I wanted to see what it could do. That said, I do think ethers is very much a deserving candidate for RetroPGF because of its widespread and clear impact. I just had a little too much time on my hands while waiting for friends at a bar. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.971699134199135
                },
                {
                    "author_link": "https://gov.optimism.io/u/kelvin",
                    "index": "120",
                    "likes": "7",
                    "time": "29/01/2023-02:54:56",
                    "content": "Project Name Remix Description Remix is an online integrated development environment (IDE) that has been a vital tool for developers in the Ethereum ecosystem since its inception. The platform offers a simple and intuitive interface for writing, testing, and deploying smart contracts. It provides a wealth of features and functionalities, making it an essential tool for developers of all levels, from beginners to experienced professionals. One of the most significant values that Remix provides is its ease of use. With its straightforward interface, developers can quickly get started writing, testing, and deploying smart contracts without having to set up a local development environment. This simplicity has made Remix a go-to tool for developers looking to get started with Ethereum development. In addition to its ease of use, Remix also provides a comprehensive suite of features that make it an indispensable tool for Ethereum developers. From its debugging capabilities to its integration with various test networks, Remix provides everything developers need to build, test, and deploy smart contracts. Moreover, Remix also provides seamless integration with the Optimism L2 network. This allows developers to test and deploy their smart contracts on the Optimism L2 network directly from the Remix interface. This integration makes it easier for developers to take advantage of the fast and low-cost transactions that the Optimism L2 network provides. In conclusion, Remix has been an invaluable resource for the Ethereum ecosystem. Its ease of use and comprehensive features make it a must-have tool for any Ethereum developer. Its seamless integration with the Optimism L2 network only solidifies its value to the Ethereum ecosystem and its importance as a candidate for RetroPGF. Links  Remix  Contact  Unsure  Disclaimers I work for OP Labs. I am making this nomination in my capacity as an individual and not on behalf of OP Labs. And this was also written by ChatGPT. I’ll stop having the machine write my nominations now. I was just having fun. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.00879917184265
                },
                {
                    "author_link": "https://gov.optimism.io/u/horsefacts",
                    "index": "121",
                    "likes": "4",
                    "time": "29/01/2023-03:34:56",
                    "content": "Project name: hardhat-deploy How the project has supported development and usage of the OP Stack: hardhat-deploy is a Hardhat plugin for replicable, testable deployment of smart contract projects. For Hardhat projects of sufficient size and complexity, it’s become something of a de facto standard for deploying smart contracts. Safe, replicable, testable deployments prevent mistakes and protect everyone. The OP monorepo makes use of hardhat-deploy for its own deployments, and it’s widely used by other TypeScript projects in the Optimism ecosystem. Here are the packages in the OP codebase that use hardhat-deploy: $ rg '\"hardhat-deploy\":' packages/sdk/package.json 45:    \"hardhat-deploy\": \"^0.11.4\",  packages/contracts-periphery/package.json 82:    \"hardhat-deploy\": \"^0.11.10\",  packages/contracts/package.json 94:    \"hardhat-deploy\": \"^0.11.10\",  packages/contracts-bedrock/package.json 84:    \"hardhat-deploy\": \"^0.11.4\",  GitHub: wighawag/hardhat-deploy Contact: wighawag (Ronan Sandford) ",
                    "links": [
                        "https://github.com/wighawag"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.931122448979592
                },
                {
                    "author_link": "https://gov.optimism.io/u/Telixgoldens",
                    "index": "122",
                    "likes": "5",
                    "time": "29/01/2023-10:29:29",
                    "content": "Project name: Arrakis finance Description Arrakis is web3’s trustless market making infrastructure protocol that enables running sophisticated algorithmic strategies on Uniswap V3. Liquidity providers can utilize Arrakis Vaults to have their liquidity be managed in an automated, capital efficient, non-custodial and transparent manner. Links https://twitter.com/arrakisfinance Contact   Discord    Join the Arrakis Finance Discord Server! The Arrakis Finance Discord server is the central hub for anyone interested in Liquidity Provisioning in DeFi. | 5,450 members      ",
                    "links": [
                        "https://discord.com/invite/arrakisfinance",
                        "https://discord.com/invite/arrakisfinance"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.458333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/Jayjoe",
                    "index": "123",
                    "likes": "2",
                    "time": "29/01/2023-10:38:56",
                    "content": "Hi I’m so happy to be part of these exercise… The projects name: “Velodrome Finance” An explanation of how the project has aided in the creation and application of the OP Stack: “Velodrome is an AMM fork of Solidly that was created to offer liquidity and little platform slippage. By offering liquidity and allowing users to vote on which pair should receive that liquidity, Velodrome is assisting in the expansion of the Optimism ecosystem” A link to the project’s Twitter: https://twitter.com/VelodromeFi?s=20&t=L69ekmxj3BluZfIefJ53Sw ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.020833333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/tmcnylmz",
                    "index": "124",
                    "likes": "3",
                    "time": "29/01/2023-13:16:54",
                    "content": "The projects name: TallyHo Wallet A description :The community owned and operated Web3 wallet. Tally Ho is the community-owned Web3 wallet. It’s got everything you need for DeFi + NFTs, plus lots of awesome features to love:  An awesome Ledger integration A beautiful NFT gallery Swaps with no hidden fees  It’s also the safest way to connect to web3:  Tally Ho is 100% open source You have full control over your coin Independently audited A link to the project’s github: GitHub - tallyhowallet/tallyho.org: The primary website for Tally Ho, the community owned and operated Web3 wallet. Contact info for the project : https://twitter.com/TallyHoOfficial   ",
                    "links": [
                        "https://twitter.com/TallyHoOfficial"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.324074074074074
                },
                {
                    "author_link": "https://gov.optimism.io/u/dandi",
                    "index": "125",
                    "likes": "2",
                    "time": "29/01/2023-13:35:43",
                    "content": "The project’s name is go-ethereum. go-ethereum is an open-source implementation of the Ethereum protocol written in the Go programming language. It is a core dependency for many projects within the Ethereum ecosystem and is widely used by developers to build and deploy decentralized applications (dapps) on the Ethereum blockchain. One of the key ways in which go-ethereum has supported the development and usage of the OP Stack is by providing developers with a reliable and stable foundation upon which they can build their dapps. It is a core piece of technology in the Ethereum ecosystem and is a key component of the OP Stack. The developer of go-ethereum, Peter, has been committed to maintaining and updating the project even in the face of many opportunities to work on more lucrative projects. This dedication and commitment to the project have been critical in ensuring that go-ethereum remains a reliable and stable foundation for the development of dapps on the Ethereum blockchain. Many core developers in the Ethereum ecosystem are underfunded, and this nomination for go-ethereum is an important recognition of the vital role that these developers play in the ecosystem. It is hoped that this nomination will be the first of many in the round that will consider some of the builders whose shoulders we’ve almost all stood on. In conclusion, go-ethereum is a vital project that has supported the development and usage of the OP Stack by providing developers with a reliable and stable foundation upon which they can build their dapps. The dedication and commitment of the developer, Peter, has been critical in ensuring that go-ethereum remains a core piece of technology in the Ethereum ecosystem. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.016666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/Saso",
                    "index": "126",
                    "likes": "1",
                    "time": "29/01/2023-14:57:08",
                    "content": "I would like to have this project below Project Name: Clipper Exchange (https://twitter.com/Clipper_DEX), It is A decentralized exchange that’s built for retail traders. It can be connected with different chains and meet users’ need. As far as i know, a lot people use this DEX. Join the community: https://discord.gg/clipper More details,  you can check the Discord. My DC: Monkey M#2673 ",
                    "links": [
                        "https://t.co/t2xbZtLkBV"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6875
                },
                {
                    "author_link": "https://gov.optimism.io/u/otemo",
                    "index": "127",
                    "likes": "1",
                    "time": "29/01/2023-15:52:05",
                    "content": "・The projects name: Velodrome ・A description of how the project has supported development and usage of the OP Stack: The central trading and liquidity marketplace The site design is very user-friendly and continues to improve compared to a few months ago. What is outstanding is the sheer number of investors putting money into the site, with a proprietary token $VELO lock rate of 81%. This provides a sense of security and attracts further inflows, and I believe it is becoming a core part of the Optimism ecosystem. ・A link to the project’s GitHub or Twitter: https://twitter.com/VelodromeFi ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.678571428571429
                },
                {
                    "author_link": "https://gov.optimism.io/u/hilmarx",
                    "index": "128",
                    "likes": "2",
                    "time": "29/01/2023-18:34:37",
                    "content": "Project Name Gelato Description Gelato is on a mission to become the decentralized backend of web3 with the aim to help projects outsource, scale and decentralize their entire web3 backend stack. Using Gelato, web3 projects can augment their smart contract applications by making them a) automated, b) gasless and c) off-chain aware. Many projects on Optimism such as Yearn, Connext, Synthetix, Ripae and Lemma Finance have benefitted from Gelato’s decentralized backend services and using Gelato’s infrastructure, developers saved countless of hours of building, running and maintaining complex web3 backend infrastructure at scale. Gelato’s mission is to accelerate the adoption of web3 by providing developers with all the backend tools they need in order to offer reliable, user friendly and feature rich applications to their users. Links  Website Github  Contact  Magdalena Fitchl - magdalena@gelato.digital  Disclaimers I work for Gelato ",
                    "links": [
                        "https://github.com/gelatodigital"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.785714285714285
                },
                {
                    "author_link": "https://gov.optimism.io/u/miguelm",
                    "index": "129",
                    "likes": "7",
                    "time": "29/01/2023-18:57:15",
                    "content": "I am nominating MerkleTreeJS, a TypeScript NPM package used for generating merkle trees and merkle tree proofs, that is used in the OP stack and the broader Ethereum ecosystem in general. The project name: MerkleTreeJS A description of how the project has supported development and usage of the OP Stack:  MerkleTreeJS has been a dependency in various OP packages, such as OP SDK, since OP inception. MerkleTreeJS makes it very easy to work with merkle trees (generating roots and proofs, verification) that works well with Solidity merkle tree library contracts. MerkleTreeJS is a trusted library with 80k weekly NPM downloads and used by more than 11k projects so hopefully it gets some recognition in this RetroPGF Round!  A link to the project’s GitHub or Twitter: GitHub: GitHub - merkletreejs/merkletreejs: 🌱 Construct Merkle Trees and verify proofs in JavaScript. (optional) contact info for the project or project lead: GitHub: miguelmota (miguel) · GitHub (library author) ",
                    "links": [
                        "https://github.com/miguelmota"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.719444444444445
                },
                {
                    "author_link": "https://gov.optimism.io/u/nhggty",
                    "index": "130",
                    "likes": "2",
                    "time": "29/01/2023-19:22:08",
                    "content": "Across Protocol The Across Protocol project provides cross-chain connectivity for Ethereum Layer 2 platforms like Optimism and rollups, secured by UMA’s oracle. It is designed to be capital efficient with a single liquidity pool, low-cost relayers, and a fee model that eliminates slippage. The Across Protocol is fast, cheap, and secure, making it a key public good for Optimism users, who have bridged over $130 million with minimal fees and secure transactions. https://twitter.com/AcrossProtocol rcarman@umaproject.org ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.071428571428571
                },
                {
                    "author_link": "https://gov.optimism.io/u/tajsama1598",
                    "index": "131",
                    "likes": "3",
                    "time": "29/01/2023-22:28:06",
                    "content": "The project name: Sonne Finance A description of how the project has supported development and usage of the OP Stack: Sonne Finance is a decentralized, transparent, and non-custodial peer-to-peer lending protocol on the Optimism ecosystem that supports assets such as DAI, USDT, USDC, WETH, OP, sUSD, WBTC, and SNX. The team behind the project has experience in the DeFi space and aims to be the leading lending platform on Optimism through competitive incentives, deep liquidity, and being native to the ecosystem. They also plan to innovate on revenue sharing and tokenomics, and attract capital from other chains to bring new users to the ecosystem by providing a top-notch blockchain experience. The project is requesting 300,000 OP tokens and has not previously applied for an OP grant. A link to the project’s GitHub or Twitter: https://twitter.com/SonneFinance   GitHub    sonne-finance sonne-finance has 2 repositories available. Follow their code on GitHub.      ",
                    "links": [
                        "https://github.com/sonne-finance",
                        "https://github.com/sonne-finance"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6841856060606055
                },
                {
                    "author_link": "https://gov.optimism.io/u/web3masteron",
                    "index": "132",
                    "likes": "2",
                    "time": "29/01/2023-22:37:26",
                    "content": "The project name : Meson A description of how the project has supported development and usage of the OP Stack: It is an economical and fast bridge for L1 and L2 solutions. Use it every time I need to exchange or transfer between blockchains A link to the project’s GitHub or Twitter: https://twitter.com/mesonfi   GitHub    Meson Meson has 5 repositories available. Follow their code on GitHub.      ",
                    "links": [
                        "https://github.com/MesonFi",
                        "https://github.com/MesonFi"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/AgeManning",
                    "index": "133",
                    "likes": "3",
                    "time": "30/01/2023-03:55:34",
                    "content": "Project Name: Lighthouse Description: Lighthouse is a rust-based Ethereum consensus client. Along with contributing to the research an development of the Ethereum layer 1 protocol, the team is actively working on scaling the protocol, via EIP4844 which will significantly reduce the costs of layer 2 tx fees, including Optimism. In order to ship this feature, the team will likely be working closely with Optimism to ensure the changes are suitable for the needs of all layer 2s. Links  GitHub - sigp/lighthouse: Ethereum consensus client in Rust https://lighthouse.sigmaprime.io  Note: Our team can also be indirectly funded via the protocol guild and we fully support their nomination. Therefore the Protocol Guild nomination should be considered before this one. ",
                    "links": [
                        "https://lighthouse.sigmaprime.io"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.989583333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/Orbiter_Gwen",
                    "index": "134",
                    "likes": "9",
                    "time": "30/01/2023-06:31:22",
                    "content": "Project Name: Orbiter.Finance Author Name: Gwen Number of OP tokens requested: Proposal for token distribution (under 1000 words): -Project Introduction Orbiter Finance is a decentralised cross-rollup bridge that aims to offer infrastructure at Layer 2 and permit instant, low-cost transactions of Ethereum-native assets. We support cross-rollup transfers among Ethereum, Optimism, StarkNet, zkSync, Loopring, Arbitrum, Arbitrum Nova, Polygon, BNB Chain, ZKSpace, Immutable X, dYdX, Metis and Boba. Contract System Design Three contracts deployed in Orbiter’s system guarantees the security of transactions and avoids disorders.  MDC contract (Maker Deposit Contract). MDC contract has two functions - keep Makers’ margin and handing the send-back and compensation for Senders. EBC contract (Event Binding Contract). EBC contract is used to make the validity proof of Source Tx and Target Tx. EBC also keeps the rules of Orbiter: ① The rule for Maker to deposit margin on different rollups. ② The rule of the correspondence between the Source Tx and Target Tx. SPV contract. SPV is used to make the existence proof of Source Tx on the Source Network.  How Does SPV Function on Optimistic Rollups On Optimism, every tx will be sent to “sequencer”, which provides the following services: ● Providing instant transaction confirmations and state updates. ● Constructing and executing L2 blocks. ● Submitting user transactions to L1. Periodically, these pending transactions are uploaded to Ethereum in huge batches (with rudimentary compression) for finalisation. All Batches are stored in the Ethereum contract CTC(CanonicalTransactionChain). In essence, this CTC constitutes the Optimism blockchain. When the transaction batch has been uploaded to Ethereum (or an individual wallet transmits a transaction directly from the CTC Contract’s enqueue method), the CTC contract will emit a “TransactionEnqueued” Event. The “sequencer” service monitors this event to update the L2 transaction state. After the tx’s data has been submitted to Ethereum, the sequencer’s other service “batch-submitter” will periodically submit these tx’s (block’s because each tx has a block) stateRoot to Ethereum in larger batches to prove a transaction is on-chain. These batches are held in an Ethereum contract known as SCC(State Commitment Chain). The SCC comprises a list of state roots, which correspond to the result of applying each transaction in the CTC to the prior state in an optimistic scenario. After that, Fault proofs can function. Since there is no direct verification of stateRoot’s validity, every stateRoot can be contested via “fault-proof.” If the stateRoot is successfully challenged, it is removed from the StateCommitmentChain and replaced with a different proposed stateRoot. A successful challenge does not roll back Optimism itself, but rather the public stateRoot of the chain. The sequence of transactions and the state of Optimism are unaffected by a challenge that is flawless. How will the OP tokens be distributed? All OP tokens we receive will be distributed in user incentives in the OP ecosystem. Over what period of time will the tokens be distributed? TBC How much will your project match in co-incentives? 90% Number of OP tokens requested: 30000 OP Did the project apply for or receive OP tokens through the Foundation Partner Fund?: NO If OP tokens were requested from the Foundation Partner Fund, what was the amount?: NO How much will your project match in co-incentives?: 90% Please provide any additional information that will facilitate accountability:(smart contracts addresses relevant to the proposal, relevant organizational wallet addresses, etc.) Organisational Wallet Addresses: 0x85Fa0E6B9651321De6519Bee1C90d446C7911724 Twitter Account: https://twitter.com/Orbiter_Finance Discord:    Discord    Join the Orbiter Finance Discord Server! 🛸Welcome to Orbiter community, let's be flying around L222 space with ORBITER! | 50,776 members      Telegram Handle @GwenOrbiter ",
                    "links": [
                        "https://etherscan.io/address/0x5E4e65926BA27467555EB562121fac00D24E9dD2#code",
                        "https://etherscan.io/address/0xBe5dAb4A2e9cd0F27300dB4aB94BeE3A233AEB19#code",
                        "https://twitter.com/Orbiter_Finance",
                        "https://discord.com/invite/hJJvXP7C73",
                        "https://discord.com/invite/hJJvXP7C73"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.954545454545455
                },
                {
                    "author_link": "https://gov.optimism.io/u/Orbiter_Gwen",
                    "index": "135",
                    "likes": "8",
                    "time": "30/01/2023-07:57:31",
                    "content": "The projects name: Orbiter.finance A description of how the project has supported development and usage of the OP Stack: Orbiter Finance is a decentralised cross-rollup bridge that aims to offer infrastructure at Layer 2 and permit instant, low-cost transactions of Ethereum-native assets. We support cross-rollup transfers among Ethereum, Optimism, StarkNet, zkSync, Loopring, Arbitrum, Arbitrum Nova, Polygon, BNB Chain, ZKSpace, Immutable X, dYdX, Metis and Boba.  Contract System Design Three contracts deployed in Orbiter’s system guarantees the security of transactions and avoids disorders.  MDC contract (Maker Deposit Contract). MDC contract has two functions - keep Makers’ margin and handing the send-back and compensation for Senders. EBC contract (Event Binding Contract). EBC contract is used to make the validity proof of Source Tx and Target Tx. EBC also keeps the rules of Orbiter: ① The rule for Maker to deposit margin on different rollups. ② The rule of the correspondence between the Source Tx and Target Tx. SPV contract. SPV is used to make the existence proof of Source Tx on the Source Network.  How Does SPV Function on Optimistic Rollups On Optimism, every tx will be sent to “sequencer”, which provides the following services: ● Providing instant transaction confirmations and state updates. ● Constructing and executing L2 blocks. ● Submitting user transactions to L1. Periodically, these pending transactions are uploaded to Ethereum in huge batches (with rudimentary compression) for finalisation. All Batches are stored in the Ethereum contract CTC(CanonicalTransactionChain). In essence, this CTC constitutes the Optimism blockchain. When the transaction batch has been uploaded to Ethereum (or an individual wallet transmits a transaction directly from the CTC Contract’s enqueue method), the CTC contract will emit a “TransactionEnqueued” Event. The “sequencer” service monitors this event to update the L2 transaction state. After the tx’s data has been submitted to Ethereum, the sequencer’s other service “batch-submitter” will periodically submit these tx’s (block’s because each tx has a block) stateRoot to Ethereum in larger batches to prove a transaction is on-chain. These batches are held in an Ethereum contract known as SCC(State Commitment Chain). The SCC comprises a list of state roots, which correspond to the result of applying each transaction in the CTC to the prior state in an optimistic scenario. After that, Fault proofs can function. Since there is no direct verification of stateRoot’s validity, every stateRoot can be contested via “fault-proof.” If the stateRoot is successfully challenged, it is removed from the StateCommitmentChain and replaced with a different proposed stateRoot. A successful challenge does not roll back Optimism itself, but rather the public stateRoot of the chain. The sequence of transactions and the state of Optimism are unaffected by a challenge that is flawless. A link to the project’s GitHub or Twitter: Github: Orbiter Finance · GitHub Twitter: https://twitter.com/Orbiter_Finance (optional) contact info for the project or project lead: Telegram: @GwenOrbiter Email: Gwen@orbiter.finance ",
                    "links": [
                        "https://etherscan.io/address/0x5E4e65926BA27467555EB562121fac00D24E9dD2#code",
                        "https://etherscan.io/address/0xBe5dAb4A2e9cd0F27300dB4aB94BeE3A233AEB19#code",
                        "https://github.com/Orbiter-Finance",
                        "https://twitter.com/Orbiter_Finance"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.770833333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/vwtao.eth",
                    "index": "137",
                    "likes": "1",
                    "time": "30/01/2023-09:34:45",
                    "content": "I am an employee of OP Labs but making this nomination in my personal capacity   The projects name: Tally Ho   A description of how the project has supported development and usage of the OP Stack: Tally Ho is an open source, MIT licensed, community owned wallet. Independently of Optimism, Tally Ho ran a Galxe quest (Optimission) to reward users with an NFT for participating in OP Quests, with 10k participants. Tally Ho is a big supporter of the Optimism dapp ecosystem and expressed interest in being a OP Stack native wallet.   A link to the project’s GitHub or Twitter: https://twitter.com/TallyHoOfficial   A link to the project’s GitHub or Twitter:   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Tor",
                    "index": "138",
                    "likes": "1",
                    "time": "30/01/2023-11:36:24",
                    "content": "Happy using Optimism for a while.     system:    The projects name: Premia Finance  A description of how the project has supported development and usage of the OP Stack: The project significantly streamlines the process of underwriting and purchasing of options, making it significantly more efficient. My initial exposure to the realm of options trading was facilitated by this project.  A link to the project’s GitHub or Twitter: Premian Labs · GitHub   (optional) contact info for the project or project lead: Please kindly contact via this discord: Premia     ",
                    "links": [
                        "https://discord.com/invite/premia"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.275
                },
                {
                    "author_link": "https://gov.optimism.io/u/Kethic",
                    "index": "140",
                    "likes": "5",
                    "time": "30/01/2023-16:10:22",
                    "content": "Project Name Slither Description Solidity code analysis tool and framework for detecting vulnerabilities and improving code comprehension. It was the first widely used solidity static analysis tool, and remains one of the go-to tools to this day.  It’s one of a suite of open source security tools provided by Trail of Bits, which includes Slither and Echidna for Solidity, and a number of tools for other languages. These tools have single-handedly made thousands of deployments safer, for free. Links   GitHub    GitHub - crytic/slither: Static Analyzer for Solidity Static Analyzer for Solidity. Contribute to crytic/slither development by creating an account on GitHub.      Contact opensource@trailofbits.com ",
                    "links": [
                        "https://github.com/crytic/slither"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.203125
                },
                {
                    "author_link": "https://gov.optimism.io/u/philknows",
                    "index": "141",
                    "likes": "1",
                    "time": "30/01/2023-16:27:04",
                    "content": "  The projects name: Lodestar   A description of how the project has supported development and usage of the OP Stack:   Lodestar is a Typescript ecosystem for Ethereum consensus, developed by ChainSafe Systems. Our flagship product is our production-capable beacon chain and validator client. In addition, we maintain public repositories of useful tools for public use. Some of these libraries include BLS, SSZ, Discv5, Gossipsub, and Noise. Active work is being done to support the OP Stack by enabling EIP-4844 to benefit L2s such as Optimism, reducing tx costs of Layer 2 fees and increasing client diversity at the Layer 1 protocol level. Additionally, Lodestar team members have been working on side projects such as Zipline which used the OP Cannon verifiable computation tools to develop a light client, enabling a trustless bridge protocol. Lodestar’s niche is in its implementation language, Typescript. Our software and tooling is uniquely situated as the go-to for researchers and developers for rapid prototyping and browser usage. Millions of developers around the world are familiar with Typescript, and Lodestar’s high-quality codebases are excellent introductions to the Ethereum world. With the goal of increasing client diversity and attracting new talent from one of the largest groups of developers in the world. We fully support other teams in Protocol development and projects which indirectly fund client team implementors such as Protocol Guild.  A link to the project’s GitHub or Twitter: GitHub - ChainSafe/lodestar: 🌟 TypeScript Implementation of Ethereum Consensus GitHub - ChainSafe/Zipline-lightclient: Hackathon for EthBogota - An Eth2 light client using Cannon verifyable computation  ",
                    "links": [
                        "https://github.com/ChainSafe/Zipline-lightclient"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.942676767676768
                },
                {
                    "author_link": "https://gov.optimism.io/u/vbuterin",
                    "index": "143",
                    "likes": "5",
                    "time": "30/01/2023-18:18:13",
                    "content": "  Project name: The Keccak hash function  A description of how the project has supported development and usage of the OP Stack: the Keccak hash function is the bedrock of the security of Ethereum and Optimism, including Optimism’s fault proofs  Links: https://keccak.team/   Contact info: see email provided at their website   ",
                    "links": [
                        "https://keccak.team/team.html"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/zahary",
                    "index": "144",
                    "likes": "2",
                    "time": "30/01/2023-18:27:01",
                    "content": " Project Name Nimbus  Description Nimbus is a client implementation for both Ethereum’s consensus layer and execution layer that strives to be as lightweight as possible in terms of resources used. This allows it to perform well on embedded systems, embedded devices – including Raspberry Pis and mobile devices. However, resource-restricted hardware is not the only thing Nimbus is good for. Its low resource consumption makes it easy to run Nimbus efficiently in L2 networks with higher throughput that may require additional workloads on the same server. Nimbus is trying to accelerate the development of L2 protocols such as OP through the ongoing work on EIP-4844. In the future, we hope to bring more client diversity in the Optimism network, both in terms of node software for end users and in highly efficient components for the construction and verification of fault proofs.  Links    GitHub    GitHub - status-im/nimbus-eth2: Nim implementation of the Ethereum Beacon Chain Nim implementation of the Ethereum Beacon Chain. Contribute to status-im/nimbus-eth2 development by creating an account on GitHub.         GitHub    GitHub - status-im/nimbus-eth1: Nimbus: an Ethereum Execution Client for... Nimbus: an Ethereum Execution Client for Resource-Restricted Devices - GitHub - status-im/nimbus-eth1: Nimbus: an Ethereum Execution Client for Resource-Restricted Devices      ",
                    "links": [
                        "https://github.com/status-im/nimbus-eth2",
                        "https://github.com/status-im/nimbus-eth1",
                        "https://github.com/status-im/nimbus-eth1"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.928787878787879
                },
                {
                    "author_link": "https://gov.optimism.io/u/Ajooo",
                    "index": "145",
                    "likes": "1",
                    "time": "30/01/2023-18:46:15",
                    "content": "  The projects name: Velodrome Finance **Velodrome FI is a AMM, which i discovered during Optimism Quest and i;ve loved it. In my opinion it works as aflywheel for whole OP ecosystem and as a magnes for new users.  A link to the project’s GitHub or Twitter: https://twitter.com/VelodromeFi   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.7272727272727275
                },
                {
                    "author_link": "https://gov.optimism.io/u/stas",
                    "index": "147",
                    "likes": "4",
                    "time": "30/01/2023-20:25:37",
                    "content": "I’m part of Velodrome Finance team, but I’m nominating this project in my own capacity.  Agora Liquid Delegator (codename Alligator) by w1nt3r Alligator came up in our Velodrome V2 development sprint. I believe it has a massive potential in activating the currently sleeping DeFi in the governance tokens. The OP Stack, just like any ecosystem, will need support for liquid delegation to reward the governance participants by allowing them to use their voting power with regular DeFi protocols.  Eg. stake your $OP tokens with Velodrome, benefit from liquid staking to not lose your voting power, but also get incentives for providing liquidity.  Github: GitHub - w1nt3r-eth/liquid-delegator: 🐊 Farcaster: w1nt3r - fcast.me ",
                    "links": [
                        "https://fcast.me/w1nt3r"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6000000000000005
                },
                {
                    "author_link": "https://gov.optimism.io/u/bendi",
                    "index": "148",
                    "likes": "2",
                    "time": "30/01/2023-20:38:12",
                    "content": "The projects name: Umbra A description of how the project has supported development and usage of the OP Stack: Umbra is a stealth address protocol enabling privacy preserving payments. It is a fully grant funded project, designed as a public good protocol on which others can build. Umbra has never received funding from VC’s nor done an airdrop. Umbra launched on Optimism in April 2022. Since then, more than 7,600 accounts have registered to received stealth payments, and more than 9,000 addresses have sent at least one privacy preserving payment, with more than $5 Million in value transacted. The ScopeLift team, which created and stewards the Umbra protocol, recently shipped support for stablecoin payments on Optimism. The team is also currently contributing to an EIP to help establish a stealth address standard for EVM networks. A link to the project’s GitHub or Twitter: Twitter: @UmbraCash GitHub: ScopeLift/umbra-protocol Contact info for the project or project lead: Ben DiFrancesco, email ben at scopelift dot co ",
                    "links": [
                        "https://github.com/ScopeLift/umbra-protocol"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.055555555555555
                },
                {
                    "author_link": "https://gov.optimism.io/u/benjaminion",
                    "index": "150",
                    "likes": "3",
                    "time": "30/01/2023-21:12:28",
                    "content": "The project’s name Teku A description of how the project has supported development and usage of the OP Stack Teku is an Ethereum consensus client, fully open source and Apache 2 licensed. Teku has been in production on the beacon chain since genesis and contributes significantly to client-diversity on the consensus layer, which is vital for the security and safety of layer 2 solutions built on Ethereum. The Teku team has been working hard to implement and improve EIP-4844, the key enabler for highly scalable roll-ups such as Optimism. In addition, the initial work on the C-KZG library that provides the cryptographic interface for EIP-4844 was done by a Teku team member. This will likely be used by several of the consensus and execution clients, as well as roll-up operators. A link to the project’s GitHub or Twitter Teku is on GitHub and Twitter, @Teku_ConsenSys. (optional) contact info for the project or project lead You can contact me via Twitter DM, @benjaminion_xyz. Note that Teku team members also participate in the Protocol Guild, and that is a fine way to fund the core devs’ work directly. We would be delighted either way. Fun fact Teku also happens to be the name of the finest beer glass in the world. ",
                    "links": [
                        "https://www.tekuglass.com/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.664285714285714
                },
                {
                    "author_link": "https://gov.optimism.io/u/yuumi",
                    "index": "151",
                    "likes": "1",
                    "time": "30/01/2023-21:25:44",
                    "content": "The projects name: lattice A description of how the project has supported development and usage of the OP Stack: in october lattice launched opcraft,It’s an on-chain 3D voxel world where every aspect of the World - every river, blade of grass, and patch of snow atop a mountain - exists on-chain. A world where every action is executed as an Ethereum transaction. A link to the project’s GitHub or Twitter:https://twitter.com/latticexyz (optional) contact info for the project or project lead:https://opcraft.mud.dev/ ",
                    "links": [
                        "https://opcraft.mud.dev/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/erxc",
                    "index": "152",
                    "likes": "10",
                    "time": "30/01/2023-22:02:45",
                    "content": "Project name: Pocket Network A description of how the project has supported development and usage of the OP Stack: Pocket Network is a decentralized web3 infrastructure provider focused on optimizing the developer experience with scalable, reliable, fast, and privacy-centric services. Pocket Network has integrated support for Optimism on 13/06/2022.   Since this time our public endpoint usage has ramped up to over 40M daily API calls.  In addition to our public endpoints, developers on Optimism can use the Pocket Portal to receive the following benefits:  250k daily call free tier Simple and affordable PAYG pricing Multichain support - 25+ chains Smart contract whitelisting security features Analytics tools 99.9% SLA commitments Low latency service Multi region support -  Pocket Protocol supports 15 regions and PNI runs backups in 3 ( US-E, EU-C, Singapore )  A link to the project’s GitHub or Twitter: Twitter: https://twitter.com/pocketnetwork GitHub: Pocket Network · GitHub (optional) contact info for the project email: eric@pokt.network TG: erxc_u ",
                    "links": [
                        "https://github.com/pokt-network"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.407142857142857
                },
                {
                    "author_link": "https://gov.optimism.io/u/mds1",
                    "index": "153",
                    "likes": "1",
                    "time": "30/01/2023-22:25:20",
                    "content": "The project’s name: Flexible Voting A description of how the project has supported development and usage of the OP Stack: Flexible Voting is an extension to the widely used OpenZeppelin DAO Governor that enables powerful new voting patterns for voting through proxy contracts. It is developed by ScopeLift, and it was originally funded by a grant from the Uniswap Grant Program (UGP). The most relevant application for Flexible Voting on Optimism comes in the form of cross chain governance voting. Currently, if a user bridges their Layer 1 Governance tokens to Optimism, they’re not longer able to participate in Governance votes. Flexible Voting allows for an elegant, trust minimized solution to this limitation. The bridge contract delegates its votes to a proxy contract, and the proxy contract votes proportionally on behalf of holders of the bridged token. With cross chain communication, holders of a governance token on Optimism could vote on Optimism—paying the cheaper gas prices available there—then be guaranteed this vote will be reflected on L1. A single cross chain transaction can roll up the votes of thousands of holders on Optimism into a single delegated vote on L1. This encourages more activity on L2 by enabling Governance Token holders to bridge their tokens to Optimism without giving up their ability to participate in proposal votes. ScopeLift is currently working to see Flexible Voting adopted as an ecosystem standard. In addition to our work to enable Layer 2 voting we’ve also:  Implemented an integration with Aave, thanks to a grant from Aave Grants DAO Scheduled audit of the Flexible Voting contracts with OpenZeppelin Been enlisted by GitcoinDAO to upgrade their Governor Coordinated with Tally to see Flexible Voting support added to their DAO tooling  A link to the project’s GitHub or Twitter: ScopeLift/flexible-voting Contact info for the project or project lead: Ben DiFrancesco (ben at scopelift dot co) ",
                    "links": [
                        "https://github.com/ScopeLift/flexible-voting"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.917126623376623
                },
                {
                    "author_link": "https://gov.optimism.io/u/kevin",
                    "index": "156",
                    "likes": "1",
                    "time": "31/01/2023-02:17:21",
                    "content": "The person’s name: Christian Reitwiessner (ethchris) A description of how the person has supported development and usage of the OP Stack: Chris has provided outsized value for the OP Stack. As team lead and creator of Solidity, he has led the creation of the most widely used language to write smart contracts on Optimism Mainnet. All of the OP Stack contracts are also currently written in Solidity. In addition to the value Chris has created as the driving force behind the creation and improvement of Solidity until his departure in late 2022, he has been very helpful to the OP Labs team over the past few years of building out the OP Stack. From the early days of the Optimism Mainnet network (back when it was Optimistic Ethereum), Chris was enormously valuable in helping us understand the tweaks we had to make the Solidity compiler to make contracts compatible with the OVM. While most of that code has been deprecated during the re-architecting of the system over the past 1.5 years, Chris saved the OP Labs engineering and research contributors enormous amounts of time by reliably providing support when we needed it. A link to the project’s GitHub or Twitter: Chris’s Twitter Contact info for the project or project lead:  Chris’s Twitter Disclaimers I work for OP Labs. I am making this nomination in my capacity as an individual and not on behalf of OP Labs. ",
                    "links": [
                        "https://twitter.com/ethchris"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.004201680672269
                },
                {
                    "author_link": "https://gov.optimism.io/u/0xngmi",
                    "index": "158",
                    "likes": "1",
                    "time": "31/01/2023-03:50:32",
                    "content": "  The projects name: Chainlist  A description of how the project has supported development and usage of the OP Stack: Chainlist keeps a list of all public RPCs, along with their privacy policies and performance.  A link to the project’s GitHub or Twitter: GitHub - DefiLlama/chainlist   (optional) contact info for the project or project lead: 0xngmi on twitter  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/launchifi",
                    "index": "159",
                    "likes": "1",
                    "time": "31/01/2023-04:44:44",
                    "content": "  The projects name: Launchifi - No-Code Smart Contract Launchpad   A description of how the project has supported development and usage of the OP Stack: Launchifi Platform - Launchifi enables creators with little or no technical knowledge the ability to write, deploy and verify their smart contracts to Optimism, along with other popular EVM based chains, with just a click of the button. Having full ownership over their smart contracts, we are empowering these creators to truly have full-control over what gets included in their smart contracts and what doesn’t with a wealth of advanced configurations and contract types at their disposal. Our full suite of smart contracts and configurations are all available for free to any creator looking to launch on Optimism.   Development in Progress: Within the Launchifi ecosystem we have a number of features set to roll out in the next few weeks. One of which is a contract manager, which allows users to access and make calls to their newly deployed contracts all from one dashboard. This will be a very similar experience to Remix, only much more user friendly and integrated for all the chains that we support, most importantly Optimism. No more toggling between tabs and windows to write, deploy and manage a smart contract. Our system will enable this development cycle all under one roof 100% code free. Along with our no-code smart contract launchpad, we are currently developing a mint dapp marketplace that will be included for every contract that gets deployed through our platform. Upon deployment of their smart contract, the user simply has to visit the marketplace, edit their collection page (similar to an opensea collection editing), and launch their mint. The user’s smart contract will automatically be linked to their collection page so no extra coding or work will be necessary. With this, we hope to become the easiest and most user friendly way to launch Optimism, and other EVM based, NFT collections bringing even more incredible creators to the space.   Web3 Education: Beyond our platform tools, we are planning to roll out our educational youtube series of videos. To not only supplement the platform for overall ease of use and understanding, but teach our community members about Web3 systems and technology. We hope to educate our community on the benefits and applications of smart contracts, how they work, and what it takes to develop their own and truly master this domain. Other topics we have planned are Web3 safety and security, exploratory applications of smart contracts, and more.   A link to the project’s GitHub or Twitter: Launchifi Twitter Account   Contact info for the project or project lead: Project Account - You can message our business account on Twitter @Launchifi   ",
                    "links": [
                        "https://twitter.com/launchifi"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.040532605692181
                },
                {
                    "author_link": "https://gov.optimism.io/u/siladu",
                    "index": "161",
                    "likes": "1",
                    "time": "31/01/2023-05:36:30",
                    "content": "  The projects name: Hyperledger Besu   A description of how the project has supported development and usage of the OP Stack:   Hyperledger Besu is one of the main execution clients on Ethereum Mainnet. It has been around since early 2019 (FKA Pantheon) as the Java implementation of Ethereum that is compatible with Mainnet and private networks. The Besu team has worked to bring enterprise interest into Ethereum by proliferating Ethereum standards into the Enterprise DLT world through the EEA and Hyperledger foundation. The project has also been providing client diversity on Ethereum Mainnet and driving its development forward. The Besu client team led the design and development of EIP-1559 as champions. This change to Ethereum’s tokenomic structure has proven extremely valuable in how the network is secured across Layer 1 and Layer 2. The Besu team has also developed a handful of technologies it hopes to proliferate in client design. The Bonsai storage paradigm is one that hopes to enhance other execution clients like Geth and Nethermind by providing a forward-looking checkpoint structure for small state storage and growth. Besu has an extractable/stand-alone EVM library that allows for plug-and-play Ethereum approaches and is working in 2023 and 2024 to modularize the client to better work with existing and new rollup technologies. Prioritizing rollup execution is a stated goal of our 2023 roadmap.   A link to the project’s GitHub or Twitter: github.com/hyperledger/besu   (optional) contact info for the project or project lead: Matt Nelson (matt.nelson@consensys.net)   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.279461279461279
                },
                {
                    "author_link": "https://gov.optimism.io/u/Oxytocin",
                    "index": "163",
                    "likes": "1",
                    "time": "31/01/2023-09:29:24",
                    "content": "I am putting this nomination forward for the Badgeholders for reasons further explained in the description. However, I must also clarify I am not very familiar with the project as I have not had much time to use it. With the deadline for RPGF2 being today, I decided to nominate the project for your consideration even if I am not that acquainted with it myself. The project’s name: 1RPC.io ( https://www.1rpc.io/ ) A description of how the project has supported development and usage of the OP Stack: Even though in theory everyone can interact directly with the OP Ecosystem like every other EVM environment, it’s undeniable that the vast majority of users not only use an RPC solution, but are not even aware of it. For these users, these RPCs serve as an essential middle-man between the user and the environment, and any error on the RPC side can be a significant blocker. One particular example for this we’re all familiar with is the release date of the first OP Airdrop, where despite the actual Optimism network working just fine, the RPC was overloaded blocking access to the ecosystem. This, along with potential privacy concerns from some RPC solutions, means that it’s always healthy for an ecosystem to have a large variety of RPC providers to choose from. As seen in Chainlist.org, currently there are only about half a dozen providers of RPCs, with only two being shown as being privacy-friendly. I am nominating https://www.1rpc.io/ because not only is it one of the two privacy respecting RPCs , but they seem to want to be a pubic good and do not have a monetisation plan. From their page:  Privacy should be protected because it is one of the foundations and basic right for users of the public ledger blockchain ecosystems. We want 1RPC to be freely available and have developed it as a public good, providing users from targeted data collection when interacting with blockchains. We strive to keep it free for general Web3 users. To help us keeping it free, donations from grants and partners are accepted to make 1RPC sustainable.  Hopefully, this grant along with other future grants will encourage the onboarding of more private RPCs into the ecosystem. A link to the project’s GitHub or Twitter: https://twitter.com/AutomataNetwork / Automata Network · GitHub (optional) contact info for the project or project lead: N/A ",
                    "links": [
                        "https://www.1rpc.io/",
                        "http://Chainlist.org",
                        "https://www.1rpc.io/",
                        "https://twitter.com/AutomataNetwork",
                        "https://github.com/automata-network"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.810568704799475
                },
                {
                    "author_link": "https://gov.optimism.io/u/MattyIce",
                    "index": "164",
                    "likes": "7",
                    "time": "31/01/2023-13:15:53",
                    "content": "The project name: Resonate A description of how the project has supported development and usage of the OP Stack: Resonate is helping mature DeFi by offering a financial product which appeals to institutions. The way in which we achieve this is two-fold: First, we use Revest FNFTs (also developed by us) to tokenize locked principal and future yield. Next, we build ERC-4626 adapters (if need be) for existing farms for Resonate to plug into. These 4626 adapters are rigorously tested and subsequently released as public goods. Follow our progress on this initiative by checking out these Medium articles: ERC-4626 Vault Adapters Resonate Vaultening Update 1 Resonate Vaultening Update 2 Users are, then, able to trade their future yield for yield upfront by locking their principal for a term, while the counter-party is able to earn a boosted yield rate by earning the variable yield on the aforementioned locked principal. So far, we’ve found a great deal of success with Velodrome on some of our VELO-USDC pools. For example: Resonate has had over $100k in volume. It offers 4.57% upfront on VELO-USDC for a lock term of 30 days (55.6% annualized). Resonate is able to offer short-term lock-ups and rolling maturities thanks to Revest FNFTs. Furthermore, Resonate offers zero-slippage trades due to our order-book-like system. So how does this appeal to institutions? Well, in industries as volatile as crypto, market-neutral hedge funds have proven to be one of the most secure ways to invest in Decentralized Finance (DeFi). These investment vehicles function by both longing and shorting an asset (market neutrality) and then earn their investors returns by placing the longed asset into a yield-bearing position (“yield farm”), where it accrues interest and grows in value. This growth, however, does not occur at a predictable rate, often deviating heavily within short time-frames. This volatility in yield rates make it very difficult for market-neutral funds to succeed, as fixed-costs to open a position can quickly overshadow these variable returns, leaving the fund net-negative. Resonate is able to the perfect solution here: short-term lock and immediate upfront fixed-rates! As a matter of fact, we’ve already seen success in our pursuit of on-boarding institutions to DeFi. This medium illustrates one such example: Resonate Onboards First Institutional Fund: Coindex Capital Management | by Revest Finance | Medium.  Building financial tools and products on top of existing systems on Optimism  Developing ERC-4626 adapters for existing yield farms on Optimism  On-boarding Institutions to Optimism Links and contact GitHub: Revest Protocol · GitHub Twitter: https://twitter.com/RevestFinance Contact info for the project or project lead: rob@revest.finance ",
                    "links": [
                        "https://revestfinance.medium.com/resonate-vaultening-update-i-cbac185eab6b",
                        "https://revestfinance.medium.com/resonate-vaultening-update-ii-631f026bc230",
                        "https://app.resonate.finance/pool/optimism/0x9ca7d73ed83574ac05ac5ee09873a36c9cf036a8ea32fad242ff51cdbefd0867",
                        "https://revestfinance.medium.com/resonate-onboards-first-institutional-fund-coindex-capital-management-98a39b15d10d",
                        "https://github.com/Revest-Finance/",
                        "https://twitter.com/RevestFinance"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.879761904761905
                },
                {
                    "author_link": "https://gov.optimism.io/u/chfast",
                    "index": "165",
                    "likes": "2",
                    "time": "31/01/2023-13:33:56",
                    "content": " Ipsilon Ipsilon is EVM R&D team. It proposes, reviews and prototypes EIPs related to EVM, including EVM Object Format (EOF). Also provides the fastest open source EVM implementation: evmone. https://ipsilon.xyz team@ipsilon.xyz  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/montyly",
                    "index": "166",
                    "likes": "2",
                    "time": "31/01/2023-15:46:26",
                    "content": "Thanks @Kethic for nominating slither. For a bit more context: Slither is a Solidity static analysis framework written in Python 3. It runs a suite of vulnerability detectors, prints visual information about contract details, and provides an API to easily write custom analyses. Slither enables developers to find vulnerabilities, enhance their code comprehension, and quickly prototype custom analyses. Slither can be run directly on contracts deployed on Optimism (ex: slither optim:0x…) and has been used to prevent numerous vulnerabilities by security auditors and bug hunters (slither/trophies.md at master · crytic/slither · GitHub) Slither is being developed by Trail of Bits and is open source. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.083333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/NarutoOP",
                    "index": "167",
                    "likes": "1",
                    "time": "31/01/2023-16:15:09",
                    "content": "  The projects name: Infinity Wallet   A description of how the project has supported development and usage of the OP Stack: A web3 wallet that supports the OP stack and is a primary infrastructure project need to access and use Optimism. Its like a one-shop wallet as it has everything I need as a wallet and more like, swap, bridge, nfts, defi portfolio, web3 browser, dapp store, news, market monitoring and a bunch more. I believe they are also the biggest supporters of Optimism that I know in the wallet space and their web3 browser infrastructure provides the best experience for usage of the OP dapp ecosystem. Before I was recommended Infinity Wallet I was using Metamask, since switching I will never again use another browser extension. The Infinity Wallet guys have made the entire experience of using OP so much smoother and normal.   A link to the project’s GitHub or Twitter: https://twitter.com/InfinityWallet   (optional) contact info for the project or project lead: They have an email on the site support@infinitywallet.io, but they have 24/7 support on their site as well which I have used in the past and is really great   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.833333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/conor",
                    "index": "168",
                    "likes": "1",
                    "time": "31/01/2023-16:19:51",
                    "content": "Project name Web3j Description Web3j is the JVM integration library for EVM blockchains. It provides similar functionality to web3.js + Truffle in that supports the development, testing and deployment of Solidity contracts for the Java and Android platforms. There isn’t an L2 specific version of the library, but it is the library used by anyone wishing to talk to Ethereum networks on the JVM or Android platforms. Of which there is a lot —  it receives over 100k downloads/month and has over 2 million lifetime downloads (this is a conservative estimate). No one pays for Web3j, it’s pure OSS, and has been around since 2016. We have received grants for the library over the years, but as Optimism grows, there are like to be more JVM users, and they will in all likelihood be using Web3j to do this. Project GitHub https://github.com/web3j/web3j Contact for project lead twitter.com/conorsvensson ",
                    "links": [
                        "https://twitter.com/conorsvensson"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.892857142857143
                },
                {
                    "author_link": "https://gov.optimism.io/u/vorot93",
                    "index": "169",
                    "likes": "1",
                    "time": "31/01/2023-16:23:53",
                    "content": "  The projects name: Akula  A description of how the project has supported development and usage of the OP Stack: Ethereum node written in Rust. Project has been closed, but I believe it has helped Optimism substantially over the past year.  A link to the project’s GitHub or Twitter: GitHub - akula-bft/akula: Fastest Ethereum archive node ever built   (optional) contact info for the project or project lead: https://twitter.com/vorot93   ",
                    "links": [
                        "https://twitter.com/vorot93"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.125
                },
                {
                    "author_link": "https://gov.optimism.io/u/Jonas",
                    "index": "170",
                    "likes": "2",
                    "time": "31/01/2023-17:32:58",
                    "content": "  The projects name: Solidity   A description of how the project has supported development and usage of the OP Stack: Solidity is a statically-typed curly-braces programming language designed for developing smart contracts that run on the Ethereum Virtual Machine. Solidity is both used for the Optimism smart contracts on Ethereum mainnet as well as smart contracts running on Optimism itself.   A link to the project’s GitHub or Twitter: https://soliditylang.org/   Note: I work at the Optimism Foundation, but am making this nomination in my private capacity ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.803571428571428
                },
                {
                    "author_link": "https://gov.optimism.io/u/vandynathan",
                    "index": "171",
                    "likes": "1",
                    "time": "31/01/2023-18:03:49",
                    "content": "Project’s name: DappRadar A description of how the project has supported the development and usage of the OP Stack: DappRadar acts as a discovery portal, providing insights for investors and analysts while educating visitors about vital blockchain L2s including Optimism. DappRadar has supported the usage of the OP stack, Optimism as a network, and the whole L2 ecosystem by means of:  Integrating Optimism on DappRadar so that all dapp data is on-chain, meaning it is accurate and transparent Exposed Optimism and their associated dapps to hundreds of thousands of users Onboarded and educated users on crypto basics and the benefits of Optimism specifically through articles and industry reports  Below is a description of the project’s value prop: DappRadar is, by all objective measures, the world’s biggest dapp store. It has been building and evolving for five years and acts as a hub to all aspects of blockchain and dapp adoption. Even within the recent bear market, the website attracts an average of 500,000 visitors per month. In favourable market conditions, it attracts an average of 1.5 million monthly users. As a leading source of data and insights on decentralized applications, and the blockchain platforms they run on, we provide developers, investors, and users with the data and tools they need to make informed decisions about every aspect of their blockchain needs. With the DappRadar ecosystem, the RADAR token is used for governance and utility. Current utilities include gamification, community contribution, development scaling, and user customization. The token also powers DappRadar PRO, a unique benefit for those users who want to go deeper into on-chain data. This infrastructure and wealth of data are now being leveraged by business partners to create their own analytical tools, powered by DappRadar proprietary API. Contact info for the project or project lead : GitHub: DappRadar · GitHub Twitter: https://twitter.com/DappRadar Project lead(s): rimas@dappradar[dot]com marcus@dappradar[dot]com Note: As a new user, I can only post two links, hence the structure of the emails. ",
                    "links": [
                        "https://twitter.com/DappRadar"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.629734848484849
                },
                {
                    "author_link": "https://gov.optimism.io/u/system",
                    "index": "172",
                    "likes": "5",
                    "time": "31/01/2023-18:24:15",
                    "content": "EIP 4844 contributor Collection nomination This post nominates several individuals who have contributed to the development of EIP-4844 as a collection. If any community member wishes to nominate additional people who contributed to EIP-4844, they may do so in another nomination post. A description of how the collection has supported development and usage of the OP Stack: EIP-4844 introduces a new kind of transaction type to Ethereum which accepts “blobs” of data to be persisted in the beacon node for a short period of time. These data blobs are the first milestone towards full ethereum sharding, enabling rollups like Optimism to grow 100x in capacity. The list of contributors and the distribution of funds between them is still a work-in-progress, a draft can be found here  Disclaimer: Collections, a term used to describe projects without a single person or entity that can be verified via GitHub or Twitter, may only be nominated by the Optimism Foundation.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.790584415584416
                },
                {
                    "author_link": "https://gov.optimism.io/u/wmitsuda",
                    "index": "173",
                    "likes": "1",
                    "time": "31/01/2023-18:24:19",
                    "content": "  The projects name: Ethereum-lists  A description of how the project has supported development and usage of the OP Stack: Ethereum-lists provides opensource, curated databases of ethereum-related data, being the most important ones:  chains: list of EVM chains metadata, they are even used by other chain lists UI out there. 4bytes: an open DB of 4bytes signatures. There are other free 4bytes DBs out there, but they are closed source, privately maintained. This one is used by Otterscan. Supporting this project indirectly supports every other EVM related project, including Optimism.    A link to the project’s GitHub or Twitter: ethereum-lists · GitHub   (optional) contact info for the project or project lead: mr_ligi on twitter  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.488636363636363
                },
                {
                    "author_link": "https://gov.optimism.io/u/unnawut",
                    "index": "174",
                    "likes": "1",
                    "time": "31/01/2023-18:25:54",
                    "content": "  The project name: NiceNode  A description of how the project has supported development and usage of the OP Stack: NiceNode claims to be a community made open source project allowing users to spin up their own Ethereum Full nodes with Snap Sync through their UI with multiple clients. Not OP-specific but falls under the criteria “Eligible projects need not be exclusive to the Optimism ecosystem, but there should be a connection.”  A link to the project’s GitHub or Twitter:  https://www.nicenode.xyz/ Github: NiceNode/nice-node    (optional) contact info for the project or project lead: Discord NiceNode   ",
                    "links": [
                        "https://discord.gg/k3dpYU4Pn9"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.1875
                },
                {
                    "author_link": "https://gov.optimism.io/u/Jonas",
                    "index": "175",
                    "likes": "1",
                    "time": "31/01/2023-18:35:17",
                    "content": "  The projects name: Nethermind  A description of how the project has supported development and usage of the OP Stack: Nethermind is a high-performance, highly configurable full Ethereum protocol execution client built on .NET that runs on Linux, Windows, and macOS, and supports Clique, Aura, and Ethash. Nethermind offers very fast sync speeds and support for external plugins.  A link to the project’s GitHub or Twitter: GitHub - NethermindEth/nethermind: Our flagship Ethereum execution client for Linux, Windows, and macOS — full and actively developed.   Note: I am a team member of the Optimism Foundation but am making this nomination in my private capacity ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.825
                },
                {
                    "author_link": "https://gov.optimism.io/u/wmitsuda",
                    "index": "176",
                    "likes": "1",
                    "time": "31/01/2023-18:36:12",
                    "content": "  The projects name: Sourcify  A description of how the project has supported development and usage of the OP Stack: Sourcify is the only open contract verification database out there, which is kind of scary given how important verification data is for auditing contract security. It supports any EVM chain, hence Optimism benefits from it. I think it is an important structural, open database and opensource verification engine, so elegible for this nomination.  A link to the project’s GitHub or Twitter: GitHub - ethereum/sourcify: Decentralized Solidity contract source code verification service   (optional) contact info for the project or project lead: https://twitter.com/SourcifyEth   ",
                    "links": [
                        "https://twitter.com/SourcifyEth"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.642857142857142
                },
                {
                    "author_link": "https://gov.optimism.io/u/seetadev",
                    "index": "177",
                    "likes": "2",
                    "time": "31/01/2023-18:50:57",
                    "content": "Project Name: Urbit Calc Collaborative spreadsheet application on Urbit. A Spreadsheet Activity for Computer Supported Collaborative Learning on Urbit developed as a Web2 to Web3 initiative using SocialCalc on Sugar, OLPC’s software paradigm. The main idea of UrbitCalc is to include features that would enable users to make easy use of the typical features of Spreadsheet activities such as organization, graphing and simple calculations in their respective languages along with the strengths of Urbit’s peer to peer networking. The main features of UrbitCalc are: Tabulation Organization Graphing and Calculation Localization in different languages Experiments that support future development of the core OP Stack protocol: We wish to develop an Ethereum-Urbit bridge and scale it using Optimism. This would enable OP stack evolution to become an interoperability layer or a bridging solution for multi-chain scaling and sustainability. We wish to extend and adapt UrbitCalc to enable it to serve as a Community tooling, data visualization and analytics platform in the Optimism Eco-system. We hope that this would be a great addition to the OP stack on the infrastructure and tooling front. Github Repository: GitHub - seetadev/UrbitCalc: Collaborative spreadsheet application on Urbit Demo Video: encode urbit hackathon spreadsheet - Google Drive Link to Try: SocialCalcActivity :: Activities for Sugar and EtherCalc Github for EtherCalc: GitHub - audreyt/ethercalc: Node.js port of Multi-user SocialCalc Please find our background work and research papers published on SocialCalc, the community spreadsheet at web2 publications before 2012 and motivation for urbitcalc - Google Drive Contact Information: dev@seeta.in, marketing@tickervalue.com ",
                    "links": [
                        "https://drive.google.com/drive/u/5/folders/1fho2ZRprsnCPvvd2DFNabz521HrbwDkP",
                        "http://activities.sugarlabs.org/en-US/sugar/addon/4084",
                        "https://ethercalc.net/_start",
                        "https://github.com/audreyt/ethercalc",
                        "https://drive.google.com/drive/u/5/folders/1pYnBIFFLEAHLUSopIGe3I6qQIrDgellw"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.681818181818182
                },
                {
                    "author_link": "https://gov.optimism.io/u/karl",
                    "index": "178",
                    "likes": "1",
                    "time": "31/01/2023-18:59:03",
                    "content": "  The projects name: Cloud Native Computing Foundation  A description of how the project has supported development and usage of the OP Stack: Enabled chain deployments by supporting k8s infrastructure.  A link to the project’s GitHub or Twitter: https://twitter.com/CloudNativeFdn      The projects name: Apache Software Foundation  A description of how the project has supported development and usage of the OP Stack: Many of these open source projects have been influential in the design and architecture of the OP Stack.  A link to the project’s GitHub or Twitter: https://twitter.com/TheASF      The projects name: All projects in the Optimism Monorepo dependency trace   A description of how the project has supported development and usage of the OP Stack: This is literally the open source software which the Optimism Monorepo is based upon.  A link to the project’s GitHub or Twitter: https://github.com/ethereum-optimism/optimism/network/dependencies   I started writing a script to scrape all of the projects and put them in a nomination-type format but then realized this would be a terrible can of worms. However, I do think that in the long term the source of projects that we RPGF should be as rigorous as possible and a great way to do that is to automatically generate all of the true dependencies and reward them based on some post hoc metrics. I won’t be sad if we don’t include this and blow up our nominations by hundreds of projects, but I think the conversation is a good one to have! ",
                    "links": [
                        "https://twitter.com/TheASF",
                        "https://github.com/ethereum-optimism/optimism/network/dependencies"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.556818181818182
                },
                {
                    "author_link": "https://gov.optimism.io/u/culturestream",
                    "index": "179",
                    "likes": "2",
                    "time": "31/01/2023-19:14:07",
                    "content": "It would be good to add the software implementers to this list as well. For example the c-kzg library (GitHub - ethereum/c-kzg-4844: Minimal 4844 version of c-kzg) is largely based on work originally done by Ben Edgington (github: benjaminion, @benjaminion ). In addition there have been many other contributors to c-kzg as can be seen here: Contributors to ethereum/c-kzg-4844 · GitHub, in particular xrchz, dgcoffman, and jtraglia. c-kzg also relies heavily on blst (GitHub - supranational/blst: Multilingual BLS12-381 signature library) to perform the core underlying cryptography operations that are part of kzg commitments. ",
                    "links": [
                        "https://github.com/ethereum/c-kzg-4844/graphs/contributors",
                        "https://github.com/supranational/blst"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.956845238095239
                },
                {
                    "author_link": "https://gov.optimism.io/u/Jonas",
                    "index": "180",
                    "likes": "0",
                    "time": "31/01/2023-19:27:07",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "424"
}