{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/evaluation-of-grant-processes/4264",
            "title": "Evaluation of grant processes ",
            "index": 4264,
            "category": [],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/teaser",
                    "index": "1",
                    "likes": "1",
                    "time": "08/12/2022-14:56:44",
                    "content": "How would it be if information was provided for the previously distributed grants (1 and 2)? Grants were distributed to these projects. The process is still ongoing. Let them compare the old and new situation. What was the situation before the grant? What happened after the grant? How many new users have come? How much has the volume increased? So did these grants really stimulate the optimism ecosystem? Or there was no change. Let’s find where the problem is. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.79004329004329
                },
                {
                    "author_link": "https://gov.optimism.io/u/NicoEsp",
                    "index": "2",
                    "likes": "2",
                    "time": "10/12/2022-14:14:09",
                    "content": "Agree with you, we should have KPIs and metrics to see how much impact, users, revenue or whatever metrics useful to Optimism they reach with the grants It’s a great time to do this, we are on early stage of governance and OP technical development (Bedrock is coming) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.4
                },
                {
                    "author_link": "https://gov.optimism.io/u/NicoEsp",
                    "index": "3",
                    "likes": "0",
                    "time": "10/12/2022-14:16:12",
                    "content": "Delegate @SEED_LATAM_Joxes explains this in his conclusions of Season 2     DeFi LATAM - Delegate Communication Thread Delegate Updates       Season 2 has come to an end! and with this we write here our thoughts of community and participants for the DeFi LATAM delegation for this governance.  Introduction  First of all we want to clarify that this doesn’t represent isolated individual thoughts, but also a compilation of thoughts from members interested in the Optimism governance from our DeFi LATAM community delegation, as is described in our commitment as delegates.  Very important say that this includes the thoughts of our work team…     ",
                    "links": [
                        "https://twitter.com/DeFi_LATAM",
                        "https://gov.optimism.io/t/delegate-commitments/235/27"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.2749999999999995
                },
                {
                    "author_link": "https://gov.optimism.io/u/blackfaun",
                    "index": "4",
                    "likes": "1",
                    "time": "11/12/2022-13:15:30",
                    "content": "Agree that this would be very interesting to see. However, it’s probably important to keep in mind that changes in the metrics might be due to a number of reasons – it would be hard to prove or disprove any direct causations. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.733333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/teaser",
                    "index": "5",
                    "likes": "0",
                    "time": "11/12/2022-13:45:30",
                    "content": "At least we compare before and after grant. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.5
                }
            ]
        }
    ],
    "group_index": "375"
}