{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/gf-phase-0-proposal-celer-network/1749",
            "title": "[GF: Phase 0 Proposal] Celer Network ",
            "index": 1749,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Governance Fund: Phase 0"
            ],
            "tags": [
                "cycle-1",
                "passed"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/modong",
                    "index": "1",
                    "likes": "3",
                    "time": "28/05/2022-00:57:57",
                    "content": "Project Name: Celer Network Author Name: Mo Defillama TVL (at snapshot): $30.6M Transactons/day (at snapshot): 99 Tier: 2 Optimism native: No Revisions to metrics used: N/A Number of OP tokens to claim: 1,000,000 L2 Recipient Address: 0xF5e9D550C3c50364D630eDB4753bE404Cd109121 Proposal for token distribution (under 1000 words):  Background Celer is a blockchain interoperability protocol enabling a one-click user experience accessing tokens, DeFi, GameFi, NFTs, governance, and more across multiple chains. cBridge, as an asset bridge built on top of Celer Network, has been supporting Optimism from day-1 on the following fronts  Fast and low-cost USDT/USDC/FRAX between Optimism and 10 different other blockchains Supporting the fast bridging needs for Optimism-based projects’ bridging needs for their governance token based on liquidity pool based bridging needs. This includes Lyra, Kromatika, Perpetual Protocol, Thales, Aelin and DForce tokens  Some statistics  cBridge has processed $8.1b cross-chain transactions across 20 chains for 166K users. cBridge has helped bridging $203M volume to and from Optimism to date cBridge has distributed 16.7M CELR in rewards to date for the liquidity providers that are helping facilitate fast transfer between Optimism and 10 other blockchains.  Celer Inter-chain Message (Celer IM) framework has launched on mainnet recently. Through Celer IM, developers can build inter-chain dApps, such as ChainHop, using the Celer Inter-chain Message SDK to make it easier to onboard Optimism’s ecosystem.  Goals We are committed to growing with the Optimism ecosystem with the following goals:  Incentivize and build deep liquidity on Optimism for bluechip tokens to further facilitate low-cost onboarding to Optimism from 10 or more other chains. Attract users to actively use dApp ecosystems in Optimism without worrying about onboarding costs. Expand true cross-chain app use cases such as cross-chain DeFi, GameFi and NFT marketplaces to enhance the   Token Plan  Distribution Based on the above goals, we propose the following programs for $OP token distribution. We also note that the amount of tokens contemplated here is subject to change depending on the traction we see in each of the programs.  650K: Liquidity mining program for Optimism based cBridge pools. 150K: User onboarding cost reduction. 200K: Builder grant for cross-chain dApps helping improve the UX and growth of Optimism.  Some detailed explanation below: Liquidity Mining cBridge on Optimism operates in a liquidity pool based model. Tokens bridged via Optimism’s gateway (the official bridge) is always treated as the canonical bridged token on Optimism. When a user bridges a token, say USDC, from chain X to Optimism, the user adds USDC liquidity in the Chain X side of the pool and removes liquidity from the Optimism side. The depth of the liquidity pool on the Optimism side determines bridge pricing and size of liquidity bridgeable via cBridge. Therefore, it is beneficial for the Optimism community to incentivize a deep liquidity pool on Optimism’s side with $OP token especially in the early stage of ecosystem growth. User Onboarding Cost Reduction Even though Optimism already provides a low cost and trust-free layer-2 rollup experience, our user feedback has shown that there are still some users who want to have a lower cost onboarding experience when bridging in from chains other than Ethereum. cBridge can facilitate that structure by covering a portion of the gas fee that the user needs to pay. For example, if a user bridges 10 USDC from Avalanche, instead of getting $9.5 with the $0.5 covering the gas costs on Optimism, she would now get $9.8 with $0.3 covered by cBridge through $OP token distribution to Celer’s validator networks. Note that this distribution is Sybil resistant because it will not cover the full gas costs of bridging in. Builder Grant Like any blockchain ecosystem, the builders of the ecosystem finally determine the fate of the chain. We put strong focus on incentivizing builders on Optimism. There are a few area of focus:  cBridge widget integration. cBridge functionality can be integrated with any dApp through a web widget. We will allocate a certain amount of $OP based on the total bridging volume of all the integrated dApps. Among the integrated dApps,the $OP tokens will be distributed proportionally to bridged volume from their integrated widget. Cross-chain dApps built with Celer that makes onboarding and using Optimism easier. Celer IM allows users from other chains to experience apps on Optimism with ease. This allows app builders to build applications native to Optimism and do not need to migrate their apps with multiple copies to other chains to accept users there. Instead, they can acquire users by providing a capability to allow users on other chains to directly interact with Optimism based dApps with one-click UX.  An example would be NFT marketplace on Optimism, where seller can only list on Optimism but buyers can come from Avalanche using $AVAX, Ethereum using $ETH, BSC using $BNB etc etc. Another example would be a cross-chain liquidity protocol, where users started from some other chain let’s say Avalanche and only have AVAX. They can have a one-click onboarding experience to swap some of their $AVAX to $ETH on Optimism and start to use apps here.     Duration Depending on the price of the $OP token, we expect liquidity mining and user onboarding portion to last anywhere from 6 months to a year. Developer grants will be based on developer adoption and have long-lasting benefits for the Optimism ecosystem.  Co-Incentives We have been contributing to the Optimism community with significant liquidity mining rewards (>$1.5M worth at distribution value) and expect to continue similar effort long term to maintain functional liquidity in the Optimism ecosystem based on Celer Network DAO’s governance process. ",
                    "links": [
                        "https://chainhop.exchange/",
                        "https://gov.optimism.io/t/voting-cycle-1-roundup/2619",
                        "https://gov.optimism.io/t/op-grants-through-season-2-where-has-the-op-gone/4025/5"
                    ],
                    "GPT-summary": "The post is a proposal for token distribution for the Celer Network, a blockchain interoperability protocol. The proposal outlines the goals of the network and proposes programs for $OP token distribution to incentivize and build deep liquidity on Optimism for bluechip tokens, attract users to actively use dApp ecosystems in Optimism, and expand true cross-chain app use cases. The proposal includes a liquidity mining program, user onboarding cost reduction, and builder grant for cross-chain dApps. The post is primarily an explanation of the proposal, but also extends to the Optimism community for collaboration and advertising. There is no entirely positive or negative feedback given.",
                    "GPT-proposal-categories": [
                        "Interoperability and Scaleability",
                        "Token economics",
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.286531279178338
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "2",
                    "likes": "2",
                    "time": "28/05/2022-01:17:40",
                    "content": "It is so nice seeing a proposal where Builders are taken care of. Good job Celer! I approve this 100% ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.6875
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "3",
                    "likes": "3",
                    "time": "28/05/2022-09:10:30",
                    "content": "    modong:  200K: Builder grant for cross-chain dApps helping improve the UX and growth of Optimism.   Thank you for including builders, one question though, who will approve the builder grant? A multisig wallet or DAO or just core team ? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/modong",
                    "index": "4",
                    "likes": "0",
                    "time": "01/06/2022-03:05:09",
                    "content": "It will be through Celer Network’s community governance process! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lionkim",
                    "index": "5",
                    "likes": "1",
                    "time": "10/06/2022-04:46:55",
                    "content": "Am a fan of Celer. I approve of this too. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "6",
                    "likes": "0",
                    "time": "13/09/2022-18:28:59",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "7",
                    "likes": "0",
                    "time": "05/01/2023-14:58:24",
                    "content": "Hi @modong! It’s been several months since your OP grant was distributed, checking in to see if you have a grant update you can share with the community? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "17"
}