{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/proposal-to-have-a-youtube-channel-for-optimism-to-provide-info-in-visual-form-for-betterment-of-governance/2338",
            "title": "Proposal to have a youtube channel for optimism to provide info in visual form for betterment of governance ",
            "index": 2338,
            "category": [],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/mteoptimism",
                    "index": "1",
                    "likes": "4",
                    "time": "02/06/2022-05:42:12",
                    "content": "Proposal for YouTube Channel Creation Dear Team Optimism, in this age of digitalization, we need a channel on YouTube to explain our governance for each & everyone. As i believe average user interact with YouTube at least once a day. If we have our proposal made in audio/video form on our channel, it will compel user to join our governance & vote. Also, we will post info related to project. So, i propose to create the channel & put step wise guideline for ease of the community. As i believe videos help you retain information longer. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.3125
                },
                {
                    "author_link": "https://gov.optimism.io/u/NicoEsp",
                    "index": "2",
                    "likes": "3",
                    "time": "02/06/2022-13:40:24",
                    "content": "I agree with this topic, I think it will be good to explain governance to new users. But, should this come from the OP Team? Or maybe we can propose a Core Unit (Like MakerGrowth for MakerDAO) for Marketing purposes, and the YouTube Channel will be one of their responsabilities. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.090909090909091
                },
                {
                    "author_link": "https://gov.optimism.io/u/SnIpErPj",
                    "index": "3",
                    "likes": "3",
                    "time": "03/06/2022-00:40:43",
                    "content": "This initiative will be very important for people who want to study how the optimism network works. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.6
                },
                {
                    "author_link": "https://gov.optimism.io/u/vonnie610",
                    "index": "4",
                    "likes": "4",
                    "time": "08/06/2022-05:43:45",
                    "content": "There is already an Optimism YouTube channel! We are trying to post more, but it takes a lot of time to make a high quality video that will stay relevant for a while. TLDR; We are working on posting more, but the channel exists! You can find it here: https://www.youtube.com/channel/UCy9EVw1XTHqPU3NNisoAVXw ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.106250000000001
                },
                {
                    "author_link": "https://gov.optimism.io/u/fig",
                    "index": "5",
                    "likes": "1",
                    "time": "08/06/2022-18:02:46",
                    "content": "YouTube can be a great place to learn more about any topic - both in and outside the Web3 world. It is great for visual and audio learners, allowing folks to multitask. Creating a pipeline to onboard new users and educate existing ones seems beneficial, however, there is a great technical barrier to entry. Knowledge of EVMs and traditional infrastructure (wallets, NFTs, exchanges) is required before transacting on Optimism; it’s difficult to go from “zero to hero.” Monitoring expenditures across different DAOs and protocols, marketing is usually ignored. I encourage the development of marketing resources and content production - especially with the use of Web2 tools - but to do so in a cost-conscious matter. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.879370629370629
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "6",
                    "likes": "0",
                    "time": "13/09/2022-16:44:18",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "42"
}