{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/draft-gf-phase-1-proposal-ens-wildcard-domains/5044",
            "title": "[DRAFT][GF: Phase 1 Proposal] ENS Wildcard Domains ",
            "index": 5044,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Grants Council"
            ],
            "tags": [
                "cycle-10",
                "passed"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/stevegachau.eth",
                    "index": "1",
                    "likes": "1",
                    "time": "02/02/2023-04:43:52",
                    "content": "Project name: ENS Wildcard Domains Author name and contact info (please provide a reliable point of contact for the project): Steve Gachau, Twitter @stevegachau I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: Yes I understand that I will be expected to following the public grant reporting requirements outlined here: Yes L2 recipient address: 0x1D7b8D3c6c896d7eB4f9118Ea377C359073d4083 Which Voting Cycle are you applying for?: 10 Which sub-committee should review your proposal? (Builders Grants, Growth Experiment Grants): Builders Grants Project description (please explain how your project works): We are building tools that enable NFT communities on Optimism acquire ENS sub-domains at zero cost. This is accomplished via utilizing an ENS feature called wildcard resolution. Our suite of tools allows anyone with an ENS name to link it to a collection and provide the NFT holders with free subdomains that are immediately compatible with popular wallets e.g Metamask & Trust wallet. Developers will also be able to utilize our open-source tools to build collection-specific ENS integrations. ENSIP 10 - ENSIP-10: Wildcard Resolution - ENS Documentation Website: https://wildcards.wtf Twitter: https://twitter.com/wildcardswtf Discord/Discourse/Community: Other relevant links (including any demos): Additional team member info (please link): Steve G (project lead) - https://twitter.com/stevegachauhellenstans.eth (dev) - https://twitter.com/hellenstans NB: We will be launching bounties to incentivize web3 & ENS contributors/devs that build on top of our tools. Please link to any previous projects the team has meaningfully contributed to: @ensredirect - https://twitter.com/ensredirectECC Name Service on Optimism - https://opensea.io/collection/ecc-name-service@mintbot - https://twitter.com/mintbot_io@ensregistry - https://twitter.com/ensregistryOur team also just received a grant by ApeCoin DAO via Meebits DAO to create ENS wildcard domains for Meebits NFT holders - Prop House Relevant usage metrics (TVL, transactions, volume, unique addresses, etc. Optimism metrics preferred; please link to public sources such as Dune Analytics, etc.): ECC Name service which uses our Optimism resolver has been used by over 3,641 users who have created over 18,000 names on Optimism - ECC Domains (ECC) Token Tracker | Optimism Competitors, peers, or similar projects (please link): Punk Domains - https://punk.domainsESF tools - https://esf.tools/ Is/will this project be open sourced?: Yes Optimism native?: Yes Date of deployment/expected deployment on Optimism: 4/13/2023 What is the problem statement this proposal hopes to solve for the Optimism ecosystem?: NFT projects & communities on Optimism have expressed a desire to use ENS names and subdomains to identify and connect with their users and holders. However, the cost of setting a distinct record on the ENS Registry for each subdomain can be prohibitively expensive for communities with large user bases. This creates unnecessary friction for NFT holders, who often stand to benefit greatly from the usability improvements offered by ENS names. How does your proposal offer a value proposition solving the above problem?: ENS Wildcard subdomains offer a solution to this problem by allowing every NFT holder in a specified collection (e.g OptiChads) to receive an ENS name at no cost & without registration. The process for the ENS domain holder is simple: just link their domain name to the NFT collection they want to support. From there, digit subdomains (such as 69.optichads.eth) will automatically point to and resolve to the current owner of the NFT in the chosen collection (for example, Chad #69) Why will this solution be a source of growth for the Optimism ecosystem?: The possibility of acquiring free ENS domains will drive users to explore Optimism and Optimism NFTs.Communities on Optimism will be able to unite under a single namespace with built-in utility, helping to create a more cohesive and connected ecosystem. Has your project previously applied for an OP grant?: No Number of OP tokens requested: 45,000 OP Did the project apply for or receive OP tokens through the Foundation Partner Fund?: No If OP tokens were requested from the Foundation Partner Fund, what was the amount?: N/A How much will your project match in co-incentives? (not required but recommended, when applicable): N/A How will the OP tokens be distributed? (please include % allocated to different initiatives such as user rewards/marketing/liquidity mining. Please also include a justification as to why each of these initiatives align with the problem statement this proposal is solving.): Since builder grants tokens will be locked for 1 year, we will use funding from our team treasury as follows: 50% - Developer and infrastructure costs to build (and maintain) a general purpose frontend, Optimism wildcard resolver contract & an Optimism gateway server.30% - Integration bounties for other community devs to build collection-specific tools. (funded by the team) 10% - Integrations with existing web3 and NFT tools. 10% - Bug bounty program for our smart contracts (funded by the team) Over what period of time will the tokens be distributed for each initiative? Shorter timelines are preferable to longer timelines. Shorter timelines (on the order of weeks) allow teams to quickly demonstrate achievement of milestones, better facilitating additional grants via subsequent proposals: Funds will be allocated over a period of 1 yr. Please clearly define the milestones you expect to achieve in order to receive milestone based installments. Please consider how each milestone relates to incentivizing sustainable usage and liquidity on Optimism. Progress towards each milestone must be trackable: Project Goals:  To increase the number of ENS domains linked to NFT collections on Optimism. Unite communities under a single namespace with built-in utility, helping to create a more cohesive and connected ecosystem for NFT communities. Make it practically free for Optimism community members to obtain an ENS domain, reducing the barriers to entry for those who want to use ENS. Onboard thousands of users to Optimism NFTs incentivized by the added ENS utility.  Trackable Milestones:      Milestone Type Milestone Deadline     1 Benchmark Create waitlist form on wildcards.wtf     2 Critical Deploy Optimism gateway server: The gateway server implements CCIP Read (EIP 3668) and answers name query requests by looking up the current owner of an NFT in an Optimism collection April 6   3 Benchmark Deploy ENS Wildcard Resolver contract on Goerli Testnet. The resolver contract provides a resolver stub that implements CCIP Read (EIP 3668) and ENS wildcard resolution (ENSIP 10). When queried for a name, it directs the client to query the gateway server. When called back with the gateway server response, the resolver verifies the signature was produced by an authorised signer and returns the resolved address to the client April 6   4 Critical Deploy Collection-Registry contract on Optimism April 13   5 Benchmark Get 10 NFT projects on Optimism to commit to beta testing our platform April 14   6 Benchmark Run tests with our alpha test group, collect feedback and iterate April 30   7 Critical Deploy ENS Wildcard Resolver contract (3 above) on Eth Mainnet & continue tests in anticipation for public launch May 14   8 Critical  (Public launch) Create a General purpose frontend to link ENS domains to Optimism NFT  collections. (Can be used for any NFT collection on Optimism) May 31   9 Critical Open-Source our contracts and L2 gateway & release documentation for community devs to build integrations for stand-alone NFT collections (instead of using our general-purpose front-end & contracts) June 10   10 Benchmark Ongoing support for devs building on top of our platform. This will include integration bounties & bug bounties - - -   11 Benchmark Onboard over 50 NFT communities. (A potential 500,000 wildcard ENS subdomains assuming each collection has 10k items) - - -    Why will incentivized users and liquidity on Optimism remain after incentives dry up?: Not relevant for builder grants Please provide any additional information that will facilitate accountability (smart contracts addresses relevant to the proposal, relevant organizational wallet addresses, etc.): 19000 subdomains already claimed on Optimism - ECC Domains (ECC) Token Tracker | Optimism Confirm you have read and agree to the Eligibility Restrictions (here): I have read the Eligibility Restrictions and agree to abide by their conditions ",
                    "links": [
                        "https://gov.optimism.io/t/suggested-public-reporting-requirements-for-grantees/4176",
                        "https://docs.ens.domains/ens-improvement-proposals/ensip-10-wildcard-resolution",
                        "https://wildcards.wtf",
                        "https://twitter.com/wildcardswtf",
                        "https://twitter.com/stevegachau",
                        "https://twitter.com/hellenstans",
                        "https://twitter.com/ensredirect",
                        "https://opensea.io/collection/ecc-name-service",
                        "https://twitter.com/mintbot_io",
                        "https://twitter.com/ensregistry",
                        "https://prop.house/meebits/round-2",
                        "https://optimistic.etherscan.io/token/0x9fb848300e736075ed568147259bf8a8eefe4fef#balances",
                        "https://punk.domains",
                        "https://esf.tools/",
                        "https://wildcards.wtf",
                        "https://optimistic.etherscan.io/token/0x9fb848300e736075ed568147259bf8a8eefe4fef",
                        "https://gov.optimism.io/t/grant-proposal-template/3233",
                        "https://gov.optimism.io/t/cycle-10-grant-review-roundup/5284",
                        "https://gov.optimism.io/t/cycle-10-final-grants-roundup/5418"
                    ],
                    "GPT-summary": "The post is a draft proposal for the ENS Wildcard Domains project, which aims to enable NFT communities on Optimism to acquire ENS sub-domains at zero cost. The proposal explains how the project works, the problem it aims to solve, and the value proposition it offers. The author also provides relevant links, usage metrics, and milestones for the project. A 3rd party could give constructive criticism, ask questions, or advertise the proposal.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Smart contract updates",
                        "Interoperability and Scaleability",
                        "Community and engagement",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal",
                        "None"
                    ],
                    "Sentiment": 5.602213541666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/stevegachau.eth",
                    "index": "2",
                    "likes": "2",
                    "time": "09/02/2023-13:46:16",
                    "content": "Refined our goals and milestones as suggested: Project Goals:  To increase the number of ENS domains linked to NFT collections on Optimism. Unite communities under a single namespace with built-in utility, helping to create a more cohesive and connected ecosystem for NFT communities. Make it practically free for Optimism community members to obtain an ENS domain, reducing the barriers to entry for those who want to use ENS. Onboard thousands of users to Optimism NFTs incentivized by the added ENS utility.  Trackable Milestones:   Optimism gateway server: The gateway server implements CCIP Read (EIP 3668) and answers name query requests by looking up the current owner of an NFT in an Optimism collection.   Deploy Collection-Registry contract on Optimism.   Deploy ENS Wildcard Resolver contract on Goerli Testnet. The resolver contract provides a resolver stub that implements CCIP Read (EIP 3668) and ENS wildcard resolution (ENSIP 10). When queried for a name, it directs the client to query the gateway server. When called back with the gateway server response, the resolver verifies the signature was produced by an authorised signer and returns the resolved address to the client.   Contract audits. (bug bounty funded by the team)   Deploy ENS Wildcard Resolver contract (3 above) on Eth Mainnet.   Frontend to link ENS domains to Optimism NFT collections.   Documentation for community devs to build integrations for stand-alone NFT collections (instead of using our general-purpose front-end & contracts), the team will provide bounties for this.   Onboard over 50 NFT communities. (A potential 500,000 wildcard ENS subdomains assuming each collection has 10k items)   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party advertising proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.591836734693878
                },
                {
                    "author_link": "https://gov.optimism.io/u/FractalVisions",
                    "index": "3",
                    "likes": "0",
                    "time": "09/02/2023-15:09:17",
                    "content": "What happens to the use case of these domains when ENS is fully integrated with Optimism network? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/FractalVisions",
                    "index": "4",
                    "likes": "0",
                    "time": "09/02/2023-15:34:25",
                    "content": "    stevegachau.eth:  Onboard over 50 NFT communities. (A potential 500,000 wildcard ENS subdomains assuming each collection has 10k items)   I am confused by this metric assuming that every NFT holder from a community would register an ENS. What is the incentive to have one of these names on Optimism ? Can these ENS addresses be used to send money transfers on Optimism ? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/stevegachau.eth",
                    "index": "5",
                    "likes": "0",
                    "time": "09/02/2023-15:39:40",
                    "content": "ENS is currently working on 2 features that are L2-related:  Trust minimized resolver ENS L2 Canonical registry  When those finally ship, we will see whether either will be a better option for our implementation. At the  moment we are using CCIP Read (EIP-3668) & (ENSIP-10) ",
                    "links": [
                        "https://docs.ens.domains/ens-improvement-proposals/ensip-10-wildcard-resolution"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/FractalVisions",
                    "index": "6",
                    "likes": "0",
                    "time": "09/02/2023-15:42:15",
                    "content": "    stevegachau.eth:  How does your proposal offer a value proposition solving the above problem?: ENS Wildcard subdomains offer a solution to this problem by allowing every NFT holder in a specified collection (e.g OptiChads) to receive an ENS name at no cost & without registration. The process for the ENS domain holder is simple: just link their domain name to the NFT collection they want to support. From there, digit subdomains (such as 69.optichads.eth) will automatically point to and resolve to the current owner of the NFT in the chosen collection (for example, Chad #69)   Let’s assume I am a collector and have 20 different collections. Now I am expected to register a new ENS for each individual NFT in the collection that I own. The domain points to the NFT but what happens when the NFT is sold after the ENS is registered? The new user is left with no option to register a new ENS for that NFT? Wouldn’t it be easier to have a single domain that points to your entire collection for instance ? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.299165120593692
                },
                {
                    "author_link": "https://gov.optimism.io/u/stevegachau.eth",
                    "index": "7",
                    "likes": "0",
                    "time": "09/02/2023-15:43:51",
                    "content": "With wildcards, NFT holders don’t need to register or claim anything. For example, if the owner of optichads.eth decides to link it to the Optichads NFT collection via our platform/ENS resolver, 999.optichads.eth would always resolve to the owner of Chad #999. There is no registration process for the individual NFT owner. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/FractalVisions",
                    "index": "8",
                    "likes": "0",
                    "time": "09/02/2023-15:45:05",
                    "content": "Is number 2 canonical the same as canon update? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/stevegachau.eth",
                    "index": "9",
                    "likes": "0",
                    "time": "09/02/2023-15:45:40",
                    "content": "Wildcard domains don’t exist as individual NFTs, If you sell your NFT, the ENS points to the new owner since its tied to the tokenID ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.340909090909091
                },
                {
                    "author_link": "https://gov.optimism.io/u/FractalVisions",
                    "index": "10",
                    "likes": "0",
                    "time": "09/02/2023-15:54:46",
                    "content": "I’m still confused on how this has any value if there is no function to send funds on chain. I don’t understand the redirect method and certainly don’t want to add extra confusion or a pre fix to my .eth address. I found it being preventative with ENS Redirect as well where I myself or peers that I introduced the application to were hesitant or choose not to use the service because it requires you to modify the ENS upon url entry causing too much complexity, confusion, extra unnecessary user actions, and security risks by spoofing ens addresses to redirect to phishing websites. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.678571428571429
                },
                {
                    "author_link": "https://gov.optimism.io/u/stevegachau.eth",
                    "index": "11",
                    "likes": "0",
                    "time": "09/02/2023-15:55:40",
                    "content": "I don’t think so. These future upgrades were presented by ENS at Devcon, I couldn’t find much info about them online.  twitter.com    GaryPalmerJr.eth.limo 👁 2223.eth 🌱🐇 @garypalmerjr  #CCIP-read 🔛 #EIP3668 Secure Off-chain Data Retrieval; Three Request Model: 1️⃣ Revert,  2️⃣ Request, &  3️⃣ Verify!#Web3 #ENS $ENS twitter.com/i/web/status/1… https://t.co/I397b2wZVS   3:32 AM - 13 Oct 2022           10                2            ",
                    "links": [
                        "https://twitter.com/garypalmerjr/status/1580401137135808512",
                        "https://twitter.com/garypalmerjr/status/1580401137135808512",
                        "https://twitter.com/search?q=%23CCIP",
                        "https://twitter.com/search?q=%23EIP3668",
                        "https://twitter.com/search?q=%23Web3",
                        "https://twitter.com/search?q=%23ENS",
                        "https://twitter.com/i/web/status/1580401137135808512",
                        "https://t.co/I397b2wZVS",
                        "https://twitter.com/garypalmerjr/status/1580401137135808512"
                    ],
                    "GPT-discussion-categories": [],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/FractalVisions",
                    "index": "12",
                    "likes": "0",
                    "time": "09/02/2023-15:59:40",
                    "content": "My point here being if I can’t understand the usage easily in a few minutes of reading and it’s not setup with the same function that a regular ENS address has people will loose interest right away. Taking the time to explain how this works to people along with the differences between a regular ENS and extra added complexity may be the biggest hurdle to getting people onboard with a product like this. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.006279434850863
                },
                {
                    "author_link": "https://gov.optimism.io/u/stevegachau.eth",
                    "index": "13",
                    "likes": "1",
                    "time": "09/02/2023-16:04:53",
                    "content": " You can use them to send funds onchain. They are compatible with Metamask, Coinbase Wallet, Trust wallet and others. We are not doing redirects, just automatic digit subdomains, created from the tokenID. These are real ENS subdomains We are onboarding NFT projects, giving their collections additional utility. Individual NFT holders don’t have to do anything to get a subdomain assigned to their address.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/FractalVisions",
                    "index": "14",
                    "likes": "1",
                    "time": "09/02/2023-16:06:08",
                    "content": "I have a ton of collections on optimism now probably 30-40 !! Hook it up. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/FractalVisions",
                    "index": "15",
                    "likes": "0",
                    "time": "09/02/2023-16:07:08",
                    "content": "Transfer of funds with these ENS on optimism is currently available? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/FractalVisions",
                    "index": "16",
                    "likes": "0",
                    "time": "09/02/2023-16:09:58",
                    "content": "So if individual NFT holders do not receive anything you are only onboarding one individual at a time that being the creator of the collection. What incentivizes the holders to use this service.? Thanks for explaining. I am still trying to wrap my head around how this would be used for our projects and can’t think of anything. Like I said adding complex domains into the mix increases the risk for phishing attacks so I would much rather use a single ens or domain everyone knows is safe. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.330357142857142
                },
                {
                    "author_link": "https://gov.optimism.io/u/stevegachau.eth",
                    "index": "17",
                    "likes": "2",
                    "time": "09/02/2023-16:19:34",
                    "content": "Even though an individual holder doesn’t receive an NFT in their wallet, they do receive an ENS subdomain (just that it’s not a token that they can transfer or trade) They can use this subdomain to signal that they are part of a particular community on social media. They can use it to receive funds and it’s also completely free on their part. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/stevegachau.eth",
                    "index": "18",
                    "likes": "3",
                    "time": "23/02/2023-16:20:04",
                    "content": "Hi @Gonna.eth @jackanorak @kaereste @danelund.eth, I updated our milestones according to the new Milestone Assessment. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.681818181818182
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "19",
                    "likes": "1",
                    "time": "26/02/2023-13:24:58",
                    "content": "Wondering about the possible use case.   OptiPunks want to do a push Airdrop. Instead of looking for every owner onchain, they just subscribe to ENS wildcards and use all #.optipunks.eth ?   Optipunks decide to make an owner-only event. Is it possible for me to access the event it by owning 989.optipunks.eth without doxing my main address? Is this even possible? I think this is an account abstraction debate more than a possible feature of Wildcard lol.   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.0476190476190474
                },
                {
                    "author_link": "https://gov.optimism.io/u/stevegachau.eth",
                    "index": "20",
                    "likes": "2",
                    "time": "28/02/2023-06:05:10",
                    "content": "@Gonna.eth The first usecase is possible. A dapp that uses wildcards to do bulk transfers to all holders in a collection sounds like an idea worth exploring. Unfortunately account abstraction isn’t a feature that is possible with wildcards. The domain will always point to the addr currently holding the token. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.041666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "21",
                    "likes": "2",
                    "time": "05/03/2023-19:35:11",
                    "content": "Hi @stevegachau.eth! Can you provide a Telegram handle or other contact method so the Optimism team can get in touch about paying out this grant! Feel free to DM or email lavande@optimism.io ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.609375
                }
            ]
        }
    ],
    "group_index": "510"
}