{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/ready-gf-phase-1-proposal-dragonia/3107",
            "title": "[READY] [GF: Phase 1 Proposal] Dragonia ",
            "index": 3107,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Governance Fund: Phase 1"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/crowly",
                    "index": "1",
                    "likes": "6",
                    "time": "25/07/2022-16:44:25",
                    "content": "Project Name: Dragonia Author Name: Crowly - Co-Founder of Dragonia Number of OP tokens requested: 20,000 OP L2 Recipient Address: 0x0D330bb216bc6bc45F479DC50221850434bA8AcC (multisig) Relevant Usage Metrics:   Dragonia launch date: June 16, 2022   ~100 unique Dragonia Trainer (NFT) holders   Website   Discord    Optimism alignment:  Dragonia is one of, if not the first, original game on Optimism. Through fun and engaging gameplay, users are able to enjoy matches and directly mint rewards from the blockchain without large gas fees by playing. Dragonia cosmetic rewards and Trainer NFTs are purchasable and verified collections on Quixotic.  image1272×714 127 KB  The user interface (shown above) when playing a game of Defend Dragonia (card game), which consists of three different elements through a rock-paper-scissors-style mechanic. Dragonia Trainer holders also receive a portion of fees from secondary sales. We are currently working on a story-driven visual novel, more airdrops and additional gamemodes to Defend Dragonia.  Proposal for token distribution:  How will the OP tokens be distributed?  80% - Player rewards and incentives; players that earn XP through winning games can gradually unlock rewards in the  current season pass. Token distribution will gradually be added to these reward pools  to incentivize playing. 20% - Marketing and community growth to drive more attention/traction, as well as expenses (such as server hosting costs).  How will this distribution incentivize usage and liquidity on Optimism? GOAL: Showcase P2E gaming and the benefits of building on Optimism The token distribution will be used to grow the player base and incentivize playing matches. To help sustain this project’s development and incentivize user interaction/engagement, this funding proposal would help us to continue expanding the Dragonia ecosystem (more games, more action!) and community. Why will the incentivized users and liquidity remain after incentives dry up? Dragonia has many different rewards such as NFTs, cosmetic skins and other planned partnerships (e.g. WL spots for other projects that can be earned through playing). Over what period of time will the tokens be distributed? There is no set period for token distribution as of right now. Considering that there are approximately 3-4 seasons yearly (each with unique lore and updates), token distribution allocated for rewards should last multiple seasons but ultimately depends on the number of players. How much will your project match in co-incentives? Dragonia does not have a token. However, players can earn NFTs via our season rewards (earned through winning matches) and other airdrops. We will also create some special in-game art + NFTs for this event. ",
                    "links": [
                        "https://t.co/ESBFbqhqW9",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/b/bdb74100c16257e1b93adb82222db7bec03c4cc9.jpeg"
                    ],
                    "GPT-summary": "The post is a proposal for funding for the Dragonia project, a game on the Optimism blockchain. The author explains the project, including its launch date, unique features, and token distribution plan. The post also includes a proposal for how the OP tokens will be distributed and how this will incentivize usage and liquidity on Optimism. The post invites feedback and questions from third parties and advertises the project.",
                    "GPT-proposal-categories": [
                        "Token economics",
                        "Community and engagement",
                        "Grants, Funding and resource allocation"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal",
                        "None"
                    ],
                    "Sentiment": 5.507116977225673
                },
                {
                    "author_link": "https://gov.optimism.io/u/mastermojo",
                    "index": "2",
                    "likes": "2",
                    "time": "25/07/2022-17:09:05",
                    "content": "I am in favor of supporting a NFT Game on OP like this (first game/NFT submittal?). I would like to see Quixotic make a proposal sometime soon too! Your proposal “incentivizes participants in the Optimism ecosystem” which is a key. My suggestion is to propose 50,000 OP over 6-12 months (2 - 4seasons). Curious to see what the community thinks about this. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.208333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/NicoEsp",
                    "index": "3",
                    "likes": "2",
                    "time": "25/07/2022-17:14:05",
                    "content": "    crowly:  Website   Hey @crowly the link to the website it’s not working. Could you check it? Also, could you share any other relevant metric? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6875
                },
                {
                    "author_link": "https://gov.optimism.io/u/SH1N",
                    "index": "4",
                    "likes": "0",
                    "time": "25/07/2022-17:16:53",
                    "content": "Link to website not working ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/crowly",
                    "index": "5",
                    "likes": "1",
                    "time": "25/07/2022-17:38:57",
                    "content": "How about now? Just fixed.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/crowly",
                    "index": "6",
                    "likes": "1",
                    "time": "25/07/2022-17:39:38",
                    "content": "Fixed the upper link as well. Thank you!   dragonia.gg   Dragonia Dragonia is home to 6000 randomly generated Dragon Trainer NFTs on the Optimism Blockchain! Play Defend Dragonia - the NFT Card Game!      ",
                    "links": [
                        "https://www.dragonia.gg/"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party advertising proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 3.71875
                },
                {
                    "author_link": "https://gov.optimism.io/u/SEED_LATAM_Joxes",
                    "index": "7",
                    "likes": "5",
                    "time": "25/07/2022-18:02:30",
                    "content": "Hi @crowly, this proposal is being discussed right now in our community (DeFi LATAM) by members that genuinely caught their attention (Rorry, Nico, Axl), so I’m passing here some toughts and questions expressed there:  The question about alignment with Optimism is not satisfactory for what you are building (these are my suggestions, why Optimism, shared values, ethos or pillars of the game [since it’s building on blockchain] and type of community you build). Documentation currently isn’t very clear at the moment. Please be more specific about distribution, by example how is this winning and unlock system. P2E is an exhausting narrative, so providing details on how Dragonia will be sustainable in the mid term (and without OP rewards for sure) would be appreciated; all this based on the experience of the P2E boom last year.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.65989010989011
                },
                {
                    "author_link": "https://gov.optimism.io/u/crowly",
                    "index": "8",
                    "likes": "2",
                    "time": "25/07/2022-20:31:43",
                    "content": "Hi! Awesome to see that there’s interest.   Dragonia is only on Optimism and encourages users to mint and stay on Optimism as well. We also align with the spirit of public goods, and to be honest, the name ‘Optimism’ itself sealed the deal. We love it when the community is able to critique and provide suggestions, since that’ll ultimately just make the entire Dragonia project better.   Which part of the docs is unclear? We can add more detail to it or explain further where necessary.   After a player wins one game, they earn XP, which can be accrued to unlock rewards and it is documented on-chain. We plan to distribute OP rewards as season milestones (reached by winning matches and earning said XP).   We don’t have a token, which many P2E projects seem to have and sustain themselves on (causing inevitable decreases in price due to expenses/team payments). We have already started rewarding players with NFTs (mainly cosmetics) they can directly mint, however we plan to start issuing out other rewards such as WL spots with projects we partner with, so there’ll be inherent value to that.   I completely understand what you mean with P2E being an exhausting narrative. We wanted to prioritize actual gameplay, as opposed to just gamifying DeFi interactions like a gamified DEX, for instance. We built an actual game that we plan to keep rolling out updates for, as we add new stuff (like our upcoming visual novel) to our ecosystem. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.667827468230694
                },
                {
                    "author_link": "https://gov.optimism.io/u/jrocki.eth",
                    "index": "9",
                    "likes": "1",
                    "time": "25/07/2022-20:45:17",
                    "content": "I think it would be helpful to add more specifics to how the 20% will be spent that goes to “Marketing and community growth to drive more attention/traction”. Maybe also put the server cost % allocation estimate on a separate line. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/crowly",
                    "index": "10",
                    "likes": "1",
                    "time": "26/07/2022-13:26:01",
                    "content": "Our ideas for token distribution regarding marketing and community growth include:  Paid partnerships (some cross-community AMAs for instance require a small fee, especially with bigger communities) Giveaways (mainly to existing Trainer holders) Promotions (whether this is in the form of ads and/or paid promotion) Sponsorships (potential idea is to reward smaller content creators that create content for Dragonia, which align with our values and also lead to a mutually beneficial relationship)  If you have any suggestions, happy to hear them as well! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.654761904761905
                },
                {
                    "author_link": "https://gov.optimism.io/u/Netrim",
                    "index": "11",
                    "likes": "3",
                    "time": "26/07/2022-15:51:53",
                    "content": "Proposal should NOT include:  20% - Marketing and community growth to drive more attention/traction, as well as expenses (such as server hosting costs). Marketing nor development should be in scope for this kind of proposal.  I would like to see a detailed plan on how this 80% distribution would work. KPIs and Milestones at a bear minimum ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://gov.optimism.io/u/crowly",
                    "index": "12",
                    "likes": "0",
                    "time": "26/07/2022-19:26:59",
                    "content": "About to sign off for tonight! Will post a more detailed breakdown for the 80% tomorrow.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/crowly",
                    "index": "13",
                    "likes": "1",
                    "time": "27/07/2022-16:19:48",
                    "content": "Let me just quickly break down the current system we have in place for seasons. We launched Dragonia with Season 1: Inception. Rewards in the season pass are unlocked at 70 XP milestones. Reward 1: 70 XP Reward 2: 140 XP (And so on…) Whenever a player wins a match, they earn 10 XP. This can be claimed (per Trainer) once a day, meaning that it’ll take a week to unlock a reward. However, if you have more Trainers,  you can then earn more XP a day (2 Trainers = 20 XP, 3 Trainers = 30 XP, etc.). With 9 unlockable Season 1 rewards, Season 1 lasts a total of 9 weeks. Each season should last at minimum 2 months, with approximately 1 month transition periods in between each season. The 80% distribution for user rewards should last at least 4 seasons (~1 year). Assuming the distribution is planned at 16,000 OP, there are different methods we can implement: The first method is scattering these OP token rewards amongst other season rewards. We believe setting X amount of OP per season is the right approach. Assuming that each season has 4,000 OP tokens assigned for it (4,000 x 4 = 16,000). This is an ideal way to handle the rewards otherwise allowing players to earn X amount of. 4,000 for now is just a number I used for easy reference. For example, each Trainer at a 0.02 ETH mint price is equivalent to ~40 OP tokens as of right now. Let’s assume there are 100 players actively progressing through the season pass: this would net a return of 40 OP tokens if every single one fully completed the season rewards. We need to play around with these figures to find a good balance for OP rewards before each season (take a snapshot of # of players). The second is creating an extra difficult AI opponent to beat (giving users only 1 chance per Trainer to beat in a given day) to earn X amount of OP. Going this method would mean that once the OP prize pool for the season has depleted, players would no longer be able to earn OP token rewards from defeating said opponent, so it may not be super sustainable in practice. An alternative approach would be to have ‘spontaneous limited-time boss battles’ with OP token rewards, which would also encourage players to keep close tabs and hence boost community engagement. The last method is making it so when players win a match, they earn a ‘ticket’. This ticket can then enter the player into a pot, which at the end of, say a week, will randomly select a winner who earns X amount of OP tokens. This means you would earn 10 XP + a ticket every time a day (per Trainer when you win). Not sure how this would work in practice because it seems quite ‘lottery’-ish. Happy to hear anyone’s thoughts on this! We’re open to all kinds of ideas. As @mastermojo stated, a larger token distribution could be beneficial and we can also draft up more plans for that. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.746527777777778
                },
                {
                    "author_link": "https://gov.optimism.io/u/Bobbay_StableLab",
                    "index": "14",
                    "likes": "1",
                    "time": "28/07/2022-09:17:38",
                    "content": "    crowly:  20% - Marketing and community growth to drive more attention/traction, as well as expenses (such as server hosting costs).   This is an incorrect use of the $OP tokens from this fund. I can see your comment from a couple of days ago, but it would be better to give specifics for the token distribution for both (player rewards and marketing) 1.How many daily users do you have? 2. Distribution is very vague, you should present a more detailed plan for OP distribution. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.972222222222222
                },
                {
                    "author_link": "https://gov.optimism.io/u/crowly",
                    "index": "15",
                    "likes": "1",
                    "time": "28/07/2022-18:17:02",
                    "content": "Completely understand what you mean regarding the 20%. We currently have 492 Trainers minted in total. We were actually discussing this internally and have a new idea we’d like to propose for the remaining token distribution: We bump user rewards to 90%, and the remaining 10% goes towards expenses including:  Dedicated RPC node for leaderboards, multiplayer and other features Server hosting costs (to keep the game actively running)  We project that this 10% could fund the nodes and servers for 1.5 - 2 years approximately. For token distribution, I presented some ideas in a reply above. If we added these OP token rewards to the season rewards, we can allocate 4,000 OP tokens per season (giving us enough for 4 whole seasons of gameplay). To encourage users to keep playing throughout the entire season and winning XP whilst unlocking different rewards, setting the OP token reward at the end of the season would make sense. If 100 Trainers are used to complete the season rewards, then that means each Trainer will receive a 40 OP (4000 / 100) airdrop for doing so. We would definitely prefer this ‘fixed amount of tokens per season’ approach over ‘first come, first serve’, as it would unfairly favor those that own multiple Trainers who can grind out the rewards quicker. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.003376152832675
                }
            ]
        }
    ],
    "group_index": "176"
}