{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/revolte-an-interactive-novel-to-onboard-web2-users-to-web3-builders-program/5563",
            "title": "Revolte - An interactive novel to onboard Web2 users to Web3 (Builders program) ",
            "index": 5563,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Grants Council"
            ],
            "tags": [
                "builders",
                "cycle-11"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/Claw",
                    "index": "1",
                    "likes": "1",
                    "time": "09/03/2023-16:14:54",
                    "content": " Basic Details Project name: Revolte Author name and contact info (please provide a reliable point of contact for the project.): Antoine Wisdorff - Irruption Lab Co-founder Twitter / Linkedin L2 recipient address: 0x94b9420F65fB3ec966d96BB034b35AF86487D929 Which Voting Cycle are you applying for?: Cycle 11 I confirm that I have read the landing pages for the Builders  and Growth Experiments  Sub-Committees and that I have determined my proposal is best suited to be reviewed by the Builders Sub-Committee: Yes  Enter the adventure1446×652 143 KB  Project Details What are you building?: Join the Web3 revolution with Revolte! Our adventure game introduces users to the world of blockchain, wallets, tokens, and more, with mandatory tasks like wallet installation to guide players through the story. Explore real Web3 applications on Optimism and experience the potential of this transformative technology. Why do you believe what you are building is going to succeed?: We need more projects that educate people about Web3, and we believe that Revolte can achieve this goal through an engaging and interactive adventure game format. How many users does your project have currently? Please include how you arrived at this estimate: The first chapter of Revolte was released on March 1st, 2023, so it is currently too early to estimate the number of users. How will receiving a grant enable you to further the mission of maximizing the number of users interacting with Optimism? Please include a step-by-step flow of how you imagine this grant can lead to a greater number of user interactions with Optimism:  With the funding from Optimism’s grants, we plan to expand our team and professionalize our platform’s UX/UI. It will allow us to create new adventures more frequently and secure partnerships with blockchain protocols to make our platform economically sustainable. We also plan to bring on a scenario writer and a game level designer to enrich the game mechanics. By building custom-made adventures for existing protocols, we aim to turn our users into users of our partner protocols, as there will be mandatory tasks to perform on the protocol before continuing the adventure.  Tell us about the users you plan to target with this grant. Include any defining characteristics that will help you identify and target them: Our first goal is to educate Web2 users who might be interested in exploring Web3, and our second goal is to encourage Web3 users to explore new protocols through our adventure game. How would these users interact with Optimism? For how long?:  The length of user interactions with Optimism will depend on the protocols we will partner with (sponsored adventures). If users discover a protocol they like through our game, they will likely come back regularly even after they complete the adventure. On our platform, we are implementing long-term deposit and lock. At the beginning of Chapter 3, players must deposit a minimum of stablecoins to continue the adventure. This amount will be locked during one month with the release of each new episode. If the users/players want to enter the next episode, they would have to relock their deposit for one month. Users will be entitled to receive interests paid in OP. On our hand the stablecoins locked on the platform will be used to generate revenues.  Provide us with links to any of the following for the project:  Demo: https://www.revolte.app/  Demo Video: Revolte - An interactive novel to onboard Web2 users to Web3 - YouTube  Website: https://www.revolte.app/ and https://www.irruptionlab.com/  Twitter: https://twitter.com/IrruptionLab  Discord/Discourse/Community: Github: GitHub - pgrandne/revolte: Web3 adventure game for onboarding  Technical/Economic Documentation: Pitch Deck  Linkedin: https://www.linkedin.com/company/irruption-lab/   Do you have any metrics on the project currently? (TVL, transactions, volume, unique addresses, etc. Optimism metrics preferred; please link to public sources such as Dune Analytics, etc.): Release date of the first chapter was on March 1st, 2023. It’s a bit early for the metrics. Who are your competitors, and are they on Optimism?: Crew3, L3, Guild can be considered as competitors but they aren’t really on the same segment. We want to onboard through a captivating game. Ethereumhacker was an inspiration for us but it’s not a competitor. Same for Cryptozombies. Please link to code audits (if any): N/A Team Who are your founders?: Perrin Grandne, Developper, co-founder of Irruption Lab Linkedin / Twitter Antoine Wisdorff, PM/Designer, co-founder of Irruption Lab Linkedin / Twitter What makes your team well-suited to carry out the project described in this proposal? We need creativity and developping skills. On this aspect we are well-suited, and the first chapter of the adventure already released. But we plan to expand our team and professionalize our platform’s UX/UI. It will allow us to create new adventures more frequently and secure partnerships with blockchain protocols to make our platform economically sustainable. We also plan to bring on a scenario writer and a game level designer to enrich the game mechanics. Is this your first Web3 project?: With Irruption Lab, we’ve already built several projects (https://www.irruptionlab.com/):  InterPool: A Sport Prediction Game with no losers, where the winners share the interests generated by the deposits of all the participants. (HackaTRON S3 winner)  No Pool No Game: An MVP that leads us to InterPool. A memory game where the winners share the interests generated by the deposits of all the participants. (ETHOnline 2022 winner)  PlzNFTme: send a picture and you’ll receive a personalize NFT drawn by real caricaturists  Perrin Grandne: Daseslab. Federated catalog of data and services linked to education and skills for accelerating innovation in education, certification and skills development through blockchain-based data sharing and services : For French Ministry of National Education If not, what else have you built? (Share links, Github repository, or any other useful information.): pgrandne (Perrin) · GitHub AntoineWisd · GitHub Grant Request What is the size of the grant request? (50k OP max): We are seeking 150k OP from this grant program (2 separate proposals have been created on the forum for the Builders and Growth Experiment grants):  50k OP as part of the Builders grant > retroactive funding 100k OP as part of the Growth Experiments grant > Usage incentives, user education  How do you justify the size of the grant?:  The project’s scalability is limited as it relies on the creation of new adventures to attract and retain users. Additionally, the project must continually showcase new protocols to keep existing users engaged and entice them to return for more.  The retroactive builder grant will provide funding for the work already completed and open up new possibilities for the next chapters of the adventure, ultimately enhancing the user experience. This includes the onboarding of Scenarist/Game level designers, illustrators, UI/UX designers, as well as improving visibility through marketing, partnerships, and community management. It is totally compatible with a 1 year locking period of the OP. As of now we are self funded.  Successful onboarding is still widely connected with incentives. After the first Chapter where new users discover how to install their wallet, the second Chapter will explore web3 possibilities on the testnet (currently under development). The last Chapter will be on the mainnet. New episodes will be created for each protocol we will showcase.  The Growth Experiments grant will be used for usage incentives. To continue the adventure on the mainnet, users will need to deposit stablecoins on the platform. Additionally, users will be eligible to receive interests paid in OP. On our hand the stablecoins locked on the platform will be used to generate revenues. Roadmap and Distribution Plan  Revolte - Road map21508×567 49.2 KB  Describe in discrete steps how you will successfully implement your grant plan:  Builder Grant:   Revolte - Chapter 2 (Tesnet / Protocols exploration) - Mar-Apr 2023 Revolte - Chapter 3 (Mainnet / Sponsored stories) - from May 2023 and forward   Growth Experiments grant The grant will be used for usage incentives. To continue the adventure on the mainnet, players must deposit a minimum of stablecoins to continue the adventure. This amount will be locked during one month with the release of each new episode. If the users/players want to enter the next episode, they would have to relock their deposit for one month. Users will be eligible to receive interests paid in OP. On our hand the stablecoins locked on the platform will be used to generate revenues.   Step 0: Announcement & Communication on social media / Grants & Hackathons participations to improve visibility Step 1: Launching of incentive program Step 2: Evaluate users’ eligibility and distribute OP accordingly  Does your plan depend on the receipt of OP tokens?: No. Receiving OP tokens through the Builders program will provide us with greater opportunities to enlist skilled builders onto our team and enhance the development of our adventure game with increased speed and quality. However, even if the team remains unchanged, we will continue to work on advancing Revolte. What is your plan for the use of the OP token after the 1 year lock-up?: The OP tokens obtained through the Builders program will serve as an incentive for our builders. Following the one-year lock-up period, each builder will receive a share of the OP tokens, which they can utilize at their own discretion. How will the OP tokens be distributed? (please include % allocated to different initiatives such as user rewards/marketing/liquidity mining. Please also include a justification as to why each of these initiatives align with the problem statement this proposal is solving. Distribution should not include the sale of any tokens by the grantee or the use of tokens for compensation, protocol expenses, etc. See the no sale rule here ):  Builder Grant (50k OP):  50k OP - 100% compensate the builders as described in the “How do you justify the size of the grant?” section  Growth Experiments grant (100k OP)  Those incentive will be distributed to the depositors on our platform (our users), that will also be the users of the protocols we will be promoting. By incentiving the users we participate in educating users to Web3, and facilitate mass adoption. The distribution detailed below, will be based on the following user eligibility: a) Stablecoins locked on the protocol. At the beginning of Chapter 3, players must deposit a minimum of stablecoins to continue the adventure. This amount will be locked during one month with the release of each new episode. If the users/players want to enter the next episode, they would have to relock their deposit for one month. b) Participate in the adventure and perform all the mandatory steps included in each new episodes. Example of mandatory transactions to be performed by users, and that will be part of the story itself:  Deposit a minimum amount on Aave V3 Swaping a minimum amount on Velodrome Yield farming a minimum amount on Beefy Cross chain transfer of a minimum amount using Stargate  The first episodes of Chapter 3 will focus on the main protocols already existing in the ecosystem, as an introduction. Then, we will put some light on the protocols a bit less known, or even new promising ones (Nested, …). The objective is to introduce the ecosystem to new users while also encouraging existing users to discover new possibilities and remain up-to-date. Distribution plan:  May 2023: 20K OP (20%) June 2023: 20K OP (20%) July 2023: 15k OP (15%) August: 15k OP (15%) September: 15k OP (15%) October 2023: 15k OP (15%)  Over what period of time will the tokens be distributed for each initiative?: Token will be distributed on a monthly basis, based on the schedule described above. Please provide benchmark milestones for this project. These milestones should guide the Optimism community on the progress of your project throughout your work on the project. Do not use distribution of the grant itself as a milestone:  Q2 2023: Expand team and improve UX/UI in order to achieve Mobile compatibility (essential for facilitating user onboarding) June 2023: Reach 400 users on the platform November 2023: Reach 2,000 users on the platform November 2023: Measurable growth in the number of users from our platform who have actively engaged with the showcased protocols. 50% of users completing the mandatory tasks on Optimism and providing positive feedback on the gameplay and educational content. Q4 2023: Have partnerships with at least 3 blockchain protocols – (Equivalent to 3 sponsored stories/episodes within chapter 3. Retro-active sponsoring after release of an episode is considered)  Please define critical milestones for this project. Critical milestones are meant to show good-faith efforts to accomplish the project. Non-completion of these milestones could lead to revocation of remaining grant rewards. Do not use distribution of the grant itself as a milestone:  February 2023: Release the first chapter of the game on the testnet – COMPLETED March-April 2023: Release the second chapter of the game on the testnet – (1st EPISODE (out of 4) RELEASED) March 2023: Include feedback survey to track user needs, and enhance their experience. Also used to track their understanding of the technology. March-April 2023: Multilangual mode. Application available in English, French and Spanish. May 2023: Smart contract deployment to generate revenue through long-term deposits and lock. (associated with user OP incentive of the Growth Experiments grants) May 2023: Release the first episodes of the 3rd chapter on the mainnet. One episode per month will be released as a minimum until December 2023. First episodes will showcase the main protocols in each category (Aave – Lending, Velodrome – Dex , Beefy – Yield aggregator, Stargate – Crosschain). Then, we will put some light on the protocols a bit less known, or even new promising ones (Nested, …). The aim is to indroduce new users to the ecosystem, but also to attract people who knows already the ecosystem and make them discover new possibilities, and stay up-to-date.  If the OP tokens are for direct distribution to users, why will incentivized users and liquidity on Optimism remain after incentives dry up?: Our target is to educate. We will build partnerships with protocols and it might be able to generate incentives for the users. We don’t want to become a typical Play to Earn game, where users play only for the incentives. We are building a captivating game, where users stay simply because they like the adventure we are building and also because they will discover at the same time new protocols. Please provide any additional information that will facilitate accountability (smart contracts addresses relevant to the proposal, relevant organizational wallet addresses, etc.): Optimism Relationship Does your project solve a problem for the Optimism ecosystem? If so how?: It participates to solve one of the main problem of Web3 ecosystem: Onboarding/Mass adoption. This is not specific to Optimism, this apply to the whole ecosystem. We’re taking a unique approach to tackle it. Our captivating adventure game is designed to appeal to new users, providing them with an immersive experience that showcases the real-world use cases of this technology. Rather than delving into the technicalities that can be daunting to most, we’re offering an enjoyable way to explore the ecosystem and discover its potential. Why will this solution be a source of growth for the Optimism ecosystem?: That will be a source of growth for the whole Web3 ecosystem, including Optimism. It’s an agnostic solution. Is your project Optimism Native?: As of now, we have built our story using Optimism, but in the end our solution is agnostic. Confirmations I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: Yes I understand that I will be expected to following the public grant reporting requirements outlined here: Yes  ",
                    "links": [
                        "https://www.linkedin.com/company/irruption-lab/",
                        "https://foul-porch-0eb.notion.site/Builders-Sub-Committee-02ba9da5b4534fbf955e6e4c8fcf1aa3",
                        "https://foul-porch-0eb.notion.site/Growth-Experiments-Sub-Committee-270d2f75ff0f410a869b2ba6a8324006",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/f/f69bafb1bf65913c0f8d0ff547ca420bbc035f15.jpeg",
                        "https://www.revolte.app/",
                        "https://www.youtube.com/watch?v=D83JsWduODM",
                        "https://www.revolte.app/",
                        "https://www.irruptionlab.com/",
                        "https://twitter.com/IrruptionLab",
                        "https://github.com/pgrandne/revolte",
                        "https://www.canva.com/design/DAFaoOaGU3A/Jj8ILlofzMJ5_gv8nlivKg/view?utm_content=DAFaoOaGU3A&utm_campaign=designshare&utm_medium=link2&utm_source=sharebutton",
                        "https://www.linkedin.com/company/irruption-lab/",
                        "https://www.linkedin.com/in/grandne/",
                        "https://twitter.com/pgguidel",
                        "https://www.linkedin.com/in/antoine-wisdorff-32154a77/",
                        "https://twitter.com/AntoineWisd",
                        "https://www.irruptionlab.com/",
                        "https://github.com/pgrandne",
                        "https://github.com/AntoineWisd",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/1/16f0329be1611644eeff1d7677857c5bebf506de.png",
                        "http://calendar.google.com/calendar/u/0/r?tab=mc",
                        "https://gov.optimism.io/t/suggested-public-reporting-requirements-for-grantees/4176"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Community and engagement",
                        "Grants, Funding and resource allocation",
                        "Smart contract updates",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.503593462425798
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "2",
                    "likes": "2",
                    "time": "10/03/2023-03:38:51",
                    "content": "Hey @Claw, giving you a heads up that this will be the formal comms channel with the grant council builders subcommittee, which consists of @Gonna.eth @kaereste @danelund.eth, and myself. We’ll make sure we’re around to address any questions you have in this process. One thing to be mindful of is that this post lacks defined benchmark milestones, which are necessary for this proposal to be considered. More detailed critical milestones will be helpful as well. More information can be found here: Milestone Assessment. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.583333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/Claw",
                    "index": "3",
                    "likes": "1",
                    "time": "10/03/2023-11:12:01",
                    "content": "Thanks a lot @jackanorak for your message, your feedback is really appreciated. Benchmark and Critical milestones sections have been updated accordingly. I hope the details given are clear and sufficient. Cheers ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://gov.optimism.io/u/Claw",
                    "index": "4",
                    "likes": "1",
                    "time": "15/03/2023-08:51:12",
                    "content": "We’ve added a presentation video for those who are interested:      ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                }
            ]
        },
        {
            "thread_link": "https://gov.optimism.io/t/revolte-an-interactive-novel-to-onboard-web2-users-to-web3-growth-experiments/5376",
            "title": "Revolte - An interactive novel to onboard Web2 users to Web3 (Growth Experiments) ",
            "index": 5376,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Grants Council"
            ],
            "tags": [
                "growth",
                "cycle-11"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/Claw",
                    "index": "1",
                    "likes": "5",
                    "time": "01/03/2023-16:56:49",
                    "content": " Basic Details Project name: Revolte Author name and contact info (please provide a reliable point of contact for the project.): Antoine Wisdorff - Irruption Lab Co-founder Twitter / Linkedin L2 recipient address: 0x94b9420F65fB3ec966d96BB034b35AF86487D929 Which Voting Cycle are you applying for?: Cycle 11 I confirm that I have read the landing pages for the Builders  and Growth Experiments  Sub-Committees and that I have determined my proposal is best suited to be reviewed by the Growth Experiments Sub-Committee: Yes I understand that Growth Experiments grants are subject to a “no sale rule,” as explained in this post , and I have read the terms of the rule: Yes  Enter the adventure1446×652 143 KB  Project Details What are you building?: Join the Web3 revolution with Revolte! Our adventure game introduces users to the world of blockchain, wallets, tokens, and more, with mandatory tasks like wallet installation to guide players through the story. Explore real Web3 applications on Optimism and experience the potential of this transformative technology. Why do you believe what you are building is going to succeed?: We need more projects that educate people about Web3, and we believe that Revolte can achieve this goal through an engaging and interactive adventure game format. How many users does your project have currently? Please include how you arrived at this estimate: The first chapter of Revolte was released on March 1st, 2023, so it is currently too early to estimate the number of users. How will receiving a grant enable you to further the mission of maximizing the number of users interacting with Optimism? Please include a step-by-step flow of how you imagine this grant can lead to a greater number of user interactions with Optimism:  With the funding from Optimism’s grants, we plan to expand our team and professionalize our platform’s UX/UI. It will allow us to create new adventures more frequently and secure partnerships with blockchain protocols to make our platform economically sustainable. We also plan to bring on a scenario writer and a game level designer to enrich the game mechanics. By building custom-made adventures for existing protocols, we aim to turn our users into users of our partner protocols, as there will be mandatory tasks to perform on the protocol before continuing the adventure.  Tell us about the users you plan to target with this grant. Include any defining characteristics that will help you identify and target them: Our first goal is to educate Web2 users who might be interested in exploring Web3, and our second goal is to encourage Web3 users to explore new protocols through our adventure game. How would these users interact with Optimism? For how long?:  The length of user interactions with Optimism will depend on the protocols we will partner with (sponsored adventures). If users discover a protocol they like through our game, they will likely come back regularly even after they complete the adventure. On our platform, we are implementing long-term deposit and lock. At the beginning of Chapter 3, players must deposit a minimum of stablecoins to continue the adventure. This amount will be locked during one month with the release of each new episode. If the users/players want to enter the next episode, they would have to relock their deposit for one month. Users will be entitled to receive interests paid in OP. On our hand the stablecoins locked on the platform will be used to generate revenues.  Provide us with links to any of the following for the project:  Demo: https://www.revolte.app/  Demo Video: Revolte - An interactive novel to onboard Web2 users to Web3 - YouTube  Website: https://www.revolte.app/ and https://www.irruptionlab.com/  Twitter: https://twitter.com/IrruptionLab  Discord/Discourse/Community: Github: GitHub - pgrandne/revolte: Web3 adventure game for onboarding  Technical/Economic Documentation: Pitch Deck  Linkedin: https://www.linkedin.com/company/irruption-lab/   Do you have any metrics on the project currently? (TVL, transactions, volume, unique addresses, etc. Optimism metrics preferred; please link to public sources such as Dune Analytics, etc.): Release date of the first chapter was on March 1st, 2023. It’s a bit early for the metrics. Who are your competitors, and are they on Optimism?: Crew3, L3, Guild can be considered as competitors but they aren’t really on the same segment. We want to onboard through a captivating game. Ethereumhacker was an inspiration for us but it’s not a competitor. Same for Cryptozombies. Please link to code audits (if any): N/A Team Who are your founders?: Perrin Grandne, Developper, co-founder of Irruption Lab Linkedin / Twitter Antoine Wisdorff, PM/Designer, co-founder of Irruption Lab Linkedin / Twitter What makes your team well-suited to carry out the project described in this proposal? We need creativity and developping skills. On this aspect we are well-suited, and the first chapter of the adventure already released. But we plan to expand our team and professionalize our platform’s UX/UI. It will allow us to create new adventures more frequently and secure partnerships with blockchain protocols to make our platform economically sustainable. We also plan to bring on a scenario writer and a game level designer to enrich the game mechanics. Is this your first Web3 project?: With Irruption Lab, we’ve already built several projects (https://www.irruptionlab.com/):  InterPool: A Sport Prediction Game with no losers, where the winners share the interests generated by the deposits of all the participants. (HackaTRON S3 winner)  No Pool No Game: An MVP that leads us to InterPool. A memory game where the winners share the interests generated by the deposits of all the participants. (ETHOnline 2022 winner)  PlzNFTme: send a picture and you’ll receive a personalize NFT drawn by real caricaturists  Perrin Grandne: Daseslab. Federated catalog of data and services linked to education and skills for accelerating innovation in education, certification and skills development through blockchain-based data sharing and services : For French Ministry of National Education If not, what else have you built? (Share links, Github repository, or any other useful information.): pgrandne (Perrin) · GitHub AntoineWisd · GitHub Grant Request What is the size of the grant request? (250k OP max): We are seeking 150k OP from this grant program (2 separate proposals have been created on the forum for the Builders and Growth Experiment grants):  50k OP as part of the Builders grant > retroactive funding 100k OP as part of the Growth Experiments grant > Usage incentives, user education  How do you justify the size of the grant?:  The project’s scalability is limited as it relies on the creation of new adventures to attract and retain users. Additionally, the project must continually showcase new protocols to keep existing users engaged and entice them to return for more.  The retroactive builder grant will provide funding for the work already completed and open up new possibilities for the next chapters of the adventure, ultimately enhancing the user experience. This includes the onboarding of Scenarist/Game level designers, illustrators, UI/UX designers, as well as improving visibility through marketing, partnerships, and community management. It is totally compatible with a 1 year locking period of the OP. As of now we are self funded.  Successful onboarding is still widely connected with incentives. After the first Chapter where new users discover how to install their wallet, the second Chapter will explore web3 possibilities on the testnet (currently under development). The last Chapter will be on the mainnet. New episodes will be created for each protocol we will showcase.  The Growth Experiments grant will be used for usage incentives. To continue the adventure on the mainnet, users will need to deposit stablecoins on the platform. Additionally, users will be eligible to receive interests paid in OP. On our hand the stablecoins locked on the platform will be used to generate revenues. Roadmap and Distribution Plan  Revolte - Road map21508×567 49.2 KB  Describe in discrete steps how you will successfully implement your grant plan:  Builder Grant:   Revolte - Chapter 2 (Tesnet / Protocols exploration) - Mar-Apr 2023 Revolte - Chapter 3 (Mainnet / Sponsored stories) - from May 2023 and forward   Growth Experiments grant The grant will be used for usage incentives. To continue the adventure on the mainnet, players must deposit a minimum of stablecoins to continue the adventure. This amount will be locked during one month with the release of each new episode. If the users/players want to enter the next episode, they would have to relock their deposit for one month. Users will be eligible to receive interests paid in OP. On our hand the stablecoins locked on the platform will be used to generate revenues.   Step 0: Announcement & Communication on social media / Grants & Hackathons participations to improve visibility Step 1: Launching of incentive program Step 2: Evaluate users’ eligibility and distribute OP accordingly  How will the OP tokens be distributed? (please include % allocated to different initiatives such as user rewards/marketing/liquidity mining. Please also include a justification as to why each of these initiatives align with the problem statement this proposal is solving. Distribution should not include the sale of any tokens by the grantee or the use of tokens for compensation, protocol expenses, etc. See the no sale rule here ):  Builder Grant (50k OP):  50k OP - 100% compensate the builders as described in the “How do you justify the size of the grant?” section  Growth Experiments grant (100k OP)  Those incentive will be distributed to the depositors on our platform (our users), that will also be the users of the protocols we will be promoting. By incentiving the users we participate in educating users to Web3, and facilitate mass adoption. The distribution detailed below, will be based on the following user eligibility: a) Stablecoins locked on the protocol. At the beginning of Chapter 3, players must deposit a minimum of stablecoins to continue the adventure. This amount will be locked during one month with the release of each new episode. If the users/players want to enter the next episode, they would have to relock their deposit for one month. b) Participate in the adventure and perform all the mandatory steps included in each new episodes. Example of mandatory transactions to be performed by users, and that will be part of the story itself:  Deposit a minimum amount on Aave V3 Swaping a minimum amount on Velodrome Yield farming a minimum amount on Beefy Cross chain transfer of a minimum amount using Stargate  The first episodes of Chapter 3 will focus on the main protocols already existing in the ecosystem, as an introduction. Then, we will put some light on the protocols a bit less known, or even new promising ones (Nested, …). The objective is to introduce the ecosystem to new users while also encouraging existing users to discover new possibilities and remain up-to-date. Distribution plan:  May 2023: 20K OP (20%) June 2023: 20K OP (20%) July 2023: 15k OP (15%) August: 15k OP (15%) September: 15k OP (15%) October 2023: 15k OP (15%)  Over what period of time will the tokens be distributed for each initiative?: Token will be distributed on a monthly basis, based on the schedule described above. Please provide benchmark milestones for this project. These milestones should guide the Optimism community on the progress of your project throughout your work on the project. Do not use distribution of the grant itself as a milestone:  Q2 2023: Expand team and improve UX/UI in order to achieve Mobile compatibility (essential for facilitating user onboarding) June 2023: Reach 400 users on the platform November 2023: Reach 2,000 users on the platform November 2023: Measurable growth in the number of users from our platform who have actively engaged with the showcased protocols. 50% of users completing the mandatory tasks on Optimism and providing positive feedback on the gameplay and educational content. Q4 2023: Have partnerships with at least 3 blockchain protocols – (Equivalent to 3 sponsored stories/episodes within chapter 3. Retro-active sponsoring after release of an episode is considered)  Please define critical milestones for this project. Critical milestones are meant to show good-faith efforts to accomplish the project. Non-completion of these milestones could lead to revocation of remaining grant rewards. Do not use distribution of the grant itself as a milestone:  February 2023: Release the first chapter of the game on the testnet – COMPLETED March-April 2023: Release the second chapter of the game on the testnet – (1st EPISODE (out of 4) RELEASED) March 2023: Include feedback survey to track user needs, and enhance their experience. Also used to track their understanding of the technology. March-April 2023: Multilangual mode. Application available in English, French and Spanish. May 2023: Smart contract deployment to generate revenue through long-term deposits and lock. (associated with user OP incentive of the Growth Experiments grants) May 2023: Release the first episodes of the 3rd chapter on the mainnet. One episode per month will be released as a minimum until December 2023. First episodes will showcase the main protocols in each category (Aave – Lending, Velodrome – Dex , Beefy – Yield aggregator, Stargate – Crosschain). Then, we will put some light on the protocols a bit less known, or even new promising ones (Nested, …). The aim is to indroduce new users to the ecosystem, but also to attract people who knows already the ecosystem and make them discover new possibilities, and stay up-to-date.  If the OP tokens are for direct distribution to users, why will incentivized users and liquidity on Optimism remain after incentives dry up?: Our target is to educate. We will build partnerships with protocols and it might be able to generate incentives for the users. We don’t want to become a typical Play to Earn game, where users play only for the incentives. We are building a captivating game, where users stay simply because they like the adventure we are building and also because they will discover at the same time new protocols. Please provide any additional information that will facilitate accountability (smart contracts addresses relevant to the proposal, relevant organizational wallet addresses, etc.): Optimism Relationship Does your project solve a problem for the Optimism ecosystem? If so how?: It participates to solve one of the main problem of Web3 ecosystem: Onboarding/Mass adoption. This is not specific to Optimism, this apply to the whole ecosystem. We’re taking a unique approach to tackle it. Our captivating adventure game is designed to appeal to new users, providing them with an immersive experience that showcases the real-world use cases of this technology. Rather than delving into the technicalities that can be daunting to most, we’re offering an enjoyable way to explore the ecosystem and discover its potential. Why will this solution be a source of growth for the Optimism ecosystem?: That will be a source of growth for the whole Web3 ecosystem, including Optimism. It’s an agnostic solution. Is your project Optimism Native?: As of now, we have built our story using Optimism, but in the end our solution is agnostic. Confirmations I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: Yes I understand that I will be expected to following the public grant reporting requirements outlined here: Yes  ",
                    "links": [
                        "https://www.linkedin.com/company/irruption-lab/",
                        "https://foul-porch-0eb.notion.site/Builders-Sub-Committee-02ba9da5b4534fbf955e6e4c8fcf1aa3",
                        "https://foul-porch-0eb.notion.site/Growth-Experiments-Sub-Committee-270d2f75ff0f410a869b2ba6a8324006",
                        "https://gov.optimism.io/t/grant-proposal-template/3233",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/f/f69bafb1bf65913c0f8d0ff547ca420bbc035f15.jpeg",
                        "https://www.revolte.app/",
                        "https://www.youtube.com/watch?v=D83JsWduODM",
                        "https://www.revolte.app/",
                        "https://www.irruptionlab.com/",
                        "https://twitter.com/IrruptionLab",
                        "https://github.com/pgrandne/revolte",
                        "https://www.canva.com/design/DAFaoOaGU3A/Jj8ILlofzMJ5_gv8nlivKg/view?utm_content=DAFaoOaGU3A&utm_campaign=designshare&utm_medium=link2&utm_source=sharebutton",
                        "https://www.linkedin.com/company/irruption-lab/",
                        "https://www.linkedin.com/in/grandne/",
                        "https://twitter.com/pgguidel",
                        "https://www.linkedin.com/in/antoine-wisdorff-32154a77/",
                        "https://twitter.com/AntoineWisd",
                        "https://www.irruptionlab.com/",
                        "https://github.com/pgrandne",
                        "https://github.com/AntoineWisd",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/1/16f0329be1611644eeff1d7677857c5bebf506de.png",
                        "http://calendar.google.com/calendar/u/0/r?tab=mc",
                        "https://gov.optimism.io/t/suggested-public-reporting-requirements-for-grantees/4176"
                    ],
                    "GPT-summary": "The post is a proposal for a project called Revolte, which is an adventure game designed to educate users about Web3 and blockchain technology. The author provides details about the project, including its goals, target audience, and plans for expansion. The post also includes links to a demo, website, and social media accounts. A 3rd party could provide constructive criticism or ask questions about the proposal, while the author is explaining and advertising the proposal.",
                    "GPT-proposal-categories": [
                        "Community and engagement",
                        "Grants, Funding and resource allocation",
                        "Privacy, Security and risk management",
                        "Not a proposal",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal",
                        "None"
                    ],
                    "Sentiment": 5.472751175205163
                },
                {
                    "author_link": "https://gov.optimism.io/u/FractalVisions",
                    "index": "2",
                    "likes": "1",
                    "time": "01/03/2023-17:10:51",
                    "content": "Was this proposal accidentally submitted? I see the last questions have not been answered. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Claw",
                    "index": "3",
                    "likes": "1",
                    "time": "01/03/2023-17:27:28",
                    "content": "Hello @FractalVisions thanks for your feedback. I’ve submitted it intentionnally as a draft, and will finalize it tomorrow.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Claw",
                    "index": "4",
                    "likes": "1",
                    "time": "03/03/2023-09:46:40",
                    "content": "It has been finalized. I hope it is sufficiently clear. If you have any additional feedback or question let me know  I’m not sure it was supposed to be done this way, but we wanted to submit a grant request partially related to the Builders, and also to the Growth Experiments programs as detailed in this post. I hope it’s ok to merge everything into a single post. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.565476190476191
                },
                {
                    "author_link": "https://gov.optimism.io/u/Mark_De.Fi",
                    "index": "5",
                    "likes": "3",
                    "time": "03/03/2023-17:16:00",
                    "content": "Great post and unusual as I think the direction for the project, in general it looks interesting But two things came up for me:  Definitely need to work out some issues with the fonts. Some scenes make it hard to read. It’s hard to find clear information about the status of the project at the moment.  But all in all, I’m sure it will be an interesting experience for lovers of this genre. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.033333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/Claw",
                    "index": "6",
                    "likes": "2",
                    "time": "04/03/2023-10:16:06",
                    "content": "Thanks a lot @Mark_De.Fi for your feedback it’s really appreciated! We try to bring a different approach. With this adventure game we’re trying to help people get into web3 without scaring them off with all the complicated technical stuff. Regarding your first point, by any chance, do you have any specific scenes or eventually screenshot that you could share with me in DM? As for the status of the project, we have completed the first Chapter, on March 1st, which leads to the installation of the wallet for the new comers. The purpose of this chapter is to introduce the story and make the world we’ve created feel more real and interesting. We are currently working on the second Chapter, which is for the users to experiment (on the testnet) the basics of web3, like swaps, using bridges, nft…This chapter (split in several episodes) will be developed from March to April 2023. The last Chapter (on the mainnet), will be dedicated to showcase existing protocols and integrate them in our story. Users will have to interact with those protocols, as if it was part of the story, to continue the adventure. This chapter will start from May 2023, and has no end date. The number of episodes is not limited (one protocol per episode). Hope this clarify, let me know if you have additional questions. Thanks! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.443019480519481
                },
                {
                    "author_link": "https://gov.optimism.io/u/Mark_De.Fi",
                    "index": "7",
                    "likes": "2",
                    "time": "04/03/2023-15:34:16",
                    "content": "Sure, I’ll send what I noticed to you in the DM Also thank you for the information you provided regarding the development and further stages that are planned in Revolte ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/Claw",
                    "index": "8",
                    "likes": "2",
                    "time": "05/03/2023-09:28:17",
                    "content": "Your feedback and screenshots are very much appreciated! Thanks a lot for taking the time to share them with me. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.125
                },
                {
                    "author_link": "https://gov.optimism.io/u/Claw",
                    "index": "9",
                    "likes": "2",
                    "time": "15/03/2023-08:50:05",
                    "content": "We’ve added a presentation video of the project for those who are interested:      ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/MattL",
                    "index": "10",
                    "likes": "2",
                    "time": "16/03/2023-07:21:31",
                    "content": "Hello and thank you for your proposal! Throughout the application process, this forum thread will be one of the official means of communication. Please be sure to monitor it for updates over the course of the review period. At this stage, applications are mainly being reviewed for completeness, and nothing at this stage should be construed as support or opposition by any members of the Grants Council.     Claw:   Growth Experiments grant (100k OP) Those incentive will be distributed to the depositors on our platform (our users), that will also be the users of the protocols we will be promoting. By incentiving the users we participate in educating users to Web3, and facilitate mass adoption.   May 2023: 20K OP (20%) - user eligibility: stablecoins locked on the protocol, did participate to the adventure and perform all the required mandatory steps included in each new episodes. June 2023: 20K OP (20%) - same as previous July 2023: 15k OP (15%) - same as previous August: 15k OP (15%) - same as previous September: 15k OP (15%) - same as previous October 2023: 15k OP (15%) - same as previous  Over what period of time will the tokens be distributed fo   Please provide more detail on how eligibility for this distribution will be determined, as it is very unclear based on the current language.     Claw:  Please provide benchmark milestones for this project. These milestones should guide the Optimism community on the progress of your project throughout your work on the project. Do not use distribution of the grant itself as a milestone:  February 2023: Release the first chapter of the game on the testnet – COMPLETED March-April 2023: Release the second chapter of the game on the testnet – (1st EPISODE (out of 4) RELEASED) May 2023: Release the first episodes of the 3rd chapter on the mainnet. One episode per month will be released as a minimum until December 2023. June 2023: Reach 400 users on the platform November 2023: Reach 2,000 users on the platform Q4 2023: Have partnerships with at least 3 blockchain protocols – (Equivalent to 3 sponsored stories/episodes within chapter 3)  Please define critical milestones for this project. Critical milestones are meant to show good-faith efforts to accomplish the project. Non-completion of these milestones could lead to revocation of remaining grant rewards. Do not use distribution of the grant itself as a milestone:  Q2 2023: Expand team and improve UX/UI in order to achieve Mobile compatibility (this is essential for facilitating user onboarding) March-April 2023: Multilangual mode. Application available in English, French and Spanish. May 2023: Smart contract deployment to generate revenue through long-term deposits and lock. (associated with user OP incentive of the Growth Experiments grants) Q3 2023: Successful release of the third chapter of the game on the mainnet, with at least 50% of users completing the mandatory tasks on Optimism and providing positive feedback on the gameplay and educational content. Q4 2023 : Successful integration of Revolte with at least 3 blockchain protocols on Optimism, with measurable evolution in user acquisition and engagement metrics.    Critical milestones must be met to unlock future portions of a grant. We recommend you revise these,  to ensure that they are seperated from benchmark milestones. Regarding the protocols, are there any particular projects you’d like to work with on Optimism to onboard people to and explain how the protocol works? I haven’t seen any information like that in this proposal. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.2176097711812
                },
                {
                    "author_link": "https://gov.optimism.io/u/Claw",
                    "index": "11",
                    "likes": "1",
                    "time": "16/03/2023-13:18:22",
                    "content": "Many thanks, @MattL, for your valuable feedback! Based on your comments, we have revised and clarified the proposal to enhance its comprehensibility and highlight our vision for the Revolte project. Feel free to reach out if you require further input. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.4375
                },
                {
                    "author_link": "https://gov.optimism.io/u/Mark_De.Fi",
                    "index": "12",
                    "likes": "2",
                    "time": "16/03/2023-15:14:03",
                    "content": "Oh great, thank you so much for this video I think it will be useful for anyone who does not want to spend their attention on a detailed study of the proposal, but is still interested in the project Keep up the solid work guys ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.625
                },
                {
                    "author_link": "https://gov.optimism.io/u/MattL",
                    "index": "13",
                    "likes": "2",
                    "time": "20/03/2023-03:51:42",
                    "content": "I appreciate the edits, just have a few questions. Regarding the minimum stablecoins and the subsequent interest paid out, could you explain how exactly it will be calculated? As of now, my biggest concern is that this is a large OP grant for a relatively small project that has the potential to be farmed. We are also working without user metrics, which makes it a bit more difficult to gauge. I am not sure if this is similar to “Pool Together,” where people earn interest and OP rewards, but please let me know. Personally, I am not a big fan of “learn to earn” projects because they often lead to a large number of sybil attacks without much reward. It usually results in a metric and transaction boom without any subsequent usage. This is not an attack on your project, as I think the writing and story are really interesting. However, I don’t think the distribution is the most ideal way to bring new users into the ecosystem. I’m more than happy to be wrong on that though, haha!     Claw:  The grant will be used for usage incentives. To continue the adventure on the mainnet, players must deposit a minimum of stablecoins to continue the adventure. This amount will be locked during one month with the release of each new episode. If the users/players want to enter the next episode, they would have to relock their deposit for one month. Users will be eligible to receive interests paid in OP. On our hand the stablecoins locked on the platform will be used to generate revenues.   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.63025974025974
                },
                {
                    "author_link": "https://gov.optimism.io/u/Claw",
                    "index": "14",
                    "likes": "0",
                    "time": "20/03/2023-16:42:43",
                    "content": "Thanks @MattL for your comment. Your concerns are perfectly understandable and this is how we are planning to address them :  Minimum and maximum stablecoins deposited on the protocol per address.  We are considering a minimum deposit of $50 (in stablecoins) and maximum of $2000 per address. Those values are subject to be adjusted based on first feedback and observations.  Depositing is not the sufficient condition to be eligible to receive OP rewards on the depositied amount.  It is required to fulfill the mandatory steps included in each episodes. As a example, users will have to deposit a minimum amount on a specific yield farming app, with $100 being the current minimum amount. We are also considering this value to be proportional to the amount deposited on the Revolte protocol. This way sybil attacks will be unlikely, or if they occur, it will be in any case beneficial to the ecosystem, as it will be more money deposited on the showcased protocols. Our users, are necessarely users of the protocols we showcase.  Interests paid in OP  If users have fulfilled all the eligibility criteria, they will be incentivized in OP, based on the amount deposited on Revolte protocol. Let’s consider the current APR on the Liquity Provider we are using to generate revenues (Aave) is 0,7%, users will be incentivized with an additionnal 3% APR. It means they will get 3,7% APR paid monthly in OP. On our hand the 0,7% generated through the Liquity Provider will be part of Revolte revenues. We are using the same concept as Pool Together, but the users’ interests in our case will be entirely paid in OP. ~~ ~~~~ ~~ I would not use the « learn to earn » concept to describe Revolte. We would like the users to enjoy the experience in the first place, earning tokens being just an incentive to bring more visibility to the project. The way we want to present it to our users, is that by depositing they will help us to finance partially the project, and also the coming episodes. It can be seen as a form of sponsorship from our users. This part of our business model, combined with the donations will represent a maximum of 10% to 15% of our revenues. The major part of our revenues will come from the custom-built episodes (sponsored by the showcased protocols themselves) and also the grants that aims to finance project that participate in education and growing the ecosystem. Regarding the large OP grant for a relatively small project (for now  ) i would like to propose 2 possible conditions to avoid any grant distribution wrongly allocated :  After completion of the incentive distribution schedule that we have detailed, if some funds remain undistributed, they will be sent back to Optimism (the address we receive the funds from). The distribution schedule could also be extended if accepted by this grnat council Distribution of the incentives, with OP tokens unlocked on a monthly basis from an address that the Grant Council controls (and not Revolte). This way it will avoid having sleeping OP on our hand, and only required OP will be distributed. It can also be associated with providing sufficient metrics to the Grant council.  Depositing on Revolte protocol is not considered as a long term  business model. As mentioned above, we evaluate that it will represent (combined with the donations) a maximum of 10% to 15%. After the end of the OP incentives, that will widely help us to increase our visibility, the depositing requirement will not be mandatory anymore, and we will be relying on the sponsored stories, commissions and grants mainly. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.40656887755102
                }
            ]
        }
    ],
    "group_index": "547"
}