{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/synthetix-ambassadors-phase-0-delegation-2m-op-tokens/3726",
            "title": "Synthetix Ambassadors Phase 0 Delegation - 2M OP tokens ",
            "index": 3726,
            "category": [
                "\\xf0\\x9f\\x8f\\x9b Governance"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/MattL",
                    "index": "1",
                    "likes": "16",
                    "time": "17/10/2022-19:38:37",
                    "content": "The Synthetix Ambassadors will soon receive a delegation of 2m OP tokens (Optimism governance power) from the SNX Treasury Council. We would like to ensure that there is advanced notice of this delegation because of anticipated community feedback. It is important to note that there is a blog post detailing all of this, but I’ll quickly summarize the reasons for doing this in this thread by taking some pts from the blog post 1) OP Delegation Included in original SNX Ambassadors Proposal If you look at the initial OP distribution that the SNX Ambassadors at the time (Matt, Mojo, Millie) wrote, it makes clear that there was intent (at the time) for this Optimism to be delegated to the Ambassadors. This delegation was something Synthetix Ambassadors had initially pushed for under its internal proposal and was approved by the Spartan Council at Synthetix. Furthermore, these tokens were directed to be held by the Synthetix Treasury council, as they were deemed the best fit to handle distributions for incentives and so on. Members of the Optimism community have stated that phase 0 delegations are only acceptable if it is adequately disclosed, and this disclosure was given. While it wasn’t correctly carried over to the Optimism forums, this was because of the lack of contentiousness surrounding this topic at the time because Synthetix’s phase 0 proposal came long before any drama in OP governance (proposal was posted in May) 2) Ecosystem Support - Overtime Markets scare The Synthetix ecosystem is vast; it is a major part of Optimism and helps to onboard countless users onto Optimism. It is important to support this ecosystem as they request Optimism tokens, and because of the lack of governance power because of the inaccessibility of Ambassador voting power, Synthetix Ambassadors haven’t been able to support its ecosystem properly. The most notable example is when Overtime Markets requested OP tokens to incentivize users and compete with centralized competitors. They received a NO recommendation for their proposal from Optimism DeFi Committee C. For context, when a committee typically issues a recommendation there has been a 100% chance of losing their upcoming Optimism vote. We’ve also rallied support in conversations in the Thales Discord, Optimism Forums, on twitter, and are also using our current voting power to support Overtime. As of right now, this support has helped put Overtime on the path of being the first proposal to overcome a NO recommendation. The Synthetix Ambassadors can’t rely on this sort of outpouring of support each and every-time. Which is why it is essential for this delegation of Optimism to occur, as it will ensure that the Synthetix Ecosystem is properly supported. 3) Inaccessibility of Ambassador Voting Power - Lost committee vote, inability to support ecosystem Most Optimism governance power held by the SNX Ambassadors is inaccessible for voting. Our original wallet faced multisig issues when being used on L2, which made 1.4m OP tokens inaccessible for voting. We believe that this has created situations where Synthetix Ambassadors have been unable to support the Synthetix communities interests properly. One of the major situations is when the Synthetix Ambassadors lost their vote to be selected as an official committee in Optimism governance by far less than the 1.5m votes that were inaccessible for voting due to this issue. Support for the future of Optimism Governance As Synthetix ambassadors we feel that we are well equipped to contribute to the improvement and maintenance of Optimism via governance, and represent the Synthetix ecosystem in the Optimism ecosystem as well. We are not going away, and we want to see Optimism flourish for many years to come ",
                    "links": [
                        "https://gov.optimism.io/t/retroactive-delegate-rewards-for-season-1-2/3947",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/13"
                    ],
                    "GPT-summary": "The post explains that the Synthetix Ambassadors will receive a delegation of 2m OP tokens from the SNX Treasury Council. The author explains the reasons for the delegation, including the original proposal, ecosystem support, and inaccessibility of Ambassador voting power. The post also mentions the need for community feedback and support for the future of Optimism Governance. A 3rd party gives constructive criticism and extends to the proposal, while also asking questions and potentially wanting to collaborate.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.86068211068211
                },
                {
                    "author_link": "https://gov.optimism.io/u/ScaleWeb3",
                    "index": "2",
                    "likes": "5",
                    "time": "18/10/2022-00:17:26",
                    "content": "Nice writeup.  Self-delegation: While not being a fan of “self-delegating grant funds”, it was clearly mentioned in the beginning that this portion will be used by SNX ambassadors until funds run out. (Not sure if the Op foundation has changed their official stance since then.)  Edit: It was only mentioned on SNX forum, not in the Op forum - which makes this a diff case.   Overtime: We felt there was quite a bit of unnecessary drama around the Overtime proposal as we all largely supported it to pass this or next cycle - but we understand your intentions.   Inaccessible Voting Power & Delegations: We’re also very much looking forward to a solution to the inaccessible Op, to more active governance engagement (not only grants!), and improvements on stale delegations (power).   Overall, we expect the Op ecosystem will continue to benefit from closely collaborating with the SNX ecosystem. We hope that other, similarly aligned projects also a) accumulate Op tokens on the free market and b) join this governance for a flourishing Op ecosystem future. It will be important to find a good middle ground between self-interests of stakeholder groups & general, long-term, sustainable Op ecosystem growth initiatives. The last point might be especially important for SNX ambassadors & the Op team to consider as the SNX ecosystem in aggregation will have a lot of voting power (-> responsibility) in the Op ecosystem and we don’t see many teams/communities as professional, aligned & outspoken as Synthetix. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.643190476190476
                },
                {
                    "author_link": "https://gov.optimism.io/u/katie",
                    "index": "3",
                    "likes": "4",
                    "time": "18/10/2022-01:26:40",
                    "content": "Thank you for the summary.  Can you please point to where it was outlined that you intended to use a portion of the grant that was received for self delegation? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/MattL",
                    "index": "4",
                    "likes": "1",
                    "time": "18/10/2022-02:19:34",
                    "content": "Yup. Just going to quote from the blog post written from SNX Ambassadors. Blog post to look at it - Synthetix Ambassadors Optimism Governance Delegation — SNX Ambassador News - I’m just on mobile so gonna post a pic of it below.  image1022×1442 138 KB  ",
                    "links": [
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/3/346fa395a66cd5549621b57fc7ad26932143e7ff.jpeg"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/katie",
                    "index": "5",
                    "likes": "2",
                    "time": "18/10/2022-04:05:51",
                    "content": "Ah ok so the self delegation component wasn’t included in the proposal that was voted on? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/MattL",
                    "index": "6",
                    "likes": "1",
                    "time": "18/10/2022-04:44:09",
                    "content": "    MattL:  Members of the Optimism community have stated that phase 0 delegations are only acceptable if it is adequately disclosed, and this disclosure was given. While it wasn’t correctly carried over to the Optimism forums, this was because of the lack of contentiousness surrounding this topic at the time because Synthetix’s phase 0 proposal came long before any drama in OP governance (proposal was posted in May)   Well, yes and no. Yes, because it was included in the SIP on the Synthetix side, which went through governance. No because it wasn’t carried over to the forum properly, but it’s important to note that this proposal was carried over during a time of lack of contentiousness over details like this. There was no precedent for this at the time, and the vote for Synthetix (and all other Phase 0 proposals) was done in a batch - Snapshot With this in mind, we believe this is enough to show that there was intent for it to be carried over. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.398809523809524
                },
                {
                    "author_link": "https://gov.optimism.io/u/katie",
                    "index": "7",
                    "likes": "7",
                    "time": "18/10/2022-04:50:52",
                    "content": "I’m not the delegation police or anything, but personally I would like to see self delegation specified in a proposal and voted in with that component being made clear to everyone. But self delegation is a bit murky at the moment so I understand where you’re coming from. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "8",
                    "likes": "7",
                    "time": "18/10/2022-12:45:38",
                    "content": "I think, if their main wallet is not accessible and they are not able to vote with that, doing a self-delegation equal to amount of OP delegated should be a logical thing to do. Synthetix has a huge ecosystem and they mush have their voice in gov. But self-delegation was not mentioned in the proposal so their internal document does not hold value. Doing the self delegation until issue is resolved with snapshot should be fine. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.497395833333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPGovWatch",
                    "index": "9",
                    "likes": "3",
                    "time": "18/10/2022-21:25:16",
                    "content": "Is that what they are proposing? Just until the wallet issue is resolved? I’m not clear. @MattL Will Synthetix also support other protocols who include self-delegation in their proposals to increase representation? I know many on committees have been opposed in the past. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.09375
                },
                {
                    "author_link": "https://gov.optimism.io/u/states_of_nature1651",
                    "index": "10",
                    "likes": "3",
                    "time": "19/10/2022-05:46:24",
                    "content": "Long time lurker, first time poster. I have been following this self-delegation question and it is a super interesting one. I think that there seems to be broad agreement that protocols, especially key ecosystem protocols, should have an active voice in governance. They key questions seem to be 1) Should Optimism be subsidizing this involvement through a grant program designed for ecosystem growth vs. buying their way in and showing that governance has monetary value, 2) How do we protect against overly self-interested behavior, 3) How do we ensure actual governance involvement vs. only focusing on voting for a narrow, specific purpose, and 4) What is an appropriate amount of self-delegation and should the tokens eventually be used? This is a tough issue. My thought is that we are using 1 grant program to solve 2 different problems. If there is agreement that protocols need a voice, then it seems like we should have grants/approvals specifically for self-delegation and encourage protocols to apply for OP specifically for that purpose. For example, if we agree that say 50% of vote (just an example) should be protocol voice then it is pretty easy to assign a grant bucket based on current votes. Some benefits:  Protocols could then justify how much they want based on importance/TVL. We could require that they appoint a delegate who should be actively involved based on certain KPIs. Require that they abstain from votes on their own proposals and attach other requirements that make people feel the process is fair. It also allows protocols to choose to participate in governance AND apply for needed funds rather than trying to incorporate both elements into a single proposal. Finally it incentivizes governance participation and as more OP gets delegated will require folks to get more skin in the game to maintain their vote share. All this to say, I think 2M OP (10ish % of current votes?) seems about okay for an incredibly important protocol on Optimism. Obviously, it seems like they are participating broadly, but perhaps clearly outlining how Synthetix ambassadors are participating/will participate in governance going forward would outline the value of this specific delegation. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.622157872157873
                },
                {
                    "author_link": "https://gov.optimism.io/u/states_of_nature1651",
                    "index": "11",
                    "likes": "2",
                    "time": "19/10/2022-05:57:44",
                    "content": "@katie re-reading your post, this is kind of what you were saying too? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/katie",
                    "index": "12",
                    "likes": "5",
                    "time": "19/10/2022-17:54:48",
                    "content": "Hey States of Nature, welcome      states_of_nature1651:  @katie re-reading your post, this is kind of what you were saying too?   Not exactly, it sounds like you’re advocating for a separate voting stream specifically for self delegation.  I’m fine with self delegation being a part of the current grant proposal process, as long as it is specified within the proposal.  The only issue I have with self delegation is if a project uses tokens received via the grants program for self delegation without being transparent about that in the proposal and voting process.  I’m fine with it as long as the expectation is set and everyone can vote accordingly. The issue with Synthetix is a little different because they have tokens that have been delegated to them that they are unable to use.  My understanding is that they are using self delegation as a temporary solution to not being able to vote with their current delegated tokens. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.6502976190476195
                },
                {
                    "author_link": "https://gov.optimism.io/u/Jadmat.Eth-DefiLatam",
                    "index": "13",
                    "likes": "1",
                    "time": "20/10/2022-14:35:28",
                    "content": "@MattL can you clarify if the tokens they have in the multisig (unable to vote) are community delegations or was it a grant of optimism? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 2.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/states_of_nature1651",
                    "index": "14",
                    "likes": "3",
                    "time": "21/10/2022-05:45:34",
                    "content": "Yeah that makes sense. My worry is that it would be a bit haphazard without some guidelines around how much total voting power should be self-delegated grants, no guidelines around expectations for how self-delegating protocols should behave etc. If the goal is, protocols should have a voice in governance, building a cohesive strategy and grant allocation around self-delegation could be an option. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 3.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/MattL",
                    "index": "15",
                    "likes": "1",
                    "time": "21/10/2022-19:51:39",
                    "content": "Replying to this from email so pardon me if it looks weird. The inaccessible tokens in our original multisig is from community delegations. Our new multisig has already received 2M from the Synthetix Treasury Council. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.0189393939393945
                },
                {
                    "author_link": "https://gov.optimism.io/u/MattL",
                    "index": "16",
                    "likes": "1",
                    "time": "23/10/2022-03:29:37",
                    "content": "Hey there, That’s not what is being proposed, we’re going to be leaving the self delegation until the Synthetix TC uses that 2m for incentives. That’s what was laid out in the SIP, and was meant to be carried over to the forums. Regarding self delegation - I don’t personally have an issue with self delegations being used by protocols, but I do think it’s one of those case by case items that has to be worked through as a part of the overall review of proposals. It’s a tough issue, but I think protocols have a say in overall OP governance is better for all of OP. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.111111111111111
                },
                {
                    "author_link": "https://gov.optimism.io/u/Netrim",
                    "index": "17",
                    "likes": "5",
                    "time": "23/10/2022-16:17:16",
                    "content": "Hey MattL, this is a bit concerning. Currently the 2M are delegated and SNX Ambassadors controls both addresses. This means that potentially have 3.4M voting power as per the dune dashboard and are by far one of the biggest delegate. Are you guys going to be using BOTH, supposing the issues relating to the msig are solved? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.166666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/MattL",
                    "index": "18",
                    "likes": "0",
                    "time": "23/10/2022-16:36:28",
                    "content": "Hey Netrim, We think that due to this delegation being included in internal Synthetix governance, and Synthetix’s large impact on the overall ecosystem it shouldn’t be thought of as concerning. We have a great deal of projects in our ecosystem, and many outside of it who we work with all the time to help them grow or bring them to Optimism. Synthetix cares deeply about Optimism and we think we’re in a position to play a great role in governance. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 6.216269841269842
                },
                {
                    "author_link": "https://gov.optimism.io/u/Jadmat.Eth-DefiLatam",
                    "index": "19",
                    "likes": "0",
                    "time": "24/10/2022-01:43:14",
                    "content": "Lol; it is true what you say? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.875
                },
                {
                    "author_link": "https://gov.optimism.io/u/Axel_T",
                    "index": "20",
                    "likes": "3",
                    "time": "27/10/2022-15:29:55",
                    "content": "Agree. I too find this very concerning.  To put it politely, this group & their associates are very, very ‘firm’ with the rest of the community when they’re stood up to. Their first of the three arguments about disclosure allowing self-delegation appears to only claim disclosure was made within internal SNX documents, and not the formal, public voting proposal format. Yes? The other two arguments they make are essentially, ‘We don’t like losing Snapshot elections and/or having to campaign so hard, so essentially were just going to make ourselves the most powerful delegate irrespective of what anyone thinks, and this will include the 2m tokens that were granted in the very first allocation (beyond their earned delegation) to allow us to do this’.  For the record, I don’t doubt the importance of Synthetix to the overall defi landscape, I just think an eventual voting power of 3.4m tokens overstates their importance and is contrary to a vision of decentralisation. If anyone thinks I’m being too cynical, just ask yourselves: When they cast their 3.4m votes which stakeholder will rank higher in their voting decision, the Synthetix organisation or the Optimism Collective? (Hint: these two should not be one in the same). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.074537037037037
                },
                {
                    "author_link": "https://gov.optimism.io/u/Jadmat.Eth-DefiLatam",
                    "index": "21",
                    "likes": "3",
                    "time": "27/10/2022-18:03:01",
                    "content": "    Axel_T:  independientemente de lo que piensen los demás   this is: regardless of what was SET by Optimism, and re-clarified in the last update     MattL:  Creemos que debido a que esta delegación está incluida en el gobierno interno de Synthetix   this statement borders on ignorance The problem is not the 3.4M $OP; but the EXPROPRIATION; if that amount of tokens was bought by the protocol or delegated by the community; Synthetix, like any person or protocol, may make use of them; what they did not understand here is that they do not correspond to them; these $OPs ARE NOT PROPERTY OF THE PROTOCOL, Synthetix is just a means for these tokens to reach the purpose declared in the proposal The protocols must take the proposals seriously; Respecting the rules is key, especially when:     MattL:  Synthetix se preocupa profundamente por el optimismo   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.583333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/MinimalGravitas",
                    "index": "22",
                    "likes": "4",
                    "time": "28/10/2022-11:14:33",
                    "content": "Looks like there is a fair bit of controversy here, so for clarity I want to try and parse this into 3 separate issues with presumably different levels of agreement.   The 1.4m OP tokens controlled by snxambassadors.eth should be able to vote but have not been able to due to technical issues. It seems perfectly reasonable to either move these, replace them or whatever with tokens in an address that allows them to participate in governance. If the preferred solution to this issue in particular is to take 1.4m tokens from a separate allocation and use them for voting then I would assume that very few people would have any objection to this, it seems completely fair (and with hindsight should probably have been done with all delegates who suffered from the multisig related Snapshot difficulties ages ago).   Use 2.1m OP tokens that were part of the 9m given initially to vote in governance until they are distributed through other means. This was not included in the request for the tokens, but was decided on in your protocol’s internal governance.       MattL:  Members of the Optimism community have stated that phase 0 delegations are only acceptable if it is adequately disclosed   The controversy here is obviously around whether disclosures on the use of tokens can be described as ‘adequate’ if they are not included in the proposal. I would lean towards no if this could set a precedent for any future projects using the OP they have been issued for, well anything, without feeling the need to include it in the proposal presented to Optimism delegates. Additionally, it is obvious that many DAOs have comically centralized governance (such as the 3 accounts that outweigh everyone else in Lido’s Snapshots), which means that we would be potentially allowing for a much simpler attack vector is we allow this to be a precedent. On the other hand, in lieu of the 1.4m issue described above, and Synthetix’s clearly established position in the ecosystem, I think a fair point could be made that we could accept this as a one-off and use it to establish a rule going forward (similar to how we have been lenient in accepting late entries to Snapshot rounds previously etc). The difference between 1.4m and 2.1m is perhaps not massively important?  Combining both options to give a total vote of 3.5m as seems to be a concern of @Netrim and @Axel_T . Unless I’m misreading the thread that’s not what’s being suggested here, there still isn’t a resolution to the inaccessible 1.4m as far as I know so this would be a replacement rather than an addition (correct me if I’m wrong @MattL).  If that were to be the case then I imagine most would agree that is a very different scenario. For a team to just decide that because they are already a powerful part of the ecosystem and don’t like the way some votes have gone that they should just be able to decide to become by far the most powerful delegate, taking more power than someone who has been trusted by about 14,000 delegators, would surely represent a governance attack, regardless of whether the attacker believes they are doing it for the greater good of the community or whatever, that’s a story presumably almost as old as humans have been experimenting with governance!  I’m guessing that the majority of the community would see nothing wrong with 1, a lot wrong with 3, and so the discussion should mostly focus around 2. Personally I think the issue there is more about what precedent this sets for proposals honest intentions for use of tokens than this specific case. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.82030303030303
                },
                {
                    "author_link": "https://gov.optimism.io/u/Axel_T",
                    "index": "23",
                    "likes": "5",
                    "time": "28/10/2022-12:14:53",
                    "content": " I think this is a great summary, and it would be great if someone from Synthetix could confirm this is what it boils down to. On a personal note, the @MinimalGravitas answer is much more conciliatory than my own, and also doesn’t have the attitude mine did. So (a) thanks for taking the higher ground, and (b) their response is how I would have preferred to answer if I had more time & was less reactionary.  In regards to the summarised issues, my opinion is:  I have no issue with the 1.4m OP, the case is quite clear and very hard to argue against. I’m hoping I’m wrong with the 3.5m OP. This isn’t going to happen in 3-18 months time when the technical issue is resolved? Yes/no? I’m less inclined to give another ‘benefit of the doubt’ approval or another ‘this one last time’ approval in regards to the 2.1m OP. I think at some point there needs to be a line in the sand and an end to the exceptions. The ultimate question, if disclosure allows self-delegation, is whether this self-delegation was disclosed to the community voters prior to the original allocation decision. This should be a pretty simple Yes or No answer (for example, pointing to a public, timestamped source), and if the answer requires a great deal of qualification or justification, then that points to the answer simply being ‘No’, it wasn’t disclosed …and that’s where the line needs to be drawn.  In conclusion:  I’m not that active here, so I’m willing to defer to those who commit more time to Optimism Governance. 1.4m OP is still a great deal of voting power, and should remedy a lot of the frustrations the SNX team is having in getting their voice heard. I just hope that this decision can be made by the community (or even a dedicated Snapshot vote) and not arbitrarily by whoever at the end holds the keys.  Thanks for your time, and apologies for my combative style in my earlier reply. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.882840501792115
                },
                {
                    "author_link": "https://gov.optimism.io/u/Netrim",
                    "index": "24",
                    "likes": "5",
                    "time": "28/10/2022-15:12:55",
                    "content": "Thanks for the summary. My concern is three folded:   Not properly disclosed at the time of the proposal on optimism discourse governance.   Not an issue at the time, bad precedent to have. Want to delegate those because the timeline for distribution is long? Amend your original proposal and vote it on snapshot, this thread was posted and the discussion is still ongoing, but the delegation is already a fact   Using the same tokens to mirror the inaccessible delegated voting power onto snxambassadors.eth   This is the actual proposal I would have liked to discuss and I am fine with this until their issues are resolved. Not being able to vote has underrepresented all the voting power the Synthetix community entrusted to their Ambassadors.   What happens if the issue on snxambassadors.eth is resolved?   Will they relinquish the voting power if the issue with snxambassadors.eth is resolved? Will the ambassadors control 3.4M voting power (at the time of writing this)? Will they enact both votes becoming the biggest delegate by far? This questions need definitive answers. Edit: it was three folded, not two folded ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.788194444444445
                },
                {
                    "author_link": "https://gov.optimism.io/u/Netrim",
                    "index": "25",
                    "likes": "5",
                    "time": "02/11/2022-14:44:15",
                    "content": "@MattL tagging you so we get an answer to my questions. Next voting cycle is coming up and we need to have an answer to know where we stand Edits: spelling ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/MinimalGravitas",
                    "index": "26",
                    "likes": "3",
                    "time": "13/11/2022-13:05:42",
                    "content": "Hi @MattL (or @mastermojo), Just bumping this to see if you had an answer on your intentions with this one yet? A few of us (e.g. @Axel_T and @Netrim) have raised the query so it would be great to get your clarification. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/MattL",
                    "index": "27",
                    "likes": "1",
                    "time": "15/11/2022-01:13:53",
                    "content": "Hey there Minimal, Apologies for the delay. I answered this earlier in the thread, but I am more than happy to clarify. The Synthetix Ambassadors will be using both wallets and will not be removing the self-delegation once the other wallet is accessible. This was laid out in the original SIP and will be depleted as the Synthetix Treasury uses these for rewards.     MattL:  Hey there, That’s not what is being proposed, we’re going to be leaving the self delegation until the Synthetix TC uses that 2m for incentives. That’s what was laid out in the SIP, and was meant to be carried over to the forums. Regarding self delegation - I don’t personally have an issue with self delegations being used by protocols, but I do think it’s one of those case by case items that has to be worked through as a part of the overall review of proposals. It’s a tough issue, but I think protocols have a say in overall OP governance is better for all of OP.   Thanks guys! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.840811965811966
                },
                {
                    "author_link": "https://gov.optimism.io/u/Axel_T",
                    "index": "28",
                    "likes": "5",
                    "time": "20/12/2022-00:53:12",
                    "content": "Hi, Since no other discussion participants were tagged in this reply, I will do so now: @ScaleWeb3 @katie @OPUser @OPGovWatch @states_of_nature1651 @Jadmat.Eth-DefiLatam @Netrim @MinimalGravitas And since there were no other replies, I will add mine here: Based on the full discussion above, I believe that this is nothing short of an arbitrary, non-disclosed, self-serving governance attack on Optimism by the Synthetix Ambassadors. If I’m not mistaken, from Snapshot you can see that they are starting to vote with this 2.1m OP, and this is yet another reason for community apathy and disempowerment, why OP holders don’t want to get involved in its Governance (or leave quickly), and why a large majority of token holders don’t want to get informed and routinely vote. Why bother when the community is controlled by a few? And the few make up their own rules, to benefit themselves, as they go along? Bearish for the Optimism Collective and OP …or should the Collective be renamed, the Synthetix Ambassadors Affiliate Grants Program?! Sorry, that’s rude, but this action is shady, and from a group/bundled vote Phase 0 allocation as well  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.100818452380952
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "29",
                    "likes": "4",
                    "time": "22/12/2022-16:36:05",
                    "content": "Hi Axel, I am spending some time away from Keyboard, so apologies if i missing latest development around this topic. I am silent on this as there is nothing new to say, I did my best by bringing this topic up for discussion when Perp did it and later with SNX. But as I am tagged, few thoughts. Those following this conversation from starting are either against it or at least find their approach unethical. Overriding their Phaso 0 proposal commitment by their internal proposal is wrong and against open governance. Can I, as a protocol, take fund from gov for protocol development and later use it for other reason because I have a written document mentioning the same somewhere in my Discord ? They are one of the biggest and trusted ecosystem on Optimism and it makes perfect sense that their voice is heard in our governance but the guidelines should come from OF so that it applies equally to all protocol, big or small. What is better and more sustainable, a decision made by a multisig of 3-5 people or a framework and set of rules applicable to everyone equally and fairly. They are already using and voting with their extra 2M, why should a protocol gets a head start compare to others ? Katie, Minimal, Axlvaz, Netrim and our Latam members raised their voice on this forum as well as on Discord but all we got in Response was “greater good narative” shielded with word ‘community’. Thank you doing the follow-up and happy holidays. 20 Dec 2022, 06:33 by notifications@bc41dd.discoursemail.com: ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.74310064935065
                },
                {
                    "author_link": "https://gov.optimism.io/u/Axel_T",
                    "index": "30",
                    "likes": "2",
                    "time": "22/12/2022-21:32:44",
                    "content": "Thanks for the reply, OPUser. Good summary. I agree with your thoughts, and it’s good to know that you and others feel similar uneasiness about this, and have been discussing it more thoroughly when I was absent. Thanks for stating your position. If there is nothing new, and nothing else to say or can be done, then at least this forum is transparent and may help shape rest-of-community views moving forward. At least I can hold onto that. Thanks for your ongoing involvement with Optimism. Have a great holiday season, enjoy the time off, and see you in 2023. All the best! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.62937062937063
                },
                {
                    "author_link": "https://gov.optimism.io/u/MinimalGravitas",
                    "index": "31",
                    "likes": "8",
                    "time": "23/12/2022-09:28:03",
                    "content": "Honestly, I’m really disappointed by this as well, but yea, not sure what more there is to say. In the latest voting round for Citizen House Badgeholder nominations they have used their 2.2M to vote for themselves, and only themselves. This has means they have simply given themselves a position in the top 10 and therefore a citizenship badge. Again, there were no rules against doing this, but it just seems to continue the pattern of self-serving descisions, which presumably we should expect to continue whenever the opportunity arises. Like you said above, Synthetix should have a large role in Optimism, they are one of the key protocols around which so much is built… but that power should be allocated by the community as it is for everything else, not just taken by them every time there is no explicit rule preventing it. I’m sure they think it is for the ‘Greater Good’ for them to have as much control as they can, but I fundementally believe it is never a sensible idea to let the powerful decide how much power they should have, even if they really are good actors (which I do think they probably are). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.898496240601504
                },
                {
                    "author_link": "https://gov.optimism.io/u/Axel_T",
                    "index": "32",
                    "likes": "2",
                    "time": "23/12/2022-12:51:02",
                    "content": "Thanks for the reply, Minimal. Well put. To change the topic to something more positive: Congratulations on winning your Badge for being in the top 10! I’m only a small token holder but I was happy to vote for you a few days ago, and thus I’m happy to see you and few others I voted for make the Top 10. So, congrats! I hope you give yourself a good thumbs up, and then go on to enjoy the role & carry it out well. Happy holidays  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 6.696022727272727
                },
                {
                    "author_link": "https://gov.optimism.io/u/MinimalGravitas",
                    "index": "33",
                    "likes": "5",
                    "time": "15/01/2023-19:48:44",
                    "content": "I continue to be disappointed Matt. 3.5 million votes from wallets you control to give yourselves a position in the Grants Council… after voting yourselves into a position in the Citizen House. Is there any other interpretation of this than as a governance attack? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 2.8125
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "34",
                    "likes": "6",
                    "time": "15/01/2023-22:24:10",
                    "content": "Gonna echo this. Using their 2M $OP self-delegate wallet to vote on proposal is a governance attack. I wonder how long this ‘we are doing this for greater good of Optimism’ will continue. If we look back, they use their wallet to vote on couple of proposal in season 2, then with Citizenship and now Grant Council. Its even sad when you think its implication on citizen house, they literally gave a citizenship to themselves, now their candidate could, possibly, nominate one additional person willing to rubber stamp in their approval. And the chain evolves, now could this binary tree of aligned entities vote to fund public good without any bias ?? I, with few other delegates I know,  joined our gov because we saw a glimpse of moving away from plutocracy system with Citizens house but I dont think we are making progress in the right direction. I hope we can abolish this method or put a  mechanism of penalty similar of Ethereum POS. In long run we should have a process in place to prune not only the child branch but root too. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.503571428571429
                },
                {
                    "author_link": "https://gov.optimism.io/u/Axel_T",
                    "index": "35",
                    "likes": "5",
                    "time": "16/01/2023-06:59:32",
                    "content": "Depending on how ‘friendly’ the nominees are in the Builders & Growth Councils, they’ve effectively taken control of both sub-committees of the Grants Councils, and thus taken control of the Governance Fund allocations in their current state.  Their Builders council sub-committee votes occupy the current Top 3 positions. Their Growth Experiments council sub-committee votes occupy a controlling 4 of the Top 5 positions.  A real shame. I know there are other projects that limit the maximum voting power of their delegates. Perhaps this is an option we could have a one-person, one-vote election on? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.196428571428571
                },
                {
                    "author_link": "https://gov.optimism.io/u/Netrim",
                    "index": "36",
                    "likes": "5",
                    "time": "16/01/2023-20:38:18",
                    "content": "Another round, another abuse of dominant position enabled by misleading arguments and going against the written word on this very forum. Synthetix should dissolve the ambassadors as a source of shame. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "37",
                    "likes": "3",
                    "time": "17/01/2023-16:24:24",
                    "content": "I’m a bit confused about all this. I have @MinimalGravitas and @OPUser in high regard and also @Matt. Can we list all addresses we think are controlled by Matt? I think it’s something like:  SNX users represented by an SNX delegate (self-delegation because they can’t vote with the original delegated multisig address) Ambassador delegate address Protocol self-delegation address  am I correct? If so:  There isn’t any rule for all these different addresses to be managed by the same person. If they are elected on their own DAO there isn’t any rule where different addresses should be considered part of the same delegate, all the tokens delegated to these addresses come from different entities. There is a rule that considered self-voting approved if you vote for 5 or 3 candidates depending on the council  I understand the “governance attack” argument because one single persona has the power to vote someone in or out by itself. And I agree we should call these problems out in the open. But I think these mistakes should be acknowledged and corrected by future proposals without engaging in a PVP match. We must consider everyone here is thinking about Optimism benefits. Everyone does it as they think it’s best and we self-regulate with each other. This PVP nonsense is just making the coop game more difficult. Because now Matt has 2 options either he says “I am right” or he says “sorry”. You don’t give any other chance to say “Hey you know what we should think about how to frame this on the OP governance” We are mostly 20 delegates trying to figure these out. How can we bring more people in if they see each other pvping. So back to the questions:  Are these 3 addresses correct Do we have any idea how to rule this and help the Op foundation?  btw I don’t work for SNX, I’m not part of their community and I don’t hold any SNX. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.497515527950311
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "38",
                    "likes": "0",
                    "time": "17/01/2023-17:03:44",
                    "content": "yeah i think this is a helpful way to frame this. i’d been planning to write here on this subject but you said much of what i was going to say but better. i think calling this a governance attack and for synthetix to disband the ambassadorship is hyperbolic and misses the far larger concerns around voter concentration and lack of active delegation activity. frankly, this reads more as frustration at an adverse voting outcome due to a large player, something i’ve been on the wrong side of myself. we’ve gone through this enough times now, and i really don’t think anyone seriously sees the synthetix community as nefarious actors. instead let’s try to actually make community power work better. last clarifying point on this, i’m sure @Gonna.eth  didn’t mean to imply this, but matt’s not the sole decision maker among the ambassadors. it’s a group of people who themselves are elected to this position by SNX tokenholders through a competitive process. this isn’t an individual or even a monolithic entity. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.285863095238095
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "39",
                    "likes": "0",
                    "time": "17/01/2023-17:57:38",
                    "content": "Thank you Jack for clarifying Matt it’s not a single entity and your words. Next time can we avoid indirect PVP too? It takes us nowhere and diverts the discussion.       jackanorak:  frankly, this reads more as frustration at an adverse voting outcome due to a large player, something i’ve been on the wrong side of myself.   As always trying to focus on solutions and not why things happened. I do agree I was angry when I was not elected badgeholder and I wanted to shoot everyone around, so I understand the feeling as you do and we should be more empathic about it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.078125
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "40",
                    "likes": "3",
                    "time": "17/01/2023-17:58:59",
                    "content": "Appreciate the follow up @Gonna.eth ,  I dont have any concern with amount of $OP delegated to anyone as long as its coming from community or passed through a process and framework so that it applies to everyone, equally and fairly. They choose to self-delegate, again number of OP is irrelevant, and using that wallet to vote from past couple of proposals which is, in my opinion, an attack to governance. It was not mentioned in their proposal and they should have followed the same approach like other protocol, now that protocol self-delegation is in place. Others will try to derail the conversation by connecting this to how voting is impacted, either in council or during citizenship, but that the outcome of the problem. I want to bring the attention back to the problem, which is misuse of grant token by not following the proposal. If Perp was prohibited from participation for not following the proposal, shouldnt it apply to Synth as well. To me both are misuse, Perp sold the grant to fiat and they choose to use it for voting. Why to play favorite ? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.125
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "41",
                    "likes": "1",
                    "time": "17/01/2023-18:12:39",
                    "content": "I can agree on the topic of misuse of OP tokens. I think there’s a clear distinction between selling tokens and self delegate them. Yes, they are both misuse of grant tokens because they are not on their proposal. But if we look at laws in general everything is considered a gray area and not just black and white. Example: Getting into a private house with a gun to steal something has different consequences if there are people in it or if it’s empty. So perp sold and it’s prohibited from participation, although I don’t agree and did not vote on this. (which brings another great discussion) SNX self-delegated, something they told in a SIP on their own governance. Do you think they should be prohibited from participation? If so are they entitled to sell all their OPs the moment they are out? Will this be beneficial for OP as a whole? I mean you are asking one of the most used protocols with one of the strongest liquidity and fee creators in optimism to be prohibited from governance because someone forgot to add this to the proposal? I’ve read a SIP where these tokens will be used btw and will leave SNX governance, will that suffice? BTW I’m asking all this because it’ll shape future proposals template. I’m not trying to PVP here. sorry if any of this sounds like an accusation. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.418154761904762
                },
                {
                    "author_link": "https://gov.optimism.io/u/Netrim",
                    "index": "42",
                    "likes": "0",
                    "time": "17/01/2023-18:24:57",
                    "content": "It’s not a binary decision because I know from day 1 that the Ambassadors have had issues with their voting power. I posted this back in October:   Using the same tokens to mirror the inaccessible delegated voting power onto snxambassadors.eth  This is the actual proposal I would have liked to discuss and I am fine with this until their issues are resolved. Not being able to vote has underrepresented all the voting power the Synthetix community entrusted to their Ambassadors.  The ambassadors are not prohibited from participating, but they should be held accountable on what is a misuse of a Grant. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 6.263888888888889
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "43",
                    "likes": "0",
                    "time": "17/01/2023-18:32:05",
                    "content": "Was there any rule implying you should not use granted tokens to self-delegate when Ambassadors did it? I can’t remember when this was ruled. If not, I guess that is why we have the self-delegation program now. So one action brings new governance proposals to regulate and now protocols can be properly represented. Asses problems Iterate Grow Shall we avoid punishment in the process? I feel this is where most gray areas are and looks like a time-consuming thing that stay us further away from the Optimism collective values. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.736363636363636
                },
                {
                    "author_link": "https://gov.optimism.io/u/Netrim",
                    "index": "44",
                    "likes": "1",
                    "time": "17/01/2023-18:59:51",
                    "content": "The rule was added, amended and then the Protocol Delegation Program created. The original grant terms still apply, Synthetix didn’t include a provision for that delegation hence delegation is out of order and should be revoked. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "45",
                    "likes": "2",
                    "time": "17/01/2023-19:07:42",
                    "content": "Comparison with perp was only to show that it does not sound justified from outside if one was prohibited and other was not held accountable. With an ecosystem of more than 20 dApps running on top of SNX, I truly believe they should have a voice in anything related to Optimism. I am asking from starting that anything related to governance should come from Operating manual so that it applies to everyone and we should be open to feedback and be flexible with gray areas. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.488636363636363
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "46",
                    "likes": "0",
                    "time": "17/01/2023-19:08:46",
                    "content": "So they should revoke, and then redelegate up to 2M since they are part of the top 20 selected by Op foundation, am I correct?  SNX was not wrong on self-delegation until it was ruled. Once ruled they should have revoked the self-delegation (or at least the portion that was out of the multisig problem) Now they should have 2M delegated  is this correct? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "47",
                    "likes": "0",
                    "time": "17/01/2023-19:11:53",
                    "content": "Thank you OpUser I 100% agree with you on this:     OPUser:  I am asking from starting that anything related to governance should come from Operating manual so that it applies to everyone and we should be open to feedback and be flexible with gray areas.   We will still have gray areas every now and then with mistakes being done. How should we approach those committing it? and how do we address those writing the Operating Manual with the best solution? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/Netrim",
                    "index": "48",
                    "likes": "0",
                    "time": "17/01/2023-19:30:47",
                    "content": "No, because the Protocol Delegation Program voting power comes from OP Labs themselves and only up to a certain amount. Currently Synthetix controls 3.4M voting power. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.357142857142857
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "49",
                    "likes": "0",
                    "time": "17/01/2023-19:42:56",
                    "content": "I think there is a distinction between people with OP on their wallets delegating their OP to an SNX Ambassador (something around 1.3M) and the protocol self-delegation program which represents the protocol itself and should be 2M. Am I wrong? Do we need a rule where someone representing a group of people can’t represent a protocol at the same time? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 3.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/Netrim",
                    "index": "50",
                    "likes": "4",
                    "time": "17/01/2023-19:46:36",
                    "content": "There is a distinction. I only care about the 2M wrongly delegated OP. And I am sure a rule will need to become available once the Protocol Delegation Program is live. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.536363636363636
                },
                {
                    "author_link": "https://gov.optimism.io/u/Oxytocin",
                    "index": "51",
                    "likes": "7",
                    "time": "17/01/2023-21:12:10",
                    "content": "Following the clarifications provided to me in the Discord and Community Call (thanks everyone for the warm welcome!), I understand that the 2M self-delegation is going to be resolved soon as the funds are planned to be used. This, combined with the changes to grant applications and the  Protocol Delegate Program should reduce the ambiguity of this in the future from this situation happening again. Personally, while I disagree with this delegation since other protocols did not do something similar, it seems like the issue should resolve itself going forward. However, there is a part that remained unclear to me: if the Protocol Delegate Program was implemented as an explicit discouragement of grant self-delegation, why are these delegated funds still being used after the passing of this vote on December 21st? Now, I have to admit that the reason why I am aware of this discussion is because this decision to use the 2M OP is affecting me and the protocol I wish to represent directly. As of the time of writing, there are less than 24 hours left for the vote to close, and these 2.3 Million OP have moved ParaSwap from being the ~5th to not even being a nominated protocol anymore. This, once again, is happening in a vote for something specifically designed to remove protocol self-delegation , and offer an alternative instead. Had ParaSwap also decided to also use its unspent OP to self-delegate, we would have enough to have closed the gap and made it to 8th place. However, other protocols that are now going to be excluded from this round due to this self-delegation did not even have this choice. Atlantis World ( represented by @revmiller ), for instance, is another protocol where these 2.3M made the difference between being represented and exclusion. In a similar vein, at least 1 Grant Council Reviewee is being affected by this issue as well. Personally, if I do not make it past this round, I am fine applying to represent ParaSwap again on the next voting round, but how many members might potentially be discouraged from applying again in the future? I understand these votes being counted while we didn’t have an alternative for protocol delegation, but I’m unsure as to why the wallet with the largest voting power in an election about an alternative to Grant Self-Delegation would be a wallet voting with Grant Self-Delegation. ",
                    "links": [
                        "https://snapshot.org/#/opcollective.eth/proposal/0x3a1f9a30c47d6060f3b732404f3a6b2ceba3da07be0505ef0f93b6dab7fa3185",
                        "https://snapshot.org/#/opcollective.eth/proposal/0xa9457a5344747a6c272de786419fc7a4e83fcf0f927ef9b1ce767452faa9b453"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.219827586206897
                },
                {
                    "author_link": "https://gov.optimism.io/u/Jadmat.Eth-DefiLatam",
                    "index": "52",
                    "likes": "4",
                    "time": "17/01/2023-23:30:14",
                    "content": "When the Synthetix proposal was accepted, the intended destination for these $OP was NOT the subsidy of its vp; Synthetix is using assets that do not belong to them, the protocol is just a means for those tokens to reach the “promised” destination in their proposal. Accepting this, turns the 3 votes in progress into a meme, completely distorted by non-genuine voting power I personally believe that the OF should review this thread before the current proposals are finalized @lavande ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.166666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "53",
                    "likes": "0",
                    "time": "18/01/2023-00:16:57",
                    "content": "    Oxytocin:  if the Protocol Delegate Program was implemented as an explicit discouragement of grant self-delegation, why are these delegated funds still being used after the passing of this vote on December 21st?   Because the proposal is to discourage this behavior in the future I believe there is no direct request to the SNX delegate to terminate it that I am aware of.     Oxytocin:  Now, I have to admit that the reason why I am aware of this discussion is because this decision to use the 2M OP is affecting me and the protocol I wish to represent directly. As of the time of writing, there are less than 24 hours left for the vote to close, and these 2.3 Million OP have moved ParaSwap from being the ~5th to not even being a nominated protocol anymore. This, once again, is happening in a vote for something specifically designed to remove protocol self-delegation, and offer an alternative instead.   I think this is the assessment status of the problem that is already being solved. I feel you, I was left out of badge holders almost for the same reason. I told myself I’ll stay and try to fix it as you are deciding it too. I don’t think this is the last protocol delegation program tbh. When it comes to the Council election. I have to say I expected more candidates, and by now I feel it’s better to bring all reviewer’s candidates in and redistribute the compensation between all. We would have more eyes to cover and they are mainly the same people that have been here from the beginning. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.5735294117647065
                },
                {
                    "author_link": "https://gov.optimism.io/u/Axel_T",
                    "index": "54",
                    "likes": "4",
                    "time": "18/01/2023-07:51:33",
                    "content": "This debate is now becoming circular. The facts have well been ventilated, and all that appears to be remaining are tangent-like debates over particular points and other similar distraction / muddy-the-water arguments. Ultimately, if you can’t see the problem with this, with everything laid out, then you are part of the problem. Something that will hinder Optimism’s growth; with implied acceptance of this governance flaw. In the new additions to this thread, I think Oxytocin sums up the situation best. I.e. How things are going wrong now, and how this will lead to further issues down the track. The only new addition I’ll make is that this should never have been an issue in continuance. The ~2.3m OP granted was meant to be distributed well before today, that’s what the original Proposal allowed for and (if memory serves correct) all the documentation stated this was a temporary issue as distributions of the ~2.3m OP was meant to be finished ‘over a few months’. It’s well past a few months now, this issue has remained, and votes (and the accompanying positions of authority and shape of the Optimism Collective) are being decided by this problem. To not be PVP (assuming this is a gaming reference to Player vs Player?), and to be be constructive towards Optimism, Sythentix and an ultimately decentralised user base, here are some suggested, possible solutions:   Distribute the ~2.3m OP to users as had been planned to be done by now within the Phase 0 Grant, i.e let the problem play itself out.   Re-delegate the ~2.3m OP to a broad, unaligned set of other delegates, and simply keep the voting power of Synthetix Ambassadors that the OP holders had originally, collectively entrusted to them.   Simply not vote with the contested ~2.3m OP; just take it off the table for the sake of harmony and unifying a group.   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0721538299663305
                },
                {
                    "author_link": "https://gov.optimism.io/u/Oxytocin",
                    "index": "55",
                    "likes": "3",
                    "time": "18/01/2023-10:29:31",
                    "content": "    Gonna.eth:  Because the proposal is to discourage this behavior in the future I believe there is no direct request to the SNX delegate to terminate it that I am aware of.   I obviously cannot get in the mind of the proposal redactor, but I believe that this is to avoid finger pointing for a particular delegate, as that could’ve come across in very poor taste, as delegates are already expected to do this under the code of conduct. Synthetix and their governance ambassadors are a key part of the Optimism ecosystem, and I really would not want to make them feel unwelcome.     Gonna.eth:  When it comes to the Council election. I have to say I expected more candidates, and by now I feel it’s better to bring all reviewer’s candidates in and redistribute the compensation between all. We would have more eyes to cover and they are mainly the same people that have been here from the beginning.       Axel_T:  This debate is now becoming circular. The facts have well been ventilated, and all that appears to be remaining are tangent-like debates over particular points and other similar distraction / muddy-the-water arguments. Ultimately, if you can’t see the problem with this, with everything laid out, then you are part of the problem. Something that will hinder Optimism’s growth; with implied acceptance of this governance flaw. In the new additions to this thread, I think Oxytocin sums up the situation best. I.e. How things are going wrong now, and how this will lead to further issues down the track.   Agreed with both of these points, I feel there isn’t much more to be said about this already self resolving matter and one that the SNX team already acknowledged in the community call.  To steer this thread towards a productive direction, I encourage the following points to be taken in the future:  Remove the ability for protocols to self-delegate grants altogether from grant requests, similar to the no-sell rule, as opposed to the current strong discouragement. Grants are destined for builder and user growth, if OP is needed for governance I’d suggest it’s better suited for the Protocol Delegation Programs or even RetroPGF Explore a separate stream for protocol citizens and grant council members. Protocols and builders are the lifeblood of Optimism, and having their voice be represented is important. Perhaps the best way to solve the tensions on the Citizen House/Grants Council side is to have a clear separate stream for Protocol Representatives, which will also guarantee that these sections of the collective are a healthy mix of individuals + protocol delegates.  Finally, something can be discussed to alleviate the impact of the self-delegated grant votes during the affected period after at least Dec 21st, but I am not comfortable suggesting anything as I am part of the affected candidates, so I’ll let someone else explore this if interested. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.691358709041636
                }
            ]
        }
    ],
    "group_index": "298"
}