{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/deprecated-velodrome-early-proposal/2900",
            "title": "[DEPRECATED] Velodrome early proposal ",
            "index": 2900,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Governance Fund: Phase 1"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "1",
                    "likes": "11",
                    "time": "06/07/2022-14:34:44",
                    "content": "NOTE: We have withdrawn this proposal following notice of a Partnership Grant but left the thread open for feedback and archival purposes Project Name: Velodrome Finance Authors Names: Jack Anorak, Tao, Alex Cutler, Gabagool Number of OP tokens requested: 3,000,000 L2 Recipient Address: 0xb074ec6c37659525EEf2Fb44478077901F878012 Relevant Usage Metrics:  Screen Shot 2022-07-01 at 17.24.09584×612 71.1 KB  As of July 1, 2022. For live metrics, please refer to our community dashboard at Velodrome Finance 🚴. Optimism alignment (up to 200 word explanation): Velodrome’s top priority is to provide a deep liquidity layer for low-slippage trades on Optimism. Based on a ve(3,3) design, Velodrome rewards behaviors correlated with the long-term success of the entire ecosystem:  Liquidity providers (LPs) receive VELO emissions, following an emission schedule running in perpetuity VELO holders can vote-escrow their tokens in exchange for veVELO proportional to the tokens locked and time locked, up to 4 years veVELO holders control the flow of VELO emissions to liquidity pools through gauge voting In return, veVELO voters receive 100% of the trading fees and bribes captured by the token pairs they select, as well as an anti-dilutive veVELO rebase  This design offers a capital-efficient, sustainable mechanism for protocols on Optimism to attract and retain liquidity. Protocols holding veVELO can incentivize liquidity for their token pairs in perpetuity with minimal dilution while capturing trading fees, a significant upgrade to classic LP rewards. Success cases include MakerDAO, Synthetix, Liquity, Qi DAO, and Optimism itself; all of which retain significant liquidity for their tokens on Velodrome. This design also simplifies the onramp for new projects joining Optimism and can therefore accelerate development on the ecosystem. Proposal for token distribution (under 1000 words): Since its June 1 launch, Velodrome has attracted $15.5m+ TVL (>$40m at peak) and positioned itself as a key protocol on the Optimism ecosystem. Directing OP incentives to core protocol contributors such as active veVELO voters and strategic partners will add foundational strength to Velodrome’s economy in these early days, giving us time to build out additional functionality critical to the protocol’s success. How will the OP tokens be distributed? How will this distribution incentivize usage and liquidity on Optimism? Velodrome will allocate OP distribution to support a healthy economic equilibrium of protocol incentives and reward further development on top of its liquidity layer:   15% - Long-Term Locking + Governance Incentive  veVELO lockers are making a long-term bet on both Velodrome and the Optimism ecosystem during a moment of great uncertainty. Token locking supports the health of the ecosystem by a) reducing floating supply of VELO, thereby reducing volatility, and b) aligning incentives between the token holder base and the overall ecosystem, as veVELO holders have a shared interest in the long-term success of Velodrome and Optimism as a whole. Rewarding lockers with OP tokens could not only increase the health of the Velodrome economy but also give more governance power to the exact kind of deeply invested, long-term thinkers Optimism is looking to attract.   Quantity: 450,000 OP  Delivery: Distributed to new veVELO lockers proportionally to locking balance  KPI: Exceeding and maintaining 65% VELO total supply locked      45% - Flywheel incentives: liquidity, partner onboarding and OP trade routing  In return for their active participation, veVELO voters receive the trading fees and bribes collected by the pairs they vote for. Bribes, therefore, are highly-capital efficient lever to attract liquidity to the pairs in the ecosystem that deserve it most, while effectively increasing the incentives for long-term participants (veVELO). Bribes act as a core balancing mechanism and can serve as a liquidity catalyst for new players looking to enter the ecosystem. Experience in Velodrome and similar protocols, such as Curve-Convex-Votium, shows that bribes yield a 1.3-5x return in emission value per bribe. Maintaining a consistent bribe program for core ecosystem token pairs would allow Velodrome to attract and retain liquidity in a capital-efficient way.  One of Velodrome’s core objectives is to become the liquidity platform for new and existing projects looking to deploy on Optimism. A key aspect of Velodrome’s initial distribution was the gifting of veNFTs to key “launch partners” both inside and outside the Optimism ecosystem. This resulted in the first ever L2 deployment for several protocols and tokens. The Velodrome Team retains control of additional veNFTs to be used as “grants” for future protocol partners looking to migrate to or build on OP. To continue incentivizing partners to join the Optimism ecosystem, Velodrome will offer bribing matching, veVELO voting boosts, and OP token pairing (providing liquidity) for new partner tokens, using a portion of the OP grant, which would further strengthen OP’s position as a central token for trade routing. As part of this program, Velodrome will seek to coordinate with other partners receiving OP grants to merge liquidity incentive efforts leveraging Velodrome’s mechanics, increasing the sustainability of ecosystem incentives and reducing the potential price impact on OP Velodrome will also strategically pair OP with core tokens to establish OP as a central token for trade routing on the protocol, ensure deep permanent liquidity for OP   Quantity: 1,950,000 OP  Delivery: Bribes strategically added to key pairs, OP paired with key partner tokens, offered as incentives to partner onboarding, match partner bribe incentives. Distributed at an average rate of 160,000 per month  KPI: High liquidity on targeted pairs (TVL), TVL / bribe value, Trading volume / bribe value, number of partners onboarded      20% - Builder Incentives  Distributed to protocols that integrate Velodrome’s liquidity layer into their dApps   Quantity: 600,000 OP  Delivery: Co-incentives positioned on partner protocols  KPI: TVL, transaction volume, transaction count attracted through partner dApps      20% - Building and Auditing Relay   Relay is a proposed addition to Velodrome that will be a first-of-its kind vote delegation and autocompounding feature that is directly built into Velodrome - i.e., not administered by a separate protocol with fee cuts, separate governance, and so on. Relay is a crucial part of the Velodrome ecosystem, one that on the one hand allows votelockers to enjoy passively optimized, compounded yield, and on the other hand provides the Optimism Collective more power to direct liquidity for the benefit of the greater community. How? By combining delegation to a strict profit-maximizing strategy, which would vote for pools offering the greatest potential for fee and bribe revenue, with pool incentivization from OP grants and bribes (e.g., the flywheel incentives mentioned above*),* we can help direct delegated votes to the most socially beneficial pools, while offering the best yield available to veVELO lockers.  While our work since our launch one month ago has for the most part been (and will continue to be) the continual improvement of our existing functionality as well as UI, QoL measures, and integrations, we see an urgent need to get Relay online; this offering would dramatically increase our value proposition to existing and new partner protocols. Unlike many of our peers on Optimism, we have never raised outside capital, instead bootstrapping ourselves off fees and grants after being invited by OP Labs to build on Optimism. This means we’ve been building on a shoestring. This grant would enable us to reach out to the community to attract more builder and auditing resources. We’ve already identified some people and orgs who can help - it’s just a matter of making sure they can link up well with us. Because this is new, we want it done right and quickly.   Quantity: 600,000 OP  Delivery: Relay spec’d, built, and deployed as broadly defined in the post linked above, or built to specs revealed to be better for proper ecosystem functioning  KPI: Relay successfully deployed and audited to the highest standard          Initiative Allocation     Locking Incentives 450,000   Flywheel Incentives 1,350,000   Builder Incentives 600,000   Relay Building and Auditing 600,000   Total 3,000,000    Why will the incentivized users and liquidity remain after incentives dry up? Velodrome’s LP emissions are designed to run in perpetuity, following a sustainable and predictable schedule (see our docs for details). As a result, liquidity incentives will always be a key protocol feature. The incentive program outlined above will significantly boost the value of accumulating VELO and vote-locking into veVELO, supporting the health of the Velodrome economy while the natural tailwinds of Optimism’s growth accelerate. Once OP incentives end, protocols and retail players alike will hold a long-term veVELO position that will allow them to further direct VELO liquidity incentives, while sharing the upside of Velodrome’s and Optimism’s success. Over what period of time will the tokens be distributed? 12 months How much will your project match in co-incentives? The VelodromeFi incentive model is designed in such a way that each of these actions will be reinforced and complemented with additional VELO incentives. In the case of the locking incentives, veVELO holders will receive a higher rebase (veVELO balance growth) every epoch, proportional to the share of total VELO supply that is locked (veVELO.supply / total.VELO.supply). Likewise, flywheel incentives such as bribes will attract an outsized share of VELO emissions to targeted pools, allowing liquidity providers to capture the increased emissions and creating a virtuous cycle of rewards for each $OP committed as part of this strategy. ",
                    "links": [
                        "https://dune.com/Marcov/velodrome-finance",
                        "https://medium.com/@VelodromeFi/velodrome-relay-d7cf5ff191f1",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-curve/3089/41"
                    ],
                    "GPT-summary": "The post is an explanation of the Velodrome Finance project proposal, including its design, token distribution plan, and incentives for users and partners. The author also mentions that the proposal has been withdrawn but is open for feedback and archival purposes. The post may receive constructive criticism or extensions from third parties, and the author is open to collaboration. The proposal may also be audited and reviewed by third parties.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Token economics",
                        "Interoperability and Scaleability",
                        "Smart contract updates",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.795902708402708
                },
                {
                    "author_link": "https://gov.optimism.io/u/fewol",
                    "index": "2",
                    "likes": "1",
                    "time": "06/07/2022-14:35:58",
                    "content": "The amount requested is way to high for the traction your project has. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.8
                },
                {
                    "author_link": "https://gov.optimism.io/u/millie",
                    "index": "3",
                    "likes": "5",
                    "time": "06/07/2022-14:45:04",
                    "content": "Thanks for the proposal guys.  65% - Flywheel incentives: liquidity, partner onboarding and OP trade routing Bribes strategically added to key pairs, OP paired with key partner tokens, offered as incentives to partner onboarding, match partner bribe incentives. Distributed at an average rate of 160,000 per month  In regards to that particular allocation, when you say “OP paired with key partner tokens” do you mean that a portion of OP from this proposal will be LP’d into popular/partner pools? Or that it will be used for bribing incentives for those pools? Thanks. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.065104166666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "4",
                    "likes": "0",
                    "time": "06/07/2022-14:53:00",
                    "content": "we’re flexible on this. could be done on a case-by-case basis really this is part of the strength of this particular program and our commitment to being an active partner as a team; can lay out bespoke incentives to get new protocols onboarded to OP ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.462121212121213
                },
                {
                    "author_link": "https://gov.optimism.io/u/Ganc",
                    "index": "5",
                    "likes": "1",
                    "time": "06/07/2022-14:53:40",
                    "content": "There’s no way you read this in sub 1 minute. It is the 5th biggest protocol currently active on Optimism by TVL. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.333333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/alexcutlerdoteth",
                    "index": "6",
                    "likes": "1",
                    "time": "06/07/2022-14:53:46",
                    "content": "Exactly right, ser. Use the OP token more as a base pair to help drive more liquidity to partner pairs as well as drive additional utility / liquidity on $OP itself. We’ve got a bigger idea here we want to pitch soon too. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.485714285714286
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "7",
                    "likes": "0",
                    "time": "06/07/2022-14:55:24",
                    "content": "distributions from the last voting round in fact have us confident that this is an appropriate amount given our top status as an OP dex, and the centrality of our protocol to ecosystem liquidity carries multiplier benefits that wouldn’t be found in other proposals ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.979166666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/millie",
                    "index": "8",
                    "likes": "0",
                    "time": "06/07/2022-14:56:58",
                    "content": "I see, can you specify how much is planed for pairing OP with the partner tokens and given that there is no single sided liquidity provision, how will the OP be physically paired with those tokens? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.392857142857142
                },
                {
                    "author_link": "https://gov.optimism.io/u/fewol",
                    "index": "9",
                    "likes": "0",
                    "time": "06/07/2022-14:57:36",
                    "content": "Based on metrics and usage the amount asked is way to much, you can very quickly see that. I am not saying NO to the proposal, only saying the amount is way to much based on those 2 parameters. TVL of $15.9 million, requesting $1.5 million of OP for mainly incentives. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/alexcutlerdoteth",
                    "index": "10",
                    "likes": "3",
                    "time": "06/07/2022-15:07:35",
                    "content": "As @jackanorak mentioned, it would probably be on a pretty case-by-case based on the partner protocol’s needs and assets. But, one could easily imagine some form of token swap allowing both sides to provide deep liquidity on an XXX-OP pair. Fees and or bribes generated from these pairs could then also be compounded into additional liquidity to continue building the size of the pool. I think the overall % of the allocation that would go specifically to this function would probably depend on the amount of demand and it’s relative efficacy in onboarding/deeping liquidity for partners. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.683333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/alexcutlerdoteth",
                    "index": "11",
                    "likes": "1",
                    "time": "06/07/2022-15:25:04",
                    "content": "Are there any good benchmarks in your mind? Looking at the current state of proposals, it’s hard to get a gauge. There is also a fair amount of value we’re creating that is difficulty to quantity. We’re actively working to attract and onboard new protocols to the ecosystem: Ren, Hundred, Redacted, Lido, Volt, Layer2DAO, Angle, etc etc. Part of the reason Optimism helped us to bootstrapped was to help new protocols get liquid (a major pain point in the past). That will yield exponential value for the ecosystem. We’re also helping to deepen liquidity on critical ecosystem pairs like sUSD and sETH that support folks like Synthetix, Lyra, Aelin, etc. In the past 7 days, we were able to bring 1M in TVL to the sETH-WETH pair. And we’re highly capital efficient in doing so, which should help unlock a ton of growth for those projects. The big thing though is that we’re Optimism native and the protocol is designed as a public good. 100% of fees and bribes stay in the ecosystem and go back $veVELO lockers which are primarily projects on OP. Compare that something like Curve where 100% of the bribing happens on main-net and 50% of the fees go to veCRV stakers there. If we can capture more of the TVL and volume there, the ecosystem and Optimism wins. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.8425568181818175
                },
                {
                    "author_link": "https://gov.optimism.io/u/millie",
                    "index": "12",
                    "likes": "0",
                    "time": "06/07/2022-15:27:04",
                    "content": "Got it, so I think the details around those “token swaps” would need to be hashed out at least to some degree in the body of this proposal given how many variables there may be involved. That way delegates can have a pretty clear picture as to how that allocation will be utilized. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.6875
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "13",
                    "likes": "0",
                    "time": "06/07/2022-15:31:47",
                    "content": "i’m not sure we can do that adequately, because we have to be responsive to the needs of the market. i don’t think anyone wants to force distribution for its own sake when it’s not efficient. but i want to make sure i’m addressing any concerns you might have. could you please lay out what you’re worried might occur? ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 6.383333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/Ganc",
                    "index": "14",
                    "likes": "0",
                    "time": "06/07/2022-15:33:32",
                    "content": "TVL of $15.9 mill but total volume of $238 million since only the 2nd of June. The OP/USDC pool has the most volume for OP anywhere I’m pretty sure ($3 million average daily volume since inception of the pool). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.6875
                },
                {
                    "author_link": "https://gov.optimism.io/u/millie",
                    "index": "15",
                    "likes": "1",
                    "time": "06/07/2022-15:34:07",
                    "content": "I have no worries, but I’m certain other delegates would want to know what the plans around that process are. It doesn’t seem like there is a clear plan for how the OP will actually be paired with the partner tokens effectively and that’s what my question is concerned with. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.789285714285715
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "16",
                    "likes": "0",
                    "time": "06/07/2022-15:35:23",
                    "content": "so if we were to earmark some portion of those incentives for 'OP pairing\" you’d find your concerns addressed? i guess what i’d say is that if others have a specific concern about a lack of clarity in our plans beyond what we’ve outlined in the proposals and comments, they should raise them. if you’re satisfied, then as far as i can tell there’s not much cause to impose an arbitrary earmark for its own sake. if everyone wants token pairing (and again, please stay tuned for a broader proposal we think will dramatically help OP), we should devote the entire allocation to it, i.e., commit all of the allocated OP to LPs versus using them as incentive payments If high-priority, large protocols, say, have POL on another chain and just need convincing to migrate over, we shouldn’t limit ourselves to OP pairing (especially if they’re stablecoin protocols!) as a potential use of granted OP when the broader upside of bringing them over is substantial ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.7976190476190474
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "17",
                    "likes": "2",
                    "time": "06/07/2022-15:45:45",
                    "content": "this, by the way, owing in part to substantial voting and incentivizing we’ve done (as well as core protocol design), which has led us to leapfrog Uniswap and Curve in efficiency and aggregator routing despite our threadbare budget now consider the high requirements of many high-throughput OP protocols for deep liquidity and low-slip trading and the incipient need to get that sorted before the next swell of user interest and you start to see just how much this grant could do for the OP eco. we’re well positioned to be the top store of liquidity here, acting primarily as a public good (with no private funding!) for the benefit of Optimism ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 6.029999999999999
                },
                {
                    "author_link": "https://gov.optimism.io/u/millie",
                    "index": "18",
                    "likes": "1",
                    "time": "06/07/2022-15:46:32",
                    "content": "I’m sure other delegates will chime in soon don’t worry haha  Yes I would like to see how much is earmarked for token swaps given that you will essentially be selling OP to who ever you plan on partnering with and there are many variables involved in that process. Personally I think that part of the allocation should be minimal given how opaque and discretionary that process would be, but that’s just my opinion. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.734375
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "19",
                    "likes": "0",
                    "time": "06/07/2022-16:12:48",
                    "content": "taking it from the discord:-  |Locking Incentives|450,000| |Flywheel Incentives|1,350,000|  This a huge amount of token just for LP incentives.  Relay Building and Auditing \t600,000  is this for development of this feature, right ? and again, your incentives are not clear. In this current form, this will be an easy No for me. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.06904761904762
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "20",
                    "likes": "0",
                    "time": "06/07/2022-16:26:45",
                    "content": "These aren’t entirely LP incentives. Locking incentives are incentives to lock VELO as veVELO and claim Velo voteshare. Flywheel incentives are in part LP incentives, or they may be distributed in the form of paired OP within an LP, which as far as I can tell hasn’t been an option explored by any other proposal but which we believe carries massive benefits, which we’ll elaborate on in governance this week. I’ll say this again: if all people are asking for is an up-front demarcation between LP incentives and LP pairing, we can do that if it gets to yes. We just don’t think it makes a whole lot of sense. All of this will be co-incentivized by us following an ongoing program. The relay section is to solicit outside help in the development and auditing of this additional feature, which would be a first-of-its-kind addition to a dex. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.421875
                },
                {
                    "author_link": "https://gov.optimism.io/u/anonfounder",
                    "index": "21",
                    "likes": "0",
                    "time": "06/07/2022-16:27:14",
                    "content": "Hey, are you familiar with veVELO? Locking veVELO is not the same as LP incentives. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9375
                },
                {
                    "author_link": "https://gov.optimism.io/u/anonfounder",
                    "index": "22",
                    "likes": "0",
                    "time": "06/07/2022-16:29:37",
                    "content": "this sounds great to me, I strongly support all of the work that Velodrome is doing to onboard protocols on Mainnet to Optimism. Velodrome is an OP native protocol, and unlike many of the applications I’ve been reading, are driving tangible, measurable value back to the Optimism team itself (in the form of veNFT airdrop, and ongoing revenue from txn fees and emissions.) Velodrome is a protocol’s protocol, and will be a key player in getting sufficient liquidity for new protocols without unsustainable yield farming emissions. This aligns quite well with Optimism’s support of public goods - Velodrome is one of the few applicants that is actually a public good! I will support with my personal OP, and the tokens that have been delegated to me by others. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.15668044077135
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "23",
                    "likes": "1",
                    "time": "06/07/2022-16:32:03",
                    "content": "my address is public, you can cross check and verify that I am indeed using your protocol and loved it from day one. Also, I am aware of differences veVELO and LP incentives, my point is both only work short term and that is why i am against it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.791666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "24",
                    "likes": "0",
                    "time": "06/07/2022-16:35:37",
                    "content": "The veVELO locking incentives in fact have a very long-term effect, the locking of tokens for four years and participation in VELO voting. And then if lockers go on to delegate to relay, we’re now talking about delegating more votes to pools best for Optimism. This would represent high, enduring ROI for the OP community. A reminder to others reading that incentivizing a dex is unlike incentivizing most ecosystem protocols: there are many positive knock-on effects for the ecosystem when you support the liquidity hub. This isn’t speculative benefit; it’s real, and it’s immediate. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 7.054545454545455
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "25",
                    "likes": "0",
                    "time": "06/07/2022-16:41:22",
                    "content": "Understood and it might work in bringing long term liquidity but we dont know for sure. My suggestion would be -break this into 2 or more proposal -remove the relay development token as Phase 1 funding is not for dev work and -provide more information on co-incentives(are you willing to allocate equal amount of Velo as a co-incentives). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.416666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "26",
                    "likes": "0",
                    "time": "06/07/2022-16:43:29",
                    "content": "We’ve seen other proposals include this or some cleverly designed attempts to funnel (eg retro rewards for ‘early users’ of a 10-DAU protocol) and as far as I can tell the limitations were more stringent for Phase 0 (which, btw, we did not participate in). Could you please direct me to the guidelines for this phase? We looked and could not find anything. What’s your rationale for breaking into two proposals, and what is your implied ‘limit’ for number of tokens that ought to be requested? We’ve seen some pretty sizeable asks go through. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.826388888888889
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "27",
                    "likes": "0",
                    "time": "06/07/2022-16:52:32",
                    "content": "here’s one you yourself approved, for instance, Infinity Wallet, for 500k OP – plenty of development and marketing costs embedded here, including an outright airdrop to the tune of 3 OP per wallet  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving feedback on proposal",
                        "3rd party or author is advertising proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "28",
                    "likes": "3",
                    "time": "06/07/2022-17:06:34",
                    "content": "    jackanorak:  Could you please direct me to the guidelines for this phase? We looked and could not find anything.   from proposal side you right, you have followed the template and there is nothing that needs to be changed and you read more about Phase 1 here:- Governance Fund Overview | Optimism Docs  What’s your rationale for breaking into two proposals  great question, your first proposal will act as base for your second proposal, it will be easy to judge if the funds were indeed used in a valuable way.  and what is your implied ‘limit’ for number of tokens that ought to be requested  frankly hard to say and that is why i focus on multiple proposal, data is best evidence  We’ve seen some pretty sizeable asks go through.  I am not which one you are referring to but max i have seen is 1M, apart from yours and barn bridge, i havent any others regarding Infinity wallet, you can read my comment why i supported it. But i am happy to write it one more time as you have spend some time going though my approvals. Its a desktop wallet, we dont have that many desktop wallet in the market which support complete defi integration. 45% is not for dev of the wallet but rather for DApps development on top of their own wallet. 40% is for fee rebate to those DApps and for user on boarding. sure, they will use few Ks for their own dev but their market is totally different, their user base is different and comparing them with Velo is like comparing potatoes with onions ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.172371031746032
                },
                {
                    "author_link": "https://gov.optimism.io/u/homelukai",
                    "index": "29",
                    "likes": "1",
                    "time": "06/07/2022-17:45:14",
                    "content": "I would love to support Velodrome this is sound great ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.833333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "30",
                    "likes": "0",
                    "time": "07/07/2022-00:44:23",
                    "content": "V much appreciate the feedback. Reverted this to draft for this round and look forward to more discussion. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/fierydev",
                    "index": "31",
                    "likes": "0",
                    "time": "07/07/2022-04:05:17",
                    "content": "I support this! Velodrome is a Solidly fork, a clear winner! Time for governance wars!  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.390625
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "32",
                    "likes": "0",
                    "time": "07/07/2022-06:54:42",
                    "content": "Thank you. I really want to support Velo but I am also vocal against proposal focusing on spending dev and liquidity rewards. Seeking feedback from others is one way to go and amend the proposal as per their suggestion. Given that sometime, few project as bound by their protocol and liquidity reward is only feasible option there and in that I would expect exact $ co-incentive match from their side. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.3125
                },
                {
                    "author_link": "https://gov.optimism.io/u/Ganc",
                    "index": "33",
                    "likes": "0",
                    "time": "07/07/2022-14:29:32",
                    "content": "To add to your point about traction, it looks like Velodrome has the highest activity on Optimism judging by data on Dexscreener. That’s all gas consuming. TVL might not be the best metric to look at when judging traction especially in a deep bear market. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/millie",
                    "index": "34",
                    "likes": "0",
                    "time": "07/07/2022-16:11:14",
                    "content": "I think it’s safe to say VeloDAO has a good track record of incentive matching by airdropping a portion of the initial VELO supply to $OP airdrops recipients. They also designed their tokenomics’ such that it emits at a rate of 3.75% in perpetuity to the gauges since launch day (decreasing linearly every week). All those emissions will make their way into hands of the communities of protocols on Optimism, regardless of whether this phase 1 proposal passes or not.  Screen Shot 2022-07-07 at 12.01.47 PM895×273 24.8 KB   docs.velodrome.finance    Velodrome Finance: The liquidity base-layer of the Optimism ecosystem. Velodrome Finance is an automated market maker (AMM or simply, decentralized exchange) on Optimism L2 blockchain.      I’m still curious as to the plan around the largest allocation of the proposal though (to supply the $OP as liquidity in Velo pools). That part of the proposal is a bit of a question mark for me but other wise I would be in support of the proposal for the most part. ",
                    "links": [
                        "https://docs.velodrome.finance/tokenomics#emissions",
                        "https://docs.velodrome.finance/tokenomics#emissions"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 6.208333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "35",
                    "likes": "0",
                    "time": "07/07/2022-16:54:25",
                    "content": "    millie:  I think it’s safe to say VeloDAO has a good track record of incentive matching by airdropping a portion of the initial VELO supply to $OP airdrops recipients. They also designed their tokenomics’ such that it emits at a rate of 3.75% in perpetuity to the gauges since launch day (decreasing linearly every week).   I agree with all your point, but help me understand this, Millie. What they have done in the past or planning to do in the future, how is that related to Phase 1 proposal ? Their airdrop was a initiative to attract user and I dont see how mentioning their VeloDAO is any supporting argument here ? Same goes to their token economics, should we discuss project internal structure here?. I love the project and I use it regularly, i also got the airdrop but i dont see a connection here. From my side, I am only looking at the proposal and how a team is planning to use the requested token. If they are planning to use the token as LP reward, it must be matched with Velo and that amount of dev is also no from me. Of course, this is just my opinion and willing to discuss this more if needed. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.816666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/millie",
                    "index": "36",
                    "likes": "0",
                    "time": "07/07/2022-17:04:19",
                    "content": "(by VeloDAO I meant Velodrome DAO btw) I think my point was that the emissions are going to pools on Optimism and increasing the liquidity on OP as a whole by allowing arbitrage opportunities which generate fees. So I’m not concerned that they won’t be matching incentives since the emissions are already set and will continue to reward Optimism LPs whether this proposal passes and long afterward as well. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.375
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "37",
                    "likes": "0",
                    "time": "07/07/2022-17:27:06",
                    "content": "    millie:  they won’t be matching incentives   That is just fine, it was just a suggestion and I am not gonna insist on that. May be I am missing something which others will see and support this proposal as it is. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.541666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/Defi_LATAM_axlvaz",
                    "index": "38",
                    "likes": "0",
                    "time": "12/07/2022-14:20:15",
                    "content": "Highlights:  The amount of funding requested is very high. Incentivizing other protocols to integrate Veledrome does not seem appropriate to me, as those protocols could also apply for a grant through this government. Veledrome is a fork of Solidly, no audits yet. Knowing all the problems Solidly had in FTM they should at least be audited.  I think they need to rethink their proposal. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.235833333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "39",
                    "likes": "0",
                    "time": "14/07/2022-21:57:15",
                    "content": "    Defi_LATAM_axlvaz:  Incentivizing other protocols to integrate Veledrome does not seem appropriate to me, as those protocols could also apply for a grant through this government.   This is such a valid point. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party or author is advertising proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "40",
                    "likes": "2",
                    "time": "14/07/2022-22:12:59",
                    "content": "code4rena coming live with its audits shortly, and the contracts are entirely open sourced on etherscan.  Incentivizing other protocols to integrate Veledrome does not seem appropriate to me, as those protocols could also apply for a grant through this government.  Sorry, this doesn’t make any sense. That logic would invalidate the roughly 20% of approved distribution of OP for ecosystem & integration (why give OP to protocol X to incentivize protocol Y to integrate and use its product when protocol Y could ask for integration subsidies itself) as well as a chunk of the 25% user incentives where the users also happen to be different protocols. I also don’t understand what you mean by other protocols integrating Velodrome. Would love to see a clearer explanation of what exactly the problem here is. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.093276515151515
                },
                {
                    "author_link": "https://gov.optimism.io/u/Ganc",
                    "index": "41",
                    "likes": "0",
                    "time": "15/07/2022-02:32:49",
                    "content": "TVL now $34.5 million, overtaking Curve and $1.5 million from overtaking Uniswap on Optimism. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "42",
                    "likes": "0",
                    "time": "15/07/2022-02:34:56",
                    "content": " image1359×368 119 KB  Now ahead of Perpetual Protocol ($32mm vs $28mm), which just received 9MM OP. ~600 DAU at Velodrome vs Perpetual’s ~200-300 They’re well ahead in volume, though, at ~10mm vs ~2mm last 7 day avg.         ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Netrim",
                    "index": "43",
                    "likes": "3",
                    "time": "16/07/2022-13:28:16",
                    "content": "As I am writing this, Velodrone is the number 1 DEX on Optimism by TVL. So KUDOS. Things I like about the proposal:  Actual KPIs for each section Clear and defined percentages  Things I don’t like about the proposal:  I think token amount is a bit too big for my taste, but I understand it’s based on 4 underlying requests. With Relay being the one I would be against. As I understand veVELO, it’s not clear to me how the incentives will be matched exactly. I think a great addition to the proposal would be having actual matched incentives from Velodrone Team. Checking Velodrone docs I see you have reserved 10% of VELO to the Team and 24% to Protocol/DAOs. The proposal would be superior with a very clear statement of matching incentives.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 6.072222222222222
                },
                {
                    "author_link": "https://gov.optimism.io/u/Netrim",
                    "index": "44",
                    "likes": "2",
                    "time": "16/07/2022-18:25:08",
                    "content": "Follow up question to myself. Since the template doesn’t include the information, did Velodrome receive in the past or will receive OP directly from OP Labs as part of their Partner Funds? I see you already announced it on Twitter https://twitter.com/VelodromeFi/status/1545434763951017986 ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.625
                },
                {
                    "author_link": "https://gov.optimism.io/u/dregan",
                    "index": "45",
                    "likes": "1",
                    "time": "26/07/2022-10:15:23",
                    "content": "The Velodrome project is a good project i think it,s good for the users the get a drop off op ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/homelukai",
                    "index": "46",
                    "likes": "0",
                    "time": "30/07/2022-06:50:58",
                    "content": "Velodrome is the number 1 DEX on Optimism !!! , This will bring a lot of TVL into OP I support Velodrome ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "47",
                    "likes": "0",
                    "time": "13/09/2022-21:41:55",
                    "content": "Just checking in to see if you would like this proposal to be evaluated in Voting Cycle #6 according to the updated grant proposal template? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "48",
                    "likes": "0",
                    "time": "13/09/2022-21:43:12",
                    "content": "hey @lavande , thanks for the heads up. this one’s on ice indefinitely. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                }
            ]
        }
    ],
    "group_index": "145"
}