{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/dont-make-quest-a-large-criteria-for-airdrop-2/3770",
            "title": "Don't make Quest a large criteria for airdrop 2 ",
            "index": 3770,
            "category": [],
            "tags": [
                "airdrop"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/bangrygoose",
                    "index": "1",
                    "likes": "29",
                    "time": "23/10/2022-12:15:26",
                    "content": "I’m of course aware the next airdrop criteria is not public and likely won’t ever be, but after seeing Quest I’m worried about its potential use to determine a portion of airdrop 2. For example, if a wallet completes the quest(s), and has no organic transactions after, then this should be excluded from drop 2 because they’re clearly just coming for handouts. As a long time user of Optimism, I feel pressured to do the Quests because of the presumption it will be used for drop 2, but I’ve already used the majority of protocols live on OP, and done most of the tasks organically so am not about to jump through a set of hoops for an NFT to say so. Wouldn’t it have made sense for past transactions to be eligible? Quest is a good idea to get people bridging and trying out OP, I just hope that existing users doing many natural txs will not be snubbed by not completing it. I am not against giving Quest completooors any OP. Just dont waste it. Also please decentralize the sequencer. Thanks. nb. I am aware this probably come across as ‘muuuh make airdrop requirements to what my wallet does’, but all you have to do to see the general attitude of questooors is go to any protocols discord and look at all the posts saying ‘I did the task wen nft, can i withdraw now’. I have seen very little posts like ‘hey this protocol is cool how does it work’. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.629635167464116
                },
                {
                    "author_link": "https://gov.optimism.io/u/TriaxialTick5",
                    "index": "2",
                    "likes": "4",
                    "time": "23/10/2022-14:52:52",
                    "content": "Don’t be such a killjoy.  I enjoy quests. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "3",
                    "likes": "3",
                    "time": "23/10/2022-18:21:18",
                    "content": "Given that quest will be a criteria, how would you recommend doing it ? A multiplier ? Do you think it could be used to filter the sybil. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/bangrygoose",
                    "index": "4",
                    "likes": "7",
                    "time": "23/10/2022-19:01:55",
                    "content": "Having it as an ‘extra’ would make sense to me, in the same way in drop 1 there was an allocation for several things, OPQ could be one of them for sure. I’m not suggesting they get nothing. Using it as a sybil filter would actually not be insane - if a wallet has literally only done quest and nothing else for some period of time after quests completion date then imho they should not get any allocation, as the activity proves they are not actual and active users. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.648148148148149
                },
                {
                    "author_link": "https://gov.optimism.io/u/TheDoctor",
                    "index": "5",
                    "likes": "3",
                    "time": "23/10/2022-19:56:31",
                    "content": "I agree and get your point. It’s not going to help governance. I don’t see most DeFi users caring about governance. They’re biased. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/goluis",
                    "index": "6",
                    "likes": "2",
                    "time": "23/10/2022-22:40:31",
                    "content": "    bangrygoose:  Having it as an ‘extra’ would make sense to me, in the same way in drop 1 there was an allocation for several things, OPQ could be one of them for sure. I’m not suggesting they get nothing. Using it as a sybil filter would actually not be insane - if a wallet has literally only done quest and nothing else for some period of time after quests completion date then imho they should not get any allocation, as the activity proves they are not actual and active users.   As a user of the network, I agree with your approach, I hope that if Quests are used for eligibility criteria, it will be in a very small proportion. At this point Optimism should have resorted to Rabbithole instead to warn the Sybil ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.420833333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/boots1",
                    "index": "7",
                    "likes": "0",
                    "time": "24/10/2022-01:51:35",
                    "content": "    bangrygoose:  nothing else for some period of time after quests completion date then imho they should not get any   I totaly agree in this question. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "8",
                    "likes": "2",
                    "time": "24/10/2022-15:47:29",
                    "content": "    bangrygoose:  Using it as a sybil filter would actually not be insane - if a wallet has literally only done quest and nothing else for some period of time after quests completion date then imho they should not get any allocation, as the activity proves they are not actual and active users.   If a user wants to complete all the quest then they need around $800ish in their wallet and if their primary goal is to complete all OPQ on multiple wallet then most likely they will use the same fund by moving it to different wallet. So only option is to bring more fund to the optimism chain for each wallet otherwise its much easier to filter the farmers. That why i was thinking it might act as sybil filter criteria What’s your opinion on this ? And just to clarify, I am not speculating airdrop, Sybil is a bigger problem which need some brainstorming and i thought these quest might help us with that. This logic does not apply if aztech is involved. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.7407407407407405
                },
                {
                    "author_link": "https://gov.optimism.io/u/ichnicht",
                    "index": "9",
                    "likes": "4",
                    "time": "24/10/2022-17:25:53",
                    "content": "Hmmm I think the team behind optimism has a good plan for the quest and will not throw around tokens for people that use all of the protcolos for 1 minute or so. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/TheDoctor",
                    "index": "10",
                    "likes": "2",
                    "time": "24/10/2022-18:30:05",
                    "content": "Don’t forget @bangrygoose 's point is “not to be a large criteria”, and I agree. But we all understand it’s OK for someone coming and completing that job to be rewarded. Some % of them will leave, but some others may stay around. My point is: Is that a useful job for gaining long-term users on OP ecosystem? I don’t think so, but I understand we are too early and there are just a few apps.     OPUser:  If a user wants to complete all the quest then they need around $800ish in their wallet and if their primary goal is to complete all OPQ on multiple wallet then most likely they will use the same fund by moving it to different wallet.   I don’t know well what happened by airdrop 1, but in this case you have a point: Completing the quest requires so much work, not like bridging from ETH to OP that can be done super fast.     OPUser:  And just to clarify, I am not speculating airdrop, Sybil is a bigger problem which need some brainstorming and I thought these quest might help us with that.   +1 no caring or speculating about the airdrop. Anyone, not selling must think about the long-term and sustainability. I respect everyone’s choice, but I am not on crypto for trading or to end up with more fiat. I am here for a long way towards decentralization. Sybil’s attack is not an easy problem to solve. I like some approaches like this one I need to look more into : https://coinpassport.net/  but I think the hash input must be large and hard to guess and the trusted party must be decentralized. Vitalik has written about it several times. A social recovery wallet… So much exited work to do after season 2 ends. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.8309082892416235
                },
                {
                    "author_link": "https://gov.optimism.io/u/Mcd",
                    "index": "11",
                    "likes": "1",
                    "time": "24/10/2022-22:31:59",
                    "content": "They are good to recognition and experience these apps and OP network , but  most of them have rewards for continue using them, if their rewards attractive for users, they can continue to use them or if not they will not of course, mustn’t forget  peoples take place in crypto ecosystem for saving their money or increase its amount, we are in bear market conditions and because of that using some of these app can cause loosing money because of price volatility about from token holding. In short, it’s all about winning or losing and risk perception. the reward must be worth the risk taken, Many transaction fees and time spent should be taken into account in all these evaluations. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/acermacrophyll",
                    "index": "12",
                    "likes": "2",
                    "time": "25/10/2022-00:00:11",
                    "content": "Good point. On the contrary, does anyone know anyone actually named “Sybil”? It seems like bad luck now to have a word that used to be a human name is now a predatory and negative adjective in defi. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.7
                },
                {
                    "author_link": "https://gov.optimism.io/u/vanzoo",
                    "index": "13",
                    "likes": "6",
                    "time": "25/10/2022-11:45:58",
                    "content": "Quests are fun and educate people. The harder, the better people eligible for airdrops ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.166666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/stalker",
                    "index": "14",
                    "likes": "2",
                    "time": "25/10/2022-13:55:06",
                    "content": "“I feel a pressure” - the best phrase, i feel the same. I feel i must to do these quests to not to miss the airdrop ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/Spareren",
                    "index": "15",
                    "likes": "2",
                    "time": "25/10/2022-15:55:01",
                    "content": "Just wanted to chime in and say i agree about feeling the «pressure» for doing those quests. Sure it can be a fun way to explore Optimism for newcomers, and maybe reward them for it too, in some ways. As a active user and LP and staker in many of the big protocols on Optimism, im ofcourse biased towards rewarding active usage. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.095238095238096
                },
                {
                    "author_link": "https://gov.optimism.io/u/Mark",
                    "index": "16",
                    "likes": "3",
                    "time": "26/10/2022-20:34:05",
                    "content": "Do the quests, for the good of community, not some airdrop hunter’s pipe dream. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/satoshi",
                    "index": "17",
                    "likes": "1",
                    "time": "29/10/2022-08:42:20",
                    "content": "i consider myself as someone who is really interested in optimism but i have done none of these quests. what about communicating a very silly task for a airdrop, which none real OP holder would do? f.e. send 1 OP to 0000x adress. everyone who does this in the first 24H will get just 20% of airdrop 2 bc it´s very likely she/he is a airdrop farmer? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.05
                },
                {
                    "author_link": "https://gov.optimism.io/u/Tiki666",
                    "index": "18",
                    "likes": "2",
                    "time": "30/10/2022-09:46:33",
                    "content": "I agree with you at some degree, I think the quest should be a small part of the airdrop and most going to repeat users that use various apps often. I have to say the quest and anticipation for the airdrop is a clever way to get traffic on the chain. I love optimism veledrome but I’m not a fan of synthetix for instance. While staking there for two weeks is the longest quest. I mean it sux for all of us in some way, I guess we don’t get to decide though. I’ve been into crypto for years but I have only been using defi since the start of the year. I never really had to deal with expensive gas and I hopped straight onto polygon pretty much. I came here for something different a couple months ago and the 2nd airdrop would be nice but I love Velo. I missed the airdrop but I don’t really mind  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.574754901960785
                },
                {
                    "author_link": "https://gov.optimism.io/u/Pelon_ES",
                    "index": "19",
                    "likes": "0",
                    "time": "30/10/2022-10:53:26",
                    "content": "I get ur point about the Quests but having that option to be eligible for the OP Airdrop is hood bcuz maybdd we some want to be able to be involved but can’t although i know donf tasks r not long and stuff but having dif ways of interacting is good n can potentially bring more ppl to get more involved more in depth. But I knw wat ur saying that one shudnt get unnoticed or b un eligible for not doing the quests n stuff but those individuals that u say u seen just posting those comments don’t mean that everyone who does the quests have that same mentality/idea. What would be some possible solutions that the OP or anyone in general should do for what u r pointing out here? I would like to knw more tho cuz I try to be involved but sometimes I’m not able too cuz of wrk n all but we try u knw. Do u think if the OP team gives less priority to those only doing the quests for an airdrop n give more to those who complete tasks n go based on the number of tasks they complete make them eligible for it? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.801535087719298
                },
                {
                    "author_link": "https://gov.optimism.io/u/boots1",
                    "index": "20",
                    "likes": "1",
                    "time": "31/10/2022-02:22:44",
                    "content": "I dont agree in this proposal. You have to earn the airdrop and interact with the diffrent plattforms and be involded in the community. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Talaz",
                    "index": "21",
                    "likes": "5",
                    "time": "31/10/2022-09:18:24",
                    "content": "I discovered the Optimism ecosystem with the quests and it showed me how easy it was to get started, how fast, and how affordable it was. Even if this is a requirement for a future airdrop, I think that a significant portion of those who complete the quests get excited and stay on Optimism. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.236111111111111
                },
                {
                    "author_link": "https://gov.optimism.io/u/TheDoctor",
                    "index": "22",
                    "likes": "1",
                    "time": "31/10/2022-11:11:32",
                    "content": "Welcome @Talaz , I’m glad to hear that. Optimism vision is not just about a platform. The most exciting part is the experimentation on governance to create a new way to build things, where profit and social impact are both possible. It can be overwhelming that much information, but we are here to help those of you willing to participate in the collective. Here’s a working constitution.    Working Constitution of the Optimism Collective 🏛 Governance       Best statement! This alone makes me believe Optimism and the collective that will govern is one of the best models in Web 3     ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.174873737373737
                },
                {
                    "author_link": "https://gov.optimism.io/u/TheDoctor",
                    "index": "23",
                    "likes": "2",
                    "time": "31/10/2022-11:23:22",
                    "content": "    satoshi:  i consider myself as someone who is really interested in optimism but i have done none of these quests. what about communicating a very silly task for a airdrop, which none real OP holder would do? f.e. send 1 OP to 0000x adress. everyone who does this in the first 24H will get just 20% of airdrop 2 bc it´s very likely she/he is a airdrop farmer?   Hi, So far I just have only the Uniswap NFT, because I needed to swap. I like your idea. I have played some games with tokens and addresses and it can be fun and educative (I won’t burn an OP token though haha). The thing is that airdrops are massive and must have a well-tested and efficient method. And most importantly: in a game theoretical way so airdrops are for the people most likely to contribute to the ecosystem. My advice is to enjoy building or supporting OP with the thing you love to do most. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.7631578947368425
                },
                {
                    "author_link": "https://gov.optimism.io/u/ethboi",
                    "index": "24",
                    "likes": "1",
                    "time": "31/10/2022-12:28:30",
                    "content": "Seems obvious it’s going to be a part of criteria the next Airdrop. They are pretty all “easy”. I see them as being part of the multiplier for OP rewards, like in the first drop. I think something like, do the quest (small multiplier) then come back and use the protocol as well, for a greater multiplier would be a good compromise. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.046296296296296
                },
                {
                    "author_link": "https://gov.optimism.io/u/Cardo",
                    "index": "25",
                    "likes": "0",
                    "time": "31/10/2022-14:52:28",
                    "content": "Still do the quest bro. You don’t want to miss out on the multiplier  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lionmountain",
                    "index": "26",
                    "likes": "1",
                    "time": "02/11/2022-07:12:47",
                    "content": "I think the quests are a good opportunity to get to know the protocol and use it. It takes quite some time to complete it and therefore I think it‘s a great approach to be able to filter out sybils. I like it and think it‘s a huge step in the right direction  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.321428571428571
                },
                {
                    "author_link": "https://gov.optimism.io/u/bangrygoose",
                    "index": "27",
                    "likes": "1",
                    "time": "02/11/2022-10:12:20",
                    "content": "Agree, but I would argue a wallet which has literally only done quest tasks is a Sybil. If it were up to me they’d also need a considerable amount of organic regular transactions. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.166666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/gunboats",
                    "index": "28",
                    "likes": "5",
                    "time": "28/11/2022-12:40:33",
                    "content": "Using Quests as criteria is a bad idea, when a lot of quest is sybilled that’s very noticeable. As an example, here is sybil detected on Synthetix Quest.  image1322×569 44.1 KB  (context: It is nearly impossible to have same exact SNX rewards even with same amount of SNX due to how debt fluctuation works, yet there are 1.9k+ addresses that have duplicated amount of rewards). Reference query There is need for better criteria if quest is considered. (user retention etc.)         ",
                    "links": [
                        "https://dune.com/queries/1664450"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.661458333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/hait",
                    "index": "29",
                    "likes": "1",
                    "time": "28/11/2022-18:05:17",
                    "content": "I think they might become part of the community after the airdrop.  First of all, I think that I was qualified to participate in the community by participating in the airdrop. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/gunboats",
                    "index": "31",
                    "likes": "0",
                    "time": "28/11/2022-23:19:37",
                    "content": "I really, really wished that is the case, however experience from moderating Synthetix and Lyra Discord server ended with people just trying to get in quest and ditched as soon as they done with it. And this is saying lightly because this isn’t worst thing they done. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.333333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/Erudraeth",
                    "index": "32",
                    "likes": "3",
                    "time": "29/11/2022-10:18:55",
                    "content": "The quests take quite a lot of time and money to be invested in the network. If someone is willing to do all the quests then they’re going to be familiarising themselves with the ecosystem and may be much more likely to stick around in the future. Even if they come just for the NFTs, it would be interesting to know whether they stay. I suspect many will. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.458333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/OrganicOPuser",
                    "index": "33",
                    "likes": "4",
                    "time": "29/11/2022-16:01:37",
                    "content": "Lots of good takes in here in regards to how just looking at Quest criteria alone isn’t a great criteria for airdrops. Just wanted to add my 2 GWEI brainstorming possible ways to modify the criteria to filter out airdrop farmers, in an equitable way… Add a multiplier factor to any Quest airdrop allocation - e.g., the amount of gas you used on optimism, the number of days (within a period) that you transacted on optimism. For example, if 2 wallets completed all quest tasks, but the first one only did the quest tasks on optimism and the 2nd also ‘organically’ continued to use optimism, than the 2nd wallet should get more quest-airdrop OP allocated. Sybil farmers will likely only be doing quest tasks and that’s it. If you used/spent 10x more gas or 10x the number of transactions or days using optimism, then you should get more than someone who just put in the minimum. You could also use the median or mean wallet’s gas usage/# of days, as a reference/baseline to normalize to. tl;dr I think rewarding optimism gas usage is a fair and relatively more organic metric that is not easily gamed, and the gas (aka fees paid) directly helps optimism, so it’s a good thing to incentivize. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.37390350877193
                },
                {
                    "author_link": "https://gov.optimism.io/u/cyberduck",
                    "index": "34",
                    "likes": "3",
                    "time": "29/11/2022-16:21:32",
                    "content": "I think the quests are an awful way to distribute OP, even after cleaning up off sibiloors. While quests may be a good way to get some people to try out different protocols, huge majority of the questoors are in it only for the airdrop and will ditch the protocol soon after completion judging by the interaction with questoors in different discord servers. I recommend against using quest NFTs as a way of distributing OP, many have gotten the NFTs off secondary markets anyway with zero to none intention to use the protocols. OP should focus on protocol level incentives from grants as adoption as that has a higher impact of rewarding and onboarding aligned users. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.525
                },
                {
                    "author_link": "https://gov.optimism.io/u/goluis",
                    "index": "35",
                    "likes": "0",
                    "time": "30/11/2022-03:09:01",
                    "content": "Very good, I agree!! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/acermacrophyll",
                    "index": "36",
                    "likes": "1",
                    "time": "24/12/2022-02:24:51",
                    "content": "Is there a way to filter out quest NFT holders that did not actually complete the quest? Is there a way to validate that Quest NFT holders actually completed the quest? This seems key to define esp. after seeing on-chain evidence of a single wallet purchasing like 20 of the same Quest NFT from secondary markets, presumably to hedge multiple wallets for airdrop ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.698979591836735
                },
                {
                    "author_link": "https://gov.optimism.io/u/MattL",
                    "index": "37",
                    "likes": "4",
                    "time": "24/12/2022-06:25:23",
                    "content": "I completely agree with Goose’s points about using the OP quest as a criteria for airdrop 2. While the OP quest program may have increased raw metrics, I highly doubt it has done anything to increase real user engagement… People come into various Discords, scream about how they have a job to do and they need to get the NFT, and then they run off afterward. TLDR on this side of things: giving out OP to armies of people who simply farm NFT’s is a very bad idea. There’s nothing more to it than that. Please don’t do this. Instead of focusing on collecting small NFT’s, what protocols need is support from the Optimism Foundation in areas such as development, marketing, fundraising, and growth. The Optimism Foundation can then connect protocols with the right partners for integrations. I’ve had the pleasure of working with folks at Optimism on this - Binji, Scifer, and the other people I’ve worked with on the Synthetix side who have been instrumental in bringing new protocols to Optimism and setting them up. So yeah, that’s my two cents on how NFT farmers are not beneficial to the industry and how the foundation shouldn’t use them as criteria for any airdrops. Something something for the sake of our industry something something. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.9485802658879585
                },
                {
                    "author_link": "https://gov.optimism.io/u/Pelon_ES",
                    "index": "38",
                    "likes": "2",
                    "time": "01/01/2023-15:22:02",
                    "content": "I wouldn’t say they r an awful way to distribute any OP airdrop but I do know it has is pros and cons Wen it comes to the aftermath once the airdrop happens which I think the team wouldn’t have made the quests part of the airdrop if they didn’t think it would be beneficial but from wat I’ve gotten to learn within the time n ppl commenting in regards this both in here and from discord many we’re only doing them to be eligible to take part in the distribution but there was also. Huge amount that their interest wasn’t just the airdrop but an opportunity to be part of a growing community in where they can contribute on making it better as it grows. There’s always going to be ppl that r looking for airdrops to just take profit if they can from them and it’s like any other thing we can point that out or try to think of a solution in which it wud just be beneficial to those who r committed n r involved with the community. I’m sure the team has taken this in mind and stuff which wud be something to look forward too, but the quests r a good way to give the opportunity to those who potentially can’t be as active as others in discord n contribute a lot to the OP network. Just taking them out of the picture shouldn’t be the easy solution, many great ideas on how it can be handled have been given which is great. Being active tho in any way possible and Getting involved for the right reasons are in a way being noted by the team over those who just complete couple quests n then not be involved at all after that.  Happy new year to everyone and the OP team n we continue to support everyone regardless of their personal opinion. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.205653473510616
                },
                {
                    "author_link": "https://gov.optimism.io/u/blairdrop.eth",
                    "index": "39",
                    "likes": "1",
                    "time": "03/01/2023-07:32:29",
                    "content": "I’d imagine it’d be very easy to filter them out. All they’d have to do is confirm whether the user had interacted with the address of a specific contract within the quest’s valid time window. The team also proved to be competent at filtering out bad actors last airdrop. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.363333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/tvhuffel",
                    "index": "40",
                    "likes": "2",
                    "time": "08/01/2023-17:56:05",
                    "content": "Idk, I honestly arrived here because of the quests and have enjoyed doing them very much. They forced me to dig deeper in subjects I never had the occasion to really learn about. I of course do feel incentivised to do so because of the upcoming drops but that doesn’t make me believe any less in the potential for this project and isn’t that the purpose of this whole airdrop anyway? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.808333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/Crypt0x",
                    "index": "41",
                    "likes": "1",
                    "time": "10/01/2023-08:27:51",
                    "content": "Hi Let me some time to achieve them  I’m discovering optimism for a few weeks, still have time to reach 15 nfts. I’m also discovering the governance forum, will be more active in it. And happy new year to everybody! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.137121212121213
                },
                {
                    "author_link": "https://gov.optimism.io/u/wasFree",
                    "index": "42",
                    "likes": "3",
                    "time": "10/01/2023-11:35:02",
                    "content": "In my opinion, Optimism Quest is an excellent way to attract new users to join Crypto world. so, be nice to the new users in Optimism. It’s useful that new users need time to learn how to DeFi or Purchase NFT or mint NFT. So, I think Quest should be a large criteria for airdrop 2. How to value a new users’ act is helpful to the Optimism? Collecting OATs. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.662337662337662
                },
                {
                    "author_link": "https://gov.optimism.io/u/0xCorgy.eth",
                    "index": "43",
                    "likes": "4",
                    "time": "10/01/2023-11:45:09",
                    "content": "I don’t think this is a good idea, quest activities attract a lot of new users to try using op, even if they just want to get the airdrop, they also bring a lot of funds to op. I want to propose a solution: 1, all users who transfer all tokens to other networks after participating in quest will not get the airdrop. 2, all users who participated in quest and kept their funds in op will enjoy normal multiplier airdrop. 3, all users who participated in quest and purchased op to participate in governance will get more airdrop. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.467803030303029
                },
                {
                    "author_link": "https://gov.optimism.io/u/TR3835",
                    "index": "44",
                    "likes": "2",
                    "time": "12/01/2023-19:24:31",
                    "content": "In my opinion, it would be better to drop more token for the users who did the quest by themselves than the users who buy from the NFT market. and have the multiple for the users who hold OP token or have transaction more than xxx times. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://gov.optimism.io/u/mensahsilask",
                    "index": "45",
                    "likes": "1",
                    "time": "13/01/2023-15:47:37",
                    "content": "Lazy boy said like this. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/walanor",
                    "index": "46",
                    "likes": "1",
                    "time": "16/01/2023-07:24:14",
                    "content": "But quests relate directly to activity in the wallets of the participants. Wouldn’t the result be the same? Or do you mean ignore those who purchased the NFTs? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.645833333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/kaizen555",
                    "index": "47",
                    "likes": "0",
                    "time": "16/01/2023-08:28:36",
                    "content": "@bangrygoose I agree with you just need more multipliers to get random people walking by ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/sqwad",
                    "index": "48",
                    "likes": "2",
                    "time": "16/01/2023-11:44:24",
                    "content": "As a genuine Quest user, but one who is also poor, i think ive done the Quests and have maybe 2 other OP transactions afterwards bcz ive been using MATIC lately (i had some bread already left on it after FTX got me luckily). I know im 1 person and cant have the protocol alter their criteria for me, just voicing my opinion to let ppl know that theres some of us (after falling victim to FTX at the worst time) who are genuine community members but are left picking up the pieces from FTX. Either way, thanks for what ALL yall do ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.742424242424242
                },
                {
                    "author_link": "https://gov.optimism.io/u/sqwad",
                    "index": "49",
                    "likes": "1",
                    "time": "16/01/2023-11:46:16",
                    "content": "Not a terrible take (with some tweaks) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/sqwad",
                    "index": "50",
                    "likes": "1",
                    "time": "16/01/2023-11:47:48",
                    "content": "Actually you are spot on here. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/1Brit",
                    "index": "51",
                    "likes": "0",
                    "time": "16/01/2023-12:25:59",
                    "content": "I just enjoy quests and learn new protocol ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.34090909090909
                },
                {
                    "author_link": "https://gov.optimism.io/u/valosh",
                    "index": "52",
                    "likes": "1",
                    "time": "16/01/2023-12:30:19",
                    "content": "Even if we do not know the criteria of the second drop, it is very likely that the regular activity on chain will be privileged as criterion. This was already a criterion for the first drop. Also, I think that the quests will not be the main criterion. Otherwise, it leaves room for many bots to come farm the drop. As Optimism matures, the eligibility criteria will have evolved naturally. We can trust the team for that  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.726190476190476
                },
                {
                    "author_link": "https://gov.optimism.io/u/Floyd11",
                    "index": "53",
                    "likes": "1",
                    "time": "16/01/2023-12:49:13",
                    "content": "In order to complete all of the quests, a user would need to have around $1000 in various wallets. If their goal is to finish all of the Optimism Quests on multiple wallets, they would likely use the same funds, moving them between wallets. The only solution would be to add more funds to the Optimism chain for each wallet, otherwise it would be too easy to identify and filter out farmers. That’s why I thought that this could be used as a way to filter out Sybils. What is your opinion on this? And to be clear, I am not suggesting an airdrop. Sybil is a bigger problem that requires a lot of brainstorming and I thought that these quests could potentially help with that. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.515151515151516
                },
                {
                    "author_link": "https://gov.optimism.io/u/kaizen555",
                    "index": "54",
                    "likes": "0",
                    "time": "17/01/2023-12:07:57",
                    "content": "    ichnicht:  Хммм, я думаю, что у команды Optimism есть хороший план для квеста, и они не будут разбрасывать токены для людей, которые используют все протоколы в течение 1 минуты или около того.   very well said, i completely agree ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/goluis",
                    "index": "55",
                    "likes": "1",
                    "time": "21/01/2023-00:41:24",
                    "content": "As I said before!! If Nfts per Quest enter as criteria for Airdrop. Well, let them filter those who acquired in the secondary market!! and take into account only those that were earned by completing the Quest. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.828125
                },
                {
                    "author_link": "https://gov.optimism.io/u/FractalVisions",
                    "index": "56",
                    "likes": "0",
                    "time": "28/01/2023-17:51:30",
                    "content": "I thought the quest NFT was great but in hindsight the user experience could be improved upon ten fold. These will be more related to traits on the optimist NFT for token house delegates which is an interesting use case of NFT attributes that are traded in association with a non transferable profile picture NFT. Airdrop hunters can speculate all they want but we have to wait and see what happens. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.799999999999999
                },
                {
                    "author_link": "https://gov.optimism.io/u/TriaxialTick5",
                    "index": "57",
                    "likes": "1",
                    "time": "29/01/2023-14:29:55",
                    "content": "Considering that volume of transactions skyrocketed during the period of the quest and cliffed after the quest was over, I don not think that those who participated in the quest should be punished. They deserve to be rewarded in some form. Bravo, Optimists! Bravo! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/letmehear",
                    "index": "58",
                    "likes": "0",
                    "time": "29/01/2023-15:20:53",
                    "content": "I agree with this opinion, a wallet that only enters to do 18 quests and leaves just for personal gain, and a wallet that continuously has weekly transactions on Optimisim’s ecosystem and long-term efforts should be appreciated. , I agree with the author ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.333333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/Avadakedavra",
                    "index": "59",
                    "likes": "0",
                    "time": "29/01/2023-15:21:04",
                    "content": "Can you drop your wallet to see your organnically made transactions? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/SpoonCreator",
                    "index": "60",
                    "likes": "1",
                    "time": "29/01/2023-16:09:33",
                    "content": "    OPUser:  their primary goal is to complete all OPQ on multiple wallet then most likely they will use the same fund by moving it to different wallet.   In this case, it is advisable to use a metric tied to a non-zero balance for a certain period of time. For example, counting the weeks in which the user has more than $50 in his wallet (in equivalent). The main thing is to find the right balance between what the average user can own and how much the sibyl can afford to keep on all her wallets at the same time. This criterion cannot be used alone. However, it can be used to identify suspicious addresses, and then, in combination with other criteria, draw a final conclusion. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.791666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/Mark_De.Fi",
                    "index": "61",
                    "likes": "1",
                    "time": "29/01/2023-16:33:24",
                    "content": "As for me, these Quests are an indicator that the project is interested, and so many of those who have gone through them may actually end up being interested in the project, although they were not before On the other hand I understand and partly agree, but I do not think that the quests will be the main criteria Or maybe there will be another round of airdrop, which will already take into account the number of transactions (by the way, I think it would be more logical to make it a round 3 By the way, I think it’s important to mention the problem of multi-accounts ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.8143939393939394
                }
            ]
        }
    ],
    "group_index": "306"
}