{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/growth-experiments-proposal-cycle-11-archly-finance/5596",
            "title": "[Growth Experiments Proposal][Cycle 11] - Archly Finance ",
            "index": 5596,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Grants Council"
            ],
            "tags": [
                "season-3",
                "cycle-11"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/tec05",
                    "index": "1",
                    "likes": "2",
                    "time": "14/03/2023-06:47:20",
                    "content": "Basic Details Project name: Archly Finance Author name and contact info (please provide a reliable point of contact for the project.): Tec05 (Discord: Tec#9093, Telegram: @tec05) L2 recipient address: 0x258D105F2D6a8B1c7abF85a5bF10896A7606Ac3C Which Voting Cycle are you applying for?: 11 I confirm that I have read the landing pages for the Builders and Growth Experiments Sub-Committees and that I have determined my proposal is best suited to be reviewed by the Growth Experiments Sub-Committee: [Yes/No]: Yes I understand that Growth Experiments grants are subject to a “no sale rule,” as explained in this post, and I have read the terms of the rule: [Yes/No]: Yes Project Details What are you building?: Archly is the first multichain Solidly fork (live on Arbitrum One, Arbitrum Nova, BNB Chain, Fantom, Kava, Optimism, Polygon, and Telos) to allow seamless transferring of assets and data between chains which will enable users and projects to scale out to reach new audiences via the Rainbow Road (archlyfi [dot] medium [dot] com/rainbow-road-921b13ba77ec). Why do you believe what you are building is going to succeed?: We believe this will succeed because it will simplify the user experience for users and projects to consume data and migrate their funds in an efficient manner while hiding the complexities underneath an abstraction layer (Rainbow Road) that will have a pluggable architecture to allow new features and adapters to interface with existing projects. By going this route, it enables Archly to foster an inclusive environment that any project or user can benefit from whether it is on Archly or not. How many users does your project have currently? Please include how you arrived at this estimate: Over 500 users. As a part of our expansion to new chains we distributed close to 580 veArc NFTs to users. On Telos, our original chain our 30 Day unique active wallets sits at 147 with 3.69K transactions over the same period (dappradar.com/telosevm/defi/archly). How will receiving a grant enable you to further the mission of maximizing the number of users interacting with Optimism? Please include a step-by-step flow of how you imagine this grant can lead to a greater number of user interactions with Optimism: Our plan is to extend our Rainbow Arc Initiative (archlyfi [dot] medium [dot] com/archly-rainbow-arc-a22f0126a493) that we are currently running on Telos to Optimism. This initiative helps engage users by distributing OP tokens as incentives to our veArc holders. It also helps boost new and existing projects by including a Boost incentive to projects to help grow their liquidity on Optimism by boosting their bribe by 25%. Tell us about the users you plan to target with this grant. Include any defining characteristics that will help you identify and target them.: The users that we plan to target are new and existing veArc holders and partner projects. The veArc holders are easily identified as they are required to vote for pools to earn the incentives that would be given out as a part of this grant. Our plan would also target other projects that would reach out to us to form partnerships and engage in the Archly Flywheel. How would these users interact with Optimism? For how long?: From 1 week up to 4 years. Our plan is to use the incentives to help grow liquidity for Archly on Optimism, which would lead to an increase in trading fees and bribes that would take over the place of the granted incentives encouraging longer lock times for veArc holders on Optimism. Provide us with links to any of the following for the project:  Demo: N/A Website: archly [dot] fi Twitter: twitter [dot] com/ArchlyFinance Discord/Discourse/Community: t [dot] me/ArchlyFinance (Telegram), dsc [dot] gg/archly (Discord), archlyfi [dot] medium [dot] com/ (Medium) Github: github [dot] com/ArchlyFi Technical/Economic Documentation: docs [dot] archly [dot] fi Other:  Do you have any metrics on the project currently? (TVL, transactions, volume, unique addresses, etc. Optimism metrics preferred; please link to public sources such as Dune Analytics, etc.): DefiLlama: defillama [dot] com/protocol/archly-finance DappRadar (Telos): dappradar [dot] com/telosevm/defi/archly Who are your competitors, and are they on Optimism?: Velodrome (Yes), Thena (No), Equalizer (No) Please link to code audits (if any): Team Who are your founders?: Tec What makes your team well-suited to carry out the project described in this proposal? Tec has worked on large scale distributed services during his career at Microsoft and Amazon. Often being a member of teams of 3-4 with tasks that varied from recoding stacks in Azure to process more transactions to systems that proactively detects and fix data issues. Is this your first Web3 project?: No If not, what else have you built? (Share links, Github repository, or any other useful information.): Karma contract for staking Charm - github [dot] com/OmniDexFinance/contracts/tree/master/omnidex-karma-contracts Omnilend Contracts (Aave fork) - github [dot] com/OmniDexFinance/omnidex-lending/commits/master Grant Request What is the size of the grant request? (250k OP max): 72K How do you justify the size of the grant?: This grant will be used to encourage the growth of liquidity via direct incentives (48k) to veArc holders via bribes and boost incentives (24k) to projects for partnerships over a period of 3 months. Roadmap and Distribution Plan Describe in discrete steps how you will successfully implement your grant plan: Base Incentives (direct to veArc voters): Each week (for 12 weeks) 4k of OP will be used to bribe select public good pools to build liquidity. These pools will vary week to week based on trends and the need to increase liquidity of a pool. Boost Incentives (25% of up to $4000 in bribe match for projects): For projects (new and existing) that partner with Archly on OP. We will provide a 25% boost to the bribes provided by the project (project must bribe 4x of the the boost), use 5% of the teams veArc votes to ensure their pool receives a base level of Arc emission, and grant the project a veArc with 10K of Arc locked for 4 years for each week they earn Boost Incentives. How will the OP tokens be distributed? (please include % allocated to different initiatives such as user rewards/marketing/liquidity mining. Please also include a justification as to why each of these initiatives align with the problem statement this proposal is solving. Distribution should not include the sale of any tokens by the grantee or the use of tokens for compensation, protocol expenses, etc. See the no sale rule here): 100% of incentives (Base + Boost) will go to veArc holders on Optimism. Base Incentives: 67% Boost Incentives: 33% Over what period of time will the tokens be distributed for each initiative?: 12 weeks (3 months) Please provide benchmark milestones for this project. These milestones should guide the Optimism community on the progress of your project throughout your work on the project. Do not use distribution of the grant itself as a milestone:  Increase TVL (Month-over-Month, 4 week period) without staking measured on DefiLlama for Optimism   Month 1 (First 4 weeks)   Increase WETH-OP volatile pair TVL on Optimism to $10K Increase WETH-USDC volatile pair TVL on Optimism from $17K to $22K   Month 2 (Second 4 weeks)   Increase WETH-OP volatile pair TVL on Optimism from $10K to $15K Increase WETH-USDC volatile pair TVL on Optimism from $22K to $30K   Month 3 (Third 4 weeks)   Increase WETH-OP volatile pair TVL on Optimism from $15K to $ 20K Increase WETH-USDC volatile pair TVL on Optimism from $30K to $35K   Increase % of Arc locked in veArc (Month-over-Month)   Month 1 (First 4 weeks): Increase from 42.9778% to 45% Month 2 (Second 4 weeks): Increase from 45% to 47.5% Month 3 (Third 4 weeks): Increase from 47.5% to 50%   Increase UAW ((Month-over-Month) measured on DappRadar for Optimism   Month 1 (First 4 weeks): Increase UAW to 60 Month 2 (Second 4 weeks): Increase UAW from 60 to 70 Month 3 (Third 4 weeks): Increase UAW from 70 to 85  Please define critical milestones for this project. Critical milestones are meant to show good-faith efforts to accomplish the project. Non-completion of these milestones could lead to revocation of remaining grant rewards. Do not use distribution of the grant itself as a milestone:  Increase overall TVL without staking by 10% Month-over-Month Increase % of Arc locked in veArc by 1.67% Month-over-Month Increase UAW by 5% Month-over-Month  If the OP tokens are for direct distribution to users, why will incentivized users and liquidity on Optimism remain after incentives dry up?: They will remain as the Archly Flywheel should be in a place where the fees and bribes generated from projects and trading on Archly are compensating veArc holders at an equivalent or greater amount than the incentives. Also, Archly will help projects to build protocol owned liquidity to defend against mercenary liquidity mining via education and guidance while onboarding to Archly. Please provide any additional information that will facilitate accountability (smart contracts addresses relevant to the proposal, relevant organizational wallet addresses, etc.): | Name | Address | | :— | :— | | Arc | 0x684802262D614D0Cd0C9571672F03Dd9e85D7824 | | veArc | 0xf070654b08595f8F358Ff90170829892F3254C67 | | veArc-Dist | 0x4c01dF6B9be381BA2a687D0ED5c40039dEEaf0a9 | | BaseV1Factory | 0xBa06043a777652BAF540CcC785EDaFd94eE05b37 | | BaseV1Router01 | 0xeafBFeb64F8e3793D7d1767774efd33b203200C9 | | BaseV1GaugeFactory | 0x5A63409C88dDD327A56eEf3a3492Bb0Ce74ba795 | | BaseV1BribeFactory | 0xbc5AAF4970E50B2504C2441367B87B6F3D9Ac504 | | BaseV1Voter | 0xd9Fd10945d69053Eadd365B786977B6290fea088 | | BaseV1Minter | 0xd865043A22604Caf267422283B8601A9d546301f | Optimism Relationship Does your project solve a problem for the Optimism ecosystem? If so how?: Yes. It helps diversify liquidity by spreading liquidity over multiple projects focused on empowering projects and user to earn and do more with less upfront capital. Also at the completion of the Rainbow Road, projects and users will be able to move freely from chain to chain or setup Optimism as their home chain and still interact with Archly from either location they choose. Why will this solution be a source of growth for the Optimism ecosystem?: We are building Rainbow Road in an open and inclusive way to encourage collaboration between Archly and teams on multiple chains to make user’s interactions with blockchains such as Optimism easier by removing the complicated areas away so that the experience is frictionless and straightforward. And the best part any project on Optimism will be able to integrate and enable this experience for their users. Is your project Optimism Native?: No Confirmations I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: [Yes/No]: Yes I understand that I will be expected to following the public grant reporting requirements outlined here: [Yes/No]: Yes ",
                    "links": [],
                    "GPT-summary": "The post is a proposal for a grant from the Growth Experiments Sub-Committee for the project Archly Finance. The proposal explains that Archly is a multichain Solidity fork that allows seamless transferring of assets and data between chains. The author believes that this will succeed because it simplifies the user experience and fosters an inclusive environment. The proposal includes details on the project, the grant request, and the roadmap and distribution plan. A 3rd party could give entirely positive feedback on the proposal, extend to the proposal, or ask questions about it.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Interoperability and Scaleability",
                        "Smart contract updates",
                        "Token economics",
                        "Community and engagement"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.288712757830405
                },
                {
                    "author_link": "https://gov.optimism.io/u/SophiaK",
                    "index": "2",
                    "likes": "1",
                    "time": "15/03/2023-20:20:02",
                    "content": "    tec05:  What is the size of the grant request? (250k OP max): 180K   The grant size requested is extremely high for a project with $68k TVL and minimal presence on Optimism. Archly currently has about $558k total TVL according to DeFi Lllama, whereas the requested grant size is valued at $425k based on current OP market prices.     tec05:  100% of incentives will go to veArc holders on Optimism.   The initial distribution of Arc and veArc according to the Archly docs is:  50% to the Archly Team (15m Arc and veArc) 33.33% to Community “Telegram members”  First 10 Telegram members (1m Arc) First 35 Telegram members (9m veArc).   16.67% to Initial Bribes to “encourage voting for the initial pools by the First 35” (5m Arc)  It also appears that veArc was airdropped to Arbitrum Nova, Arbitrum One, BNB Chain (BSC), Fantom, Kava EVM, Optimism, and Polygon users. However, the “airdrop claim period is now complete” which implies it is no longer claimable. It’s not clear how many users have claimed the veArc airdrop. Based on the structure for the initial distribution of Arc and veArc, it’s impossible to justify an OP grant that gives 100% of incentives to veArc holders. ",
                    "links": [
                        "https://docs.archly.fi/tokenomics#initial-distribution"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.197777777777778
                },
                {
                    "author_link": "https://gov.optimism.io/u/tec05",
                    "index": "3",
                    "likes": "1",
                    "time": "16/03/2023-13:26:51",
                    "content": "Yes. That is the reason for applying for a growth experiment grant. We expanded to the Optimism network a little over 2 weeks ago. To help grow on Optimism and increase our presence here, we requested 180K OP. The reason behind the amount is to make sure we have enough OP per week to attract the necessary users to meet our milestones. Based on the way the grant would work we would receive 40% of the 180K OP upfront. This would amount to 72K OP which would give Archly a 4 week runway to achieve our milestones (48K OP or 12K OP/week to use as incentives for veArc holders on Optimism to encourage building liquidity via concentrated Arc emissions on Optimism and 24K OP or 6K OP/week for Boost Incentive to help attract projects and build partnerships on Optimism). At the current price of OP that’s around $175.5K, which is about 25% of Archly’s total TVL without staking and about 20% of our total TVL with staking on DefiLlama. Again the key here is growth. Upon meeting the milestone set out above, Archly will start to add to its TVL on Optimism. And when the milestones are met, then the rest of the funds will begin to be released to help continue our growth on Optimism. The portion of the grant going towards incentivizing veArc holders on Optimism can go 100% those users in a targeted manner. To get a better understanding of why this is possible, it would be best to refer to the Rainbow Road Launch article (archlyfi [dot] medium [dot] com/rainbow-road-launch-details-4539094fe4b0). To summarize the article, there was 10M Arc that were be locked into 200 veArc (50K locked Arc/veArc) originally allocated to be airdropped to users on the Optimism network. As stated in the article, users had to complete the form and join our Telegram group to be eligible for the airdrop. Once the form was closed, there were a total of 61 users that responded to receive a veArc on the Optimism network (an opportunity for us to increase our presence). Those 61 users were airdropped their veArc containing 163,935 locked Arc each (slightly over 10M locked Arc). Of the 61 veArc airdropped, 36 were done through this transaction (optimistic [dot] etherscan [dot] io/tx/0xb3fda171dd25902d8f9aec596724b396da89e4e6121a2ecd89fc36eb48b9ee0d) while, due to block size limitations, the other 25 were create between blocks 78270522 and 78273250 visible on the explorer (optimistic [dot] etherscan [dot] io/txs?a=0xf070654b08595f8F358Ff90170829892F3254C67). The number of veArc holders on Optimism has grown to 72 holders since that time. Again another area for growth. At the moment, there is no cross-pollination of veArcs across networks. So a veArc created on the Optimism network stays on the Optimism network which allows us to direct 100% of the OP granted that is allocated to incentivizing only veArc holders on Optimism. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.334280303030303
                },
                {
                    "author_link": "https://gov.optimism.io/u/MattL",
                    "index": "4",
                    "likes": "1",
                    "time": "20/03/2023-04:50:32",
                    "content": "Hello and thank you for your proposal! Throughout the application process, this forum thread will be one of the official means of communication. Please be sure to monitor it for updates over the course of the review period. At this stage, applications are mainly being reviewed for completeness, and nothing at this stage should be construed as support or opposition by any members of the Grants Council. Just had a few questions / suggestions.   Just to be 100% clear here, there isn’t a presence for Archly on Optimism at the moment, right? I don’t see any pools besides an ARC/ETH pool.   Regarding the grant request, I too think this is very high for a project of your size. As of right now this would be a grant request for almost the entire TVL of Archly. It also doesn’t seem like Optimism is much of a home base of operations for Archly, and I don’t see why / how users would stay on Optimism once the rewards were to run out.       tec05:  What is the size of the grant request? (250k OP max): 180K How do you justify the size of the grant?: This grant will be used to encourage the growth of liquidity via direct incentives (120k) to veArc holders via bribes and boost incentives (60k) to projects for partnerships over a period of 3 months.    For these, I’d highly recommend making them more specific and target particular goals by particular months. Ex: X amount of TVL by x Month. Maybe particular TVL targets for top pairs, etc.      tec05:  Please provide benchmark milestones for this project. These milestones should guide the Optimism community on the progress of your project throughout your work on the project. Do not use distribution of the grant itself as a milestone:  Increase TVL (Month-over-Month) without staking measured on DefiLlama for Optimism Increase % of Arc locked in veArc (Month-over-Month) Increase UAW ((Month-over-Month) measured on DappRadar for Optimism  Please define critical milestones for this project. Critical milestones are meant to show good-faith efforts to accomplish the project. Non-completion of these milestones could lead to revocation of remaining grant rewards. Do not use distribution of the grant itself as a milestone:  Increase TVL without staking by 35% Month-over-Month Increase % of Arc locked in veArc by 5% Month-over-Month Increase UAW by 15% Month-over-Month    I echo these same thoughts. The amount of OP distributed to Archly for this proposal is VERY large, and the distribution does not seem to be very diverse. Not sure how many OP users are even current veARC holders.     SophiaK:  It’s not clear how many users have claimed the veArc airdrop. Based on the structure for the initial distribution of Arc and veArc, it’s impossible to justify an OP grant that gives 100% of incentives to veArc holders.   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.503
                },
                {
                    "author_link": "https://gov.optimism.io/u/tec05",
                    "index": "5",
                    "likes": "1",
                    "time": "20/03/2023-11:01:05",
                    "content": "Thank you for the feedback.  OPGrant13582×3456 1.03 MB      MattL:  Regarding the grant request, I too think this is very high for a project of your size. As of right now this would be a grant request for almost the entire TVL of Archly.   I have adjusted the ask from 180K OP to 72K OP for the same time period (12 weeks/3 months). With the  decrease in funding, I have also adjusted the milestones for the decreased expected impact due to the lower funding amount. The milestone sections have been updated to target more specific pairs (WETH-OP and WETH-USDC) along with the expected TVL for each pair month over month (4 week period). I would like to note that the entire TVL of Archly is around $750K according to DefiLama at the moment (see image above). The original ask of 180k OP ($480K) would have been around 64% of the entire TVL of Archly excluding locked Arc (without staking). The current ask is now 72K OP ($192K) which is closer to Archly’s TVL on Optimism which is about $125K at the moment or about 26% of Archly’s total TVL. This should be used as the benchmark for evaluating projects as the price of assets that make up a project’s TVL as well as the price of OP changes over time. In other words, if we are going to consider asks for OP to be converted to USD or other currency, then we should freeze the value of the ask to the state of when the ask was made to avoid having to re-adjust requested amounts due to the value of OP increasing/decreasing.     MattL:  Just to be 100% clear here, there isn’t a presence for Archly on Optimism at the moment, right? I don’t see any pools besides an ARC/ETH pool.   Archly does indeed have a presence on Optimism. There are currently 7 pools (see second image above) that make up the $126K of TVL (according to DefiLlama see first image above).     MattL:  Not sure how many OP users are even current veARC holders.   There are currently 72 holders of veArc on the Optimism network (see third image above). This is up from 61 when we distributed the veArc to users on Optimism (see previous post).     MattL:  It also doesn’t seem like Optimism is much of a home base of operations for Archly, and I don’t see why / how users would stay on Optimism once the rewards were to run out.   I could say the same of Velodrome too.  By name, they are based on Optimism, but through the close cooperation with their forks, they are more of a distributed team over several chains too. Archly is choosing to do so under the same banner and through the same team. This will in my view provide a consistent experience for everyone that uses Archly, removing the need to re-educate users based on the variations due to the difference in forks on different networks. Ultimately, our goal is to enable projects and users to be free to move to where ever their community is or where they would like to expand. And by providing a consistent experience across multiple chains allows for users to see the pros and cons that each network has to offer. The reasons users would stick to Optimism is the same as any of our competitors, they see value in staying on the network they are on via returns seen through bribes and fees. If there is more volume and therefore fees and bribes on Optimism, then users will gravitate towards Optimism. Unfortunately (or maybe fortunately), our main competitor on Optimism got an eight month start over us. That’s okay as it gives us room to grow. But in order for Archly to see growth on Optimism, it has to be on a level playing field. Since our competitor has received massive grants on Optimism, Archly will require some form of grant as well to gain the interest of OP users to use Archly on Optimism. This is why all of the OP granted to Archly will go to the veArc holders through bribes to help kickstart the Archly Flywheel on Optimism. Once we establish a larger presence on Optimism, it will be easier for us to build partnerships that will drive bribes and fees to take over the role of rewards. Just like our competition, we will most likely need another grant or two as long as our competitor(s) on Optimism continue to receive grants. But like our main competitor, we are striving to wean users off of incentives provided by networks like Optimism and allow our flywheel to spin the way it was intended to do. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.283567393058918
                }
            ]
        }
    ],
    "group_index": "605"
}