{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/draft-gf-cycle-11-proposall-dforce-one-stop-shop-for-defi-solutions-on-optimism/5482",
            "title": "[DRAFT] [GF: Cycle 11 Proposall] dForce: One-stop-shop for DeFi solutions on Optimism ",
            "index": 5482,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Grants Council"
            ],
            "tags": [
                "growth",
                "cycle-11"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/MGGYY",
                    "index": "1",
                    "likes": "2",
                    "time": "07/03/2023-11:30:33",
                    "content": "Basic Details Project name: dForce Author name and contact info (please provide a reliable point of contact for the project.) Margaret (TG: @MGGYY) L2 recipient address: 0x69C1a51711B061E5935c648beb16e349898B17dF Which Voting Cycle are you applying for? Cycle 11 I confirm that I have read the landing pages for the Builders 1 and Growth Experiments 2 Sub-Committees and that I have determined my proposal is best suited to be reviewed by the Growth Experiments Sub-Committee: [Yes/No]: Yes I understand that Growth Experiments grants are subject to a “no sale rule,” as explained in this post, and I have read the terms of the rule: [Yes/No]: Yes Project Details What are you building? dForce is a complete set of DeFi protocols covering assets, lending, and trading, serving as DeFi infrastructure in Web3. Why do you believe what you are building is going to succeed?   dForce started off as a stablecoin protocol and developed into a complete ecosystem of DeFi protocols, breaking down the ‘silo’ barriers and allowing us to capitalize on liquidity, which is a much more efficient model than a standalone protocol seeking liquidity from the open market.   We have proved our success by deploying dForce protocols on six L1/L2s, including Ethereum, BSC, Arbitrum, Optimism, Polygon, and Avalanche. Today, dForce has recorded an accumulated borrowing of over 2 billion dollars with 11k unique addresses. dForce stablecoin USX also achieved a market cap of $162m, which is supported by a number of best-in-class protocols including Uniswap, Curve, Velodrome, Beefy Finance, DODO, Saddle, KyberDMM, Platypus, SwapFish, Equilibre Finance, AcryptoS, Tinnetwork, Liqee, DDDX, etc.   In addition to dForce’s DeFi matrix (stablecoin, lending, trading, and bridge), we are committed to building infrastructure for the future-proofing Web3 and are continuously exploring new value propositions including AMM, LSD, NFT AMM, etc.   How many users does your project have currently? Please include how you arrived at this estimate: dForce records 11k users across all networks supported (Source: DeBank | Your DeFi wallet) How will receiving a grant enable you to further the mission of maximizing the number of users interacting with Optimism? Please include a step-by-step flow of how you imagine this grant can lead to a greater number of user interactions with Optimism: The $OP grants will serve as a supplement to the existing $DF liquidity mining on Optimism, which will help boost APY and catch more eyeballs from the market. Last year’s ‘dForce Optimistic Winter’ campaign proved to be a great success with dForce stablecoin USX achieving a market cap of $12.6m, 230 unique addresses and 20k on-chain transactions on Optimism in less than 3 months (Nov 2022 ~ Feb 2023). Workflow:   Reward lending activities around $USX with $OP token on dForce Lending.   Create $USX trading pairs on at least 5 DEXes on Optimism and reward trading activities (including liquidity provision) with $OP token.   Seed $USX pools with protocol owned liquidity to better defend its dollar peg, making it easy for users to buy/sell $USX at any time.   Integrate ongoing mining pools for $USX to the ‘Farm’ page so that users from other ecosystems can migrate to Optimism for juicy yield.   Reward eligible developers/users contributing to the development of dForce on Optimism with $OP token (i.e., protocols building on top of dForce, top borrower on dForce Lending, top trader of $USX within a given timeframe, etc)   Tell us about the users you plan to target with this grant. Include any defining characteristics that will help you identify and target them.:   Stablecoin holders ($USDT, $USDC, etc): We have seen rising regulatory concerns and criticism affecting overall confidence in fiat stablecoins, $USX will serve as an alternative for users who favor more transparency, privacy and resistance to any third-party influence.   LSD token holders: LSD grabs the attention of DeFi users with greater capital efficiency and flexibility. dForce can help LSD token holders who want to multiply the benefits from their locked tokens, which otherwise would only generate staking rewards.   DeFi users: with a complete set of DeFi protocols ranging from stablecoin to lending and trading, dForce is able to help risk-tolerant investors who can leverage DeFi’s composability to maximize their investment returns. Meanwhile, risk-averse investors can still leverage dForce to earn a stable and passive yield on their crypto holdings.   How would these users interact with Optimism? For how long?   $USDC, $DAI, (and $USDT soon) holders can mint / redeem $USX at 1:1 rate on dForce, bridge it over to Optimism at near-to-zero cost (only need to pay gas fees) and farm across the ecosystem for the best yield.   LSD holders can take advantage of DeFi’s composability to earn additional yields on top of the staking rewards. With dForce’s help, LSD tokens can serve as a base yield option to facilitate faster expansion on the Optimism network.   For example, users can deposit Lido’s $wstETH to dForce as collateral to borrow other assets against, and use the borrowed assets in the broader DeFi market to leverage yield opportunities. dForce is partnering with Lido Finance to reward lending activities around $wstETH on L2s including Optimism, where users can supply $wstETH to earn $LDO token rewards. Starting from Lido’s $wstETH, we are evaluating more LSD tokens with a hope to provide more options for users to choose the one that best fits their needs and investment strategies.  Users can supply a variety of assets (BTW, ETH, OP, USDC, USDT etc) to earn a stable yield on dForce. Alternatively, users can utilize some of the supported assets as collateral to borrow other assets and hunt for the best yield across the wider Optimism ecosystem.  All of the above value propositions will be viable in the long run. Provide us with links to any of the following for the project:  Website: https://dforce.network/  Twitter: https://twitter.com/dForcenet  Discord/Discourse/Community: Telegram: Contact @dforcenet  Github: dForceNetwork · GitHub  Technical/Economic Documentation: Documents - dForce  Other: https://forum.dforce.network/   Do you have any metrics on the project currently? (TVL, transactions, volume, unique addresses, etc. Optimism metrics preferred; please link to public sources such as Dune Analytics, etc.) dForce records a TVL of $43.3m (DeFiLlama) (or 8.9m on Optimism) with 11k users (or 213 users on Optimism) (Source: DeBank | Your DeFi wallet) across all networks supported. dForce stablecoin USX also achieved a market cap of $161.3m (Dashboard), or 12.5m with 242 unique addresses and more than 20k on-chain transactions on Optimism (dForce USD (USX) Token Tracker | Optimism). Who are your competitors, and are they on Optimism?: Aave (Yes), Compound (No), etc. dForce is a decentralized lending protocol featuring a built-in stablecoin protocol, namely USX, which can be minted through:   Interest-bearing collaterals supplied to dForce Lending.   Collaterals (i.e., Curve LP token) supplied to dForce Vault (sitting in separate pools with customized parameters to safeguard against any potential risks);   1:1 swap between USX and USDC, DAI, USDT, BUSD on different networks.   USX can be bridged across all supported networks with near-to-zero cost (users only need to pay gas fees for using respective networks). Please link to code audits (if any):    github.com   documents/audit_report/Lending at master · dforce-network/documents master/audit_report/Lending Open documentation for dForce Network. Contribute to dforce-network/documents development by creating an account on GitHub.      Team Who are your founders? https://twitter.com/mindaoyang What makes your team well-suited to carry out the project described in this proposal? dForce was first deployed on Ethereum in 2019 and has successfully managed several Black Swan events in the crypto market. Today, dForce has developed into a full stack of DeFi protocols deployed on 6 networks and governed by $DF holders jointly. Most of the core contributors at dForce DAO are ex-Wall Streeters (Goldman Sachs, Standard Chartered Bank, Hony Capital, etc) and crypto veterans (ICO investor for Ethereum etc) with solid understanding of blockchain technology and cryptocurrency tokenomics. Is this your first Web3 project? Yes If not, what else have you built? (Share links, Github repository, or any other useful information.) N/A Grant Request What is the size of the grant request?: 250,000K How do you justify the size of the grant? This is in line with the previous $OP grants dForce received ($300K), which successfully grew dForce’s TVL on Optimism by 132.1% from $6.5m to $15.2m. Roadmap and Distribution Plan Describe in discrete steps how you will successfully implement your grant plan: The ‘dForce Optimistic Winter Campaign’ launched in November 2022 proved to be a great success for dForce, which grew our TVL on the Optimism network from $6.5m to $15.2m (representing 132.1% increase) in less than 3 months. dForce is now the third largest lending protocol on Optimism. With the new OP grants received, we will continue to incentivize lending and trading activities, as well as innovative ideas around USX on the Optimism network:   Step 1: reward minting & lending USX on dForce Lending.   Step 2: set up liquidity pools for USX on no less than 3 major DEXes.   Step 3: collaborate with eco-partners to increase traffic for both communities through AMAs, dual-mining campaigns, etc.   Step 4: encourage developers to build on top of dForce or integrate USX at the protocol level (i.e., enable USX as collateral, margin deposit, etc).   How will the OP tokens be distributed? (please include % allocated to different initiatives such as user rewards/marketing/liquidity mining. Please also include a justification as to why each of these initiatives align with the problem statement this proposal is solving. Distribution should not include the sale of any tokens by the grantee or the use of tokens for compensation, protocol expenses, etc. See the no sale rule here 1):   40% for USX liquidity on Optimism - users will be incentivized to provide liquidity for USX which would help defend the USX peg.   40% for lending activities around USX on Optimism - users will be incentivized to mint/lend/borrow USX, which will help 1) increase USX’s use case; 2) improve USX’s capability to interact with other protocols.   20% for bounties on teams building on top of dForce on Optimism and/or marketing campaigns in collaboration with partners across the Optimism ecosystem - this will 1) encourage wide adoption of USX across the Optimism ecosystem ; 2) improve traffic for dForce and USX through co-branding marketing initiatives.   Over what period of time will the tokens be distributed for each initiative?:   Liquidity incentives (40%) is anticipated to be distributed over a 3-month period (8,333.33 per week)   Lending incentives (40%) is anticipated to be distributed over a 3-month period (8,333.33 per week)   Bounties & marketing (20%) is anticipated to be distributed within 3~6 months.   Please provide benchmark milestones for this project. These milestones should guide the Optimism community on the progress of your project throughout your work on the project. Do not use distribution of the grant itself as a milestone:   USX to reach 400 addresses by the end of June 2023, non of which will be team wallets or smart contracts controlled by the dForce team. (Optimism.Etherscan).   Total borrowing on dForce Lending Optimism to reach $11m (Markets) by the end of June 2023, representing 200% growth from March 2023.   USX liquidity on major DEXes to reach $5m (Source) on Optimism by the end of June 2023 (100% increase from Feb 2023).   Please define critical milestones for this project. Critical milestones are meant to show good-faith efforts to accomplish the project. Non-completion of these milestones could lead to revocation of remaining grant rewards. Do not use distribution of the grant itself as a milestone:  dForce to deploy AMM on Optimism by end of June 2023.   dForce Swap (stablecoin swap) accumulated trading volume to reach $140m  by the end of June 2023.  If the OP tokens are for direct distribution to users, why will incentivized users and liquidity on Optimism remain after incentives dry up?: dForce is currently deployed on a number of blockchains including Ethereum, Optimism, Arbitrum, BSC, Polygon, Avalanche, and KAVA. Users from other L1/L2s can engage with the Optimism ecosystem through dForce. Users can 1:1 mint USX with USDC or DAI (and vice versa) on dForce, and then bridge it over to Optimism at near-to-zero cost (only need to pay gas fees associated). Users will be given the opportunity to engage with the Optimism ecosystem and lock value in one way or another. Once they migrate liquidity to Optimism and deploy a number of investment strategies across the ecosystem, most would become regular users and reside on Optimism. In addition to OP grants, dForce also provides long-term liquidity mining incentives for users on Optimism. Also, dForce is the only protocol that offers lending, stablecoin, trade aggregator, bridge on Optimism, providing users with an unique one-stop-shop experience for DeFi services on Optimism. Optimism Relationship Does your project solve a problem for the Optimism ecosystem? If so how? Yes, dForce offers a broad spectrum of DeFi protocols on one single platform, where users can lend, borrow, trade, mint, bridge in one place. It is the first and the only, all-in-one, community-driven DeFi solution on the Optimism, delivering greater levels of interoperability and making Web3 a more accessible experience. As a one-stop-shop for DeFi solution, dForce creates a unified user experience with much higher liquidity mining efficiency. The individuals who lend assets to dForce also tend to borrow or trade on dForce - by continuing to engage with our protocol, users will continue to receive additional rewards, meaning that OP grants will be utilized to reward various DeFi activities at the same time. Why will this solution be a source of growth for the Optimism ecosystem? dForce not only serves as a one-stop-shop for DeFi solution, but is also visioned at becoming the largest LSD lending market on the Optimism network. LSD assets have seen tremendous growth in total value locked and are playing a significant role in DeFi. The dominance of Lido alone — currently the largest liquid staking protocol — is already over 17% of DeFi’s TVL as of February 2023. We are partnering with Lido to reward lending activities around wstETH on Optimism and Aribitrum right now, where users can receive $LDO rewards by lending $wstETH to dForce and mint $USX. We are also evaluating opportunities to onboard more LSD assets to dForce and further grow the pie for this new asset class in DeFi. In addition to $OP and $LDO rewards, dForce also commits to co-incentivizing users with $DF token through rewarding events (liquidity mining, DEX liquidity, lend/borrow/trade, etc). By date, we have already distributed over 4m $DF since June, 2022. Is your project Optimism Native? No Confirmations I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: [Yes/No]: Yes I understand that I will be expected to following the public grant reporting requirements outlined here: [Yes/No]: Yes ",
                    "links": [
                        "https://foul-porch-0eb.notion.site/Growth-Experiments-Sub-Committee-270d2f75ff0f410a869b2ba6a8324006",
                        "https://gov.optimism.io/t/grant-proposal-template/3233",
                        "https://debank.com/protocols?page=1&q=dforce",
                        "https://app.dforce.network/#/Liquidity?AssetsType=Lend&currentPool=general",
                        "https://dforce.network/",
                        "https://twitter.com/dForcenet",
                        "https://t.me/dforcenet",
                        "https://github.com/dforce-network",
                        "https://docs.dforce.network/developer/documents",
                        "https://forum.dforce.network/",
                        "https://defillama.com/protocol/dforce",
                        "https://debank.com/protocols?page=1&q=dforce",
                        "https://app.dforce.network/#/Dashboard/?AssetsType=Lend&currentPool=general",
                        "https://optimistic.etherscan.io/token/0xbfD291DA8A403DAAF7e5E9DC1ec0aCEaCd4848B9",
                        "https://github.com/dforce-network/documents/tree/master/audit_report/Lending",
                        "https://github.com/dforce-network/documents/tree/master/audit_report/Lending",
                        "https://github.com/dforce-network/documents/tree/master/audit_report/Lending",
                        "https://twitter.com/mindaoyang",
                        "https://medium.com/dforcenet/introducing-dforce-optimistic-winter-campaign-on-optimism-f7aecf150e84",
                        "http://calendar.google.com/calendar/u/0/r?tab=mc",
                        "https://optimistic.etherscan.io/token/0xbfD291DA8A403DAAF7e5E9DC1ec0aCEaCd4848B9",
                        "https://app.dforce.network/#/Markets/Optimism?AssetsType=Lend&currentPool=general",
                        "https://app.dforce.network/#/Liquidity?AssetsType=Lend&currentPool=general",
                        "https://defillama.com/",
                        "https://gov.optimism.io/t/suggested-public-reporting-requirements-for-grantees/4176"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.803635284018496
                },
                {
                    "author_link": "https://gov.optimism.io/u/GFXlabs",
                    "index": "2",
                    "likes": "2",
                    "time": "14/03/2023-15:01:17",
                    "content": "Thank you for submitting this grant application! Throughout the application process, this forum thread will be one of the official means of communication. Please be sure to monitor it for updates over the course of the review period. At this stage, applications are mainly being reviewed for completeness, and nothing at this stage should be construed as support or opposition by any members of the Grants Council.     MGGYY:  Please provide benchmark milestones for this project. These milestones should guide the Optimism community on the progress of your project throughout your work on the project. Do not use distribution of the grant itself as a milestone:  USX to reach 400 addresses by the end of the 3-month rewarding campaign (Optimism.Etherscan). dForce Swap trading volume exceeds $10m on Optimum. Total borrowing on Optimism reach $14.5m (Markets), representing 200% growth from Feb 2023.    We recommend as much specificity as possible, as the community will judge the effectiveness of the grant plan on its ability to deliver on these. A possible improvement could be, “dForce Swap trading volume will exceed $10m during timeframe X” or “USX will be in 400 new addresses by date Y, none of which will be team wallets or smart contracts controlled by the dForce team.”     MGGYY:  Please define critical milestones for this project. Critical milestones are meant to show good-faith efforts to accomplish the project. Non-completion of these milestones could lead to revocation of remaining grant rewards. Do not use distribution of the grant itself as a milestone:  dForce Swap trading accumulated volume to reach $20m (Optimism.Etherscan) by the end of the 3-month rewarding campaign. USX liquidity on major DEXes to reach $5m (Source) on Optimism by the end of the first three months (100% increase from Feb 2023), and $8m (Source) by the end of the six-month campaign (160% increase from Feb 2023).        MGGYY:  Please define critical milestones for this project. Critical milestones are meant to show good-faith efforts to accomplish the project. Non-completion of these milestones could lead to revocation of remaining grant rewards. Do not use distribution of the grant itself as a milestone:  dForce Swap trading accumulated volume to reach $20m (Optimism.Etherscan) by the end of the 3-month rewarding campaign. USX liquidity on major DEXes to reach $5m (Source) on Optimism by the end of the first three months (100% increase from Feb 2023), and $8m (Source) by the end of the six-month campaign (160% increase from Feb 2023).    Critical milestones must be met to unlock future portions of a grant. We recommend you revise the second one, which might be more fitting as a benchmark milestone without revision, since it comes at the end of your grant plan. Further guidance on milestones can be found here: Milestone Assessment  Thank you, and GFX Labs or other Grants Council members will follow up here with any further questions throughout the process. Do not hesitate to ask questions here (tagging whichever Council Member a question is for, or @GrantsOps generally, will increase the speed of response). ",
                    "links": [
                        "https://app.dforce.network/#/Markets/Optimism?AssetsType=Lend&currentPool=general",
                        "https://optimistic.etherscan.io/token/0xbfD291DA8A403DAAF7e5E9DC1ec0aCEaCd4848B9",
                        "https://app.dforce.network/#/Liquidity?AssetsType=Lend&currentPool=general",
                        "https://app.dforce.network/#/Liquidity?AssetsType=Lend&currentPool=general",
                        "https://optimistic.etherscan.io/token/0xbfD291DA8A403DAAF7e5E9DC1ec0aCEaCd4848B9",
                        "https://app.dforce.network/#/Liquidity?AssetsType=Lend&currentPool=general",
                        "https://app.dforce.network/#/Liquidity?AssetsType=Lend&currentPool=general",
                        "https://gov.optimism.io/t/milestone-assessment/5314"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.856433796088969
                },
                {
                    "author_link": "https://gov.optimism.io/u/MGGYY",
                    "index": "3",
                    "likes": "1",
                    "time": "16/03/2023-09:48:50",
                    "content": "Thanks for your valuable feedback! We have amended the milestones as instructed for your review and comments @GrantsOps ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                }
            ]
        }
    ],
    "group_index": "571"
}