{
    "poll_list": [
        {
            "id": "0x037e4148cf8feb706c023108e1c82f9d765a6c6217dcef9ae367a672683820e9",
            "title": "Proposal B: Governance Phase 1 - Kromatika ",
            "discussion": "https://gov.optimism.io/t/ready-gf-phase-1-proposal-kromatika/2650",
            "body": "This Governance Fund Phase 1 proposal has been marked ready and as such is eligible for voting in Cycle 3. This proposal HAS been approved as ready for vote by a delegate. For more info, check out Voting Cycle 3 Roundup: [https://gov.optimism.io/t/voting-cycle-3-roundup/2923/1](https://gov.optimism.io/t/voting-cycle-3-roundup/2923/1)\n\nLink to proposal: https://gov.optimism.io/t/ready-gf-phase-1-proposal-kromatika/2650",
            "choices": [
                "For",
                "Against",
                "Abstain"
            ],
            "scores": [
                3024942.549712042,
                14080777.300650312,
                212523.74571592355
            ],
            "start": 1657222212,
            "end": 1658345412,
            "snapshot": "14037963",
            "state": "closed",
            "author": "0x47C88bb92B409fF25F6587EA611fac4e55f76007",
            "space": {
                "id": "opcollective.eth",
                "name": "Optimism Collective"
            }
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/ready-gf-phase-1-proposal-kromatika-old/2650",
            "title": "[READY] [GF: Phase 1 Proposal] Kromatika [OLD] ",
            "index": 2650,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Governance Fund: Phase 1"
            ],
            "tags": [
                "cycle-3",
                "not-passed"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/Kromatika",
                    "index": "1",
                    "likes": "9",
                    "time": "10/06/2022-21:51:24",
                    "content": "Project Name: Kromatika Author Name: Kacar Number of OP tokens requested: 300.000 L2 Recipient Address: 0x05d235d8Ba95bfc457f9a11F64cf869f0f3f60F9 TVL : $966 059 worth of limit orders have been created on optimism before the OP snapshot.  1017×133 5.67 KB   Tier: 3 Optimism native: No Kromatika Background: Kromatika dApp first deployed its innovative limit order solution on the Optimism network on December 15, 2021, while Optimism was still in Beta. To this day, Kromatika is one of the few (if not the only) DEX protocols that implement automated Limit Orders and a Swap Aggregator on the Optimism network. Kromatika utilises the advanced UniswapV3 liquidity and the efficiency of Chainlink Keepers to settle trades automatically as per the user’s pre-defined conditions. Kromatika has automated all the complex procedures and made it easy for DEX users to conduct limit trades. Now, users can trade without front-running BOTs, with no price slippage impact, no swap fees, and also earn a portion of LP rewards for providing liquidity on the trade. In other words, the trade target price defined by the user is precisely applied for execution without manipulation, no fees lost during the swap, and no BOTs will rob the users off their crypto during the trade. Kromatika v2 benefits from an advanced MetaSwap Aggregator as well. This platform aggregates the liquidity from popular DEX aggregators and compares swap data across Uniswap, 0xProject, and 1inch. This allows users to get better market rates than they would get on a single DEX by optimising token pricing, swap fees, and slippage. Kromatika’s mission is to make DEX trading simple, accessible, and profitable to every crypto user who believes in the decentralised value of blockchain technology. Goal :  Bring more users into the Optimism ecosystem via our Marketing Triade plan Increase TVL and daily transaction on Optimism via Kromatika Create new partnership collab with other projects to bring them into the Optimism ecosystem.  Optimism alignment : Kromatika wants to help Optimism onboard new users and increase locked liquidity. Proposal for token distribution : How will the OP tokens be distributed? We created a Triade Marketing Plan, each corner of this triangle boosts the other one, it’s a virtuous circle.  Points scored1200×742 35.6 KB  Influencer Marketing 50% We’ll create a mass influencer marketing program to make the promotion of Kromatika on Optimism with a focus on 3 unique Optimism features:  3 free swaps on Optimism network only $OP airdrop for Liquidity Provider participant on the Optimism Blockchain Liquidity providing and solo staking on Kromatika Finance   1080×1080 110 KB  We will be selecting quality influencers for this campaign. As a platform, we do not work with “coin shillers” or pump-dump groups for promotion. We look for good educational content influencers who put out quality content. Our marketing team will ensure the selection of influencers is of the best quality and hence the educational youtube videos and twitter threads they produce will bring in quality users. In addition, the influencers will also be equipped with a referral link, which we will build (see next point below), that can be a useful tool to further promote awareness of Kromatika and Optimism Network. Kromatika is a fair launched project with no external funds, no VC and no ICO done. We are a fully minted project as well. This means our funds are limited, dependent on token prices, and have to be split between the various facets of running a well oiled machine - including dev work, hiring, team maintenance, all bills/cost related to the project. We strongly believe that Kromatika is the solution to the current issues in the DEX space. But, it is quite difficult to do this without a dedicated awareness campaign especially because we don’t have any VCs or big names promoting our product. Hence the focus on marketing (including the building of the referral tool, see below) to raise awareness for Kromatika on the Optimism Network. The new users will be happy with the ease, automation and profitability using Kromatika protocol, and they will also experience the speed, low gas fees and versatility of Optimism Network. It is a win-win. Referral Program 20% Kromatika aims to build a referral program on Optimism first and make it exclusive for 2 months before setting it up on other blockchains. This idea was not part of our official roadmap, but since we are applying for a grant, it will enable us to dedicate funds (if we receive the grant) to pay salaries of the dev team in order to build this feature. We believe this program will help promote new user acquisition. Once created, this Referral Program can be one of the tools that will gain traction among influencers that have a larger following and will help onboard new users to the Optimism Network via Kromatika. Content creators monetize their audience with personal affiliation links for Coinbase, Bybit, Binance. etc. No one has monetized their audience via DEX affiliation yet. The goal is to change this trend and witness a “Kromatika affiliate link, on Optimism” under Youtube Influencer Videos, Twitter bio links, and blogs. Liquidity Providing AirDrop 20% Increasing TVL is Kromatika’s main goal and the $OP token presents a wonderful opportunity to attract new users and bring more on-chain liquidity. We are going to reward the users who provide bridge liquidity ( $OP & $KROM ), only on the Optimism Blockchain. Staking rewards : Kromatika will also create a limited time staking rewards for users who stake :  Stake $OP earn $OP Stake $KROM earn $OP  Early users Airdrop 10% A small portion of grant will be used to reward the early Optimism users of Kromatika.This will be one more reason for continued usage of Kromatika on Optimism as it will be viewed by early users as a loyalty reward. How will this distribution incentivize usage and liquidity on Optimism? During the initial phase of the distribution, by temporarily giving 3 free swap fees, using our unique limit order platform, trading on Kromatika becomes more attractive. The users will benefit from an even smaller fee because Kromatika has no swap fees. Why will the incentivized users and liquidity remain after incentives dry up? Once the new users onboard, they will stay because of the security (decentralized), benefits (Kromatika trading platform benefits), and the network efficiency/speed (Optimism) that enables all of this to happen. Our real mission is to make DEX trading simple, accessible and affordable. DEX trading does not have to be a ridiculously costly affair, and the users will discover this reality via Kromatika and will continue to stay with Kromatika and Optimism. As a Kromatika user, you will discover that:  You are not impacted by price slippage, or swap fees or bot attacks. (so more value for your crypto, no need to sacrifice it for bots/slippage) You do not pay needless fees, instead you earn LP fees. (again more returns on your trade) You do not need liquidity for both Token A and Token B, only liquidity for the token you want to buy or sell. No order delays, but quick execution and fully automated because our limit orders are implemented as liquidity provision around the target price. When your target price is reached, your trade is executed automatically, and your liquidity is pulled out, again automatically. You don’t need to stare at your screen or worry about your orders being “un-filled” ever again.  This is fundamentally different from limit orders (range orders) that already exist in the DEX space which are prone to bot attacks, slippage, swap fees and also delays in the orders filled even if it is trading at target price. Wouldn’t you be happy if as a DEX user you were given these advantages that exist in traditional finance and CEX? Why pay more on other DEX, when you can earn more with a “set and forget” type of automation via Kromatika? Now for the users who prefer only swap trades, Kromatika is an “aggregator of aggregators”. The smart program scans the popular 1inch, Uniswap, and 0xProject for the best value for your swap trade in an instant. You will never need to scan multiple DEXs for your instant swaps because Kromatika does this heavy lifting for you. Additionally, Kromatika intends to provide BOT protection for swaps as well (just like our limit orders) in the near future. With the above advantages, it is no doubt that the users will stay once the incentives dry up, because Kromatika offers a solution in the DEX space that is unmatched by others. Over what period of time will the tokens be distributed? The duration of the distribution phase is impossible to predict due to the variable nature of the distribution method. ",
                    "links": [
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/4/4276105db66df59f852051814bfbeac2d4bde96e.png",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/d/dde5e69e86f483241b494ee466e3f49c5fa7e3cf.png",
                        "https://gov.optimism.io/t/voting-cycle-3-roundup/2923",
                        "https://gov.optimism.io/t/gfx-labs-delegate-communication-thread/2728/7",
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-cycle-6-kromatika/3306"
                    ],
                    "GPT-summary": "The post is a proposal for a grant for the Kromatika dApp, which offers an innovative limit order solution on the Optimism network. The proposal outlines a marketing plan to bring more users into the Optimism ecosystem, increase TVL and daily transactions on Optimism, and create new partnership collaborations. The proposal includes a breakdown of how the grant funds will be distributed, including a mass influencer marketing program, a referral program, a liquidity providing airdrop, and staking rewards. The post also explains the benefits of using Kromatika, including no price slippage impact, no swap fees, and automated limit orders.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Token economics",
                        "Interoperability and Scaleability",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.853605499438833
                },
                {
                    "author_link": "https://gov.optimism.io/u/rich",
                    "index": "2",
                    "likes": "3",
                    "time": "11/06/2022-04:48:22",
                    "content": "This is a good proposal, especially because this project chose to launch on Optimism in its Beta Stage last November. Kromatika Finance has an interesting and useful solution to DEX trading via its limit orders. I think the grant could help Kromatika raise awareness of its platform and bring more users onboard the Optimism Network. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.666666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/Robor2b102",
                    "index": "3",
                    "likes": "4",
                    "time": "11/06/2022-07:11:19",
                    "content": "I’m a big fan of Krom and have been using it a while. A nicely balanced and considered proposal that allocates OP in the right places, from my perspective. Fully support ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.476190476190476
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "4",
                    "likes": "4",
                    "time": "11/06/2022-11:26:30",
                    "content": "Hey Guys, thank you for your first draft. here are couple on initial thoughts:- you have referral reward under influencer marketing and under referral program too , how are they different ? I get that in one you are talking about content creation and in other its about individual referral, correct? But arent they suppose to fall under on category ? On youtube/twitter promotion topic, how are you planning to decide who will get how many rewards. For example, one user might right in depth review of the platform and other might just say “Krom is the best dex”. You are giving 20% as swap(from the pie-chart) reward and you are also mentioning 3 free swap under your 50% allocation.  Are they same ? A:- influencer Marketing 50% 1. content creator 2. OP reward on trade volume 3. 3 free swap B:- Referral Program 20% How is this different from above (A.1) ? C:- Liquidity Providing AirDrop 20% 1. staking D:- Early users Airdrop 10% where is the 20%(Swap Reward) you are showing in pie-chart, is that a typo ? I have also shared almost same text on discord, pasting here for more input from community. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.936974789915967
                },
                {
                    "author_link": "https://gov.optimism.io/u/brucewang614",
                    "index": "5",
                    "likes": "3",
                    "time": "11/06/2022-15:10:44",
                    "content": "I am big fan of krom and use it for while, very smooth and saving a lot ! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.625
                },
                {
                    "author_link": "https://gov.optimism.io/u/Mika",
                    "index": "6",
                    "likes": "2",
                    "time": "11/06/2022-19:42:43",
                    "content": "Krom has consistently had the top 30 trading volume (weth pair) on uniswap and I believe it is a gem. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://gov.optimism.io/u/Kromatika",
                    "index": "7",
                    "likes": "5",
                    "time": "12/06/2022-14:50:18",
                    "content": "Hey, thanks for the feedback. Here are the answers from your questions On youtube/twitter promotion topic, how are you planning to decide who will get how many rewards. For example, one user might write in depth review of the platform and other might just say “Krom is the best dex”.  → We have always believed in educational content to create awareness in this space. Even on a regular basis we turn down plenty of “shill” influencers, and choose only educational type influencers. Our marketing team will judge the user content to filter good-quality reviews. Our focus is Kromatika on the Optimism Network, and not just Kromatika as a DEX. where is the 20%(Swap Reward) you are showing in pie-chart, is that a typo ?  → Yes it was, I’ve taken care of it. Thank you for pointing it out. You are giving 20% as swap(from the pie-chart) reward and you are also mentioning 3 free swap under your 50% allocation. Are they same ?  → There was a typo on the pie-chart. The correct form is: 20% of the Grant Fund will be used to reward users who provide bridge liquidity ($OP or $KROM). you have referral reward under influencer marketing and under referral program too , how are they different ? I get that in one you are talking about content creation and in other its about individual referral, correct? But arent they suppose to fall under on category ?  → The 20% mentioned under Referral Program will be the cost spent to build this feature. This is something that we did not plan in our official roadmap but now since we may have additional funds via this grant, we can direct a portion of the fund towards building this feature. The Referral Program is one of the tools for influencer marketing (apart from content creation etc). We envision that this referral program will gain traction with influencers that have a larger following and will help onboard new users to the Optimism Network via Kromatika. One of our objectives with this referral program is that Kromatika on Optimism Network will be featured on popular blogs/vlogs/influencer tweets etc ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.732702020202021
                },
                {
                    "author_link": "https://gov.optimism.io/u/Justin",
                    "index": "8",
                    "likes": "2",
                    "time": "18/06/2022-05:01:33",
                    "content": "This is a novel approach and worth supporting to see how well it works.  I am particularly drawn to using the tokens for marketing campaigns to onboard new users.  Those efforts could reach beyond the mercenaries and lead to increased adoption, particular if the focus is on educational content. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.058080808080808
                },
                {
                    "author_link": "https://gov.optimism.io/u/Axel_T",
                    "index": "9",
                    "likes": "1",
                    "time": "18/06/2022-06:14:13",
                    "content": "@Justin mate? You left me a reply holding one position, and then here you post the opposite position, and justify it via:     Justin:  I am particularly drawn to using the tokens for marketing campaigns to onboard new users. Those efforts could reach beyond the mercenaries and lead to increased adoption, particular if the focus is on educational content.   This is literally what 25% of my requested allocation is for?!?! Why the contradiction on my Proposal? Help me understand this, please, while my Proposal is still in Draft mode. EDIT: Please respond to the request for clarification in the Summa Proposal thread, so we don’t unfairly take Kromatika’s thread off track. Cheers. Kind regards, Axel ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.600201231060606
                },
                {
                    "author_link": "https://gov.optimism.io/u/Justin",
                    "index": "10",
                    "likes": "1",
                    "time": "18/06/2022-18:22:06",
                    "content": "Hi @Axel_T, I responded to this comment on your Phase 1 proposal page.  Cheers. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "11",
                    "likes": "2",
                    "time": "20/06/2022-11:41:40",
                    "content": "Thank you, so can i say that 70% is towards marketing(i am also counting 20% that you will use to build this feature), 20% to LPer and 10% early users ? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/William",
                    "index": "12",
                    "likes": "0",
                    "time": "23/06/2022-04:49:31",
                    "content": "How does staking KROM and paying OP to people to dump a good idea? Or using OP to pay influencers to dump onto the market a good idea? Everything here, from the airdrop to marketing and LPing is a bad move for OP token price. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.166666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/Kromatika",
                    "index": "13",
                    "likes": "1",
                    "time": "23/06/2022-17:26:44",
                    "content": "Yes you could say that. We decided to spend upto 70% (including 20% build cost) on marketing because we want to help onboard new users to Optimism using Kromatika. Our real mission is to make DEX trading simple, accessible and affordable. We want to help transition CEX traders to DEX traders. The crowds will come in once they discover that DEX trading does not have to be a ridiculously costly affair. And, we believe that Kromatika is the solution to the current issues in the DEX space. But, it is quite difficult to do this without a dedicated awareness campaign especially because we don’t have any VCs or big names promoting our product. Hence the focus on marketing (including the building of the referral tool). Once the new users onboard, they will stay because of the security (decentralized), benefits (Kromatika trading platform benefits), and the network efficiency/speed (Optimism) that enables all of this to happen. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.00719696969697
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "14",
                    "likes": "0",
                    "time": "23/06/2022-17:35:00",
                    "content": "Thank you, what you have said make sense. One last question, I promise, will you be keeping a ledger of your fund distribution and willing to share with OP team when asked for it? Reason being, I think , its a unique experiment and I want to support this but I also want to see the flow of token and its impact on users. It would be great if you could share with all of us but I think this wont be possible because of privacy reason.  What you think ? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 6.425000000000001
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "15",
                    "likes": "0",
                    "time": "23/06/2022-20:49:22",
                    "content": "Am I understanding it correctly that you are asking for OP tokens to pay to influencers to market your product in optimism? And then some of it on a referral program? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Kromatika",
                    "index": "16",
                    "likes": "1",
                    "time": "23/06/2022-22:22:29",
                    "content": "The way tokens are used is described and can be followed on-chain. The Provided address in the grant is a gnosis safe wallet on OP having the same signers as the team wallet. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/Kromatika",
                    "index": "17",
                    "likes": "2",
                    "time": "23/06/2022-22:22:42",
                    "content": "This is the one thing that we have no control over. We are hoping the users hold the OP token, but ultimately, it is a grant paid in OP tokens that must be put to use. We have tried our best to bring about good value for both Optimism and Kromatika in the long run. If you do have a better idea, we’d be open to hear it though. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 6.791666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/rich",
                    "index": "18",
                    "likes": "0",
                    "time": "24/06/2022-10:09:44",
                    "content": "This makes sense. Thank you for sharing these details. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Kromatika",
                    "index": "19",
                    "likes": "1",
                    "time": "24/06/2022-10:45:39",
                    "content": "Hi, thank you for your question. The only payment an influencer gets is to promote our “Optimism only offers”: a) three free swaps on Optimism b) $OP airdrop for Liquidity Provider participant on the Optimism Blockchain c) Liquidity providing and solo staking on kromatika finance Additionally, we will be vetting the influencers to ensure they are not coin shillers but rather have some good educational content. That way there is quality and we are not throwing $OP tokens into the wind. The 20% for referral program is for the development of the referral program. This idea was not part of our official roadmap, but since we are applying for a grant, it will enable us to dedicate funds (if we receive the grant) to pay salaries of the dev team in order to build this feature. We believe this program will help promote new user acquisition. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.238636363636364
                },
                {
                    "author_link": "https://gov.optimism.io/u/Aris",
                    "index": "20",
                    "likes": "4",
                    "time": "04/07/2022-10:53:36",
                    "content": "Based on the discussion going on and clarification made, as an OP holder and delegate with more than 0.0005% of voting power ( 0xdbaabc182e5fcebf216c353a3ebe32cdb7390094 ), I support his Proposal. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "21",
                    "likes": "4",
                    "time": "06/07/2022-09:56:39",
                    "content": "happy to support this. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/rich",
                    "index": "22",
                    "likes": "2",
                    "time": "06/07/2022-14:11:55",
                    "content": "This is an exciting project. I like how the limit orders are actually limit orders unlike what is offered in the DEX space currently. Why should CEX users have all the fun lol! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.6000000000000005
                },
                {
                    "author_link": "https://gov.optimism.io/u/SEED_LATAM_Joxes",
                    "index": "23",
                    "likes": "1",
                    "time": "07/07/2022-15:50:28",
                    "content": "Hi @Kromatika reviewing the proposal, I consider that the amount for influencers is not very reasonable from our perspective. I would suggest reducing that amount and including other features that benefit the end user, such as allocating 50% refunds on gas fees to users, for example. This idea can be discussed with another delegate if they so wish in the next few hours. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.598076923076923
                },
                {
                    "author_link": "https://gov.optimism.io/u/solarcurve",
                    "index": "24",
                    "likes": "2",
                    "time": "07/07/2022-23:10:38",
                    "content": "Voting against. Influencer marketing, however well intentioned or well executed it may be, is not a proper use of Phase 1 incentives in my view. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "25",
                    "likes": "3",
                    "time": "08/07/2022-10:04:57",
                    "content": "Will Vote: Yes This is one of its kind proposal as its mostly focusing on marketing which I believe could help us onboard user and grow OP ecosystem. I have couple of suggestion, during marketing focus on OP chain too and dont just put OP logo be done with that, I wold like to see mention of Bedrock, vision of OP gov, impact=profit, how can a user participate in OP ecosystem. Dont just focus on your project, my request would be to find a balance and if possible track the spending and its impact. ",
                    "links": [
                        "https://gov.optimism.io/t/opuser-delegate-communication-thread/2777/7"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.833333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/rich",
                    "index": "26",
                    "likes": "2",
                    "time": "08/07/2022-15:06:12",
                    "content": "I see an overwhelming majority who voted against this project. I assume they were turned off by the influencer marketing allocation but I am not sure if they read the intention and reason why Kromatika has chosen to dedicate 50% toward raising awareness. I would like to see fair launched projects such as Kromatika to win this grant simply because they have created a brilliant product that brings a solution to DEX trading. And they have done this with zero VC or external funds. Not even an ICO. Now that they are requesting for a grant, i think they should be supported in this venture. I believe in the project and their intentions. I wonder if they are allowed to change their proposal or re-submit it though. Perhaps reduce the allocation for marketing so that the other delegates will reconsider and support this project. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.402777777777777
                },
                {
                    "author_link": "https://gov.optimism.io/u/Kromatika",
                    "index": "27",
                    "likes": "1",
                    "time": "08/07/2022-15:59:38",
                    "content": "thanks for all the feedback you provide - that’s for that reason that we love this section : hear your feedback to come with the best proposal for our community. Kromatika is a project started from a fair launch, built stone by stone with the help of the community. So, based on your valuable feedback, we would like to adjust ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/fig",
                    "index": "28",
                    "likes": "1",
                    "time": "08/07/2022-18:43:11",
                    "content": "We will be voting against this proposal as delegates. While we appreciate novel uses of OP rewards for staking, we are skeptical of the efficacy of a referral program and influencer marketing, even more so at 50% of the distribution. It seems to be well-intentioned however it is rarely the case:     Kromatika:  We will be selecting quality influencers for this campaign. As a platform, we do not work with “coin shillers” or pump-dump groups for promotion. We look for good educational content influencers who put out quality content.   Influencers - and public personas - have historically been selling pressure for most projects and tokens. The benefit does not seem to outweigh risking the same fate for $OP. We encourage a revised proposal with smaller rewards allocated for marketing. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.7727272727272725
                },
                {
                    "author_link": "https://gov.optimism.io/u/rich",
                    "index": "29",
                    "likes": "1",
                    "time": "09/07/2022-13:19:17",
                    "content": "Hi @fig , do you think that @Kromatika can re-work their proposal since it has already been submitted? The team seems eager to work on feedback received here. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Beta",
                    "index": "30",
                    "likes": "1",
                    "time": "09/07/2022-18:51:47",
                    "content": "Good job for formalization, but imho I’ll vote against, sorry( ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "31",
                    "likes": "1",
                    "time": "09/07/2022-22:43:11",
                    "content": "I will be voting against this proposal due to the heavy focus on influencer marketing and referral program. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.1875
                },
                {
                    "author_link": "https://gov.optimism.io/u/polynya",
                    "index": "32",
                    "likes": "3",
                    "time": "10/07/2022-07:17:06",
                    "content": "While “influencer marketing” is off-putting at first glance, looking through the responses - I’ll vote For this proposal. The requested amount is reasonable, and the marketing strategy seems to be well thought out - something that’s very much missing from Optimism and projects on Optimism. I’m skeptical that it’s as reflexive as you expect, but happy to give it the benefit of doubt at this early stage, and keen to revisit and see if it leads to sustained adoption. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.541666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/Cryptoz",
                    "index": "33",
                    "likes": "1",
                    "time": "10/07/2022-18:47:10",
                    "content": "I will be voting NO, because 50% of the proposal seems to be for incentives from airdrop, liquidity, staking rewards and referral program, which is way to much. Then the other 50% is for influencer marketing which benefits both you and OP, although OP could do that by its self without needing to do mutual marketing. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.1875
                },
                {
                    "author_link": "https://gov.optimism.io/u/555",
                    "index": "34",
                    "likes": "1",
                    "time": "11/07/2022-02:55:54",
                    "content": "Hello, I would like to ask how the time node of early user rewards is defined? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/Defi_LATAM_axlvaz",
                    "index": "35",
                    "likes": "0",
                    "time": "11/07/2022-19:46:44",
                    "content": "I am not a delegate, but I am an active member of the DefiLATAM and OptimismESP community. The value proposition of the protocol is very good although the funds requested are quite high. They should request 50%. It does not seem reasonable to me to allocate 50% to MKT (influencer), as it is difficult to evaluate the content generated with a criteria, I think that amount of funds could be used in a better way. ",
                    "links": [
                        "https://twitter.com/OptimismESP"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.947222222222223
                },
                {
                    "author_link": "https://gov.optimism.io/u/Kromatika",
                    "index": "36",
                    "likes": "0",
                    "time": "12/07/2022-14:24:39",
                    "content": "Hi @SEED_LATAM_Joxes Thank you for taking the time to go through our proposal. We appreciate your feedback. The end goal of our entire proposal is to onboard as many new users to the Optimism Network because we are big Layer 2 fans. It is not restricted to Kromatika dApp itself. However, we understand your concerns with influencer marketing. Still, as a startup with zero external funding to be utilized for marketing campaigns, press releases, speaker events etc,  we do feel like our voice is unheard by the hundreds of traders out there who’d surely benefit from our one-of-a-kind solution platform in the DEX space. And, this is why we went with a 50% allocation for influencers. Basically in our thought process, anybody with a decent following who can produce educational threads, youtube videos etc qualifies for an “influencer”. We don’t work with coin shillers per se. We really value your input, and if we don’t get through this round of grant approval, we will re-work our proposal after gathering all the delegate inputs here. Perhaps we will reduce the allocation for influencer marketing (and/or hire a PR agency and not having to deal with influencers), and increase the gas refunds allocation. On that note, I am curious if you have any thoughts toward hiring a PR agency instead of influencers. Would love to hear from you. Please do keep us in mind, and go through our proposal if we re-submit it. Cheers! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.799242424242425
                },
                {
                    "author_link": "https://gov.optimism.io/u/Kromatika",
                    "index": "37",
                    "likes": "0",
                    "time": "12/07/2022-14:25:37",
                    "content": "Hi @solarcurve, Thank you for taking time to go through our proposal and thank you for your comment. Apart from the influencer marketing part, were you ok with the other parts of our proposal? Also, what would you suggest for a startup with no external funding that needs help in raising awareness for a product that is definitely making its mark in the DEX space? In terms of marketing, other than influencers, would you suggest that we hire a PR agency instead? Or what if, we reduced the allocation for marketing, increased the allocation for gas refunds, and then re-submitted our proposal? Would you vote for our proposal then? We really love Layer 2, and hence Optimism. In fact we ran our dapp on the beta version of Optimism last year. So our end goal after winning the grant would be to onboard new users onto Optimism and not just Kromatika. Thank you in advance for your comments  Look forward to hearing from you. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.77020202020202
                },
                {
                    "author_link": "https://gov.optimism.io/u/Kromatika",
                    "index": "38",
                    "likes": "3",
                    "time": "12/07/2022-15:04:37",
                    "content": "Hi @polynya.eth, Thank you so much for taking the time to go through our proposal and all of our responses to understand the intent behind it all. We are so grateful that you see it. We are also grateful that you support our proposal. However, it looks like we may not win the grant at this stage judging from the For vs Against votes. If we have to re-submit our proposal, we will reduce the allocation for marketing and increase allocation toward gas refunds since that’s what seems to be the voice of the majority of the delegates who have voted. Would love for you to keep an eye out for us, in case we do resubmit our proposal.  Thank you again for your energy and support!! Cheers! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.470703125
                },
                {
                    "author_link": "https://gov.optimism.io/u/linda",
                    "index": "39",
                    "likes": "2",
                    "time": "12/07/2022-18:09:36",
                    "content": "I’m voting no on this specific proposal with a similar reason to other delegates that I don’t feel the 50% towards influencer marketing is the best use of funds. I’m happy to re-review the proposal if you end up resubmitting it as you mentioned. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party asking to re-review proposal"
                    ],
                    "Sentiment": 6.675
                },
                {
                    "author_link": "https://gov.optimism.io/u/Bobbay_StableLab",
                    "index": "40",
                    "likes": "1",
                    "time": "13/07/2022-08:14:21",
                    "content": "Vote: No We echo some of the comments made in regards to reducing marketing incentives and focusing it more in on refunds, educational content or other activities that simplify adoption for users. We are more than happy to consider an updated proposal for the next cycle! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.604166666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/fewol",
                    "index": "41",
                    "likes": "1",
                    "time": "13/07/2022-14:28:49",
                    "content": "I voted NO  for this proposal. Project value: Okay, from the description the project sounds like it could be providing something unique. But I have never heard of the project before. Amount: Bad, high for TVL metrics OP distribution: Bad, incentives are basically all for incentives or self marketing. ",
                    "links": [
                        "https://gov.optimism.io/t/stablenode-delegate-thread/2973/4"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 4.635
                },
                {
                    "author_link": "https://gov.optimism.io/u/rich",
                    "index": "42",
                    "likes": "1",
                    "time": "14/07/2022-03:06:46",
                    "content": "Would you define educational content? Wouldn’t that come under marketing since the project intends to pay content creators to produce educational content? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/rich",
                    "index": "43",
                    "likes": "1",
                    "time": "14/07/2022-03:10:04",
                    "content": "I think the fact that you haven’t heard of the project before is why they are heavily leaning toward raising awareness via marketing. They have a solid product but limited resources to promote their brand via marketing. That’s why their proposal does make sense to me.  I hope they re-work and re-submit their proposal because I’d like to see them win the grant and then more users to discover this platform on Optimism. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.0285714285714285
                },
                {
                    "author_link": "https://gov.optimism.io/u/Bobbay_StableLab",
                    "index": "44",
                    "likes": "1",
                    "time": "14/07/2022-07:36:26",
                    "content": "The original plan for marketing mentions “content influences”  but it’s better to be a bit more specific about what topics Kromatika plans to cover. The way the proposal is written makes it seem more like an influencer direction than a content direction, albeit they can overlap, but that is the feeling I get when reading it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://gov.optimism.io/u/lvlojei",
                    "index": "45",
                    "likes": "1",
                    "time": "14/07/2022-09:21:39",
                    "content": "very good  Thank you for sharing these details ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.549999999999999
                },
                {
                    "author_link": "https://gov.optimism.io/u/lvlojei",
                    "index": "46",
                    "likes": "1",
                    "time": "14/07/2022-09:40:46",
                    "content": "Thank you for sharing these details  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/quix",
                    "index": "47",
                    "likes": "1",
                    "time": "18/07/2022-18:04:03",
                    "content": "We voted no on this proposal. We appreciate that Kromatika deployed on Optimism back in December 2021, but we feel that a 50% allocation for influencer marketing is not the best use of funds. We’d be happy to review a restructured proposal. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/SEED_LATAM_Joxes",
                    "index": "48",
                    "likes": "2",
                    "time": "19/07/2022-01:59:38",
                    "content": "[Final] Voting: No Protocol with valuable use case for certain types of users. Plan for the use of OP tokens is not well seen.  Contribution: Positive  OP distribution: Inappropriate  Co-incentives: Not confirmed (or not clarified) Impact in LATAM: Neutral   Suggestions: This proposal can be seen better if it reduces amounts where other delegates point out. Try to add other incentives such as retroactive gas refunds or trading competitions, taking care of the requested amount. Let us know what do you think. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.307224025974025
                },
                {
                    "author_link": "https://gov.optimism.io/u/vonnie610",
                    "index": "49",
                    "likes": "0",
                    "time": "21/07/2022-11:58:40",
                    "content": "Snapshot vote - not passed ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Kromatika",
                    "index": "50",
                    "likes": "2",
                    "time": "15/08/2022-15:06:19",
                    "content": "Hello @OPUser @william @lefterisjp @Defi_LATAM_axlvaz @solarcurve @polynya @Bobbay_StableLab @Robor2b102 @fig Thanks again for all of your wonderful feedback, we heard what you said and we have rearranged the funds.    [DRAFT] [GF: Phase 1 Proposal Cycle 6 ] Kromatika Governance Fund: Phase 1       Project Name: Kromatika  Author Name: @Aristokrates,@Kacar and @rich  I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: Yes  Number of OP tokens requested: 300.000  L2 Recipient Address: 0x05d235d8Ba95bfc457f9a11F64cf869f0f3f60F9  Grant category: DeFi  Is this proposal applicable to a specific committee?: No  TVL: $966 059 worth of limit orders have been created on optimism before the OP snapshot  [image]  This graph show…      Please take a look, and share your thoughts on our new proposal. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.676136363636363
                },
                {
                    "author_link": "https://gov.optimism.io/u/Kromatika",
                    "index": "51",
                    "likes": "1",
                    "time": "15/08/2022-15:06:29",
                    "content": "@Beta @Cryptoz @555 @Defi_LATAM_axlvaz @linda @fewol @quix ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Bobbay_StableLab",
                    "index": "52",
                    "likes": "1",
                    "time": "16/08/2022-08:43:13",
                    "content": "It is the reflection period, so most might be inactive regarding proposal feedback. I’d said wait until the next voting season begins. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "53",
                    "likes": "0",
                    "time": "13/09/2022-18:34:15",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "87"
}