{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/crnft-crafted-for-creators/4358",
            "title": "CRNFT - Crafted for Creators ",
            "index": 4358,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Governance Fund: Phase 1"
            ],
            "tags": [
                "cycle-8"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/crnft",
                    "index": "1",
                    "likes": "12",
                    "time": "20/12/2022-00:23:24",
                    "content": "Project name: CRNFT Author name and contact info: @crnft Lukas Chmiel art@crnft.art I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: [Yes] L2 recipient address: 0x47CEE63b7CAd5583171AFe378C75E36D9D46C90c Which Voting Cycle are you applying for? : cycle 8 or 9 Grant category: NFT Project description This is a pivot in regards to the previous post where @Michael @FractalVisions @jrocki.eth @maykung @Niki  helped me shape this idea. Since the last proposal, we onboarded more digital fashion designers, architects, and artists. We are a curated marketplace of art, digital fashion, and architecture / later on - decentralized creative agency protocol managed by the community. We aim to create tools for creators, so they can easily produce content for web3. Using blockchain technology we can track where the files are going and how they are being used.** Applicants can come from all creative categories and intellectual pillars: fashion, music, design, technology, art, film, animation, gaming, VR/AR, sustainability, and so on. Young Creatives play a critical role in creating culture, driving innovation, and building wealth – particularly in marginalized communities. Yet, we know that Creatives who are women, people of color, and members of the LGBTQ+ communities face distinct challenges that stem from systems, structures, and practices designed to exclude and preclude them from being successful. Without the ability to invest their own wealth, the result is that businesses owned by entrepreneurs from these communities are overleveraged or are unable to access capital to invest in growth. ​ We have established a Curation Committee (+50 curators at this moment) and would love to add strategic curators from the Optimism eco-system as well. Project links:  Website: https://www.crnft.art   Digital Fashion Foundation which will be integrated to CRNFT soon: https://mint.lucii.io/  Twitter: https://twitter.com/crnftart   [Instagram] https://www.instagram.com/crnft.art  Discord/Discourse/Community: http://discord.gg/FSNUuR96ak   Creator List  Pitch Deck  Product Decentraland Gallery Spatial.io Gallery Additional team member info : Punk 9269 Marek Bardzinski https://www.linkedin.com/in/marcbpunk/ Founder of SMS.API  (European Twilio) acquired by Link Mobility. Founder of 2FAS system for password-less integrations (1Mil users) CEO of Wellcome Home Jacob Gorajek | CPO **https://www.linkedin.com/in/jakubgorajek/ ** Inventor of UnStock which is now part of the Slidely Family. The idea was backed by Netflix co-founder Mitch Lowe, who became the company’s advisor from the first days. Please link to any previous projects the team has meaningfully contributed to: 2FAS SMS.API  Slidely Family ArkiveDAO Lukas Chmiel Inc Competitors, peers, or similar projects https://www.niftygateway.com/   metamundo.co    MetaMundo - Metaverse Marketplace for 3D Collectibles MetaMundo is a highly curated marketplace for purchasing premium quality 3D model NFTs. We offer unique, cutting-edge creations from the world's most-renowned 3D digital creators.         DRESSX    DRESSX Don't shop less, shop digital fashion. First multi brand retailer of digital fashion clothing. Shop digital fashion online at DRESSX.COM. Digital fashion clothes from top designer brands and 3D designers. DRESSX is your Metacloset - wardrobe for the...         UNXD    UNXD: Digital Luxury & Culture NFTs UNXD is a curated NFT marketplace for the best of digital luxury and culture. Featuring NFTs from Dolce&Gabbana, Jacob & Co., and more.         Exclusible   Exclusible | Unlock the Power of Web3 & Metaverse We aim to bridge the gap between the physical & digital products of high valued brands. We work with luxury brands seeking to digitalise their products.      Is/will this project be open-sourced? Yes Optimism native?: Yes. Date of deployment/expected deployment on Optimism: March 1st, 2023 Ecosystem Value Proposition:  we integrate 2.5% Public Good split OP Foundation/ Charity incubation First token-gated XR filters on OP our advisors are top-tier consultants in art, fashion, tech, and architecture. we are breaking systemic issues in the freelance economy producing on-chain footprints onboarding users to OP token-gated tools for creators on OP low gas fee trading integration with OP foundation and OP based protocols  Unfair advantages:   We have a network of top creative producers in the world.   Our creators are the best in web 2 fashion, art and architecture. They are looking to work with crypto powered company rather than big tech.   We understand creators and their feedback is always helping us build the best product.   We already established a network of web3 native partners.   Number of OP tokens requested: 200,000 Did the project apply for or receive OP tokens through the Foundation Partner Fund?: No Proposal for token distribution:  100k OP awarded for creation of the new website on Optimism chain 25k OP awarded to create a brand new identification (  new UIX, website design ) 75k OP awarded to:   cover the marketing of the platform for the next 12 months onboarding new users launching 100 limited NFT collections to develop high-end web3 communities  Timeline: CRNFT V2 on Optimism - up to 3 months from receiving the fund Launching 100+ premium creatives on CRNFT within 1 year. Why will incentivized users and liquidity on Optimism remain after incentives dry up? We will become the most sophisticated and curated metaverse platform managed by community. We will create a lot of Public Good, value in form of art, metaverse spaces, toolkits, workshops, tokengated IRL events and physical products. We want to make this platform social and protect user’s trademarks. ",
                    "links": [
                        "https://www.crnft.art/",
                        "https://mint.lucii.io/",
                        "https://twitter.com/crnftart",
                        "https://www.instagram.com/crnft.art",
                        "https://t.co/FPC1fSmF55",
                        "https://app.pitch.com/app/presentation/42108905-867b-4779-be6b-7edcff606190/b2220dd5-5966-4139-b85a-ad116ab725e4",
                        "https://bit.ly/crnft-deck",
                        "https://app.pitch.com/app/presentation/42108905-867b-4779-be6b-7edcff606190/5a113529-edf4-42a7-b408-9d874219c713/143e484c-3d70-4f6f-b75d-4ad8bb90923c",
                        "https://play.decentraland.org/?position=-54%2C34&realm=dg-diamond",
                        "https://spatial.io/s/CRNFT-Arena-628feb67593f950001755907?utm_source=%2Fspaces",
                        "https://www.linkedin.com/in/marcbpunk/",
                        "https://www.smsapi.com/en",
                        "https://2fas.com/",
                        "https://wellcome-home.com/",
                        "https://www.linkedin.com/in/jakubgorajek/",
                        "https://promo.com/",
                        "https://2fas.com/",
                        "https://www.smsapi.com/en",
                        "https://promo.com/",
                        "https://arkive.net/",
                        "https://www.lukaschmiel.com/",
                        "https://www.niftygateway.com/",
                        "https://www.metamundo.co/",
                        "https://www.metamundo.co/",
                        "https://dressx.com/",
                        "https://dressx.com/",
                        "https://unxd.com/",
                        "https://unxd.com/",
                        "https://www.exclusible.com/",
                        "https://www.exclusible.com/"
                    ],
                    "GPT-summary": "The author of the proposal, CRNFT, is explaining their project, which is a curated marketplace of art, digital fashion, and architecture, and a decentralized creative agency protocol managed by the community. They aim to create tools for creators to easily produce content for web3. The post also includes information about the team, competitors, and the requested amount of OP tokens. The post receives constructive criticism and questions from third parties, and some express interest in collaborating with the project.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Identity and reputation systems",
                        "Community and engagement",
                        "Smart contract updates",
                        "Token economics"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.937360972360972
                },
                {
                    "author_link": "https://gov.optimism.io/u/jrocki.eth",
                    "index": "2",
                    "likes": "4",
                    "time": "20/12/2022-04:30:35",
                    "content": "Right now we are in the process of improving our grant funding proposal review process. But feedback on proposals is always on going so thank you for resubmitting. The next round of grant reviews will restart on Jan 19th ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.142857142857142
                },
                {
                    "author_link": "https://gov.optimism.io/u/crnft",
                    "index": "3",
                    "likes": "3",
                    "time": "20/12/2022-17:49:05",
                    "content": "That’s exciting! Would love to have a little feedback before 29th as i’m meeting potential lead investors who invest in ETH+L2 ecosystems. I have submitted our proposal via form, but haven’t received any answer yet. Thanks @jrocki.eth ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "3rd party wanting to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.8875
                },
                {
                    "author_link": "https://gov.optimism.io/u/Luckymonkey",
                    "index": "4",
                    "likes": "1",
                    "time": "31/12/2022-05:47:21",
                    "content": "Good project! Hope all the NFT projects will be launching any OP marketplaces , maybe QX ! Optimism should be the no. 1 in NFT projects! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/crnft",
                    "index": "5",
                    "likes": "0",
                    "time": "07/01/2023-14:09:09",
                    "content": "I have updated the proposal with the list of creators who expressed interest in launching via CRNFT    Pitch    CRNFT: CREATOR LIST Easily build and share beautiful presentations with Pitch.      ",
                    "links": [
                        "https://app.pitch.com/app/presentation/42108905-867b-4779-be6b-7edcff606190/b2220dd5-5966-4139-b85a-ad116ab725e4"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party expressing interest in collaborating with the project",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 8.208333333333332
                },
                {
                    "author_link": "https://gov.optimism.io/u/Dustin",
                    "index": "6",
                    "likes": "0",
                    "time": "07/01/2023-16:50:35",
                    "content": "Good project! Hope all the NFT projects will be launching any OP marketplaces , maybe QX ! Optimism should be the no. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/crnft",
                    "index": "7",
                    "likes": "1",
                    "time": "01/02/2023-15:27:57",
                    "content": "Hi @Michael @jrocki.eth @FractalVisions @Niki When does the voting starts? Do We need to move this to cycle 10? Appreciate your help ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/FractalVisions",
                    "index": "8",
                    "likes": "2",
                    "time": "01/02/2023-16:06:39",
                    "content": "Here !! @crnft this should lead you to the message from the updates… Please adjust accordingly and coordinate with other members in the Gov General section of the Optimism discord server if you need help.     Opt x PathoMap - Optimistic Healthcare Grants Council       Please note that the form for Season 3 has requirements that are slightly different than the fields posted here. Feel free to update this form to include the questions in the Season 3 proposal template or to submit a new application here.     ",
                    "links": [
                        "https://gov.optimism.io/t/grant-proposal-template/3233",
                        "https://foul-porch-0eb.notion.site/Application-2d47da131a004e94a74e56af9438026b"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party wanting to collaborate on proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.461363636363636
                },
                {
                    "author_link": "https://gov.optimism.io/u/crnft",
                    "index": "9",
                    "likes": "1",
                    "time": "01/02/2023-16:13:40",
                    "content": "Thank you so much @FractalVisions ! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/FractalVisions",
                    "index": "10",
                    "likes": "0",
                    "time": "01/02/2023-16:17:01",
                    "content": "Absolutely!!! Stay Optimistic…  Looking forward to an amazing year. Let me know if you need anything else. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.4765625
                },
                {
                    "author_link": "https://gov.optimism.io/u/crnft",
                    "index": "11",
                    "likes": "1",
                    "time": "01/02/2023-16:30:09",
                    "content": "Here you go! [DRAFT] CRNFT - Digital Art Incubator Thank you and see you on the other side  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.6875
                }
            ]
        }
    ],
    "group_index": "387"
}