{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/draft-gf-phase-1-proposal-sonne-finance/3672",
            "title": "[DRAFT] [GF: Phase 1 Proposal] Sonne Finance ",
            "index": 3672,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Governance Fund: Phase 1"
            ],
            "tags": [
                "season-2"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/SonneFinance",
                    "index": "1",
                    "likes": "23",
                    "time": "10/10/2022-10:26:16",
                    "content": "Project name: Sonne Finance Author name and contact info: Atakan-IntroToDeFi I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: [Yes] L2 recipient address: 0x784B82a27029C9E114b521abcC39D02B3D1DEAf2 Which Voting Cycle are you applying for? : Voting Cycle #8 Grant category: DeFi Is this proposal applicable to a specific committee? This proposal may fall under the remit of various DeFi committees. Project description : Sonne Finance is an EVM compatible lending/borrowing protocol that launched on Optimism. Sonne Finance provides peer-to-peer lending solutions that are fully decentralized, transparent and non-custodial. Similar to (and based from) existing lending platforms, users will be able to lend any supported assets on our platform, and use their capital to borrow supported assets. Sonne aims to be the prime lending platform on Optimism by offering highest competitive incentives for money markets, having the deepest liquidity and being native to Optimism. Sonne innovates on revenue sharing and tokenomics, where stakers of the protocol gets 2 different type of revenues (VELO and SONNE or USDC), as well as being able to choose the reward asset between SONNE and USDC. Project links: Website: https://sonne.finance Twitter: https://twitter.com/SonneFinance Discord/Discourse/Community: Sonne Finance Please include all other relevant links below:  https://docs.sonne.finance Telegram: Contact @SonneFin  Additional team member info : https://twitter.com/DefiIntro We are a team of 5 plus 2 on-demand designers. Our lead developer (gathon) was also the lead developer of one of the biggest NFT marketplaces in Binance smart chain. Amaterasu is working with me for 2 years, and she is working on lending protocols in particular for 10 months now. Our community managers are from AdminGuru team, which provides professional community management services for protocols. We are also friends in real life. Our designers are awarded designers for UI/UX in Turkey. We worked with them for 4 years now (not just for Sonne Finance) and also life-long friends. Currently, I (atakan-IntroToDeFi) am the only one who is doxxed in our team to public, but all the team members are doxxed to me. Relevant usage metrics :  Total Supply: $43M (Achieved in 11 days.) Total Borrow: $30M TVL : $13M Total staked: 3.8M $SONNE (Sonne Finance ☀️🔴)  Competitors, peers, or similar projects (please link): https://aave.com/ Is this project be open sourced? Yes Optimism native?: Yes Date of deployment/expected deployment on Optimism: 28 Sep 2022 Ecosystem Value Proposition: Lending/borrowing protocols are the basis of DeFi, and currently there is no native lending protocol besides Sonne Finance. Being native to Optimism gives us the power of using our tokens to incentivize lending and borrowing heavily. In the past, TVL migrations happened from chain to chain when there are single sided good yields without impermanent loss. It is unlikely that people migrating for 3% yield on USDC, but we already proved that good incentives can change this sentiment. We are planning to be the reason why people migrate and use Optimism, as once they try, they will stick to the fast and cheap transactions. To add to this, competition is always healthy for customers. Right now, AAVE is non-contested liquidity market. Sonne looks to be the prime liquidity market on Optimism with unique tokenomics, and force other competitors to innovate on Optimism. For example, AAVE has no drive to innovate on Optimism, but when there is competition, they will have to innovate or fall back. We have no plans to go multichain. Sonne has one aim. Being the best liquidity market of Optimism and focus only on Optimism ecosystem. Has your project previously applied for an OP grant? No. Number of OP tokens requested: 250,000 Did the project apply for or receive OP tokens through the Foundation Partner Fund?: No How much will your project match in co-incentives? We are already incentivizing users to use Optimism and Sonne with 60% of our tokens, which equals to 1000% of requested OP tokens at current prices. Proposal for token distribution: How will the OP tokens be distributed?  95% will be allocated to lending/borrowing and staking rewards in order to boost activity. Here’s how 95% will be allocated respectfully:  40% will be allocated to supplying incentives. The pool weights of distribution speeds will be the same with $SONNE reward distribution speeds. 40% will be allocated to borrowing incentives. The pool weights of distribution speeds will be the same with $SONNE reward distribution speeds. 10% will be allocated to bribing USDC/SONNE pool on Velodrome Finance. 10% will be allocated to sSONNE and uSONNE staking reward pools.   5% will be allocated to boost development activity of Sonne Finance. (Article writings, twitter threads, dune analytics creations and UI design improvements.)  Over what period of time will the tokens be distributed for each initiative? It will be distributed linearly for 6 months. Please list the milestones/KPIs you expect to achieve for each initiative, considering how each relates to incentivizing sustainable usage and liquidity on Optimism.  $100M Total Market Size in the first month (Already $43M) $300M Total Market Size in 3 months $500M Total Market Size in 6 months  One of the main reasons of this proposal is to have trust of Optimism governance, and assure users that Sonne is here to grow both Optimism’s and its own TVL and activity. Why will incentivized users and liquidity on Optimism remain after incentives dry up? Sonne is looking to incentivize the activity and providing liquidity at least for 3 years (even after the OP incentives end). Liquidity markets are great for single sided yields without impermanent loss, and enables other protocols to boost their activities (such as auto-compounders, or DeFi vaults). We believe that Optimism Mainnet will continue to be the top layer-2 and more opportunities will be created on Optimism in the future as well. Once users get used to a chain and love the community, they hardly move to another chain. We are also trying to be as fast and helpful as possible in our community channels to acquire that love and trust, both for the good sake of Sonne and Optimism. Last but not least, liquidity markets are one of the only protocols providing real yields for suppliers. We can see that with AAVE and Compound on Ethereum are very low on incentives, but they have more than $9B TVL combined on Ethereum Mainnet. We believe that we’ll reach $1B to $2B level on Optimism within 2 years. Please provide any additional information that will facilitate accountability: (smart contracts addresses relevant to the proposal, relevant organizational wallet addresses, etc.) All of the contract addresses and multisig wallet can be found here: Contract Addresses - Sonne Staking data for Sonne Finance:    dune.com    Sonne Finance ☀️🔴 Blockchain ecosystem analytics by and for the community. Explore and share data from Ethereum, xDai, Polygon, Optimism, BSC and Solana for free.      ",
                    "links": [
                        "https://twitter.com/SonneFinance",
                        "http://discord.gg/SonneFinance",
                        "https://docs.sonne.finance",
                        "https://t.me/SonneFin",
                        "https://twitter.com/DefiIntro",
                        "https://dune.com/0xkhmer/sonne-finance",
                        "https://aave.com/",
                        "https://docs.sonne.finance/protocol/contract-addresses",
                        "https://dune.com/0xkhmer/sonne-finance",
                        "https://dune.com/0xkhmer/sonne-finance"
                    ],
                    "GPT-summary": "The post is a draft proposal for a lending/borrowing protocol called Sonne Finance, which is EVM compatible and launched on Optimism. The proposal includes information about the project, its team, usage metrics, competitors, and ecosystem value proposition. The author explains the project's aim to be the prime liquidity market on Optimism and focus only on the Optimism ecosystem. A 3rd party gives entirely positive feedback on the proposal, extending to the project by asking about additional information that will facilitate accountability.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Interoperability and Scaleability",
                        "Token economics",
                        "Board composition",
                        "Privacy, Security and risk management"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.635049474335188
                },
                {
                    "author_link": "https://gov.optimism.io/u/MrVarma",
                    "index": "2",
                    "likes": "2",
                    "time": "10/10/2022-11:11:29",
                    "content": "I really like the project, I wish all the best for the team. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Miso",
                    "index": "3",
                    "likes": "2",
                    "time": "10/10/2022-11:20:02",
                    "content": "I like the project! Have you considered incentivising borrowing more than lending since this would potentially optimize the utilization rates thus making lending more attractive? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/blackflag",
                    "index": "4",
                    "likes": "2",
                    "time": "10/10/2022-11:30:38",
                    "content": "As a long time follower of Atakan-introtodefi both on twitter and youtube, i trust this project of his, all his collective info and vision put into this project of @SonneFinance . I believe this will be long term project, that why i invested in the first day, and thinking to stay as long as it lives. I hope to see both OP and Sonne lives forever. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.125
                },
                {
                    "author_link": "https://gov.optimism.io/u/SonneFinance",
                    "index": "5",
                    "likes": "2",
                    "time": "10/10/2022-12:22:26",
                    "content": "After 1 month, we will incentivize borrowing heavily compared to supplying, we already planned that with our own $SONNE token. ( Reward Emissions and Bribes - Sonne ) But we want to be able to incentivize supplying too, so OP tokens will be used equally for both parts. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.125
                },
                {
                    "author_link": "https://gov.optimism.io/u/0xmauerfall",
                    "index": "6",
                    "likes": "2",
                    "time": "10/10/2022-12:29:12",
                    "content": "I’ve been following the project and participating in their Discord since the Sonne Liquidity Generation Event (LGE). So far, all their communications and actions seem coherent and legit. I wish them good luck. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.625
                },
                {
                    "author_link": "https://gov.optimism.io/u/Netrim",
                    "index": "7",
                    "likes": "5",
                    "time": "10/10/2022-14:09:09",
                    "content": "I have never liked the Total Market Size for Money markets since it includes all the folding being done. A much more safe metric is TVL which Sonne currently has 12.5M, still an impeccable growth over 13 days. Already 13th place on Optimism TVL. As such the milestones/KPI should be targeting TVL targets instead of Total Market Size. Currently the ask+timeline would mean around 10k OP distributed per week. Regarding the timeline I would reduce to 3 to 6 months. Consequently the ask should also be reduced in kind. Remember you can always re apply at a later date once we have confirmation of how the incentives panned out. As I shared on the discord, I am very happy with how the protocol managed the community questions in regards to the admin function administration, a multisig is a much safer option. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.979166666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/SonneFinance",
                    "index": "8",
                    "likes": "5",
                    "time": "10/10/2022-15:01:23",
                    "content": "Yeah I get the criticism about using Total Market Size, but TVL is also not the best metric to evaluate a liquidity market. For example if there are $100M supply and $5M borrow, TVL would be $95M. Comparing this to $43M supply and $33M borrow, TVL would be 1/9 of the size of the previous example, but the second protocol is making 9-10 times more than the first one in protocol revenues, and i would make arguments that second one is healthier. There is not a single metric that is perfect for liquidity markets, but we had to choose one as a KPI. So we chose Total Market Size. We can choose TVL too, as we would have to adjust the targets. For the second part of the suggestion, yeah it makes sense. We edited our proposal to 250k OP for 6 months, and if it succeeds, we can make another proposal. All in the good faith of Optimism and Sonne. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.545787545787546
                },
                {
                    "author_link": "https://gov.optimism.io/u/Ovetta",
                    "index": "9",
                    "likes": "1",
                    "time": "10/10/2022-15:48:48",
                    "content": "I like what Sonne is doing and glad to see the progress your collaboration with Velodrome has made.  Keep up the good work. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/tytytytytytyverymuch",
                    "index": "10",
                    "likes": "1",
                    "time": "10/10/2022-17:24:52",
                    "content": "Sonne is a great addition to Optimism! The team has managed a great launch and doing a good job communicating with the community. I think they’ve developed some really interesting incentive mechanics to sustain high token emission and also partner with other OP protocols like Velodrome. OP incentives on Sonne should attract more people to explore Optimism! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.35
                },
                {
                    "author_link": "https://gov.optimism.io/u/Jadmat.Eth-DefiLatam",
                    "index": "11",
                    "likes": "1",
                    "time": "10/10/2022-19:29:34",
                    "content": "Congratulations on the explosive tvl captured in just a few days.     SonneFinance:  Sonne aspira a ser la principal plataforma de préstamos en Optimism al ofrecer los incentivos competitivos más altos   Do you estimate that after being competitive for high incentives they will be able to continue to be so organically? As you envision the long term when apy goes down, what do you think will be the reasons for choosing Sonne over Aave or Iron Bank?     SonneFinance:  Una vez que los usuarios se acostumbran a una cadena y aman a la comunidad, difícilmente se mudan a otra cadena. También estamos tratando de ser lo más rápidos y útiles posible en nuestros canales comunitarios para adquirir ese amor y confianza, tanto por el bien de Sonne como por el de Optimism.   Do you have any metrics on this? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.254444444444443
                },
                {
                    "author_link": "https://gov.optimism.io/u/marc",
                    "index": "13",
                    "likes": "5",
                    "time": "13/10/2022-09:23:26",
                    "content": "Hello Atakan, thank for your proposal and congrats on your launch on Optimism! Impressive launch, glad more are are joining to build defi on Optimism. Here’s a few notes to help you improve your proposal:     SonneFinance:  Is this project be open sourced? Yes    I have tried looking up your source code, but found your github repo empty. Can you please include links to your code?      SonneFinance:  95% will be allocated to lending/borrowing and staking rewards in order to boost activity. (40% - 40% - 10% - 10% to Lending – Borrowing – Staking – Velodrome Bribes)      Clarify how the allocation for borrowing and lending are distributed to each pool. Are they all split equality between all your pools? Clarify which token will be incentives with 10% of the grant received Clarify which pool will you incentive bribing on Velodrome    If there’s other team members in your team, list them in your proposal   Your value proposition is strong, considering both your speed at your launch and your ability to understand the ecosystem broadly. I think the main concern that you might receive from delegates and the committee is the long term commitment to Soone, given that you have just launched a few weeks ago. My feedback is to you is to prove them that you are in it for the long haul.  Your partnership with velodrome is a great start. Continue building relationships as time goes by Show your source code on your github or add the relevant missing links What’s next for Soone? How will it be bring innovative lending market product? How will it achieve its goal of $1B to $2B level TVL within 2 years on Optimism? Consider writing a few words about this in your proposal  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.8519736842105265
                },
                {
                    "author_link": "https://gov.optimism.io/u/BT1",
                    "index": "14",
                    "likes": "1",
                    "time": "14/10/2022-00:15:58",
                    "content": "I love what Sonne has been doing so far! Very happy with the return and that they engage with their community all the time on a daily basis! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.03125
                },
                {
                    "author_link": "https://gov.optimism.io/u/undercreuse",
                    "index": "15",
                    "likes": "1",
                    "time": "14/10/2022-06:00:02",
                    "content": "I think that a nice build project. it’s fun to see other defi project on optimism. It’s a nice communauty too. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.71875
                },
                {
                    "author_link": "https://gov.optimism.io/u/SonneFinance",
                    "index": "16",
                    "likes": "4",
                    "time": "14/10/2022-10:12:11",
                    "content": "Hello Marc, thanks for the good wishes and suggestions! We’ll open the github repo by the time this proposal is up for voting. The draft will be edited by the time! They will be aligned with the current weight of the pools for SONNE distribution speeds. The future holds if there will be new collaterals/assets in the protocol, but the $OPs will be rewarded based on their weights for speeds at the time. For example right now, stablecoins have each 3/16 weight and wETH and OP have 2/16 weight respectfully. ( If 3 $SONNE is going to sUSD reward pool, 2 $SONNE is going to wETH reward pool, so if 3 $OP is going to sUSD supply incentive pool, 2 $OP will go to wETH supply incentive pool). SONNE/USDC pool on Velodrome will be incentivized with 10%. Updating the draft. Updating the other team members as well. Our long-term goal is to align not just accepting tokens like ETH/OP but liquid financial NFTs to be accepted in our lending protocol. For example, when veVELO is liquid enough (probably not happening in short term), we will consider listing it as a collateralizable asset. This will also enable us to accept real world assets (like real estate) in the very long term. We are already brainstorming and in touch with Turkish real estate exchange but this will take a very long time as well. We think and believe that in order for blockchains and DeFi to achieve its full potential, it needs to start gaining traction in areas where it hasn’t already touched. We are here not just to provide on-chain solutions, but experiment on off-chain ramp. But for now, we are sticking to the safest approach possible. For Sonne to achieve $1B to $2B level, Optimism ecosystem needs to gain traction as well. Vampiring AAVE will not be enough for us. We believe that incentives are running the market for now, and Optimism grants are doing a great work onboarding new builders, but the ecosystem in general lacks incentives for onboarding new users. With the unique staking model of ours, we are able to offer good incentives while holding the price of the token (it’s traded more than the LGE price), and 20% yield on stablecoins like USDC is just hard to deny. We already partnered up with Reaper Farm, and will be partnering up with Beefy which enables huge crowd action towards Optimism ecosystem, and Sonne. Thanks for the suggestions again, editing the draft, and will appreciate the future feedbacks as well! If there are still questions on your mind, or if our answers didn’t satisfy, we’ll try to answer them again! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.928305504019789
                },
                {
                    "author_link": "https://gov.optimism.io/u/ScaleWeb3",
                    "index": "17",
                    "likes": "3",
                    "time": "20/10/2022-09:19:13",
                    "content": "Thank you for your proposal and congrats on your early traction. We see good alignment with Optimism due to being a native Op project & working with Velodrome. The value-add of Sonne & the proposal to Optimism is not yet clear to us though. Value-add     SonneFinance:  Similar to (and based from) existing lending platforms, users will be able to lend any supported assets on our platform, and use their capital to borrow supported assets.       SonneFinance:  Sonne innovates on revenue sharing and tokenomics, where stakers of the protocol gets 2 different type of revenues (VELO and SONNE or USDC), as well as being able to choose the reward asset between SONNE and USDC.   As mentioned, Sonne seems to optimize tokenomics but on the product side you seem to not add value or fill an unexplored niche in the current lending ecosystem on Optimism considering that  Aave, Hundred Finance, Iron Bank, Granary etc. offer already the same or more lending markets with deep enough liquidity for anyone to borrow Stablecoins such as Angle & yield farming/leverage platforms such as Homora & especially Tarot also offer lending for important tokens and in the case of Tarot for more “exotic” tokens/pairs.  Incentives     SonneFinance:  Lending/borrowing protocols are the basis of DeFi, and currently there is no native lending protocol besides Sonne Finance. Being native to Optimism gives us the power of using our tokens to incentivize lending and borrowing heavily.   In our opinion, for liquidity incentives, Optimism should ask for co-incentives. As an Optimism project, and based on your existing distribution schedule, you are dedicating a large amount of your supply. However, the marketcap is $500K which means it may not last long & we cannot really count on these co-incentives. The stated KPIs are ambitious, we see utilization is high, and you’re on a good way to reach your first goal. However, we should ask whether this recursive farming is a good KPI to optimize for and IF we should further incentivize TVL growth with Op tokens? Roadmap of Sonne (might help us understand future value-add)     SonneFinance:  We’ll open the github repo by the time this proposal is up for voting.       SonneFinance:  Our long-term goal is to align not just accepting tokens like ETH/OP but liquid financial NFTs to be accepted in our lending protocol. For example, when veVELO is liquid enough (probably not happening in short term), we will consider listing it as a collateralizable asset.   At this point, it looks hard to support this proposal in its current shape. Maybe some more insights on your near-term roadmap could help us better understand the value-add to Optimism. We see value in an Optimism-native lending product but further advances to the product etc. would likely be a key factor. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.727097505668935
                },
                {
                    "author_link": "https://gov.optimism.io/u/sunnyBTC",
                    "index": "18",
                    "likes": "0",
                    "time": "21/10/2022-07:08:42",
                    "content": "Really  like & support this Defi Project From Beginning. Sonne Finance it is really a great project on optimism , it has gain community trust by its work…Love it….It will be the greatest defi project in future  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "19",
                    "likes": "1",
                    "time": "21/10/2022-07:20:46",
                    "content": "Good to see another Optimism Native project. Do you believe this is the only reason people will move to optimism ?     SonneFinance:  We are planning to be the reason why people migrate and use Optimism, as once they try, they will stick to the fast and cheap transactions.   I would recommend you publish what you have as of now and keep on updating in parallel.     SonneFinance:  We’ll open the github repo by the time this proposal is up for voting. The draft will be edited by the time!   apart form what @ScaleWeb3  has mentioned do you have any stats on user on-boarding such as new addresses, retention ratio. Dune dashboard you shared only contains information related to Sonne token ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.718181818181818
                },
                {
                    "author_link": "https://gov.optimism.io/u/Ngoc",
                    "index": "20",
                    "likes": "1",
                    "time": "21/10/2022-09:53:50",
                    "content": "good to see this proposal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/mastermojo",
                    "index": "21",
                    "likes": "3",
                    "time": "21/10/2022-12:42:53",
                    "content": "I am one of the Synthetix Ambassadors, and a member of the Defi Shadow Committee. I am an Optimism delegate [Delegate Commitments - #65 by mastermojo ] with sufficient voting power, and I believe this proposal is ready to move to a vote. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Defi_LATAM_axlvaz",
                    "index": "22",
                    "likes": "1",
                    "time": "21/10/2022-17:03:20",
                    "content": "Hi, glad to see the Sonne Finance application. Could you please make available the twitter of the members and links to where they worked before or currently?     SonneFinance:  We are a team of 5 plus 2 on-demand designers. Our lead developer (gathon) was also the lead developer of one of the biggest NFT marketplaces in Binance smart chain. Amaterasu is working with me for 2 years, and she is working on lending protocols in particular for 10 months now. Our community managers are from AdminGuru team, which provides professional community management services for protocols. We are also friends in real life. Our designers are awarded designers for UI/UX in Turkey. We worked with them for 4 years now (not just for Sonne Finance) and also life-long friends. Currently, I (atakan-IntroToDeFi) am the only one who is doxxed in our team to public, but all the team members are doxxed to me.   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.79047619047619
                },
                {
                    "author_link": "https://gov.optimism.io/u/SonneFinance",
                    "index": "23",
                    "likes": "4",
                    "time": "21/10/2022-22:40:10",
                    "content": "Hello @ScaleWeb3 and thanks for your appraisal, thoughts and criticism! We believe that it would be unfair to seperate tokenomics from the project, as it’s one of the main reasons for this traction of Sonne Finance. Our ability to create demand for SONNE token, and SONNE staking is what enables us to grow while not destroying the token price. (LGE price was $0.04) Also with the current rate of utilization and total borrows, $250k/yr buying pressure for SONNE is there. (Not considering the VELO reward distribution.) We agree that we haven’t launched an unexplored niche yet, but even now, SONNE is the best liquidity market for OP token. In just 3 weeks, we filled the gap of utilizing OP better than other examples in your message. And as we stated above, competition is healthier for both users and Optimism ecosystem rather than monopoly. Hundred Finance, Iron Bank, Granary etc. is here for longer than us, but had hard time to gather liquidity. This is the power of being native. Also, because we are native to Optimism, we can act fast and do updates faster than our competitors. This may not be an example for filling a gap, but for example, we integrated our pool on Velodrome in our website for ease of users on Optimism: https://sonne.finance/swap Also, wanted to add that Sonne is the only project among those that considering Optimism’s unstable blocks per year in order to calculate the true APR (both supply/borrow and reward APR) for users. Tarot and Homora has isolated pools for leverage farming, so it’s less dangerous for them to have “exotic” liquidity markets. Sonne adding those pairs would danger not just Sonne holders but whole liquidity suppliers. We’ll add those tokens when they have good liquidity on Optimism. Sonne being native and being able to incentivize the activity on Optimism is another value proposition that is supported with the TVL growth on Sonne and Optimism since the day we launched. This short-term success already made an example for other teams to launch on Optimism. We are already in touch with two protocols (to be launched on Optimism as native protocols) to pass the knowledge and experience we had and are having. For co-incentives part; our liquidity from LGE was locked in Velodrome Finance for 6 months and this locked liquidity makes 71% of SONNE/USDC pool and has $125k USDC in the pool. Even everything goes bad, even without considering protocol revenue buying SONNE back, and even without considering VELO distribution incentives for SONNE stakers, our co-incentives will be equal to 75% of asked OP. Based on current trend, the co-incentives will be 819% of asked OP. TVL is one of the biggest marketing tool for DeFi ecosystem and growth of Optimism. Just to give an example to this, a user opening the DefiLlama to see what’s happening in Defi in general, he/she will see this:  image1346×67 9.86 KB  Being in the first eight or not in TVL is a huge difference there for appearance. And it’s just one example. Also, more TVL equals better liquidity and more usage. Although it’s overrated in general, we believe that TVL growth’s importance should not be underrated either. Proposal’s first edit was asking 500k OP for 1 year, and we edited that for 6 months and half the OP asked. Near-term roadmap looks like this:  We are in touch with QiDAO, and will discuss about how MAI can be utilized in Sonne Finance. We are in touch with DLC.Link, and will enable native BTC lending/borrowing on Optimism in 4-5 months. We are in touch with Synthetix to discuss how SNX can be utilized in Sonne Finance to help Synthetix’s grow more on Optimism.  We are in touch with two of the biggest banks in Turkey and Turkish Real Estate Exchange for having collateralized NFT-based loans (for real estate) on-chain, but that doesn’t look like to happen in near term. We are well-equipped for integrating financial NFTs (like veVELO) as collateral, but on-hold for a better environment to launch that. Thanks for the reply and thoughts, and will appreciate future feedbacks as well! If our answers didn’t satisfy, we’ll try to answer them again! ",
                    "links": [
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/e/edf29119ae9ce9140f6f2c20f9310d45752b7474.png"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.719961240310077
                },
                {
                    "author_link": "https://gov.optimism.io/u/SonneFinance",
                    "index": "24",
                    "likes": "1",
                    "time": "21/10/2022-22:48:08",
                    "content": "Hello @OPUser ! We don’t believe that is the only reason will move to Optimism, but also believe that that’s one of the main reasons for migration. Will update the github as soon as possible. Right now we don’t have the exact data for that, but started working on that. It will be up soon. Will edit this message once it’s up. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.7023809523809526
                },
                {
                    "author_link": "https://gov.optimism.io/u/SonneFinance",
                    "index": "25",
                    "likes": "2",
                    "time": "23/10/2022-20:48:04",
                    "content": "Hello @Defi_LATAM_axlvaz . Thanks for the appraisal and sorry that we missed this question. Our developers do not want public doxxing, but if you want, we can provide the information in private message. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 4.625
                },
                {
                    "author_link": "https://gov.optimism.io/u/Netrim",
                    "index": "26",
                    "likes": "2",
                    "time": "25/10/2022-00:11:18",
                    "content": "Not public doxing, but outside of atakan which is a known figure we know very little about the rest of the team.     SonneFinance:  Our lead developer (gathon) was also the lead developer of one of the biggest NFT marketplaces in Binance smart chain.   Which one?     SonneFinance:  Amaterasu is working with me for 2 years, and she is working on lending protocols in particular for 10 months now.   Which ones? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.137202380952381
                },
                {
                    "author_link": "https://gov.optimism.io/u/mauvaison",
                    "index": "27",
                    "likes": "0",
                    "time": "25/10/2022-12:26:51",
                    "content": "Could you touch on your vision for NFT-based loans? I’d be interested to hear your long term view on using uniswap v3 LP positions and other financial NFTs as collateral. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.09375
                },
                {
                    "author_link": "https://gov.optimism.io/u/SonneFinance",
                    "index": "28",
                    "likes": "1",
                    "time": "25/10/2022-13:53:30",
                    "content": "So this was a thread i wrote almost 2 years ago: https://twitter.com/DefiIntro/status/1358059563556237313 This happened last week : https://twitter.com/Rusty_Bill/status/1582098885933027328 We believe that one day DeFi will be just Fi. NFTs (or a better tech in the future) will represent most of real world assets, and people will be able to take loans against them. We are working and will continue to work towards this goal. Right now we are in education phase, as we first need to educate and convince those institutions to make this happen, and it’s a very slow process. But if traditional banks accept real estate as collateral, why shouldn’t we? If you were asking about financial NFTs, the NFTs need to be liquid in platforms like Quix. Let’s say, volume of veVELO or Uniswap v3 LP positions grow a lot on NFT markets. The liquidation can be done with auctions or anyone can pay the borrowing amount to take the position. It has been done with normal NFTs (like BAYC etc.), but it was not a great idea to do so with those assets at that time, as it was endangering suppliers. The UI and UX should improve for the financial position sales. If NFT markets can achieve that, and if people start to trade those positions, and if the volume is good enough for us to integrate, there is no reason why those shouldn’t be collateral. Though, the c-ratios will be very low at first in order to protect our suppliers. It will be a hard task to decide for c-ratios, interest rates etc. for every position for Uniswap v3, but it’s not undoable. NFTs like veVELO won’t be that hard though, so we’ll probably add those first. (the NFTs that represent staking) ",
                    "links": [
                        "https://twitter.com/Rusty_Bill/status/1582098885933027328"
                    ],
                    "GPT-discussion-categories": [
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.548268398268398
                },
                {
                    "author_link": "https://gov.optimism.io/u/SonneFinance",
                    "index": "30",
                    "likes": "1",
                    "time": "27/10/2022-14:52:58",
                    "content": "Hello @Netrim ! For Gathon, we can provide the information privately. He is not comfortable sharing it publicly, as it would instantly doxx him. For Ameterasu, she was working with me in a VR startup for one and a half year. It was an awarded project in Turkey as “Turkey’s best VR/AR product” in 2022, but business-wise it didn’t achieve what we want it to achieve, so we dismissed that project. I had a vision for a long time for liquidity markets, and she was a very good full-stack developer according to our CTO at the time, so I offered her to study solidity/web3 development (specifically liquidity markets) instead of looking for a new job around 10 months ago. She took the offer, killed it and here we are working together to make Sonne shine. Hunger for success and hype of Ameterasu combined with the experience of Gathon made a great combination of a core dev team. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.149862258953168
                },
                {
                    "author_link": "https://gov.optimism.io/u/Netrim",
                    "index": "31",
                    "likes": "1",
                    "time": "27/10/2022-15:07:00",
                    "content": "I am not interested in private doxxing, it would put me in a difficult position all around and I am not a delegate nor a committee member. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.958333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/Slappjakke",
                    "index": "32",
                    "likes": "1",
                    "time": "28/10/2022-15:42:45",
                    "content": "Sonne made a good entry to the optimism ecosystem and i especially like the innovative tokenomics and launch mechanism of getting Protocol Owned Liquidity in the fairest way possible through a LGE. Bribing and farming with POL then distributing POL farmed Velo to its stakers to generate a immediate source of revenue and incentive to stake the token, instead of farm and dump. A new way of launching tokens, only possible on a chain that have a succesful solidly-type dex with good traction. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.272727272727272
                },
                {
                    "author_link": "https://gov.optimism.io/u/Sunfire",
                    "index": "33",
                    "likes": "2",
                    "time": "31/10/2022-22:10:32",
                    "content": "I feel the responses Sonne made to the questions and comments were reasonable and well stated. I believe some healthy competition is good regarding similar protocols. The git repo update does seem a bit important however. From what i’ve gathered from the Sonne docs, the team token allotment has a 2 year linear vest with a 3 month cliff. This seems to show commitment to the project and OP eco. Allowing the community to run diff checks on the source and confirm the vesting contract(s) could be helpful in garnishing support. Hopefully the update indeed does take place soon and might be something that attracts a second delegate to put this to vote. A further note is that the current market size and TVL seems to be about 50% more than what is stated in the proposal. considering this, and the term asks in other proposals, I feel like 250k tokens over six months is more than reasonable. I could be crazy here, but even twice that amount is something I would not oppose although i’m mostly a nobody in opinion weight. Six months imo is a very long time in the defi chrono bubble. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.903333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/Sunfire",
                    "index": "34",
                    "likes": "1",
                    "time": "01/11/2022-19:12:39",
                    "content": "    ScaleWeb3:  In our opinion, for liquidity incentives, Optimism should ask for co-incentives. As an Optimism project, and based on your existing distribution schedule, you are dedicating a large amount of your supply. However, the marketcap is $500K which means it may not last long & we cannot really count on these co-incentives.   market cap is over 1 million. does that mean this figure has doubled to 2000% now?     SonneFinance:  How much will your project match in co-incentives? We are already incentivizing users to use Optimism and Sonne with 60% of our tokens, which equals to 1000% of requested OP tokens at current prices.   I feel like anyone that would have sold from that first big spike after the LGE, would have sold already. The sonne discord looks active and the recent PA seems to be organic in nature. Can never tell of course but i feel like all things considered with sonne on velo and tarot and the native staking apr on the sonne platform…this trend in price appreciation could continue or at the very least hold current market cap. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.991712454212454
                },
                {
                    "author_link": "https://gov.optimism.io/u/Ovetta",
                    "index": "35",
                    "likes": "1",
                    "time": "02/11/2022-02:14:15",
                    "content": "Hello Delegates with enough voting power:  Is the Sonne Proposal far enough along to move to a vote? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.166666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/delllogic68",
                    "index": "36",
                    "likes": "0",
                    "time": "02/12/2022-07:14:33",
                    "content": "I think it maybe a good iead. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/Mingyue",
                    "index": "37",
                    "likes": "0",
                    "time": "07/12/2022-15:43:32",
                    "content": "I support Sonne.      ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "292"
}