{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/introduction-grindery-dao-zapier-for-web3/3605",
            "title": "[Introduction] Grindery DAO \\xe2\\x80\\x93 Zapier for Web3 ",
            "index": 3605,
            "category": [],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/AviKabani",
                    "index": "1",
                    "likes": "3",
                    "time": "01/10/2022-17:16:15",
                    "content": "Introduction As much as Zapier for web3 is a good pitch and title for this post, the more accurate way to describe Grindery is that we are building embedded native integrations that allows users to work many different web2 and web3 tools across different chains, protocols, and DAOs. Grindery is the “middleware for web3”. It’s a decentralized system that can interact with smart contracts as well as web2 APIs. In short, unified, seamless on-, off- and cross-chain integrations. Purpose We are interested in getting more grants specifically from chains and this is one reason why we are here – but this is not an official proposal. We are simply here to say hello and introduce ourselves! We thought an introduction post would be a great way to extend the reach we have with different chains including, Optimism. The project has been around since 2018 with a current team of 12. We have received grants from BinanceLabs Season 4, and additional funding from Near, Algorand, Flow, and Harmony. In the coming days we will post a few more details on our progress in the space and how our tools are helping users! Core Team Tim Delhaes: CEO/Product Tim is a serial entrepreneur who has built, sold, and crashed multiple start-ups in South America and Silicon Valley. Over the last eight years, Tim has also led the journey of the agency group called Inboundlabs from a three-person team to a leading HubSpot partner with over 500 customers. David Semakula: Lead Developer David Semakula is an experienced full-stack developer working with Grindery on all things web3 and integrations. Christian Geissendoerfer: BizDev/Partners Christian is experienced in business development and venture building across Europe and Asia. He is the founder and CEO of YOOSE, the leading expert in location-based marketing solutions in Asia-Pacific and Europe. Joe Hu: Full Stack Dev Joe has been a professional full-stack developer for more than 10 years. He started working with Tim and Christian at InboundLabs from the beginning of its operations. Joe has massive experience on building sites and custom integrations on HubSpot. He loves solving problems and working on code. Outro Please check out our website: grindery.io and connect with me on Telegram: @ Avi Kabani. We appreciate you all taking the time to read our intro and look forward to connecting! ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.206547619047619
                },
                {
                    "author_link": "https://gov.optimism.io/u/AviKabani",
                    "index": "2",
                    "likes": "1",
                    "time": "08/10/2022-13:50:50",
                    "content": "Hello again Optimism! Connecting again to see how we can work together. A few integration use cases we have as the Zapier for web3 app thus far:  Payout system - on a triggering event, execute payout to appropriate wallets.  Ping - When your wallet receives a payment, you get a notification.  Take transactions that happen on the blockchain and post relevant data into a spreadsheet.  When a proposal is submitted, send out a tweet (or other message platform).  Your own idea for connecting Web3 events with Web2 APIs that would work for your chain!  We would love to get some face time and jump on a call or a telegram group! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.4642857142857135
                },
                {
                    "author_link": "https://gov.optimism.io/u/AviKabani",
                    "index": "3",
                    "likes": "1",
                    "time": "14/10/2022-00:40:34",
                    "content": "Following up to see if we can jump on a call or Telegram group with my team! Any response would be appreciated! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "4",
                    "likes": "1",
                    "time": "18/10/2022-12:38:19",
                    "content": "Might be a good idea to post this in gov-general channel on Optimism discord. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/AviKabani",
                    "index": "5",
                    "likes": "1",
                    "time": "18/10/2022-20:26:21",
                    "content": "You got it, I will join and post a smaller intro that would fit more appropriately in Discord. I appreciate your response @OPUser  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                }
            ]
        }
    ],
    "group_index": "286"
}