{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/we-need-direct-promotion-of-op/4060",
            "title": "We need direct promotion of OP ",
            "index": 4060,
            "category": [],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/hait",
                    "index": "1",
                    "likes": "6",
                    "time": "20/11/2022-07:59:57",
                    "content": "I don’t know what other countries are doing now. I am Korean, so I am going to talk about Korean people. Currently, I have invested in Defi and NFT for nearly a year and a half. Including the stock market investment, it’s been more than 10 years, but I think it’s a separate part, so I’ll move on. Anyway, most of the interest in Defi and NFT in the Korean community has declined. However, due to APT and HFT, the interest in WEP3, or airdrop, is very high. So everyone is trying to find this information. I heard that OP is also doing airdrop for the second season, but I think this is the best time to promote it. Why don’t you start promoting it in person rather than wanting people to visit you in person? Assign a certain amount of airdrop to people who collaborate with the community or post quality promotional articles. The coin market is dead, but WEP3, I think the Airdrop market is an opportunity to spread even bigger!! Let’s take the opportunity and make the OP the best. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.1685396825396825
                },
                {
                    "author_link": "https://gov.optimism.io/u/Rivuck",
                    "index": "2",
                    "likes": "0",
                    "time": "08/12/2022-22:35:17",
                    "content": "From where? Elon? Mask is busy nt promoting anything now ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/hait",
                    "index": "3",
                    "likes": "0",
                    "time": "09/12/2022-02:50:09",
                    "content": "I think it’s right to decide the means of publicity by the author himself.  We wish OP would make airdrop quota for promotion to people. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.428571428571428
                }
            ]
        }
    ],
    "group_index": "345"
}