{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/interactwith-fiat-to-nft-onramp-infrastructure-for-apps/5475",
            "title": "InteractWith - Fiat to NFT onramp infrastructure for apps ",
            "index": 5475,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Grants Council"
            ],
            "tags": [
                "builders",
                "cycle-11"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/Adam1",
                    "index": "1",
                    "likes": "1",
                    "time": "07/03/2023-00:19:27",
                    "content": "Basic Details Project name: InteractWith Author name and forum name (please provide a reliable point of contact for the project): Adam Rozichner L2 recipient address: 0xA0399DA270E4304E2eEC564c01BF3AA72811E3B9 Which Voting Cycle are you applying for?: 11 I confirm that I have read the landing pages for the [Builders ] and [Growth Experiments ] Sub-Committees and that I have determined my proposal is best suited to be reviewed by the Builders Sub-Committee: [Yes/No]: YES Project Details What are you going to build?: NFTs infrastructure for apps (APIs, SDKs, Dashboard, Wallet). Plug-and-play web3 infrastructure to integrate NFTs into any app. Fiat to NFT onramp infrastructure - we’re building a familiar web2 user experience by selling NFTs via credit cards. Why is what you are going to build going to succeed?: We offer our core products for free while creating new revenue streams and monetization channels for the app developers Is your project likely to bring new builders to the Optimism ecosystem? If so, please describe how: Our infrastructure of web3 integration tools enables easy integration of web2 apps, brands and games to the OP ecosystem and specifically onboard millions of non-crypto users to mint and trade NFTs on the OP network Is your project likely to improve the quality of developers in the Optimism ecosystem? If so, please describe how: Building our infrastructure on OP has the potential to improve quality of developers by introducing thousands of high-quality web2 devs to the OP ecosystem. Is your project likely to improve the commitment of developers in the Optimism ecosystem? If so, please describe how: As the developers in the OP ecosystem witnesses new revenue streams arriving from web2 apps and brands into the OP ecosystem, their enthusiasm and commitment will rise, driving more dedication from builders in the OP network. Provide us with links to any of the following for the project:  Demo: Website: interactwith.com  Twitter: https://twitter.com/_InteractWith  Discord/Discourse/Community: Github: Other:  Do you have any metrics on the project currently? (TVL, transactions, volume, unique addresses, etc. Optimism metrics preferred; please link to public sources such as Dune Analytics, etc.): Who are your competitors?: Moralis, Tatum, NFTPort, The Easy Company and more. What differentiates you from your competitors?: Our unique offering is centered in: **1) Highly social experience and gamified look and feel within our product. ** **2) Seamless integration for app devs and game studios with lots of docs and live support teams. ** **3) Free core products for developers while most companies charge subscription. ** 4) We create revenue for our customers by sharing the profit with them, while our competitors charge them. Will your project be composable with other projects on Optimism? If so, please explain: Our infrastructure can be connected to any dApp on OP and allow users of that dApp to mint in-app \\ in-game items as NFTs using their credit card, on the OP network. Team Who are your founders?: Adam Rozichner, CEO and co-founder - an experienced and successful CEO with a track record of leading Deloitte’s blockchain consulting department and co-founding a public blockchain company that provides fintech solutions for financial institutions. Omri Raz, our Chief Business Development Officer, is a seasoned executive with a proven track record of success in the tech industry. previously served as COO at Poolz Launchpad, and has founded Defish. Games, a web3 game studio. Miroslaw Shpak, our CTO, is a skilled and experienced CTO with a strong background in technology. He is a super-fullstack developer with a deep understanding of web3 and game studio architecture, and has successfully exited a social network app in the past. Alexey Kuchma, our Chief Product Officer, is a talented CPO with a wealth of experience in product design and management. He has successfully led a web3 game studio and managed a team of 40 employees. What makes your founders well-positioned to accomplish your goals with this project (1-2 sentences on each)?: **Adam - in crypto since 2017, familiar with the corporate side of blockchain companies with deep regulatory understanding, which is important for our Fiat to NFT payment system. ** **Omri - well connected and respected, which supports our BD efforts for creating a valuable network of partners. ** Miro - experienced with building scalable infrastructure solutions. Alexey - visionary product creator who has led all product aspects for a web3 game studio. Tell us about the rest of your team (if there are more teammates): Dean our marketing manager is well experienced with marketing strategies and processes in web3. Is this your first Web3 project?: Nope If not, what else have you built? (Share links, Github repository, or any other useful information.): Web3 game studio - defish. games Public blockchain company in Israel - Tectona .io Blockchain department in Deloitte Israel I understand that Builders grants are subject to a 1 year lock-up, as explained further in this post : [Yes/No]: YES Is your project funded? If so, provide an estimate of how many months of funding runway your project has: We’ve raised $700k on seed and private rounds last year, now we are doing an IDO on the 15-17.03.2023 on Poolz, Enjinstarter and Bullperks for $825k public round, which will keep us going for 40 months at our current burn rate of $20k per month. Grant Request What is the size of the grant request? (50k OP max): 48k OP How do you justify the size of the grant? We need it so we can build an incentive system for the native version of our product on OP, we’ll be using the grant to attract and incentivise app developers and users to integrate and mint NFTs on OP. Roadmap Describe in discrete steps your plan for accomplishing your project: Our step-by-step plan to build an incentive system for the native version of our product on OP: 1. Identify the key goals and metrics we want to achieve with the incentive system, such as the number of app developers and users we want to attract and the amount of NFTs we want to mint on OP. 2. Determine the budget for the incentive system based on the grant amount and other available resources. 3. Develop a clear and easy-to-understand set of rules and guidelines for app developers and users to participate in the incentive system. 4. Design and implement a system for tracking and verifying the activities of app developers and users, such as integrating with OP and minting NFTs. 5. Set up a mechanism for distributing rewards to app developers and users based on their performance and contribution to the ecosystem, such as a token or other forms of incentives. 6. Launch and promote the incentive system to our target audience, such as via social media, newsletters, and other marketing channels. 7. Monitor and evaluate the performance of the incentive system regularly, and make the necessary adjustments based on the feedback and data collected. Please provide any additional information that will facilitate accountability:(smart contracts addresses relevant to the proposal, relevant organizational wallet addresses, etc.) Does your plan depend on the receipt of OP tokens?: That will be determined by the level of demand from within our community to build a native version of our Fiat to NFTs payment system on Optimism. What is your plan for the use of the OP token after the 1 year lock-up?: We’ll use the OP tokens to create the incentive system for our app developers and app users community to build and mint NFTs on OP. Please provide benchmark milestones for this project. These milestones should guide the Optimism community on the progress of your project during the 1-year lock-up period. Our benchmark milestones for integrating to Optimism and creating an incentive system for our dev community build and allow their users to mint NFTs on the Optimism network: 1. Month 1-2: Research and planning phase, including analyzing the current OP ecosystem identifying potential areas for integration. 2. Month 2-3: Development of the necessary smart contract and tools to enable minting and trading of NFTs on the Optimism network. 3. Month 3-4: Testing and optimization of the NFT minting and trading process on the Optimism network. 4. Month 4-5: Launch of the NFT minting and trading feature on the Optimism network, with initial incentives for app developers and users to integrate and mint NFTs. 5. Month 5-6: Analysis of the initial adoption and usage of the NFT minting and trading feature on the Optimism network, with adjustments made to the incentive system as needed. 6. Month 6-7: Expansion of the incentive system to attract more app developers and users to integrate and mint NFTs on the Optimism network. 7. Month 7-8: Partnership and collaboration with other projects in the Optimism ecosystem to create more value and utility for NFTs on the network. 8. Month 8-9: Development of additional features and tools to enhance the NFT minting and trading experience on the Optimism network. 9. Month 9-10: Promotion and marketing of the NFT minting and trading feature on the Optimism network to increase awareness and adoption. 10. Month 10-12: Continued optimization and improvement of the NFT minting and trading feature on the Optimism network, with a focus on building a strong and engaged community of app developers and users. Please define critical milestones for this project. Critical milestones are meant to show good-faith efforts to accomplish the project. Non-completion of these milestones could lead to revocation of remaining grant rewards. 1. Milestone 1 (3 months): Complete the integration of our Fiat to NFT payment system with Optimism’s infrastructure. This will include testing the solution and ensuring a smooth user experience. 2. Milestone 2 (6 months): Launch our native solution on Optimism, including the ability for users to mint NFTs on the network. This will include developing a marketing campaign to attract users to the platform. 3. Milestone 3 (9 months): Build and launch the incentive system for app developers and users to integrate and mint NFTs on Optimism using our web3 integration tools. This will include determining the best incentive structures to use and implementing them on the platform. 4. Milestone 4 (12 months): Reach a significant user base with our platform on Optimism, with a minimum of 1,000 active users and 10,000 total users. This will be achieved through ongoing marketing efforts and improving the user experience of our products. Optimism Relationship Does your project solve a problem for the Optimism ecosystem?: Our project is helping solve the problem of lack of adoption and use cases on the Optimism ecosystem. Despite its potential, many users and developers may not be aware of the benefits of using the Optimism network, or they may not have the necessary tools or knowledge to take advantage of it. By providing a plug-and-play solution for developers to easily integrate web3 capabilities into their applications, and by creating an incentive system for users to mint NFTs on the Optimism network, we’re helping drive the adoption and usage of the Optimism ecosystem. How does your proposal offer a value proposition solving the above problem?: Our proposal offers value by providing a plug-and-play solution for game developers to easily integrate blockchain technology into their games on the Optimism network, creating new opportunities for NFT minting and fostering broader adoption of decentralized technologies in the gaming industry. The incentive system we are creating will attract and incentivize app developers and users to integrate and mint NFTs on the Optimism network, further driving adoption and growth. Why will this solution be a source of growth for the Optimism ecosystem?: Our solution will be a source of growth for the Optimism ecosystem by onboarding many Web2 brands into Optimism, expanding the user base and creating new use cases for the network. This will lead to increased transaction volume, higher demand for Optimism tokens, and more development activity within the ecosystem. How committed are you (and your team) to building on Optimism?: As a founder of InteractWith, I am fully committed to building on Optimism and helping to grow the ecosystem. We are excited about the opportunity to onboard web2 brands into the Optimism network and we understand that building on a new platform can be challenging, but we are committed to working closely with the Optimism community to overcome any obstacles and make this a success. Is your project Optimism Native?: Not yet Confirmations I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: [Yes/No]: YES I understand that I will be expected to following the public grant reporting requirements outlined [here]: [Yes/No]: YES ",
                    "links": [
                        "https://twitter.com/_InteractWith",
                        "https://gov.optimism.io/t/grant-token-lock-explainer/5060"
                    ],
                    "GPT-summary": "The author, Adam Rozichner, proposes to build an NFT infrastructure for apps that includes APIs, SDKs, a dashboard, and a wallet. The infrastructure will allow for a plug-and-play web3 integration of NFTs into any app, as well as a fiat to NFT onramp infrastructure. The author believes that the project will succeed because it offers core products for free while creating new revenue streams and monetization channels for app developers. The proposal is likely to bring new builders to the Optimism ecosystem and improve the quality and commitment of developers. The author requests a grant of 48k OP to build an incentive system for the native version of the product on Optimism.",
                    "GPT-proposal-categories": [
                        "Interoperability and Scaleability",
                        "Grants, Funding and resource allocation",
                        "Smart contract updates",
                        "Community and engagement",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.611723835960477
                },
                {
                    "author_link": "https://gov.optimism.io/u/kaereste",
                    "index": "2",
                    "likes": "1",
                    "time": "14/03/2023-05:58:07",
                    "content": "Hey @Adam1, giving you a heads up that this will be the formal comms channel with the grant council builders subcommittee, which consists of @Gonna.eth,@jackanorak, @danelund.eth, and myself. We’ll make sure we’re around to address any questions you have in this process. We might also be asking additional questions here during the review process so please check this thread for updates on a regular basis. One thing to be mindful of is that in the Cycle 11 we require the milestones to be precisely defined into two categories - critical milestones and benchmark milestones as described in Milestone Assessment . Could you please restructure your milestones description to follow this structure? Some additional questions that came to my mind while reading your proposal, answering them may affect our rating of your proposal:  On which chains are you going to launch InteractWith? You noted that InteractWith is “not yet” Optimism native, but is it going to be exclusive for Optimism or is Optimism going to be just one of the chains you’re going to launch with? Why do you believe Optimism is the best place for launching InteractWith, what are the features of Optimism that make it best suited for launching your platform? How are you going to integrate with fiat onramping? Do you have any ongoing partnerships, which onramp solutions will you integrate with (if any)? Will you use the Grant solely to incentivize building on top of InteractWith? I see that you plan on structuring the details of the incentivization program during the project but can you share any early vision of what would it be and how will it work? It’s important as this is the main usage of the grant distribution if I understand it correctly. What are the revenue streams from your project? You mention that your core product will be free and there won’t be any subscription plans as opposed to your competition - so what exactly will you charge for and how will you split the revenue stream with the teams building on top of InteractWIth?  Thanks in advance for the answers, in case you had any questions don’t hesitate to ask here or reach out to us! ",
                    "links": [
                        "https://gov.optimism.io/u/jackanorak",
                        "https://gov.optimism.io/u/danelund.eth",
                        "https://gov.optimism.io/t/milestone-assessment/5314"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.9523809523809526
                }
            ]
        }
    ],
    "group_index": "568"
}