{
    "poll_list": [
        {
            "id": "0x8160b000b3c2977889daf8ea63a7ead186efde83376c00e9dac3269fb4dcd544",
            "title": "Season 2: Cycle 8:  InsureDAO",
            "discussion": "https://gov.optimism.io/t/review-gf-phase-1-insuredao/3584",
            "body": "This Governance Fund Phase 1 proposal is eligible for voting in Cycle 8. This is the last Voting Cycle of Season 2. \n\nThis proposal was reviewed by [DeFi Committee C](https://gov.optimism.io/t/defi-committee-c-season-2-recommendations/3437/11?u=lavande)[.](https://gov.optimism.io/t/defi-committee-c-season-2-recommendations/3437/6?u=lavande) You can find committee recommendations below:\n[DeFi Committee C Recommendations](https://gov.optimism.io/t/defi-committee-c-season-2-recommendations/3437/11?u=lavande)\n\nShadow DeFi Committee B is not an official committee but posts their own recommendations here: [https://gov.optimism.io/t/defi-shadow-committee-season-2-recommendations/3549/11](https://gov.optimism.io/t/defi-shadow-committee-season-2-recommendations/3549/11)\n    \nBy approving committees, the Token House entered a social contract to entrust and delegate the bulk of decision-making to official committees. However, delegates may vote against the recommendation of official committees but should provide a justification to the community as to why they voted differently.",
            "choices": [
                "For",
                "Against",
                "Abstain"
            ],
            "scores": [
                12353913.239095047,
                692403.2512181018,
                241762.86054912696
            ],
            "start": 1667513397,
            "end": 1668110997,
            "snapshot": "30456637",
            "state": "closed",
            "author": "0x83E54889754e737Fb3CdF07BAaCC0eB9699B6Bdd",
            "space": {
                "id": "opcollective.eth",
                "name": "Optimism Collective"
            }
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/review-gf-phase-1-insuredao/3584",
            "title": "[REVIEW] [GF: Phase 1] InsureDAO ",
            "index": 3584,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Governance Fund: Phase 1"
            ],
            "tags": [
                "season-2",
                "passed",
                "cycle-8"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/rubiokishi",
                    "index": "1",
                    "likes": "4",
                    "time": "29/09/2022-17:13:07",
                    "content": "We are thrilled to launch InsureDAO on the Optimism ecosystem and enhance the ecosystem growth by providing a security backbone for every user and protocol.  Project name: InsureDAO  Author name and contact info (please provide a reliable point of contact for the project): Rubio (Discord: rubio | InsureDAO#9154, TG: @rubiokishi)  I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: Yes  L2 recipient address: 0x29C8942C7fDDe7fCFB46eb6d0FE62f9dED75361c  Which Voting Cycle are you applying for?: Voting Cycle #8  Grant category: Governance Fund Phase 1  Is this proposal applicable to a specific committee?: Yes DeFi Committee  Project description (please explain how your project works): InsureDAO is a DeFi insurance protocol, where users can purchase&sell insurance against any DeFi protocol, and the only DeFi insurance protocol on Optimism now. Currently, insurance against smart contract vulnerability is available to purchase, and we are now preparing for stablecoin de-peg insurance, which is planned to be live in October. Single pools & Index pools There are two types of insurance pools on InsureDAO: Single pool and Index pool. The single pools underwrite each single protocol’s insurance and are isolated from other insurance pools. These pools won’t be affected by payout that occurred in other insurance pools. The Index pools consist of multiple single pools and underwrite multiple protocols’ insurance at once. Liquidity in the pool is diversified across underlying pools and it is leveraged to increase the cover capacity so that returns for underwriters are leveraged. Reserve Pool The reserve pool is the liquidity pool in the case of insolvency. Each time an insurance purchase occurs, a certain percent of the protocol fee is accumulated in the InsureDAO Reserve Pool for reserve. Since index pools leverage their liquidity, there would be a chance that the amount of insurance payment might surpass the actual liquidity if several protocols got hacked at once. If any index pool becomes insolvent, the accumulated liquidity in the reserve pool will be used to pay out surpassed amount. ReportingDAO ReportingDAO is the third party committee, which consists of security experts, such as Quantstamp. The committee is responsible for insurance payment decisions based on its investigation and voting when an incident occurs. API for the integration We have developed an API for insurance integration to other DeFi protocols, which enables users to access insurance for a certain protocol from the partner protocol UI. The partner protocols can earn a referral fee every time insurance is purchased on their end. De-peg insurance (to be launched in October) We are now developing stablecoin de-peg insurance and planning to launch the insurance for sUSD in October. Insurance purchasers will be instantly compensated when a subject stablecoin goes below a target price. On the underwriting side, provided liquidity will be used to make and keep a short position for a subject stablecoin. When a de-peg incident occurs, profit from the short position will be used to compensate insurance purchasers so that underwriters’ funds remain in the pool. Liquidity Investment (to be launched in October) Underwriting liquidity in insurance pools will be utilised in external protocols for capital efficiency. This function allows underwriters to get not only insurance premiums but the additional yield from investment. At the launch, liquidity will be supplied in the Aave USDC pool. Security The protocol got audited by Quantstamp, Peckshield, Solidified, and Code4rena. Also, we are working together with WatchPug for development and security.  Project links:  Website: https://www.insuredao.fi/  Twitter: https://twitter.com/insuredao  Discord: Discord  Gitbook: Welcome to InsureDAO - InsureDAO    Additional team member info (please link): Kohshi (Discord: kohshiba#6911, TG:@kohshiba) Oshun (Discord: Oishun#3920, TG: @oishun) Motoki (Discord: Motoki#5208, TG: @MotokiTakahashi)  Please link to any previous projects the team has meaningfully contributed to: Koshiba is the inventor of ERC2615, and he built a decentralised prediction market, which is called Forecastory, previous to InsureDAO.  Relevant usage metrics (TVL, transactions, volume, unique addresses, etc. Optimism metrics preferred; please link to public sources such as Dune Analytics, etc.): TVL InsureDAO is currently deployed on Ethereum, Optimism, and Astar with a TVL of $693k.  Optimism $200k Mainnet $333k Astar $160k  We are currently not distributing INSURE rewards to underwriters on any chains, and not opening an underwriting function publicly for users on Optimism and Astar. As we are not rewarding underwriters, most liquidity on Mainnet is not in insurance pools but in INSURE staking pool and liquidity mining pool for the INSURE-ETH pair on Uniswap v2, which are currently rewarded with INSURE. Moreover, as the underwriting function is not public, liquidity on Optimism and Astar are provided by the InsureDAO team & partner protocols. We will soon open the underwriting function to any individual users and start rewarding them. Covered protocols: 18 protocols on Optimism Arrakis, Beefy, BeethovenX, dForce, dHEDGE, Hop, Kwenta, Lyra, Rubicon, Perpetual, Pika, Polynomial, PoolTogheter, Synthetix, Tarot, Thales, Velodrome.  Insurance pool for Aave is now suspended, to implement an investment function, using underwriting liquidity on Aave. You can check further detail here (Commonwealth).  Total Cover Amount: $298k The total cover amount of $298k of insurance has been sold on Optimism since the launch in July 2022. The list below shows the best-seller insurances on Optimism in August.  Hop protocol: $70,000 Velodrome: $67,250 Aave: $63,498 Tarot: $35,000 Synthetix: $21478 Beefy: $3585 dHEDGE: $3,040 Lyra: $2,355 Rubicon: $350 PoolTogether: $216  Other metrics You can check further metrics in the links below. Dune: InsureDAO Stats Dashbord DeFi Llama: https://defillama.com/protocol/insuredao  Competitors, peers, or similar projects (please link): Nexus Mutual Risk Harbor Insurace There is no other DeFi insurance protocol deployed on Optimism than InsureDAO.  Is/will this project be open sourced?: Yes  Optimism native?: No  Date of deployment/expected deployment on Optimism: We deployed InsureDAO on Optimism on 6th July.  Ecosystem Value Proposition:  Problem There are lots of risks in the crypto space, such as smart-contract vulnerability. We have seen lots of hackings in the DeFi space, and this year alone, there were more than 40 incidents occurred and over $1.3 billion got hacked. Security remains one of the primary bottlenecks for crypto growth. And also, security is an important component of the growth of any respective chain ecosystem. Potential risks&obstacles to sustainable ecosystem growth  One big exploit may drain users’ funds on the chain. A Diligent team may end up giving up the protocol growth due to one mistake. A major incident may slow down the chain’s own growth. Conservative users may not deposit into protocols on the chain if insurance is not available.  There is so far no DeFi insurance protocol on Optimism. By providing the insurance market available on Optimism, we believe InsureDAO will accelerate the further growth of the Optimism ecosystem.  Value Proposition With this proposal, InsureDAO would like to increase cover capacity (TVL) and encourage users to purchase insurance, thereby protecting more liquidity on Optimism from an unexpected incident. InsureDAO already launched insurance against smart contract vulnerability on Optimism. Our product enables users to cover their funds in DeFi protocols by providing smart contract vulnerability insurance for DeFi protocols on Optimism. Adding to the smart contract vulnerability insurance, we will launch stablecoin de-peg insurance in October to tackle another substantial risk in the DeFi ecosystem. In addition to the deep liquidity in the existing DEXes, de-peg insurance introduces further security for stablecoins on Optimism. In short, we are aiming to strengthen the security of the Optimism ecosystem with insurance, and we believe that introducing the security backbone drives more protocols to be deployed on Optimism, and more users and liquidity to join the ecosystem.  Has your project previously applied for an OP grant?: No  Number of OP tokens requested: 100,000  Did the project apply for or receive OP tokens through the Foundation Partner Fund?: No  How much will your project match in co-incentives? (not required but recommended, when applicable): InsureDAO is designed to incentivise users to provide underwriting liquidity in the form of INSURE emissions, which is the same mechanism Curve uses. That is to say, emissions are allocated across pools by veINSURE voters and therefore it is hard to say how much INSURE incentive will go to the pools on Optimism. However, most insurance is currently purchased on Optimism. Thus we expect that more underwriters to come to Optimism compared with our product on other chains once we open the underwriting function and start incentive distribution and that these underwriters will be motivated to vote for more weight Optimism pools.  Proposal for token distribution:  How will the OP tokens be distributed? (please include % allocated to different initiatives such as user rewards/marketing/liquidity mining. Please also include a justification as to why each of these initiatives aligns with the problem statement this proposal is solving.) Underwriters: 65% (65,000OP) 65% of OP will be distributed to underwriters for both smart contract vulnerability and de-peg insurances that provide liquidity on InsureDAO for one year. We plan to distribute a fixed quantity of OP per week, in the amount of 2,600 OP/week. By calculating the weekly gauge weight allocated to Optimism pools, we can determine the proportional OP allotment toward each pool. InsureDAO is currently not accepting liquidity provisions from users on Optimism. In order to provide liquidity for a larger cover amount, we will open the underwriting function on Optimism, and incentivise underwriters with OP along with insurance premiums and INSURE rewards. By accumulating more liquidity for insurance, more funds on Optimism can be protected. This prevents potential damage to the Optimism ecosystem due to a huge incident and gives users more confidence to join the ecosystem with larger funds. Good projects and their users would be protected, and even if they became victims of hacking they could recover and commit to their growth. Refund half of the insurance premium: 20%(20,000 OP) 20% of OP will be allocated to refund half of the insurance premium to insurance purchasers. Given that the average annual insurance cost on InsureDAO is 4%, this amount will compensate for half of the insurance premium for approximately $750k cover amount of insurance. Insurance has not attracted many DeFi users so far and InsureDAO is still not well known to the public on Optimism. However, many existing users repeatedly purchase insurance with InsureDAO and we think that if we can reach more people, we can increase the number of insurance purchases and covered funds on Optimism. Protocol Integration: 10% (10,000 OP) 10% of OP will be distributed to the integration partners. In addition to the refund campaign, we would like to expand the partnership with protocols for the integration to provide a more user-friendly insurance buying experience. OPs are distributed to our partners for half of the premium paid by users to purchase insurance through the integrated UI. Bribe for INSURE-WETH on Velodrome: 5% (5,000 OP) 5% of OP will be allocated to incentivise INSURE-WETH LP on Velodrome through bribes for one year. In order to incentivise liquidity providers on Uniswap v2 on mainnet to migrate $liquidity into Optimism, we will allocate OP to bribe INSURE-WETH LP on Velodrome. With enough liquidity on Optimism, users will be able to swap INSURE with a low gas fee and will be motivated to stay in the Optimism ecosystem.  Over what period of time will the tokens be distributed for each initiative? Shorter timelines are preferable to longer timelines. Shorter timelines (on the order of weeks) allow teams to quickly demonstrate achievement of milestones, better facilitating additional grants via subsequent proposals. The distribution to underwriters and bribes will take place over 25 weeks. The distribution for refund is unpredictable since it depends on how long it will take to use the allocation to refund. We expect to use the allocation within 6 months by selling a $750k cover amount for both smart contract vulnerability insurance and stablecoin de-peg insurance. The distribution for integration is unpredictable again since it depends on how much insurance will be sold through integration. We expect to use the allocation within 6 months by selling a $375k cover amount of insurance through the integration.  Please list the milestones/KPIs you expect to achieve for each initiative, considering how each relates to incentivizing sustainable usage and liquidity on Optimism. Please keep in mind that progress towards these milestones/KPIs should be trackable. By incentivising insurance selling, we aim to build a sustainable security backbone in the Optimism ecosystem with a large cover capacity. We also need to create an opportunity for people to know more about insurance and its significance. We believe both the large cover capacity and the risk management by each user are vital for the sustainable growth of the ecosystem. Adding to that, by creating liquidity on Velodrome, users will be able to swap INSURE with a low gas fee and will be motivated to stay in the Optimism ecosystem. Underwriting liquidity: $2M Our target APR for underwriters is around 10%. If we assume that we achieve to match the amount of INSURE rewards with OP rewards, we will distribute about $97.5k of rewards to underwriters in total in 6 months. Including organic returns from insurance selling and yields from investment function, we would expect $2M liquidity in the insurance pools. Total insurance selling: $750k & Insurance selling through integration: $375k By promoting insurance for DeFi users on Optimism with a cashback campaign, we would like to achieve to sell a $750k cover amount of insurance in total. We expect that half of the total cover amount will be purchased through integrations. INSURE-WETH LP: $45k If we assume bribes yield a 1.5x return in emission value per bribe on Velodrome, we could reward about $5625 to LPs in 6 months. We would expect $45k liquidity with around 25% APR.  Why will incentivized users and liquidity on Optimism remain after incentives dry up? As for the purchaser-end, insurance becomes more reasonable to purchase with lower gas costs since launched the protocol on Optimism. Indeed, most insurance purchases have occurred on Optimism. With this proposal, we aim to reach more DeFi users on Optimism and accelerate the demand for DeFi insurance. By integrating insurance into other DeFi protocols, users can deposit funds into a certain DeFi protocol and purchase insurance for the protocol at once, which is more user-friendly. Once the demand for insurance starts growing, underwriters will earn a higher organic return (real yield), and the attractive return entices underwriters to deposit more liquidity in insurance pools. Other than organic return, we are going to implement the investment function for further sustainable return, and we will also continue rewarding underwriters with INSURE after the end of the OP incentive. Moreover, we will increase the leverage rate for the index pools in accordance with the liquidity accumulated in the reserve poo, which increases the return for underwriters. Therefore, underwriters will be incentivised to remain liquidity and thereby liquidity becomes anchored on InsureDAO even after the end of OP rewards. Furthermore, InsureDAO has the potential to bring more liquidity and users to other DeFi protocols on Optimism rather than to attract liquidity only on InsureDAO. Mitigating risks by providing insurance, more users and liquidity, including conservative ones, potentially come to the Optimism ecosystem. Also, InsureDAO helps new projects to launch and join the Optimism ecosystem by allowing them to create their own insurance pool. Ultimately, they would be anchored to the Optimism ecosystem even after our incentives dry up, and support its sustainable growth. Edit Based on the feedback we received, we have changed the allocation as follows:  Underwriters 50% → 65% Refund 20% → 20% Integration 5% → 10% Bribe 25% → 5%  Also, we re-calculated and updated the KPIs with the current price of OP ($0.75). ",
                    "links": [
                        "https://twitter.com/insuredao",
                        "https://discord.gg/avx4nFm2KZ",
                        "https://insuredao.gitbook.io/insuredao/",
                        "https://commonwealth.im/voteescrowed-insure/discussion/6891-iip8-insuredao-v2-with-investment-feature",
                        "https://dune.com/insuredao/insuredao-stats-dashbord",
                        "https://defillama.com/protocol/insuredao",
                        "https://app.nexusmutual.io/home",
                        "https://www.riskharbor.com/",
                        "https://www.insurace.io/",
                        "https://gov.optimism.io/t/voting-cycle-8-roundup/3742/12",
                        "https://gov.optimism.io/t/defi-committee-c-season-2-recommendations/3437/11",
                        "https://gov.optimism.io/t/gfx-labs-delegate-communication-thread/2728/19"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.621380960770495
                },
                {
                    "author_link": "https://gov.optimism.io/u/rubiokishi",
                    "index": "2",
                    "likes": "1",
                    "time": "05/10/2022-13:14:08",
                    "content": "I’m tagging @OPUser as It would be great if we could get your feedback on this proposal. Thank you! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "3",
                    "likes": "2",
                    "time": "08/10/2022-15:55:11",
                    "content": "Hi @rubiokishi , Thank you the tag and your proposal. I see a demand of such protocol, total value locked is low but its growing since launch. KPI are well defined and distribution plan is clear. My only suggestion is to focus on securing more locked liquidity in protocol so i would suggest you remove 20% of Bribe and move it to either protocol integration or towards underwriters. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/rubiokishi",
                    "index": "4",
                    "likes": "0",
                    "time": "11/10/2022-15:51:31",
                    "content": "Hi @OPUser , Thank you for the feedback. I understand your point regarding the bribe part. We will rethink the allocation. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/rubiokishi",
                    "index": "5",
                    "likes": "0",
                    "time": "12/10/2022-14:47:43",
                    "content": "Hi, We have amended the proposal, especially the allocation based on the feedback. Could you guys check out our updated proposal and give us additional feedback? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "6",
                    "likes": "3",
                    "time": "12/10/2022-15:14:32",
                    "content": "Thanks, make sure to get two delegate approvals and read through gov doc. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/rubiokishi",
                    "index": "7",
                    "likes": "0",
                    "time": "12/10/2022-16:50:37",
                    "content": "Ok, thanks! Should we reach out to some delegates directly and ask for their feedback and approval? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.416666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "8",
                    "likes": "1",
                    "time": "12/10/2022-17:39:22",
                    "content": "ask for approval on gov-general channel in discord, you can also reach out to them directly. Once the next cycle begins, tag me and if i have sufficient voting power then i would be happy to support you. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/alexcutlerdoteth",
                    "index": "9",
                    "likes": "0",
                    "time": "12/10/2022-18:01:10",
                    "content": "@OPUser: Can you explain why you are directing a protocol to remove token liquidity incentives when others have received grants with them included? @rubiokishi: What would be good to understand so other delegates can weigh-in and advise on the bribe component is what the that the INSURE token plays in your protocols operation and what liquidity level is required to effectively support it. As the Velodrome Team we can also advise on the size of bribes required to achieve your goals so that any grant could be appropriately right-sized on that basis. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.09375
                },
                {
                    "author_link": "https://gov.optimism.io/u/rubiokishi",
                    "index": "10",
                    "likes": "0",
                    "time": "14/10/2022-00:32:39",
                    "content": "Hi @alexcutlerdoteth , Thank you for the feedback! InsureDAO uses the veTokenomics and the gauge weight mechanism, which is the same as Curve. Incentivising users to provide underwriting liquidity in the form of INSURE emissions, and each weekly allocation across pools is determined by veINSURE voting. Assuming that we successfully allocate the co-matched amount of INSURE rewards to insurance pools on Optimism, $48750 of INSURE rewards will be distributed in 6 months. So, we are thinking roughly $45k of liquidity for DEX can be the minimum level for the start, still, we would like to accumulate more liquidity by increasing bribe more. It would be really appreciated if we could get your advice on the size of liquidity and bribes required further. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.321428571428571
                },
                {
                    "author_link": "https://gov.optimism.io/u/rubiokishi",
                    "index": "11",
                    "likes": "1",
                    "time": "20/10/2022-17:07:42",
                    "content": "InsureDAO is now looking to get 2 delegate approvals for cycle #8, or any additional feedback for a further amendment if needed. @OPUser, @SEED_LATAM_Joxes, @MinimalGravitas, @Gonna.eth, @ScaleWeb3, @GFXlabs ,  @linda ,  @Bobbay_StableLab, @fig, @katie ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Capt-Holt",
                    "index": "12",
                    "likes": "0",
                    "time": "20/10/2022-18:39:21",
                    "content": "Glad to see the value this project will bring. Support. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "13",
                    "likes": "0",
                    "time": "20/10/2022-19:36:59",
                    "content": "HI @rubiokishi , Thank you for the tag but unfortunately my support wont be considered as a valid delegate approval as i no longer hold 0.5% voting power but dont worry, others will help you. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 2.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "14",
                    "likes": "0",
                    "time": "21/10/2022-11:36:03",
                    "content": "Hey @rubiokishi , I don’t hold 0.5% voting power to support this, thank you for reaching out! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/rubiokishi",
                    "index": "15",
                    "likes": "1",
                    "time": "23/10/2022-18:07:10",
                    "content": "@OPUser @Gonna.eth, Thank you for replying. Let me know if you have any additional feedback on the proposal! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/mastermojo",
                    "index": "16",
                    "likes": "1",
                    "time": "25/10/2022-15:24:00",
                    "content": "I am one of the Synthetix Ambassadors, and a member of the Defi Shadow Committee. I am an Optimism delegate [Delegate Commitments - #65 by mastermojo ] with sufficient voting power, and I believe this proposal is ready to move to a vote. ",
                    "links": [
                        "https://gov.optimism.io/t/voting-cycle-8-roundup/3742/12"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/rubiokishi",
                    "index": "17",
                    "likes": "0",
                    "time": "25/10/2022-18:50:57",
                    "content": "Hi @SEED_LATAM_Joxes, @MinimalGravitas, @ScaleWeb3, @GFXlabs , @linda , @Bobbay_StableLab, @fig, @katie, @jackanorak, @MoneyManDoug This is not asking for endorsement, but we need one more approval. Would you mind approving our proposal to be reviewed in week 2? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/katie",
                    "index": "18",
                    "likes": "1",
                    "time": "25/10/2022-19:00:43",
                    "content": "I am an Optimism delegate [Delegate Commitments - #18 by katie] with sufficient voting power and I believe this proposal is ready to move to a vote. ",
                    "links": [
                        "https://gov.optimism.io/t/voting-cycle-8-roundup/3742/12"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/ScaleWeb3",
                    "index": "20",
                    "likes": "0",
                    "time": "01/11/2022-09:33:09",
                    "content": "Thank you for this interesting proposal. We believe different sorts of insurance are key drivers of liquidity as they enable the management of risks whether that is general price risk, smart contract risk or total value at risk. We got a couple of questions:  Growth  Why is it that you have much lower TVL & underwriting than other insurance providers incl. smallcaps such as Insurace? The projects you support on Optimism have all reached their ceiling. What’s holding you back from getting more organic liquidity/underwriting and consequently offering more insurance cover?   Reporting DAO  Who is part of the reporting committee?   De-peg insurance  Will automatic payouts be similar to Risk Harbor’s small vault on Optimism that underwrites a couple of different protocols and “pays out within 3 blocks if the SUSDC token does not redeem for enough of the underlying token”) or will it follow the claim process from your docs?   Pricing, Calculations, Risk Framework, Risk Management? (maybe refer to the following points)  Short-position for stablecoin comes at a continuous cost vs. potential payoff in the future Liquidity investment should generate yield but adds additional risk Single & Index pools: Unslashed Finance’s top pool (Spartan Bucket) got overused and they had to racalibrate and de-risk, for example by removing USDN peg policy The reserve pool is rather small…   Claims  Insuredao had no claims yet, correct?    The proposal InsureDAO is not the first offering insurance on Optimism as Risk Harbor and Nexus Mutual also offer cover for Op projects. On other protocols, the stablecoin and leverage farming pools are most used as professionals lock-in returns. Insuredao offers support for more protocols on Optimism than any other but reached limits. From what we’ve seen, InsureDao is a microcap with rather small underwriting, small reserve pool and little liquidity for cover purchasers so far. With incentives, the underwriting could indeed significantly grow and help your protocol as well as the listed protocols  The proposal looks reasonable in size and value-add. We mainly hope to get some insight to risk management to avoid surprises for insurance purchasers before incentivizing vault growth. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.481179971988795
                },
                {
                    "author_link": "https://gov.optimism.io/u/rubiokishi",
                    "index": "21",
                    "likes": "1",
                    "time": "01/11/2022-17:55:50",
                    "content": "Thank you for your questions! Following are the replies to your questions!  Growth Why is it that you have much lower TVL & underwriting than other insurance providers incl. smallcaps such as Insurace?  We haven’t allowed users to provide liquidity as underwriters so far. We will open the underwriting function this week and start to incentivise underwriters in December.  The projects you support on Optimism have all reached their ceiling. What’s holding you back from getting more organic liquidity/underwriting and consequently offering more insurance cover?  They haven’t yet reached ceilings, but little liquidity left for some covers such as for Lyra. Once we open the underwriting function, we will initiate a dynamic pricing model for premiums so that premiums for popular covers become higher which attracts users to provide more liquidity.  ReportingDAO Who is part of the reporting committee?  Members are the followings:  Quantstamp  Sentnl  Pessimistic  WATCHPUG  InsureDAO core team  More members can be elected or they can be excluded based on the governance voting by tokenholders.  De-peg insurance Will automatic payouts be similar to Risk Harbor’s small vault on Optimism that underwrites a couple of different protocols and “pays out within 3 blocks if the SUSDC token does not redeem for enough of the underlying token”) or will it follow the claim process from your docs?  Depeg insurance pools only underwrite their own subject stablecoin so this part is different from Risk Harbor’s vault. Additionally, their cover amount will be hedged by the short position for their subject stablecoin, so underwriters won’t lose their funds even if the payout event occurred. We believe this mechanism attracts more underwriting liquidity than any other depeg insurance on other insurance protocols. But yes, the payout will be similar to the Risk Harbor model. Claims will be automatically valid when a subject stablecoin is depegged based on Chainlink’s Oracle, therefore, buyers don’t need to submit proof of loss for claims but only have to send the USDC for the cover amount and can claim the full amount regardless of their status. The default ratio and the payout ratio are still under adjustment but will be more purchaser friendly on InsureDAO. You can read more details in the tweet thread below.  twitter.com    InsureDAO( *️⃣, *️⃣ ) @insuredao  Here’s the article. medium.com/insuredao/intr…   10:07 PM - 26 Sep 2022           2             Pricing, Calculations, Risk Framework, Risk Management? (maybe refer to the following points)  Once we open the underwriting function, we will initiate a dynamic premium pricing model which is based on demand and supply. Each starting price will be determined by the analysis of risks by the reporting committee.  Short-position for stablecoin comes at a continuous cost vs. potential payoff in the future  As for the de-peg insurance, the hedge cost for short-position is paid by cover purchasers, and purchasers don’t need to pay the additional cost. By using InsureDAO, users don’t need to deposit collateral to build a certain short position, therefore more capital efficient. On the underwriters’ side, their rewards are derived from the supply yield in the lending protocol used to short a subject stablecoin. As a result of the short position, underwriters will get leveraged returns, so they can earn more returns rather than simply lending their funds directly to the lending protocol.  Liquidity investment should generate yield but adds additional risk  You’re right. So, with the reporting committee, we analyse risks and choose the protocols that got audited multiple times and even have their own security funds such as Aave at the moment.  Single & Index pools: Unslashed Finance’s top pool (Spartan Bucket) got overused and they had to racalibrate and de-risk, for example by removing USDN peg policy  Firstly, Index pools are created only by the core team based on the risk analysis by the reporting committee, and only selected pools will be included in the index pools. Moreover, as our insurance pool model is not the all-in-one pool and there will be 4 index pools which are segregated from each other, risks are diversified not only inside the index pool but across multiple index pools.  The reserve pool is rather small…  We will incentivise users to provide liquidity to the reserve pool as well when we start the farming for underwriters. Moreover, the reserve pool will grow along with the insurance purchases since a portion of the premium will go and be locked to the pool. The leverage rate will also increase based on the amount of the reserve pool.  Claims Insuredao had no claims yet, correct?  Correct.  InsureDAO is not the first offering insurance on Optimism as Risk Harbor and Nexus Mutual also offer cover for Op projects. On other protocols, the stablecoin and leverage farming pools are most used as professionals lock-in returns. Insuredao offers support for more protocols on Optimism than any other but reached limits.  InsureDAO is the first insurance protocol launched on InsureDAO. As Risk Harbor is deployed on Optimism recently, we are not the only insurance protocol but still provide cover for more protocols that are not covered by Risk Harbor. Users can purchase covers for Op projects from Nexus Mutual as well, but the protocol is not on Optimism. We believe purchasing cover without switching chains brings a better experience to users on Optimism.  From what we’ve seen, InsureDao is a microcap with rather small underwriting, small reserve pool and little liquidity for cover purchasers so far. With incentives, the underwriting could indeed significantly grow and help your protocol as well as the listed protocols The proposal looks reasonable in size and value-add. We mainly hope to get some insight to risk management to avoid surprises for insurance purchasers before incentivizing vault growth.  Yes, with incentives, we would like to increase capacity and protect more funds in the Optimism ecosystem. Hope this reply answers your question. Finally, thanks again for your time and questions! ",
                    "links": [
                        "https://sentnl.io/",
                        "https://pessimistic.io/",
                        "https://www.watchpug.org/",
                        "https://core.riskharbor.com/vault/optimism/0xfB969b45Fa9186CD8B420407552aD447F7c3817b",
                        "https://twitter.com/insuredao/status/1574521149974683648",
                        "https://twitter.com/insuredao/status/1574521149974683648",
                        "https://twitter.com/insuredao/status/1574521149974683648",
                        "https://medium.com/insuredao/introducing-insuredao-stablecoin-depeg-risk-protection-a5510787e5cb",
                        "https://twitter.com/insuredao/status/1574521149974683648"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.617857142857142
                },
                {
                    "author_link": "https://gov.optimism.io/u/ScaleWeb3",
                    "index": "22",
                    "likes": "1",
                    "time": "01/11/2022-18:16:24",
                    "content": "Thank you for the replies.That clarifies most questions. We believe it would be great for your users to see some risk framework like this or this in the future. ",
                    "links": [
                        "https://docs.euler.finance/euler-protocol/getting-started/methodology"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.166666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/rubiokishi",
                    "index": "23",
                    "likes": "0",
                    "time": "01/11/2022-18:22:20",
                    "content": "I agree with that. We will work on the documentation about our risk framework! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "24",
                    "likes": "0",
                    "time": "02/11/2022-20:06:28",
                    "content": "additional context on co-incentives.  image2795×887 300 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "25",
                    "likes": "2",
                    "time": "02/11/2022-20:15:53",
                    "content": "Recommendation from DeFi committee C Details The proposal is well formulated, clear and descriptive. Also, the IsuranceDAO team answered all the questions in the forum and updated their proposal according to the comments received. Value-Add InsuranceDAO is the only native insurance protocol in Optimism offering insurance for more Op projects (18) than others. The proposal mainly plans to achieve more liquidity (-> underwriting) which would enable more cover purchases and more risk hedging. Traction Insuredao is a relatively new, small project compared to other players in the insurance area, such as Nexus Mutual and Insurace, with less than $1M in total coverage. Traction is small as they didn’t allow users to underwrite so far but limits per project are reached on Optimism & they are opening the underwriting function now. This grant could be catalytic and lead to a kickstart. Amount 100K OP seems reasonable for the size of the project. Distribution is mainly focused on incentivizing liquidity and a small amount for integrations and token liquidity. Co-incentives Not officially confirmed but will try to match. Alignment InsuranceDAO has the highest number of hedges in the optimism chain. This could be interpreted as an indication that it’s aligned with the network. KPIs $2M Liquidity $1M Insurance Purchases $45K Pool liquidity for Insure-WETH on Velodrome Recommendation:- YES Our past recommendation is available on committee recommendation thread ",
                    "links": [
                        "https://gov.optimism.io/t/defi-committee-c-season-2-recommendations/3437",
                        "https://gov.optimism.io/t/gfx-labs-delegate-communication-thread/2728/19",
                        "https://gov.optimism.io/t/defi-committee-c-season-2-recommendations/3437/11"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.566197691197691
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "26",
                    "likes": "0",
                    "time": "03/11/2022-20:13:03",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "27",
                    "likes": "0",
                    "time": "03/11/2022-20:51:03",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "28",
                    "likes": "0",
                    "time": "09/11/2022-13:37:49",
                    "content": "I will vote FOR this proposal, following committee recommendation. Happy to see the team adjust to feedback.     OPUser:  The proposal is well formulated, clear and descriptive. Also, the IsuranceDAO team answered all the questions in the forum and updated their proposal according to the comments received. Value-Add InsuranceDAO is the only native insurance protocol in Optimism offering insurance for more Op projects (18) than others. The proposal mainly plans to achieve more liquidity (-> underwriting) which would enable more cover purchases and more risk hedging. Traction Insuredao is a relatively new, small project compared to other players in the insurance area, such as Nexus Mutual and Insurace, with less than $1M in total coverage. Traction is small as they didn’t allow users to underwrite so far but limits per project are reached on Optimism & they are opening the underwriting function now. This grant could be catalytic and lead to a kickstart. Amount 100K OP seems reasonable for the size of the project. Distribution is mainly focused on incentivizing liquidity and a small amount for integrations and token liquidity. Co-incentives Not officially confirmed but will try to match. Alignment InsuranceDAO has the highest number of hedges in the optimism chain. This could be interpreted as an indication that it’s aligned with the network. KPIs $2M Liquidity $1M Insurance Purchases $45K Pool liquidity for Insure-WETH on Velodrome   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.720959595959596
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "29",
                    "likes": "0",
                    "time": "14/11/2022-16:38:34",
                    "content": "Snapshot vote - Passed ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "30",
                    "likes": "0",
                    "time": "14/11/2022-16:40:26",
                    "content": "@rubiokishi can you provide a Telegram handle or other contact method so the Optimism team can get in touch about paying out this grant! Feel free to comment on this thread, DM, or email palash@optimism.io ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.609375
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "31",
                    "likes": "0",
                    "time": "14/11/2022-16:40:29",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        },
        {
            "thread_link": "https://gov.optimism.io/t/draft-gf-phase-1-proposal-insuredao/3609",
            "title": "[DRAFT] [GF: Phase 1 Proposal] InsureDAO ",
            "index": 3609,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Governance Fund: Phase 1"
            ],
            "tags": [
                "cycle-7"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/Motoki",
                    "index": "1",
                    "likes": "3",
                    "time": "02/10/2022-20:12:03",
                    "content": "Project name: InsureDAO Author name and contact info (please provide a reliable point of contact for the project): Motoki (Discord: Motoki#5208, TG: MotokiTakahashi) I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: Yes L2 recipient address: TBD Grant category: Governance Fund Phase 1 Is this proposal applicable to a specific committee?: Yes DeFi Committee Project description (please explain how your project works): InsureDAO is a decentralised insurance protocol, where users can purchase&sell insurance for any DeFi protocol, and the only DeFi insurance protocol on Optimism now. Currently, insurance for smart contract vulnerability is available to purchase, and we are now preparing for stablecoin de-peg insurance, which is planned to be live in October.   Single pools & Index pools There are two types of insurance pools on InsureDAO: Single pool and Index pool. The single pools underwrite each single protocol’s insurance and are isolated from other insurance pools. These pools won’t be affected by payout that occurred in other insurance pools. The Index pools consist of multiple single pools and underwrite multiple protocols’ insurance at once. Liquidity in the pool is diversified across underlying pools and it is leveraged to increase the cover capacity so that returns for underwriters are leveraged.   Reserve Pool The Reserve pool is the liquidity pool for the case of insolvency. Each time an insurance purchase occurs, a certain percent of the protocol fee is accumulated in the InsureDAO Reserve Pool for reserve. Since index pools leverage their liquidity, there would be a chance that the amount of insurance payment might surpass the actual liquidity if several protocols got hacked at once. If any index pool becomes insolvent, the accumulated liquidity in the reserve pool will be used to pay out surpassed amount.   ReportingDAO ReportingDAO is the third party committee, which consists of security experts, such as Quantstamp. The committee is responsible for insurance payment decisions based on its investigation and voting when an incident occurs.   API for the integration We have developed an API for insurance integration to other DeFi protocols, which enables users to access insurance for a subject protocol from its UI. The partner protocols can earn a referral fee every time insurance is purchased on their end.   De-peg insurance (to be launched in October) We are now developing stablecoin de-peg insurance and planning to launch the insurance for sUSD in October. Insurance purchasers will be instantly compensated when a subject stablecoin goes below a target price. On the underwriting side, provided liquidity will be used to make and keep a short position for a subject stablecoin. When a de-peg incident occurs, profit from the short position will be used to compensate insurance purchasers so that underwriters’ funds still remain in the pool.   Liquidity Investment (to be launched in October) Underwriting liquidity in insurance pools will be utilised in external protocols for capital efficiency. This function allows underwriters to get not only insurance premiums but the additional yield from investment. At the launch, liquidity will be supplied in the Aave USDC pool.   Security The protocol got audited by Quantstamp, Peckshield, Solidified, and Code4rena. Also, we are working together with WatchPug for development and security.   Project links:  Website: https://www.insuredao.fi/   Additional team member info (please link): Kohshi (Discord: kohshiba#6911, TG: kohshiba) Oishun (Discord: Oishun#3920, TG: oishun1112_ja) Rubio (Discord: rubio | InsureDAO#9154, TG: rubiokishi) Please link to any previous projects the team has meaningfully contributed to: Koshiba is the inventor of ERC2615, and he built a decentralized prediction market, which is called Forecastory, previous to InsureDAO. Relevant usage metrics (TVL, transactions, volume, unique addresses, etc. Optimism metrics preferred; please link to public sources such as Dune Analytics, etc.): TVL InsureDAO is currently deployed on Ethereum, Optimism, and Astar with a TVL of $680k.  Optimism $200k Mainnet $320k Astar $160k  We are currently not distributing INSURE rewards to underwriters on any chains, and not opening an underwriting function publicly for users on Optimism and Astar. As we are not rewarding underwriters, most liquidity on Mainnet is not in insurance pools but in INSURE staking pool and liquidity mining pool for the INSURE-ETH pair on Uniswap v2, which are currently rewarded with INSURE. Moreover, as the underwriting function is not public, liquidity on Optimism and Astar are provided by the InsureDAO team & partner protocols. We will soon open the underwriting function to any individual users and start rewarding them. Covered protocols: 18 protocols on Optimism Arrakis, Beefy, BeethovenX, dForce, dHEDGE, Hop, Kwenta, Lyra, Rubicon, Perpetual, Pika, Polynomial, PoolTogheter, Synthetix, Tarot, Thales, Velodrome. Total Cover Amount: $298k The total cover amount of $298k of insurance has been sold on Optimism since the launch in July 2022. The list below shows the best-seller insurances on Optimism in August.  Hop protocol: $70,000 Velodrome: $67,250 Aave: $63,498 Tarot: $35,000 Synthetix: $21478 Beefy: $3585 dHEDGE: $3,040 Lyra: $2,355 Rubicon: $350 PoolTogether: $216  Other metrics You can check further metrics in the links below. Dune: InsureDAO Stats Dashbord Competitors, peers, or similar projects (please link): Nexus Mutual Risk Harbor Insurace There is no other DeFi insurance protocol deployed on Optimism than InsureDAO. Is/will this project be open sourced?: Yes Optimism native?: No Date of deployment/expected deployment on Optimism: We deployed InsureDAO on Optimism on 6th July. Ecosystem Value Proposition: Problem There are lots of risks in the crypto space, such as smart-contract vulnerability. We have seen lots of hackings in the DeFi space, and this year alone, there were more than 40 incidents occurred and over $1.3 billion got hacked. Security remains one of the primary bottlenecks for crypto growth. And also, security is an important component of the growth of any respective chain ecosystem. There are several risks and obstacles to sustainable ecosystem growth as follows:  One big exploit may drain users’ funds on the chain. A Diligent team may end up giving up the protocol growth due to one mistake. A major incident may slow down the chain’s own growth. Conservative users may not deposit into protocols on the chain if insurance is not available.  There is so far no DeFi insurance protocol on Optimism. By providing the insurance market available on Optimism, we believe InsureDAO will accelerate the further growth of the Optimism ecosystem. Value Proposition With this proposal, InsureDAO would like to increase cover capacity (TVL) and encourage users to purchase insurance, thereby protecting more liquidity on Optimism from an unexpected incident. InsureDAO already launched insurance for smart contract vulnerability on Optimism. Our product enables users to cover their funds in DeFi protocols by providing smart contract vulnerability insurance for DeFi protocols on Optimism. Adding to the smart contract vulnerability insurance, we will launch stablecoin de-peg insurance in October to tackle another substantial risk in the DeFi ecosystem. In addition to the deep liquidity in the existing DEXes, de-peg insurance introduces further security for stablecoins on Optimism. In short, we are aiming to strengthen the security of the Optimism ecosystem with insurance, and we believe that introducing the security backbone drives more protocols to be deployed on Optimism, and more users and liquidity to join the ecosystem. Has your project previously applied for an OP grant?: No Number of OP tokens requested: 100,000 Did the project apply for or receive OP tokens through the Foundation Partner Fund?: No How much will your project match in co-incentives? (not required but recommended, when applicable): InsureDAO is designed to incentivise users to provide underwriting liquidity in the form of INSURE emissions, which is the same mechanism Curve uses. That is to say, emissions are allocated across pools by veINSURE voters and therefore it is hard to say how much INSURE incentive will go to the pools on Optimism. However, most insurance is currently purchased on Optimism. Thus we expect that more underwriters to come to Optimism compared with our product on other chains once we open the underwriting function and start incentive distribution and that these underwriters will be motivated to vote for more weight Optimism pools. Proposal for token distribution: How will the OP tokens be distributed? (please include % allocated to different initiatives such as user rewards/marketing/liquidity mining. Please also include a justification as to why each of these initiatives align with the problem statement this proposal is solving.)  Underwriters: 50% (50,000OP)  50% of OP will be distributed to underwriters for both smart contract vulnerability and de-peg insurances that provide liquidity on InsureDAO for one year. We plan to distribute a fixed quantity of OP per week, in the amount of 2,000 OP/week. Calculating the weekly gauge weight allocated to Optimism pools, we can determine the proportional OP allocation for each pool. By accumulating more liquidity for insurance, more funds on Optimism can be protected. This prevents potential damage to the Optimism ecosystem due to a huge incident and gives users more confidence to join the ecosystem with larger funds. Good projects and their users would be protected, and even if they became victims of hacking they could recover and commit to their growth.  Refund half of the insurance premium: 20%(20,000 OP)  20% of OP will be allocated to refund half of the insurance premium to insurance purchasers. Given that the average annual insurance cost on InsureDAO is 4%, this amount will compensate for half of the insurance premium for approximately $1M cover amount of insurance. Insurance has not attracted many DeFi users so far and InsureDAO is still not well known to the public on Optimism. However, many existing users repeatedly purchase insurance with InsureDAO and we think that if we can reach more people, we can increase the number of insurance purchases and covered funds on Optimism.  Protocol Integration: 5% (5,000 OP)  5% of OP will be distributed to the integration partners. In addition to the refund campaign, we would like to expand the partnership with protocols for the integration to provide a more user-friendly insurance buying experience. We will distribute the same amount of OPs with the referral fee the partner protocol earned.  Bribe for INSURE-WETH on Velodrome: 25% (25,000 OP)  25% of OP will be allocated to incentivise INSURE-WETH LP on Velodrome through bribes for one year. In order to incentivise liquidity providers on Uniswap v2 on mainnet to migrate $liquidity into Optimism, we will allocate OP to bribe INSURE-WETH LP on Velodrome. With enough liquidity on Optimism, users will be able to swap INSURE with a low gas fee and will be motivated to stay in the Optimism ecosystem. Over what period of time will the tokens be distributed for each initiative? Shorter timelines are preferable to longer timelines. Shorter timelines (on the order of weeks) allow teams to quickly demonstrate achievement of milestones, better facilitating additional grants via subsequent proposals. The distribution to underwriters and bribes will take place over 25 weeks. The distribution for refund is unpredictable since it depends on how long it will take to use the allocation to refund. We expect to use the allocation within 6 months by selling a $1M cover amount. The distribution for integration is unpredictable again since it depends on how much insurance will be sold through integration. We expect to use the allocation within 6 months by selling a $500k cover amount of insurance through the integration. Please list the milestones/KPIs you expect to achieve for each initiative, considering how each relates to incentivizing sustainable usage and liquidity on Optimism. Please keep in mind that progress towards these milestones/KPIs should be trackable. Underwriting liquidity: $2M Our target APR for underwriters is around 10%. If we assume that we achieve to match the amount of INSURE rewards with OP rewards, we will distribute about $90k of rewards to underwriters in 6 months. Including organic returns from insurance selling and yields from investment function, we would expect $2M liquidity in the insurance pools. Total insurance selling: $2M & Insurance selling through integration: $1M By promoting insurance for DeFi users on Optimism with a cashback campaign, we would like to achieve to sell a $1M cover amount of insurance in total. We expect that half of the total cover amount will be purchased through integrations. INSURE-WETH LP: $300k If we assume bribes yield a 1.5x return in emission value per bribe on Velodrome, we could reward about $37,500 to LPs by using the allocation in 6 months. We would expect $300k liquidity with around 25% APR. Why will incentivized users and liquidity on Optimism remain after incentives dry up? As for the purchaser-end, insurance becomes more reasonable to purchase with lower gas costs since launched the protocol on Optimism. Indeed, most insurance purchases have occurred on Optimism. With this proposal, we aim to reach more DeFi users on Optimism and accelerate the demand for DeFi insurance. By integrating insurance into other DeFi protocols, users can deposit funds into a certain DeFi protocol and purchase insurance for the protocol at once, which is more user-friendly. Once the demand for insurance starts growing, underwriters will earn a higher organic return (real yield), and the attractive return entices underwriters to deposit more liquidity in insurance pools. Other than organic return, we are going to implement the investment function for further sustainable return, and we will also continue rewarding underwriters with INSURE after the end of the OP incentive. Moreover, we will increase the leverage rate for the index pools in accordance with the liquidity accumulated in the reserve poo, which increases the return for underwriters. Therefore, underwriters will be incentivised to remain liquidity and thereby liquidity becomes anchored on InsureDAO even after the end of OP rewards. Furthermore, InsureDAO has the potential to bring more liquidity and users to other DeFi protocols on Optimism rather than to attract liquidity only on InsureDAO. Mitigating risks by providing insurance, more users and liquidity, including conservative ones, potentially come to the Optimism ecosystem. Also, InsureDAO helps new projects to launch and join the Optimism ecosystem by allowing them to create their own insurance pool. Ultimately, they would be anchored to the Optimism ecosystem even after our incentives dry up, and support its sustainable growth. ",
                    "links": [
                        "https://dune.com/insuredao/insuredao-stats-dashbord"
                    ],
                    "GPT-summary": "The post is a proposal for InsureDAO, a decentralized insurance protocol for DeFi protocols on Optimism. The proposal explains how the protocol works, its features, and its value proposition. The post also provides relevant usage metrics, team information, and token distribution plans. The most relevant topics are explaining the proposal, constructive criticism, extending to the proposal, asking questions, and auditing and reviewing the proposal.",
                    "GPT-proposal-categories": [
                        "Privacy, Security and risk management",
                        "Grants, Funding and resource allocation",
                        "Interoperability and Scaleability",
                        "Token economics",
                        "Community and engagement"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.541457930608874
                },
                {
                    "author_link": "https://gov.optimism.io/u/rubiokishi",
                    "index": "2",
                    "likes": "2",
                    "time": "03/10/2022-16:03:22",
                    "content": "here are some additional links to the proposal.  Twitter: https://twitter.com/insuredao  Gitbook: Welcome to InsureDAO - InsureDAO  DeFi Llama: InsureDAO: TVL and Stats - DefiLlama   ",
                    "links": [
                        "https://insuredao.gitbook.io/insuredao/",
                        "https://defillama.com/protocol/insuredao"
                    ],
                    "GPT-discussion-categories": [
                        "Explaining the proposal",
                        "Extending to the proposal",
                        "Auditing and reviewing the proposal",
                        "Asking questions about the proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 9.0
                }
            ]
        }
    ],
    "group_index": "280"
}