{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/questions-on-wintermutes-mistake-and-wintermute-are-you-ready-to-make-an-offer-offer-to-the-attacker-they-send-you-19m-op-you-send-them-usdc-problem-solved/2601",
            "title": "Questions on Wintermute's mistake, and Wintermute - are you ready to make an offer offer to the attacker? They send you 19M OP, you send them USDC. Problem solved ",
            "index": 2601,
            "category": [],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/0xJohn",
                    "index": "1",
                    "likes": "6",
                    "time": "08/06/2022-21:12:12",
                    "content": "Question 1: According to OP’s tweet:  twitter.com    Optimism (✨🔴_🔴✨) @optimismPBC  The Optimism Foundation sent two separate test transactions, and upon Wintermute’s confirmation for each, sent the rest.   1:21 PM - 8 Jun 2022           28                1             The Optimism Foundation sent two separate test transactions, and upon Wintermute’s confirmation for each, sent the rest.  What exactly did you test and confirm, Wintermute? Please provide transparency on this. Question 2: Now the attacker has 19 M OP tokens in his wallet. You claim you will buy an equivalent amount whenever the attacker sells. Why dont you make an open offer to the attacker - Attacker sends you 19 M OP, you send them equivalent USDC/ETH whatever they want. Solves this issue at once. Please let us know. ",
                    "links": [
                        "https://twitter.com/optimismPBC/status/1534631769261191168?s=20&t=YGU4YXE2zVV_uau9kfTJzg",
                        "https://twitter.com/optimismPBC/status/1534631769261191168?s=20&t=YGU4YXE2zVV_uau9kfTJzg",
                        "https://twitter.com/optimismPBC/status/1534631769261191168?s=20&t=YGU4YXE2zVV_uau9kfTJzg"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://gov.optimism.io/u/zzz",
                    "index": "2",
                    "likes": "0",
                    "time": "09/06/2022-02:45:32",
                    "content": "It is better to open an op2, replace the op one by one, and exclude the hacker’s op. the problem will be solved ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gaurav",
                    "index": "3",
                    "likes": "0",
                    "time": "09/06/2022-02:58:55",
                    "content": "Are you out of your mind? @admins ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/toranit",
                    "index": "4",
                    "likes": "0",
                    "time": "09/06/2022-14:37:07",
                    "content": "    0xJohn:  Why dont you make an open offer to the attacker - Attacker sends you 19 M OP, you send them equivalent USDC/ETH whatever they want.   Agreed. Actually I’m not sure that you will buy back when they dump. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.583333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/Princecrypto.eth",
                    "index": "5",
                    "likes": "0",
                    "time": "10/06/2022-14:55:47",
                    "content": "I suppose you made this proposal out of trust issues with Wintermute. Not that I know the Wintermute’s team like I know that of Optimism and I still question Wintermute’s transparency on the 2 separate test tx confirmed but one thing is for sure, If Optimism itself confirms and announces that Wintermute will be doing just that anytime he sells and has done that when he sold 1M $OP, then if I can’t believe Wintermute, I can at least give Optimism a chance. Telling the Wintermute to offer an equivalent amount of the OP in USDC or ETH will only be writing off the “IF” in the statement “If he eventually sells”. The truth is, no one prays he dumps them all and draining liquidity, it can cause price volatility. He sold 1M $OP already and I think it’s a win for him also. Pressing this idea into his skull(who knows if he’s reading) would be a total loss on both Optimism and Wintermute when in fact, what they want is a win-win. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.166666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "6",
                    "likes": "0",
                    "time": "13/09/2022-16:45:33",
                    "content": "Please reference Message to Optimism community from Wintermute ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "82"
}