{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/draft-gf-phase-1-nice2win/3423",
            "title": "[DRAFT] [GF: Phase 1] nice2win ",
            "index": 3423,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Governance Fund: Phase 1"
            ],
            "tags": [
                "cycle-6",
                "not-passed"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/nice2win",
                    "index": "1",
                    "likes": "3",
                    "time": "08/09/2022-00:57:56",
                    "content": "Project name: nice2win Author name and contact info: ANCHIH HSIAO. Best way to contact is nice2win@protonmail.com I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: Yes L2 recipient address: 0xF141d715d192597eef0743Cb7720bd304F56944e Grant category: NFTS and Gaming Is this proposal applicable to a specific committee? Yes Project description nice2win is a decentralized web3 casino deployed on Optimism. In detail, nice2win attempts to improve upon the state-of-the-art in on-chain gambling by combining intuitive games like coin toss and dice roll together with well-thought-out user experience. Technically, consider us as a modern successor of dapp gambling casinos with our live public chat and our optional profiles. The smart contract our platform is built upon has been battle-tested, audited and literally processed hundreds of thousands of transactions Project links:  Website: https://nice2win.com  Twitter: https://twitter.com/nice2winDapp  Discord/Discourse/Community: https://discord.gg/GwuDax5RRW  Medium: https://medium.com/@nice2win  Dappradar: https://dappradar.com/optimism/high-risk/nice2win  Youtube: https://www.youtube.com/channel/UCGuAq0jn6wkSPgJbmnheoXA   Relevant usage metrics : 40.29 ETH total as bankroll (https://optimistic.etherscan.io/address/0xb0450ff766c81222d29f7e61ff47b5d0e43d78f2). Dune Analytics: https://dune.com/nice2win/nice2win-web3-casino Competitors, peers, or similar projects Heavily inspired by now discontinued dice2.win: https://medium.com/@dice2win.helpdesk Is/will this project be open sourced? No Optimism native?: Yes Date of deployment/expected deployment on Optimism: July 2022 Ecosystem Value Proposition: We like to think the ordinary person enjoys to gamble once in a while. This is why the OP ecosystem should have a platform where responsible users can gamble on fun simple games. Gambling is literally everywhere these days (arguably already on OP with sports wagers and others), but the casino version of gambling needs to be on Optimism and nice2win have set its course on Optimism. In fact, nice2win’s native chain was OP before even knowing grants were actually an option. nice2win already offers 4 types of games: coin flip, roll a dice, two dice and etheroll. Using our own funds to bankroll winners and losers from all bets placed on our smart contract, we are providing a solid stable experience for all OP users inclined to gamble on our platform. We have more games coming up in the future and certainly more ideas to make the overall experience more fun and interactive, which could be incredibly sped up with a grant. The Optimism ecosystem could benefit from users moving funds from other chains that are more typically associated with GameFi in order to experience a quality gambling experience on nice2win. It’s a new reason to onboard users that are lacking on Optimism. Moreover, existing users on OP can test their luck right now on our provably fair casino games, providing them with a fun way to blow off some steam. Number of OP tokens requested: 100 000 Did the project apply for or receive OP tokens through the Foundation Partner Fund?: No How much will your project match in co-incentives? Our smart contract already has 40 ETH serving as bankroll. We want to add another 10 ETH in the short term. On top of that, as per our roadmap (https://medium.com/@nice2win/september-2022-nice-roadmap-8a10aa60ef76), we are planning to open a bankroll staking contract later this year rewarding stakers a cut of the house edge fees.  Proposal for token distribution: Bankroll( 75% - 75 000 OP Tokens ): Having a considerable bankroll will enable bets of greater value to be processed from the smart contract. Industry standard for online casinos typically sets a 1% maximum profit per bet. Our current max profit is set at 2% to mitigate our relatively small current bankroll value of 40 ETH, done at our own risk. Beyond this technical measure, allowing bigger bets to take place on the platform broadens our reach to all types of gamblers, from smaller pockets to larger pockets. To increase security and trust, the tokens will be locked in a smart contract for an extended period of time, withdrawable only by bets settlement obligation ( winning players ). The 75 000 Tokens would be distributed at once on the approved smart contract. Besides, having set our short term goal to fund the bankroll up to 50 ETH strictly from our own funds, we feel that 75 000 OP tokens matches this bankroll investment at a reasonable ratio from a risk perspective. In short, this will give us a greater exposure to attract more wallets interested in a premiere web3 casino experience on Optimism. Users( 25% - 25 000 OP Tokens ): Users will be incentivized to use nice2win on Optimism and betting Ethereum. The first 1000 users achieving a set minimum ETH volume of wagers will be rewarded with OP. This will act as a marketing campaign as well as a way to get users to transfer ETH on Optimism and get familiar with the ecosystem and the platform. We are thinking this promotion will last about a month given our current userbase. After the promotion ends, we will have acquired new users, which we believe many will be recurring users on the OP network.  Please provide any additional information that will facilitate accountability:  The smart contract address: https://optimistic.etherscan.io/address/0xb0450ff766c81222d29f7e61ff47b5d0e43d78f2  The deployer address: https://optimistic.etherscan.io/address/0xF141d715d192597eef0743Cb7720bd304F56944e  The Gnosis Safe owner of the contract: https://optimistic.etherscan.io/address/0x070fdA470eF4F33b16363f49C84AAdAA2c649f2f   2022-09-07T04:00:00Z ",
                    "links": [
                        "https://twitter.com/nice2winDapp",
                        "https://discord.gg/GwuDax5RRW",
                        "https://medium.com/@nice2win",
                        "https://dappradar.com/optimism/high-risk/nice2win",
                        "https://www.youtube.com/channel/UCGuAq0jn6wkSPgJbmnheoXA",
                        "https://optimistic.etherscan.io/address/0xb0450ff766c81222d29f7e61ff47b5d0e43d78f2",
                        "https://dune.com/nice2win/nice2win-web3-casino",
                        "https://medium.com/@dice2win.helpdesk",
                        "https://medium.com/@nice2win/september-2022-nice-roadmap-8a10aa60ef76",
                        "https://optimistic.etherscan.io/address/0xb0450ff766c81222d29f7e61ff47b5d0e43d78f2",
                        "https://optimistic.etherscan.io/address/0xF141d715d192597eef0743Cb7720bd304F56944e",
                        "https://optimistic.etherscan.io/address/0x070fdA470eF4F33b16363f49C84AAdAA2c649f2f"
                    ],
                    "GPT-summary": "The post is a proposal for a decentralized web3 casino called nice2win, which is deployed on Optimism. The author explains the project in detail, including its features, technical aspects, and ecosystem value proposition. The proposal includes a request for 100,000 OP tokens, which will be used to fund the bankroll and incentivize users. The post also provides relevant links and metrics, as well as additional information for accountability. A third party gives entirely positive feedback on the proposal, extends to the proposal, and asks questions about it.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Token economics",
                        "Interoperability and Scaleability",
                        "Smart contract updates",
                        "Community and engagement"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.898781043517886
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "2",
                    "likes": "1",
                    "time": "12/09/2022-23:56:11",
                    "content": "Thanks for the proposal! Under the ‘Grant category:’ field, please specify which committee should review your proposal (NFTs and Gaming, Tooling, or DeFi). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/nice2win",
                    "index": "3",
                    "likes": "2",
                    "time": "13/09/2022-17:48:24",
                    "content": "Alright, so far, important feedbacks are:  Kain Warwick: “[…] it might be hard to get support for this especially for the US” -Discord link(Discord). In response to this feedback, we plan to restrict the platform to US users until we get more clarity on the situation.  @lavande: Specified committee is NFTS and Gaming, it will be changed in the edit right about now  Editing the post to go into week 2, delegate feedback! ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.887896825396826
                },
                {
                    "author_link": "https://gov.optimism.io/u/jrocki.eth",
                    "index": "4",
                    "likes": "0",
                    "time": "16/09/2022-15:46:47",
                    "content": "    nice2win:  NFTS and Gaming   Thanks for updating this  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Butterbum",
                    "index": "5",
                    "likes": "1",
                    "time": "16/09/2022-19:15:12",
                    "content": "Hey there, Thanks for the proposal. I have a bunch of questions and I apologize in advance. Amount asked is high considering your user base is small, do you have a metric on unique address? Increasing your bankroll from 50K to 125K doesn’t really help Optimism eco-system is there other benefits other than larger bets can be placed? Do you have any team info or is it an anon team? There is still the whole legal issues, your games are game of chance rather than game of skill. do you think this will pose a problem in the future with law/regulators? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.726785714285715
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "6",
                    "likes": "1",
                    "time": "17/09/2022-21:24:17",
                    "content": "Hi @nice2win thank you for your proposal. I see that nice2win is not opensource. Could you explain why? What about auditing ? As a user, how can I prove that the results are not biased ? In case of “Roll a dice”, how can I prove that the logic/code is fair and is not playing against me. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/nice2win",
                    "index": "7",
                    "likes": "2",
                    "time": "18/09/2022-17:51:07",
                    "content": "@Butterbum Hi! Very happy to read your review. Let me reply to your questions below:   We have only 21 different unique addresses that used our platform so far. What would be a fair grant amount on your opinion?   Increasing the bankroll helps to enable larger bets as you said and generally speaking a gambling platform is as good as it’s settling pool. Higher userbase for nice2win means greater adoption for Optimism if we manage to achieve the goals set on our roadmap. We want ETH (for now) from all chains to be deposited on OP.   We are a team of 3 developers. Our main dev is comfortable with being the public face of the project. We have no section yet on the platform pertaining to the team because we did only focus on product building so far.   The main dev mentioned previously is based in Taiwan and we plan on making that country our headquarter for all administrative purposes if needed. This platform is legal in Taiwan.   ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 6.195175438596491
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPtop",
                    "index": "8",
                    "likes": "0",
                    "time": "18/09/2022-18:19:10",
                    "content": "It’s smart contract supported, i reviewed the contract before i start to join the game, Contract looks legit to me, you can check the contract also, it’s shown on their page. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.535714285714286
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPtop",
                    "index": "9",
                    "likes": "0",
                    "time": "18/09/2022-18:21:47",
                    "content": "looks like a good project for me, I’m an OP hodler. I’d love to see such project that keeps attract capitals to Optimism chain, that will help the growth a lot ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/nice2win",
                    "index": "10",
                    "likes": "2",
                    "time": "18/09/2022-18:32:01",
                    "content": "@OPUser For the opensource part, I may not have understood the original question correctly. All that is related to the “gambling” aspect of the platform is on our smart contract thus opensource and verifiable. However, the website (javascript, css, html…) itself is not opensource meaning the code to run it is not public. After all, the website acts as a UI  to the smart contract. You don’t need to use the webapp to play our games, you could interact with the smart contract itself! The main reason you would want to play on our casino is that it’s provably fair which means that any bet outcome can be independently verified and that the operator or other players have no means of tampering with the result. We may be one of the only fair, transparent, non-custodian, and immutable gambling platform out there, thanks to web3 technology  As for the audits, we are already using smart contract code that has been audited in the past, I invite you to check our Medium page for more info (the link is in the original post) Thanks for the questions!!! ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 6.095279431216931
                },
                {
                    "author_link": "https://gov.optimism.io/u/nice2win",
                    "index": "11",
                    "likes": "0",
                    "time": "18/09/2022-18:34:22",
                    "content": "@OPtop Thank you for your review! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Butterbum",
                    "index": "12",
                    "likes": "1",
                    "time": "19/09/2022-07:03:19",
                    "content": "Thanks for the reply. I apologize I thought your user count was less than that. I am satisfied with the answers you have provided. Still a bit concerned about the legal issues surrounding a gambling platform thou. Are you planning to keep the OP as OP in your bankroll or exchange it for ETH? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.916666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/jrocki.eth",
                    "index": "13",
                    "likes": "0",
                    "time": "19/09/2022-21:22:54",
                    "content": "You can also change the below answer to “yes” as it is the NFT and Gaming Committee you called out as applicable to in the Grant category field. Is this proposal applicable to a specific committee? No ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/nice2win",
                    "index": "14",
                    "likes": "2",
                    "time": "19/09/2022-22:07:54",
                    "content": "@Butterbum Hi again, Very nice reading you again. Let me try to reassure you about the legal issues. First of all, please refer to this article 2019 Taiwanese article Blockcast article 2019 which has the English title of: Gaming games occupy the Dapp market but are still in a “legal gray area” Here’s a quote from the article:  Question 3: Is writing a Dapp game program likely to constitute the crime of “providing a gambling venue/gathering a crowd to gamble” in Article 268 of the Criminal Law? Li Canyu: At present, Taiwan’s judicial practice has not yet made a definite judgment on this issue  Secondly, the following article describes a judgement in Taiwan stating that gambling is legal if it’s not in public space. Internet is considered personal therefore not making it illegal to gamble on Internet. Ltn News article 2020 Now, just to put some context on the matter, gambling is very popular in Asian countries more so than Western countries which is the reason for such specific articles(rulings) on the matter. Gambling is also more accepted in day-to-day life. About the first article, it is clearly stated that it is not illegal to write a Dapp casino as of today in Taiwan. The second article confirms that online gambling is legal at the moment. None of us are lawyers in the team so take everything with a grain of salt, but just know that Taiwan is friendly to web2 casinos overall and logically would translate to web3 casinos. It is also common knowledge for online casinos in Taiwan to host the casinos in foreign countries which we will do anyways. Replying to this now:  Are you planning to keep the OP as OP in your bankroll or exchange it for ETH?  We could do either really, depending on the preference of the council. It’s already on our roadmap to support more currencies to gamble with, like OP . Would swapping for ETH even be possible from the council’s point of view? Thanks for reading! ",
                    "links": [
                        "https://news.ltn.com.tw/news/society/paper/1401048"
                    ],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.536111111111111
                },
                {
                    "author_link": "https://gov.optimism.io/u/nice2win",
                    "index": "15",
                    "likes": "1",
                    "time": "19/09/2022-22:08:33",
                    "content": "@jrocki.eth Done thanks! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/Butterbum",
                    "index": "16",
                    "likes": "1",
                    "time": "20/09/2022-11:09:19",
                    "content": "Thank you for your reply and addressing some legal concerns. It still leaves me scratching my head as to classifying the internet as a private space. Concerning the swapping of OP for ETH    Grant Proposal Template   OP received through the Governance Fund should not be sold by the grant recipient. This “no sale” rule:   Includes the grant recipient, their affiliates and any other related persons. These persons cannot receive OP for the purpose of selling (or if the grant recipient knows they intend to sell) the tokens.  Includes the direct exchange of OP for crypto or fiat, whether done publicly or privately. Think selling OP in exchange for fiat or crypto, regardless of whether done on a CEX, DEX, OTC desk, at your local park, or otherwise.  Does not include using OP to incentivize usage. Providing OP as liquidity mining incentives is not restricted by these parameters.    Thanks again for all the info. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.234375
                },
                {
                    "author_link": "https://gov.optimism.io/u/nice2win",
                    "index": "17",
                    "likes": "1",
                    "time": "20/09/2022-18:16:08",
                    "content": "@Butterbum Thank you! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/nice2win",
                    "index": "18",
                    "likes": "1",
                    "time": "20/09/2022-18:24:54",
                    "content": "Definitely leaning more to make an OP Bankroll on Optimism as of now btw! Unless I can’t read fine prints, I think it’s the only choice! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.302083333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/jrocki.eth",
                    "index": "19",
                    "likes": "1",
                    "time": "21/09/2022-15:28:27",
                    "content": "To be included in this voting cycle you would need to get two approvals from delegates per these instructions:    Voting Cycle #6: Roundup 🏛 Governance   Voting Cycle #6: Roundup Voting Cycle 6 began on Thursday (September 8th) at 12pm PST / 7pm GMT and runs until Wednesday (September 28th) at 12pm PST / 7pm GMT.  A snapshot of delegate voting weights was taken at the start of the Voting Cycle. Voting will take place via Snapshot during Week 3 of the Voting Cycle.  For a detailed breakdown of the governance and voting process, please see the updated Operating Manual.   Context Voting Cycle 6 is officially underway! Provided your proposal has rec…     If a proposal does not get two delegates sign off by September 22, 2022 3:00 PM it should be moved back to [Draft] and you can retry in the next cycle! We like that this proposal does give some co-incentives and we would encourage to submit again in next cycle when there is a bit more user traction ",
                    "links": [
                        "https://github.com/ethereum-optimism/OPerating-manual/blob/main/manual.md"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/nice2win",
                    "index": "20",
                    "likes": "2",
                    "time": "21/09/2022-20:40:22",
                    "content": "@jrocki.eth Yes, let’s see for now if we do get the two delegates. If we don’t, we will definitely be interested to submit again with more momentum on our side in the future! ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/nice2win",
                    "index": "21",
                    "likes": "0",
                    "time": "22/09/2022-19:51:20",
                    "content": "I went ahead and changed it back to Draft and added the “not-passed” flair. We’ll give you news soon and update the original post with our advancements when ready. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.958333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/Bobbay_StableLab",
                    "index": "22",
                    "likes": "2",
                    "time": "23/09/2022-06:01:51",
                    "content": "I don’t think there is an issue with having a gambling platform on Optimism. Someone will build one, but it’s a question whether it is worth providing a 100k grant to a product that attracts a small user base. Gambling is for a very small user base, and other gaming or NFT projects might be more attractive for a larger user base. Reducing the grant size heavily and amending token distribution might make this a bit more favorable. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/nice2win",
                    "index": "23",
                    "likes": "0",
                    "time": "24/09/2022-00:56:50",
                    "content": "@Bobbay_StableLab Thanks for the input! For the 75k OP bankroll part, we originally viewed it as “match our current funds” type of deal since we are nearing 50 ETH. I totally think we can learn a lot from this past cycle for sure, including reducing the grant size and reworking the distribution. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.729166666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/nice2win",
                    "index": "24",
                    "likes": "2",
                    "time": "28/09/2022-21:47:49",
                    "content": "Going back to the OP Bankroll question that we asked above, we have noticed QiDao offers an OP collateral vault: QiDao. This vault basically lets you deposit OP that you can draw MAI from if you stay above 150% collateral ratio. Would the council agree for nice2win to lock the “bankroll section” of granted OP in this vault to draw MAI then swap it to ETH to add to our current existing ETH bankroll? Of course, we would do so with a very high Collateral to Debt Ratio % to avoid any risk of liquidation. This seems like a neat idea to us because it would avoid us from selling the OP and would promote ecosystem usage between projects. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.256666666666668
                },
                {
                    "author_link": "https://gov.optimism.io/u/jrocki.eth",
                    "index": "25",
                    "likes": "0",
                    "time": "30/09/2022-06:05:32",
                    "content": "Good question there has been some debate about allowing protocols to borrow against their $OP funding. @lavande, @OPUser, or @jackanorak might have more insight on this one but I do not believe that practice is expressly prohibited at this point. Personally, I don’t have an issue with it as long as it is stated in the proposal, backed by sound logic, and is done responsibly ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.458333333333332
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "26",
                    "likes": "2",
                    "time": "30/09/2022-11:17:38",
                    "content": "That’s right, there’s currently no explicit guidance on whether to use OP as collateral. It’s a slippery slope, and from my perspective if anything it calls out the need to consider alternative forms of distribution to grantees. Using OP for a bankroll is kind of tough because the idea is that it’s evergreen and grows, and it’s also initially capital inefficient as a grant due to the need for overcollateralization and liquidation risk. Tell me this, actually - have you modeled out your expected bankroll growth given different use scenarios (imagine there’s a house edge or some rev generation)? There might be some very interesting possibilities here. The best thing to do would ofc be to facilitate OP use for the app itself but idk what sort of dev lift that would entail. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.8735569985569995
                },
                {
                    "author_link": "https://gov.optimism.io/u/nice2win",
                    "index": "27",
                    "likes": "3",
                    "time": "30/09/2022-20:16:22",
                    "content": "@jrocki.eth Thanks for the link! @jackanorak  Tell me this, actually - have you modeled out your expected bankroll growth given different use scenarios (imagine there’s a house edge or some rev generation)? There might be some very interesting possibilities here.  The house edge already being 1%, the current plan is to grow the bankroll aggressively, taking no profits, until the bankroll is solid enough to fulfill more type of bets. For example, in the current ETH pool, 100 ETH sounds achievable within the next year if we manage to take off. We don’t have any type of models yet but we are working on some Dune queries to give us some more insight on growth and analytics.  Using OP for a bankroll is kind of tough because the idea is that it’s evergreen and grow  Not only that, but you can’t pay gas with OP. For a simple user experience, ETH makes more sense as our primary crypto of choice to bet with because if you’re going to play 100 games per day, you’ll be charged on the same currency AND you’ll be managing your gas spending implicitly. On top of that, OP is likely to be more volatile than ETH in the next years which adds more risk to “simple” users swapping for a set crypto amount to play within let’s say a month, then recharge if needed.  The best thing to do would ofc be to facilitate OP use for the app itself but idk what sort of dev lift that would entail.  I’m not sure I understand the statement fully, however, if you’re talking about betting with OP strictly or any other crypto, it is definitely on the roadmap and is definitely achievable. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.868295019157088
                },
                {
                    "author_link": "https://gov.optimism.io/u/nice2win",
                    "index": "28",
                    "likes": "1",
                    "time": "02/10/2022-06:22:12",
                    "content": "Messed around with Dune Analytics today, go take a look   Dune Analytics: https://dune.com/nice2win/nice2win-web3-casino ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "236"
}