{
    "poll_list": [
        {
            "id": "0xe290c12c3871de18c7be44d0ce19e3fe46401adbdd9fa25077629cb356889be2",
            "title": "Season 2: Cycle 7: Dope Wars",
            "discussion": "https://gov.optimism.io/t/review-gf-phase-1-proposal-cycle-7-dope-wars/3592",
            "body": "This Governance Fund Phase 1 proposal is eligible for voting in Cycle 7. \n\nThis proposal is was reviewed by [NFT & Gaming Committee](https://gov.optimism.io/t/nft-gaming-committee-a-season-2-recommendations/3535#cycle-7-9). You can find committee recommendations below:\n\n[NFT & Gaming Committee recommendations]([https://gov.optimism.io/t/nft-gaming-committee-a-season-2-recommendations/3535](https://gov.optimism.io/t/nft-gaming-committee-a-season-2-recommendations/3535))\n\nBy approving committees, the Token House entered a social contract to entrust and delegate the bulk of decision-making to official committees. However, delegates may vote against the recommendation of official committees but should provide a justification to the community as to why they voted differently.",
            "choices": [
                "For",
                "Against",
                "Abstain"
            ],
            "scores": [
                4860508.325443085,
                1982396.2555975225,
                4832706.195098132
            ],
            "start": 1665691911,
            "end": 1666293111,
            "snapshot": "29191522",
            "state": "closed",
            "author": "0x47C88bb92B409fF25F6587EA611fac4e55f76007",
            "space": {
                "id": "opcollective.eth",
                "name": "Optimism Collective"
            }
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/review-gf-phase-1-proposal-cycle-7-dope-wars/3592",
            "title": "[Review] [GF: Phase 1 Proposal Cycle 7] Dope Wars ",
            "index": 3592,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Governance Fund: Phase 1"
            ],
            "tags": [
                "cycle-7",
                "season-2",
                "passed"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/salparadise",
                    "index": "1",
                    "likes": "7",
                    "time": "30/09/2022-16:25:21",
                    "content": "Project name: Dope Wars Author name and contact info: Author: Butterbum.eth, Sal Paradise (James) & Facesof.eth on behalf of Dope Wars DAO I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: Yes L2 recipient address:  0x90103beDCfbE1eeE44ded89cEd88bA8503580b3D Which Voting Cycle are you applying for? Cycle 7 Grant category: NFT / Gaming Is this proposal applicable to a specific committee? Yes. NFT & Gaming Committee Project description: Dope Wars is an open source metaverse project with a “Play-To-Own” model, featuring a plurality of games, experiences, and environments in our community-built ecosystem. The development ecosystem revolves around a gaming SDK, so contributors can seamlessly plug in different modules.  Dope Wars began as a fork of  Loot (For Adventurers), with a GTA-inspired spin. The Ethereum mainnet DOPE NFT series launched as a free mint, with 9 items (GEAR) associated per NFT. The items are “unpackable” at the contract level, and we made the decision to build out the outputs of this feature on Optimism. Users are required to “claim” the gear which mints, or unpacks, the corresponding game items on the Optimism network as 9 unique ERC-1155s (GEAR), a function that can only be called once per DOPE NFT. These items can then be equipped to a HUSTLER (playable character) to interact with our Dope Wars MMO and its modules, we anticipate primarily in the form of mini-games. Unequipped Hustlers are free to mint, and can be customized by trading for GEAR on Quix, allowing anyone to participate in our MMO metaverse and mini-games. Dope Wars is currently executing on a two-part internal governance proposal which has passed by unanimous decision on both Snapshot Part1, Part2 and Tally P1, P2 in favor of registering Dope Wars as a Not for Profit Limited Liability Company under representation from MIDAO.  As defined by the DW Operating Agreement, DOPE holders are stakeholders with varying levels of contribution that can be remunerated for their efforts as valued by the DAO by way of onchain Tally vote decree. This marks a major milestone in protecting builders contributing to the Dope Wars ecosystem and sets the legal foundation for further growth of the project and acceptance of grants such as this. It is important to note that since inception, Dope Wars has followed the standards of a “Public Good,” beginning with the free mint, and continuing with a rigid policy of open source and transparent building led by members of the community. Anyone with the chops is able to join the community and grow the project.  DW Alpha screenshot1558×1080 120 KB  Snapshot from Dope Wars MMO Alpha Testing Project links:  Website Github Twitter Discord Tally Snapshot  Additional contributors info (please link): Cyberbitz.eth - Marketing and community lead Facesof.eth - Designer, developer Tarrence.eth - Solidity developer HPMNK - Game designer Taniela.taki - Community developer Larko - Game developer Dennison Bertram - Launched the Dope NFT, though not currently an active contributor Mr. Fax - Pixel art designer Please link to any previous projects the contributors has meaningfully contributed to: Tarrence.eth - cartridge.gg, Github, Tally HPMNK - Avoidania, Frens Lands Dennison Bertram - Tally Relevant usage metrics: HUSTLERS:  (OP) 3700 unique addresses. 6th highest all time volume on Quix OG Hustlers: Floor price on quix: 1 ETH DOPE GEAR: (OP) 18,100 ERC-1155s on Optimism. 4,600 sales on Quix with a volume of ~100 ETH. 25th highest volume on Quix all time. DOPE NFT (ETH): 2000 Unique addresses, 3500 ETH volume on OpenSea Competitors, peers, or similar projects:** Dope Wars is a unique project and has no known competitors utilizing NFTs with interchangeable items on OP. DW began as a fork of Loot (for Adventurers) but with a street/hip-hop culture motif. Arbitrum’s Magic has competitive similarities in that it is a gaming hub and protocol. Worldwide Web3 has a similar MMO to what Dope Wars is building. Is this project open sourced? Yes, Dope Wars has created a Gaming protocol and is available for anyone to review and build upon. Github repo Optimism native?: No, Dope NFT contract deployed on Ethereum mainnet on 31 Aug 2021. However, through the process of claiming GEAR, and equipping HUSTLERS, the intention is to progressively move the bulk of our NFT transactional to Optimism, and we expect this to increase further based on the Optimism-based releases discussed in greater detail below. Date of deployment/expected deployment on Optimism: 20th Nov 2021 our HUSTLER contracts were deployed on Optimism. Ecosystem Value Proposition:   What is the problem statement this proposal hopes to solve for the Optimism ecosystem?  A primary objective of the Optimistic Vision is to move the world towards a system where collectivism and collaboration are encouraged and equitably rewarded. This Vision has many facets, and Dope Wars is currently poised to focus on two critical, correlated components: user growth and network utilization.    How does your proposal offer a value proposition solving the above problem?  Through incentives for playing our games and interacting with our assets, we will expose new users to the OP community and increase transactions on the OP network. Building games is resource intensive. As a self-funded project, Dope Wars has a strong foundation composed of a committed community, veteran core contributors, and existing game assets but needs a bit more resources to push us over the edge in order to bring some of these elements to market. Open collaboration is a hallmark of Dope Wars. This grant would stimulate a cycle of equitable collaboration that we plan to extend into the indefinite future through a self-sustaining gaming protocol. Our combination of a central MMO, a related SDK and DAO funding mechanisms are integral to this, designed to encourage and support future builders. With the primary MMO game on Optimism, this grant would encourage building future games on Optimism, fostering self-sustaining loops of user growth and network engagement.    Why will this solution be a source of growth for the Optimism ecosystem?  Gaming is currently underrepresented in the OP ecosystem- an essentially untapped market. Blockchain gaming activity has increased 2000% since the start of the year, representing 52% of all blockchain activity (https://dappradar.com/blog/dappradar-x-bga-games-report-q1-2022). Grand Theft Auto V is the second best selling game of all time, thus this genre has proven appeal and a huge total addressable market. Onchain games in general have proven to be a powerful framework to build communities, and our games are structurally designed to increase network activity.  With tens-of-thousands of assets already trading on OP, and multiple games and experiences in the pipeline that integrate these assets into onchain games, DW uses entertainment to bring activity to the OP network. We also plan to continue to contribute to charitable causes related to our theme, as we have already done through a collaboration with NBA star Baron Davis’s charity, further bringing fresh eyes to Optimism. $PAPER, our ERC-20 token that was airdropped to DOPE NFT holders in September 2021, serves as the in-game currency when bridged to Optimism. $PAPER has been listed on Coinbase Custody, and was named in a short list for a full service Coinbase listing earlier this year- another avenue to potentially increase exposure to Optimism.    Has your project previously applied for an OP grant? Yes, unsuccessfully. Dope Wars received detailed feedback from prominent OP delegates in our previous proposal, which we have considered when making this new proposal. We have significantly reduced the amount of OP requested and adjusted our developer incentives allocation. The previous draft proposal and discussion is here: https://gov.optimism.io/t/draft-gf-phase-1-proposal-dope-wars/2722/101 Number of OP tokens requested: 300,000 Proposal for token distribution: How will the OP tokens be distributed? (please include % allocated to different initiatives such as user rewards/marketing/liquidity mining. Please also include a justification as to why each of these initiatives align with the problem statement this proposal is solving.) Over what period of time will the tokens be distributed for each initiative? Shorter timelines are preferable to longer timelines. Shorter timelines (on the order of weeks) allow teams to quickly demonstrate achievement of milestones, better facilitating additional grants via subsequent proposals. The most imminent goal for this Optimism distribution is to incentivize users to interact with Dope Wars mini-games. Currently there are a number of experiences being built by different community members, of which three are at or near completion: $PAPER Rock Scissors, Dope Frenzy and the MMO metaverse MVP. User Incentives:  25% (75,000 OP) will be used to incentivize use and increase exposure of PRS (PAPER Rock Scissors). This mini-game is fully on-chain and built around the use of $PAPER. 100% of this allocation will be distributed as user rewards to players of PRS via weekly and monthly competitions over a 12-week period. 25% (75,000 OP) will be used for Dope Frenzy. This is a single-player mayhem experience which requires OP $PAPER to play and integrates OP GEAR to level up the experience. Development is self-funded by Community and Marketing Lead, Cyberbitz. 100% of OP in this allocation will be distributed to players via weekly and monthly competitions over a 12 week period.  Developer Incentives:  50% (150,000 OP) will be used to incentivize development of games, experiences and smart contracts. Dope Wars DAO will utilize these funds in a responsible manner to allow Dope Wars to flourish into the communities’ vision. We are a fully community-owned project and no external capital has been received. This allocation would also help to onboard new developers to our Play-to-Own gaming hub, and collectively produce many entertaining games and environments for Optimism users.  Dope DAO has recently initiated DIP-53 to more clearly define and improve upon our developer incentives process and structure, the Retroactive Developer Incentive Program (RADIP). ”The core principle behind the concept for retroactive public goods funding is simple: it’s easier to agree on what was useful than what will be useful” - Vitalik Buterin [Retroactive Public Goods Funding. Note: The Optimism team has long been… | by Optimism | Optimism PBC Blog | Medium] This structure is an evolution from our previous process, and of that described by Vitalik, and will help guide the future of Dope DAO well beyond the OP incentives. Adherence to proper RADIP processes will be cited as a requirement in our Operating Agreement upon registration as a not-for-profit LLC with MIDAO in the Marshall Islands. The goals for the RADIP are to augment transparency and accountability and to encourage the onboarding of new dev talent into our ecosystem through a more defined structure and process. Most importantly, RADIP is a way for the DAO to hold freelancers accountable for their work. Also, this process facilitates the DAO to incentivize work in areas that require attention. The structure we propose is experimental. We expect this will require iteration as we progress and learn. Components we expect to begin to develop early on include templates for proposals, and a timeframe oriented process for the review process. All proposals for mini-games or other work on DW will begin on Snapshot. The proposer details the scope of work and intended outcomes. The proposer sets both a product delivery payment amount and an ongoing support payment amount. The delivery payment is sent, via Tally vote, upon release and review of the mini-game/submitted work. The support payment becomes available in a proposed timeframe after the release, i.e. +/-3-6 months. This is to hold the proposer accountable for bugs, time for stress testing, etc. Then the proposer can be paid up to the maximum support allocation in installments, i.e. monthly over a 3-6 month period, via DAO Tally vote for each payment. RADIP PROCESS  Proposer creates a proposal which includes objectives to meet, timeframes in which work should be completed, with delivery and support payment outlines Review process - discussion and recommendations from the community, edits to proposal as necessary and agreed upon Snapshot vote to confirm agreement between DW and proposer/developer. Proposer/Dev submits work (i.e releases mini-game) Submitted work reviewed by Dope DAO Tally vote to release delivery amount set in proposal Support payment balance to be released over a predetermined period, i.e 3-6 months, on a retroactive basis via monthly DAO Tally vote  Dope Wars has a strong verifiable precedent of retroactively rewarding (bounty) contributors via onchain community vote. As one example, here is a proposal for funding including proposed budget, followed by the corresponding successful vote for disbursement here a few months later. We feel that this precedent, along with the implementation of RADIP. strengthens our case for responsibly and effectively managing project growth through contributor incentives. The anticipated breakdown per contributor incentive vertical is as follows: 20k - Swap Meet 2 deployment 30k - Paper Rock Scissors launch 70k - MMO MVP release. Community alpha testing has already been held. 30k - reserved to incentivize the next wave of community-built experiences, some of which have already been heavily iterated upon, including $TURF, our own customizable virtual land baked into the MMO, which is already deep into the interface design process. Please list the milestones/KPIs you expect to achieve for each initiative, considering how each relates to incentivizing sustainable usage and liquidity on Optimism. Please keep in mind that progress towards these milestones/KPIs should be trackable.  Milestones Deployment of PAPER Rock Scissors on Optimism and related user competition for $OP Release of Dope Frenzy and related user competition for $OP Release of MVP MMO Deployment of Swap Meet 2  Screen Shot 2022-09-30 at 10.56.32 AM1920×891 86.6 KB  Dope Frenzy aim mechanics testing Why will incentivized users and liquidity on Optimism remain after incentives dry up? Post incentives, we will have a virtual world with an increasing amount of onchain mini-games and collector experiences, creating a flywheel where users and contributors become owners of a virtual economy on the Optimism network. Please provide any additional information that will facilitate accountability  All progress is trackable on Github at https://github.com/dopedao   Ethereum Mainnet contracts and links  Dope NFT~ERC-721 contract, Fork of Loot protocol: https://etherscan.io/token/0x8707276df042e89669d69a177d3da7dc78bd8723  PAPER~ERC-20 contract, Dope Wars official eco-system currency: https://etherscan.io/token/0x7ae1d57b58fa6411f32948314badd83583ee0e8c  Dope NFT collection: https://www.gem.xyz/collection/dope-v4/  Smart contract Treasury address : https://etherscan.io/address/0xb57ab8767cae33be61ff15167134861865f7d22c  Dope Wars fund tracker: https://dope-wars.notion.site/3d285ff9ef5640f3bad61e692692c279?v=317640d832d64170b6255c8e2d1353ac   Optimism contracts and links  Gear~ERC-1155: https://qx.app/collection/gear  Hustlers~ERC-1155: https://qx.app/collection/hustlers  Hustlers contract: https://optimistic.etherscan.io/address/0xdbfeaae58b6da8901a8a40ba0712beb2ee18368e  Swap contract: https://optimistic.etherscan.io/address/0xdbfeaae58b6da8901a8a40ba0712beb2ee18368e   Disclaimer As Butterbum.eth is an author of this Dope Wars proposal and also a member of the NFT & Gaming Committee, they shall abstain in participating in the review and recommendation of this proposal. Butterbum also would like to disclose that they will be voting FOR this propsal, as most of the OP delegated to them is from the Dope Wars community. ",
                    "links": [
                        "https://twitter.com/salparadise888",
                        "https://twitter.com/facesOfEth",
                        "https://dopewars.gg/",
                        "https://snapshot.org/#/dopedao.eth/proposal/0xcabe03888d16157ad14ad6dc047f982823612e1c2d6754d14385e72fc5a57b87",
                        "https://snapshot.org/#/dopedao.eth/proposal/0xf85932b1059288df098cb57bd58298ee01d4c1b6dc650a94022e4711a1b07b28",
                        "https://www.tally.xyz/governance/eip155:1:0xDBd38F7e739709fe5bFaE6cc8eF67C3820830E0C/proposal/79195183596205885362869282178713258976989732785118264705117912111874691456969",
                        "https://www.tally.xyz/governance/eip155:1:0xDBd38F7e739709fe5bFaE6cc8eF67C3820830E0C/proposal/80745016675607650767307215452811717320727655451470881906169970936595641495821",
                        "https://www.midao.org/",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/0/0715ab57365568bcbb09e88a21e9fb5e564014e0.jpeg",
                        "https://dopewars.gg/about",
                        "https://github.com/dopedao",
                        "https://twitter.com/TheDopeWars",
                        "https://discord.gg/dopewars",
                        "https://www.tally.xyz/governance/eip155:1:0xDBd38F7e739709fe5bFaE6cc8eF67C3820830E0C",
                        "https://snapshot.org/#/dopedao.eth",
                        "https://twitter.com/Cyberbitz",
                        "https://twitter.com/facesOfEth",
                        "https://twitter.com/tarrenceva",
                        "https://mobile.twitter.com/HPMNK_One",
                        "https://twitter.com/TanielaTaki",
                        "https://github.com/Larkooo",
                        "https://mobile.twitter.com/DennisonBertram",
                        "https://mobile.twitter.com/Mr_faxu",
                        "https://twitter.com/cartridge_gg",
                        "https://github.com/tarrencev",
                        "https://qx.app/collection/hustlers",
                        "https://qx.app/collection/gear",
                        "https://opensea.io/collection/dope-v4",
                        "https://dune.com/HorizonXP/Dope-Wars-Degen-Dashboard",
                        "https://opensea.io/collection/dope-v4/activity",
                        "https://www.lootproject.com/",
                        "https://treasure.lol/",
                        "https://webb.game/",
                        "https://github.com/dopedao",
                        "https://dappradar.com/blog/dappradar-x-bga-games-report-q1-2022",
                        "https://twitter.com/coinbaseassets/status/1570856430856732672",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-dope-wars/2722/101",
                        "https://medium.com/ethereum-optimism/retroactive-public-goods-funding-33c9b7d00f0c",
                        "https://snapshot.org/#/dopedao.eth/proposal/0x7d1ac58674c3fd021ae8b5155c7822fa68496a991d6026b83cda5bc2efcb74d9",
                        "https://www.tally.xyz/governance/eip155:1:0xDBd38F7e739709fe5bFaE6cc8eF67C3820830E0C/proposal/915390809642468416964350110765684618981849135389590534041270472499402544187",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/5/52b0d5e165ff08d8eb5d3bc5c6c7e862585d3b00.jpeg",
                        "https://github.com/dopedao",
                        "https://etherscan.io/token/0x8707276df042e89669d69a177d3da7dc78bd8723",
                        "https://etherscan.io/token/0x7ae1d57b58fa6411f32948314badd83583ee0e8c",
                        "https://www.gem.xyz/collection/dope-v4/",
                        "https://etherscan.io/address/0xb57ab8767cae33be61ff15167134861865f7d22c",
                        "https://www.notion.so/3d285ff9ef5640f3bad61e692692c279",
                        "https://qx.app/collection/gear",
                        "https://qx.app/collection/hustlers",
                        "https://optimistic.etherscan.io/address/0xdbfeaae58b6da8901a8a40ba0712beb2ee18368e",
                        "https://optimistic.etherscan.io/address/0xdbfeaae58b6da8901a8a40ba0712beb2ee18368e",
                        "https://gov.optimism.io/t/voting-cycle-7-roundup/3586/18",
                        "https://gov.optimism.io/t/gfx-labs-delegate-communication-thread/2728/17",
                        "https://gov.optimism.io/t/dope-wars-accountability-feedback-thread/5390"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6779201453308605
                },
                {
                    "author_link": "https://gov.optimism.io/u/Butterbum",
                    "index": "2",
                    "likes": "4",
                    "time": "03/10/2022-17:30:09",
                    "content": "Dope Wars DAO is presenting a new proposal, I’m tagging  @solarcurve @lefterisjp @polynya @Defi_LATAM_axlvaz @linda @Bobbay_StableLab @jackanorak @OPUser as you all gave us constructive advise on our last attempt. It would be great to get your feedback on this proposal. Thanks ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.420454545454546
                },
                {
                    "author_link": "https://gov.optimism.io/u/jrocki.eth",
                    "index": "3",
                    "likes": "2",
                    "time": "03/10/2022-17:30:32",
                    "content": "    salparadise:  18.75% (75,000 OP) will be used to incentivize use and increase exposure of PRS (PAPER Rock Scissors). This mini-game is fully on-chain and built around the use of $PAPER. 100% of this allocation will be distributed as user rewards to players of PRS via weekly and monthly competitions over a 12-week period.   Could not agree more with incentivizing usage of your first mini-game as these go directly to the community and bring more eyes upon the OP gaming ecosystem.     salparadise:  18.75% (75,000 OP) will be used for Dope Frenzy. This is a single-player mayhem experience which requires OP $PAPER to play and integrates OP GEAR to level up the experience. Development is self-funded by Community and Marketing Lead, Cyberbitz. 100% of OP in this allocation will be distributed to players via weekly and monthly competitions over a 12 week period.   Agree for the same reasoning as above assuming the estimated release date of this is not super far out. If so it may be more advantageous to submit a proposal to fund this one in a later cycle as we may learn a lot from incentivizing the first mini game (PAPER, Rock, Scissors). Also this proposal might be more likely to be approved and garner more backing if it the incentive experiment was limited in scope. With the knowledge that you are encouraged to submit more proposals in the future which also would be more likely to pass assuming the prior funding was a success for the ecosystem.     salparadise:  25% (100,000 OP) will be reserved for incentives in the OP based DOPE MMO metaverse experience, currently being built by Dope Wars contributors. The tokens will be distributed for executing in-game actions like participating in quests and playing mini-games. These incentives will become active when DOPE MMO metaverse is launched in the near future. It is difficult to give a precise date as to when it will be launched as we are an open source DAO with many moving parts. We would like to request this allocation now in order to utilize the OP at the launch of the MMO.   Same thoughts as above. Really more curious to know about estimated timeframes for the games and corresponding incentive programs to go live. What I want to avoid is having all this $OP distributed now then it just lying dormant, for a long time, not being given out to users. I would even be more inclined to  increase the amount of rewards for the first game that goes live with incentives.     salparadise:  37.5% (150,000 OP) will be used to incentivize development of games, experiences and smart contracts. Dope Wars DAO will utilize these funds in a responsible manner to allow Dope Wars to flourish into the communities’ vision. We are a fully community-owned project and no external capital has been received. This allocation would also help to onboard new developers to our Play-to-Own gaming hub, and collectively produce many entertaining games and environments for Optimism users. Dope Wars has a strong verifiable precedent of retroactively rewarding (bounty) contributors via onchain community vote. As one example, here is a proposal for funding including proposed budget, followed by the corresponding successful vote for disbursement here a few months later. We feel that this precedent strengthens our case for responsibly and effectively managing project growth through contributor incentives. The breakdown per contributor incentive vertical is as follows: 20k - Swap Meet 2 deployment 30k - Paper Rock Scissors launch 70k - MMO MVP release. Community alpha testing has already been held. 30k - reserved to incentivize the next wave of community-built experiences, some of which have already been heavily iterated upon, including $TURF, our own customizable virtual land baked into the MMO, which is already deep into the interface design process.   I love Dope Wars strategy here. Similar strategy to the $MAGIC ecosystem on Arbitrum which leverages its ecosystem of games to create a network effect. Can you tell us how you arrived at the amount per vertical (was it based upon value/importance to the ecosystem or maybe just effort?) ",
                    "links": [
                        "https://www.tally.xyz/governance/eip155:1:0xDBd38F7e739709fe5bFaE6cc8eF67C3820830E0C/proposal/915390809642468416964350110765684618981849135389590534041270472499402544187"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.869606782106782
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "4",
                    "likes": "2",
                    "time": "03/10/2022-21:01:41",
                    "content": "Hi @Butterbum, Thank you for the tag. This proposal has many suggestion from Phase 0 incorporated into it, number of token request is more reasonable and focused towards platform use. I have read about this project in Phase 0 so i will mostly focus on distribution part. Do you have a documentation or tutorial related to two mini-games(paper rock schissors and Dope Frenzy).  As a user, what action I need to perform to receive the OP Incentives ? And how the distribution will look like ?     salparadise:  will be reserved for incentives in the OP based DOPE MMO metaverse experience, currently being built by Dope Wars contributors   Would you consider asking for this once the game is live ?     salparadise:  incentivize development of games   This we are discussing from long time and was discussed in our last community call as well. Personally, I would suggest you to give some time and wait for foundation to provide more guidance on supporting development funding. I am sure its not gonna happen this cycle or even next but I am confident that we will see new guideline ready for Season 3 starting in November. Its a matter of two months but then it will be easy for us to support your proposal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.953823953823953
                },
                {
                    "author_link": "https://gov.optimism.io/u/quix",
                    "index": "5",
                    "likes": "4",
                    "time": "04/10/2022-05:44:28",
                    "content": "I am an Optimism delegate [Delegate Commitments - #66 by quixotic] with sufficient voting power, and I believe this proposal is ready to move to a vote. ",
                    "links": [
                        "https://gov.optimism.io/t/voting-cycle-7-roundup/3586/18"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/salparadise",
                    "index": "6",
                    "likes": "3",
                    "time": "04/10/2022-17:18:31",
                    "content": "Hi @OPUser @jrocki.eth, Thank you for your time in giving feedback. Having contemplated the general sentiment, we think that given the following revision, we can still deliver on the same milestones in a timely manner, and come back with a new proposal, if applicable, once we have released the games. We hope that the following reduction in our ask will make the proposal more palatable to the delegates:  100k Dope MMO User Incentives can be tabled for this proposal. While we would like to have this available soon for the release of the game, we understand your position of wanting to see the game first.  Given the virtually unlimited ceiling of our project, we think the potential benefits for the OP community are immense. OP should be the home for public goods gaming and I don’t think it can be overstated that OP is currently lagging other L2s and alt-chains in the gaming sector. Dope Wars embodies the Optimistic Vision, and as far as we know there are no gaming rivals on the network in terms of scope, vision, community or traction. We have amazing support from @quix, a critical piece of the OP network. We understand that the developer incentives are a sticky subject here, but given the above, we would love to be the example and help work through the OP team’s modeling around this for future projects. (Edit: formatting) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.314064558629776
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "7",
                    "likes": "3",
                    "time": "04/10/2022-18:59:03",
                    "content": "Hi @salparadise , appreciate the positive attitude towards the feedback.     salparadise:  we would love to be the example and help work through the OP team’s modeling around this for future projects.   This was refreshing to read and would love to contribute. From my side, I would focus on providing information that gives confidence on what you want to built and how you plan to do it keeping focus on fund distribution. Refer to what you have mentioned, what could we add to make sure that we know how those 4 verticals will be delivered. I dont think we need a kanban board for this but rather than asking for full dev funding, I would focus on iteration, you know more about your goal so break it into module and try to paint a full picture of end result. Refer to Rotki proposal for ideas. I will try to add more on this but could you provide some information what i requested in last comment.  Do you have a documentation or tutorial related to two mini-games(paper rock schissors and Dope Frenzy). As a user, what action I need to perform to receive the OP Incentives ? And how the distribution will look like ?  I want to play game to understand the need and to evaluate the proposal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.295454545454545
                },
                {
                    "author_link": "https://gov.optimism.io/u/FractalVisions",
                    "index": "8",
                    "likes": "3",
                    "time": "04/10/2022-22:20:26",
                    "content": "Great proposal ! Very exciting times for the Optimism community… Dope Wars has great potential to bring Ethereum users to the OP ecosystem. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.737500000000001
                },
                {
                    "author_link": "https://gov.optimism.io/u/faces",
                    "index": "9",
                    "likes": "3",
                    "time": "05/10/2022-00:34:42",
                    "content": "Maybe I can chime in and help with the time + scope aspects at a high level as I’ve worked on each of these projects. I understand how the timing of these things might seem strange to outsiders of the project, but it all has a rhyme and reason. Primarily, we are insuring we set the DAO up for success with stable legal footing before taking potentially dangerous steps into waters that could endanger our community who reside in increasingly crypto-litigious locations such as the United States. Because of this, we’ve had to shuffle the priority of efforts in flight, and some things have been paused so we can sequence them correctly 1. SWAP MEET  + PAPER The DAO has been advised by legal council that we must demonstrate utility of our gaming token PAPER before we actually release a game that utilizes the token. We’ve taken that to mean that we should at minimum allow players to buy/sell Hustlers and Gear on our Swap Meet using PAPER. I’ve been working with the team at Reservoir for the past few weeks to implement a proof-of-concept store for another project which has successfully launched on Eth Mainnet. They recently (as of last week) released the ability to use ERC-20 tokens in their React kit! This should finally allow us move away from some hand-rolled solutions we’ve made and had been considering creating – and instead quickly iterate to fix some bugs and finally check this off the list after way too long. a. Tasks  Store listings for DOPE, Hustlers, and Gear across Mainnet and Optimism in our API from Reservoir Allow DOPE community members to list and purchase items in PAPER on our marketplace at Dopewars.gg using Reservoir Kit UI Move away from our home-rolled OpenSea and Ethereum indexers to provide a more stable experience for people buying / selling gear Re-enable our 1-click Hustler Quick Buy that mints a hustler on Optimism using the new listing system  b. Time  80-120hrs  2. PAPER ROCK SCISSORS I can offer documentation on the inner workings of PRS by linking you to the product brief for it. The smart contracts are done and publicly available on Github. The source has been deployed on Goerli Eth for testing. We intend to use the grant to further develop the front-end experience, smooth out any issues with gameplay and deliver it to market, along with providing incentives for users to play the game. We intend to run competitions over periods of time, where the best players over certain timeframes can gain extra OP tokens in addition to PAPER for playing PRS. Our leaderboard will be publicly stored on Tableland for anyone to verify fairness of game results. We will finalize what those competitions look like and how best to run the incentives for participation once the game is operational. a. Tasks  Work with Chainlink (or someone else) to understand if we can take any token and swap it to PAPER for increasing a players balance using an on-chain oracle Deploy smart contracts on Optimism Deliver a front-end experience hosted on Dopewars.gg Run our first competition incentivizing users to play for PAPER+OP tokens  b. Time  120-160hrs  3. DOPE MMO This is a bit further out as we have some internal work to do in order to solidify the game engine, and is a more ambitious project. We have a playable alpha that we can stand up for people if they’d like to check it out later on, but would require I put in some hours to make that happen. Currently players can run around the map, chat with each other, and explore during daylight and night light in an immersive environment. DAO members have also worked on a series of quests (example) that are ready to be implemented once we have funding to do so. Players will participate in quests such as these, then be able to gain rewards for completing them, such as minting NFT items, or receiving tokens as a prize. As a product manager, this feels as if it needs the most definition and probably comes last. a. Tasks  Implement a more standardized authentication solution that works across Dopewars.gg and the game (probably Firebase auth using SIWE as the mechanism) Improve multi-player performance Design + implement a NFT rewards system that can gift players items securely once they’ve completed a task Store results of these player quests in a public ledger (maybe Tableland)  b. Time  160hrs+   Hopefully this illuminates the inner-workings of dev across these efforts and can provide OP delegates with confidence this time around that we are asking for the appropriate amount of tokens to make significant progress. ",
                    "links": [
                        "https://qx.app/collection/gear",
                        "https://reservoir.tools/",
                        "https://github.com/reservoirprotocol/reservoir-kit/blob/main/packages/ui/src/modal/list/ListModal.tsx#L264",
                        "https://dopewars.gg/hustlers/quick-buy",
                        "https://www.notion.so/textile/PAPER-Rock-Scissors-Brief-2440cb8c54ad4d99873a99424eb695b0",
                        "https://github.com/dopedao/prs",
                        "https://goerli.etherscan.io/address/0x352bB0F1317bC03f3EA77D1A325f5E71bF277f51#code",
                        "https://docs.google.com/document/d/1AtJn5Eiwi_z5AK6rA9K-JZIQyiGWIMm8iSh22eSbWLU/edit"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.605371817448088
                },
                {
                    "author_link": "https://gov.optimism.io/u/jrocki.eth",
                    "index": "10",
                    "likes": "2",
                    "time": "05/10/2022-01:47:30",
                    "content": "    salparadise:  100k Dope MMO User Incentives can be tabled for this proposal. While we would like to have this available soon for the release of the game, we understand your position of wanting to see the game first.   Thank you for taking our feedback to heart. I think that is a good adjustment to make to the proposal and would like to see this move to the committee review phase. In order for this to happen the following will need to occur before tomorrow (10/5/2022) at 3pm ET:  Update (click edit on your post) this proposal with what you outlined Have a delegate with enough OP (>= .5%) delegated to them post their approval as a comment in this thread Post your Quix approval comment  plus the additional delegate approval comment from above here   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.34375
                },
                {
                    "author_link": "https://gov.optimism.io/u/Exosphere",
                    "index": "11",
                    "likes": "4",
                    "time": "05/10/2022-16:49:33",
                    "content": "I am an Optimism delegate [Delegate Commitments - #29 by Exosphere ] with sufficient voting power, and I believe this proposal is ready to move to a vote. ",
                    "links": [
                        "https://gov.optimism.io/t/voting-cycle-7-roundup/3586/18"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Butterbum",
                    "index": "12",
                    "likes": "3",
                    "time": "07/10/2022-20:36:29",
                    "content": "Hey @jrocki.eth @OPUser Thanks for your feedback and suggestions, Dope Wars have updated our proposal and has added a structure for developers incentives. Your feedback on our Retroactive Developer Incentive Program is welcomed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/jrocki.eth",
                    "index": "13",
                    "likes": "3",
                    "time": "12/10/2022-06:29:01",
                    "content": " Cycle 7   Dope Wars  Voting recommendation: “No” with the guidance they resubmit with adjustments for Cycle 8 Summary: This was incredibly close, in fact, the committee was initially split right down the middle with two members for, two against and one appropriately abstaining due to a conflict of interest. In the end we were able to come to a consensus and recommend to vote “Against” this proposal with guidance to adjust based on our feedback and resubmit in cycle 8. In the end the decision came down to the amount of $OP requested tied to games that are still pending release.  Before we dive in lets summarize the proposal request: 75,000  $OP - In game incentives for PAPER Rock Scissors 75,000  $OP - In game incentives for  Dope Frenzy 150,000 $OP - For a Retroactive Developer Incentive Program aimed at rewarding the community building games for the Dope Wars ecosystem now and into the future. We as a committee believe the best approach to fund innovative and experimental proposals like Dope Wars is to do it in an iterative manner where we are able to maximize learnings while minimizing the initial outlay of $OP funding. With the understanding that projects are encouraged to request funding on an on-going basis and are more likely to receive that funding if their last proposal was a success for the Optimism ecosystem.   Assessment of the in-game incentives funding ask: The concept of in-game incentive programs for gaming has been proven to drive new user growth and usage for the ecosystem they are implemented in so we are in agreement this would be beneficial to the Optimism ecosystem as well as help kick start the gaming ecosystem on Optimism. Gamers have already proven there is a huge addressable gaming market just on layer 2 with the $MAGIC gaming ecosystem topping 180k+ total users on Arbitrum.     Our recommendation to adjust is to prioritize incentives for the first game being released then subsequently submit a proposal to incentivize the next game closer to it’s launch date. This recommendation was made after having consulted the Dope Wars team on where they are at in the development phase for these games.   Assessment of the Retroactive Developer Incentive Program (RADIP) funding ask. This is a concept we vetted and refined with the Dope Wars team. We feel the “RADIP PROCESS” outlined in the proposal provides sufficient assurances to ensure the $OP will be utilized for it’s intended purpose while mitigating risks associated with anyone trying to game the Retroactive Developer Incentive rewards Program as the incentives are retroactive in nature and therefore tied to milestones with defined outputs, agreed upon by the DAO, and distributed after the initial release across several months to ensure the quality of the work. Our recommendation to adjust is to request only the amount of funding needed to incentivize and reward development over the next few months at which point Dope Wars would be encouraged to submit another proposal for more funding. The amount of funding likely to be approved in the future is only limited by how effective Dope Wars utilizes funds it has received previously from the governance fund.   I would like to thank the Dope Wars team for their commitment to this proposal and active collaboration with the NFT & Gaming Committee. This is the second voting cycle that Dope Wars has submitted their funding proposal, and we hope to see a modified version of this in cycle 8! ",
                    "links": [
                        "https://gov.optimism.io/t/gfx-labs-delegate-communication-thread/2728/17"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.539623721688939
                },
                {
                    "author_link": "https://gov.optimism.io/u/faces",
                    "index": "14",
                    "likes": "2",
                    "time": "12/10/2022-16:29:16",
                    "content": "Damn. That’s a bummer. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/jrocki.eth",
                    "index": "15",
                    "likes": "0",
                    "time": "12/10/2022-17:19:03",
                    "content": "I completely understand, your feelings as from the Dope Wars POV you submitted in a prior cycle, incorporated feedback, then did the same thing again here only not to get a recommendation. So it seems like we moved the goal posts on you guys a bit but I can assure you that is not the case. With the introduction of committees this voting season there is now more concentrated feedback coming from a smaller group of delegates doing a deep dive. So the assessment process is slightly different That being said it is a rock solid proposal in my opinion as far as what is being funded and how that will be distributed. In the end it came down to the amount being requested and our preference to fund in smaller, iterative chunks. Now the reality of the situation is really that NFT & Gaming project funding is and will continue to be more heavily scrutinized by the community at large until we can demonstrate the value of using governance funds on such projects. Defi incentives are more widely accepted in general which is why you see so many defi projects getting passed with such large amounts of OP. Now I am of the opinion that it is going to be NFTs and Gaming driving the next bull run and not Defi 2.0 as it were which is why I put this committee together. We just need to get over this initial hump by iteratively proving out the value of funding solid NFT and Gaming projects ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4659645909645915
                },
                {
                    "author_link": "https://gov.optimism.io/u/salparadise",
                    "index": "16",
                    "likes": "4",
                    "time": "12/10/2022-18:02:52",
                    "content": "Thank you @jrocki.eth for writing this up. Please keep in mind that I am only a community member of Dope Wars, Dope DAO has never paid for me for any type of work, and my views here are my own and do not represent that of the Dope Wars community or DAO. I feel that we have done everything that has been asked us based on delegate feedback from our first proposal (seeking 1M OP), and in the week of feedback for this proposal (400k, reduced to 300k based on feedback) For example, from our first 1m OP proposal @lefterisjp wrote:  I want to stress this splitting up the proposal. Even if you indeed need 1M $OP for 2 years of development, making 1 new proposal every 6 months is a much easier way to get this approved. You could even mention in the initial proposal that you will in total need 1M $OP and plan to follow up with more as the milestones of your proposal are completed and that delegates should only approve if they are comfortable with you coming back for more in doses like that.  And then  This is a hard vote for me as a delegator has contacted me in Twitter and asked me to specifically vote YES here, and since I really like what you are building and how you are doing so. But the amount is simply too high for a single proposal. If you follow through again later with splitting this into multiple proposals as I suggested above, with each proposal representing a certain milestone of the project it will be much much easier for me to vote in favor. Which is something I really want to do. I think the same applies for most other delegates. Please don’t be discouraged and resubmit another proposal taking in all our feedback.  And this from @linda:  Thanks for sharing your proposal. Similar to other delegates, I feel the amount requested is too high and I would prefer this amount to be broken up into multiple batches based on the progress/traction of the fund usage so I will be voting no on this specific proposal. Happy to re-review for a future one!  We got a Yes in that proposal for 1m OP from current NFT & Gaming Chair @jrocki.eth:  YES Dope Wars will be putting the funds to good use in order to bring a new cohort (gaming) of users into the ecosystem  And this from @quix  We voted yes on this proposal. The Dope Wars team was the first major NFT project to move from layer 1 Ethereum to Optimism (before there was a marketplace). They have a strong track record of technical development and community building. We believe it’s important to support novel use cases of NFTs, and funds given to Dope Wars are likely to support the type of interesting experiences that bring new users to Optimism.  Moving to the first iteration of current proposal, we updated things to reflect the current state of DW, and based on advice like the above from the previous proposal, dropped our ask 60%. We then dropped it another 25% (to 300k) based on forum feedback, and structured and began internally implementing RADIP, primarily based on the guidance of NFT & Gaming Committee member @OPUser We did not receive feedback from Committee member @Michael, who voted NO. From Michael’s delegate commitment post:  My Web3 interests: Economics, Infrastructure, DeFi, Social Impact, Wallets My skills and areas of expertise: Software Engineering, Machine Learning/Robotics, Economics, Finance, Product, Education My favorite Web3 projects: Optimism, Gnosis Safe, CowSwap  I think it important for delegates to note the lack of mention of anything NFT or gaming related in Michael’s post, and also to note that they did not provide any public feedback to DW. Personally, it feels that the OP delegates are simply more comfortable with DeFi, and we all could speculate on a number of reasons for this. But I believe this is short-sighted. I am highly interested in the gov processes being worked on here and the OP Vision in general. However, it would be a shame to see Optimism become a farming-centric chain rather than one that takes risks in innovative areas with potential for massive disruption via public goods framework, within a vertical that has seen huge traction on other chains. EDIT: Delegates should note that only 2/5 committee members voted NO. Due to an abstention (which would have otherwise been a YES), there seems to have been an impasse. Neither of the 2 NO voters have joined the DW discord server, the most obvious place for due diligence. There were no other projects for this committee to vet this cycle. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.744661128914376
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "17",
                    "likes": "1",
                    "time": "12/10/2022-18:59:30",
                    "content": "Thank you for writing this @salparadise . One thing I do appreciate that DW incorporated our feedback in  new proposal and we discussed this internally while reviewing the proposal. Looking back to the last recommendation and feedback is important and it keeps delegate in-check but I would like to mention that rules and guidelines are changing every cycle. like @jrocki.eth said, I do understand the frustration of not getting approval in second attempt but one thing can tell you with confidence, we looked into all aspect of the proposal. There are many things to consider, such as token need, targeted audience, use case, value creation and plan, and it varies with each proposal type When I compare with last proposal and new guideline, DW has made good progress and look at the bright side, your community came up with a plan for doing dev funding, on-chain games are in making and you are focused more on user value creation. One goal from proposal side is to remove “if” part and focus on answering the 3Ws  “what, how and where” in the proposal . When we were discussing this, there were few open question, some suggestion were made, we ponder around different idea to make this proposal more aligned towards long lasting value creating and we discussed this with the author. Looking forward towards updated proposal. Also join in on our channel in OP Discord to discuss the RADIP. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.874401913875598
                },
                {
                    "author_link": "https://gov.optimism.io/u/mboyle",
                    "index": "18",
                    "likes": "5",
                    "time": "13/10/2022-03:54:33",
                    "content": "FWIW I think delegates must consider the broader landscape of L2 competition right now. Optimism isn’t the only L2 chain seeking great projects and builders and in my opinion has a fair amount of catchup to do in order to be competitive with Polygon, Immutable, Starknet, Solana, Arbitrum–the list goes on. Continuing to shut down one of the most prolific gaming and NFT projects in the ecosystem over a couple hundred thousand OP difference is, in my opinion, penny-wise and pound foolish. If (when?) Dope Wars give up on this and move to Starknet or Polygon or other chains that are more than willing to incentivize building with a fraction of the hassle it will be a major indictment on this process, community governance generally, and what builders have to look forward to when initiatives like RPG come online. Edit: If I’m doing the math correctly, 300k OP represents 0.13% of the total Phase 1 fund. I was around for the hotly contested debate at Dope Wars about a year ago now over whether the project should go all-in on Optimism to build out the game. They took a huge, arguably existential, bet on building here. In my eyes this warrants the benefit of the doubt over a difference in 0.05% of the Phase 1 grant pool. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.039219576719576
                },
                {
                    "author_link": "https://gov.optimism.io/u/jrocki.eth",
                    "index": "19",
                    "likes": "2",
                    "time": "13/10/2022-04:47:34",
                    "content": "That is a fair assessment and that was a big concern of mine as well. In order to mitigate as much as possible we tried to provide a very clear path towards approval in the next cycle. So ideally there will be a slight tweak in the OP amount, add to cycle 8 and in 2 weeks time the Dope Wars thread should have a yes recommendation from the committee ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.116666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/mboyle",
                    "index": "20",
                    "likes": "4",
                    "time": "13/10/2022-06:22:10",
                    "content": "Flagging that Dope Wars are now voting to move off of Optimism to Starknet or Polygon: https://snapshot.org/#/dopedao.eth/proposal/0xd46d2cf6507e8f404c48c220c60032003738731b207459002ac35c68b7a968c0 This is a disappointing outcome and should trigger some reflection for delegates and committees on the frameworks they’re using to evaluate proposals. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 2.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Exosphere",
                    "index": "21",
                    "likes": "9",
                    "time": "13/10/2022-16:00:57",
                    "content": "Just because the committee voted against the proposal, doesn’t mean it’s dead in the water. I plan on still voting for it in cycle 7 and invite other delegates to join me. Optimism has a lot of momentum on the NFT front right now, and it’s a bummer to see one of the most innovative NFT projects on the network getting yanked around by the governance process to the point that they are considering moving to another network. I really think this is a case of perfect being enemy of the good. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.415674603174604
                },
                {
                    "author_link": "https://gov.optimism.io/u/katie",
                    "index": "22",
                    "likes": "7",
                    "time": "13/10/2022-20:19:16",
                    "content": "Voted yes - Although this is against the NFT and Gaming Committee recommendation, I really like this proposal.  I believe gaming is undervalued in the space and the proposal provides gaming incentives which will increase traction on OP.  I also really appreciate that 50% of the tokens will be used for developer incentives, which is also something I would love to see more of.  Overall, I don’t see a downside and support this proposal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.4
                },
                {
                    "author_link": "https://gov.optimism.io/u/quix",
                    "index": "23",
                    "likes": "8",
                    "time": "13/10/2022-20:41:06",
                    "content": "We voted in support of this proposal, as we did with their original proposal, and encourage other delegates to do the same. The Dope Wars team was the first major NFT project to move from L1 Ethereum to Optimism (before there was even a marketplace or standard bridge). They have a strong track record of technical development and community building. We believe it’s important to support novel use cases of NFTs, and funds given to Dope Wars are likely to support the type of interesting experiences that bring new users to Optimism. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.846748737373737
                },
                {
                    "author_link": "https://gov.optimism.io/u/jrocki.eth",
                    "index": "24",
                    "likes": "3",
                    "time": "13/10/2022-22:56:38",
                    "content": "Love the positive vibes and not blindly following a recommendation this is how governance should be. I actively encourage this sort of discourse ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.742424242424242
                },
                {
                    "author_link": "https://gov.optimism.io/u/jrocki.eth",
                    "index": "25",
                    "likes": "5",
                    "time": "13/10/2022-22:58:52",
                    "content": "Very well said, perfect vs good was one of the reasons we as a committee were split down the middle initially on this one ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.453703703703704
                },
                {
                    "author_link": "https://gov.optimism.io/u/FractalVisions",
                    "index": "26",
                    "likes": "5",
                    "time": "14/10/2022-01:23:21",
                    "content": "Awesome! Happy to see the support coming in to push this proposal through despite the split vote. I agree that this is one of the origin projects from the Optimism ecosystem and there is a lot of potential here with a very dedicated community. I am very excited to see how this turns out. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.487500000000001
                },
                {
                    "author_link": "https://gov.optimism.io/u/ScaleWeb3",
                    "index": "27",
                    "likes": "5",
                    "time": "14/10/2022-11:19:56",
                    "content": "The proposal: @salparadise @Butterbum: First of, we haven’t looked at the project in-depth. Our impression is that the proposal is detailed, incorporated previous feedback and can help with growth on Optimism. The committee decision: We also want to mention, that the committee seems to have made a very detailed review and we 100% agree on the approach of the committee.     jrocki.eth:  We as a committee believe the best approach to fund innovative and experimental proposals like Dope Wars is to do it in an iterative manner where we are able to maximize learnings while minimizing the initial outlay of $OP funding. With the understanding that projects are encouraged to request funding on an on-going basis and are more likely to receive that funding if their last proposal was a success for the Optimism ecosystem.   Our vote: After evaluating the proposal and value-add of the project once more, we have decided to vote against the recommendation of the committee and voted YES as the distribution of funds is granular, well-specified & we believe Dope Wars & the games can help onboard users to Optimism. General take on heated debates, grants, co-incentives: Of course, we understand the disappointment raised in this thread and on Discords when a proposal is not approved multiple times. (We’ve experienced that also a few times in the past years.) Hence, the threat of leaving Optimism is understandable from your disappointment but neither supporting the cause nor convincing - especially as the committee only asks to slightly adjust the proposal. We also see that various (good, alternative) ecosystems incentivize teams to build on their chain, and we believe Optimism should be competing for the best teams - that are aligned builders for the long-term.     mboyle:  Continuing to shut down one of the most prolific gaming and NFT projects in the ecosystem over a couple hundred thousand OP difference is, in my opinion, penny-wise and pound foolish. If (when?) Dope Wars give up on this and move to Starknet or Polygon or other chains that are more than willing to incentivize building with a fraction of the hassle it will be a major indictment on this process, community governance generally, and what builders have to look forward to when initiatives like RPG come online.   That said, there is a big difference in giving out 100K Op, 200K Op or 300K Op in one grant and not in several follow-up grants and milestone payments. Optimism seems to develop into a multi-billion $ project and a large l2 ecosystem within the Ethereum ecosystem. However, today, Optimism is an early-stage project with a $150M marketcap, with significant upcoming selling pressure (-> less $Op value to spend), somewhat undefined ecosystem growth strategy while traction & Op demand is yet to be seen. We’ll finish this post with a comment from one of the best researchers in Web 3 that should make clear that co-incentives are good-to-have but should not be the key decisive factor where you build.  twitter.com    Dmitriy Berenzon @dberenzon  Pour one out for the founders who took unnecessary platform risk and spent years building on a ghost chain because they received grant funding   2:16 AM - 13 Oct 2022           370                28            ",
                    "links": [
                        "https://twitter.com/dberenzon/status/1580382060383916032?s=20&t=L-yWCs5j5hc_nNX74gHVXw",
                        "https://twitter.com/dberenzon/status/1580382060383916032?s=20&t=L-yWCs5j5hc_nNX74gHVXw",
                        "https://twitter.com/dberenzon/status/1580382060383916032?s=20&t=L-yWCs5j5hc_nNX74gHVXw"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.8686119737750175
                },
                {
                    "author_link": "https://gov.optimism.io/u/polynya",
                    "index": "28",
                    "likes": "9",
                    "time": "15/10/2022-03:18:32",
                    "content": "I was going to vote for this proposal, but I’m abstaining. I’m disappointed by the sense of entitlement displayed here. Relying on grants is not a sustainable business model, and this should not be a reason for being on Optimism. OP delegates have a responsibility to OP token house to be cautious and diligent - granting hundreds of thousands of OP is no trivial matter. Delegates vote with a reason, and if your proposal isn’t approved it’s because they didn’t think it was good enough - that’s all. “Optimism is not supportive” is an immature read on the situation. The correct response is to keep building on the platform best suited to your protocol, no matter what happens with the grants, all the while improving your proposal to the point delegates think it’s good - which ironically might happen this cycle. I’m abstaining because there’s an ongoing vote going to “move to StarkNet” and I’m uncomfortable with granting OP tokens to a project that’ll use them on StarkNet or elsewhere instead. (To be clear, I support both Dope Wars and StarkNet, but my responsibility here is as a delegate is to the Optimism Collective.) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://gov.optimism.io/u/salparadise",
                    "index": "30",
                    "likes": "5",
                    "time": "15/10/2022-15:12:56",
                    "content": "Hello @polynya, The snapshot poll that made its way to this thread by a third party was intended as a heat check within our community to display our disagreement with the committee recommendation to reduce our ask for a 4th time. DW has a history of using snapshot as a whip for community input. As a community-owned protocol, we have found this an effective way to bring exposure to and spark discussion around things that otherwise may have only been discussed among the team and the more active members. I see a difference between “entitlement” and “knowing your own value.” We have been live on OP for just under a year. We are not hunting for grants to choose our network, we are looking for support from the network that we have chosen. Everything we have built thus far is designed to be implemented on OP, with the exception of one early mini-game. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.057239057239058
                },
                {
                    "author_link": "https://gov.optimism.io/u/faces",
                    "index": "31",
                    "likes": "5",
                    "time": "15/10/2022-18:00:38",
                    "content": "Appreciate your thoughts, but as @salparadise has expressed, we simply use snapshot to take a heat check from our community. Nowhere in that snapshot, or this proposal does it say we’d take OP tokens to incentivize moving everything to another network. After the very disappointing recommendation from the NFT + Gaming committee and what looked like a dead vote a number of our community members were very disheartened and action needed to be taken. The snapshot was created to bring attention to this situation, and really get a sense from our community what should be done assuming this vote fails. Please understand we’ve been getting doors slammed in our face since March. First, failing to secure VC funds because we are a DAO with only tokens to offer. Next, trying and failing to secure a grant from the Optimism foundation in June, then finally going through this process yet another time and seemingly being rejected by the committee that should have our best interests in mind. It’s horribly frustrating to keep adjusting the number of tokens downward. First 1M, then 500K, then 400K, now 300K…and still getting rejected with no clarity as to what the magic number is that will secure a yes. It’s easy to feel unwanted when we see DeFi projects easily securing 800K plus tokens for what feel like “more of the same” Dope Wars offers an innovative, OP native project with excited builders who have been doing this for free since last year. We continually show love to Optimism through advertising, engagement on the network, and by supporting other projects. It’d be nice to get some of that love back. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.952525252525253
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "32",
                    "likes": "2",
                    "time": "15/10/2022-18:28:05",
                    "content": "Voted Against. Part of committee and going with committee decision. With changes suggested, happy to support in next cycle. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/polynya",
                    "index": "33",
                    "likes": "1",
                    "time": "16/10/2022-03:12:31",
                    "content": "Your frustration is understood, but like I said, lashing out at Optimism governance isn’t an appropriate response. Crypto is a brutal business - 99.99% DAOs will fail - playing the victim is unproductive. Heat check or not, I’m unimpressed by a community that wants to move to a different platform out of spite rather than a well thought out technical reason, and definitely not while there’s a vote to grant you OP tokens is ongoing. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.53125
                },
                {
                    "author_link": "https://gov.optimism.io/u/faces",
                    "index": "34",
                    "likes": "6",
                    "time": "16/10/2022-04:42:30",
                    "content": "Nobody is “lashing out” nor “playing the victim” here. You’ve made it clear that you don’t believe we bring enough value to the chain to vote for us. Thanks for explaining your reasons. We definitely understand that business is brutal, crypto or not. Understanding that fact we’re trying to find the best situation that will provide us the highest chance of success. It’s clear that you’re a savvy business person. Being that savvy business person I’m sure you can also understand us wanting to find a better deal if none exists for us here. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.795454545454546
                },
                {
                    "author_link": "https://gov.optimism.io/u/linda",
                    "index": "35",
                    "likes": "3",
                    "time": "17/10/2022-21:24:44",
                    "content": "I’m abstaining from this vote. I acknowledge @quix’s points about the Dope Wars team’s track record and that they were the first major NFT project to move from L1 Ethereum to Optimism which is why I’m not following the committee recommendation of no (especially since the committee vote was initially split down the middle). However, I didn’t find the committee points to be unreasonable so I don’t feel strongly enough to vote against their recommendation. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.098090277777779
                },
                {
                    "author_link": "https://gov.optimism.io/u/jrocki.eth",
                    "index": "36",
                    "likes": "8",
                    "time": "18/10/2022-16:27:39",
                    "content": "Voted “For” I will keep it short as most of my thoughts were expressed throughout this thread. I am dissenting with my own committee as I have spoken with many builders involved with the Dope Wars project and even had them on The Web3 Experience Podcast before to discuss their first proposal in detail which I also voted for. I voted for because I trust the project (as Quix does too) and I feel gaming is going to be a massive opportunity that is under represented within this ecosystem at the moment. However this vote turns out, I respect the productive discourse facilitated by everyone who has contributed to this thread. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.541666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/philburrt",
                    "index": "37",
                    "likes": "0",
                    "time": "20/10/2022-02:31:35",
                    "content": "These guys can’t be trusted with money. Diluted their token supply with a private youtube video of their founder on a beach in Bali. The vote is still up on Tally, it passed due to team member whales and now they deleted the video. And they’ve never shipped anything other than pictures. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.583333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/Butterbum",
                    "index": "38",
                    "likes": "3",
                    "time": "20/10/2022-08:14:38",
                    "content": "Hey there @philburrt, sorry you feel that way. I have to disagree with you. the video was on discord for all active Dope holders to see and the discussion/debate around the topic was on going for months. The vote on Tally past by unanimous decision and not due to “team member whales”  image705×645 40 KB  and was followed up by relinquishing ownership of the PAPER contract  image681×851 42.2 KB  And to say DW has only shipped pictures is humorous… Our interoperable fully customizable Hustlers are not just pictures. DW has been moving forward, slower in the bear market but still moving forward. ",
                    "links": [
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/0/0766089887211e2c69aae2d85d63b6878dd5f272.png",
                        "https://www.tally.xyz/governance/eip155:1:0xDBd38F7e739709fe5bFaE6cc8eF67C3820830E0C/proposal/81112931917192638141470701510126892469055764033614593540203316096249569493784",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/2/2a07cadbe1eb7609135d4d8a4dcd59dd932effce.png"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.179166666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/cryptoprimitive",
                    "index": "39",
                    "likes": "3",
                    "time": "20/10/2022-09:02:33",
                    "content": "     ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "40",
                    "likes": "6",
                    "time": "20/10/2022-11:35:46",
                    "content": "I am voting FOR this proposal and am going against the committe’s recommendation. My reasoning:  I think it is adding value to the OP ecosystem It’s a unique approach to using gaming in play to earn and plans to progressively move to Optimism We rejected them in a previous round and provided feedback. They incorporated that feedack quite nicely in my opinion so they deserve to be given the grant. Commitee’s recommendation does indeed feel like moving the goal posts.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.760416666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/cryptoprimitive",
                    "index": "41",
                    "likes": "4",
                    "time": "20/10/2022-11:43:21",
                    "content": "Unanimous decision. Which I think also shows the strength of our community that we were able to come together after such a contentious first fail on heat check months earlier. Truth is, its clear our free paper and nft distribution did not give us the building blocks to progress on the project. The project that most closely mirrored ours on token distribution was Magic, and the developers and community there likewise saw the need for an additional mint which you can read about here. There is no longer an ability to mint additional paper.   Medium – 3 Jun 22    Paper Increase Proposal Rationale ver 2. abbreviated Token increase short term negative ?  Reading time: 8 min read       Tally vote on paper increase - You can see the vote passed with a number of individual wallets, many with little Dope held.  Tally    Dope Wars | The DAO needs to increase the supply of $PAPER in order to raise... The DAO needs to increase the supply of $PAPER in order to raise money from investors and to reward contributors. Once the supply is created follow-up proposals to allocate the new supply will be posted and evaluated.  I've recorded a 7min video...       Vote to remove paper mint function  Tally    Dope Wars | # Burn the $Paper Mint Function Burn the $Paper Mint Function Taniela.Taki Fellow Hustlers.  With the $Paper inflate complete and the SnapShot now passed, the time has come to make a decision whether to effectively disable the DAO’s ability to inflate further. Execution of this is...      ",
                    "links": [
                        "https://medium.com/@JDog1776/paper-increase-proposal-rationale-ver-2-abbreviated-44babf95c034",
                        "https://www.tally.xyz/governance/eip155:1:0xDBd38F7e739709fe5bFaE6cc8eF67C3820830E0C/proposal/30600128298117676277554169874283776405585867552052066919092841814555374554857",
                        "https://www.tally.xyz/governance/eip155:1:0xDBd38F7e739709fe5bFaE6cc8eF67C3820830E0C/proposal/30600128298117676277554169874283776405585867552052066919092841814555374554857",
                        "https://www.tally.xyz/governance/eip155:1:0xDBd38F7e739709fe5bFaE6cc8eF67C3820830E0C/proposal/81112931917192638141470701510126892469055764033614593540203316096249569493784",
                        "https://www.tally.xyz/governance/eip155:1:0xDBd38F7e739709fe5bFaE6cc8eF67C3820830E0C/proposal/81112931917192638141470701510126892469055764033614593540203316096249569493784"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.721906565656566
                },
                {
                    "author_link": "https://gov.optimism.io/u/cryptoprimitive",
                    "index": "42",
                    "likes": "4",
                    "time": "20/10/2022-11:44:34",
                    "content": "Thank you for your support. We look forward to showing the community what our play to own model can offer. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/faces",
                    "index": "43",
                    "likes": "2",
                    "time": "20/10/2022-20:14:34",
                    "content": "Thank you everyone who considered and supported this proposal. We can’t be more excited to bring this stuff to market and prove what a good bet you took on a scrappy, passionate, and truly decentralized team. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.90625
                },
                {
                    "author_link": "https://gov.optimism.io/u/madibaa08",
                    "index": "44",
                    "likes": "3",
                    "time": "20/10/2022-21:52:49",
                    "content": "Congrats! Now let’s continue working on getting some more OP eyes on the project! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.125
                },
                {
                    "author_link": "https://gov.optimism.io/u/FractalVisions",
                    "index": "45",
                    "likes": "4",
                    "time": "20/10/2022-22:06:31",
                    "content": "I am very excited to see history made here on Optimism with the first gaming proposal passing!!!  I fully support seeing more projects receive this type of support and help provide a standard for governance moving forward in the future. There is something really special about optimism which can not be found in many other places that involves the overall ethos of seeing others who put in a ton of hard work over the course of the years succeed. Along with contributing to public goods as a main reason to help grow the network. Congratulations to the DW team! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.885246155753968
                },
                {
                    "author_link": "https://gov.optimism.io/u/SEED_LATAM_Joxes",
                    "index": "46",
                    "likes": "2",
                    "time": "21/10/2022-02:02:03",
                    "content": "[Final] Voting: Against Following the NFT & Gaming committee recommendation, we continue to agree that the blockchain gaming sector is under heavy review and we’re happy to believe that the adjustments provided by the committee are the right path for a fair grant in this category. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.321428571428571
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "47",
                    "likes": "0",
                    "time": "21/10/2022-15:44:30",
                    "content": "Snapshot vote - passed ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "48",
                    "likes": "0",
                    "time": "21/10/2022-15:45:00",
                    "content": "@salparadise can you provide a Telegram handle or other contact method so the Optimism team can get in touch about paying out this grant! Feel free to DM or email palash@optimism.io ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.609375
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "49",
                    "likes": "0",
                    "time": "21/10/2022-15:45:04",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "283"
}