{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/perpetual-protocol-optimism-governances-first-failure/3029",
            "title": "Perpetual Protocol: Optimism Governance's First Failure ",
            "index": 3029,
            "category": [
                "\\xf0\\x9f\\x8f\\x9b Governance",
                "Grants"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/Ganc",
                    "index": "1",
                    "likes": "12",
                    "time": "19/07/2022-12:17:58",
                    "content": "Perpetual Protocol was granted 9,000,000 OP tokens (currently worth around $6.5 million) in a Phase 0 Grant, the proposal for which can be found here. This large grant was voted through as a batch vote, and in my opinion I do not think enough due diligence was done when green lighting such a large amount of funds. 1. Perpetual Protocol v1 collapsed resulting in loss of customer funds to the tune of $44.6 million. Whilst it appears some progress has been made, there are still customers with outstanding unrecovered funds and ongoing disputes relating to these funds You can see on Perp’s governance forums that there is still on going discussions regarding this and a solution is not yet in place. The collapse took place during the Luna unwinding, which was before the Phase 0 grant was approved.  PERP’s governance forum Proposal to unlock PERP tokens to compensate users Second proposal to unlock 27.6 million PERP tokens to compensate users Proposal to buyback PERP tokens to support v1 users that lost funds Proposal to use PERP to provide compensation to Perp v1 users  2. Perpetual Protocol immediately market sold 500,000 OP via Uniswap and then bridged the USDC out of Optimism and back to mainnet via Hop protocol  Transaction of sale here   I feel it is a bad precedent for distressed companies with outstanding obligations to be market selling Optimism grants and moving them out of the Optimism ecosystem. 3. 1.8 million OP tokens earmarked for airdrop to users have mostly ended up in team owned wallets, the majority of which have then been sold to stablecoins  Airdrop transaction here   Here are the wallets owned by the team / foundation. More than 70% of the airdrop ended up in these wallets out of which more than 70% were instantly dumped to stablecoins.  Screenshot from 2022-07-19 13-07-31692×420 90.7 KB  This seems to be because the vast majority of liquidity in v2 pools are provided by the team itself. Here is a decent summary on twitter. 4. Immediately after the airdrop the TVL of PERP on Optimism dumped by nearly a quarter This may have been people exiting who were solely providing TVL for the airdrop, but it does not bode well for the stated aims of the grant funding to increase liquidity.  So in summary in total on day one of receiving grant funding, 1,456,363 OP tokens were instantly dumped for USDC out of which 500,000 OP’s worth was bridged out of Optimism entirely. There are users complaining in the Perp discord about receiving only minute amounts of OP as an airdrop - pretty much because the vast majority has circled back to the team. Surely there is a better way of carrying out due diligence when there are giant sums like this being approved? ",
                    "links": [
                        "https://gov.perp.fi/",
                        "https://gov.perp.fi/t/proposal-unlocking-perp-tokens-to-sunset-v1-users/761",
                        "https://gov.perp.fi/t/attention-proposal-to-unlock-27-6m-perp-tokens-to-sunset-v1-users-repost/863",
                        "https://gov.perp.fi/t/perp-buyback-to-support-affected-v1-users-and-boost-user-confidence-to-prepare-for-the-bull-run-of-perp/853",
                        "https://gov.perp.fi/t/use-perp-to-provide-max-op2-op4-to-perp-v1-users/765",
                        "https://optimistic.etherscan.io/tx/0xa3ac5addeb40df00b210eacc119530758ab4a791d36994ab2c72811e190fa941",
                        "https://optimistic.etherscan.io/tx/0xa6125c37c7241b0c5d36f9849166d7e05ec7b5eae2f52697b57af44cd34cd208",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/d/d5f599c5a6fc8e2ee4bb25ec5177eb4d111fc8c3.png",
                        "https://twitter.com/crypto_noodles/status/1516062279371997188",
                        "https://gov.optimism.io/t/allocate-1m-op-tokens-to-independent-recovery-agents-or-bounty-hunters-to-apprehend-and-recover-from-perpetual-protocol-scammers/3045",
                        "https://gov.optimism.io/t/governance-fund-observations/3257",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-curve/3089/32"
                    ],
                    "GPT-summary": "The post discusses the grant given to Perpetual Protocol and the subsequent actions taken by the company. The author of the post provides constructive criticism of the grant approval process and the actions taken by Perpetual Protocol. The post also audits and reviews the actions taken by Perpetual Protocol and explains the situation.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Privacy, Security and risk management",
                        "Token economics",
                        "Community and engagement"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.592436974789916
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "2",
                    "likes": "6",
                    "time": "19/07/2022-13:02:39",
                    "content": "I think we jumping on conclusion here without giving Perp a chance to comment on this. 500K OP was giving out to builders and grant, I think, which is mentioned in proposal and giving the fund in stable is an obvious choice. For airdrop, its project internal decision on how they want to distribute it and what would be the eligibility criteria. But I agree with you, we need to be more diligence when  approving a proposal. There is some learning opportunity here for all of us. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/Veyny",
                    "index": "3",
                    "likes": "0",
                    "time": "19/07/2022-13:43:15",
                    "content": "Yes, A big fail to give so many op to the project ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/tongnk",
                    "index": "4",
                    "likes": "1",
                    "time": "19/07/2022-16:31:14",
                    "content": "    Ganc:   Perpetual Protocol v1 collapsed resulting in loss of customer funds to the tune of $44.6 million. Whilst it appears some progress has been made, there are still customers with outstanding unrecovered funds and ongoing disputes relating to these funds    This is incorrect. Unsure where the 44m number came from but given the construction of how the vAMM works this is definitely not the case. A lot of discussion has been had around this in discord so it’s interesting you’re only trying to pull a random headline number. Additionally, I’m unsure why this is put here other than trying to paint this entire airdrop in negative light.     Ganc:  I feel it is a bad precedent for distressed companies with outstanding obligations to be market selling Optimism grants and moving them out of the Optimism ecosystem.   As per the outline this was distributed to the grants DAO. What they do with the funding is up to them but all projects that are funded via this mechanism is for the benefit of OP. How they manage funds is up to them and at their discretion     Ganc:  Here are the wallets owned by the team / foundation. More than 70% of the airdrop ended up in these wallets out of which more than 70% were instantly dumped to stablecoins.   Unsure where you got these from but these are massive assumptions and wild accusations. The same can be said of the thread linked.     Ganc:  4. Immediately after the airdrop the TVL of PERP on Optimism dumped by nearly a quarter   Again this is false and unsure why you aren’t painting the whole picture - volatility has meant that liquidity across the board has decreased. What you doing here is simply finding some data to support a point you’ve made up. If you see defillama TVL it actually stabilised after the large amounts of volatility in May  Screen Shot 2022-07-19 at 6.24.47 pm2380×976 131 KB  Final point I’d like to make is if you have ever followed what we’ve done we’ve been very consistent in how we do things with regards to rewards - we constantly test, see what works and double down on what works. For items that don’t work we stop it so we don’t waste tokens. We have applied this methodology to PERP and will continue to do so for OP tokens. I’d be happy to have a solid discussion but it seems that this post is purely around creating FUD with no data to back anything up and drawing points out of thin air. ",
                    "links": [
                        "https://gov.optimism.io/t/allocate-1m-op-tokens-to-independent-recovery-agents-or-bounty-hunters-to-apprehend-and-recover-from-perpetual-protocol-scammers/3045/2"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.239002267573696
                },
                {
                    "author_link": "https://gov.optimism.io/u/Ganc",
                    "index": "5",
                    "likes": "6",
                    "time": "19/07/2022-18:53:54",
                    "content": " This is incorrect. Unsure where the 44m number came from but given the construction of how the vAMM works this is definitely not the case. A lot of discussion has been had around this in discord so it’s interesting you’re only trying to pull a random headline number.  I will not try to claim I know the exact figure of how much customer funds are still in dispute, but this figure is taken directly from your governance forums in this discussion.  Screenshot from 2022-07-19 19-42-32822×115 11.1 KB  Whatever the actual figure is, the fact still remains there is an ongoing dispute relating to customer funds which have been lost due to the collapse of Perpetual Protocol v1.  Additionally, I’m unsure why this is put here other than trying to paint this entire airdrop in negative light.  I put it here because applying for grant funding while having outstanding liabilities relating to customer’s funds is a giant red flag that has had zero discussion on it whatsoever as part of the Optimism governance process.  As per the outline this was distributed to the grants DAO. What they do with the funding is up to them but all projects that are funded via this mechanism is for the benefit of OP. How they manage funds is up to them and at their discretion  How will we ever know if these funds are used for the benefit of Optimism when they are bridged off chain back to mainnet with zero oversight? There is no way of knowing if those funds will ever return to Optimism at all. After seeing how much push back other proposals are getting on use of OP grants which are much smaller than this, how this slipped through governance to me is surreal.  Unsure where you got these from but these are massive assumptions and wild accusations. The same can be said of the thread linked.  These wallet addresses are taken directly from a Dune dashboard made by Yenwen as being Perpetual v2 Foundation addresses.   The dashboard can be found here.  Archived here: archive.ph    Screenshot from 2022-07-19 19-31-02801×244 33.4 KB   Yenwen’s Dune profile can be found here.  ",
                    "links": [
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/0/081e2f316f2cdd4e17104acd1833ea3ef7e271d2.png",
                        "https://dune.com/queries/616146",
                        "https://archive.ph/K6G1d",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/0/08ee23970f0368141d31bc853466a8ef356b7033.png",
                        "https://dune.com/yenwen"
                    ],
                    "GPT-discussion-categories": [
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.274038461538462
                },
                {
                    "author_link": "https://gov.optimism.io/u/raho",
                    "index": "6",
                    "likes": "4",
                    "time": "19/07/2022-20:54:52",
                    "content": "Hello, I have a quick question… From the original GF proposal it was stated:    [GF: Phase 0 Proposal] Perpetual Protocol   We aim to match all of the incentives on a 1:1 basis. As this is expected to be a large amount of the tokens that have been unlocked by governance, this aligns interests of both parties to grow Optimism   This implies that OP funding for grants that has been distributed already should have been matched 1:1 with PERP.     tongnk:  As per the outline this was distributed to the grants DAO. What they do with the funding is up to them but all projects that are funded via this mechanism is for the benefit of OP. How they manage funds is up to them and at their discretion   To me, it sounds like whatever OP is used, will be matched with PERP…Which excludes any previous funding the grants program may have received in PERP, as the 1:1 matching is not retroactive (otherwise, any protocol could claim that they have matched liquidity incentives, or other funding, in the past). Am I misunderstanding something here? ",
                    "links": [
                        "https://gov.optimism.io/t/gf-phase-0-proposal-perpetual-protocol/201/1"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 4.706845238095238
                },
                {
                    "author_link": "https://gov.optimism.io/u/Cimm",
                    "index": "7",
                    "likes": "0",
                    "time": "20/07/2022-03:06:21",
                    "content": "Perp team distributed the money of the top 25 big players in v1 to others, ,which is different from scam exchanges. And let alameda take millions of dollars when vamm can’t close the position.  Finally pass the result to DAO. Deliberately modify the k value of vamm, then liquidate him by himself, get a liquidation fee of 30,000 US dollars, and use this as an excuse to close the exchange ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.45
                },
                {
                    "author_link": "https://gov.optimism.io/u/arabianhorses",
                    "index": "8",
                    "likes": "1",
                    "time": "21/07/2022-07:48:50",
                    "content": "    OPUser:  There is some learning opportunity here   it was a pretty expensive one so we all need to use it with maximum efficiency ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.375
                },
                {
                    "author_link": "https://gov.optimism.io/u/0xJohn",
                    "index": "9",
                    "likes": "0",
                    "time": "21/07/2022-08:59:03",
                    "content": "Perp basically just distributed the funds among themselves and used “liquidity provider” excuse to funnel the funds back to themselves, knowing well that most of the liquidity providers were their own team wallets. This is nothing more than an elaborate scam. Disgusting. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/emerald",
                    "index": "10",
                    "likes": "3",
                    "time": "21/07/2022-13:11:16",
                    "content": "This is incredibly disappointing. Moving forward, I believe that in the short term OP allocated to projects should be placed into a linear vesting contract so that they are disbursed slowly over a predictable period of time. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 3.625
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "11",
                    "likes": "0",
                    "time": "21/07/2022-15:55:31",
                    "content": "I agree with @emerald. It also mitigates concerns about protocols self-delegating (although as not just a Velodrome team member but also a believer in broad stakeholder ownership I am in favor of this). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.3125
                },
                {
                    "author_link": "https://gov.optimism.io/u/Axel_T",
                    "index": "12",
                    "likes": "0",
                    "time": "21/07/2022-18:05:40",
                    "content": "I also agree with @emerald ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Jeremylau",
                    "index": "13",
                    "likes": "0",
                    "time": "22/07/2022-08:46:20",
                    "content": "I really feel disgusted by the project’s approach. On the surface, they say that they will airdrop OP to users, but in fact, most users only get 0.1 or 0.2 OP, which is insulting. And a large number of OPs were airdropped to very few addresses, and these addresses have obvious traces of internal wallets! This incident is actually the project party using users to achieve their own ulterior purpose of cashing out! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 4.729220779220779
                },
                {
                    "author_link": "https://gov.optimism.io/u/Jeremylau",
                    "index": "14",
                    "likes": "0",
                    "time": "22/07/2022-08:48:29",
                    "content": "When I found out about this problem, I went to the community and gave feedback on Twitter, but I didn’t get any attention. Could it be that the Optimistic team doesn’t care what kind of bad projects they support? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/Mark",
                    "index": "15",
                    "likes": "0",
                    "time": "24/07/2022-00:54:48",
                    "content": "As a user, a little guy, there are alot of us… I provide liquidity in different pools on Beets. I have used many different dapps. Optimistic ETH is my favorite, and I feel the community that uses OP should be able to get more to really attract attention and provide liquidity and delegate for governence. Thanks  Keep up the good work  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.45625
                },
                {
                    "author_link": "https://gov.optimism.io/u/gabagool",
                    "index": "16",
                    "likes": "3",
                    "time": "29/07/2022-12:50:08",
                    "content": "    Ganc:  Whatever the actual figure is, the fact still remains there is an ongoing dispute relating to customer funds which have been lost due to the collapse of Perpetual Protocol v1.   Everything else aside, this above seems like a point worthy of discussion. How does governance perform due diligence on projects? Whatever a project promises in a grant proposal, if a DAO has outstanding legal obligations, or an \"ongoing dispute relating to customer funds’, this could result in unexpected consequences. I find it pretty shocking reading back on the Phase 0 Proposal the lack of serious discussion around giving such an enormous amount of $OP to Perp. As one of the two most significant grants (that I am aware of, alongside Synthetix’s 9m OP) one would expect that this grant would have had a marked impact on increasing liquidity, TVL, and user transactions on Optimism. And that every delegate would have participated in the discussion. Why wasn’t there more debate? Was this simply because Perp is a longstanding part of OP ecosystem? Obviously, we cannot expect every grant to succeed in its goals, and its too early to say how Perp will use the funds remaining, and the impact it will have. But considering some of the debates I’ve witnessed over relatively small amounts of $OP, it definitely is important for us to examine exactly how this happened. If Perp feels like the current use of funds has had a positive impact on the growth of $OP, they should make that case, and we should work with them to ensure that their use of the remaining funds is +EV for the network. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.4170875420875415
                },
                {
                    "author_link": "https://gov.optimism.io/u/gabagool",
                    "index": "17",
                    "likes": "0",
                    "time": "29/07/2022-12:52:51",
                    "content": "btw I fully support the 500k to grants dao, think they should have set up a multisig for it on OP, but afaik they have plans to do so. Builder’s need stable funding. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party giving entirely positive feedback on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Ganc",
                    "index": "18",
                    "likes": "2",
                    "time": "01/08/2022-20:07:40",
                    "content": "Two weeks later the value of Perpetual Protocol’s OP grant is just under $14 million. The liquidity incentives have failed to attract liquidity, the TVL has actually decreased in this time:  perptvl804×778 106 KB  The airdrop is actually worth two thirds of the total value of Perp’s TVL. You may just as well have bought Perp as a going concern, I doubt you would have even paid anywhere near this figure. There are platforms that did not receive a single OP which have flipped Perp in TVL - PoolTogether for instance. So, despite incentives being offered of 5000 PERP and 5000 OP per week (the few users the platform has were actually sold 15,000 OP / PERP per week but this was cut down), why has there been no liquidity gained? Because the majority of the liquidity on this platform is owned by the team as pointed out by @crypto_noodles on twitter. These rewards are just washed into team wallets. The team wallets which had claimed the retroactive airdrop posted above have also not had much movement. Some bought OP back, some are still sitting in USDC and some just moved funds to random places. ",
                    "links": [
                        "https://gov.optimism.io/t/gf-phase-0-proposal-perpetual-protocol/201/33"
                    ],
                    "GPT-discussion-categories": [
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.561791383219955
                },
                {
                    "author_link": "https://gov.optimism.io/u/TheDoctor",
                    "index": "19",
                    "likes": "0",
                    "time": "24/10/2022-17:50:38",
                    "content": "I’m still reading around and If only there were more metric and analytics like this… Good job ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/acermacrophyll",
                    "index": "20",
                    "likes": "1",
                    "time": "24/10/2022-23:56:49",
                    "content": "Kudos, thanks for the in-depth breakdown of the sequence of events leading to the “collapse”. Always interesting and sometimes thrilling to see how such a slump can come to play. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 6.1875
                }
            ]
        }
    ],
    "group_index": "170"
}