{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/draft-gf-phase-1-proposal-cashmerelabs/3600",
            "title": "[DRAFT] [GF: Phase 1 Proposal] CashmereLabs ",
            "index": 3600,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Governance Fund: Phase 1"
            ],
            "tags": [
                "cycle-7"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/cashmerelabs",
                    "index": "1",
                    "likes": "2",
                    "time": "01/10/2022-08:26:11",
                    "content": "Project name: CashmereLabs Author name and contact info (please provide a reliable point of contact for the project): Oxfust https://twitter.com/0xfust https://t.me/Oxfust DC: 0xFust#6993 I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: [Yes/No] Yes L2 recipient address: 0x95a807bcAb5a16901628acF90FC3057061a3fce9 Which Voting Cycle are you applying for?: Phase 1 Grant category: (DeFi, NFT, Tooling, Other) DeFi Is this proposal applicable to a specific committee? (If so, please link to committee) Project description (please explain how your project works): Cashmere is an omnichain-based project that adds layers to these technologies and optimizes capital efficiency in addition to decreasing associated risks by letting users be able to swap any single-sided assets between any chain without bridging. While maintaining omnichain swap, which allows for asset exchanges between 7 different chains due to interoperability cross-chain messaging protocol. Cashmere is a unique application that has both a stableswap and an asset aggregator in one application at the same time. Stableswap uses Cashmere’s own liquidity directly and becomes a Layer2 solution. On the other hand, the aggregator uses all liquidity pools in any network and offers the lowest slippage to the user. How is that possible? Well, in Cashmere, assets to be traded on the source chain use the aggregator to find the best offer on the source chain, asset swaps to stablecoin, and stablecoin is locked on the source chain by Cashmere. With its own liquidity pools and interoperability messaging protocol, Cashmere allows users in the target chain to withdraw equal stablecoin from pools. The user performs the swap and gets its presence on the target chain. This way makes the swapped asset MEV Resistant because it is performed using only cross-chain messaging without sending a cross-chain swap transaction. Project links:  Website: https://cashmere.exchange  Twitter: https://twitter.com/CashmereLabs  Discord/Discourse/Community: https://discord.com/invite/dherf6VbRX  Please include all other relevant links below: https://y.at/   Additional team member info (please link): na Please link to any previous projects the team has meaningfully contributed to: na Relevant usage metrics (TVL, transactions, volume, unique addresses, etc. Optimism metrics preferred; please link to public sources such as Dune Analytics, etc.): Not launched yet. Competitors, peers, or similar projects (please link): https://docsend.com/view/ymg92kqtziufdbt2 Is/will this project be open sourced? Yes/No/In Future In Future Optimism native?: Yes/No No Date of deployment/expected deployment on Optimism: October 2022 Ecosystem Value Proposition:  What is the problem statement this proposal hopes to solve for the Optimism ecosystem?  Cashmere is a unique application that has both a stableswap and an asset aggregator in one application at the same time. Stableswap uses Cashmere’s own liquidity directly and becomes a Optimism solution. By providing high liquidity to Optimism, Cashmere will offer a trading solution with low slippage.  How does your proposal offer a value proposition solving the above problem? Cashmere is the unique app that combines DEX Aggregator and Stableswap and uses interoperability messaging, it will be a very good value for optimism. Why will this solution be a source of growth for the Optimism ecosystem? With the use of Cashmere’s interoperability messaging protocol, transitions from Ethereum to Optimism will become much easier, and the use of optimism network will increase. Users will adapt much more easily.  Has your project previously applied for an OP grant? If successful, please link to your previous grant proposal and provide a brief update on milestones achieved with the grant. If unsuccessful, and this is a resubmission, please specify how you have incorporated significant changes in accordance with feedback. No Number of OP tokens requested: 50,000 Did the project apply for or receive OP tokens through the Foundation Partner Fund?: Yes/No/In Process No. If OP tokens were requested from the Foundation Partner Fund, what was the amount?: No How much will your project match in co-incentives? (not required but recommended, when applicable): na Proposal for token distribution:   How will the OP tokens be distributed? (please include % allocated to different initiatives such as user rewards/marketing/liquidity mining. Please also include a justification as to why each of these initiatives align with the problem statement this proposal is solving.) 50% Development - By integrating our contracts working in other EVMs into optimism, we will ensure that contracts working on all networks do not communicate with optimism and are interoperable. 30% Liquidity Provider Rewards - We will give incentives to our users who bring liquidity to optimism, this liquidity will increase the trading volume and make more profit. 20% Marketing - We will organize campaigns to increase the number of our users.   Over what period of time will the tokens be distributed for each initiative? Shorter timelines are preferable to longer timelines. Shorter timelines (on the order of weeks) allow teams to quickly demonstrate achievement of milestones, better facilitating additional grants via subsequent proposals. Distribution starting on 2022 October to February 2023 (3 months).   Please list the milestones/KPIs you expect to achieve for each initiative, considering how each relates to incentivizing sustainable usage and liquidity on Optimism. Please keep in mind that progress towards these milestones/KPIs should be trackable. Here you can see what we have done already: https://cashmerelabs.notion.site/Cashmere-Labs-Update-1-04f3561e49b84d6a924a62068482f400   Why will incentivized users and liquidity on Optimism remain after incentives dry up? Even if the OP token rewards are dry up, the rewards from Cashmere token(CSM) and trading fees will continue, these OP rewards will only be incentivized to teach users the platform.   Please provide any additional information that will facilitate accountability:(smart contracts addresses relevant to the proposal, relevant organizational wallet addresses, etc.) Here are successful transactions  It will be our duty to integrate these contracts into optimism. Stableswap Mumbai:    Polygon (MATIC) Blockchain Explorer    Polygon Transaction Hash (Txhash) Details | PolygonScan Polygon (MATIC) detailed transaction info for txhash 0x7fc90cdaedd07dc7d602dfa3b224bbeb46cf6c12fa921d36dce27dd8316ca49a. The transaction status, block confirmation, gas fee, MATIC, and token transfer are shown.      FTMTestnet:    Fantom (FTM) Blockchain Explorer   Fantom Transaction Hash (Txhash) Details | FtmScan Fantom (FTM) detailed transaction info for txhash 0xea18809bba7b3a5e8bbe9d0a89e93f38f91993fc7f1038484c69fbf14dca6e8e. The transaction status, block confirmation, gas fee, FTM, and token transfer are shown.      L0 Scan:    Cross Chain Message | LayerZero   Cross Chain Message | LayerZero LayerZero Scan is an Omnichain Blockchain Explorer for LayerZero, an interoperability protocol      Aggregator Swap WMATIC to AAVE via Cashmere Stable Pools and 1inch Router 1-   Polygon (MATIC) Blockchain Explorer    Polygon Transaction Hash (Txhash) Details | PolygonScan Polygon (MATIC) detailed transaction info for txhash 0x231057b178637fe1f0042970a0759dc3c05f44b26e84acc9683013a54bc5e20d. The transaction status, block confirmation, gas fee, MATIC, and token transfer are shown.      2-   Polygon (MATIC) Blockchain Explorer    Polygon Transaction Hash (Txhash) Details | PolygonScan Polygon (MATIC) detailed transaction info for txhash 0x160adb2fb463bb0035ac256e14930aa04eeca5a7dfc28885c8abf3c92f88f134. The transaction status, block confirmation, gas fee, MATIC, and token transfer are shown.      ",
                    "links": [
                        "https://t.me/Oxfust",
                        "https://cashmere.exchange",
                        "https://twitter.com/CashmereLabs",
                        "https://discord.com/invite/dherf6VbRX",
                        "https://y.at/%F0%9F%90%90%F0%9F%8E%A9%E2%9B%93%EF%B8%8F",
                        "https://docsend.com/view/ymg92kqtziufdbt2",
                        "https://www.notion.so/Cashmere-Labs-Update-1-04f3561e49b84d6a924a62068482f400",
                        "https://mumbai.polygonscan.com/tx/0x7fc90cdaedd07dc7d602dfa3b224bbeb46cf6c12fa921d36dce27dd8316ca49a",
                        "https://mumbai.polygonscan.com/tx/0x7fc90cdaedd07dc7d602dfa3b224bbeb46cf6c12fa921d36dce27dd8316ca49a",
                        "https://testnet.ftmscan.com/tx/0xea18809bba7b3a5e8bbe9d0a89e93f38f91993fc7f1038484c69fbf14dca6e8e",
                        "https://testnet.ftmscan.com/tx/0xea18809bba7b3a5e8bbe9d0a89e93f38f91993fc7f1038484c69fbf14dca6e8e",
                        "https://testnet.layerzero-scan.com/10009/address/0x896ea96f798cb46ecdb348724dfaad6d3728b239/message/10012/address/0x9c8505ee7dbc487c726712008b7891b1bddf8644/nonce/2",
                        "https://testnet.layerzero-scan.com/10009/address/0x896ea96f798cb46ecdb348724dfaad6d3728b239/message/10012/address/0x9c8505ee7dbc487c726712008b7891b1bddf8644/nonce/2",
                        "https://polygonscan.com/tx/0x231057b178637fe1f0042970a0759dc3c05f44b26e84acc9683013a54bc5e20d",
                        "https://polygonscan.com/tx/0x231057b178637fe1f0042970a0759dc3c05f44b26e84acc9683013a54bc5e20d",
                        "https://polygonscan.com/tx/0x160adb2fb463bb0035ac256e14930aa04eeca5a7dfc28885c8abf3c92f88f134",
                        "https://polygonscan.com/tx/0x160adb2fb463bb0035ac256e14930aa04eeca5a7dfc28885c8abf3c92f88f134"
                    ],
                    "GPT-summary": "The post is a draft proposal for a project called CashmereLabs, which is an omnichain-based project that aims to optimize capital efficiency and decrease associated risks by allowing users to swap any single-sided assets between any chain without bridging. The proposal explains how the project works, its value proposition, and how the OP tokens will be distributed. The post also includes links to the project's website, social media accounts, and relevant usage metrics. A 3rd party gives entirely positive feedback on the proposal and extends to it by asking for more information about the project's milestones and KPIs.",
                    "GPT-proposal-categories": [
                        "Interoperability and Scalability",
                        "Token economics",
                        "Grants, Funding and resource allocation",
                        "DeFi",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.790096618357488
                },
                {
                    "author_link": "https://gov.optimism.io/u/cashmerelabs",
                    "index": "2",
                    "likes": "0",
                    "time": "02/10/2022-15:37:11",
                    "content": "Is there any updates?   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Defi_LATAM_axlvaz",
                    "index": "3",
                    "likes": "0",
                    "time": "03/10/2022-05:48:58",
                    "content": "What is the estimated launch date? Are the contracts audited? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/cashmerelabs",
                    "index": "4",
                    "likes": "0",
                    "time": "03/10/2022-06:15:02",
                    "content": "Estimate launch date for platform is end of 2022 for token is 2023 Q3 Since audit progress is a bit expensive, not audited yet. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 2.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/cashmerelabs",
                    "index": "5",
                    "likes": "0",
                    "time": "15/10/2022-12:28:37",
                    "content": "Closed alpha is ready ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25
                }
            ]
        }
    ],
    "group_index": "284"
}