{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/tooling-utilities-nominations-for-rpgf2/4639",
            "title": "Tooling & Utilities nominations for RPGF2 ",
            "index": 4639,
            "category": [
                "\\xf0\\x9f\\x94\\xb4 RetroPGF"
            ],
            "tags": [
                "nominations",
                "rpgf2"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/system",
                    "index": "1",
                    "likes": "73",
                    "time": "17/01/2023-20:45:20",
                    "content": " Tooling & Utilities nominations for RetroPGF2 This is the thread to nominate projects for the Tooling and Utilities category of RetroPGF round 2. Please familiarize yourself with the Nominations process for RetroPGF round 2.   Overview of Timelines  Project nominations: Jan 17 19:00 GMT - Jan 31 19:00 GMT Final project opt-in deadline: Feb 21 Voting: Mar 7 - Mar 21   image1920×960 32.1 KB    Scope of this round RetroPGF round 2 is dedicated to projects that support development and usage of the OP Stack. For the category of Tooling + Utilities you may nominate  Work that helps builders create applications on Optimism mainnet Work that helps builders build on the OP Stack Work that helps builders interact with governance of the Collective Work that helps builders use applications built on Optimism  Note: The OP Stack refers to the OSS code powering Optimism. Today, this means the Optimism monorepo and its dependencies. Eligible projects need not be exclusive to the Optimism ecosystem, but there should be a connection. For example,   go-ethereum is an important dependency of the OP Stack, but is not Optimism-specific.  Ethereum L2 explorer pages which give stats on various L2s provide educational impact for the OP Stack, but are not Optimism-specific    How to Nominate a Project Things to consider when nominating a project:  Try to describe as best as you can how this project has delivered impact relating to the scope of this round. Make sure to nominate projects in the relevant category Before nominating a project please see if this project has been nominated already, so we can avoid duplication.  For Projects:  If you are a project looking to participate in this round please have a read of the Project Manual, it has an overview of the process and an FAQ section to answer questions that might come up. For your project to be eligible you will need to opt into the round and complete a project profile in the RetroPGF application manager by Feb 21 - 19:00 GMT. This will include providing more information about your project and verifying your Github or Twitter account. The application manager will be launched by end of Jan, more details to follow on this soon! Any project without a correctly verified GitHub or Twitter account, any project impersonating another team, any project not relating to the scope of the round, or any project without a complete profile may be hidden from the voting round at the Foundation’s discretion. Projects are allowed to nominate themselves. Here the term “project” can describe work that has been done by both an individual or a group. Collections, a term used to describe projects without a single person or entity that can be verified via GitHub or Twitter, may only be nominated by the Optimism Foundation.   Please use this template to Nominate a project:   The projects name:  A description of how the project has supported development and usage of the OP Stack:  A link to the project’s GitHub or Twitter:  (optional) contact info for the project or project lead:  Project Nominations will close by Jan 31 at 19:00 GMT ",
                    "links": [
                        "https://gov.optimism.io/t/nominations-for-retropgf2/4636",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/9/92641e36df38e211a100c529eb4a756c9d3001d6.png",
                        "https://oplabs.notion.site/Optimism-RetroPGF-2-Project-Manual-0a2e741133cd49b0b005ff759934b998",
                        "https://app.optimism.io/retropgf-manager",
                        "https://gov.optimism.io/t/where-can-i-nominate-for-round-2/4699/2",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/29",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/28",
                        "https://gov.optimism.io/t/community-feedback-on-retropgf2/4641/15"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.217380952380952
                },
                {
                    "author_link": "https://gov.optimism.io/u/DanieleSalatti",
                    "index": "2",
                    "likes": "33",
                    "time": "17/01/2023-22:23:50",
                    "content": "I think this belongs to this category?   The projects name: delegation.tools   A description of how the project has supported development and usage of the OP Stack: When the OP token was launched there was some confusion on how users could change delegate after completing all the steps in the airdrop process. I created delegation.tools as a tool to let people see who they are delegating to and change delegate in a couple of clicks. Today it is still used. I started collecting anonymous statistics in October, they are public and you can see them here. Recently I started tracking how many times it was used to actually change delegate. In the last 30 days it has received ~4500 visitors which resulted in ~2000 changes of delegate.   A link to the project’s GitHub or Twitter: https://github.com/DanieleSalatti/op-delegation   Contact info for the project or project lead: Myself - you can message me here or on Twitter @DanieleSalatti   ",
                    "links": [
                        "https://delegation.tools/",
                        "https://plausible.io/delegation.tools",
                        "https://plausible.io/delegation.tools?period=30d&goal=delegate",
                        "https://github.com/DanieleSalatti/op-delegation",
                        "https://twitter.com/DanieleSalatti"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/soyboy",
                    "index": "3",
                    "likes": "39",
                    "time": "17/01/2023-23:05:53",
                    "content": "  The projects name: Attestation Station Interface   A description of how the project has supported development and usage of the OP Stack:  This project provides a no-code solution for builders and community members to directly interact with the AttestationStation smart contract. The Optimism team will (or already has used) it to help with the distribution of Citizen House voting badges. Allows anyone to create and read attestations.    A link to the project’s GitHub or Twitter: Github   Contact info for the project or project lead:  Myself - you can reach me on twitter or email: sbvegan@protonmail.com     ",
                    "links": [
                        "https://community.optimism.io/docs/governance/attestation-station/#general-faq",
                        "https://github.com/sbvegan/attestation-station-interface",
                        "https://twitter.com/soyboy_vegan"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.785714285714285
                },
                {
                    "author_link": "https://gov.optimism.io/u/clabby",
                    "index": "5",
                    "likes": "108",
                    "time": "18/01/2023-06:05:44",
                    "content": " The project’s name: Solady  A description of how the project has supported development and usage of the OP Stack: Solady is an incredible Solidity library aiming to provide gas optimized and secure Solidity utilities. It is widely used across Solidity projects, many of which are deployed on Optimism, and it has served as an educational resource for many upcoming smart contract developers. As of right now, it is being maintained primarily by Vectorized as well as several open-source contributors. A link to the project’s GitHub or Twitter: GitHub - Vectorized/solady: Optimized Solidity snippets.  (optional) contact info for the project or project lead: https://twitter.com/optimizoor   ",
                    "links": [
                        "https://twitter.com/optimizoor"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.675
                },
                {
                    "author_link": "https://gov.optimism.io/u/freemartian",
                    "index": "6",
                    "likes": "11",
                    "time": "18/01/2023-07:42:02",
                    "content": " The projects name: Pika Protocol  A description of how the project has supported development and usage of the OP Stack: Pika has one of the most fortunate potentials in Perpetual Trades. They have experienced and caring devs hyperfocused on presenting an ever progressing product. They are gaining more and more users everyday and considering the importance of perps in near future of crypto markets, they sure can be host to many new Optimism Traders. I believe they need grants to develop some essential parts of the dApp to be fully prepared for the mass adoption of Optimism. A link to the project’s GitHub or Twitter: Twitter   ",
                    "links": [
                        "https://twitter.com/PikaProtocol"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.556818181818182
                },
                {
                    "author_link": "https://gov.optimism.io/u/MSilb7",
                    "index": "9",
                    "likes": "43",
                    "time": "18/01/2023-16:35:05",
                    "content": "I work at OP Labs, but making this nomination in my personal capacity.   The projects name: DefiLlama   A description of how the project has supported development and usage of the OP Stack:   DefiLlama is a crypto data aggregator with dashboards and APIs covering DeFi TVL, DEX Volume, CEX Liquidity, token prices, DeFi yields, and more. DefiLlama also has high-quality data curation, which makes it a reliable source for the community, analysts, and developers (i.e. avoiding double counted TVL, splitting out native vs incentivized yield). As an example, the TVL APIs are my main data source for DeFi flows & OP incentive performance tracking (link). The dashboards and APIs are offered as a free public good, and have become a core resource for the crypto community.   A link to the project’s GitHub or Twitter:  Website: https://defillama.com/ | API: API Docs - DefiLlama  Github: DefiLlama · GitHub  Twitter: https://twitter.com/DefiLlama     (optional) contact info for the project or project lead:  0xngmi: https://twitter.com/0xngmi     ",
                    "links": [
                        "https://defillama.com/",
                        "https://defillama.com/docs/api",
                        "https://github.com/DefiLlama",
                        "https://twitter.com/DefiLlama",
                        "https://twitter.com/0xngmi",
                        "https://gov.optimism.io/t/education-nominations-for-rpgf2/4640/43"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.261904761904762
                },
                {
                    "author_link": "https://gov.optimism.io/u/MattL",
                    "index": "10",
                    "likes": "12",
                    "time": "18/01/2023-18:25:45",
                    "content": "  The projects name: Synpress   A description of how the project has supported development and usage of the OP Stack: Synpress is an e2e testing framework based on Cypress.io and playwright.dev with support for metamask. It’s currently used by Optimism, Synthetix, Kwenta, EY Blockchain, Agora, and about 130 additional repos on Github   Supporting a project like this is super beneficial to Optimism, as it ensures that developers’ apps on Optimism are properly tested and that time is used wisely (as manual testing is beyond painful) Jakub and Synpress have worked 1:1 with devs across Optimism to support them in using Synpress, and he would like to continue developing the project, expand the scope and features of the tool, and be able to better support developers on Optimism with testing automation.   A link to the project’s GitHub or Twitter: https://twitter.com/Synpress_   (optional) contact info for the project or project lead: https://twitter.com/DRPTBL (Jakub from Synthetix)  Gitcoin Link -   Synpress - web3-enabled e2e testing tool | Grants | Gitcoin ",
                    "links": [
                        "http://Cypress.io",
                        "https://github.com/Synthetixio/synpress/network/dependents",
                        "https://gitcoin.co/grants/5699/synpress-web3-enabled-e2e-testing-tool",
                        "https://twitter.com/Synpress_",
                        "https://twitter.com/DRPTBL",
                        "https://gitcoin.co/grants/5699/synpress-web3-enabled-e2e-testing-tool"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.989583333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/drahlraigon",
                    "index": "11",
                    "likes": "8",
                    "time": "18/01/2023-21:41:43",
                    "content": "  Name: Attestation Station Interface   A description of how the project has supported development and usage of the OP Stack:   This project provides a no-code solution for builders and community members to directly interact with the smart contract.   The Optimism team will/has used to distribute the Citizen House voting badges.   Allows anyone to create and read attestations.   A link to the project’s GitHub : Github    ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.785714285714285
                },
                {
                    "author_link": "https://gov.optimism.io/u/0xmikki",
                    "index": "12",
                    "likes": "8",
                    "time": "19/01/2023-06:14:17",
                    "content": "The projects name: GiveStation A description of how the project has supported development and usage of the OP Stack: What is GiveStation ? A multi-chain Give-To-Earn grant protocol where contributors get rewarded for funding public goods, ideas and projects in web3. http://app.givestation.org There are creators who create new grants under Optimism blockchain, 98% of the OP tokens allocated will be distributed to those who choose to contribute to these projects and the remaining 2% will be used to incentivize weekly activities like competitions and tasks where the users who partake in it will get OP as rewards. We leveraged on L2 technology and as at the time of this writing, we are currently live on testnet and have deployed the Dapp on 5 blockchain protocols including Optimism, Arbitrum, Polygon,  Binance and Gnosis and we do have more to come as we move further in the development process. On testnet so far, we have recorded the following. · Total number of grants created: 1,500+ · Number of active contributions on all 5 blockchain networks: 10,100 · Total GivePOINTS Earned — 1, 065 . Total OP earned - 0 Optimism Testnet guide is here: https://medium.com/@givestation/givestation-testnet-guide-optimism-8d3aa4997a6d Back in October 2022, we partnered with Quix NFT marketplace to give OP rewards to those who purchased our official NFT called Givnaut. Read more here: Get 5000 OP tokens as rewards. 🔴5,000 OP Partner rewards have been enabled for the Givnaut NFT collection! 👨‍🚀 https://qx.app/collection/0x0244F5c52bdA3fD44fC5c2a6bF6c30A2aC1Bd019 💰Boost amount … - GiveStation - Medium A link to the project’s GitHub: GitHub - MrBloomguy/givestaion-team-dapp: Created 202207072327 Twitter: https://twitter.com/GiveStation Contact info for the project or project lead: Co-founder (myself) - you can reach me on Twitter @0xmikki or email: oxplaymedia@gmail.com ",
                    "links": [
                        "https://medium.com/@givestation/givestation-testnet-guide-optimism-8d3aa4997a6d",
                        "https://medium.com/@givestation/get-5000-op-tokens-as-rewards-a356b011d461",
                        "https://github.com/MrBloomguy/givestaion-team-dapp",
                        "https://twitter.com/GiveStation"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5247668997669
                },
                {
                    "author_link": "https://gov.optimism.io/u/TanBinh",
                    "index": "13",
                    "likes": "24",
                    "time": "19/01/2023-09:38:01",
                    "content": "  The project name: Dune Analytics   A description of how the project has supported development and usage of the OP Stack:   Dune is a powerful tool for blockchain research, complete with all the tools you need to discover, explore, and visualize vast amounts of blockchain data.   Dune allows builders to create their own dashboard with different key metrics by using crypto data collected from different applications and also allows users to easily explore the activity and data of different applications in the Optimism ecosystem.     A link to the project’s GitHub or Twitter:   GitHub: Dune · GitHub   Twitter: https://twitter.com/DuneAnalytics     ",
                    "links": [
                        "https://github.com/duneanalytics",
                        "https://twitter.com/DuneAnalytics",
                        "https://gov.optimism.io/t/education-nominations-for-rpgf2/4640/97"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.796296296296296
                },
                {
                    "author_link": "https://gov.optimism.io/u/marc",
                    "index": "14",
                    "likes": "9",
                    "time": "19/01/2023-12:40:03",
                    "content": "  The projects name: Infinitism (ERC-4337)   A description of how the project has supported development and usage of the OP Stack:   The Infinitism Team developed ERC-4337, the Account Abstraction proposal that avoids consensus-layer protocol changes. Work includes: i. The Entrypoint Contract: a singleton contract to execute bundles of UserOperations (the description of a user’s transaction) ii. A reference Bundler implementation & specification test suites: node or (block builder) that bundles multiple UserOperations and create a transaction. iii: Proof of concept implementations: A base wallet, Safe and BLS Wallet Their work is not exclusive to Optimism Network, but is already used by teams building on Optimism like us at CANDIDE Wallet and others like Biconomy.   A link to the project’s GitHub or Twitter: Infinitism · GitHub @Infinisitm8 . Twitter   (optional) contact info for the project: @yoavw @yoavw . Twitter   ",
                    "links": [
                        "https://www.candidewallet.com",
                        "https://github.com/eth-infinitism",
                        "https://twitter.com/infinitism8",
                        "https://twitter.com/yoavw"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/zainbacchus",
                    "index": "15",
                    "likes": "18",
                    "time": "19/01/2023-17:20:50",
                    "content": "I work at OP Labs, but making this nomination in my personal capacity. The projects name: Flipside A description of how the project has supported development and usage of the OP Stack: The Flipside Crypto team has worked alongside the OP Labs team to make Optimism data more accessible and help bootstrap Optimism’s ecosystem-wide attestation/identity efforts. The data tables, SDK, API, and other core services are offered as free public goods - enabling the creation of a wide range of products and tools for Optimism. Specifically, the Flipside team’s efforts and investments to the OP Stack include:   Data & Analytics Suite  Core Optimism data tables (blocks, transactions, event logs, and traces)  All entirely backfilled - data tables updated every two hours Ingesting OP data every 15-20 minutes   curated models for all aspects of Velodrome activity, NFT sales on popular exchanges (Quix/Seaport), and SushiSwap dimensional models for helpful dimensions such as contract labels, fact tables for important activities such as token transfers, token delegations, and hourly token prices data was used to calculate retroactive delegate rewards & voting participation:  OP Collective Gov Proposal Participation - OP Labs   adding an ez_dex_swaps table to cover the top dexes on Optimism 1892 analysts have run 850,000+ queries on Optimism data  137,000 queries in the last month alone (December 2022)      Software  API, SDK (software development kit), and data shares for unparalleled access & use in data science / visualization tools - including The Optimist Score ShroomDK - ShroomDK by FlipsideCrypto, API key NFT mint pulling the most comprehensive data set in all of crypto Snowflake Datashare, allowing data scientists to use and query Optimism data directly from the Snowflake UI for free -    Governance and Attestation Apps   https://op-governance.vercel.app/ - OP Governance Dash, displaying key governance metrics delegations, unique voters, active delegates, and specific requests per OP Labs team  new features such as 'Dark Mode’ links directly to the OP forum + delegation UI      https://science.flipsidecrypto.xyz/optimist/ The Optimist Score, built by the Flipside data science team, aiding with Optimism’s epic goal of providing on-chain attestation  code is entirely open-sourced, linked here  9000+ attestors and users of the app results and data queryable via SDK in JavaScript, Python, and R   Optimist Score Queries & Data - Flipside Crypto - example in R      A link to the project’s GitHub or Twitter:  GitHub: Flipside Crypto · GitHub  Twitter: https://twitter.com/flipsidecrypto   Contact info for the project or project lead: Fig Gowen:  fig@flipsidecrypto.com  @fig on the forum  ",
                    "links": [
                        "https://sdk.flipsidecrypto.xyz/shroomdk",
                        "https://op-governance.vercel.app/",
                        "https://science.flipsidecrypto.xyz/optimist/",
                        "https://github.com/FlipsideCrypto/user_metrics/tree/main/apps/optimism/optimistic_score_prototype",
                        "https://app.flipsidecrypto.com/dashboard/optimist-score-queries-data-Jp7kIN",
                        "https://github.com/FlipsideCrypto",
                        "https://twitter.com/flipsidecrypto"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.710362554112553
                },
                {
                    "author_link": "https://gov.optimism.io/u/m0ham3dx",
                    "index": "16",
                    "likes": "12",
                    "time": "19/01/2023-18:42:49",
                    "content": " The projects name: Foundry  Ethereum Development Toolkit which has been built from the ground up in the Rust Language making it extremely fast, as compared with the more popular tooling  Suite of 4 tools (no hard limit)    Forge - Testing Framework   Cast - Swiss Army knife for interacting with EVM chains   Anvil - Local Ethereum Node   Chisel -  Solidity Repl   A description of how the project has supported development and usage of the OP Stack:   - Indirect support for development of optimism stack   Major Advantages over existing tools   Robust Testing - Powerful testing set of functions  Beginner Friendly - All tests are written directly in solidity preventing the need to have mastery of some other language to do serious development  Open Source - Very active development, new features and bug fixes happen all the time  Active Community - Participative and willing to answer most basic queries  Description of my usage    Primarily for testing & bug hunting   Learning about ethereum development in general  A link to the project’s GitHub or Twitter:   GitHub    GitHub - foundry-rs/foundry: Foundry is a blazing fast, portable and modular... Foundry is a blazing fast, portable and modular toolkit for Ethereum application development written in Rust. - GitHub - foundry-rs/foundry: Foundry is a blazing fast, portable and modular toolkit ...      (optional) contact info for the project or project lead: https://twitter.com/gakonst ",
                    "links": [
                        "https://github.com/foundry-rs/foundry",
                        "https://twitter.com/gakonst"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.751021080368907
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "17",
                    "likes": "6",
                    "time": "20/01/2023-16:50:40",
                    "content": "  The projects name: Vyper language Vyper — Vyper documentation   A description of how the project has supported development and usage of the OP Stack: Vyper is a contract-oriented, pythonic programming language that targets the Ethereum Virtual Machine (EVM).   A link to the project’s GitHub or Twitter: https://twitter.com/vyperlang   (optional) contact info for the project or project lead: @big_tech_sux   ",
                    "links": [
                        "https://ethereum.org/learn/#ethereum-basics",
                        "https://twitter.com/vyperlang",
                        "https://twitter.com/big_tech_sux"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/JackPurdy_Messari",
                    "index": "19",
                    "likes": "6",
                    "time": "20/01/2023-21:14:09",
                    "content": "  The projects name: Messari  A description of how the project has supported development and usage of the OP Stack:  Messari has built comprehensive open-source subgraphs at the network level (note: WIP) as well as for individual projects on Optimism (Aave, Curve, Velodrome, QiDAO, etc.). We’ve used these to build live data dashboards tracking fundamental metrics (TVL, revenue, trading volume, loans originated, etc.) at the aggregate protocol level as well as for individual pools. We’ve also created freely available governance reports to help get better analytics to the the DAO in order to make more informed governance decisions.   A link to the project’s GitHub or Twitter: Messari · GitHub Twitter   (optional) contact info for the project or project lead: Telegram: @jackpurdy Email: jack@messari.io   ",
                    "links": [
                        "https://subgraphs.messari.io/",
                        "https://subgraphs.messari.io/",
                        "https://messari.io/report/state-of-optimism-governance",
                        "https://github.com/messari/",
                        "https://twitter.com/MessariCrypto"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.28030303030303
                },
                {
                    "author_link": "https://gov.optimism.io/u/rkalis",
                    "index": "20",
                    "likes": "16",
                    "time": "20/01/2023-21:35:27",
                    "content": "I am nominating my own project, Revoke.cash.   The project’s name: Revoke.cash  A description of how the project has supported development and usage of the OP Stack:  Revoke.cash is a suite of web3 security tools. It offers a dashboard to manage token and NFT allowances on Optimism and 30+ other chains. It also provides a browser extension that warns users when they are about to perform potentially harmful actions, such as approvals or NFT listings. By providing these services, users of Optimism and other supported chains enjoy more security while transacting on-chain and interacting with other applications on Optimism.   A link to the project’s GitHub or Twitter:  Website: https://revoke.cash  Github: Revoke.cash · GitHub  Twitter: https://twitter.com/RevokeCash     (optional) contact info for the project or project lead:  Rosco Kalis: https://twitter.com/RoscoKalis     ",
                    "links": [
                        "https://github.com/RevokeCash",
                        "https://twitter.com/RevokeCash",
                        "https://twitter.com/RoscoKalis"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.680555555555555
                },
                {
                    "author_link": "https://gov.optimism.io/u/ceresstation",
                    "index": "21",
                    "likes": "11",
                    "time": "20/01/2023-23:50:02",
                    "content": "  The project name: ethers.js   A description of how the project has supported development and usage of the OP Stack:  ethersjs aims to be a complete and compact library for interacting with Ethereum, and is arguably one of the most widely used libraries in the space with nearly a million weekly downloads without this tooling, it would be significantly harder for developers to build the applications that will ultimately run on the OP Stack  ricmoo has been actively and diligently maintaining this infrastructure for years in good faith without any expectation of return    A link to the project’s GitHub or Twitter:  GitHub: Ethersjs · GitHub  Twitter: https://twitter.com/ricmoo     ",
                    "links": [
                        "https://twitter.com/ricmoo",
                        "https://github.com/ethers-io/ethers.js",
                        "https://twitter.com/ricmoo"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.666666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/Ghoost",
                    "index": "22",
                    "likes": "8",
                    "time": "21/01/2023-10:30:08",
                    "content": "  The projects name: Remix IDE   A description of how the project has supported development and usage of the OP Stack: The Remix IDE is a rich toolset which can be used for the entire journey of contract development on EVM compatible chains. Without this project, it would be significantly harder for developers to build applications on the OP Stack. I used it to deploy my first smartcontract on Optimism.   A link to the project’s GitHub or Twitter: GitHub - ethereum/remix-ide: Documentation for Remix IDE https://twitter.com/EthereumRemix   ",
                    "links": [
                        "https://twitter.com/EthereumRemix"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.65625
                },
                {
                    "author_link": "https://gov.optimism.io/u/Jack123",
                    "index": "23",
                    "likes": "6",
                    "time": "22/01/2023-02:45:21",
                    "content": "  The projects name : Gitcoin   A description of how the project has supported development and usage of the OP Stack: Gitcoin is a platform where you get paid to work on open source software in Python, Rust, Ruby, JavaScript, Solidity, HTML, CSS, Design, and more. Gitcoin is going to help Optimism in allocating the fund in the retroPGF2 to different projects through voting on their platform   A link to the project’s GitHub or Twitter: Github: Gitcoin DAO · GitHub Twitter: https://twitter.com/gitcoin   ",
                    "links": [
                        "https://twitter.com/gitcoin"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/cafeconcriptos",
                    "index": "26",
                    "likes": "2",
                    "time": "22/01/2023-23:40:04",
                    "content": " The projects name: Pika Protocol   A description of how the project has supported development and usage of the OP Stack: Pika has promote Perpetual Trades on OP Ecosystem. The team is 100% focused on product & community. They are increasing users and TLV day by day. A link to the project’s GitHub or Twitter: Twitter   ",
                    "links": [
                        "https://twitter.com/PikaProtocol"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/gab",
                    "index": "28",
                    "likes": "3",
                    "time": "23/01/2023-11:43:28",
                    "content": "  The projects name: Rigoblock   A description of how the project has supported development and usage of the OP Stack: Rigoblock is a fully open source and free to use set of solidity smart contracts that facilitates the interaction with DeFi applications, live on Optimism since November 2022. Rigoblock liquidity has generated more than 50MM USD token swap volume on Ethereum mainnet. Our pools have been providing liquidity on Uniswap v3 on Optimism, including OP token pairs. Rigoblock’s GRG token has been airdropped to 9k wallets on Optimism. Work that helps builders create applications on Optimism mainnet:  enabling any holder to use a cold key for moving tokens from/to a Rigoblock smart wallet and a “hot” key (that can be stored on i.e. a mobile wallet) for moving the tokens within said smart wallet, i.e. swaps, providing liquidity; enabling the organisation of groups of token holders under “umbrella” smart pools operated by a pool operator. deterministic proxy factory which seamlessly generates lightweight proxies with same-address on each chain (where it gets deployed). original approach to smart contract storage which prevents accidental storage collision between proxy and implementation, improving smart contract security, usable by any developer in their own protocol/application under the Apache2.0 License.  Work that helps builders use applications built on Optimism:  minimizing the DeFi smart contract risk. Each time a wallet is required to set an allowance to an external application, the protocol approves the amount, executes the transaction and removes the allowance without clearing storage, avoiding unnecessary gas costs (i.e. approval abstraction); precompiling and batching multiple transactions. An Optimism user can send one transaction to its Rigoblock pool and execute multiple transactions on one (or many) external application simultaneously. This is also relevant for governance operations that require multiple transactions by a user, improving UX, which is particularly important for governance participation; a simple interface to interact with DeFi applications through Rigoblock.    A link to the project’s GitHub or Twitter: RigoBlock · GitHub   (optional) contact info for the project or project lead: admin@rigoblock.com   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.74310064935065
                },
                {
                    "author_link": "https://gov.optimism.io/u/davisshaver",
                    "index": "29",
                    "likes": "5",
                    "time": "23/01/2023-13:59:32",
                    "content": "  The project’s name: RainbowKit Login (WordPress Plugin)  A description of how the project has supported development and usage of the OP Stack: WordPress powers a huge chunk of the web. Unlocking integrations between WordPress and web3 represents a major opportunity for usage. RainbowKit Login supports Sign-In With Ethereum and token-gating/role mapping with the Optimism network. By providing the rails for integrating Optimism and WordPress, RainbowKit Login helps builders build and use applications on the OP Stack.  A link to the project’s GitHub or Twitter: GitHub - davisshaver/wp-rainbow: WordPress Plugin to Enable Sign-In With Ethereum using RainbowKit   (optional) contact info for the project or project lead: Davis Shaver, davisshaver@gmail.com    Screenshot 2023-01-23 at 8.58.39 AM736×220 24.5 KB  ",
                    "links": [
                        "https://github.com/davisshaver/wp-rainbow",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/d/d601b916fee974a36bf34f4730be7d0e6119845a.png"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.15625
                },
                {
                    "author_link": "https://gov.optimism.io/u/danielo",
                    "index": "30",
                    "likes": "3",
                    "time": "23/01/2023-20:19:56",
                    "content": "Nominating our project:   The projects name: TogetherCrew (community health research project by RnDAO)   A description of how the project has supported development and usage of the OP Stack: TogetherCrew has developed, for over ten months of work, a research-backed framework to meaningfully assess community health, identify opportunities for improvement, and evaluate the success of community initiatives. The framework can now be easily applied to assess and benchmark a community (e.g. Optimism) thanks to an open-source data collection tool for discord (other data sources are in the works).   See first research paper here: What is a DAO Community and when is it healthy: a working paper … — RnDAO   A link to the project’s GitHub or Twitter: https://twitter.com/rndao__   (optional) contact info for the project or project lead: https://twitter.com/_daniel_ospina   ",
                    "links": [
                        "https://twitter.com/rndao__",
                        "https://twitter.com/_daniel_ospina"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.1990740740740735
                },
                {
                    "author_link": "https://gov.optimism.io/u/JoaoCampos",
                    "index": "31",
                    "likes": "1",
                    "time": "23/01/2023-22:53:55",
                    "content": "  The projects name: DexKit   A description of how the project has supported development and usage of the OP Stack:   We develop open source tools aimed at crypto entrepreneurs and the general public. Users of our platform are able to create Smart Contracts and web development solutions without a single line of code. Our focus is ease of use without sacrificing security or speed, including the specific documentation we have for each of our products. Users of Optimism can create an NFT marketplace with a token swap interface or NFT collection in seconds without any cost, even without paying network fees. Our solution has been live already for a couple of months here whitelabel-nft.dexkit.com/ and the Open Source code of this product can be found here DexKit Open Marketplace. It’s running successfully on 0x v4 smart contracts.   A link to the project’s GitHub or Twitter: DexKit · GitHub   (optional) contact info for the project or project lead: info@dexkit.com   ",
                    "links": [
                        "https://github.com/DexKit/open-nft-marketplace",
                        "http://github.com/dexkit"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.474321133412042
                },
                {
                    "author_link": "https://gov.optimism.io/u/rrigo",
                    "index": "32",
                    "likes": "7",
                    "time": "24/01/2023-13:48:17",
                    "content": "The projects name: Velodrome Finance A description of how the project has supported development and usage of the OP Stack: Velodrome is the great product that helped onboard a lot of dApps to the Optimism ecossystem, one of them that I use much is Sonne Finance. Velodrome is one of the protocols that make me choose to use only Optimism network. A link to the project’s GitHub or Twitter: twitter.com/VelodromeFi Contact info for the project or project lead: Twitter: twitter.com/wagmiAlexander Discord: alexcutler.eth#0399 The projects name: Sonne Finance A description of how the project has supported development and usage of the OP Stack: They helped onboard a lot of users for their simplicity to lend and borrow assets. The UI/UX is great and they try to build trust on the ecossystem, so this is alling with Optimism’s view. The community is great and the team is always available on discord for feedbacks and to help users. A link to the project’s GitHub or Twitter: twitter.com/sonnefinance Contact info for the project or project lead: Twitter: twitter.com/DefiIntro Discord: atakan-IntroToDefi#7962 ",
                    "links": [
                        "http://twitter.com/wagmiAlexander",
                        "http://twitter.com/sonnefinance",
                        "http://twitter.com/DefiIntro"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/jessepollak",
                    "index": "33",
                    "likes": "8",
                    "time": "24/01/2023-14:05:45",
                    "content": "Hello all - excited to make some nominations. Disclaimer: I’m doing this in my personal capacity, not as a representative of Coinbase. The projects name: Rotki A description of how the project has supported development and usage of the OP Stack: Rotki is an open source, privacy protecting portfolio tracking app. They recently added Optimism support. Their tooling will allow Optimism users to better manage their portfolio and taxes. This is invaluable to users of the Optimism ecosystem. A link to the project’s GitHub or Twitter: https://twitter.com/rotkiapp ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.875
                },
                {
                    "author_link": "https://gov.optimism.io/u/mentalist0x",
                    "index": "34",
                    "likes": "10",
                    "time": "24/01/2023-14:39:53",
                    "content": "  The projects name: QuestBook   How the project has supported the development and usage of the OP Stack: By enabling protocols to give out grants to competent builders in a transparent manner, Questbook has accelerated the growth of the Web3 ecosystem as well as the OP Stack. Questbook is a decentralized grant management platform. The platform is open-sourced, transparent, and deployed on Optimism. All the grants on Questbook are given out on the OP Stack. That means, builders submitted their proposals, received reviews and community feedback, all via the Optimism Chain. By using the tool,   Grant managers have created, reviewed, accepted, tracked, and facilitated grants worth $2.1M   1500+ Builders have applied for various grants, reported milestones and funding, and received feedback.   The entire grant flow on the tool is transparent, on-chain and accessible to the community.  public proposal flow2880×1800 497 KB    Questbook has enabled protocols built on Optimism such as Aave, Perpetual, and Biconomy to give out grants to builders who will contribute to the OP Stack again. The tool is currently being used by 20k+ builders, and $2.1m worth of grants have been facilitated. Questbook has also relaunched Compound Grants Program 2.0 as a community-run grants program, to disburse $1M to the builders.   A link to the project’s GitHub or Twitter: https://github.com/questbook   Contact info for the project or project lead: @harsha.questbook   For more details, please go through this! ",
                    "links": [
                        "https://github.com/questbook",
                        "https://questbook.notion.site/Retro-Grant-5c13ed20dad74a6f88108620c532198c"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.05
                },
                {
                    "author_link": "https://gov.optimism.io/u/kaereste",
                    "index": "35",
                    "likes": "14",
                    "time": "24/01/2023-14:41:56",
                    "content": "I’m nominating rotki, a local-first, fully open source portfolio manager licensed under AGPL (meaning it’s free software, a public good). Project name: rotki - open source portfolio tracker, accounting and analytics tool A description of how the project has supported development and usage of the OP Stack: rotki used a Phase 1 grant to integrate Optimism into the app. The development has been completed and is ready for use on the develop branch, which will be released soon. As rotki is free and open source, anyone is free to build on top of it, or to re-use the code in their own software. This makes it an obvious fit for the first two areas of the scope of this category. On top of that, the founder and CEO of rotki, @lefterisjp is a well-known and active member and contributor to the Optimism Community, one of the top 10 delegates of the Token House. His views and actions are well aligned with the Optimism Collective’s mission, and he puts them into practice in rotki’s architecture and development. It’s important to note that even if someone is not an active Rotki user, it’s in their best interest to see Rotki used and developed, as it’s probably the only local portfolio tracker that puts user privacy and security ahead of fancy UX and catchy features. The fact that we have free, open source software integrated into our crypto infrastructure ensures that this infrastructure is still trustless and permissionless. Even if you don’t use a local portfolio manager right now, it’s important to be able to use it because it ensures that you can keep your data private and secure at all times, without relying on centralised services or intermediaries. A link to the project’s GitHub or Twitter: Github: Rotki · GitHub Twitter: https://twitter.com/rotkiapp Discord: Rotki Website: https://rotki.com/ (optional) contact info for the project or project lead: Lefteris Karapetsas https://twitter.com/LefterisJP @lefterisjp ",
                    "links": [
                        "https://github.com/rotki",
                        "https://twitter.com/rotkiapp",
                        "https://discord.gg/aGCxHG7",
                        "https://rotki.com/",
                        "https://twitter.com/LefterisJP"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.301459293394778
                },
                {
                    "author_link": "https://gov.optimism.io/u/Modularity",
                    "index": "36",
                    "likes": "1",
                    "time": "24/01/2023-14:42:39",
                    "content": "  The projects name: EthereansOS   A description of how the project has supported development and usage of the OP Stack: EthereansOS launched two iterations of it’s DeFi suite (Covenants) and new NFT standard (ITEMS) on Optimism. The dev team is dedicated to using Optimism to facilitate future implementations of these tools to help developers onboard to Optimism and create the next generation of dapps using secure coding practices (with the Factories model) as well as complex governance structures using Organizations (DAO tool suite).   A link to the project’s GitHub or Twitter: https://twitter.com/ethereanslabs   (optional) contact info for the project or project lead: https://twitter.com/toschi_eth   ",
                    "links": [
                        "https://twitter.com/toschi_eth"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.196969696969696
                },
                {
                    "author_link": "https://gov.optimism.io/u/NathanVDH",
                    "index": "37",
                    "likes": "7",
                    "time": "24/01/2023-16:13:09",
                    "content": "The projects name: Snapshot A description of how the project has supported development and usage of the OP Stack: Snapshot has been used both by the Optimism Collective and 64 projects on Optimism to facilitate governance. All of these services have been provided for free, both for governance participants and the projects themselves. This has allowed Optimism to be the most active layer 2 in terms of governance and establish a strong ideological stance of decentralization and participative decision-making in the entire ecosystem. Snapshot allows projects to conduct votes that most of the people reading this forum have participated in. Since the start of Optimism’s governance:   1.15M votes have been cast in the Optimism collective’s governance on 93 proposal.  88650 participants have voted, which means the average participant has voted 13 times on average, the highest number for any major DAO.  A link to the project’s GitHub or Twitter: Snapshot Labs · GitHub & https://twitter.com/SnapshotLabs Contact info for the project or project lead: @nathan_vdh on Telegram, @SnapshotLabs on Twitter ",
                    "links": [
                        "https://snapshot.org/#/?network=10",
                        "https://github.com/snapshot-labs",
                        "https://twitter.com/SnapshotLabs"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.8125
                },
                {
                    "author_link": "https://gov.optimism.io/u/ANDRIU",
                    "index": "38",
                    "likes": "2",
                    "time": "24/01/2023-17:16:32",
                    "content": "Mean Finance is a protocol that enables dollar-cost-averaging to certain crytocurrencies. What is DCA? Dollar-cost averaging is the practice of systematically investing equal amounts of money at regular intervals, regardless of the price of the asset. https://mean.finance/  allows users to DCA ERC20 tokens on Arbitrum, Matic, Optimism. Automatically. https://twitter.com/mean_fi Recently, Mean launched a yield-bearing-DCA program. This means users can earn yield on a DCA position. I believe that this protocol, thanks to its solutions, will attract a large number of users. ",
                    "links": [
                        "https://twitter.com/mean_fi"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.002551020408164
                },
                {
                    "author_link": "https://gov.optimism.io/u/ltk",
                    "index": "39",
                    "likes": "6",
                    "time": "24/01/2023-21:38:26",
                    "content": "  Project: Dune Analytics   A description of how the project has supported development and usage of the OP Stack:  Dune Analytics is a tool for blockchain research. It can be used to query, extract, and visualize blockchain data, is probably the strongest blockchain data analytics tool currently available to the public. With Dune you get near real-time access to blockchain data through a public database that you can query through Dune’s website using SQL.    A link to the project’s GitHub or Twitter:  Twitter GitHub    ",
                    "links": [
                        "https://github.com/duneanalytics"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gaelhector44",
                    "index": "40",
                    "likes": "2",
                    "time": "24/01/2023-22:36:41",
                    "content": "Nom du Projet: Pika Protocol Descriptif: Le projet Pika Protocol est composé d’une équipe compétente qui est à l’écoute de sa communauté. Elle prend en compte les retours de sa communauté afin de rendre un produit optimal et adapté au plus grand nombre. La preuve en est que sa plateforme a vu ses chiffres (Utilisateurs notamment) grimper au fil des mois. Enfin, Pika Protocol a mis en avant les échanges perpétuelles sur OP comme a pu le mettre en avant un des mes camarades ci-dessus. Twitter: https://twitter.com/PikaProtocol ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/Wollum",
                    "index": "41",
                    "likes": "8",
                    "time": "25/01/2023-00:36:10",
                    "content": " The project name - rust-cannon-template  A description of how the project has supported development and usage of the OP Stack: The Rust Cannon template is a kicking off point for developers who want to build and experiment with the provable execution layer of the OP stack. It makes it simple to compile Rust code to MIPs with helpers to read inputs, write outputs and access the pre-image oracle. The results of the execution of this code can be fraud-proven on-chain using the OP stack Solidity contracts. Currently Optimism only maintains a Golang stack part of the official Cannon repo. This template came about as a side project from the 2022 EthBerlin hackathon. It has already been used in the DevCon hackathon (by a team I was part of) to build Zipline a Ethereum light-client bridge based on the OP stack which is seeing continued development. It is difficult to estimate how many developers have used the template so far but as of writing it has around 20 stars on Github. Lowering the barrier to entry for developers to experiment with this part of the stack is important to encourage hacking and innovation going forward.  A link to the project’s GitHub or Twitter:    GitHub    GitHub - willemolding/rust-cannon-template: A build system and a minimal Rust... A build system and a minimal Rust program for building MIPS binaries that are executable in the context of [Optimism Cannon](https://github.com/ethereum-optimism/cannon).  - GitHub - willemolding/r...       Contact Info: Email: willemolding -at- gmail -dot- com Discord: Wollum#9819 ",
                    "links": [
                        "https://github.com/willemolding/rust-cannon-template",
                        "https://github.com/willemolding/rust-cannon-template"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.166666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/jtriley.eth",
                    "index": "42",
                    "likes": "4",
                    "time": "25/01/2023-04:19:07",
                    "content": "  The projects name: snekmate  A description of how the project has supported development and usage of the OP Stack: While there are plenty of Solidity libraries out there, very few people are working on high-quality and easy-to-integrate library-like Vyper code. In one sentence: snekmate are state-of-the-art, highly opinionated, hyper-optimised and secure Vyper smart contract building blocks. Not only does client diversity matter but also language diversity. Any Vyper-based project built on the OP Stack will probably use Snekmate under the hood mid-term. Or in other words, Snekmate helps Vyper builders to kick start on the OP Stack. The true power of the library will be unleashed once the library modules (VIP: Library Modules · Issue #2431 · vyperlang/vyper · GitHub) are released in Vyper. There it will be as simple as import recover_sig from snekmate.ECDSA . At the moment the library is mainly maintained by pcaversaccio and some open-source contributors.  A link to the project’s GitHub or Twitter: GitHub - pcaversaccio/snekmate: State-of-the-art, highly opinionated, hyper-optimised, and secure 🐍Vyper smart contract building blocks.   Contact info for the project or project lead: @pcaversaccio on Twitter or Telegram.  ",
                    "links": [
                        "https://github.com/pcaversaccio/snekmate"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.700099206349206
                },
                {
                    "author_link": "https://gov.optimism.io/u/Ben982",
                    "index": "43",
                    "likes": "1",
                    "time": "25/01/2023-05:51:05",
                    "content": "•\tThe projects name: Quix-NFT Market •\tA description of how the project has supported development and usage of the OP Stack: o\tQuix is the best and only NFT-market on Optimism that actually was handy and fun to buy NFTs at. Now that they have problems funding their further work. I think they deserve to be paid for their great work to continue further growth and development. o\tA flourishing NFT market is important for the growth of every chain and I truly believe Quix has the potential to contribute to the Optimism ecosystem as a whole. •\tA link to the project’s Twitter: https://twitter.com/qx_app?s=20&t=1brAGfPlSsbiJM6wcMcTYg •\tWebsite ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.395833333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/MWQ",
                    "index": "44",
                    "likes": "1",
                    "time": "25/01/2023-12:35:38",
                    "content": "The projects name: DeBank A description of how the project has supported development and usage of the OP Stack: It shows the coin and NFT holdings on the account. It shows transactions history other features that helps to easily manage the account. A link to the project’s GitHub or Twitter: @DeBankDeFi https://twitter.com/DebankDeFi Love Optimism ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.347222222222221
                },
                {
                    "author_link": "https://gov.optimism.io/u/ethlimo",
                    "index": "45",
                    "likes": "4",
                    "time": "25/01/2023-15:22:17",
                    "content": " The project name: eth.limo  A description of how the project has supported development and usage of the OP Stack : eth.limo is a privacy-preserving ENS gateway, enabling users to access Ethereum-native dApps and content. The eth.limo gateway utilizes CCIP enabling users to securely & reliably read retrieved data offchain and cross chain. Users can create and manage names on layer 2 networks at a much lower cost.  (Example: optinames.eth.limo)  A link to the project’s GitHub or Twitter : GitHub Twitter ",
                    "links": [
                        "https://twitter.com/eth_limo"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Crystalminer",
                    "index": "46",
                    "likes": "3",
                    "time": "25/01/2023-16:04:37",
                    "content": "I want to propose this app that I’ve been using a lot lately.   The projects name: Guild  A description of how the project has supported development and usage of the OP Stack:  Guild allows you to automatically assign roles to token/NFT holders or create allow lists based on on-chain credentials. The creation of guilds is free and gasless.  A link to the project’s GitHub : GitHub - agoraxyz/guild.xyz: A tool for token-curated communities. A link to the project’s Twitter :  https://twitter.com/guildxyz ",
                    "links": [
                        "https://twitter.com/guildxyz"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/undercreuse",
                    "index": "47",
                    "likes": "4",
                    "time": "25/01/2023-22:44:05",
                    "content": "Project Name  : Lyra Finance A description of how the project has supported development and usage of the OP Stack : The interest and use of option trading is growing strongly among users, in particular to have more distanced trading and to hedge their tokens. In this context, Lyra finance is a very nice solution, with a simple UX/UI that makes it easy to perform options trading operations. With such a quality interface and its simplicity, it can bring real enthusiasm to the OP ecosystem. Love Lyra, Love Optimism https://twitter.com/lyrafinance ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.756666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/tylrha",
                    "index": "48",
                    "likes": "3",
                    "time": "26/01/2023-09:15:41",
                    "content": "I am nominating RevokeCash project, Revokecash.   The project’s name: Revokecash  A description of how the project has supported development and usage of the OP Stack:  Revoke.cash is a suite of web3 security tools. It offers a dashboard to manage token and NFT allowances on Optimism and 30+ other chains. It also provides a browser extension that warns users when they are about to perform potentially harmful actions, such as approvals or NFT listings. Users of Optimism and other supported chains benefit from greater security while interacting with other Optimism-based applications and transacting on-chain thanks to the provision of these services.   A link to the project’s GitHub or Twitter:  Github: Revoke.cash · GitHub   Twitter: https://twitter.com/RevokeCash     (optional) contact info for the project or project lead:  ",
                    "links": [
                        "https://twitter.com/RevokeCash"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.265625
                },
                {
                    "author_link": "https://gov.optimism.io/u/satomisu",
                    "index": "49",
                    "likes": "3",
                    "time": "26/01/2023-13:23:18",
                    "content": "  The projects name:synthetix  A description of how the project has supported development and usage of the OP Stack: The site design which I (beginner) am easy to know is good. Besides, I am glad that tokens increase when I make staking. I want to use it all the time from now on. I want to recommend it to everybody.  A link to the project’s GitHub or Twitter: https://twitter.com/synthetix_io   (optional) contact info for the project or project lead: https://twitter.com/satomisu47   ",
                    "links": [
                        "https://twitter.com/satomisu47"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.722222222222221
                },
                {
                    "author_link": "https://gov.optimism.io/u/famassed",
                    "index": "50",
                    "likes": "8",
                    "time": "26/01/2023-13:47:42",
                    "content": "The projects name: Infinity Wallet A description of how the project has supported development and usage of the OP Stack: It supports OP within its platform and is making it easier to use OP apps in their new kind of web3 browser and onboard to OP. I was previously using MetaMask until I was recommended Infinity Wallet by a friend. On changing I had a completely new experience that has changed my entire perspective of crypto and blockchain. Its the only wallet I know of that delivers such quality and has unique features. Before I found out about Infinity Wallet using OP was extremely difficult to find out what to do to get started and use web3, or even transact. I have tried more than 20 wallets since 2016 and none of them are a touch on what the Infinity Wallet team have delivered. Since moving to Infinity Wallet my experience on OP has completely evolved from web3 access and discovering the OP ecosystem, to being able to instantly onboard in a single click from any chain, to even making transactions is all seamless. Its like they have jumped forward 5 years into the future compared to everyone else! Infinity Wallet for me is one of the only reasons I am active in OP as it changed my entire experience and that of many other people that I recommended it to now. For me without Infinity Wallet the OP ecosystem would not be the same and I would never have been able to fully take advantage and use apps built on OP without it. A link to the project’s GitHub or Twitter: https://twitter.com/InfinityWallet (optional) contact info for the project or project lead: The team is active on their discord and I see them answer any user questions Infinity Community. They also have a partner email found on the site partner@infinitywallet.io and I generally contact them via their website live support on infinitywallet.io ",
                    "links": [
                        "https://discordapp.com/invite/SgNjKzF",
                        "http://infinitywallet.io"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.481601731601732
                },
                {
                    "author_link": "https://gov.optimism.io/u/shouyi",
                    "index": "51",
                    "likes": "9",
                    "time": "26/01/2023-14:10:19",
                    "content": "As a frequent user and community member of Chaineye，I would like to propose Chaineye. Project Name: Chaineye (www.chaineye.tools) A description of how the project has supported the development and usage of the OP Stack: ChainEye aims to build world-leading free and open-source omni-chain analytical tools for retail investors. Launched in Q4 2021, Chaineye has over 100k user visits and directed over 10K+ asset transfers to Optimism. Currently, it has the following core functions to help develop and use the OP stack and optimism ecosystems:   Optimism on-chain Map - Users can find attractive participating opportunities on Optimism such as yield farming, swap & lending, NFT mining, airdrop, DAO governance, etc. This is ongoing work and we will spend significant R&D efforts to build more functions for Optimism Map.   BridgeEye - a multi-chain bridge comparison tool. Users can use this tool to find the optimal bridge option from other chains to optimism.   CEX transfer fee - Users can find the cheapest route from CEX to Optimism   Multichain Gas - Users can check the gas history and hour distribution for Optimism.   RPC List - Users can find the best public RPC for Optimism in terms of height, latency, 24-hour status, provider information, etc.   To sum up, Chaineye is built to provide the best clean data to users as a free open-source public good. In addition, its core function Optimism on-chain map is determined to be a resource for OP Stack projects and communities. A link to the project’s GitHub or Twitter: @Chaineye_tools (Project Twitter) @BiteyeCN (Community Twitter) DeFiEye · GitHub (Project Github) (optional) contact info for the project or project lead: DeFiTeddy2020 ( Project Lead Twitter) Teddy is a KOL in the Asian crypto community who has a track record of building successful public good products. ",
                    "links": [
                        "https://github.com/DeFiEye"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.741666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/stonecoldpat",
                    "index": "52",
                    "likes": "6",
                    "time": "26/01/2023-14:24:54",
                    "content": "  The projects name: Cryptofees  A description of how the project has supported development and usage of the OP Stack:  David Mihal built a great and simple website for tracking the fees paid across various networks including (and especially) layer-2 protocols like Optimism. Including crypto fees & l2 fees. He should receive a retrospective grant to pay for his time building it plus the maintenance cost. It is a very valuable resource used by many analysts.   A link to the project’s GitHub or Twitter: https://cryptofees.info/   (optional) contact info for the project or project lead:https://twitter.com/dmihal/status/1618614751260733441   ",
                    "links": [
                        "https://twitter.com/dmihal/status/1618614751260733441"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/fvictorio",
                    "index": "53",
                    "likes": "2",
                    "time": "26/01/2023-15:58:27",
                    "content": "  The project’s name: Prettier Solidity  A description of how the project has supported development and usage of the OP Stack: Prettier Solidity is the de-facto formatter for the Solidity language, and used by a lot of projects, including Optimism itself.  A link to the project’s GitHub or Twitter: GitHub - prettier-solidity/prettier-plugin-solidity: A Prettier plugin for automatically formatting your Solidity code.   (optional) contact info for the project or project lead: @fvictorio_nan on Twitter (I can only add two links because this is a new account)  ",
                    "links": [
                        "https://github.com/prettier-solidity/prettier-plugin-solidity"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.340909090909091
                },
                {
                    "author_link": "https://gov.optimism.io/u/Lukas",
                    "index": "54",
                    "likes": "9",
                    "time": "26/01/2023-16:14:12",
                    "content": "Project Name timdaub’s work as an Ethereum Magician developing Soulbound token standards, EIP-4973 and EIP-5192 Description: EIP-5912 and EIP-4973 are standard extensions for NFTs to lock tokens by blocking their transfer functionality. Developers can implement conditions to loan NFTs as collateral, build social recovery mechanisms (Soulbound tokens / non-transferable Tokens / NTTs) or use them as role markers (what we do at Otterspace). Tim Daubenschütz pioneered the work on non-transferable tokens (with EIP-4973). Upon release of the DeSoc paper, Tim worked with the community to address their concerns around privacy and consent. He organized workshops, gave talks, and interviewed users at multiple conferences in 2022. He expanded the non-transferable tokens narrative with various articles (links below) outlining his vision. At Otterspace we have built atop of Tim’s work and today, over 950 Otterspace Badges have been minted on Optimism using Tim’s standards. Additionally, various other projects (> 200 developer references in GitHub) are building non-financial use cases based on his work. While we at Otterspace funded Tim’s work (2 months) to implement EIP-4973, the majority of his work (> 1 year) remains unpaid. Tim is a big fan of Optimism’s RetroPGF. He successfully nominated the LeapDAO in R1 ( 1.6 ETH). Having faced the community’s critique on Soulbound tokens, developed a solution, and implemented a standard that stands to become the go-to-standard for non-transferable tokens, I believe, Tim would be stoked to receive funding for his work as it confirms its merit, improves his financial stability, and will allow him to double down on more standard development. In my opinion, an Ethereum Magician like Tim is the perfect candidate for RetroPGF! Links  Tim’s blog Tim’s profile on Ethereum Magicians Ethereum Magicians:  Tim’s ERC Lightning Talks session at Devcon Bogotá on Youtube  EIP-5912  Reference Implementation PEEPanEIP #89: EIP-5192: Minimal Soulbound NFTs with Tim Daubenschütz    EIP-4973  Reference Implementation     Blog posts:  What are Account-bound tokens? How EIP-4973 can help the music NFT industry! EIP-4973 allows for mutually agreed, peer-to-peer minting - without implicitly determined power distributions    Contact  About page on Tim’s blog  Disclaimers We (Otterspace) have funded Tim’s work for two months in May 2022 and July 2022. ",
                    "links": [
                        "https://eips.ethereum.org/EIPS/eip-5192",
                        "https://eips.ethereum.org/EIPS/eip-4973",
                        "https://github.com/timdaub",
                        "https://optimistic.etherscan.io/txs?a=0x7f9279b24d1c36fa3e517041fdb4e8788dc63d25",
                        "https://github.com/search?q=erc4973&type=code",
                        "https://proofinprogress.com/",
                        "https://ethereum-magicians.org/u/timdaub/summary",
                        "https://www.youtube.com/watch?v=LhUgGSzZL4Y",
                        "https://eips.ethereum.org/EIPS/eip-5192",
                        "https://github.com/attestate/ERC5192",
                        "https://www.youtube.com/watch?v=unFTcUjQE3o",
                        "https://eips.ethereum.org/EIPS/eip-4973",
                        "https://github.com/attestate/ERC4973",
                        "https://proofinprogress.com/posts/2022-05-30/what-are-account-bound-tokens.html",
                        "https://neume.network/posts/how-eip-4973-account-bound-tokens-could-drive-curation-in-the-music-nft-industry/",
                        "https://ethereum-magicians.org/t/eip-4973-account-bound-tokens/8825/129",
                        "https://proofinprogress.com/about.html"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.604938271604938
                },
                {
                    "author_link": "https://gov.optimism.io/u/NASA",
                    "index": "55",
                    "likes": "2",
                    "time": "26/01/2023-19:00:35",
                    "content": "The projects name: DefiLlama A description of how the project has supported development and usage of the OP Stack: DefiLlama is a crypto data aggregator that provides dashboards and APIs covering various aspects of the DeFi (Decentralized Finance) ecosystem such as Total Value Locked (TVL), DEX Volume, CEX Liquidity, token prices, DeFi yields, and more. DefiLlama prides itself on its high-quality data curation, making it a reliable source for the crypto community, analysts and developers. This includes avoiding double-counted TVL, and separating native versus incentivized yield. The TVL APIs, for example, are a key source of data for tracking DeFi flows and OP incentive performance. The dashboards and APIs are offered as a free public service, and have become a core resource for the crypto community. A link to the project’s GitHub or Twitter: https://defillama.com/ DefiLlama · GitHub (optional) contact info for the project or project lead: https://twitter.com/DefiLlama ",
                    "links": [
                        "https://github.com/DefiLlama",
                        "https://twitter.com/DefiLlama"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.642857142857142
                },
                {
                    "author_link": "https://gov.optimism.io/u/Janos",
                    "index": "56",
                    "likes": "1",
                    "time": "26/01/2023-20:46:58",
                    "content": "  The projects name: Infura  A description of how the project has supported development and usage of the OP Stack: Optimism is a pragmatic and exceptionally simple Layer 2 scaling solution, providing the most familiar Ethereum experience for developers at a fraction of the transaction cost. BUILD WITH OPTIMISM + INFURA With Optimism, a leading Layer 2 solution with over $800 million total value locked, saved more than $1 billion in gas fees, and donated over $1 million to public goods, doing good work in Web3 has never looked more positive.  About Optimism: Designed around the 4 tenets of simplicity, pragmatism, sustainability and optimism, Optimism uses optimistic rollups to process transactions in batches, reducing gas fees and speeding up transaction time. Optimism is committed to decentralization, right down to the architecture of its own incentive system. With $1M donated thus far, Optimism aims to scale and sustain public goods on Ethereum until it becomes decentralized. Optimism Collective, a new DAO, was recently created to fund public goods and govern the protocol.   A link to the project’s GitHub or Twitter: https://twitter.com/infura_io Infura · GitHub ConsenSys   (optional) contact info for the project or project lead: Contact Us | Infura   ",
                    "links": [
                        "https://github.com/INFURA",
                        "https://discord.com/invite/consensys",
                        "https://www.infura.io/contact"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.108469145233851
                },
                {
                    "author_link": "https://gov.optimism.io/u/bobby",
                    "index": "57",
                    "likes": "5",
                    "time": "26/01/2023-22:42:45",
                    "content": "  The projects name: Agora  A description of how the project has supported development and usage of the OP Stack: Agora has built a new voting portal for Token House proposals and delegates. This helps delegates onboard more easily, helps track proposals, and helps Optimism governance take its first steps towards a robust onchain governance system. Agora has received a grant from the Token House GovFund and from the Foundation Partner Fund for this work. It’s up to the Citizens’ House badgeholders to decide if their impact from what they’ve built has provided more public good than they’ve received funding    A link to the project’s GitHub or Twitter: https://twitter.com/nounsagora   (optional) contact info for the project or project lead: https://twitter.com/zhayitong   ",
                    "links": [
                        "https://twitter.com/zhayitong"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.799783549783549
                },
                {
                    "author_link": "https://gov.optimism.io/u/timdaub",
                    "index": "58",
                    "likes": "5",
                    "time": "27/01/2023-09:05:47",
                    "content": "Project Name Otterspace Description Otterspace is building an easy-to-use toolkit for DAOs and Web3 communities to create, distribute, and manage Soulbound tokens (also known as non-transferable Tokens or Badges) on Optimism. These tokens can be used to signal community membership and status, in governance, as rewards, education credentials, and more. Otterspace is an Optimism-first project and has brought dozens of communities (incl. Bankless DAO, Radicle DAO, and Cabin DAO) onto the chain. It has helped hundreds of users to get their first experience with the Optimism ecosystem (over 900 Badges have been minted so far). The Otterspace protocol allows other projects to build their Soulbound token protocols on top of Otterspace & Optimism, which projects like the Token Engineering Academy or SafeSend have done. Otterspace is contributing to the tooling & utilities of DAOs and Web3 communities and contributes to making Optimism an attractive option for new communities to start. As a launch partner of the Attestation Station, Otterspace will upload attestations, contributing to the Optimism NFT project. I believe that Otterspace’s work, building and launching tools for DAOs, and the positive impact it is having on the ecosystem, make them a great candidate for the RPGF. Links  Otterspace Website Otterspace Twitter Otterspace GitHub Otterspace Mirror  Disclaimer Otterspace is using the EIP-4973 and EIP-5912 standards for Soulbound tokens (account-bound tokens) that I developed (and am also nominated for) and has funded my work between May 2022 and July 2022. We have been working closely on progressing the state of Soulbound tokens and are proud contributors to the optimistic vision. ",
                    "links": [
                        "https://otterspace.mirror.xyz/yx2jqlqyi5-s9iGojnqJNlkgI3psaHeqvpP-TQpnXuk",
                        "https://otterspace.mirror.xyz/uwWY3ErzlW3A914JwIO0_ShRMNKuLMOzIH0DIp0Fjrg",
                        "https://www.cabin.city/",
                        "https://tokenengineering.net/",
                        "https://www.safesend.co/",
                        "https://www.otterspace.xyz/",
                        "https://twitter.com/otterspace_xyz",
                        "https://github.com/otterspace-xyz/",
                        "https://otterspace.mirror.xyz/",
                        "https://gov.optimism.io/t/education-nominations-for-rpgf2/4640/77"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.858471074380166
                },
                {
                    "author_link": "https://gov.optimism.io/u/ANDRIU",
                    "index": "59",
                    "likes": "6",
                    "time": "27/01/2023-09:28:40",
                    "content": "Projects name: LAYER3 Description: This platform is the place to discover all your favorite protocols, communities, DAOs and Dapps in one place. In short, you can present these platforms in a few sentences.:  the platform provides us with missions where we have the opportunity to learn about new projects from various ecosystems, including Optimism. the user doesn’t wander around the net looking for a good projects, and has it all in one place. a lot of missions were and are available in the Optimims ecosystem. thanks to this platform, I got to know a lot of projects, and thus I used ecosystems more often, performing individual missions.  The project aims to become the best platform to learn, discover and contribute to web3. Note: You can see a large increase of the users which are using this platform. A link to the project: Website -  https://beta.layer3.xyz/quests Twitter -  https://twitter.com/layer3xyz ",
                    "links": [
                        "https://twitter.com/layer3xyz"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.232374768089054
                },
                {
                    "author_link": "https://gov.optimism.io/u/Ospace",
                    "index": "61",
                    "likes": "18",
                    "time": "27/01/2023-11:46:16",
                    "content": "@Ospace NFT project Proposal For Optimism Public Goods Funding Round 2 Project Name : Ospace (Oliens) Project Description : The Ospace project started its activity in May 2022 as an NFT project on the Optimism chain. Our first collection was Oliens which was launched as a free mint on Quix launched on 9th of july 2022 & it quickly got sold out. Oliens has added new unique users to Optimism chain because of its Art and free mint launch and it continued to reach +3.2K trades & more than 47 ETH volume & it is known as a popular collection on Optimism chain. After this collection we continued our journey & created a DAO, based on Oliens holders to engage more with our community to use their feedback for the remainder of the project. Our team in Ospace project carries a lot of ideas & enthusiasm towards NFT & gaming fields & we also believe in optimism’s future which makes us even more interested. We have a community which appreciates new ideas & this OP drop will help us to advance the project towards this direction. Grant Category: NFTs & Gaming Total VOL: 47 ETH Total Sales: 3219 Unique Holders: 1474 Twitter Followers: 10.3K Discord Members: +9K Number of OP Tokens requested: 30,000 Our idea for possible OP tokens usage: We currently feel the need for the op tokens in three areas. If Optimism foundation agrees with our proposal, we will put these 3 options up for voting in our dao & will allocate op tokens to each option according to the percentage of their votes. The three options are listed below: 1: We will be using Createra to get one step closer to our goal of entering the Metaverse & gaming field. Createra gives the opportunity to their Land holders to Build & Grow their creativity of building a world of their own. In this section we’ll use the Op tokens to purchase createra land to design and develop games for Oliens Holders. 2: We will develop a platform where artists can submit their NFT collections & we will select a collection every month depending on its art or its use case & will drop the collection to active optimism NFT users for free ( free mint ). The selected artists will receive a grant from the op stack of this section & these free mint drops will continue until the stack runs out. All the royalties of these collections will be allocated to the optimism public goods. 3: At this stage, we will start creating weekly Quests and Tasks via crew3/twitter/discord & reward users with OP Tokens. The purpose of these tasks is to keep more users active in the NFT field on optimism blockchain. Links: ospaceproject | Twitter | Linktree https://twitter.com/Ospaceproject ",
                    "links": [
                        "https://twitter.com/Ospaceproject"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.176677489177489
                },
                {
                    "author_link": "https://gov.optimism.io/u/Akbrhx.OAYC",
                    "index": "62",
                    "likes": "3",
                    "time": "27/01/2023-12:34:42",
                    "content": "I am nominating RevokeCash project, Revokecash.   The project’s name: Revokecash  A description of how the project has supported development and usage of the OP Stack:  Revoke.cash is a suite of web3 security tools. It offers a dashboard to manage token and NFT allowances on Optimism and 30+ other chains. It also provides a browser extension that warns users when they are about to perform potentially harmful actions, such as approvals or NFT listings. so like this security tool ! Users of Optimism and other supported chains benefit from greater security while interacting with other Optimism-based applications and transacting on-chain thanks to the provision of these services.   A link to the project’s GitHub or Twitter:  Github: Revoke.cash · GitHub  Twitter: https://twitter.com/RevokeCash     ",
                    "links": [
                        "https://twitter.com/RevokeCash"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.265625
                },
                {
                    "author_link": "https://gov.optimism.io/u/Will",
                    "index": "63",
                    "likes": "4",
                    "time": "27/01/2023-15:48:05",
                    "content": "Note: I work for OP labs but this nomination is in a personal capacity  The project’s name: Wagmi  A description of how the project has supported development and usage of the OP Stack: Wagmi is an incredible react and vanilla js based library for building dapps.   They bring modern web development patterns to dApp development with their observable-like query library.   Many including myself who has tried building frontends with wagmi and without wagmi can tell you the experience is night and day.   Wagmi has grown to over 85,000 weekly downloads and is still trending up in a linear fashion. A link to the project’s GitHub or Twitter: GitHub - Wagmi: React Hooks for Ethereum  (optional) contact info for the project or project lead: Wagmi twitter    ",
                    "links": [
                        "https://twitter.com/wagmi_sh"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/refcell",
                    "index": "64",
                    "likes": "4",
                    "time": "27/01/2023-18:00:18",
                    "content": "  The projects name: Multicall3  A description of how the project has supported development and usage of the OP Stack: Multicall3 is an extension of the original MakerDAO Multicall library that Matt Solomon has consistently maintained. Multicall3 is deployed to the same address across 50 different networks, including Optimism, providing critical, reliable tooling for the ecosystem.  A link to the project’s GitHub or Twitter: GitHub - mds1/multicall: Multicall: Aggregate multiple constant function call results into one   (optional) contact info for the project or project lead: https://twitter.com/msolomon44   ",
                    "links": [
                        "https://twitter.com/msolomon44"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.446428571428571
                },
                {
                    "author_link": "https://gov.optimism.io/u/AndrewG",
                    "index": "65",
                    "likes": "9",
                    "time": "27/01/2023-18:29:45",
                    "content": "  Project Name: Blockscout   A description of how the project has supported development and usage of the OP Stack: Blockscout is an open-source, community-driven block explorer. Since last summer our team has been working closely with the Optimism team to support full transparency and searchability for all Optimism data. Detailed views are available for all transactions, along with the ability to verify and interact with on-chain contracts using Blockscout. In addition to a mainnet instance, we’ve supported the Goerli testnet instance and the recent upgrades through Bedrock Alpha and Beta. We also spun up a quick custom explorer for the OPCraft game featured at Devcon. We’re excited to continue improving the explorer experience and optimizing Optimism instances for open and transparent data accessibility.   Optimism Goerli (Optimism) Explorer (see dropdown for other OP explorer instances)    A link to the project’s GitHub or Twitter:  Github: BlockScout · GitHub  Twitter: @blockscoutcom     ",
                    "links": [
                        "https://github.com/blockscout"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.666666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/mastermojo",
                    "index": "66",
                    "likes": "2",
                    "time": "27/01/2023-18:32:49",
                    "content": "  The projects name: Cannon   A description of how the project has supported development and usage of the OP Stack:   Cannon makes it easy to deploy and package smart contract code on any EVM compatible blockchain. It has already been used to deploy thousands of lines of code to Optimism and its testnet - with protocols such as Synthetix, Aelin, and Chainlink. Cannon is a CLI (compatible with Foundry and Hardhat) inspired by Docker and Terraform. Cannon is the winner of the ETHDenver 2022 Hackathon. Use existing packages or define your protocol’s contracts, initialization scripts, and on-chain dependencies in Cannonfiles for automated deployments on local and live chains. Cannon comes with a built-in package manager (backed on Ethereum and IPFS) so you can easily include existing protocols for development and testing.   A link to the project’s GitHub or Twitter:     GitHub    GitHub - usecannon/cannon: Manage EVM protocol deployments. Inspired by... Manage EVM protocol deployments. Inspired by Docker, Terraform, and npm. - GitHub - usecannon/cannon: Manage EVM protocol deployments. Inspired by Docker, Terraform, and npm.        (optional) contact info for the project or project lead: mjlescano (Matías Lescano) · GitHub dbeal-eth (dbeal) · GitHub noahlitvin (Noah Litvin) · GitHub https://twitter.com/noahlitvin   ",
                    "links": [
                        "https://github.com/usecannon/cannon",
                        "https://github.com/mjlescano",
                        "https://github.com/dbeal-eth",
                        "https://github.com/noahlitvin",
                        "https://twitter.com/noahlitvin"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0144300144300145
                },
                {
                    "author_link": "https://gov.optimism.io/u/qbzzt",
                    "index": "67",
                    "likes": "5",
                    "time": "27/01/2023-20:42:11",
                    "content": "Note: I am an employee of OP Labs, but I am doing this in my personal capacity. The projects name: Yoav Weiss A description of how the project has supported development and usage of the OP Stack: We used to have fault proofs. Yoav did some volunteer security research to show how those fault proofs were faulty, and trusting them would enable vulnerabilities. He found a general technique that could be abused to retroactively cancel transactions, and then proved we were vulnerable to it. He then informed Optimism of this problem, and waited to publish it (gaining reputation to himself) until it was no longer an issue in production. Notice the date on Optimistic time-travel. Cautious optimism— why fraud proofs… | by Yoav Weiss | Infinitism | Medium   A link to the project’s GitHub or Twitter: https://twitter.com/yoavw   (optional) contact info for the project or project lead: See above  ",
                    "links": [
                        "https://twitter.com/yoavw"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.4375
                },
                {
                    "author_link": "https://gov.optimism.io/u/slw",
                    "index": "68",
                    "likes": "4",
                    "time": "27/01/2023-21:18:49",
                    "content": "The projects name: OpenZeppelin Contracts A description of how the project has supported development and usage of the OP Stack: OpenZeppelin Contracts provide a set of thoughtfully designed, standardized smart contracts that implement the most popular features and patterns, such as support for ERC20 and ERC721 tokens, contract upgradability, utilities for bridging cross-chain messages (incl. Optimism), and support for decentralized governance. The aim is to help developers avoid reinventing the wheel and ensure that their contracts are consistent with industry best practices. Version 4.9 of the Contracts library, planned for release in 1 to 2 months, will feature a new version of Governor that will support operating with timestamps instead of block numbers. A link to the project’s GitHub or Twitter:   GitHub    GitHub - OpenZeppelin/openzeppelin-contracts: OpenZeppelin Contracts is a... OpenZeppelin Contracts is a library for secure smart contract development. - GitHub - OpenZeppelin/openzeppelin-contracts: OpenZeppelin Contracts is a library for secure smart contract development.      (optional) contact info for the project or project lead: contact@openzeppelin.com ",
                    "links": [
                        "https://github.com/OpenZeppelin/openzeppelin-contracts"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.803841991341991
                },
                {
                    "author_link": "https://gov.optimism.io/u/wonderland",
                    "index": "69",
                    "likes": "8",
                    "time": "27/01/2023-21:38:28",
                    "content": " The projects name: Smock A description of how the project has supported development and usage of the OP Stack: Smock is the Solidity mocking library. It is installed as a Hardhat plugin which can be used to create mock Solidity contracts entirely in JavaScript (or TypeScript!). With Smock, writting tests for smarts contracts becomes incredibly easy, improving the security of the ecosystem a whole. Smock was first built out of necessity by Optimism in March 2021. The testing library saw use by the Optimism team, and a few others, reaching a total of 69 stars in Github. Later, in July 2021, Wonderland took the mission to rewrite Smock in a more scalable way, also adding many requested features, and improving the overall developer experience. All of these changes helped Smock become the de facto Solidity mocking library, increasing it’s usage by ~40 times. Added to the development time that Wonderland invested in the library, Wonderland as well funded issue bounties via Dework, in order to incentivise the community continous development and improvement of Smock. How much has been its impact? From inception, its use has been extended among Optimism and solidity developers in all EVM chains, and we’re proud of reaching:  17 releases Depedency in 795 repositories 279 stars in Github  Smock usage can be found all over the main Optimism Repository, and in many other protocols currently deployed in Optimism. Who are we? DeFi Wonderland is a team of top Web3 researchers, developers, and operators who believe that the future needs to be open-source, permissionless, and decentralized. Our partnerships with some of the most successful and promising projects in Web3, including Yearn, Sudoswap, Connext, and Keep3r, have allowed us to tackle complex engineering challenges and help these protocols reach their full potential. We’re excited to continue working with the best in the industry to drive innovation and growth in the Web3 ecosystem. A link to the project’s GitHub or Twitter:  Smock Repository: https://github.com/defi-wonderland/smock  Wonderland: https://twitter.com/DeFi_Wonderland   ",
                    "links": [
                        "https://twitter.com/DeFi_Wonderland"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.269230769230769
                },
                {
                    "author_link": "https://gov.optimism.io/u/Defi_LATAM_axlvaz",
                    "index": "70",
                    "likes": "6",
                    "time": "28/01/2023-00:06:13",
                    "content": "The projects name: EthernautDAO A description of how the project has supported development and usage of the OP Stack: EthernautDAO is a public good with the primary goal of quickly transforming senior (web2) developers into senior Solidity developers. To do this, they incentivize experienced Solidity mentors, but at the same time compensate those who create and share educational, curated and up-to-date content for developers to follow and learn from. The DAO matches mentors and mentees for one-on-one mentoring and provides them with what they need. The community is open and free, anyone can join, everything is open source and the educational content is free. They have managed 34 successful Solidity mentorships with new developers trained in 1 year, 80% of which are smart contract developers currently working on protocols on top of Optimism, such as Synthetix, Aelin, Kwenta, Yield and Optimism. A link to the project’s GitHub or Twitter : Project links:  Web: http://ethernautdao.io/  Mirror: https://ethernautdao.medium.com/  Twitter: https://twitter.com/EthernautDAO  GitHub: https://github.com/ethernautdao/  Gitbook https://docs.ethernautdao.io/  Discourse https://forum.ethernautdao.io/   (optional) contact info for the project or project lead: Founder: @Gonna.eth in addition to being the founder of EthernautDAO is a delegate of this government who has made several contributions.  Twitter: https://twitter.com/GonnaEth  Discord: Gonna#1010 Telegram: Telegram: Contact @GonnaEth   ",
                    "links": [
                        "https://ethernautdao.medium.com/",
                        "https://twitter.com/EthernautDAO",
                        "https://github.com/ethernautdao/",
                        "https://docs.ethernautdao.io/",
                        "https://forum.ethernautdao.io/",
                        "https://twitter.com/GonnaEth",
                        "https://t.me/GonnaEth"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.351048074732285
                },
                {
                    "author_link": "https://gov.optimism.io/u/noobman",
                    "index": "71",
                    "likes": "3",
                    "time": "28/01/2023-05:22:13",
                    "content": "Project name : Token terminal (website) Description of how the project has supported development and usage of the OP Stack:  Allowing users to track financial data on blockchains and decentralized applications (dapps) that run on blockchains including Dapps that run on Optimism network, for example, Lyra, Kwenta, Velodrome, Synthetix, ETC. Updating Optimism progress by showing active developers and code commits. Broadcasting Interview OP lap : (3347) Optimism – a Layer 2 scaling solution for Ethereum | 15-minute fundamentals ep. 29 - YouTube  Showing most active and trending contracts on Optimism network including active users.   A link to the project’s GitHub or Twitter:  Website : https://tokenterminal.com/  Twitter : Token Terminal (@tokenterminal) / Twitter   ",
                    "links": [
                        "https://tokenterminal.com/",
                        "https://twitter.com/tokenterminal"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.458333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/0xMilton",
                    "index": "73",
                    "likes": "6",
                    "time": "28/01/2023-20:53:48",
                    "content": "  The projects name: WakeUp Platform   A description of how the project has supported development and usage of the OP Stack:   The WakeUp Platform allows Web2 developers to start building and integrating blockchain technology easily. Having a complete understanding of blockchain tech is important, but challenging.   Adding features like minting any kind of tokens, token-gate an app, reading blockchain information or swap assets between peers is easier with WakeUp’s Developer-Oriented Platform.   Anyone with basic coding skills can directly call the Platform’s REST APIs, instead of coding everything from scratch. Even deploy Smart Contracts. The WakeUp Platform abstracts all the complex stuff for newcomer developers and organizations.   Adding the Optimism Blockchain and having the support of the OP community, would be an excellent first step to encourage new builders to create/integrate applications on Optimism Mainnet through WakeUp’s Platform.     A link to the project’s GitHub or Twitter:  Website GitHub Twitter    Contact info:  Milton: https://twitter.com/0xMilton || https://www.linkedin.com/in/miltonberman     ",
                    "links": [
                        "http://www.wakeuplabs.io/",
                        "https://github.com/wakeuplabs",
                        "https://twitter.com/wakeuplabs",
                        "https://twitter.com/0xMilton",
                        "https://twitter.com/0xMilton",
                        "https://www.linkedin.com/in/miltonberman",
                        "https://www.linkedin.com/in/miltonberman"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.430826118326118
                },
                {
                    "author_link": "https://gov.optimism.io/u/dandi",
                    "index": "74",
                    "likes": "1",
                    "time": "29/01/2023-13:28:17",
                    "content": "The project’s name is Remix IDE. Remix IDE is a powerful and versatile integrated development environment (IDE) that is specifically designed to support the development and deployment of smart contracts on Ethereum Virtual Machine (EVM) compatible blockchain networks. It provides developers with a wide range of tools and features that make it easy to write, test, and deploy smart contracts, as well as interact with them once they are deployed. One of the key advantages of Remix IDE is its support for the OP Stack. The OP Stack is a set of open-source tools and protocols that enable developers to build and deploy decentralized applications (dapps) on the Ethereum blockchain. Without Remix IDE, developers would have to rely on a combination of command-line tools and text editors, which can be time-consuming and error-prone. With Remix IDE, developers can use a single, unified interface to write and test smart contracts, deploy them to the blockchain, and interact with them in real-time. This makes it much easier to build and maintain dapps on the OP Stack, and allows developers to focus on the logic of their contracts rather than the technical details of deployment. In conclusion, Remix IDE is an essential tool for any developer looking to build and deploy dapps on the OP Stack. It simplifies the development process and provides a range of powerful features that make it easy to write, test, and deploy smart contracts on the Ethereum blockchain.   A link to the project’s GitHub or Twitter:  https://twitter.com/EthereumRemix ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.840136054421769
                },
                {
                    "author_link": "https://gov.optimism.io/u/Saso",
                    "index": "75",
                    "likes": "1",
                    "time": "29/01/2023-15:02:14",
                    "content": "The projects name:Pika Protocol ]( inktr.ee/pikaprotocol) Pika is Decentralized leverage trading on Optimism, up to 100x leverage on crypto and forex with low slippage Believe it will do a lot to Optimism. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/MSilb7",
                    "index": "76",
                    "likes": "4",
                    "time": "29/01/2023-17:34:13",
                    "content": "I work at OP Labs, making these nominations personally Sybil Detection for Airdrop 1 (#1) The following nominations contributed to the second round of sybil detection for Optimism Airdrop #1, which identified 17k addresses and redistributed 14M OP to other recipients (docs). These nominees were not paid or compensated for their contributions.    The projects name: Hop Protocol - Airdrop Repo & Community Sybil Detection Program  A description of how the project has supported development and usage of the OP Stack:  Hop Protocol created a public GitHub repository containing address clusters and metadata labels (i.e. exchange wallet, donation wallet), which were used in their airdrop’s sybil detection (link). They also explained their methodologies on public podcasts (link), and created a community-driven effort to identify additional sybil attackers (link). This information was directly used in the second round of filtering for Optimism Airdrop #1, and helped remove ~2k sybil addresses.   A link to the project’s GitHub or Twitter: GitHub - hop-protocol/hop-airdrop: Hop Airdrop distribution 🐰   (optional) contact info for the project or project lead: https://twitter.com/HopProtocol & https://twitter.com/WhinfreyChris   ",
                    "links": [
                        "https://community.optimism.io/docs/governance/airdrop-1/#additional-sybil-filtering",
                        "https://github.com/hop-protocol/hop-airdrop",
                        "https://www.youtube.com/watch?v=TCzcuRK3RNk&t=1147s",
                        "https://twitter.com/whinfreychris/status/1525178626563420160?lang=en",
                        "https://github.com/hop-protocol/hop-airdrop",
                        "https://twitter.com/HopProtocol",
                        "https://twitter.com/WhinfreyChris"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.7875
                },
                {
                    "author_link": "https://gov.optimism.io/u/MSilb7",
                    "index": "77",
                    "likes": "4",
                    "time": "29/01/2023-17:34:48",
                    "content": "I work at OP Labs, making these nominations personally Sybil Detection for Airdrop 1 (#2) The following nominations contributed to the second round of sybil detection for Optimism Airdrop #1, which identified 17k addresses and redistributed 14M OP to other recipients (docs). These nominees were not paid or compensated for their contributions.    The projects name: raise_exception (rotate.eth)  A description of how the project has supported development and usage of the OP Stack:  We found raise_exception from the Hop Protocol sybil hunting repo, after their huge 97 address report & tweet. raise_exception brought their work over to the Optimism Airdrop #1 list, found additional sybils, and shared their scripts that we could build upon and be more efficient with our work. raise_exception was the most skilled sybil hunter we came across (in my opinion). The scripts directly helped remove ~200 addresses, but they also passed along learnings from their work about the whole sybil industry, which was more valuable (i.e. scripts being sold in project Discords, sybillors bribing and threatening the hunters). Doing the work is not only a public good, but the sybil hunters are putting themselves at public personal risk from the farmers.   A link to the project’s GitHub or Twitter: https://twitter.com/raise_exception & rotate-eth (rotate.eth) · GitHub (work done with us was in private repos)  (optional) contact info for the project or project lead: https://twitter.com/raise_exception   ",
                    "links": [
                        "https://community.optimism.io/docs/governance/airdrop-1/#additional-sybil-filtering",
                        "https://github.com/hop-protocol/hop-airdrop/issues/163",
                        "https://twitter.com/yyy5917/status/1525874721706848256",
                        "https://twitter.com/raise_exception",
                        "https://github.com/rotate-eth",
                        "https://twitter.com/raise_exception"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.854166666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/MSilb7",
                    "index": "78",
                    "likes": "3",
                    "time": "29/01/2023-17:34:58",
                    "content": "I work at OP Labs, making these nominations personally Sybil Detection for Airdrop 1 (#3) The following nominations contributed to the second round of sybil detection for Optimism Airdrop #1, which identified 17k addresses and redistributed 14M OP to other recipients (docs). These nominees were not paid or compensated for their contributions.    The projects name: kavourias   A description of how the project has supported development and usage of the OP Stack: kavourias famously called out the big boy sybillor (600 addresses),  after the initial list for Airdrop #1 was released. This helped galvanize the community effort to do the second round of sybil filtering.   A link to the project’s GitHub or Twitter: https://twitter.com/kavourias   (optional) contact info for the project or project lead: https://twitter.com/kavourias   ",
                    "links": [
                        "https://community.optimism.io/docs/governance/airdrop-1/#additional-sybil-filtering",
                        "https://twitter.com/kavourias/status/1519192669465030657",
                        "https://twitter.com/kavourias",
                        "https://twitter.com/kavourias"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.987500000000001
                },
                {
                    "author_link": "https://gov.optimism.io/u/nhggty",
                    "index": "80",
                    "likes": "4",
                    "time": "29/01/2023-19:32:37",
                    "content": "The project name: Revoke.cash A description of how the project has supported development and usage of the OP Stack: Revoke.cash provides a suite of web3 security tools that enhance the development and usage of the OP Stack. It offers a dashboard for managing token and NFT allowances on Optimism and over 30 other chains. Additionally, the browser extension alerts users of potentially harmful actions, such as approvals or NFT listings, ensuring enhanced security for users of Optimism and supported chains during on-chain transactions and interactions with other apps on Optimism. A link to the project’s GitHub or Twitter:    Revoke.cash    Revoke.cash - Revoke your Ethereum token allowances Take back control of your wallet by revoking allowances you granted in the past.         GitHub    Revoke.cash Revoke.cash has 2 repositories available. Follow their code on GitHub.      Twitter: https://twitter.com/RevokeCash contact info for the project or project lead : https://twitter.com/RoscoKalis ",
                    "links": [
                        "https://revoke.cash",
                        "https://github.com/RevokeCash",
                        "https://github.com/RevokeCash",
                        "https://twitter.com/RevokeCash",
                        "https://twitter.com/RoscoKalis"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/DangerExploit",
                    "index": "81",
                    "likes": "18",
                    "time": "29/01/2023-19:54:34",
                    "content": "Hey guys   The projects name: DefiEdge   A description of how the project has supported development and usage of the OP Stack:  When Uniswap V3 was launched, it brought in capital efficiency but at the cost of easy LPing. LPs had to actively manage their positions, check ranges and add liquidity in different ratios. Enter DefiEdge, it is asset management protocol built on top of Uniswap V3. Currently has 7.3 million TVL and onboarded around 84 million on Uniswap V3   It allows users to create 20+ ranges on Uniswap V3 in single strategy Users can manage any token listed on Uniswap V3, being decentralised, permissionless and decentralised anyone can create and add funds in any strategy It directly interacts with the Uniswap core and does not mint the NFT, this also makes users save 33% in gas and also get ERC 20 tokens as LP tokens unique to every strategy SM can set up limit orders using G-UNI and Chainlink Keepers and create buy sell strategies Strategy can be rebalanced in single click and use 1inch integration to enable minimal slippage while swapping UI is simple and users can also privately manage their funds, farming to add rewards on strategies   A link to the project’s GitHub or Twitter: https://twitter.com/DefiEdge   (optional) contact info for the project or project lead: https://twitter.com/0x_vd   ",
                    "links": [
                        "https://twitter.com/0x_vd"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.430059523809524
                },
                {
                    "author_link": "https://gov.optimism.io/u/logib62714",
                    "index": "83",
                    "likes": "2",
                    "time": "29/01/2023-23:29:17",
                    "content": "  The projects name: Infinity wallet   A description of how the project has supported development and usage of the OP Stack: They support OP in their really unique wallet, which provides a massive range of services and infrastructure. I and a few people I know use Infinity wallet daily to access applications on OP. Also they are the reason I was introduced to OP as prior to them integrating OP I had no clue OP existed or the benefits of it over Ethereum as a L2.   A link to the project’s GitHub or Twitter: https://twitter.com/InfinityWallet   (optional) contact info for the project or project lead: support@infinitywallet.io   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.175
                },
                {
                    "author_link": "https://gov.optimism.io/u/Defi_LATAM_axlvaz",
                    "index": "84",
                    "likes": "6",
                    "time": "30/01/2023-01:22:06",
                    "content": "The projects name : Boardroom A description of how the project has supported development and usage of the OP Stack : Boardroom is a platform that monitors the activity of governance delegates, such as voting power, number of votes, number of tokens delegated, proposals submitted, etc. And it displays all the information in an intuitive way to users, facilitating decision making when delegating or de-delegating votes. They also have integrated governance forum, snapshot and information about Optimsim. Boardroom also provides weekly brief recaps of governance activity, the forum, delegates, proposals, news and governance calls. This recap is posted on the forum:    Governance Weekly Recap 🏛 Governance       Hi all - duncand from Boardroom here   Part of our team’s mission is to increase informed participation in governance, and as a project supporting Optimism voters we thought it would be useful to provide a weekly recap of recent governance activity in the Optimism community. While the Foundation releases a fantastic general weekly recap, we feel a governance-focused summary will be useful for delegates and voters due to the rapid pace of governance news and updates. When appropriate we’ll …     Personal note on Boardroom’s nomination: Boardroom received a grant in phase 1, using 80% in incentives for delegations and 20% to maintain and update the site. These funds, I understand, do not go to the rest of the activities that Boardroom performs that add value to Optimism. Link de Snapshot: https://snapshot.org/#/opcollective.eth/proposal/0x59019f6c2d82b7a2f66d19ef08997a99be48527fcc55b6b597a8be0d270cc5a4 A link to the project’s GitHub or Twitter: Web: https://boardroom.io/ GitHub: Boardroom, Inc. · GitHub Twitter: https://twitter.com/boardroom_info Contact info : Forum user:: @Boardroom ",
                    "links": [
                        "https://boardroom.io/",
                        "https://twitter.com/optimismfnd/status/1560699894280531968?s=21&t=mG0pTSc9C4kNDZVMKh4taw",
                        "https://snapshot.org/#/opcollective.eth/proposal/0x59019f6c2d82b7a2f66d19ef08997a99be48527fcc55b6b597a8be0d270cc5a4",
                        "https://boardroom.io/",
                        "https://github.com/boardroom-inc",
                        "https://twitter.com/boardroom_info"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.761363636363637
                },
                {
                    "author_link": "https://gov.optimism.io/u/not_pr0",
                    "index": "85",
                    "likes": "1",
                    "time": "30/01/2023-08:21:33",
                    "content": "  The projects name Scry Protocol   A description of how the project has supported development and usage of the OP Stack Scry has deployed the Open Oracle Framework, an infrastructure for oracles for developers to access external data in a fully permissionless and decentralized way. The infrastructure allows devs to deploy high scale oracles for any API with the contracts, nodes and front end all ready to use in <15m. This allows devs to create oracles using their own reputable signers in their communities or use a reference oracle by the Scry team to request data to be brought onchain. Optimism is severly underserved by other oracle networks with not even 50 feeds by the largest oracle providers, while Scry enables >200 feed updates with just 1 tx. These feeds also allow new capibilities such as onchain historical lookup for feed values at any timestamp, no code deployment and feed management and custom signer sets that can be updated. New feeds can be deployed in <60s to deployed oracles allowing high-scale data in realtime. Scry allows new use cases such as insurance, financial tools and non financial tools which need external data to be able to deploy to the Optimism network with very little resource requirements and time getting the data there. The factory allows easy oracle deployment by devs without even needing to deploy a contract using hardhat themselves, just a simple etherscan tx, a script and they’re operational. The documenation can be found at Introduction - Scry Protocol Custom Optimism Front End for all oracles to have a front end for data exploration https://optimism.dapp.scry.finance/ The infrastructure is fully decentralized and the ONLY protocol in the space that allows devs to deploy their own oracles and control the oracle and feeds fully using their own security/signers/feed sources, as well as wrapping this into a very simple process to allow for rapid deployment and usability. The deployments have no cost, the node/front end and contracts are all open source. The oracles simply take n signers with t threshold and the oracle returns the med val from n signers that submitted the feed, as long as t signers have submitted for a given slot, the slot being how often the oracle should update. Further grants funds will go towards a reference oracle to allow devs to just request feeds if they do not wish to deploy their own oracle and help serve devs on the fly for data they need, being used for gas to maintain the oracle updates.   A link to the project’s GitHub or Twitter: ScryProtocol · GitHub   (optional) contact info for the project or project lead: PR0#9619 Discord pr0@keychain.me hey@scry.finance   ",
                    "links": [
                        "https://optimism.dapp.scry.finance/",
                        "https://github.com/scryprotocol"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.830612373737374
                },
                {
                    "author_link": "https://gov.optimism.io/u/ppllz",
                    "index": "86",
                    "likes": "1",
                    "time": "30/01/2023-08:45:35",
                    "content": "I am nominating this awesome project called: Revokecash.   The project’s name: Revokecash  A description of how the project has supported development and usage of the OP Stack:  Take Back Control of Your Wallet. Revoke.cash is a suite of web3 security tools. It offers a dashboard to manage token and NFT allowances on Optimism and 30+ other chains. It also provides a browser extension that warns users when they are about to perform potentially harmful actions, such as approvals or NFT listings. Users of Optimism and other supported chains benefit from greater security while interacting with other Optimism-based applications and transacting on-chain thanks to the provision of these services.   A link to the project’s GitHub or Twitter:  Github: Revoke.cash · GitHub  Twitter: https://twitter.com/RevokeCash     (optional) contact info for the project or project lead:  ",
                    "links": [
                        "https://twitter.com/RevokeCash"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.7125
                },
                {
                    "author_link": "https://gov.optimism.io/u/vwtao.eth",
                    "index": "87",
                    "likes": "2",
                    "time": "30/01/2023-09:22:04",
                    "content": "  The projects name: Blockscout   A description of how the project has supported development and usage of the OP Stack: Blockscout is an open source block explorer for EVM chains, that supports the Optimism Ecosystem (Bedrock, Goerli, and even OP Craft) as well as Optimism on Gnosis Chain. As a newer project to the EVM block explorer space, they have been quick to take feedback and differentiate themselves from more prevalently used block explorers.   A link to the project’s GitHub or Twitter: https://twitter.com/blockscoutcom   ** ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.388888888888888
                },
                {
                    "author_link": "https://gov.optimism.io/u/BP2023",
                    "index": "88",
                    "likes": "2",
                    "time": "30/01/2023-10:56:00",
                    "content": "  This project is called Blockpour. (app.blockpour.com)   This project provides real-time & historical data into the Optimism network and all tokens created and traded on the network. Blockpour indexes trades, liquidity actions, network TVL, total trade count, and much more for both retail traders on our platform, as well crypto-native businesses or institutions that need visibility into Optimism’s DeFi ecosystem through our comprehensive API.   Twitter: @Blockpour   Contact Info: jay@blockpour.com.   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/neiman",
                    "index": "89",
                    "likes": "3",
                    "time": "30/01/2023-12:01:48",
                    "content": " The projects name: Esteroids (esteroids.eth)  A description of how the project has supported the development and usage of the OP Stack. Esteroids (esteroids.eth) is a search engine for .eth websites. It indexes all the ENS+IPFS websites (also called .eth websites), make them searchable in esteroids.eth, and highlights the main ones. Esteroids is a useful tool to discover dApps with a .eth website interface built on top of Optimism. Every Optimism dApp using a decentralized website as an interface is indexed by Esteroids. So far Esteroids was the only place to track and collect them all. Additionally, Esteroids was leading the .eth websites subgroup in ENS DAO in Q1-Q4 2022.  GitHub  Twitter.  Contact info. email at contact@esteroids.xyz or on Twitter ",
                    "links": [
                        "https://esteroids.eth.limo",
                        "https://github.com/Esteroids/",
                        "https://twitter.com/e_steroids",
                        "https://twitter.com/e_steroids"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.066666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/CipherSovereign",
                    "index": "90",
                    "likes": "3",
                    "time": "30/01/2023-12:21:55",
                    "content": "  The projects name: Revoke.cash  A description of how the project has supported development and usage of the OP Stack:  Current crypto wallet UX leaves much to be desired. One of many problems in the space is contract approvals which remain in effect even after a user has made their desired transaction. While this project isn’t OP-specific I believe it has supported usage in a roundabout way by allowing users on transact more safely. Would love to see more projects like this making it easier and safer for users to use Web3.   A link to the project’s GitHub or Twitter:  GitHub - RevokeCash/revoke.cash: ❌ Revoke or update your token allowances https://twitter.com/RevokeCash    Disclaimer: I am employed by the OP Labs. These are my personal opinions, not those of the PBC. ",
                    "links": [
                        "https://twitter.com/RevokeCash"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.6875
                },
                {
                    "author_link": "https://gov.optimism.io/u/mark1121",
                    "index": "91",
                    "likes": "2",
                    "time": "30/01/2023-15:25:19",
                    "content": "  The projects name: PoolTogether(https://pooltogether.com/)   A description of how the project has supported development and usage of the OP Stack: PoolTogether is one of most interesting protocol i think.Because of this mechanism.No one lose,and everyone have chance to win million prize.They yield deposits other Defi and generated prize.I like this idea.If you have small assets, you have to small benefit.But this protocol,you have chance to get million in this protocol.This is so Nice!!   A link to the project’s GitHub or Twitter:twitter(https://twitter.com/PoolTogether_)   ",
                    "links": [
                        "https://twitter.com/PoolTogether_"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.508928571428571
                },
                {
                    "author_link": "https://gov.optimism.io/u/TonyTotolwo",
                    "index": "92",
                    "likes": "3",
                    "time": "30/01/2023-15:31:10",
                    "content": "Project name: Gnosis safe A description of how the project has supported development and usage of the OP Stack A shared wallet  that  ethereum communities can use to store eth based tokens and nfts. Not just a tool like metamask, it is used  by multiple people. For funds to be sent out of the wallet it will need confirmations from the owners, for example if the are three owners, three confirmations need to passed. A link to the project’s GitHub or Twitter Twitter: @gnosisSafe Github: safe-global ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/Kethic",
                    "index": "93",
                    "likes": "8",
                    "time": "30/01/2023-15:54:47",
                    "content": "Project Name Candide Wallet Description ERC-4337 based wallet with social recovery methods and Paymaster-based ERC-20 gas payment option. Links  candidewallet.com    Candide Wallet CANDIDE is an open source wallet built for the Ethereum Public Good         docs.candidewallet.com   CANDIDE Docs Docs | CANDIDE Docs CANDIDE wallet is a smart contract wallet that providers programmable accounts for end-users on Ethereum         GitHub    Candide Labs Candide Labs has 8 repositories available. Follow their code on GitHub.      https://twitter.com/candidewallet Contact Core Team in Discord: CANDIDE Disclaimers Project is built on contributions from Infinitism, but is independant. ",
                    "links": [
                        "https://www.candidewallet.com/",
                        "https://docs.candidewallet.com/",
                        "https://docs.candidewallet.com/",
                        "https://github.com/candidelabs",
                        "https://github.com/candidelabs",
                        "https://twitter.com/candidewallet",
                        "http://discord.gg/7q6JAmJdjz"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.1230158730158735
                },
                {
                    "author_link": "https://gov.optimism.io/u/Vegayp",
                    "index": "94",
                    "likes": "1",
                    "time": "30/01/2023-16:53:49",
                    "content": "The project’s name: dm3 - a protocol for interoperable web3 messaging. A description of how the project has supported the development and usage of the OP Stack: With the dm3 protocol, we provide a web3-based messaging protocol focused on end-2-end encryption, decentralisation, scalability, and interoperability. The main features of the dm3 protocol are:  to initiate a ‘central’ registry (utilising ENS) for the information necessary for secure communication, such as public keys for encryption and signatures, and delivery information, and to enable a decentralised and scalable network of independent self-sovereign delivery service nodes.  Currently, Optimism has counted several projects focused on social or messaging interactions: Alchemy, Atlantis World, Etherscan, Gnosis Safe, Nansen, Zerion and counting. With the Interoperability Initiative we are committed to enabling the secure exchange of messages between different protocols, services, and applications using the dm3 protocol to enable an interoperable web3 messaging ecosystem, but also to integrate communication registry information sources like other chains and services, and especially in the Optimism ecosystem. With freely usable components (dm3 embedded widgets, open-sourced under BSD license), dApps can easily integrate messaging functionality with minimal effort (e.g. in-dApp communication, support channels, etc). Optimism can now be ideally used to publish dm3 communication profiles so that users of dApps can communicate with users of any dm3-compatible application or service. The dm3 protocol as a Public Good welcomes any participant of the messaging and social ecosystem to integrate with the dm3 interoperability initiative, and by doing so, also integrates with the Optimism Ecosystem. In conclusion, we built an open standard for messaging and we are bringing it to Optimism. A link to the project’s GitHub, Twitter, and website: You can find our open source project at github (specification and reference implementation) and on twitter at @dm3protocol. The website with more information on the dm3 interoperability initiative and dm3 embedded components, incl. the working reference implementation can be accessed at www.dm3.network. Contact info for the project or project lead: Our technical lead is Steffen Kux (@stkux on Telegram, steffen@dm3.network via email) Thanks for reading about our protocol! ",
                    "links": [
                        "https://github.com/corpus-io/dm3"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.802083333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/MSilb7",
                    "index": "95",
                    "likes": "3",
                    "time": "30/01/2023-17:20:46",
                    "content": "  The projects name: ethereum-etl package  A description of how the project has supported development and usage of the OP Stack: ethereum-etl is an open-source Python package where you can insert an rpc and a block range, then extract transaction data for any EVM chain. I’ve personally used this for pulling data from chains that aren’t yet supported in any major provider.  This is also the infrastructure behind Google BigQuery’s ethereum datasets.   A link to the project’s GitHub or Twitter: GitHub - blockchain-etl/ethereum-etl: Python scripts for ETL (extract, transform and load) jobs for Ethereum blocks, transactions, ERC20 / ERC721 tokens, transfers, receipts, logs, contracts, internal transactions. Data is available in Google BigQuery https://goo.gl/oY5BCQ   (optional) contact info for the project or project lead: TG group linked in Github.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0625
                },
                {
                    "author_link": "https://gov.optimism.io/u/letmehear",
                    "index": "96",
                    "likes": "3",
                    "time": "30/01/2023-17:35:57",
                    "content": " The projects name: optinames.eth.limo ]( Optinames | ENS on Optimism) Optinames are tradable and transferable sub-domains wrapped as ERC721s & fully integrated with the Ethereum Name Service (ENS). They can be resolved on L1 Ethereum by utilizing an off-chain resolver. optinames.eth.limo ]( Optinames | ENS on Optimism) What We Do:  This project is leading the charge in making it easier & cheaper to acquire and utilize ens domains. We are implementing the latest technologies released by the ENS team (CCIP Read & Off-chain resolution) to make it possible for users to register subdomains on Optimism while making them available & resolvable on L1 Ethereum. In addition to providing free ENS subdomain on Optimism (currently ecc.eth), OptiNames is partnering with NFT projects & gaming communities building their games on any Layer 2. These communities will be utilizing our tech and smart contracts to provide free usernames & gamer-tags that double up as ENS subdomains. Important Links: Github: GitHub - stevegachau/optimismresolver: ENS Subdomains on EVM chains Off-chain Resolver on L1 - OffchainResolver | Address 0x9fb848300e736075ed568147259bf8a8eefe4fef | Etherscan Subdomain NFTs on Optimism - Contract Address 0x9fb848300e736075ed568147259bf8a8eefe4fef | Optimism Subdomain Example on ENS App - ENS App Twitter : @OptiNames GitHub : stevegachau  ",
                    "links": [
                        "https://optinames.eth.limo",
                        "https://github.com/stevegachau/optimismresolver",
                        "https://etherscan.io/address/0x9fb848300e736075ed568147259bf8a8eefe4fef#code",
                        "https://optimistic.etherscan.io/address/0x9fb848300e736075ed568147259bf8a8eefe4fef#code",
                        "https://app.ens.domains/name/nick.ecc.eth/details",
                        "https://twitter.com/OptiNames",
                        "https://github.com/stevegachau"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.285714285714286
                },
                {
                    "author_link": "https://gov.optimism.io/u/jordan.eth",
                    "index": "97",
                    "likes": "2",
                    "time": "30/01/2023-17:57:50",
                    "content": "  Project Name: Frame   Description: Frame is an open-source EVM wallet and web3 platform that ships Optimism as one of the default chains for easy access. Frame’s new Omnichain UX enables users to operate across multiple chains simultaneously, without the need to switch chains. We think is a significant step forward and plan to continue removing barriers for multi-chain users to make their experience more seamless. With Optimism paving the way, we’re eager to continue supporting the needs of the OP Stack and users in this ecosystem. We look forward to building this omnichain future with you.    Links: Github, Twitter: @0xFrame   ",
                    "links": [
                        "https://github.com/floating/frame"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.121685606060606
                },
                {
                    "author_link": "https://gov.optimism.io/u/zfran",
                    "index": "98",
                    "likes": "4",
                    "time": "30/01/2023-18:07:59",
                    "content": " Project name Hardhat  A description of how the project has supported development and usage of the OP Stack Hardhat is the most popular Solidity development environment across all EVM networks and is used by the majority of Ethereum developers. Optimism has directly benefited in at least three different ways: 1. Direct use by the Optimism team to build Optimism itself, including contracts and testing infrastructure This is visible on Github. The Optimism team also built internal Hardhat utilities to interact with the protocol. 2. Hardhat plugins by the Optimism team for the community to be able to build and test early on Hardhat is designed as a platform for developer tooling to be built on top, which allowed the Optimism team to build different utilities and plugins that made it compatible with Optimism early on when the tech had more discrepancies with Ethereum than today. Hardhat was leveraged to bootstrap Optimism as it was initially the only dev tool available to build on Optimism. The team directly built two plugins for this purpose:   @eth-optimism/plugins/hardhat/compiler. Integrated Optimism’s custom compiler at the time. Now a legacy component.  @eth-optimism/plugins/hardhat/ethers. Integrated Optimism’s ethers.js fork. Now a legacy component.  In addition, they also built Smock on top of Hardhat for internal use, which is now community-driven and heavily used for mocking across the wider ecosystem. 3. Usage by the Optimism community to build smart contracts that run on Optimism Many developers use Hardhat to build the apps and contracts that they run on Optimism. The widely-used and officially maintained hardhat-etherscan plugin also supports Optimism directly. Github and Twitter   GitHub    GitHub - NomicFoundation/hardhat: Hardhat is a development environment to... Hardhat is a development environment to compile, deploy, test, and debug your Ethereum software. Get Solidity stack traces & console.log. - GitHub - NomicFoundation/hardhat: Hardhat is a develo...       Twitter @HardhatHQ Project contact point Twitter @zfran p.s.: there are links available for all of the things mentioned above, but only two links are allowed for new users. ",
                    "links": [
                        "https://github.com/nomicfoundation/hardhat",
                        "https://github.com/nomicfoundation/hardhat"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.898268398268398
                },
                {
                    "author_link": "https://gov.optimism.io/u/wcc",
                    "index": "99",
                    "likes": "4",
                    "time": "30/01/2023-18:20:33",
                    "content": "Project name:  Zapper Description of how the project has supported development and usage of the OP Stack:   Providing a monitoring tool for users to track wallet balances on OP which is now opensourced for every developer to self-integrate into Zapper dashboard through Zapper studio. This will give more flexibility for each protocol to individually update their tracking method on Zapper, and also a chance for unreputable projects/protocols to be trackable on the dashboard.   Developing an exploring tool in a variety of aspects including DeFi, NFT and DAO (which is rarely seen in the space so far). For non-technical person, this will eliminate the needs of block explorer which is the big adoption obstacle due to readability by replacing with layman term explanation and visualization in a simplified format.   Enhancing user experience through curated mobile app supporting both iOS and Andriod. This will serve alternative ways of tracking, and significantly support onboarding users to the space.   Link to the project’s GitHub or Twitter:  Website: https://zapper.xyz/  Twitter: https://twitter.com/zapper_fi  Zapper studio: GitHub - Zapper-fi/studio: Zapper App Integrations   ",
                    "links": [
                        "https://zapper.xyz/dashboard",
                        "https://studio.zapper.fi/",
                        "https://zapper.xyz/apps?network=optimism",
                        "https://zapper.xyz/nft?network=optimism",
                        "https://zapper.xyz/daos",
                        "https://apps.apple.com/us/app/zapper-your-home-to-web3/id1573293010",
                        "https://play.google.com/store/apps/details?id=com.zapper&pli=1",
                        "https://zapper.xyz/",
                        "https://twitter.com/zapper_fi",
                        "https://github.com/Zapper-fi/studio"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.875
                },
                {
                    "author_link": "https://gov.optimism.io/u/Justina",
                    "index": "100",
                    "likes": "1",
                    "time": "30/01/2023-19:11:56",
                    "content": "The projects name: Praise A description of how the project has supported the development and usage of the OP Stack: Praise is an open-source comprehensive community intelligence tool. Praise is designed to be a reputation and rewards system in order to help communities create a more engaging online environment. Praise allows community members to acknowledge each other’s contributions and practice gratitude by “praising” peers. This bottom-up approach values peer recognition, keeping the community engaged and invested while promoting a more positive and productive online community. Praise gives active builders more influence and power within the organization, which is an important consideration in building a strong and sustainable community. The Praise system is user-generated data, trustworthy, and ungameable. Praise will help not only benefit optimism but the broader web3 ecosystem to acknowledge who is doing what and create different features to use this information which we call community intelligence.  Reputation token minter, could potentially be integrated for governance as a second governance token AI integration to know your community better (Ask me anything) 1 click Self-deployment Upgrade reports exports and analytics (community health, contributions etc.) NFT reputation badge minter Praise decentralization by using Ceramic  A link to the project’s GitHub or Twitter: Github Twitter  @givepraise Website Contact info for the project or project lead: Discord: Justina #9145 Telegram: JustinaSvi ",
                    "links": [
                        "https://givepraise.xyz/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.1436688311688314
                },
                {
                    "author_link": "https://gov.optimism.io/u/arabianhorses",
                    "index": "101",
                    "likes": "1",
                    "time": "30/01/2023-19:17:57",
                    "content": "Project Name: Clique A description of how the project has supported the development and usage of the OP Stack: Clique is building identity oracles that connect web2 user behavior data with web3 applications. It was one of the first projects to make Clique AttestionStation available. (others are ‘sbvegan’ and ‘Flipside’ have already been nominated)  About the impact: There is 67k transactions through AttestionStation contract (until 28th of January) and 38k of them are made through Flipside’s contract, 27k of them are made through Clique’s Contract. About the Profit: I couldn’t find any trace about a payment that come from Optimism, but Clique already has some sponsors and They have raised 3 million in their funding series. Here is a DUNE query which shows number of attestion txns through Clique Links Clique Web-Site Twitter Discord ",
                    "links": [
                        "https://provenance.clique.social/",
                        "https://twitter.com/Clique2046",
                        "https://discord.gg/mfG4dGWy7v"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.625
                },
                {
                    "author_link": "https://gov.optimism.io/u/Zeptimus",
                    "index": "102",
                    "likes": "2",
                    "time": "30/01/2023-19:44:57",
                    "content": "The projects name: Pairwise A description of how the project has supported development and usage of the OP Stack: Pairwise is a novel voting pattern and dapp that makes it easy and fun for web3 communities to signal their preferences. If this project can be well funded, it will enable much greater engagement for web3 communities across the ecosystem. Pairwise aims to make it easier for Web3 communities to signal their preferences and make informed decisions. Pairwise is designed to be user-friendly and intuitive, like a dating app, allowing users to choose between pairs of options to signal their preferences as opposed to having to read endless forum posts and vote within a set time period. The system converts these simple subjective inputs into objective, measurable outputs, minimizing the cost and cognitive burden of voting. The goal of the project is to promote greater community engagement in DAO’s decision-making processes. But not only can Pairwise be used for governance with different snapshot strategies, but Pairwise can also be used to allocate budgets based on community signaling. And that’s just the beginning - we can’t wait to see how the community will discover and utilize all of the potential use cases for this tool. A link to the project’s GitHub or Twitter: Github  Website (currently deployed as a subdomain) Contact info for the project or project lead: Discord: Zeptimus#3359 Twitter: @zeptimusQ ",
                    "links": [
                        "https://github.com/GeneralMagicio/budget-boxes",
                        "https://pairwise.generalmagic.io/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.731060606060606
                },
                {
                    "author_link": "https://gov.optimism.io/u/MSilb7",
                    "index": "103",
                    "likes": "2",
                    "time": "30/01/2023-20:15:53",
                    "content": "Nominating Data Analysts who made notable contributions to making Optimism data easily accessible (#1)    The projects name: perpetual.trades Dune abstraction (rplust & drethereum)  A description of how the project has supported development and usage of the OP Stack:  Rob (rplust) was the primary builder behind the perpetual.trades table in Dune. This aggregates perpetuals dexs (Perpetual Protocol, Pika Protocol, Synthetix Futures) in to a standardized table, so that anyone can easily analyze the data. Rob jumped on this idea after it was floated in the Optimism #analytics Discord, and connected with drethereum (who built a Synthetix Futures dashboard) to work through methodology and design. Abstractions/spells like this make analysts lives 10x easier, since you don’t have to go through each protocol’s docs, test transactions, try to understand event logs, etc. You just query perpetuals.trades and you’re golden. Any analyst can now easily query pereptuals dexs on Optimism, and analysts covering perpetuals on other chains (GMX on Arbitrum) have chosen to adopt and build on this structure.   A link to the project’s GitHub or Twitter:   spellbook/perpetual_trades.sql at main · duneanalytics/spellbook · GitHub (note that most of the work is in other folders relating to each model shown) Dashboard using the abstraction: Perpetuals Trading on Optimism     (optional) contact info for the project or project lead: https://twitter.com/robplust, https://twitter.com/dr_ethereum   I work at OP Labs, but making this nomination personally ",
                    "links": [
                        "https://github.com/duneanalytics/spellbook/blob/main/models/perpetual/perpetual_trades.sql",
                        "https://dune.com/rplust/Perpetuals-Trading-on-Optimism",
                        "https://twitter.com/robplust",
                        "https://twitter.com/dr_ethereum"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.024305555555555
                },
                {
                    "author_link": "https://gov.optimism.io/u/Cotabe",
                    "index": "104",
                    "likes": "2",
                    "time": "30/01/2023-20:17:32",
                    "content": "  The projects name: Giveth   A description of how the project has supported development and usage of the OP Stack:   The token that Optimism uses is actually a fork of the Minime token, which Giveth open sourced in 2016. The MiniMe Token: Open Sourced by Giveth | by Griff Green | Giveth | Medium Giveth ran the ScalingNow Conference and Youtube interview series in 2018 at cost, with no sponsors. In the interview series they highlighted the teams scaling ethereum at the time while rollups were just a gleam in Karl’s eye. At the conference everyone got to meet each other and share ideas in person. ScalingNOW! Summit Transcript. The ScalingNOW! Summit was an in-person… | by Alexandra Heller | Giveth | Medium Giveth is a nonprofit that relies mainly on donations. They have never received investments or even large-size grants. The grant will be used to keep building solutions to fund public goods in Optimism by adding it to Giveth DApp so projects can collect donations on Optimism. A small grant would allow projects using Optimism chain to get donations on Giveth DApp, and with a larger grant, the projects could also be rewarded through the GIVbacks program. The idea is described on a forum post here: gov. optimism. io/t/draft-gf-phase-1-proposal-giveth-cycle-10/3735 (I couldn’t add more links, so take out the spaces there) A link to the project’s GitHub or Twitter: -github.com/Giveth twitter: @Givethio (optional) contact info for the project or project lead: TG: @ griffgreen TW: @ thegrifft ",
                    "links": [
                        "https://medium.com/giveth/scalingnow-summit-transcript-ea5373be8523"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.010677083333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/stas",
                    "index": "105",
                    "likes": "2",
                    "time": "30/01/2023-20:27:51",
                    "content": "I’m part of Velodrome Finance team, and I’m the author of Sugar.  Sugar: makes Velodrome devs life sweeter Sugar was born as the need to unify the 10+ contracts handling Velodrome into an easy to use interface with full access to the normalized dataset representing the real-time state of our protocol. This massively reduced our RPC costs and improved our V2 UI/UX. It reduced the development time and maintenance, and allowed to onboard partners into protocol mechanics with minimal effort. On the smart-contract development side, it exposed ABI design issues and performance optimizations opportunities. On the infrastructure side, it exposed issues where Vyper support on optimism can be improved and issues with it on optimistic.etherscan.io which we reported back to the OP team. Sugar is also new, I haven’t seen anything like it done before and the reason I’d like to highlight it is mainly for educational purposes. Developers are free to use it to integrate Velodrome liquidity pool data and even historical emissions, veNFT status and available rewards or just display the voting distribution. I believe OP Stack could benefit a lot from good UI/UX and we should strive to achieve that without Web2 solutions  Github: GitHub - velodrome-finance/sugar: Sugar makes Velodrome devs life sweeter 🍭 ",
                    "links": [
                        "https://github.com/velodrome-finance/sugar/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.140151515151516
                },
                {
                    "author_link": "https://gov.optimism.io/u/MSilb7",
                    "index": "106",
                    "likes": "4",
                    "time": "30/01/2023-20:29:54",
                    "content": "Nominating Data Analysts who made notable contributions to making Optimism data easily accessible (#2)    The projects name: hildobby (Optimism Dashboards & NFT Wash Trading Logic)  A description of how the project has supported development and usage of the OP Stack:  Among the many public utility dashboards Hildobby has made, they built the canonical Optimism DEX dashboard (some data is blank to due in-progress migrations to Dune v2), and a dashboard covering OP Airdrop #1. They’ve also been the industry leader in NFT Wash Trading research, after incentive programs from upstart marketplaces led to inorganic volumes. This work was eventually documented, made easily accessible via a Dune abstraction, and trackable on a dashboard. Now now any analyst who reports NFT volumes in Ethereum can filter out wash traded volume (currently on L1, and we’re adopting it on Optimism). See Blog Post: NFT Wash Trading on Ethereum This kind of work to filter out the “fake” activity from on-chain data is hugely impactful to start to understand “real” usage, and make decisions that actually push the space forward vs optimize for vanity.   A link to the project’s GitHub or Twitter: @hildobby, hildobby · GitHub   (optional) contact info for the project or project lead: https://twitter.com/hildobby_   I work at OP Labs, but making this nomination personally ",
                    "links": [
                        "https://dune.com/hildobby/optimism-dexs",
                        "https://dune.com/hildobby/op-airdrop",
                        "https://dune.com/hildobby/LooksRare-VS-OpenSea",
                        "https://community.dune.com/blog/nft-wash-trading-on-ethereum",
                        "https://github.com/duneanalytics/spellbook/blob/main/models/nft/nft_wash_trades.sql",
                        "https://dune.com/hildobby/nfts-wash-trading",
                        "https://community.dune.com/blog/nft-wash-trading-on-ethereum",
                        "https://dune.com/hildobby",
                        "https://github.com/hildobby",
                        "https://twitter.com/hildobby_"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.830357142857143
                },
                {
                    "author_link": "https://gov.optimism.io/u/MSilb7",
                    "index": "107",
                    "likes": "3",
                    "time": "30/01/2023-20:35:33",
                    "content": "Nominating Data Analysts who made notable contributions to making Optimism data easily accessible (#3)    The projects name: MarcoV (Optimism Dashboards)  A description of how the project has supported development and usage of the OP Stack:  Marco is a prolific Dune wizard. He’s also built many popular Optimism dashboards, including a general overview, Airdrop #1 , and Velodrome Metrics. Outside of dashboards created by Optimism FND & OP Labs, Marco’s Optimism dashboards are likely linked to and referenced the most. Creators building public & free dashboards is valuable for visibility and transparency throughout the Optimism ecosystem.   A link to the project’s GitHub or Twitter: @Marcov   (optional) contact info for the project or project lead: https://twitter.com/marcov_91   I work at OP Labs, but making this nomination personally ",
                    "links": [
                        "https://dune.com/Marcov/OP-Optimism",
                        "https://dune.com/Marcov/velodrome-finance",
                        "https://dune.com/Marcov",
                        "https://twitter.com/marcov_91"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.329545454545454
                },
                {
                    "author_link": "https://gov.optimism.io/u/MSilb7",
                    "index": "108",
                    "likes": "3",
                    "time": "30/01/2023-20:41:38",
                    "content": "Nominating Data Analysts who made notable contributions to making Optimism data easily accessible (#4)    The projects name: Springzhang (Optimism Dashboards)  A description of how the project has supported development and usage of the OP Stack:  Springzhang is another prolific Dune wizard. Most notably, they built what is likely the most viewed dashboard tracking Optimism Quests v1. Other creations include Iron Bank liquidity mining, OP Airdrop #1, and Uniswap Liquidity Mining (prize winner from UniswapFND). As mentioned prior, creators building public & free dashboards is valuable for visibility and transparency throughout the Optimism ecosystem.   A link to the project’s GitHub or Twitter: @springzhang   (optional) contact info for the project or project lead: https://twitter.com/superamscom   I work at OP Labs, but making this nomination personally ",
                    "links": [
                        "https://dune.com/springzhang/ironbank-liquidity-incentives-on-optimism",
                        "https://dune.com/springzhang/optimism-airdrop-1-all-in-one",
                        "https://dune.com/springzhang/uniswap-optimism-liquidity-mining-program-performance",
                        "https://twitter.com/fedeebasta/status/1597980572957421568",
                        "https://dune.com/springzhang",
                        "https://twitter.com/superamscom"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.204545454545455
                },
                {
                    "author_link": "https://gov.optimism.io/u/MSilb7",
                    "index": "110",
                    "likes": "4",
                    "time": "30/01/2023-21:56:39",
                    "content": "  The projects name: Pandas   A description of how the project has supported development and usage of the OP Stack: Pandas is a free and open-source package and my go to package for doing any kind of data analysis & manipulation in Python. It describes itself as “Flexible and powerful data analysis / manipulation library for Python, providing labeled data structures similar to R data.frame objects, statistical functions, and much more.” I joked recently that “I don’t know how to use python without pandas.” Pandas is   A link to the project’s GitHub or Twitter:  pandas · GitHub   (optional) contact info for the project or project lead:   I work at OP Labs, but making this nomination personally ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.285714285714286
                },
                {
                    "author_link": "https://gov.optimism.io/u/wminshew",
                    "index": "111",
                    "likes": "5",
                    "time": "30/01/2023-23:10:16",
                    "content": "The projects name: 0xSplits A description of how the project has supported development and usage of the OP Stack: 0xSplits is a suite of smart contracts & tools that allows devs and end users to securely and efficiently share onchain revenue. The open source & free-to-use contracts have distributed over $25M across 4K+ unique accounts on various chains including Optimism. It’s quickly becoming the secure standard for creators, devs, artists, DAOs, hobbyists and all newcomers Optimism to share upside on the value they produce. A link to the project’s GitHub or Twitter: twitter, github (optional) contact info for the project or project lead: will at 0xsplits.xyz ",
                    "links": [
                        "https://github.com/0xSplits"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.149553571428572
                },
                {
                    "author_link": "https://gov.optimism.io/u/kevin",
                    "index": "112",
                    "likes": "2",
                    "time": "31/01/2023-01:44:34",
                    "content": "Project Name Ankr Description Ankr provides free, public RPC endpoints for developers to easily access Optimism Mainnet and Optimism Goerli.  To quote one builder on Optimism Mainnet: “I switched my users to the Ankr public RPC and it worked far faster and without rate limiting - much better than https://mainnet.optimism.io”. At OP Labs we maintain and operate our own public RPC endpoints (https://mainnet.optimism.io and https://goerli.optimism.io) as a public good. Our team knows first-hand the cost, time, and effort required to keep nodes up and stable to scalably serve RPC requests. Even with the effort and capital we’ve put towards hosting our own public endpoints as a public good, I’ve heard from multiple builders that the free, publicly accessible Ankr endpoint enables more requests before rate limiting while remaining fast and stable. Unlike other RPC providers, Ankr doesn’t require an email signup or API key to start using its services, resulting in a seamless experience for developers to start developing on Optimism Goerli and Optimism Mainnet. Based on Ankr’s self-reported data, the endpoints average 1.4k requests/sec, with over 3.7 billion requests in the past 30 days. Links  Ankr Ankr Optimism Free-tier product  Contact  Ankr on Twitter   Disclaimers I work for OP Labs. I am making this nomination in my capacity as an individual and not on behalf of OP Labs. ",
                    "links": [
                        "https://mainnet.optimism.io",
                        "https://mainnet.optimism.io",
                        "https://goerli.optimism.io",
                        "https://www.ankr.com/",
                        "https://www.ankr.com/rpc/optimism",
                        "https://twitter.com/ankr"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.016666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/yanyan",
                    "index": "113",
                    "likes": "2",
                    "time": "31/01/2023-03:03:26",
                    "content": "Project name: Onlyfun Project description of how to support the development and use of the DP stack: Onlyfun is a platform with multiple blockchain collections for innovative blockchain social projects, advanced knowledge sharing and communication. Each user can open different types of cliques to writting, and show their opinions and ideas, and gain benefits through the fan economy. Fans can support their creation by paying the corresponding value to subscribe to their favourite content and giving their favourite clique with tokens such as OP, ETH, DAI and others as tips. Onlyfun apply the latest Web3 technology, enabling users to enter the blockchain world at zero cost, zero gas, and zero perception. Onlyfun think that knowledge and thought should be free, all people can be more flexible, easier to access and communicate. Onlyfun has been trying to provide a better way and experience for people to exchange and collision of knowledge and ideas. Project name: Onlyfun Project description of how to support the development and use of the DP stack: Onlyfun is a platform with multiple blockchain collections for innovative blockchain social projects, advanced knowledge sharing and communication. Each user can open different types of cliques to writting, and show their opinions and ideas, and gain benefits through the fan economy. Fans can support their creation by paying the corresponding value to subscribe to their favourite content and giving their favourite clique with tokens such as OP, ETH, DAI and others as tips. Onlyfun apply the latest Web3 technology, enabling users to enter the blockchain world at zero cost, zero gas, and zero perception. Onlyfun think that knowledge and thought should be free, all people can be more flexible, easier to access and communicate. Onlyfun has been trying to provide a better way and experience for people to exchange and collision of knowledge and ideas.   A link to the project’s Website or Github:   Website: https://onlyfun.city (twitter and email address are all on the website)   Github: GitHub - onlyfun2023/onlyfun   ",
                    "links": [
                        "https://github.com/onlyfun2023/onlyfun"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.287878787878788
                },
                {
                    "author_link": "https://gov.optimism.io/u/distractionboy",
                    "index": "114",
                    "likes": "6",
                    "time": "31/01/2023-03:49:58",
                    "content": "  The projects name: Hyperdrive NFT Marketplace  A description of how the project has supported development and usage of the OP Stack: With the shutting down of Quix, thousands of NFT Creators are left without a marketplace that they can call home. Hyperdrive is a completely open source NFT marketplace in its early stages, and is being built by me @distractionboy - the co-founder of OP Bunnies and OptiChads and the dev who helped add OP to Collab Land, @Dicaso representing NFT Creators, @jasonfactor.eth who heard me talking about the unique vision and immediately became a contributor, Daru a very talented designer, and more and the team is growing! Its goal is to create a self-sustaining marketplace focused on the artists and engineers that bring life to their favorite chain.  We have a few Creators on-board that have unique needs like gaming NFTs, quests posted often, and social media highlights, that will be giving us incremental feedback and direction over the project’s duration so we make sure we stay in tune with the community’s needs. If you are a collection owner with a unique idea and/or would like to be a part of Hyperdrive, please reach out!   More on our background, vision, and tech plans can be seen here: https://hd-one.vercel.app/funding   It is a goal of ours that other apps can easily integrate their tools and services with our marketplace (like Bluesweep, Attestation Station, and others)   Customizable Creator Pages, Multi-lingual, Built by OG Pioneers of OP, Bulk Transactions, Intuitive UI,   A link to the project’s GitHub or Twitter: GitHub - Hyperdrive-go/hd: open sourced and creator-focused NFT tech https://twitter.com/HyperdriveL2   (optional) contact info for the project or project lead: @DistractionBoy_   ",
                    "links": [
                        "https://hd-one.vercel.app/funding",
                        "https://github.com/Hyperdrive-go/hd",
                        "https://twitter.com/HyperdriveL2",
                        "https://twitter.com/DistractionBoy_"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.276429738562092
                },
                {
                    "author_link": "https://gov.optimism.io/u/0xngmi",
                    "index": "115",
                    "likes": "4",
                    "time": "31/01/2023-03:57:55",
                    "content": "  The projects name: hardhat-deploy  A description of how the project has supported development and usage of the OP Stack: A useful tool when deploying contracts  A link to the project’s GitHub or Twitter: GitHub - wighawag/hardhat-deploy: hardhat deployment plugin   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/0xWeston",
                    "index": "116",
                    "likes": "44",
                    "time": "31/01/2023-06:37:35",
                    "content": "Greetings all! I would like to nominate 2 individuals and 1 project for tooling and utilities. The project: NFTEarth A description of how the project has supported development and usage of the OP Stack: In just a couple short weeks, NFTEarth has created the foundations for bringing NFT momentum back to Optimism and in a sustainable manner. The team is scaling globally and building a large community of already over 7,000 members in Discord. The new project has already launched an NFT collection that has been traded in relatively high volume, and also led to the minting of thousands of new NFTs on Optimism, helping to kick-start NFT traction again! The goal of NFTEarth is to create a globally  accessible NFT hub for NFT creators, collectors, and DAOs to build NFTs, have educational resources for them, and a community to be a part of - that brings all the fragmented NFT tooling and services under one roof. The first network for NFTEarth is on Optimism with trades already having been completed, process of indexing all historical on-chain NFT data is nearly complete. The team is in talks with multiple infrastructure providers and L1 NFT collections working to bring their support to Optimism, and has tentatively agreed on moving forward with one infrastructure provider, with estimated compute units at over 1.5B/month as of current data usage. Links: Twitter GitHub Discord The individuals: Karthik Gupta and Ihsan Fauzi Rahman - please see their respective LinkedIn profiles here. https://www.linkedin.com/in/karthik-gupta-19030b68/ https://www.linkedin.com/in/ihsan-fauzi-rahman/ I have been working with several dozen people over the last few weeks trying to orchestrate the launch of the new NFT Exchange, many who have made significant contributions - the NFTEarth DAO currently has 39 Contributors on Optimism in the Wonderverse DAO management tool for example, but these two individuals have gone above and beyond to contribute in such an impactful way that I feel nominating them to be rewarded via RPGF is with merit. Karthik is a developer based out of Bangalore, India and has been instrumental in solving API challenges that the team has faced since the beginning of the endeavor. He has worked tirelessly, and together we worked to deploy contracts to be used for the new exchange. Ihsan is a developer based out of Jakarta, Indonesia and also has been incredibly creative and solution-oriented to getting the exchange to a fully globally scalable level. He has nearly single-handedly been able to create the Indexer that NFTEarth is using to create an Orderbook for the NFT exchange, and has delivered on building a fully-live and functional UI and backend infrastructure for NFTEarth to have a long and successful period of growth on Optimism! I’ve attached some screenshots for review of the strong growth of the community and protocol progress here as well that directly show the progress on the utility and tooling efforts in NFTEarth itself.   Building a fully performant and scalable NFT marketplace will require a significant amount of resources, and I think NFTEarth has shown it is up for the challenge. Thanks all! Weston  NFTEarthDiscord1080×1037 82.2 KB   NFTEarthTwitter1079×1063 115 KB   OpenSeaNFTEarth773×1280 96.4 KB   ",
                    "links": [
                        "https://github.com/NFTEarth",
                        "https://discord.gg/nftearth",
                        "https://www.linkedin.com/in/karthik-gupta-19030b68/",
                        "https://www.linkedin.com/in/ihsan-fauzi-rahman/",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/1/14cfa729ce8ee37e23655841a127e7b48abaaa31.jpeg",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/0/09958e324334f3024e3f890504fdacd007689bbb.jpeg",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/4/485887916606599dfb0dcad225fda79e3e7a38c2.jpeg"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.821380643166357
                },
                {
                    "author_link": "https://gov.optimism.io/u/nuuneoi",
                    "index": "117",
                    "likes": "51",
                    "time": "31/01/2023-07:02:20",
                    "content": "  The projects name: Apetimism Launchpad   A description of how the project has supported the development and usage of the OP Stack: NFT has become one of the fundamental mechanisms for web3 projects. Its utility can vary from being proof of ownership, being used as a membership card, or being a security asset. In most cases, the actual value of NFT is firmly bonded to its utility. Hence “the core business” of an NFT project is what matters. With more business-driven NFT projects, more sustainable growth could be expected in the space, which would benefit everyone in the ecosystem in both the short term and in the long run.  Speak of which, we need to reduce the barrier of those project founders who do real business to start an NFT project.  Anyway, it is worth noting that even if it looks easy to launch an NFT project, in reality, it is quite geeky and requires strong technical knowledge to start a quality one. A secured smart contract is required to ensure the smart contract has no security flaws. At the same time, a quality minting system is also necessary to give the user a flawless minting experience. Apetimism Launchpad is created to fulfill this gap and comes with the following features:   A secured and full-featured smart contract that can be deployed directly from the project founder’s wallet. The project founder would own and get full control of the smart contract deployed.  Highly dynamic minting system where the project founder can control in many degrees, for example, mint round, mint limit, ming role, mint price, etc.  Bot prevention minting system to prevent the bot from sweeping the NFT.  Highly-scalable minting system that can handle any amount of traffic to ensure the mint site would not go down under any stress.  With Apetimism Launchpad, a project founder would save weeks or months of work and reduce it to a matter of minutes, which would not only give a massive benefit to the project founder but also to the whole ecosystem since the friction to launch a quality NFT project has never been lower. Apetimism Launchpad will be integrated as a launchpad for Zonic, the upcoming NFT marketplace for L2, which will deliver close-loop experiences for creators to deliver both 1st sale and 2nd sale systems.   Links  Apetimism Launchpad  Twitter: @Apetimism   Discord: Apetimism     Contact info for the project or project lead: @nuuneoi (https://twitter.com/nuuneoi)   ",
                    "links": [
                        "https://apetimism.com/launch",
                        "https://twitter.com/apetimism",
                        "https://discord.gg/apetimism",
                        "https://twitter.com/nuuneoi"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.901289682539682
                },
                {
                    "author_link": "https://gov.optimism.io/u/Deezy",
                    "index": "119",
                    "likes": "1",
                    "time": "31/01/2023-07:36:17",
                    "content": "Hey everyone! I am nominating RockX    The projects name: RockX  A description of how the project has supported development and usage of the OP Stack:    providing access node API for builders to build and launch with Optimism   Offering periodic free credits for easy use and start     A link to the project’s GitHub or Twitter:Twitter @rockx_official   (optional) contact info for the project or project lead: Twitter: @rockx_official, @deezyRockX   ",
                    "links": [
                        "https://access.rockx.com/product/optimism-blockchain-api-for-web3-builders"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.083333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/OppaBear",
                    "index": "120",
                    "likes": "16",
                    "time": "31/01/2023-07:39:00",
                    "content": "  The projects name: Oppa Bear NFT Staking & Reward Platform   A description of how the project has supported development and usage of the OP Stack:  Oppa Bear NFT is a special NFT project that link the world NFT on web3 into the real-world business. We believe in developing the usage of NFT adapting into in-real-life (IRL) business. We have partnered with various strategic partnerships e.g. Hotels, Beauty business, Restaurants, Cafes, Production factory, etc. Although, it is not an easy job as most NFT project does not focus on the application in real-life, we see this obligation and develop the staking platform to be used as the utility token. By staking NFT in Oppa Bear Staking & Reward platform, the stakers will receive the utility token to be used in our system. The rewards can be ranging from T-shirts, Hoodies, Caps, NFT special editions, or even Promotion E-vouchers. More products and rewards will be added on with our partners in the near future.   A link to the project’s GitHub or Twitter: https://twitter.com/Oppa_Bear_Pixel https://twitter.com/OppaBearEvo   (optional) contact info for the project or project lead: Discord: Oppa Bear NFT Linkedin: https://www.linkedin.com/in/puvanard/   ",
                    "links": [
                        "https://www.oppabear-nft.com/reward",
                        "https://twitter.com/Oppa_Bear_Pixel",
                        "https://twitter.com/OppaBearEvo",
                        "https://discord.gg/oppabear",
                        "https://www.linkedin.com/in/puvanard/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.404761904761905
                },
                {
                    "author_link": "https://gov.optimism.io/u/Saso",
                    "index": "121",
                    "likes": "3",
                    "time": "31/01/2023-08:41:25",
                    "content": "The projects name: Apetimism Launchpad This is a A community-driven PFP NFT on Optimism and Arbitrum. https://twitter.com/Apetimism   apetimism.com    The Apetimism Project A business-focused NFT project on Optimism         Linktree    Apetimism & Apebitrum | Twitter, Facebook | Linktree A community-driven PFP NFT on Optimism and Arbitrum.      ",
                    "links": [
                        "https://apetimism.com/",
                        "https://apetimism.com/",
                        "https://linktr.ee/apetimism",
                        "https://linktr.ee/apetimism"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/vintageplayer",
                    "index": "122",
                    "likes": "3",
                    "time": "31/01/2023-09:08:51",
                    "content": "Project Name: JiffyScan - www.jiffyscan.xyz A description of how the project has supported the development and usage of the OP Stack: Audit for EIP-4337 smart contract wallets is in progress and already quite capable minds and funded entities working on it. While plenty are focused on building wallets, supporting infrastructure is missing. JiffyScan is the first (and only explorer) supporting the user-friendly and app-friendly view of transactions created using the EIP-4337 standard. The validation a user can get by checking their transaction on a block-explorer is intangible in value and we host the UI in the spirit of public goods. We will also provide a rich API to dapps and developers looking to build further on this standard. The explorer is live for Goerli and Matic Mumbai and we are now ready to expand to optimism as a leading wallet (Candide Wallet) is already working in Optimism. Link to the project’s GitHub: Explorer Monorepo contact info for the project or project lead : @vintageplayer | Twitter ",
                    "links": [
                        "https://twitter.com/artsofbaniya"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.598446196660483
                },
                {
                    "author_link": "https://gov.optimism.io/u/Tamarandom",
                    "index": "124",
                    "likes": "1",
                    "time": "31/01/2023-10:24:45",
                    "content": "The projects name: Commons Stack A description of how the project has supported development and usage of the OP Stack: Commons Stack is on a mission to enable ground-up, community driven initiatives that support public or common goods. To achieve this, years of research have gone into developing Commons design patterns which include cultural frameworks, a suite of tools and a radically inclusive methodology (Collaborative Economics) for launching a Commons DAO. We see the work of Elinor Ostrom as our North Star and set out to weave her principles of governing commons into the cultural fabric of a Commons DAO by defining practices for clear boundaries, conflict resolution, mutual monitoring, participatory decision-making, etc. We co-developed, and open-sourced, novel tools like the Augmented Bonding Curve, Conviction Voting and Praise reputation and reward system. We have only just begun. Our research continues. Lessons learned from the first field test of our design patterns, the Token Engineering Commons (TEC), are being rolled into new deployment protocols and our tools continues to evolve. A link to the project’s GitHub or Twitter: Github Twitter (optional) contact info for the project or project lead: Twitter | @commonsstack ",
                    "links": [
                        "https://twitter.com/commonsstack"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.241477272727273
                },
                {
                    "author_link": "https://gov.optimism.io/u/ZoomerAnon",
                    "index": "126",
                    "likes": "0",
                    "time": "31/01/2023-15:58:25",
                    "content": "The projects name: Optimism Prices Contracts A description of how the project has supported development and usage of the OP Stack: Optimism Prices is a set of Optimism-unique smart contracts that can price any ERC20 asset that exists in a liquidity pool on Optimism, intended to replace the usage of centralized APIs for pricing data with a more reliable and trustless service. The contracts support pricing that requires complex routes with many hops, supports non-standard ERC20 implementations and non-standard AMM curves, and is even optimized to allow for large calls that can best take advantage of the public Optimism RPC without using unnecessary computation. Optimism Prices Contracts are used by Velodrome to accurately price 120+ ERC20 tokens with 100% coverage to display dollar-denominated values on the Velodrome UI and maintain accurate APR data. The Optimism Prices Contracts can entirely replace centralized pricing APIs for the majority of dapps on Optimism, and were designed with the goal of strengthening Optimism’s developer community by building tools that are simultaneously more efficient, and more trustless/verifiable. Future plans for the project include getting the Optimism Prices contracts indexed by Dune, to definitively solve some of the asset-pricing issues the community has been facing lately with not having full coverage for token prices on their dashboards. Other plans include adding support for TWAP prices for any arbitrary ERC20 asset to make the Optimism Prices Contracts viable for use cases that are more sensitive to short term price manipulation. A link to the project’s GitHub or Twitter: GitHub Contact info for the project leads (self-nomination): Twitter: @ZoomerAnon, @2021Meowchan ",
                    "links": [
                        "https://twitter.com/ZoomerAnon"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.941326530612246
                },
                {
                    "author_link": "https://gov.optimism.io/u/diligit",
                    "index": "127",
                    "likes": "0",
                    "time": "31/01/2023-16:09:58",
                    "content": "The projects name: TurboETH A description of how the project has supported development and usage of the OP Stack: TurboETH is a web3 app template built using Next.js, TailwindCSS and RainbowKit, that includes various components such as: *RainbowKit - Wallet connection manager *Sign-In With Ethereum - Account authentication *Etherscan - Blockchain Metadata *ERC20 WAGMI *ERC721 WAGMI A link to the project’s GitHub or Twitter: GitHub - turbo-eth/template-web3-app: 💻 Web3 App Template: Next.js 13, Tailwind, RainbowKit and Optimized Developer UX (optional) contact info for the project or project lead: https://twitter.com/KamesGeraghty ",
                    "links": [
                        "https://twitter.com/KamesGeraghty"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/diligit",
                    "index": "128",
                    "likes": "1",
                    "time": "31/01/2023-16:10:17",
                    "content": "The projects name: Gashawk A description of how the project has supported development and usage of the OP Stack: GasHawk is a free to use tool to help you save on Ethereum gas fees by intelligently submitting your transaction when gas fees are cheap. A link to the project’s GitHub or Twitter: GitHub - corpus-io/gashawk-sdk (optional) contact info for the project or project lead: info@corpus.ventures GasHawk ",
                    "links": [
                        "https://discord.gg/AtwJ73dYGS"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.666666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/MSilb7",
                    "index": "129",
                    "likes": "0",
                    "time": "31/01/2023-16:15:09",
                    "content": "  The projects name: Subgrounds  A description of how the project has supported development and usage of the OP Stack:  Subgrounds is a Python package that simplifies writing queries to pull data from The Graph. I personally find GraphQL confusing to read/write, and Subgrounds makes it much simpler and more intuitive to query data. I’ve migrated to exclusively using Subgrounds when I want to pull data from The Graph. As an example, for OP Incentive Program tracking, where I want to isolate specific pools, rather than a protocol’s entire liquidity (link to helper functions).   A link to the project’s GitHub or Twitter: GitHub - 0xPlaygrounds/subgrounds: A Pythonic data access layer for applications querying data from The Graph Network.   (optional) contact info for the project or project lead: https://twitter.com/protean_labs / https://twitter.com/Playgrounds0x   I work at OP Labs, making this nomination personally. Edit 2/6/23: Corrected the GitHub link, the prior link was not actively maintained. ",
                    "links": [
                        "https://github.com/0xPlaygrounds/subgrounds",
                        "https://twitter.com/protean_labs",
                        "https://twitter.com/Playgrounds0x"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.2592592592592595
                },
                {
                    "author_link": "https://gov.optimism.io/u/aspiringsecurity",
                    "index": "130",
                    "likes": "2",
                    "time": "31/01/2023-16:20:38",
                    "content": "OP Medicine: Developer tools to enable visualization, management for developers to build solutions in medicine, healthcare, improve transparency in drug testing with Filecoin, Ethereum, Optimism, Embark and EtherCalc. Development and Usage of the OP Stack: We are developing an Optimism NFT marketplace for DICOM images to enable research organizations and radiologists. This enables improving Data Transparency in Drug Testing and early-stage detection and prevention of community diseases. We also wish to scale our efforts to develop secure, transparent Drug Testing Pipeline and improving Data Transparency in Drug Testing using OP stack. Our OP solution enables medical trial testing and clinical trials via EMTTRs (Electronic Medicine Trial and Test Records as a Service) and EHR and Radiology services on the decentralized cloud using OP Stack. Project Github: GitHub - aspiringsecurity/EMTTR: Secure, Transparent Drug Testing Pipeline: Improving Data Transparency in Drug Testing Pitch Video and Demo: Metaverse Hackathon: EthMed Pitch - YouTube Website: EMTTRs We are also enabling the development for EHR as a service using OP stack for scaling collaboration of DICOM data in EMTTR. Please visit Electronic Health Records Notable achievements: Optimism Runner Up at Encode Metaverse Hackathon 2022; Filecoin winner at Chainlink Fall hackathon 2022, EVM Ideathon Runner-Up 2022 (Government and Public) Notable Link: Metaverse Hackathon: Prizewinners and Summary | by Neven Brlek | Encode Club | Dec, 2022 | Medium Vision and Goals: Enabling the bottom of pyramid through empowering pharma companies and the medical eco-system to do medicine trial testing and clinical trials via Ethereum and Optimism blockchain enabled EMTTRs (Electronic Medicine Trial and Test Records as a Service), EHR and Radiology services. EMTTRs as a service aims at providing ■Secure data storage, transparent data movement and data authenticity. ■Improving Data Transparency in Drug Testing ■Enabling healthcare community by empowering pharma companies & the medical eco-system to do medicine trial testing securely, transparently Contact Information: dev@seeta.in, aspiringuserapps@gmail.com Twitter ID: https://twitter.com/manusheel ",
                    "links": [
                        "https://www.youtube.com/watch?v=aIq3JiTlNVA",
                        "https://sites.google.com/view/emttrservice/home",
                        "https://sites.google.com/view/electronichealthrecords/home",
                        "https://medium.com/encode-club/metaverse-hackathon-prizewinners-and-summary-5d12353cc214",
                        "https://twitter.com/manusheel"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.222222222222222
                },
                {
                    "author_link": "https://gov.optimism.io/u/MSilb7",
                    "index": "133",
                    "likes": "2",
                    "time": "31/01/2023-16:34:58",
                    "content": "  The projects name: Messari Subgraphs   A description of how the project has supported development and usage of the OP Stack:   Messari created a set of free-to-use standardized subgraphs across many protocols and chains (i.e. Curve on all chains, Aave on all chains). A challenge with using subgraphs is that each protocol/creator designs their schemas and defines metrics differently. Messari’s work at the “interpretation layer” to standardize the schemas (i.e. TVL, trade volume), and unearth often hard to calculate metrics (i.e. token emissions) helps save so much time and effort for analysts.   A link to the project’s GitHub or Twitter:  Subgraph Explorer: https://subgraphs.messari.io/  Github: GitHub - messari/subgraphs: Standardized subgraphs for blockchain data     (optional) contact info for the project or project lead: https://twitter.com/MessariCrypto (will find the lead for this specific project)  ",
                    "links": [
                        "https://github.com/messari/subgraphs",
                        "https://twitter.com/MessariCrypto"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.408333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/ceresstation",
                    "index": "139",
                    "likes": "0",
                    "time": "31/01/2023-16:54:04",
                    "content": "  The project name: WalletConnect   A description of how the project has supported development and usage of the OP Stack:  WalletConnect has gone from a nights and weekends project to the way for wallets and apps to securely connect and interact without this tooling, the usability of many of the wallets OP users rely on would be far weaker  pedro actively and diligently maintained this infrastructure for years before raising dilutive capital, and created significant value before that point    A link to the project’s GitHub or Twitter:  GitHub: WalletConnect · GitHub     ",
                    "links": [
                        "https://twitter.com/pedrouid",
                        "https://github.com/WalletConnect"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.241666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/0xngmi",
                    "index": "144",
                    "likes": "2",
                    "time": "31/01/2023-17:07:12",
                    "content": "Feel free to disqualify this one if it’s incompatible with the defillama proposal that was sent earlier,   The projects name: DefiLlama APIs  A description of how the project has supported development and usage of the OP Stack: DefiLlama provide free price apis, which are used by many projects in optimism, such as mean finance. These help projects get to market faster by not having to deal with pricing.  A link to the project’s GitHub or Twitter: GitHub - DefiLlama/defillama-server: Server for defillama   (optional) contact info for the project or project lead: @0xngmi on twitter  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.822916666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/Jonas",
                    "index": "147",
                    "likes": "1",
                    "time": "31/01/2023-17:25:49",
                    "content": "  The projects name: Ethereum JS  A description of how the project has supported development and usage of the OP Stack: The EthereumJS community builds Javascript tools implementing core Ethereum technologies, protocols and APIs for helping developers to interact with the Ethereum network and build their own applications. This tooling is used to build Wallets, dApps and more on Ethereum.  A link to the project’s GitHub or Twitter: EthereumJS · GitHub   Note: I’m working for the Optimism Foundation, but am making this nomination in a private capacity ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.833333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/Jonas",
                    "index": "148",
                    "likes": "2",
                    "time": "31/01/2023-17:28:28",
                    "content": "  The projects name: Etherscan and Optimistic Etherscan  A description of how the project has supported development and usage of the OP Stack: Etherscan is a block explorer for the Ethereum blockchain . It allows users to easily search and browse transactions and blocks. It also provides information about each transaction and block, such as the hash and timestamp. This is essential tooling for users, developers and Optimism contributors.  A link to the project’s GitHub or Twitter: https://etherscan.io/   Note: I’m working for the Optimism Foundation, but am making this nomination in a private capacity ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.541666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/jbreite",
                    "index": "149",
                    "likes": "1",
                    "time": "31/01/2023-17:39:54",
                    "content": "The projects name:  Fire  A description of how the project has supported development and usage of the OP Stack: Web3 is hard to use. Self-custody and interacting directly with the blockchain today is overly complicated for the consumer, leading to the average user losing their funds and quitting the ecosystem. UX today is fraught with “gotchas” and pitfalls. Fire - the Chrome extension that simulates transactions, showing you exactly what will go in and out of your wallet before you sign the contract. We protect over 35,000 unique wallets across EVM Ethereum, Polygon, and Optimism today. We want this number to grow, helping support the Optimism ecosystem as well as onboard new users to it! Our goal is to make Web3 simple. Transaction simulation is just the beginning of Fire, making Web3 simple on Optimism and beyond. A link to the project’s GitHub or Twitter:  https://twitter.com/_joinfire Fire Website  (optional) contact info for the project or project lead:  Jeff Krantz (@JKrantz on Twitter)  ",
                    "links": [
                        "https://www.joinfire.xyz/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.9743265993265995
                },
                {
                    "author_link": "https://gov.optimism.io/u/seetadev",
                    "index": "150",
                    "likes": "2",
                    "time": "31/01/2023-17:48:58",
                    "content": "Drone Monitor: Our platform solution offers an Artificial Intelligence-based object detection system that utilizes IPFS, Ethereum and Optimism powered solutions for sorting information obtained from a variety of UAV and drone cameras deployed at monitoring spots. Features: •Detection: Identifying the UAVs in the video feed using object detection. •Discovery: Logging the identities of UAVs flying in a particular air space, using exchange of unique identifiers. •Geo-fencing: Discovering unlawful presence, raising alarms using w3ui. •Monitoring and Reporting: Looking out and reporting incidents based on event detection in files uploaded using w3ui. •Analysis: Analyzing route patterns and incidents. Utilizing OP stack: We are using Optimistic rollup technology to enable scaling of the decentralized public goods mobility network and effective management and communication setup for Drones utilized in Operations and Maintenance across multiple regions. Drones can be effectively utilized for building operations, inspection and maintenance and safer and more efficient surveys. Optimism NFT marketplace for NFC tags of UAVs for enabling sharing of government assets and service/repair of vital assets: Water-ICM/Solution-Modules/optimism-nfc-tag-nft-marketplace at main · aspiringsecurity/Water-ICM · GitHub Github Repository: GitHub - seetadev/EthOps: Developer Tools to manage and monitor drones, UAVS and embedded devices for cost effective healthcare delivery Github Repository for its application in Water and Road management: GitHub - aspiringsecurity/Water-ICM: Investigative Case Management for Integrated Water Management Resource Center Website: LATC Global Website for End Consumers, Civic bodies:   Integrated Water Management Resource Center: Water Management   Drones for Logistics, Operations and Maintenance: Drones for Real Estate   Demo Videos:   UAV Monitor (Screencast): Drone and UAV Operations Monitoring - YouTube   UAV Monitor for Integrated Water Management: Investigative Case Management for Integrated Water Management Resource Center - YouTube   End Node Commissioning using NFC tag and iot modular gateway (Hardware Demo): End Node Commissioning using NFC tag and iot modular gateway - YouTube   Achievements: Moralis FileCoin Hackathon: Winner of Filecoin pool prize and XMTP prize ( Winners - Moralis Web3 | Enterprise-Grade Web3 APIs ) Encode Harmony Hackathon 2022: We won the Covalent pool prize. Please watch the video at Encode x Harmony Hackathon: Finale and Prizegiving - YouTube and visit the link at Encode Club x Harmony Hackathon: Prizewinners and Summary | by Vanessa Losic | Encode Club | Medium We won the best use of Hedera Hashgraph at the Garuda 3.0 Hackathon 2022. Please find the winner’s certificate at drone monitor - Google Drive (merit certificate directory) and winner’s link at Garuda Hacks 3.0: Southeast Asia's largest hackathon is back for its 3rd year! - Devpost Aptos Challenge at Encode’s Next Video Build Hackathon 2022: Next Video Build — Encode Club. Please find the finale and prize giving video: Next Video Build: Finale and Prizegiving - YouTube and blog entry at Next Video Build Hackathon: Prizewinners and Summary | by Neven Brlek | Encode Club | Jan, 2023 | Medium Contact Information: dev@seeta.in Discord: manusheel#3075 Twitter: https://twitter.com/aspiringapps ",
                    "links": [
                        "https://github.com/seetadev/EthOps",
                        "https://github.com/aspiringsecurity/Water-ICM",
                        "https://sites.google.com/view/latcglobal/home",
                        "https://sites.google.com/view/integratedwatermanagment/home",
                        "https://sites.google.com/view/dronesforrealestate/home",
                        "https://www.youtube.com/watch?v=dk3TQlEsxfo&t=3s",
                        "https://www.youtube.com/watch?v=dqR-I70UT1I&t=1s",
                        "https://www.youtube.com/watch?v=vNKONKA2sow",
                        "https://moralis.io/filecoin-hackathon/winners/",
                        "https://www.youtube.com/watch?v=62hrsmOShhg",
                        "https://medium.com/encode-club/encode-club-x-harmony-hackathon-prizewinners-and-summary-e088485c8af7",
                        "https://drive.google.com/drive/u/3/folders/1l9ZG65js2Q-a1m8Iy3BO25dWISqr3oPk",
                        "https://garuda-hacks-3-0.devpost.com/project-gallery",
                        "https://www.encode.club/next-video-build",
                        "https://www.youtube.com/watch?v=2USgb11kYzY",
                        "https://medium.com/encode-club/next-video-build-hackathon-prizewinners-and-summary-33f258fdc9f5",
                        "https://twitter.com/aspiringapps"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.730902777777778
                },
                {
                    "author_link": "https://gov.optimism.io/u/julien",
                    "index": "152",
                    "likes": "0",
                    "time": "31/01/2023-17:59:55",
                    "content": " The project’s name: EIP-5560: Redeemable NFTs  A description of how the project has supported development and usage of the OP Stack:The EIP is a Redeemable NFT extension which adds a redeem function toEIP-721. It can be implemented when an NFT issuer wants his/her NFT to be redeemed for a physical object. An increasing amount of NFT issuers such as artists, fine art galeries, auction houses, brands and others want to offer a physical object to the holder of a given NFT. This standard allows EIP-721 NFTs to signal reedemability. A link to the project’s GitHub or Twitter: EIPs | Discussion  (optional) contact info for the project or project lead: Julien Béranger   ",
                    "links": [
                        "https://ethereum-magicians.org/t/eip-5560-redeemable-nfts/10589",
                        "https://twitter.com/julienbrg"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.513888888888889
                },
                {
                    "author_link": "https://gov.optimism.io/u/julien",
                    "index": "153",
                    "likes": "0",
                    "time": "31/01/2023-18:02:21",
                    "content": "  The project’s name: Gov   A description of how the project has supported development and usage of the OP Stack: Gov is a DAO template built with Open Zeppelin’s Governor contract in combination with NFTs. It provides a retroactive funding tool that fits the needs of everyday people (view features). We recently deployed the first pilot to Optimism (the Web3 Hackers Collective) and we’re getting ready to launch five different pilots in the coming weeks. We now want to focus on the impact evaluation process for each of these new DAOs.   A link to the project’s GitHub or Twitter: Github repo | Docs   (optional) contact info for the project or project lead: Julien Béranger (Element, Telegram, Twitter, Discord, or LinkedIn)   ",
                    "links": [
                        "https://w3hc.github.io/gov-docs/#features",
                        "https://www.tally.xyz/gov/w3hc",
                        "https://github.com/w3hc/gov",
                        "https://w3hc.github.io/gov-docs/",
                        "https://matrix.to/#/@julienbrg:matrix.org",
                        "https://t.me/julienbrg",
                        "https://twitter.com/julienbrg",
                        "https://discord.gg/bHKJV3NWUQ",
                        "https://www.linkedin.com/in/julienberanger/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.275974025974026
                },
                {
                    "author_link": "https://gov.optimism.io/u/julien",
                    "index": "154",
                    "likes": "0",
                    "time": "31/01/2023-18:02:54",
                    "content": "  The project’s name: NFT Watcher   A description of how the project has supported development and usage of the OP Stack: The app watches NFT transfers and automatically cut the service in case of a transfer. Today, we’re seeing a growing usage of ‘access NFTs’ on Optimism (ticketing, VOD services, metaverse, …). Services usually only verify the ownership of the NFT once, in this case a user actually can use the NFT to access the service and then transfer his NFT to someone else. In other words, two persons can use the same service at the same time (which is a form of Sybil attack…). NFT Watcher solves this problem.   A link to the project’s GitHub or Twitter: Github repo | Live demo   (optional) contact info for the project or project lead: Olivier   ",
                    "links": [
                        "https://github.com/fernandezOli/nftwatcher",
                        "https://nftwatcher.netlify.app/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.009469696969697
                },
                {
                    "author_link": "https://gov.optimism.io/u/QuarkID",
                    "index": "155",
                    "likes": "10",
                    "time": "31/01/2023-18:28:57",
                    "content": "The Project name: Quark ID Description: CONCEPTUAL APPROACH TO THE PROBLEM In the analog world we physically carry different credentials or attestations in a wallet or purse, to prove each of the aspects that are part of our identity (driver’s license, our ID card, club card, etc.). In addition, in the physical world we rely on a public or private agency to issue these verifiable documents and credentials. Just as we have many physical credentials that prove aspects of our identity, in the digital world there are many applications where we also store IDs that prove aspects of our identity: we have an app for health services, another for paying for public transportation, another for identification documents, etc. The problem is that people (holders) do not have the possibility to select which data to share, to verify an aspect of their identity or their relationship with a good or service; instead, they must present the document with all the information it contains, thus providing more data than necessary when requested. WHAT DOES QUARK ID PROPOSE TO CHANGE? All the applications we use in the digital world have their databases centralized in their datacenters and they are the ones who monopolize their users’ information. Every time we tell our browser to store our credentials for accessing any online service, we are entrusting our data to the manufacturer of that browser (Microsoft, Google, etc.). The goal of Quark ID is that everything related to our identity is under our absolute control. That is to say, that any attribute referring to our identity is defined and guarded by us and we have the power to decide with whom we share it, for what purpose and for how long. WHAT IS QUARK ID? It is a self-sovereign digital identity and security framework co-created with the community of entrepreneurs, developers and experts in Latin America, and promoted by the Government of the City of Buenos Aires, which aims to give people back control over their credentials, with a security anchor through blockchain. Quark ID enables new ways of using your personal information and redefines access to services provided by all types of institutions and organizations, whether public or private. The protocol is decentralized, public, non-permissioned, open and extensible. In addition, it is interoperable and multichain, so that each ecosystem that wants to use this technology can choose the one they prefer. This is where we frame Quark ID as a cross digital identity and security framework and that it can use any blockchain, from a Layer 1 to a Layer 2. We believe the important thing is that this works as a public infrastructure, so that anyone can build value, and to transform and simplify the way the state and society relate, while empowering people by giving them back control over their identity. WHAT IS THE PURPOSE OF QUARK ID? Quark ID seeks to put the person at the center, that is, that citizens regain control over their data and become owners of their identity. People will have their credentials (which are issued by public and private organizations) on a single off-chain platform. All this information flow is protected by a peer-to-peer interaction privacy design. That means that no intermediary can track the interactions between stakeholders. In addition, Quark ID is “all in one”, meaning that all verifiable credentials and attestations are stored in a single mobile application. No one but the users have access to the credential information and it is up to them to decide what data to send to each person or organization. QUARK ID’S MISSION Being an interoperable, open, permissive digital security framework, it is intended that any jurisdiction can adopt it. It seeks to give rise to a new paradigm in which new transactions are secure and agile. This is based on the principle that people are the ones who control their identity, and they are the ones who decide where their information is stored. BASIC PRINCIPLES OF QUARK ID  Open standards SSI protocol Multichain Interoperable Off-chain private data Autonomous governance A growing public/private ecosystem Government user vs. government user  QUARK ID: AN ECOSYSTEM An ecosystem is being generated. Many companies and municipalities started to get interested. We are working with:  Extrimian Starkware IOVlabs Beon OSCity XCapit Buenos Aires City Government   QUARK ID - SSDI-5_page-00012000×1125 183 KB  Github:  GitHub - Quark-id/WhitePaper: QuarkID Protocolo Whitpaper Website: quarkid.org ",
                    "links": [
                        "https://github.com/Quark-id/WhitePaper",
                        "http://quarkid.org"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.556623376623376
                },
                {
                    "author_link": "https://gov.optimism.io/u/delalunia",
                    "index": "156",
                    "likes": "0",
                    "time": "31/01/2023-18:32:01",
                    "content": " The projects name: Ante - https://www.ante.finance/  A description of how the project has supported development and usage of the OP Stack:  Ante was deployed on Optimism on 2022/11/25, and is providing a platform for users and protocols to write tests that show faith in underlying smart contracts on chain. As a dev tool (also listed on Pentacle - https://pentacle.xyz/projects/ante-finance), Ante is a way to measure decentralized community trust in on chain guarantees in real time. The ante tests themselves are on chain incentivized tests that builders on Optimism can check with their own smart contracts to see if guarantees are still true, providing greater user safety in the entire ecosystem. Some tests that have already been hosted are (the USDC test is deployed live Optimism!):  USDC - https://app.ante.finance/contract/0xa/0x73563B0034f5D15849070638B841bcFD225d8182  ETH2 - https://app.ante.finance/contract/0x1/0xE48f6A36f3712E389ce666BCEcD88BA60c30aE50    Ante has an open source community repo (https://github.com/antefinance/ante-community-tests), with over 100 tests in them, many of which can be deployed on Optimism. Additionally, all ante smart contracts are open source and audited (link) Finally, Ante is also working on developing zkSNARK powered Ante Tests for more advanced tests that could benefit Optimism for bridge smart contracts   A link to the project’s GitHub or Twitter:  Github - https://github.com/antefinance/ante-v05-core  Twitter - @AnteFinance    Contact info for the project or project lead:  hello@ante.xyz delalunia@ante.xyz    ",
                    "links": [
                        "https://antelabs.notion.site/Ante-Labs-zkSNARK-Explainer-53d29a02dddd4bea88526679f4ef12c6"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.274249188311688
                },
                {
                    "author_link": "https://gov.optimism.io/u/unnawut",
                    "index": "157",
                    "likes": "0",
                    "time": "31/01/2023-18:33:34",
                    "content": "  The project name: Solhint  A description of how the project has supported development and usage of the OP Stack: Solidity linting utility. Not OP-specific but eligible under the criteria “eligible projects need not be exclusive to the Optimism ecosystem, but there should be a connection”  A link to the project’s GitHub or Twitter: GitHub - protofire/solhint: Solhint is an open source project created by https://protofire.io. Its goal is to provide a linting utility for Solidity code.   (optional) contact info for the project or project lead:  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/unnawut",
                    "index": "158",
                    "likes": "0",
                    "time": "31/01/2023-18:35:28",
                    "content": "  The project name: EVM Indexer  A description of how the project has supported development and usage of the OP Stack: A scalable SQL Indexer compatible with at least 12 different EVM chains. Not OP-specific but eligible for the criteria “Eligible projects need not be exclusive to the Optimism ecosystem, but there should be a connection.”  A link to the project’s GitHub or Twitter: GitHub - llamafolio/evm-indexer: EVM-compatible chain indexer.   (optional) contact info for the project or project lead:  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/aspiringsecurity",
                    "index": "159",
                    "likes": "1",
                    "time": "31/01/2023-18:36:45",
                    "content": "Project Name: Transport ICM Monitoring tools for road incident management and reducing traffic congestion powered by IPFS. Crowdsourcing information sharing for better and safer roads. How it works:  Camera Management: Add/edit/delete cameras for snapshots of road incidents. Object Detection using OSS computer vision. Video analytics configuration using IPFS. Live streaming with Object Detection, Video Analytics using IPFS. Alarm storage using Ethereum. Save/delete alarm metadata and image to/from IPFS. Store the hash returned from IPFS to Ethereum test network. Provide links to alarms and blockchain transaction details. Alarm Viewer: Add alarms with a single touch. Open the Alarm Settings menu from the home page. Add an alarm, delete an existing alarm.  Enablement using OP Eco-system: Optimism NFT marketplace for vehicle spare parts and also for early-stage detection and prevention of incidents. Improving Data Transparency in Incident Management Using Ethereum Blockchain, IPFS and Optimism NFT marketplace. We are extending and adapting our platform for connected vehicles in Europe for sustainability and efficiency. We are currently working on a dataset of 15000 trips, 45+ trucks and 175+ drivers and enabling them to achieve better fleet management. We wish to use Optimism for scaling the solution for the current dataset. Github Repository: GitHub - aspiringsecurity/EthTransport Website: Aspiring Road Safety Link to the Demo: Please visit the 3 demo videos at the link https://drive.google.com/drive/u/3/folders/130gWNRVsPS9O7tUs0iAx-bolx2wyYCDU Notable Achievements: We participated at the Moralis Filecoin 1,2,3 hackathon (1, 2, Web3 Hackathon - Moralis x Filecoin 2022 Hackathon) and won multiple prizes (please watch the video at 1, 2, Web3 Awards Ceremony - YouTube and visit the website at Winners - Moralis Web3 | Enterprise-Grade Web3 APIs ) Contact Information: Email: dev@seeta.in, aspiringuserapps@gmail.com Discord ID: deeptigupta#4290 ",
                    "links": [
                        "https://sites.google.com/view/aspiring-road-safety/home",
                        "https://drive.google.com/drive/u/3/folders/130gWNRVsPS9O7tUs0iAx-bolx2wyYCDU",
                        "https://moralis.io/filecoin-hackathon/",
                        "https://www.youtube.com/watch?v=a_2n0sEPuxc",
                        "https://moralis.io/filecoin-hackathon/winners/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.86940836940837
                },
                {
                    "author_link": "https://gov.optimism.io/u/unnawut",
                    "index": "160",
                    "likes": "0",
                    "time": "31/01/2023-18:41:51",
                    "content": "  The project name: Laika  A description of how the project has supported development and usage of the OP Stack: A request builder for web3. Support EVM chains (including Optimism) and some other Non-EVM chains. Enables developers to make smart contract calls easier through a web UI.  A link to the project’s GitHub or Twitter: https://twitter.com/getlaikaapp   (optional) contact info for the project or project lead: https://twitter.com/jeantnd   ",
                    "links": [
                        "https://twitter.com/jeantnd"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.2232142857142865
                },
                {
                    "author_link": "https://gov.optimism.io/u/MGSchmidt",
                    "index": "161",
                    "likes": "0",
                    "time": "31/01/2023-18:47:38",
                    "content": "  The projects name: ChugSplash  A description of how the project has supported development and usage of the OP Stack: Chugsplash is a declarative and deterministic framework for deploying and upgrading smart contracts. Available as a Foundry and Hardhat plugin.  A link to the project’s GitHub or Twitter: GitHub - chugsplash/chugsplash: ChugSplash is a modern smart contract deployment system   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.285714285714286
                },
                {
                    "author_link": "https://gov.optimism.io/u/unnawut",
                    "index": "162",
                    "likes": "0",
                    "time": "31/01/2023-18:47:54",
                    "content": "  The project name: Uniswap.fish  A description of how the project has supported development and usage of the OP Stack: An all-in-one workspace for Uniswap liquidity providers — calculate, discover, analyze, manage & track positions, and more. Supports Uniswap on Optimism.  A link to the project’s GitHub or Twitter: https://uniswap.fish/   (optional) contact info for the project or project lead: https://twitter.com/chunrapeepat   ",
                    "links": [
                        "https://twitter.com/chunrapeepat"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/habacuc.eth",
                    "index": "163",
                    "likes": "0",
                    "time": "31/01/2023-18:53:13",
                    "content": "Hi, Optimism fam, I would like to nominate:  Project name: Eneagon / Retroactive public goods funding tool  Description Eneagon is a platform for retroactive public goods funding, that prefilters each project relying on the bicameral governance model from Optimism with Soulbound tokens to allow stakeholders and developers to interact and track the progress of public goods projects. Eneagon utilizes ERC20 tokens to provide funding to developers and currently has three contracts deployed on Optimism Goerli and Mumbai testnets. The project was built during ETH Online 2022 hackathon and won third place in the Devcon Quadratic Funding round hosted by clr fund and ETH Colombia. The team is now working to introduce Eneagon to ReFi DAO circles as a retroactive funding tool for their projects.  Project links: ETH Online 2022 showcase Eneagon repository  Contact info for the project or project lead: habacuc.eth R&D lead @ Zenbit.eth , habacuc@zenbit.mx Twitter: @habacucMX Github: habacucMX ",
                    "links": [
                        "https://github.com/zenbitETH/eneagon"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.833333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/Jonas",
                    "index": "164",
                    "likes": "0",
                    "time": "31/01/2023-19:26:59",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "425"
}