{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/draft-proposal-moving-to-a-grants-council/3945",
            "title": "[DRAFT PROPOSAL]: Moving to a Grants Council ",
            "index": 3945,
            "category": [
                "\\xf0\\x9f\\x93\\x83Other Proposals",
                "Reflection Period Proposal"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/system",
                    "index": "1",
                    "likes": "25",
                    "time": "08/11/2022-20:03:48",
                    "content": "Please read Guide to Season 3: Course Correcting for full context before reading this proposal. The Grants Council will be voted on by the Token House in Special Voting Cycle #9a. As outlined in Guide to Season 3: Course Correcting, the current Governance Fund grants process faces significant challenges. Luckily, there is a lot of room for optimization. Some goals for Season 3 include:  creating a more streamlined and consistent process for proposers setting a pace for grant distributions defining a clear scope creating accountability via smaller grant sizes and milestone-based distributions reducing the workload on delegates so that they have more time to weigh in on high impact votes, better positioning the grants process within the broader responsibilities of Token House governance  In Season 2, the Token House experimented with multiple committees, which made non-binding recommendations on proposals within their domain. While committees reduced the workload on non-committee delegates, they introduced new challenges:  voting cycles became increasingly complex proposers became even more confused as they received conflicting recommendations from multiple committees multiple committees vying for power created a dynamic that negatively impacted culture, made worse by the lack of enforceable delegate code of conduct there weren’t appropriate checks on committee power, including a clear mechanism to remove committee members mid-Season several large delegates were prevented from voting for committees due to third-party application errors, which impacted the perceived legitimacy of elections  These challenges are related to specific committee design choices rather than the organizational structure itself. Instead of continuing committees into Season 3, we propose experimenting with a Grants Council to overcome many committee challenges while helping achieve the goals of Season 3. If this proposal passes:   In Season 3, Governance Fund grants process will be managed by a Grants Council. The Grants Council will be comprised of 1 Lead and 8 Reviewers and will have full decision making authority as to which grants are made.   Non-Council delegates will no longer vote on each grant proposal. Instead, they will elect Council members and, if the Council continues in future Seasons, approve the Council budget. Throughout the Season, non-Council delegates will serve the important role of oversight on the Council and voting on other proposal types, such as protocol upgrades. There will be a multitude of other activities non-Council delegates will be responsible for in future Seasons.   Council members will be subject to the following checks on their authority:  All Council members will be subject to the Delegate Code of Conduct and may be off-boarded from the Council at any point during the Season via Token House vote. All Reviewers will be subject to re-election if they wish to be a Reviewer for an additional Season (provided the Council were to be approved to continue beyond S3). While the Grants Council will reduce the number of delegates directly involved in decision making, this only pertains to grants. Other Season 3 initiatives are aimed at broadening the base of token holders that would hold the Council accountable. A high degree of transparency will be required of Council operations so that non-Council Token Holders are able to provide effective oversight.     Council Structure If approved, there will be 1 Council, comprised of 2 sub-committees. Each sub-committee will have a clear mandate and be tied to a specific grant objective. Sub-committees will be encouraged to create RFPs to incentivize well-aligned grant applications. At the end of Season 3, the Token House will have the chance to evaluate, re-approve, or modify the two sub-committees.   Builders Sub-Committee:   Goal: maximize the number of developers building on Optimism  Non-goal: retroactive funding  Possible RPFs: prospective builder grants for new projects, hackathons, technical content  Format: proposers receive grants <50k OP, which are locked for a period of 1-year. If access to upfront capital is a blocker for applicants, Optimism may put them in touch with alternative resources to support teams in this position.  Suggested budget: 850k OP / Season  Reviewers: 3 (see below)  Consensus: 2/3 vote required to fund a grant    Growth Experiments Sub-Committee:   Goal: maximize the number of users interacting with applications on Optimism  Non-goal: retroactive airdrops  Possible RFPs: small-scale liquidity mining experiments, usage incentives, user education  Format: proposers receive milestone-based grants <250k OP to pass on directly to their users as incentives for engaging with a protocol, platform, product or service. 40% of the grant will be distributed to the proposer upfront and the remaining 60% will be distributed upon completion of a mid-way point milestone. Completion of all milestones should be achievable in 3-6 months.  Suggested budget: 4M OP / Season  Reviewers: 5 (see below)  Consensus: 3/5 vote required to fund a grant    Council Responsibilities All Council members will be required to abide by the Delegate Code of Conduct. All Council members will be required to disclose all anticipated conflicts of interest when applying to serve on the Council and all actual conflicts of interest in all written voting rationale where a conflict is  present.   The Grants Council will:  filter and process all grant applications. All grant applicants should receive feedback, even if it will not proceed to Council review. approve grants in regular cycles (the Foundation recommends 3 week cycles) publish a report outlining grant decisions within 3 days of the end of each cycle assess whether grantees have meet pre-defined milestones publish periodic milestone updates, as applicable ensure ongoing Council operations and performance are transparent to the community    The Council Lead will oversee the general administration of the grants program and will:  process and filter applications. Applications that are submitted to the Council database should also be published to the Forum, unless a proposer opts-out of Forum publication provision and/or maintain external and internal information about the grants program, and any other resources needed by the Council facilitate coordination across sub-committees by scheduling and hosting regular Council meetings monitor progress towards milestones and run a process to ensure milestones have been met before milestone-based distributions are made (possibly via a system similar to Radicle’s) prepare regular reports to communicate grant allocations at the end of each cycle and periodic reports to communicate milestone updates from grantees submit budget/renewal proposals at the end of the Season, if applicable exercise decision-making authority in the event that sub-committees cannot come to consensus on an administrative or operational matter commit to spend roughly 30 hours per week on these responsibilities    Reviewers will vote on grant proposals submitted to their sub-committees and will:  have the subject matter expertise required to evaluate advanced proposals. It is recommended that at least one member of each sub-committee have a technical background be accessible to grant applicants - within reason - to provide feedback, answer questions, and respond to comments. This should be done via public communication channels whenever possible. It should be clear to grant applicants how to get in touch with the Council work with proposers to ensure proposed milestones are clear, measurable, and achievable within the specified timeframe maintain a participation rate >70% on Council votes document voting rationale for each grant provide any information required to publish regular reports and periodic updates in a timely manner commit to spend roughly 12 hours a week on these responsibilities    Council Membership All Grants Council members will receive rewards for their work, which will be allocated from the Council’s 5M OP budget.   Lead  The Foundation will select the initial Council Lead (which is an administrative, non-voting role) via an open application process. If the Council continues in subsequent Seasons, the Foundation may hire a full time contributor to fill this role The Council Lead will be compensated 35,000 OP per Season    Builders Sub-Committee:  3 elected delegates (there is no minimum voting power requirement) Reviewers will each be compensated 14,000 OP per Season    Growth Experiments Sub-Committee:  5 elected delegates (there is no minimum voting power requirement) Reviewers will be compensated 14,000 OP per Season    If this proposal passes, additional information will be provided on the Council Lead application and Reviewer election processes. Snapshot votes will be counted manually in the event of third-party application errors. Council Budget The Council budget for Season 3 will be 5M OP. Should the Council operate in subsequent Seasons, the budget will be approved by the Token House on a Seasonal basis. As a result, this budget may fluctuate up or down each Season. For more information, please see the Gov Fund Charter. Ecosystem grants will continue to be disbursed by the Foundation, meaning the Council will not operate its own multi-sig wallet at this time. Any budgeted OP that is not distributed at the end of the Season will remain in the Governance Fund. Implementation and Administration In Season 3, the Foundation will provide administrative services to the Council consistent with the services described in the Operating Manual. This includes reviewing and approving (in its discretion) Council operating expenses for reimbursement, conducting a KYC process on all grant recipients, and administering the multi-sig wallet for grant disbursements. In future Seasons, the Council may control its own multi-sig as the Foundation increasingly decentralizes its role. ",
                    "links": [
                        "https://gov.optimism.io/t/guide-to-season-3-course-correcting/3942",
                        "https://gov.optimism.io/t/introducing-governance-committees/3238",
                        "https://gov.optimism.io/t/delegate-code-of-conduct/3943",
                        "https://gov.optimism.io/t/delegate-code-of-conduct/3943",
                        "https://github.com/radicle-dev/radicle-grants/tree/hyperlinkFixes/grants/milestone_deliveries",
                        "https://gov.optimism.io/t/governance-fund-charter/3944",
                        "https://github.com/ethereum-optimism/OPerating-manual/blob/main/manual.md#implementation-and-administration:~:text=Implementation%20and%20Administration",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/16",
                        "https://gov.optimism.io/t/special-voting-cycle-9a-grants-council/4198/5",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/17",
                        "https://gov.optimism.io/t/retroactive-delegate-rewards-for-season-1-2/3947"
                    ],
                    "GPT-summary": "The post is a draft proposal for a Grants Council to manage the Governance Fund grants process in Season 3. The proposal outlines the challenges faced by the current process and the goals for Season 3. The post explains the proposed structure of the Grants Council, including the Council's responsibilities, membership, and budget. The proposal also includes two sub-committees with specific goals and possible RFPs. The post provides details on the Council's decision-making process, transparency, and accountability. The proposal is open for feedback and will be voted on by the Token House in Special Voting Cycle #9a.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Law and regulations",
                        "Community and engagement",
                        "Privacy, Security and risk management",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.450534737253488
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "2",
                    "likes": "0",
                    "time": "08/11/2022-20:03:55",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "3",
                    "likes": "0",
                    "time": "08/11/2022-20:30:37",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/katie",
                    "index": "4",
                    "likes": "4",
                    "time": "09/11/2022-01:07:05",
                    "content": "Are there any requirements for the council lead or members such as 0.5% voting power or can anyone apply? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/mboyle",
                    "index": "5",
                    "likes": "2",
                    "time": "09/11/2022-09:39:55",
                    "content": "Locking up builder grants for a year really decreases the utility of a grant. Could someone elaborate on what the thinking is behind this? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "6",
                    "likes": "3",
                    "time": "09/11/2022-10:02:43",
                    "content": "Assuming you are referring to one year lock up for builder sub committee. I believe this is an excellent move for two reason.  Locking for one year reflect that individual is not here for quick money Push the myopic community away and focus on long term sustainable governance.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.604166666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "7",
                    "likes": "6",
                    "time": "09/11/2022-11:10:03",
                    "content": "Lots to digest here. Some initial feedback from a first read:  Suggested Budget I see that there is a suggested budget per commitee per season. This is really good. Thank you. One of the biggest problem I have personally had was giving out other people’s money without an idea of any budget constraints. This will help. I would even turn it into budget. Not suggested. Staying in budget should be a requirement. Would really help guide decisions.  Council work   approve grants in 3 week cycles   I would like to ask for this to be better defined by using some of the learnings we have had. A typical grant proposal’s life looked like this in this season:  Forum post is created Trying to get eyes on it Trying to get committee eyes on it Somehow it ends up on a vote before even committee had time to deliberate on it Forced to vote  I would like to explicitly split the cycles. Have cohorts. Only a specific number of grants go in a cohort, perhaps in a first come first serve basis? Perhaps in a simple application process? Then the council goes on a 3 weeks round of feedback and back and forth with the proposers to improve their proposal and align it with the interests of optimism. Then we can go on a council vote period which would be … dunno … 2 weeks?  Delegates compensation I truly think that this is still the biggest elephant in the room. Perhaps it’s offtopic to this particular post but all delegates, irrespective of being in the council or not should be compensated. There is considerable work involved as a delegate even if you are not in a council/committee and the governance process relies on delegates performing that work. Right now it’s done pro bono. This is wrong. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.352678571428572
                },
                {
                    "author_link": "https://gov.optimism.io/u/Prometheus",
                    "index": "8",
                    "likes": "1",
                    "time": "09/11/2022-11:25:12",
                    "content": "    lefterisjp:  There is considerable work involved as a delegate even if you are not in a council/committee and the governance process relies on delegates performing that work. Right now it’s done pro bono. This is wrong.   I agree but unless I didn’t understand the change proposed I don’t think this matters in the future. Most of the work is to be done by the Council, delegates will just oversight (no need to spend much time reading grant proposals and so on since they will not vote on them anymore, they will only oversight).     system:  Non-Council delegates will no longer vote on each grant proposal. Instead, they will elect Council members and, if the Council continues in future Seasons, approve the Council budget. Throughout the Season, non-Council delegates will serve the important role of oversight on the Council and voting on other proposal types, such as protocol upgrades.   I don’t completely dislike this kind of solution since it provides the relief delegates wanted but from a decentralization perspective this is bad. Anyway, I hope the best for the Grants Council since the responsibility is much higher for them. It was an interesting experiment. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.947420634920634
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "9",
                    "likes": "1",
                    "time": "09/11/2022-11:36:30",
                    "content": "    Prometheus:  delegates will just oversight (no need to spend much time reading grant proposals and so on since they will not vote on them anymore, they will only oversight).   Providing oversight, means reading proposals and making sure the council does its work. Not to mention about all the rest of the work that governance should be doing (apart from grants). Keeping up with these forums alone is a job on its own  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.625
                },
                {
                    "author_link": "https://gov.optimism.io/u/Prometheus",
                    "index": "10",
                    "likes": "0",
                    "time": "09/11/2022-11:50:40",
                    "content": "    lefterisjp:  Providing oversight, means reading proposals and making sure the council does its work.   From a theoretical standpoint this is correct, nonetheless human nature doesn’t exactly work like that. Oversight will most likely work based on how things will turn out (instead of spending as much time reading many comments and trying to understand the proposal). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.21875
                },
                {
                    "author_link": "https://gov.optimism.io/u/mboyle",
                    "index": "11",
                    "likes": "5",
                    "time": "09/11/2022-13:51:32",
                    "content": "New projects with non-trivial amounts of complexity generally require a lot of labor, often by multiple specialized individuals. By locking grant money up for a year it limits the pool of builders to people who can afford to contribute significant amounts of work for free. This works against the goal of “maximizing the number of developers on Optimism.” ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.961363636363637
                },
                {
                    "author_link": "https://gov.optimism.io/u/GFXlabs",
                    "index": "12",
                    "likes": "2",
                    "time": "09/11/2022-16:04:32",
                    "content": "    system:  Format: proposers receive milestone-based grants <250k OP to pass on directly to their users as incentives for engaging with a protocol, platform, product or service. 40% of the grant will be distributed to the proposer upfront and the remaining 60% will be distributed upon completion of a mid-way point milestone. Completion of all milestones should be achievable in 3-6 months.   This is a really positive direction to move grant disbursements toward. It’s wonderful to see this. Great job!     system:   Non-Council delegates will no longer vote on each grant proposal. Instead, they will elect Council members and, if the Council continues in future Seasons, approve the Council budget. Throughout the Season, non-Council delegates will serve the important role of oversight on the Council and voting on other proposal types, such as protocol upgrades.    Given that the OP token has no use other than voting, and will not longer be used for voting very much, is there any thought given to how to continue to support the value proposition of holding OP? Will there be other, non-grants-related votes coming up that wouldn’t fall under the Grants Council? If not, how will engagement with OP holders be encouraged now that voting will become infrequent and based on personal ties vs proposals that can be evaluated?     system:  Council Budget The Council budget for Season 3 will be 5M OP.   Another excellent improvement! Without commenting on the correct level, having a budget is likely to raise the bar for submissions as the level of competitiveness increases. Very good addition.     system:  Reviewers will be compensated 14,000 OP per Season (subject to a 1-year lockup)   Is this a linear vest, a 1-year cliff, or some other arrangement? Thanks in advance for answering! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 6.420151515151515
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "13",
                    "likes": "1",
                    "time": "09/11/2022-16:31:14",
                    "content": "    GFXlabs:  Given that the OP token has no use other than voting, and will not longer be used for voting very much, is there any thought given to how to continue to support the value proposition of holding OP? Will there be other, non-grants-related votes coming up that wouldn’t fall under the Grants Council? If not, how will engagement with OP holders be encouraged now that voting will become infrequent and based on personal ties vs proposals that can be evaluated?   This is another very real and important point. What’s a governance token without governance? This proposal effectively diminishes (or even nullifies) the role of delegates. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.9071428571428575
                },
                {
                    "author_link": "https://gov.optimism.io/u/bobby",
                    "index": "14",
                    "likes": "5",
                    "time": "09/11/2022-17:48:26",
                    "content": "    GFXlabs:  Given that the OP token has no use other than voting, and will not longer be used for voting very much, is there any thought given to how to continue to support the value proposition of holding OP? Will there be other, non-grants-related votes coming up that wouldn’t fall under the Grants Council? If not, how will engagement with OP holders be encouraged now that voting will become infrequent and based on personal ties vs proposals that can be evaluated?   gm! This is an important question. The Token House is responsible for a broad set of governance decisions listed in the Operating Manual under “Valid Proposal Types.” To date, the Token House has only focused on the first proposal type – allocations from the GovFund. But the Token House is also responsible for protocol upgrades, inflation adjustments, treasury appropriations / Foundation budget, and Director removal. These responsibilities are super important to the future of Optimism. These additional proposal types will come online as we continue to iterate through seasons. Notably, Season 3 will include the first vote on a protocol upgrade for the upcoming Bedrock release. As a personal opinion, I’d also add that the voting power to establish grants council budgets, membership, renewal, scope, etc is a much higher-leverage decision that voting on individual grants themselves. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.7793981481481485
                },
                {
                    "author_link": "https://gov.optimism.io/u/bobby",
                    "index": "15",
                    "likes": "1",
                    "time": "09/11/2022-17:55:39",
                    "content": "    mboyle:  Locking up builder grants for a year really decreases the utility of a grant. Could someone elaborate on what the thinking is behind this?   Our goal here is to create long-term incentive alignment between the team and Optimism – not to fund up-front operational costs. If access to capital is a blocker for a team to keep building, Optimism can help put them in touch with additional guidance or resources. The builder grants council will get instructions on the right way to support teams in this position. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.732142857142857
                },
                {
                    "author_link": "https://gov.optimism.io/u/bobby",
                    "index": "16",
                    "likes": "0",
                    "time": "09/11/2022-18:38:29",
                    "content": "    GFXlabs:      system:  Reviewers will be compensated 14,000 OP per Season (subject to a 1-year lockup)   Is this a linear vest, a 1-year cliff, or some other arrangement? Thanks in advance for answering!   The lockup here is a 1-year cliff ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.930555555555555
                },
                {
                    "author_link": "https://gov.optimism.io/u/Bobbay_StableLab",
                    "index": "17",
                    "likes": "4",
                    "time": "10/11/2022-16:08:07",
                    "content": "Return of the Councils Councils are a step in the right direction. There was too much conflict between members and committees in making decisions. Instead empowering individuals to be on grant councils and trusting their decisions, removes a lot of the obstacles involved. Along as there is a clear path for reviewers to be off-boarded if necessary, then this is a good step forward. We want to clarify that if reviewers aren’t pulling their weight, then other team members or token holders should be able to follow an outlined process to remove them. Accountability Using a tool like Questbook for public accountability will help here. It’s a public and transparent tool for everyone to track grant updates and see grant distribution. They are free to use and can be split into sub-committees as mentioned in the proposal. You can see it being proposed in Compound too. Misc Grant reports Since the council will be voting on grants instead of token holders, they should provide reports that inform the community on the protocol, what they hope to achieve and why they were funded simply and concisely. If OPLabs has a template in mind, it would be great to share it. Transparency Aave, balancer, and Uniswap have good processes to keep grant information transparent. We should take inspiration from them. Documenting processes and grants in one place such as a notion page or questbook would be a good start. Delegate compensation Is a 1-year cliff fair? 50% released after 6 months, and the rest released after another 6 months. It’s a privilege to be paid retroactively, but waiting one year is a long time. Organizations like ours don’t have an issue with this, but this might deter individual delegates from getting involved. Process I agree with @lefterisjp here. Some form of grant waves would be easier, so both proposers and reviewers have a concrete plan to follow. Season 2 was a bit messy when it came to reviewing grants. ",
                    "links": [
                        "https://www.comp.xyz/t/cgp-2-0-delegated-domain-allocation-by-questbook/3352"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.116071428571429
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "18",
                    "likes": "3",
                    "time": "10/11/2022-16:30:34",
                    "content": "    Bobbay_StableLab:  Is a 1-year cliff fair? 50% released after 6 months, and the rest released after another 6 months.   I also think this is not correct. Delegates do work now and they should be compensated for their service now. If I gave my employees their salary with an 1-year lockup I would not have any employees. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/Bobbay_StableLab",
                    "index": "19",
                    "likes": "2",
                    "time": "10/11/2022-16:33:37",
                    "content": "No one raised it earlier, so I assumed people were in support of it. I was trying to find a middle option.  Ideally, I would prefer to see all members paid monthly similar to a salary, or when the season is complete (similar to Season 2). I don’t see the need for any lock up. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "20",
                    "likes": "1",
                    "time": "10/11/2022-16:34:11",
                    "content": "    lefterisjp:  I would like to explicitly split the cycles. Have cohorts. Only a specific number of grants go in a cohort, perhaps in a first come first serve basis? Perhaps in a simple application process? Then the council goes on a 3 weeks round of feedback and back and forth with the proposers to improve their proposal and align it with the interests of optimism.   I’ll add to this process weekly calls for proposers to talk about their projects and plans. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.214285714285714
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "21",
                    "likes": "9",
                    "time": "10/11/2022-17:47:46",
                    "content": "While I think this council is a good idea, we need a proposal filter. We should act like a Congress, with elected Representatives to filter the proposals, and an elected Senate to bring their expertise when the final proposal is ready and needs to be overseen by experienced people in the field. I would like to see this council as a house of representatives, engaged with the projects, giving feedback, reaching out to developers, and pushing optimism forward. And then people like SNX Ambassadors, Linda, Quix, Katie, Scott, Polynya, Lefteris, and basically all the big delegates to work as a Senate that gathers on the last week, reads very well-polished proposals passed by the representatives and give their pass to vote or to come back to representatives. I’m trying to include big brains here without wasting their precious time. About these 2 things:     system:  commit to spend roughly 12 hours a week on these responsibilities       system:  Reviewers will each be compensated 14,000 OP per Season (subject to a 1-year lockup)   As a committee member, I’ve worked 3 to 4 daily hs on this because I’m passionate about public goods and I feel is the only way to progress as a society. But passion doesn’t pay the bills sadly. The “1-year lockup” should at least be 1-year vesting with monthly unlocks. 833 OP to 1000OP monthly unlocks and 2000 OP to 6000 OP last unlock sounds better. Even if they don’t sell, they can LP, yield, farm, etc while working on this. On the other side  I’m trying to figure out how this will work:     system:  Possible RPFs: prospective builder grants for new projects, hackathons, technical content   Ok perfect I make a hackathon proposal, (the last one here in Argentina by The Graph had 40 devs if I’m not mistaken). I get funds approved on January 2023, and I receive 20k $OP, awesome! but     system:  Format: proposers receive grants <50k OP, which is locked for a period of 1-year    I can’t use them for 1 year? do I coordinate the hackathon for 2024? What does it mean locked? do you vest them in a contract? do you send it to my multisig and I have a 1-year restriction not to sell them? If I use $OP as a hackathon price do I send the prices one year later?  Lastly, EthernautDAO got a developer grant approved to maximize the number of developers building on Optimism. And this is what the Builders sub-committee will be doing. But someone has to promote this thing. My job since this grant was approved is to look for projects that want to be native or integrated with optimism, reach out and say “Hi we can pay one of your devs to train a new dev (web2 senior) and you can use this new build force to integrate your project to Optimism” and we are having amazing positive feedback from this projects and starting to coordinate everything but someone has to go and nock this doors. Call it marketing, integrator, or partnership searcher I think is missing on the builder’s committee. Please read all this as constructive feedback I would love to express all these ideas with positive vibes but I am not an English native speaker as you can see.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.701183712121212
                },
                {
                    "author_link": "https://gov.optimism.io/u/HCNAT0_NEU_Blockhain",
                    "index": "22",
                    "likes": "4",
                    "time": "11/11/2022-16:24:08",
                    "content": "In agreeance with decreasing the lock-up period / providing a vesting schedule instead. Personally would support more of a rolling 3 week vesting schedule after each voting cycle has passed to receive payment for council members. Per Dhannte’s suggestion on a Congress-esque structure, I think it would be great to involve delegates not on the Grants Council in this manner. Instead of having the Council decide which proposals to review, non-Council delegates would be able to have a higher threshold requirement for general support / against for passing along a proposal to the Council. This would require a larger majority of delegate support and actively involve them in approving proposal review. A maximum amount of support votes could be implemented. ie. There are 10 proposals requesting review. All non-Council delegates have 5 “support” votes per cycle. Delegate A may support proposals 1,2,3,4,6. Delegate B supports proposals 2,4,7,8,9. Delegate A can whip support and have Delegate B drop their support for proposal 9 and instead support proposal 1. Delegate A receives more backing to pass proposal 1 to the Council and Delegate B receives Delegate A’s support on a different proposal to back next cycle. Regardless of final method, it’s definitely important we focus on not spreading our Council too thin and having too many proposals to review and approve per cycle. I think non-Council delegate will play a key role in that sense and oversight for the Council. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.872549019607844
                },
                {
                    "author_link": "https://gov.optimism.io/u/Butterbum",
                    "index": "23",
                    "likes": "1",
                    "time": "11/11/2022-19:20:52",
                    "content": "Thanks for putting this together.  We are still in an experimental stage so its good to give all options a fair trial. I am concerned that this could lead to a decrease in participation as \"protocol upgrades, inflation adjustments, treasury appropriations / Foundation budget, and Director removal \" proposals are few and far between. I am not denying the importance of those votes just the frequency in which they occur. I realize there is also the important role of oversight on the Council by non-Council delegates and hopefully  this will encourage frequent constructive participation by community members and delegates. One suggestion would be we add one reserve/substitute reviewer per sub-committee. This will come in handy when a conflict of interest arises or if a council member is unfit or unavailable for a cycle. Another would be   commit to spend roughly 12 hours a week on these responsibilities   Increase the responsibilities by phrasing it~ commit to spend roughly 2 hours a day on these responsibilities. Coz it wouldn’t be helpful if reviewers are MIA for 4 days of the week as it’s there roll to provide feedback, answer questions and respond to comments. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.136363636363637
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "24",
                    "likes": "2",
                    "time": "11/11/2022-22:30:08",
                    "content": "The idea was that anyone could self-nominate. There are a relatively small number of delegates with >0.5% voting power. Additionally, some people have mentioned it may be beneficial to have outside experts on the Council, and they may not have significant voting power. This is a flexible parameter though, so if delegates disagree, let’s discuss! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.364583333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "25",
                    "likes": "1",
                    "time": "11/11/2022-22:45:08",
                    "content": "Thanks for the early feedback on this everyone! In terms of the three week voting cycle, we suggested a 3 week cycle to keep things consistent for proposers, but it will ultimately be up to the Council to decide if grant waves would be a more effective approach. We hear you on the lock-up limitations and are working on ways to address your concerns. On concerns about non-Council delegate activity, in addition to engaging on other high importance proposal types and high leverage decisions such as establishing grants council budgets, membership, renewal, and scope, there will be a multitude of other activities the Token House is responsible for in future Seasons. Grants are just the beginning. Stay tuned for updates shortly! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.781666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/harsha.questbook",
                    "index": "26",
                    "likes": "8",
                    "time": "13/11/2022-13:09:47",
                    "content": "(1/3) Thanks @Bobbay_StableLab for your comment and for introducing Questbook to the Optimism community. Hello everyone, I am Harsha, Co-founder, Questbook, and I will share how Questbook aligns with the vision of this process. Accountability Questbook offers a Web3 native platform that allows for the development and ongoing management of grants programs, including those focused on transparency and community, like with Optimism. With our platform, all actions happen on-chain, and all our code is open-source. Making Milestone-Based Payouts Using Questbook, you can make grant payouts once the proposer achieves the milestones defined by the lead/reviewers or by the proposer.  1062×1158 85.6 KB  ",
                    "links": [
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/7/78cb8db145746db8b20a64c151b9d13d89e68c2e.png"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/harsha.questbook",
                    "index": "27",
                    "likes": "8",
                    "time": "13/11/2022-13:11:20",
                    "content": "(2/3) Transparency and Reporting Each council’s performance can be publicly viewed and audited using rich dashboards. You can also Increase community members’ participation to keep grant programs accountable (measured by the number of people looking at the dashboard and participating in voting)  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.9375
                },
                {
                    "author_link": "https://gov.optimism.io/u/harsha.questbook",
                    "index": "28",
                    "likes": "9",
                    "time": "13/11/2022-13:13:08",
                    "content": "(3/3) Past Engagements We have engaged with various kinds of organizations since our formation. We have built a platform that grows community involvement and streamlines the grants management lifecycle. You can read a bit more about the different kinds of organizations we have worked with in this article. One area we have commonly seen as challenging for Foundations and DAOs to address is transparency and accountability. Decentralized governance revolves around the potential that these networks can unlock. In practice, solving these kinds of challenges and building solid systems is very difficult. We have developed an approach we call Delegated Domain Allocators (DDA). We have begun working with Protocol DAOs (most notably our work with Compound, proposal. This approach could help provide a structure that balances community participation, proposal oversight, and transparency. In addition to our work around the DDA concept, we have helped Ecosystem DAOs, like Polygon DAO, develop and scale their grants program over time. While the DDA approach is interesting, it is no longer required to use our platform. We would welcome the opportunity to engage with this community and its stakeholders to discuss how our experience and platform may be valuable and help build greater accountability and transparency while allowing for a streamlined approach that scales with community engagement. ",
                    "links": [
                        "https://www.comp.xyz/t/cgp-2-0-delegated-domain-allocation-by-questbook/3352/1"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None"
                    ],
                    "Sentiment": 5.8999999999999995
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "29",
                    "likes": "2",
                    "time": "13/11/2022-21:25:11",
                    "content": "The 0.5% filter on this council will only concentrate more power and will leave behind many hard working users, more than 10 ex committee members won’t be able to apply. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.934523809523809
                },
                {
                    "author_link": "https://gov.optimism.io/u/nickbtts",
                    "index": "30",
                    "likes": "0",
                    "time": "14/11/2022-11:52:04",
                    "content": "The council should, I believe, have a blend of experts/builders and empowered delegates, with a dedicated number of seats for each role. The 0.5% filter seems reasonable for said delegates, as over time protocols will (and should) accrue more of a say over OP governance. OP governance is currently bureaucrat heavy; some community members with very little voting power and debatable experience have an outsize voice and influence. It’s important community members have a say, but not at the expense of protocols who have bet their future on Optimism (SNX, as an example). To note: delegates who do not meet the threshold can always campaign (and should attract delegations if their work was worthwhile) or simply buy OP! A possible compromise here could be to have one seat for a non-expert, below-threshold “delegate”, thus mitigating votepower as a vote influence for that particular seat. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.601325757575758
                },
                {
                    "author_link": "https://gov.optimism.io/u/Prometheus",
                    "index": "31",
                    "likes": "1",
                    "time": "14/11/2022-13:17:57",
                    "content": "    nickbtts:  It’s important community members have a say, but not at the expense of protocols who have bet their future on Optimism (SNX, as an example).   Interesting wording. Anyway, protocols and projects can listen to community members (aka users) or not, If community members aren’t welcome don’t expect them to stay. After all, protocols are irrelevant without users and that’s probably why many protocols/projects/teams/whatever need grants and incentives to exist. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.416666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/madhavanmalolan",
                    "index": "32",
                    "likes": "1",
                    "time": "14/11/2022-19:17:02",
                    "content": "See also : CGP 2.0 - Delegated Domain Allocation by Questbook - Proposals - Compound Community Forum The compound “council” for running their grant program CGP2.0 ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "33",
                    "likes": "6",
                    "time": "15/11/2022-15:12:33",
                    "content": "Based on community feedback, the following updates have been made:  The one-year lock up on Council rewards has been removed In regards to builders grants, added: “If access to upfront capital is a blocker for applicants, Optimism may put them in touch with alternative resources to support teams in this position.” Added: “There will be a multitude of other activities non-Council delegates will be responsible for in future Seasons.” Added the following Council responsibilities:  “filter and process all grant applications. Every grant applicant should receive a response, even if their proposal will not proceed to Council review.” “ensure ongoing Council operations and performance are transparent to the community”   Edited: “three week cycle” to “regular cycles”  This is not a final version. The Reflection Period officially starts on 11/17/22, so there is plenty of time for additional feedback. For example, an open question for additional discussion:  As the Council is currently designed, there is no eligibility requirement for members to hold >0.5% voting power. Should any of the Council positions require >0.5% voting supply for eligibility?  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.046875
                },
                {
                    "author_link": "https://gov.optimism.io/u/jrocki.eth",
                    "index": "34",
                    "likes": "0",
                    "time": "16/11/2022-08:00:41",
                    "content": "    lavande:  Added the following Council responsibilities:  “filter and process all grant applications. Every grant applicant should receive a response, even if their proposal will not proceed to Council review.”    I am inferring that the filtering process for grant applications that will be defined by the council determines what proposals ARE and ARE NOT reviewed correct? My concern here is lack of transparency in that filtering process as we all know that proposers are going to want to know exactly why their grant did not even make it to council review. This problem was accounted for in Season 2 as everyone knew you have to get 2 delegates with >.5% voting power to approve your proposal before it moved to an official review/vote Is there a way we can explicitly state that there needs to be transparency in whatever this filtering process ends up being? Suggestion: modify the statement to: *“filter and process all grant applications. Every grant applicant should receive a response, even if their proposal will not proceed to Council review. If the proposal does not proceed to Council review the reasoning for this decision should be included in a public response to the grant applicant” ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.416666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/jrocki.eth",
                    "index": "35",
                    "likes": "0",
                    "time": "16/11/2022-08:31:40",
                    "content": "    lavande:  As the Council is currently designed, there is no eligibility requirement for members to hold >0.5% voting power. Should any of the Council positions require >0.5% voting supply for eligibility?   Logic for why the >0.5% voting supply was an appropriate requirement in Season 2: I saw the logic in requiring at least one person on each committee to have >.5% voting supply as this was loosely tied to the requirement of proposals needing two delegates with >.5% voting supply to approve the proposal before it moved to an official review/vote. It only makes sense for the people paying the most attention to have the required voting supply available needed move these proposals through that approval gate. Logic for not including >0.5% voting supply as an eligibility requirement in Season 3: I logically do not see a reason to include >.5% voting supply as an eligibility requirement for any of the council positions as these are positions you are elected into, based on your merits, by a group of your peers. Putting additional restrictions on these elected positions may disqualify the best candidate. Effectively the amount of voting power you have has no bearing on how well you are able to do your job in season 3. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.362762237762238
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "36",
                    "likes": "1",
                    "time": "16/11/2022-14:07:55",
                    "content": "    lavande:  The one-year lock up on Council rewards has been removed   IMO this must be vested over a 6 to 12-month period with monthly releases. What a council member approves will directly benefit or harm his own future tokens over the next year.     lavande:  In regards to builders grants, added: “If access to upfront capital is a blocker for applicants, Optimism may put them in touch with alternative resources to support teams in this position.”   I’m trying to wrap my mind around how these OP tokens can be used for hackathons and technical content with the year lock. Can you guys express an example of what you are thinking to better understand it? All proposals going for this fund will have to provide their own treasury and metrics on the next year’s expenses, otherwise, we will be approving teams, projects, and hackathons without knowing if they have sufficient funds to be here 1-year latter.     lavande:  Added: “There will be a multitude of other activities non-Council delegates will be responsible for in future Seasons.”   We should work on expressing these activities in advance before approving this draft. It’ll give delegates a sense of participation and legitimize the Council.     lavande:  “filter and process all grant applications. Every grant applicant should receive a response, even if their proposal will not proceed to Council review.”   I love it! I suggest council members have to ability to modify tags on proposals. As an ex-committee member I struggled with the forum coordination, I suggest:  Enforce all new proposals to tag council members the first time they post it Create a “not review by council” tag Create a “review by council tag”      lavande:  “ensure ongoing Council operations and performance are transparent to the community”   Let’s define the official channels:  Read-only discord channel for the council to chat and coordinate Forum responses  Let’s keep it simple and clear, we don’t want council members going through 3 or 5 channels of communication and missing relevant information. Also create a Council tag on discord for any relevant meeting, kyc, or presentation they need to be aware of to be used by Optimism members. Council call calendar and pre-define if google meet, zoom, discord etc. Transparency with the community it’s a must but at the same time, the community should know where the council’s transparency is.     lavande:  As the Council is currently designed, there is no eligibility requirement for members to hold >0.5% voting power. Should any Council positions require >0.5% voting supply for eligibility?   I can see council leaders be >0.5% to have both Optimism governance representation, skin in the game, and give the council legitimacy. But delegations didn’t move that much since the airdrop. We got big delegates because they are well-known people in the space, not because they made a great job at reviewing proposals or for their long and great commitment to this governance. If you want to filter candidates do it for the job they put into governance these last 2 seasons not because of how influencers they are in the space when an airdrop happens. We want good reviewers, not good politicians wasting time champagning for their delegation % instead of doing the actual job they were elected to do. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.838842975206612
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "37",
                    "likes": "1",
                    "time": "16/11/2022-22:18:44",
                    "content": "I would also like to know how this election process will be. If I wanted to be part of de developer’s grant subcommittee, will I have to make my \"delegate council member \" proposal? If this is true, looking at the dates, this proposal will be approved:   Dec 8th - Dec 21st: Special Voting Cycle #9a (voting on grants council and protocol delegation program proposals)  And council members will be voted on:   Jan 5th - January 18th: Special Voting Cycle #9b (any proposals contingent upon passing in Special Voting Cycle #9a). If Special Voting Cycle #9b is not necessary, Season 3 may start on January 5th  This leaves   December 22nd - Jan 4th: Holiday break  as the only possible dates to create my hypothetical “Delegate council member” proposal. I think the Council Election process needs more clarity and at least 2 or 3 days outside Holyday Break for people to work on their nomination. I have no problem working on these dates btw just figuring out how all this is going to work. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.722527472527473
                },
                {
                    "author_link": "https://gov.optimism.io/u/Michael",
                    "index": "38",
                    "likes": "0",
                    "time": "20/11/2022-18:45:05",
                    "content": "In response to the 0.5% requirement, I agree that this shouldn’t be relevant, as the members will be judged on merit and experience anyways.     nickbtts:  To note: delegates who do not meet the threshold can always campaign (and should attract delegations if their work was worthwhile) or simply buy OP!   Just wanted to counter this point. Delegation has been very sticky and after the initial airdrop. There is currently no avenue or process for “worthwhile work” to be rewarded with more delegation, which in my opinion is a missed opportunity to align incentives. As far as just buying OP, the current price to hit 0.5% is ~$105k. At peak OP prices this was ~$235k. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.944444444444445
                },
                {
                    "author_link": "https://gov.optimism.io/u/Boardroom",
                    "index": "39",
                    "likes": "4",
                    "time": "21/11/2022-22:27:54",
                    "content": "Hi everyone – At Boardroom we recently wrote a “Brief” on this Grants Council proposal. We provide some background for those not steeped in Optimism, and write a bit about why such adaptations in governance are important. Take a look, if you’re interested!    boardroom.mirror.xyz    Optimism Introduces a Grants Council for Season 3 Optimism is a leading Ethereum Layer 2 protocol, known as much for the success of its rollup design as for its public-goods-oriented ethos. Also notable is that governance in Optimism explicitly posits itself as an experiment. The Optimism Foundation...      ",
                    "links": [
                        "https://boardroom.mirror.xyz/0XdiKXyT7CxqbheB13gM9p0Ylcz6TxqaYkgW6XglQCQ"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party advertising proposal",
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.223214285714286
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "40",
                    "likes": "8",
                    "time": "23/11/2022-14:35:10",
                    "content": "Updates based on delegate feedback:  Clarified that there is no minimum voting power requirement for Reviewers Removed specific criteria that 1 member of each sub-committee must have previously served on a committee. Previous committee experience will be indicated on the self-nomination template, so if that experience is valued, votes should reflect that  More information on the Lead application and Reviewer election process to follow next week (both contingent on the Grants Council passing in Special Voting Cycle #9a) ",
                    "links": [
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/19",
                        "https://gov.optimism.io/t/op-community-governance-call-december-6th-at-10am-pt-1pm-et-7pm-cet/4112"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.302721088435374
                },
                {
                    "author_link": "https://gov.optimism.io/u/Defi_LATAM_axlvaz",
                    "index": "41",
                    "likes": "1",
                    "time": "26/11/2022-04:24:08",
                    "content": "I think the Grants Council is a good way to go. I will add some questions and suggestions: 1- Are we going to see a template for applying to the council? 2- It would be good for the Grants Council to present a framework to governance and have governance approve it. That way we all know how the process works. 3- According to the Season 3: Course Correction, January 5 is scheduled to start cycle 3. I don’t think they are giving the council time to get organized to start working, by that date I don’t think the processes are in place. Something that happened with the committees in the first votes because it was all very fast and there was no time to organize the work. I think the council should be given time to establish a framework and present it in governance, so that the process is more orderly and transparent.    Guide to Season 3: Course Correcting   The next few weeks will follow the below schedule, as original outlined in Governance Update #4 :   Nov 10 - Nov 16th: Off-Season for Committees to allocate the retroactive component of their compensation  November 17th - December 7th: Reflection Period  Dec 8th - Dec 21st: Special Voting Cycle #9a (voting on grants council and protocol delegation program proposals)  We are making the following updates to the schedule following Special Voting Cycle #9a:   December 22nd - Jan 4th: Holiday break  Jan 5th - January 18th: Special Voting Cycle #9b (any proposals contingent upon passing in Special Voting Cycle #9a). If Special Voting Cycle #9b is not necessary, Season 3 may start on January 5th  January 19th: Season 3 starts with Voting Cycle #10     ",
                    "links": [
                        "https://gov.optimism.io/t/guide-to-season-3-course-correcting/3942/1",
                        "https://gov.optimism.io/t/governance-update-4/3435"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.067678571428572
                },
                {
                    "author_link": "https://gov.optimism.io/u/diligit",
                    "index": "42",
                    "likes": "3",
                    "time": "26/11/2022-19:18:48",
                    "content": "    Defi_LATAM_axlvaz:  1- Are we going to see a template for applying to the council?   Yes:     lavande:  More information on the Lead application and Reviewer election process to follow next week (both contingent on the Grants Council passing in Special Voting Cycle #9a)       Defi_LATAM_axlvaz:  2- It would be good for the Grants Council to present a framework to governance and have governance approve it. That way we all know how the process works.   It will be more relevant if/after the proposal to form the Grants Council passes     Defi_LATAM_axlvaz:  3- According to the Season 3: Course Correction, January 5 is scheduled to start cycle 3. I don’t think they are giving the council time to get organized to start working, by that date I don’t think the processes are in place. Something that happened with the committees in the first votes because it was all very fast and there was no time to organize the work.   Season 3 will start on January 5th if the proposal to form the Grants Council does not pass in voting cycle 9a, if it does pass then on January 5th voting cycle 9b will start in which Council members will be voted on.    Guide to Season 3: Course Correcting   Jan 5th - January 18th: Special Voting Cycle #9b (any proposals contingent upon passing in Special Voting Cycle #9a). If Special Voting Cycle #9b is not necessary, Season 3 may start on January 5th   ",
                    "links": [
                        "https://gov.optimism.io/t/guide-to-season-3-course-correcting/3942/1"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.355803571428571
                },
                {
                    "author_link": "https://gov.optimism.io/u/SEED_LATAM_Joxes",
                    "index": "43",
                    "likes": "10",
                    "time": "04/12/2022-12:31:55",
                    "content": "Hi all, these are our first feedbacks about the Grants Council, feel free to leave an opinion on any of these points written below:  Our thoughts about the Council Grants We believe Council Grants is a step in the right direction in a mix of radical but consistent changes in the iteration of governance processes. As participants of 2 committees (DeFi C and Tooling), we experienced both positive and negative situations, discovering all participants’ preferences, process criteria and desired outcomes during governance, which didn’t necessarily meet all the goals set at the beginning of governance. We also believe that the council will decrease the workload of the delegates in a more obvious way, this in the future unlocks new responsibilities such as those already named in the proposal. Other councils could even be formed in the future if governance so desires.  About the structure of the Council The structure of the council is well proposed, both in terms of the number of members and the constitution of 2 sub-committees. The budgets allocated to each sub-committee are reasonable and consistent with the work requested.  About the responsibilities of the Board The responsibilities are well focused. However, we have to highlight some points:  “Applications that are submitted to the Council database should also be published to the Forum, unless a proposer opts-out of Forum publication”. We believe that governance processes must be 100% transparent, all applications must be published in the forum. We believe that order is an important factor, currently applications enter the forum on any given day and this makes follow-up and feedback difficult. One or two days should be established where applicants have time to submit their proposal. For example, the first two days of the voting cycle. One of the responsibilities of the leader is to coordinate the subcommittees and organize regular meetings of the council. We suggest that these meetings be open and public so that any governance member can attend and that there be a brief time for open questions to the council. For example, if every Thursday the council has a meeting, the last 10 to 15 minutes open it up to questions from the governance members. Once the Grant Council members are elected, they should submit a proposed framework and this should be voted on by the governance by way of reconfirmation, to maintain transparency of processes and workflows, in favor of opening a window of opportunity for feedback once members are confirmed. We recommend that the Council have an independent communication instance (e.g. Twitter, Lens) to publish reports and summaries of the work carried out. This should serve as an external source of consultation and promotion so that the rest of the ecosystem is up to date on what is being built in Optimism and attract more interested parties.   About Council Membership As mentioned above, the number of council members is consistent and in line with the work to be performed. We’re 100% in agreement with the remuneration of the council members. If this council system continues for several seasons, we believe that subcommittee members should not be re-elected for more than 3 consecutive seasons. Detail:  A member is voted for 3 consecutive seasons to be a member of the committee, in the following season he/she cannot reapply. A member is voted for 2 consecutive seasons and in the 3rd season is not voted, he/she can reapply in the 4th season. A member is re-elected for 3 consecutive seasons, in the 4th season he/she may not stand for re-election. He/she may be elected in the 5th season.  This idea is so that all governance members know that they have the opportunity to participate in the council. Another point to establish is a framework where governance members can remove the leader or a consensus member in case of non-compliance with the Code of Conduct, being involved in an external conflict (rugpull, scam, etc.) or going against the Optimistic Vision. The same complaint form could be used for delegates.  About the Council budget We fully agree that the council should have a budget, that it should be voted on each season by the governance and that it should seek to be aligned with the objectives of each season and good management of the available resources.  Other issues  We were glad that the governance members didn’t agree with the one-year block. In Latam we live in unstable economies and with constant inflation, we know that it is really difficult to stay active without a livelihood. We were also in favor of eliminating the 0.5% filter, we and other members have been active and have less than 0.5% of the voting power, in this case expertise, reputation and track record should be sufficient. Inclusion is the way to consolidate the participation of more users in governance.   Final So far we are pleased with this proposal and with what is to come in Optimism’s governance. We strongly believe that the grant council is the right way forward. We look forward to further developments. ",
                    "links": [
                        "https://gov.optimism.io/t/delegate-code-of-conduct/3943",
                        "https://www.optimism.io/vision",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/21",
                        "https://gov.optimism.io/t/defi-latam-delegate-communication-thread/2950/14"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.583035714285715
                },
                {
                    "author_link": "https://gov.optimism.io/u/MattL",
                    "index": "44",
                    "likes": "4",
                    "time": "04/12/2022-19:54:41",
                    "content": "First off, I just want to come in and say that I agree with this sort of idea of still giving a voice to larger delegates, who have shown that they have expertise across Optimism and can help to give a final stamp of approval to protocols / etc. But here are some of my other thoughts on the proposed grants council I support the new path for the following reasons:  The Grants Council establishes a much better place for protocols to discuss their proposals, which will help to avoid confusion and improve communication between protocols and voters. There were MANY instances of protocols not really knowing who’s in charge when trying to solicit feedback, and committees weren’t the best solution for this. The Grants process fixes this issue, and gives power to grants council to work with individual protocols.  Clear structure and responsibility for those involved in the grant process. Yet again, there were many times committees kicked the can over to voters, which wasn’t ideal for some harder votes. While a minor point, the on-chain voting issues are semi-addressed, which will help to make the process more efficient. Though the core of this issue still hasn’t been fixed.  However, I have some criticisms of the proposed system:   Delegate compensation shouldn’t be locked under a vesting schedule, or at least the 1 yr vesting schedule proposed. This could push away talented individuals who may not have the time to work for free and wait for payment without knowing if the tokens will be worth anything in the future.  OP Token usefulness -  There’s really no clear use for OP tokens once this has been implemented. That’s why Dhannte’s idea of still having this be in place for a final stamp of approval on the grants process, could be helpful, like two governing bodies working with one another to best support Optimism. But overall, I’m curious how Optimism foundation / fututure governance, solves this problem. I am not a fan of the OP Foundation imposing arbitrary constraints on approved grants.  Overall, I support the path to the grants council and Dhannte’s idea for large delegates to bring their expertise and help ensure that there is still oversight by various experts. I think this will help to make the Grants Council system more effective and ensure that the best decisions are made for the benefit of Optimism. EDIT: @lavande see below convo regarding compensation, looks like it will not face a 1 yr lockup anymore ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.182235621521336
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "45",
                    "likes": "0",
                    "time": "05/12/2022-00:16:14",
                    "content": "thanks matt, one clarification:  the original draft of the proposal included a 1 year lock-up on delegate compensation but that has since been removed. delegate compensation will not be subject to a 1 year lock-up.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving clarification on proposal"
                    ],
                    "Sentiment": 5.680555555555555
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "46",
                    "likes": "0",
                    "time": "05/12/2022-00:16:53",
                    "content": "hey everyone - thanks for the additional feedback, we’re working on an update, which we will post shortly ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/MattL",
                    "index": "47",
                    "likes": "0",
                    "time": "05/12/2022-00:27:50",
                    "content": "Ah perfect, thanks for the clarification. I’ll edit my original post to reflect that! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.78125
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "48",
                    "likes": "11",
                    "time": "06/12/2022-19:53:48",
                    "content": "Thanks again for all the feedback throughout the reflection cycle. A final version of this proposal will be posted shortly, which will reflect the following updates:   Added: If a proposal does not proceed to Council review, a brief reasoning for this decision should be included in a public response to the grant applicant and proposers should work with non-Council delegates to refine their proposal for re-submission in the next grant cycle.   Added (to list of non-Council delegate responsibilities): Working with proposers to refine proposals deemed unfit for review by the Council   Clarified: Grant cycles should include a deadline for proposal submission before a review period begins   Clarified: Grant decisions must be published for all reviewed proposals (both approvals and rejections)   Added: Term limits may be added in the future, should the Council continue for multiple Seasons.   Changed: While sub-committee budgets will remained fixed, individual grant size limits are now suggested versus mandated   Changed: Council Lead will “process and filter applications” to Council Lead will “ensure applications that are submitted to the Council database are also published to the Forum”   Changed: “The Foundation recommends 3 week cycles” to “previous Seasons followed 3 week cycles”   Added: It is suggested that meeting minutes or summaries be made available to the community. Open meetings are encouraged.   Added: While the Council should abide by the above guidelines, specific operational and administrative details are left to the Council Lead to determine with input from Reviewers. The Council, if/once formed, will be expected to publish an operating framework outlining Council operations in detail. The Season will run nine weeks from the publication of the operating framework. In future Seasons, this framework may be included in Council proposals, which would make it subject to approval by the Token House.   Added: Links to self-nomination template for Reviewers   Final version ",
                    "links": [
                        "https://gov.optimism.io/t/special-voting-cycle-9a-grants-council/4198"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.108333333333333
                }
            ]
        }
    ],
    "group_index": "328"
}