{
    "poll_list": [
        {
            "id": "0x7c2da0957e9e7660f9f6219c05291c0907bed79c10b6da15a95416e68cbb4ac1",
            "title": "Season 2 Governance Fund Proposal: OptiChads",
            "discussion": "https://gov.optimism.io/t/ready-gf-phase-1-proposal-optichads-nft-project/3430",
            "body": "This Governance Fund Phase 1 proposal is eligible for voting in Cycle 6. For a complete list, check out [Voting Cycle 6 Roundup](https://gov.optimism.io/t/voting-cycle-6-roundup/3481).\n\nThis proposal is slated for review and recommendation by [committee name/link]. Please refer to [their thread] for this cycle to read more. Committees will post their recommendations by the 3rd day of the Voting Week. \n\nAs a reminder, since this is the first vote since the [introduction of committees](https://gov.optimism.io/t/introducing-governance-committees/3238): by approving committees, the Token House entered a social contract to entrust and delegate the bulk of decision-making to the committee. Therefore, any delegates voting against the committee recommendation are expected to provide a justification to the community as to why they voted differently.",
            "choices": [
                "For",
                "Against",
                "Abstain"
            ],
            "scores": [
                11613004.027470924,
                286487.3714472148,
                228234.05931700213
            ],
            "start": 1663873790,
            "end": 1664392190,
            "snapshot": "24630258",
            "state": "closed",
            "author": "0x47C88bb92B409fF25F6587EA611fac4e55f76007",
            "space": {
                "id": "opcollective.eth",
                "name": "Optimism Collective"
            }
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/ready-gf-phase-1-proposal-optichads-nft-project/3430",
            "title": "[READY] [GF: Phase 1 Proposal] OptiChads NFT Project ",
            "index": 3430,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Governance Fund: Phase 1"
            ],
            "tags": [
                "cycle-6",
                "passed"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/Dicaso",
                    "index": "1",
                    "likes": "22",
                    "time": "09/09/2022-12:39:28",
                    "content": "Project name: OptiChads Author name: Dicaso on behalf of OptiChads L2 recipient address: 0x10850762bac0dc6660630c1effe188a7cbfddc88 Grant category: NFTs & Gaming Number of OP tokens requested: 50,000 Is/will this project be open sourced? Yes. We are CC0. I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: Yes Is this proposal applicable to a specific committee?  Yes Project description: A 10K PFP project encouraging Health & Wellness in Web3 and beyond. 50% of mint / royalties donated to public goods funding! (Over 6E so far!) Project links: https://linktr.ee/optichads Additional team member info: Our dev, Distractionboy, is the cofounder of Optimistic Bunnies and is well known within the OP NFT community. Relevant usage metrics: 1,738 Unique Holders 4,994 Trades 20E Trading Volume 6E+ Donated to Public Goods Smart Contract:   Optimistic Ethereum L2 Explorer    Contract Address 0x9B9F542456ad12796cCB8EB6644f29E3314e68e1 | Optimism The Contract Address 0x9B9F542456ad12796cCB8EB6644f29E3314e68e1 page allows users to view the source code, transactions, balances, and analytics for the contract address. Users can also interact and make transactions to the contract directly on...      Optimism native? Yes. Date of deployment: August 2, 2022 Ecosystem Value Proposition: Our focus is improving Health & Wellness in Web3 through our art. We have a very active and passionate community of Chads focused on self improvement in and out of the gym. Through community efforts such as giveaways and fitness challenges, we have grown to be one of the top NFT projects on Optimism by trading volume. As we scale we plan to introduce more and more benefits to our holders such as fitness and wellness/mental health counseling, discounts on protein products, etc.The art was hand drawn by myself with attention to detail in mind - with the goal of bringing more normal users, as well as degenerates into Optimism. As far as street cred is concerned, Vitalik has liked some of our posts regarding our donations to RPGF, and we are the only project on Optimism followed by Opensea. At our core we are a community of like minded fitness lovers and are working to bring more users into Optimism with our existing relationships and by building new ones. Optimism cannot succeed without a vibrant NFT community. NFTs bring new entrants into the ecosystem, hype, and stickiness. These are things we need to develop and foster together!  99141200×1200 149 KB  Proposal for token distribution: We’ve partnered with https://quest3.xyz/ a Web3 Quest and event platform, and will use their service to do a series of fitness related contests where we can reward our NFT holders OP provided they completed the tasks. The Quest3 incentives would be the first of their kind, essentially the NFT community’s equivalent to DeFi’s incentivized liquidity mining as I see it. For verification we are able to review submissions manually through the platform before rewards are dispersed.We plan to use some of the funds to set a reward of 1 OP for users who follow our social media channels.This direct marketing approach is a more effective and efficient use of capital by leveraging Web3. The result should be exponential growth and awareness, and a positive network effect. We would like to have a series of weekly quests over a period of 2 months, beginning with a contest that rewards holders who have done a certain amount of steps, followed by a pushup challenge the next week, etc. We would allocate 100% of our OP allocation to these quests. We will be using our own NFTs and Eth from royalties after the incentives are complete to continue these challenges and keep our community swole.We already have a strong following and track record of Discord and Twitter challenges. So we hope to use the funds strategically, as we’ve done before to drive volume to Optimism. NFT projects such as OptiChads in turn benefit Public Goods funding and the ecosystem as a whole. co-incentives: 50 NFTs to the top addresses with the best completion rate ",
                    "links": [
                        "https://linktr.ee/optichads",
                        "https://gov.optimism.io/t/draft-so2-committee-proposal-nfts-gaming-group-a/3364",
                        "https://twitter.com/OptiChads/status/1559441162498461696",
                        "https://linktr.ee/optichads",
                        "https://twitter.com/DistractionBoy_",
                        "https://www.optimisticbunnies.com/",
                        "https://optimistic.etherscan.io/token/0x9b9f542456ad12796ccb8eb6644f29e3314e68e1#balances",
                        "https://qx.app/collection/optichads",
                        "https://qx.app/collection/optichads",
                        "https://twitter.com/OptiChads/status/1559441162498461696",
                        "https://optimistic.etherscan.io/address/0x9B9F542456ad12796cCB8EB6644f29E3314e68e1",
                        "https://optimistic.etherscan.io/address/0x9B9F542456ad12796cCB8EB6644f29E3314e68e1",
                        "https://optimistic.etherscan.io/tx/0xbb8e8aa349ac60fed06df1d179b3aed19267891cd707c23f3065840a52bf6062",
                        "https://qx.app/stats",
                        "https://twitter.com/OptiChads/status/1539888345731440641",
                        "https://twitter.com/OptiChads/status/1555417627052359682",
                        "https://twitter.com/BigCryptoAlert/status/1562141890144866306",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/5/5c2c52bbeb61c95cf67f4cd871c53a574111bdde.webp",
                        "https://quest3.xyz/",
                        "https://twitter.com/OptiChads/status/1561394539117813760",
                        "https://gov.optimism.io/t/voting-cycle-6-roundup/3481/14",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-optichads/4858",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-optichads/4858/32",
                        "https://gov.optimism.io/t/gfx-labs-delegate-communication-thread/2728/16",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/9",
                        "https://gov.optimism.io/t/defi-latam-delegate-communication-thread/2950/8"
                    ],
                    "GPT-summary": "The post is a proposal for the OptiChads NFT project, which aims to encourage health and wellness in Web3 and beyond. The proposal includes details about the project, such as the number of tokens requested, the team members, and relevant usage metrics. The author also explains how the project will be open-sourced and how the funds will be used to incentivize NFT holders to participate in fitness-related contests. A 3rd party gives entirely positive feedback on the proposal and extends to the proposal by offering co-incentives.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Identity and reputation systems",
                        "Smart contract updates",
                        "Community and engagement",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 6.054443993506493
                },
                {
                    "author_link": "https://gov.optimism.io/u/Squeeks",
                    "index": "2",
                    "likes": "4",
                    "time": "09/09/2022-15:51:35",
                    "content": "Well written and thought out proposal. I support this 100% ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/jrocki.eth",
                    "index": "3",
                    "likes": "4",
                    "time": "09/09/2022-16:56:19",
                    "content": "Exciting! Can’t wait to get the communities reaction to this! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.34375
                },
                {
                    "author_link": "https://gov.optimism.io/u/espresso",
                    "index": "4",
                    "likes": "4",
                    "time": "09/09/2022-17:37:33",
                    "content": "Love to see an NFT project that follows the trend of supporting public goods, and the focus on health & wellness is something we don’t see enough of in web3. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.9375
                },
                {
                    "author_link": "https://gov.optimism.io/u/mteoptimism",
                    "index": "6",
                    "likes": "4",
                    "time": "09/09/2022-20:02:12",
                    "content": "I support it. This can boost nft community on optimism. but also, use this 50%  of it to airdrop to the early believer in the project as well. As 90 percent to fitness challenges seems that team has motive to get hold of all the funds. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/Dicaso",
                    "index": "8",
                    "likes": "6",
                    "time": "10/09/2022-02:22:11",
                    "content": "Thanks for the comment! I think rewarding active holders will be more adventageous because it will allow us to iterate based on participation and feedback. We could airdrop OP to our users as many DeFi protocols have done, but with what we are asking for (50,000 OP) we can only airdrop 31 OP between all of our holders before quickly depleting the funds. Getting this proposal passed would be huge for the OP NFT Community like you said, so we wanted to be precise and realistic with what we were asking for and how it would be given out. I am curious what other people think about this, but it’s not possible to do a meaningfull airdrop with only 50,000 tokens and I am fine with that number for challenges and to get the ball rolling for the NFT community. As far as “the team holding all the funds” we kind of have to in order to disperse them to the community with the Quests. With the donations we have already made to RPGF we have established a lot of credibility in the Optimism community already, and we aren’t exactly asking for a Lambo so the incentive is high for us to keep building. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.110087719298246
                },
                {
                    "author_link": "https://gov.optimism.io/u/Dicaso",
                    "index": "9",
                    "likes": "4",
                    "time": "10/09/2022-02:23:12",
                    "content": "thanks for the comment, appreciate the support! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/Dicaso",
                    "index": "10",
                    "likes": "4",
                    "time": "10/09/2022-02:23:47",
                    "content": "thanks exciting what this can do for the nft community! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.4375
                },
                {
                    "author_link": "https://gov.optimism.io/u/Dicaso",
                    "index": "11",
                    "likes": "3",
                    "time": "10/09/2022-02:24:41",
                    "content": "appreciate it! hopefully Optimism NFTs can see the same sort of volume that Solona NFTs are seeing as more and more people get priced out of Ethereum Layer 1. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.666666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/HippoPaw",
                    "index": "12",
                    "likes": "3",
                    "time": "10/09/2022-10:06:01",
                    "content": "This project is full of new things, and will continue to grow along with the quixotic market, and also I’m sure every project from optimism network will be more and more popular.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.9902597402597415
                },
                {
                    "author_link": "https://gov.optimism.io/u/NFTELARCA",
                    "index": "13",
                    "likes": "1",
                    "time": "11/09/2022-04:29:25",
                    "content": "im here working for everyone ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/maykung",
                    "index": "14",
                    "likes": "1",
                    "time": "11/09/2022-13:36:44",
                    "content": "I like the idea of using real events to keep the holders and community to remain active which can also indirectly increase the value of the NFT itself. Although, I’m a bit curious on how to manually check to verify the participants to see who are eligible for the rewards. I’m not sure if all those health applications can be tricked to count false steps without actually walk such as using a fake gps app. So, it would be great if you can clarify on the verification process. Also, I don’t think it’s a good idea to reward $OP for random users who just follow your social media channels. People can create multiple social accounts to follow to receive $OP. It’s just a way to increase followers who may not care about the community and will probably unfollow after they receive $OP. Perhaps, giving $OP to verified NFT holders might be a bit better, however, I don’t see the benefit to the community in the long run by just giving $OP like this, even to the NFT holders. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.104166666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/Dicaso",
                    "index": "16",
                    "likes": "2",
                    "time": "11/09/2022-14:20:42",
                    "content": "Hi thanks for the feedback. We will try to tailor the rewards to avoid sybil. We can require video submission for some tasks. Things like steps can be faked but the rewards are going to be per holder that meet a threshold not per step and will be extremely conservative with distribution. With our current holders we can do 4 OP per week initially and increase rewards depending on the percentage of active users. We only planned on allocating a small number of the tokens (500 - 1,000) to direct marketing. I think if we set multiple assignments (follow us on Twitter, Discord, retweet this post etc while requiring a unique address it it will prevent sybil, or at least make it extremely time consuming since the reward is so small) Again this is an experimental form of marketing but I do think it is more effective than most other forms (like paid shills) given the amount of capital we are allocating to it. I would add that to even claim the OP they would need to have bridged Eth to Optimism for the gas and signed up to the platform so it should attract more real users than fake ones. It’s a very minute and experimental concept that we added to the proposal but it is ceartinly not the focus, and we can remove it without affecting our core idea which is fitness based rewards. I would be curious what other people think about it since it can also have huge benefits as well.  It really depends on what kind of people follow us and whether or not 1,000 more followers would cause a network effect down the line. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.481018518518519
                },
                {
                    "author_link": "https://gov.optimism.io/u/maykung",
                    "index": "17",
                    "likes": "2",
                    "time": "11/09/2022-16:18:42",
                    "content": "Thanks for the clarification. A video should be one way to prove, though I might have my friends record their video when they do fitness and send it to me cause I’m kind of a sloth-type person lol (kidding). Oh well, maybe it’s time for me to consider exercise regulary TvT. Also, I think providing $OP for people who follow social media channels is ok if you consider that they must do other quests like bridging ETH to Optimism that you mentioned as well as joining OptiChads guild or something like that. Providing $OP to a person who retweet post or creating Chads meme with the most likes may be one of the ideas.     ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.791666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/Dicaso",
                    "index": "18",
                    "likes": "3",
                    "time": "11/09/2022-16:31:35",
                    "content": "Lol Ironically I have gained weight spending months to make the collection but have gotten back into shape a bit recently thanks to my own propoganda, so I can definitely relate. The last idea is ingenious I can actually incorporate that using Quest3 as their platform is very flexibile!  Quest3876×912 39.4 KB  ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 6.305555555555555
                },
                {
                    "author_link": "https://gov.optimism.io/u/Dicaso",
                    "index": "19",
                    "likes": "1",
                    "time": "12/09/2022-21:47:42",
                    "content": "   Quest3    Quest to Earn I am exploring on Quest3, follow the link to find answer with me.       Here is an example Quest. Hopefully this can help people understand the platform. ",
                    "links": [
                        "https://app.quest3.xyz/quest/683612616977805664"
                    ],
                    "GPT-discussion-categories": [
                        "None."
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Butterbum",
                    "index": "20",
                    "likes": "2",
                    "time": "15/09/2022-17:45:26",
                    "content": "Hey Dicaso, Thanks for submitting a proposal. I like the concept of what you plan to do a bit hard to police thou. I’m concerned with the 10% allocation, I believe “fixed costs such as domain/ipfs hosting…” is not what this fund is for as it would require you to sell.    Grant Proposal Template   OP received through the Governance Fund should not be sold by the grant recipient. This “no sale” rule:   Includes the grant recipient, their affiliates and any other related persons. These persons cannot receive OP for the purpose of selling (or if the grant recipient knows they intend to sell) the tokens.  Includes the direct exchange of OP for crypto or fiat, whether done publicly or privately. Think selling OP in exchange for fiat or crypto, regardless of whether done on a CEX, DEX, OTC desk, at your local park, or otherwise.  Does not include using OP to incentivize usage. Providing OP as liquidity mining incentives is not restricted by these parameters.    Is it possible for OptiChads to continue paying its fixed cost and exclude it from this proposal? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.991666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/Dicaso",
                    "index": "21",
                    "likes": "3",
                    "time": "15/09/2022-19:25:36",
                    "content": "   Grant Proposal Template     Includes the direct exchange of OP for crypto or fiat, whether done publicly or privately. Think    Hi thanks for the feedback. We can use 100% of the funds for rewards and continue to fund the project with our own capital. I will edit the proposal to reflect this. I agree that its difficult to police but our focus is to increase community engagement. They will have to be holders and we will do additional filtering like requiring a twitter account per user to make sybil extremely difficult. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.916666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/FractalVisions",
                    "index": "22",
                    "likes": "1",
                    "time": "15/09/2022-19:36:22",
                    "content": "Very exciting proposal. With the adoption of mainstream coming, I am looking forward to see this space move forward. It is good timing for an onboarding initiative in the Optimism NFT sector. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 7.725
                },
                {
                    "author_link": "https://gov.optimism.io/u/Dicaso",
                    "index": "23",
                    "likes": "2",
                    "time": "15/09/2022-19:42:37",
                    "content": "Thank you! I believe NFTs will bring a crazy amount of volume into Optimism in the near future, but its up to creators to build that ecosystem. I think this would be the first NFT proposal to get approved should it pass. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 4.6875
                },
                {
                    "author_link": "https://gov.optimism.io/u/Butterbum",
                    "index": "24",
                    "likes": "2",
                    "time": "16/09/2022-15:28:48",
                    "content": "Thanks D, I didn’t expect you to remove the full development allocation, Just to be clear I’m not against development funds but my understanding is, it needs to be for development yet to be done, that has the potential to increases users on Optimism. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.8125
                },
                {
                    "author_link": "https://gov.optimism.io/u/Dicaso",
                    "index": "25",
                    "likes": "1",
                    "time": "16/09/2022-16:10:38",
                    "content": "All good. I’m happy to set funds to 100% it might show the community that we are more serious while making things easier. If we are sucessfull than royalties will be more than enough to keep us going. We actually are developing a female collection in the future but i’m not sure how to use funds for development without violating the no sale rule. Opensea will be integrating Optimism nfts soon so the community is hoping that projects will see a significant boost in secondary sales to make these ventures profitable. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party or author is advertising proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.829861111111111
                },
                {
                    "author_link": "https://gov.optimism.io/u/Dicaso",
                    "index": "26",
                    "likes": "1",
                    "time": "16/09/2022-19:59:57",
                    "content": "Proposal changed to [REVIEW] I have made changes to the proposal incorporating everyones feedback. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "27",
                    "likes": "1",
                    "time": "17/09/2022-21:06:56",
                    "content": "Hi @Dicaso , thank you for this proposal. Could you please summarize all feedback that this proposal and got so far.  review submissions manually through the platform  who will take this task ? you/your team or quest3 team ? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/0xTrevor",
                    "index": "28",
                    "likes": "1",
                    "time": "17/09/2022-21:19:27",
                    "content": "Very exciting proposal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.950000000000001
                },
                {
                    "author_link": "https://gov.optimism.io/u/Dicaso",
                    "index": "29",
                    "likes": "1",
                    "time": "17/09/2022-22:17:57",
                    "content": "Our team will perform manual review of the submissions. Most of the feedback (on and off the forum) has been people inquiring about the mechanics of Quest3 and asking about verification and things like how we would avoid sybil.The biggest change we made was following the template more closely as Butterbum requested and changing allocations to 100% ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.666666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "30",
                    "likes": "2",
                    "time": "17/09/2022-22:23:42",
                    "content": " Our team will perform manual review of the submissions  Appreciate your manual effort. Will support this proposal. fyi on the dev funding part:- Discord ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/jrocki.eth",
                    "index": "32",
                    "likes": "1",
                    "time": "19/09/2022-20:08:45",
                    "content": "That is a nice catch and good suggestion to direct 100% of the funds to incentives/marketing. @Dicaso thanks for modifying. Although operational costs are not covered by this fund, this fund does actively encourage requests to fund net new development work (categorized as: dev costs) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.145021645021646
                },
                {
                    "author_link": "https://gov.optimism.io/u/jrocki.eth",
                    "index": "33",
                    "likes": "2",
                    "time": "19/09/2022-21:16:24",
                    "content": "This is a well thought out and innovative strategy to drive growth on Optimism. It is a unique application of DeFi on-chain incentives but in this case applied to an Optimism native NFT project which is in my opinion much stickier than DeFi as these projects are community oriented in nature and so I would expect to see higher user retention rates. I would also be interested in the possibility of calculating a new user acquisition cost as I see that being quite low as well. The only concern I have is that certain users will try to game the system and collect a majority of the rewards. Maybe there is a way to tie the maximum amount of rewards to the number of Opti-Chads owned per wallet to facilitate a more even distribution? No need to come up with a solution just food for thought. I am happy to support this proposal, as personally it sores quite high for me on the grading criteria we have laid out as the NFT and Gaming Governance Committee:  The ROI potential of funding each proposal (we want to use our $OP as efficiently as possible. The winner of the L2 wars will be decided ultimately by how efficiently the network can allocate capital) Is the proposal prescriptive enough to prevent mis-use of $OP token funding and does it drive sustainable ecosystem growth? Amount of OP requested (with ROI taken into account) Whether or not the project has launched on Optimism (and if OP native)  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.829347041847042
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "34",
                    "likes": "2",
                    "time": "20/09/2022-20:24:19",
                    "content": "Hi @Dicaso , I was reading thread and would like to hear your opinion on two suggestion.  Please dont forget to summarize the feedback and changes your have got so far. I see that this giveaway is native NFT gated. What do you think about letting users without NFT participate in this campaign too,  rank them on the basis of their activity and reward top 50 or 100 by giving a Optichad NFT. You can also consider this as a co-incentives.  Here is an example:-     Dicaso:  they completed the task   I assume these task are health related activities, so,  NFT holder :- they just need to complete that specific task Other users:- their ranking will increase proportional to number of time they are doing that specific task in that defined period.  This of course will increase your manual work but impact could be significantly higher. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.013888888888889
                },
                {
                    "author_link": "https://gov.optimism.io/u/Dicaso",
                    "index": "35",
                    "likes": "1",
                    "time": "20/09/2022-22:46:42",
                    "content": "@OPUser We can giveaway 50 NFTs to the top addresses with the most Rewards Points (RP) based on quest completion at the end of the campaign. We would ideally start with simple and attainable challenges like “10 pushups with good form” and the platform would reward the same amount of RP based soley on completion. I do think it would be technically difficult to do anything without NFT gating. The way RP is calculated they would have to finish the quests (thus earning $OP) before being counted. Requiring ‘stake’ in the ecosystem by holding an NFT would reduce sybil by magnitudes. Will do a summary post thanks for the reminder! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.46875
                },
                {
                    "author_link": "https://gov.optimism.io/u/Dicaso",
                    "index": "36",
                    "likes": "3",
                    "time": "21/09/2022-00:23:24",
                    "content": "Changes We have added 50 NFTs as co-incentives - suggested by @OPUser. We will now use 100% of requested $OP as rewards for NFT holders who complete the quests, instead of 90%. Portions of texts were removed and edited to reflect this. - suggested by @mteoptimism and @Butterbum. Summary: Feedback has been mostly positive with most questions about how we would address sybil, and how Quest3 works. I mentioned that we can apply filters such as NFT gating, as well as off-chain verification like a Twitter/Discord follow .The team will manually review all submissions. We will now reward 50 NFTs as coincentives to the most active users.The proposal was changed from [DRAFT] to [REVIEW] a few days ago. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.7099567099567095
                },
                {
                    "author_link": "https://gov.optimism.io/u/distractionboy",
                    "index": "37",
                    "likes": "3",
                    "time": "21/09/2022-01:54:08",
                    "content": "I’m definitely willing to review submissions carefully, as I will be engaging in the activities as well, to help lead by example. This proposal will help bring new users in. I was talking about it today at work and I cannot tell you how excited my coworkers were. None of them own NFT’s or have crypto wallets. But when I explained that I was part of a proposal that could fund other people around the world to work out, their eyes widened. They asked all kinds of questions. They wanted to be involved. This is exactly the type of thing we should want to put out there and use as a success story. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.15909090909091
                },
                {
                    "author_link": "https://gov.optimism.io/u/jrocki.eth",
                    "index": "39",
                    "likes": "2",
                    "time": "21/09/2022-16:03:48",
                    "content": "Before September 22, 2022 3:00 PM ET to be included in snapshot voting you will need to add links to your delegate approvals here:     Voting Cycle #6: Roundup 🏛 Governance       FYI…please update both approval as per new guideline from foundation.     Provided your proposal has received explicit approval comments from two delegates with >0.5% voting power, as outlined in the Operating Manual , please use the below format to list your proposal in a reply to this post.   Proposal A: [NAME]  Proposal: [LINK] Delegate Approval 1: [LINK] Delegate Approval 2: [LINK]    ",
                    "links": [
                        "https://github.com/ethereum-optimism/OPerating-manual/blob/main/manual.md"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 2.1363636363636362
                },
                {
                    "author_link": "https://gov.optimism.io/u/Butterbum",
                    "index": "40",
                    "likes": "2",
                    "time": "21/09/2022-17:48:40",
                    "content": "FWIW As an Optimism delegate [Delegate Commitments - #36 by Butterbum]with voting power of 0.44% I believe this proposal is ready. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "41",
                    "likes": "3",
                    "time": "21/09/2022-20:29:36",
                    "content": "I am an Optimism delegate [Delegate Commitments - #26 by OPUser] with sufficient voting power and I believe this proposal is ready to move to a vote. ",
                    "links": [
                        "https://gov.optimism.io/t/voting-cycle-6-roundup/3481/14"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/RastCrypt",
                    "index": "42",
                    "likes": "1",
                    "time": "22/09/2022-00:44:04",
                    "content": "Love this Can’t Wait For Update ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/MoneyManDoug",
                    "index": "43",
                    "likes": "3",
                    "time": "22/09/2022-18:18:05",
                    "content": "As an Optimism delegate with voting power above the required threshold I believe this proposal is ready. Delegate Commitments - #71 by MoneyManDoug ",
                    "links": [
                        "https://gov.optimism.io/t/voting-cycle-6-roundup/3481/14"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/jrocki.eth",
                    "index": "44",
                    "likes": "1",
                    "time": "23/09/2022-04:02:37",
                    "content": "NFT and Gaming Committee voting recommendation: Yes  Rationale:    NFT & Gaming Committee A: Season 2 Recommendations Delegate Updates   Cycle 6   OptiChads  Voting recommendation: Yes   Basis for recommendation:   Potential ROI:    Proposed $OP incentives incorporate social media and community engagement tasks to create a marketing buzz, which in turn brings new users to the ecosystem    50% of OptiChad royalties donated to PGF in perpetuity     Drives sustainable ecosystem growth and prevents mis-use of $OP funding:    New, curious users will be exposed to Optichads and the larger Optimism NFT ecosystem. As NFT projects tend t…     ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.171717171717171
                },
                {
                    "author_link": "https://gov.optimism.io/u/madibaa08",
                    "index": "45",
                    "likes": "2",
                    "time": "23/09/2022-09:17:56",
                    "content": "Cute idea kinda. Doesn’t hurt to give it a try. Support this proposal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "46",
                    "likes": "5",
                    "time": "23/09/2022-13:34:36",
                    "content": "Voted :- For Aligned with committee decision. As said in committee proposal, I am more comfortable with Identity and P2E rather than judging a pure pfp nft project but this grant is going totally towards building community, distribution is done really well with less scope of farming. Huge respect for @Dicaso for his engagement on this proposal on this forum as well as on discord. He took feedback from almost everyone and has incorporated in this proposal. Willingness to do manual validation, allowing non-nft holder to join the campaign and giving 50 native nft as reward, all this gives me confidence that we are funding the right project and I believe this proposal is setting high standard for upcoming nft and related project. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.906060606060606
                },
                {
                    "author_link": "https://gov.optimism.io/u/blairdrop.eth",
                    "index": "47",
                    "likes": "2",
                    "time": "23/09/2022-19:05:41",
                    "content": "I’d never been an NFT guy before, but the OptiChads quest got me hooked! Donating 50% to public goods is a great incentive for people to check out your project. It’s also what convinced me to pick up a second OptiChad  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.333333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/katie",
                    "index": "48",
                    "likes": "1",
                    "time": "26/09/2022-16:25:59",
                    "content": "Voted yes - Following NFT and Gaming Committee recommendation ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "49",
                    "likes": "3",
                    "time": "26/09/2022-21:30:36",
                    "content": "I am voting yes following the NFT & Gaming committee recommendation plus project looks fun ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/arabianhorses",
                    "index": "50",
                    "likes": "3",
                    "time": "26/09/2022-21:56:46",
                    "content": "I can’t explain why but I feel like they won’t keep their promises on the Proposal for token distribution. I can’t blame them, just saying that I couldn’t convince myself to trust them. On the other hand, I like the proposal, made some quick research and it sounds logical that 1.8k holders and 50k OP has been requested. We shouldn’t decide on our feeling here.should keep a reasonable ratio between risk/return to the ecosystem. My vote is FOR ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.822916666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "51",
                    "likes": "3",
                    "time": "27/09/2022-00:04:34",
                    "content": "Am voting for this proposal. I’m increasingly skeptical of the efficacy of quests, especially in today’s environment, but this seems like a good opportunity to run an experiment, and it’s in the hands of someone who’s open-minded and transparent in how they’re running things. Also just like the project and Dicaso’s energy. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/Bobbay_StableLab",
                    "index": "52",
                    "likes": "2",
                    "time": "27/09/2022-12:01:04",
                    "content": "Vote: Yes Rationale: I am a fan of public funding and encouraging users to live healthier life. I would be intrigued to get a follow-up to see how the challenges work out. An accountability committee would be beneficial here, especially as this has a different path to DeFi protocols. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.170454545454546
                },
                {
                    "author_link": "https://gov.optimism.io/u/Tjark",
                    "index": "53",
                    "likes": "3",
                    "time": "28/09/2022-09:02:33",
                    "content": "The PoolCollective voted yes, following the NFT & Gaming Committee’s recommendation. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/jrocki.eth",
                    "index": "54",
                    "likes": "2",
                    "time": "28/09/2022-21:09:41",
                    "content": "Voted : For For all the reasons we listed in our  recommendation ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "55",
                    "likes": "0",
                    "time": "29/09/2022-19:12:44",
                    "content": "Snapshot vote - passed ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "56",
                    "likes": "0",
                    "time": "29/09/2022-19:12:47",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "57",
                    "likes": "0",
                    "time": "30/09/2022-21:26:56",
                    "content": "@Dicaso can you provide a Telegram handle or other contact method so the Optimism team can get in touch about paying out this grant! Feel free to comment on this thread, DM, or email palash@optimism.io ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.609375
                }
            ]
        }
    ],
    "group_index": "241"
}