{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/what-is-your-evaluation-criteria-for-phase-1-proposals/2715",
            "title": "What is your Evaluation Criteria for Phase 1 Proposals? ",
            "index": 2715,
            "category": [
                "\\xf0\\x9f\\x8f\\x9b Governance",
                "Grants"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/Justin",
                    "index": "1",
                    "likes": "4",
                    "time": "18/06/2022-04:33:21",
                    "content": "Reading the proposals has been very educational and interesting.  I can’t really find any evaluation criteria, so I am curious how you all plan to evaluate proposals. The OPerating Manual suggests that distributions “proactively incentivize future growth of projects and communities” which is pretty broad.  The standard template questions narrow this down much further by specifically asking proposers to explain how their proposal will “incentivize usage and liquidity on Optimism”. I would plan to vote yes on proposals that can show a clear causal relationship between the OP token distribution and it’s impact on incentivizing usage and liquidity on Optimism.  Good examples would be: bridges subsidizing gas to bridge to optimism; LP incentives; usage incentives generally; and I am particularly drawn to marketing activities to reach new users.  I think it is OK to have a small percentage of tokens allocated to the core team/devs, security or even retroactive rewards for users of protocols that are native to Optimism.  But the percentage should be small.  It’s not that I think that those groups/activities should not be supported – they obviously should.  However, I don’t think Phase 1 is the right fund to use for that purpose. What evaluation criteria does everyone else plan to use? ",
                    "links": [
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-optimistic-railway/2309/22"
                    ],
                    "GPT-summary": "The author of the post is asking for feedback on how to evaluate proposals for Phase 1. They suggest that they would vote yes on proposals that can show a clear causal relationship between the OP token distribution and its impact on incentivizing usage and liquidity on Optimism. They also mention that a small percentage of tokens should be allocated to the core team/devs, security, or retroactive rewards for users of protocols that are native to Optimism. The post is asking for other people's evaluation criteria for Phase 1 proposals.",
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Token economics",
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.552545007902151
                },
                {
                    "author_link": "https://gov.optimism.io/u/Takeshi_Kovacs",
                    "index": "2",
                    "likes": "2",
                    "time": "19/06/2022-07:11:53",
                    "content": "Hi Justin, I was also wondering the same thing previously and found the following guidance, which helped me assess which projects met the Optimistic Vision. Governance is intended to be carried out in line with the Working Constitution , and pursuit of the Optimistic Vision . The Optimism Vision will dispel the myth that public goods cannot be profitable. Optimism will consistently provide massive retroactive incentives for public goods which benefit Optimism, Ethereum, and the Collective as a whole. ",
                    "links": [
                        "https://www.optimism.io/vision",
                        "https://medium.com/ethereum-optimism/retroactive-public-goods-funding-33c9b7d00f0c"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.177083333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/Axel_T",
                    "index": "3",
                    "likes": "2",
                    "time": "19/06/2022-08:03:24",
                    "content": "Great contribution, @Takeshi_Kovacs, to centre or focus some of the decision making. That final link, the Medium article, really hit the spot for me. Although all three references are very important. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving positive feedback on proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.8999999999999995
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "4",
                    "likes": "5",
                    "time": "20/06/2022-22:13:07",
                    "content": "Thank you for creating this thread, this might help us combine ideas on what a good proposal should contains. Its difficult to say what a good proposal should look like as its project dependent, we can not treat a NFT based based project to defi project which will be totally different from an infra project. Approach I am taking is, discarding project focusing on forced or artificial TVL and making the good or even a debatable proposal more visible so that it can reach wider audience and is why I provided my support to few projects in last 2 days. Now few things that I am looking for in a proposal:  Duration of token distribution Who is the target audience(user / dev /app integration ) Willingness to provide report/data on how the reward was distributed either monthly/quarterly. I dont care if OP team will read them or not but If I am voting “yes” for a project, I will read those report and see where the funds are being used. Will this proposal boost TVL and/or on-chain activities in an sustainable way?  I am considering Phase 1 is little relaxed in terms of goal, Phase 0 was focused more on TVL, but this can go beyond that as long as its supporting OP ecosystem. Looking for inputs and suggestions. Edit1:- On point 3, as pointed out by @InfinityWallet here, this does seems to involve some privacy concern, which somehow I overlooked. Until we find a better approach without compromising the privacy, I will remove this from evaluation criteria. ",
                    "links": [
                        "https://gov.optimism.io/t/accountability-of-phase-0-1-funds-given-to-projects/2762"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.56640625
                },
                {
                    "author_link": "https://gov.optimism.io/u/Justin",
                    "index": "5",
                    "likes": "2",
                    "time": "21/06/2022-04:21:29",
                    "content": "What do you think is an ideal length of time for token distribution?  Your #3 is interesting because the proposals contain very little about accountability or reporting. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.927083333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "6",
                    "likes": "1",
                    "time": "21/06/2022-07:36:29",
                    "content": "on token distribution length, If I can see that the incentives are paid monthly then it should not be more than 6 month and in other case, it can be vary from 3 months to 1 year. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.9375
                },
                {
                    "author_link": "https://gov.optimism.io/u/Axel_T",
                    "index": "7",
                    "likes": "3",
                    "time": "21/06/2022-13:50:30",
                    "content": "Hi @OPUser and @Justin good to say hello again to you both  Noticed that you, OPUser, said,     OPUser:  Willingness to provide report/data on how the reward was distributed either monthly/quarterly. I dont care if OP team will read them or not but If I am voting “yes” for a project, I will read those report and see where the funds are being used.   and you, Justin, said,     Justin:  Your #3 is interesting because the proposals contain very little about accountability or reporting.   Now, if only there was a Proposal who wanted to create a decentralised platform to publish these type of (accounting, yes they’re accounting!) reports!  But cheekiness aside, in case my proposal is unsuccessful, I’ll give you both a quick accounting lesson as a parting gift: The Three (3) Functions of Accounting (why the field exists & has value), are: 1) For ‘Decision-Making’ i.e. If both internal and external stakeholders (think, as an example, OP delegates) can have access to accounting information (aka reports/financial reports/financial statements/management reports) that can allow for better decision making (e.g. an OP delegate can review & analyse periodic financial reports to decide if they want to vote ‘For’ a Proposal and commit scare resources like OP). 2) For ‘Contracting’ i.e. Accounting Information (or more easily understood: hard numbers/constants in a report) is a very effective way to bind, via a contract, both internal parties (e.g. within an employee’s employment contract they can receive a bonus if they reach a sales target) and external parties (e.g. two external parties of a multi-sig wallet refusing to release locked up OP, if the internal project liquidates more than 100,000 agreed limit of its OP over a 3-month period). 3) For ‘Stewardship’ i.e. Accounting information (think: reports of financial and non-financial data) can be used as an effective method to communicate how assets or resources are being managed. Using accounting information to record the management or stewardship of resources is useful over long distances, or in short or misaligned time frames, and/or as a common language. The stewardship function dates back many centuries to the times of kings and queens and kingdoms and estates (or religious institutions), where a king/queen/cardinal could monitor their realm and how their resources were being utilised by all their lords/proxies over the vast and often treacherous kingdom/church. That is, lords/ladies would send the king/queen physically small-sized, accounting reports of how their section of the realm was functioning, and financial numbers and other constants were effective communication mediums (e.g. “1000 sheep in the field, 2 chests of gold, and a standing army of 100 in this sector of the realm, your majesty. And each have increased by 100% since my last report to you last spring, my liege.”) Okay, well I carried on a bit with Number (3) there a bit, but just remember the key reasons why accounting and accountants exist are: For decision-making, for contracting, and for stewardship. Class dismissed  Could the Optimism Collective or OP Delegates benefit from specialised, but rather easily understood, information to help decision-making, contracting and stewardship? Have a good day or good night guys, I’m off to bed. Cheers, Axel ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.970459401709402
                },
                {
                    "author_link": "https://gov.optimism.io/u/William",
                    "index": "8",
                    "likes": "3",
                    "time": "22/06/2022-02:15:33",
                    "content": "Thank you for putting this thread together @Justin. @OPUser is right, this thread is a good way to figure the evaluation process out. But I think this thread should also outline what we don’t want to see. For example I’ve also noticed some of the Proposals in Phase 1 are being submitted by delegates themselves! This is not a good look. It gives the impression that delegates can approve their own proposals to claim funds. I think it would be better for delegates who put a proposal in for a vote must abstain from all votes in that phase, to prevent any real or perceived conflicts of interest. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.758928571428572
                },
                {
                    "author_link": "https://gov.optimism.io/u/dogstartaylor",
                    "index": "9",
                    "likes": "3",
                    "time": "27/06/2022-07:40:28",
                    "content": "Thanks a lot OPUser for evaluation criteria ideas. I’m glad to see we are all on the same page with accountability. I think we need some type of mile stones for these projects. Example: 100,000 active users confirmed thru some type of oracle like LINK or Graph and X amount of OP would be released. A DAPP with X amount of daily transactions and X OP is released. It’s a lot of hard coding that I can not do, but it is a concept that that can be written in the contract of the proposal and executed on chain/ ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.482142857142858
                }
            ]
        }
    ],
    "group_index": "97"
}