{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/draft-gf-phase-1-proposal-vesta-finance/2886",
            "title": "[DRAFT] [GF: Phase 1 Proposal] Vesta Finance ",
            "index": 2886,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Governance Fund: Phase 1"
            ],
            "tags": [
                "cycle-6"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/astolfo",
                    "index": "1",
                    "likes": "4",
                    "time": "05/07/2022-22:48:57",
                    "content": "Project Name: Vesta Finance (https://vestafinance.xyz) Author Name: Astolfo, 0xBlueberry, Mikey Milken Number of OP tokens requested: 1,000,000 L2 Recipient Address: Multi-Sig TBD DefiLlama TVL: $13.74m on Arbitrum VST Minted: $3.554m on Arbitrum Optimism alignment (up to 200 word explanation): Vesta has described itself from day one as a L2-First stablecoin protocol. While we are currently only live on Arbitrum, we are developing infrastructure to deploy on Optimism, coinciding on our xChain proposal as well as version 2 of our protocol. The advantages of deploying on L2s such as Optimism include scalability and low fees, which is especially important as a more community focused product. We serve long-tail assets and plan to continually onboard new markets including the Optimism (OP) token itself. Vesta aims to be the first protocol to allow lending and borrowing of Optimism through an immediate collateral market launch to borrow VST. To bootstrap usership and advantageous liquidity, Vesta plans to provide incentives through our native governance token, VSTA, as well as with other tokens such as the ones granted by Optimism. As we come closer to launching our own staking module on VSTA, we expect that these incentives will only become more attractive with utility enabled. On that note, Vesta is also open to providing Optimism specific boosts on both governance power on this chain and in the staking module. Doing so would encourage migration and provide opportunities for further capital capture both on Vesta and on other infrastructural units. We see Vesta’s future role on Optimism as an attractive migration target and capture opportunity. Proposal for token distribution (under 1000 words): Taking inspiration from successful launches of lending markets on two emerging EVM chains—Near and Klaytn—which have all quickly seen TVLs far past $100M, Vesta plans to use a lockdrop reward system for bootstrapping initial liquidity in its markets. We will distribute OP tokens in this manner, rewarding those who commit to locking their tokens as collateral with these tokens. Consideration for the lockdrop will be prioritized for existing ETH and WBTC markets, but rewarding OP tokens for locking OP tokens may be a semi-recursive strategy that would be attractive to the ecosystem. Beyond that, we are also open to providing lockdrop rewards in other forms, such as our native governance token, VSTA. We will also be using the granted OP tokens as rewards for staked users in our stability and liquidity pools. We recognize that doing so does entail a possible problem of mercenary capital, but we believe that the failsafe measures introduced in the sections below can mitigate this problem. We believe that these rewards will be important for encouraging adoption first and foremost. How will the OP tokens be distributed? Distribution of OP will be done through a Vesta governance proposal with an initial distribution proposal from our team:  50% for users who use Vesta on Optimism through liquidity mining 25% for developers who build on or with Vesta 15% for marketing campaigns (Optimism focused events) 10% for xMint participants on Optimism  How will this distribution incentivize usage and liquidity on Optimism? With this distribution, liquidity providers will be directly rewarded for their crucial services to the protocol and Optimism as a whole. Vesta is confident that these can also be distributed in a way that prevents immediate market-dumping through features such as vesting, providing further attractive opportunities for idle $OP, or utility on the protocol with $OP. Vesta is also dedicated to integrating seamlessly with a broader Optimism ecosystem. To that end, we’re providing a large amount of $OP to developers who work with our protocol in meaningful and lasting ways. We’re willing to contribute this amount to their hard-work, which we expect to create innovative use-cases for our protocol on Optimism as well as new opportunities for synergy with all parties involved. We’re also reserving a smaller amount of tokens for our marketing campaigns to be used as incentives for participation in certain activities and migrations beneficial to the protocol and Optimism. Finally, we’re reserving another small share of the pie for users who specifically use our new xMint product, expected to launch in the next few weeks. We’d like for Optimism to be the pilot chain for our cross-minting, allowing them to gain exposure on Optimism, without even bridging their assets. XMint will also help to keep users on Optimism, preventing users from bridging out to utilize their assets on other chains. Why will the incentivized users and liquidity remain after incentives dry up? Vesta provides a seamless lending experience on many decentralized assets on Arbitrum: even after six months, large amounts of liquidity for these tokens continue to cycle through our vaults. New collateral types opened up by us are usually quickly utilized by idle capital. Vesta is committed to providing close maintenance and continued support for both new and old collateral types. Keeping up with the continued evolution of the Optimism ecosystem is a priority for us, so we believe that even without monetary incentives, new users can continue to be onboarded. As new collateral types are added, the ecosystem should feel the positive impacts by the utility that Vesta enables. Over what period of time will the tokens be distributed? Our team expects to distribute these incentives over a 9-15 month period, with input from Vesta’s governance and the Optimism community. How much will your project match in co-incentives? We expect to receive the $OP incentives, if approved, at around the same time as our Optimism launch. As such, the team will push heavily on our governance forum 1:1 incentive matching to bootstrap our launch on Optimism. We will ask the governance forum of Vesta for a proposal on the Optimism-Vesta token incentives within 3 days of approval. We will finalize this plan with community input within 2 weeks. ",
                    "links": [],
                    "GPT-summary": "The post is a draft proposal for Vesta Finance, a L2-First stablecoin protocol. The proposal outlines the advantages of deploying on L2s such as Optimism, and the token distribution plan for bootstrapping initial liquidity in its markets. The proposal also addresses possible problems of mercenary capital and how to incentivize usage and liquidity on Optimism. The post explains the distribution of OP tokens and how they will be used to reward users, developers, and marketing campaigns. The proposal also discusses the period of time for token distribution and co-incentives.",
                    "GPT-proposal-categories": [
                        "Token economics",
                        "Interoperability and Scalability",
                        "Grants, Funding and resource allocation",
                        "Law and regulations",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.791286416286416
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "2",
                    "likes": "1",
                    "time": "06/07/2022-09:38:01",
                    "content": "Thank you for the proposal, few input.     astolfo:  DefiLlama TVL: $13.74m   is this on OP chain ?  We will ask the governance forum of Vesta for a proposal on the Optimism-Vesta token incentives.  is there any timeline here ? also, please include link to your website. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/astolfo",
                    "index": "3",
                    "likes": "1",
                    "time": "06/07/2022-19:08:05",
                    "content": "Thanks for the input! Updated. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/Florian",
                    "index": "4",
                    "likes": "0",
                    "time": "07/07/2022-20:03:32",
                    "content": "Completely for this one. Vesta could bring to Optimism a fully decentralized stablecoin protocol! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://gov.optimism.io/u/Bobbay_StableLab",
                    "index": "5",
                    "likes": "1",
                    "time": "13/07/2022-10:18:44",
                    "content": "This is quite a large range \" 6-24 month period\", i’d suggest probs narrowing it down a bit if possible.  We will ask the governance forum of Vesta for a proposal on the Optimism-Vesta token incentives within 3 days of approval. We will finalize this plan with community input within 2 weeks.  Is there a current discussion of this happening too? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.073412698412698
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "6",
                    "likes": "0",
                    "time": "14/07/2022-21:18:58",
                    "content": "Thank you for the update. Few points, is your project live on OP chain ? I dont see any option on your app to connect to OP. Any update on co-incentives ? Would it be possible to match it number of token requested. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.893939393939394
                },
                {
                    "author_link": "https://gov.optimism.io/u/astolfo",
                    "index": "7",
                    "likes": "0",
                    "time": "14/07/2022-21:53:46",
                    "content": "Thanks for the suggestions! After some discussion, we’ve narrowed it down to 9-15 months, to make sure we can capture enough market penetration. Right now co-incentives have been discussed within the core team, and we’re all for it. Ultimately though, we will also need to draft up a convincing proposal to the community as we believe this should be a collective decision. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.985827664399093
                },
                {
                    "author_link": "https://gov.optimism.io/u/astolfo",
                    "index": "8",
                    "likes": "0",
                    "time": "14/07/2022-21:55:24",
                    "content": "We’re not live on Optimism just yet, but we’ve identified OP as the reasonable next destination for our cross chain aspirations. Taking into account Arbitrum and OP’s structural similarities, we’d launch these incentives and our iteration on OP at the same time. Co-incentives and some Vesta background updated in main post! Thanks so much for your continued attention. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.462594696969697
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "9",
                    "likes": "0",
                    "time": "14/07/2022-22:02:47",
                    "content": "Thank you. I would suggest to wait until you are live on OP chain but keep the feedback channel open. I would like to echo @Bobbay_StableLab view, even 9-15 has quite big room, would it be possible to change the distribution based on KPI. Ofcourse, It would help us all if we get clear yes or no on co-incentives. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.236363636363636
                },
                {
                    "author_link": "https://gov.optimism.io/u/Bobbay_StableLab",
                    "index": "10",
                    "likes": "1",
                    "time": "15/07/2022-08:57:04",
                    "content": "I agree it should be a collective decision but is the community aware of these co-incentives and if so, what is their view so far? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.875
                },
                {
                    "author_link": "https://gov.optimism.io/u/SEED_LATAM_Joxes",
                    "index": "11",
                    "likes": "1",
                    "time": "18/07/2022-18:58:12",
                    "content": "Hello @astolfo. Doing some echo to the ideas of delegates and members above, distribution looks OK for now; in order for the proposal to have greater acceptance, I suggest:  Reducing the amount by half and the period of time to 12 months or less, since we are willing to see results in the mid term and then consider an approval of a second continuation proposal if Vesta team/community wishes so. Clarification on co-incentives would also help. If 25% goes to developers, it would also be advantageous to know what ideas, tasks or goals you have (provide more details if is possible), for us to consider how positive it could be.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.747245179063361
                },
                {
                    "author_link": "https://gov.optimism.io/u/astolfo",
                    "index": "12",
                    "likes": "0",
                    "time": "01/08/2022-23:14:27",
                    "content": "A great portion of our governance participants are very open to co-incentives, as far as 1:1 incentives go. Our contributors also mostly have consensus on this issue! ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 6.90625
                },
                {
                    "author_link": "https://gov.optimism.io/u/UncutGems",
                    "index": "13",
                    "likes": "0",
                    "time": "08/08/2022-17:36:37",
                    "content": "Really want to see VESTA on OP, a key player in the Arbitrum eco already with a strong team. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.055555555555555
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "14",
                    "likes": "0",
                    "time": "29/09/2022-02:14:29",
                    "content": "hey vestals, pinging, want to gauge whether there’s still interest here ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "138"
}