{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/optimism-op-buyback-and-burn-to-increase-price-of-the-token/2489",
            "title": "Optimism $OP Buyback and Burn to increase price of the token! ",
            "index": 2489,
            "category": [],
            "tags": [
                "token"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/IceQueen",
                    "index": "1",
                    "likes": "22",
                    "time": "06/06/2022-01:35:43",
                    "content": "This consideration is for those who want to discuss increasing the intrinsic value of the optimism token without taking the route of  performing complex technical/structural maneuvers on the chain such as the ones some other well received proposals have proposed. (Think about stock buy backs) Optimism Buyback and or burn   DAO can use profits or a certain share of profits from  buy back Optimism tokens.   Make it a weekly/monthly operation and direct the tokens to a DAO controlled wallet   Revenues directed to a DAO controlled wallet, effectively removing tokens from supply.   This is a rather streamlined way to bring value or rather increase the value of the Optimism token by reducing the circulating supply in the market. Rationale There is much debate about whether or not there should be emphasis on “increasing the price of optimism” and it is apparent from discussions that some in the community frown upon the idea doing things to make the price “hike”. Some argue that a governance token should be just a governance token and governance should be the only inherent value the token has. So if you are one of those members, well the rationale below is not for you. Every business decision pertaining to Optimism’s governance should be geared towards increasing the Optimism token’s price and NO we should not make short sighted decisions to “pump” the price in the short term. Adhering to a core belief of optimism, we should continue with the belief that impact=price. However, in this industry, whether we like it or not, price of a project’s token is how everyone takes a temperature check on the project’s health. Market cap in fact is a great indicator of consumer/user confidence and taking measures to improve that will attract more users. We need more users and a greater community to create a greater impact. However, how do we attract more users and more importantly how do we attract quality governors? Unfortunately perception is reality and we have had a bit of rough launch. How do we signal that we will bring value? Nobody wants to spend time “governing” if it doesn’t generate personal gain; why would they?  There are plenty of other uses for one’s money. As such there is a great use case for doing something like a buyback and or burn program in order to gain traction and communicate value propositions. There is absolutely nothing wrong with taking measures to increase the value of the token in a way that will garner attention. An announcement of buy back and burn is exactly what we need to make noise. Once we make the noise we don’t have to worry about coming down hard because the fundamentals are there to carry us all the way. As long as we are certain that the product is a 100% there is nothing wrong with doing something to demand the price it deserves. This is an L2 pioneer. Keep in mind all the market leaders (ETH, BNB, MATIC etc.) have done some version of a buyback and burn program with great success. ",
                    "links": [
                        "https://gov.optimism.io/t/if-the-project-party-does-not-want-to-see-the-project-fail-due-to-human-error-pay-attention-to-marketing/2581/5",
                        "https://gov.optimism.io/t/op-burning-for-sustainability/3018/2"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.721230158730158
                },
                {
                    "author_link": "https://gov.optimism.io/u/ApePrince",
                    "index": "2",
                    "likes": "7",
                    "time": "06/06/2022-01:51:47",
                    "content": "Great Idea  support this! OP income model There are two types of income: explicit income and MEV. The Optimism Foundation runs a single centralized sequencer that is solely responsible for generating Layer 2 (L2) blocks and adding transactions to Ethereum’s Layer 1 (L1). The sorter fee consists of two parts, the L2 execution fee and the L1 data fee. L2 execution fees are similar to Ethereum gas fees. The amount of fees to be paid depends on the complexity of the transaction, i.e. its computational and storage requirements. That’s about 1% of what users pay. The L1 data fee is the cost of publishing a batch of transactions to Ethereum. The sorter uses a cost-plus approach, charging users a price higher than the L1 cost. It currently charges 1.24 times the sum of the gas required to submit a transaction and 2,100 gas. This generates surpluses that will be used to fund the growth of the ecosystem. It’s worth noting that 99% of the fees charged by Optimism are L1 data fees. So far, these fees paid by users have brought in $24.5 million in revenue for Optimism. link to this is here!     Enabling $OP as a gas token on Optimism Network! 💌 Ideas & Feedback       Enabling $OP as a gas token on Optimism Network!     The  $OP token can be used to pay gas fees on the Optimism Network!. This is a major addition to the utility of the $OP token, and will help increase adoption and usage of the Optimism Network!.  ETH remains the default gas token, but all users will have the option to change to $OP. Users preferring to stick with ETH gas payments do not have to do anything, but using $OP will result in a 25% gas fee discount!  Be…     ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.1224268353174605
                },
                {
                    "author_link": "https://gov.optimism.io/u/redmarglar",
                    "index": "3",
                    "likes": "14",
                    "time": "06/06/2022-02:17:15",
                    "content": "There is an inherent assumption in these “numba go up” proposals that OP is somehow undervalued or that the price is lower than it should be. I think those of us holding OP should be very happy with the current price. I don’t think we should support schemes that aim to solely benefit holders of OP and don’t demonstrate any concrete benefit to the ecosystem. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.916666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/IceQueen",
                    "index": "4",
                    "likes": "1",
                    "time": "06/06/2022-02:21:46",
                    "content": "Can you elaborate why holders of $OP should steer away from value inflation? On the same note can you elaborate how increase in MC or gaining a footing among market leaders will not bring any concrete benefit to the ecosystem. I am genuinely curious how these don’t go hand in hand. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.05
                },
                {
                    "author_link": "https://gov.optimism.io/u/redmarglar",
                    "index": "5",
                    "likes": "7",
                    "time": "06/06/2022-02:26:29",
                    "content": "I can understand why an individual token holder would want the price of their tokens to go up. Of course as an individual I feel the same way. But Optimism is a collective and its goals (amongst other things) are to provide an EVM equivalent layer 2 Ethereum scaling solution and to support public goods funding. Diverting protocol revenue towards token buybacks and burns would reduce the protocol revenue available for public goods funding. I think that there is merit in considering sharing some of the sequencer revenue with tokenholders in the future once it increases, but probably the best way to do that is as part of the sequencer decentralisation. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.708333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/ApePrince",
                    "index": "6",
                    "likes": "1",
                    "time": "06/06/2022-02:32:58",
                    "content": "Disagree with your statement! Cryptocurrencies are  valued by market share or market cap. Market cap comes from the circulations supply and the price of the token. Coin market cap, coin gecko ranks crypto projects according to the market cap. In order to become the market leaders all the projects are working towards increasing the token price and the market cap. Also Crypto is speculative asset and in a speculative environment PRICE of a token and Market Cap is everything. Value of the token goes up = Project ranking goes up Crypto Ranking = More fees, More people use the chain, TVL goes up simple econ! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.666666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/IceQueen",
                    "index": "7",
                    "likes": "2",
                    "time": "06/06/2022-02:38:27",
                    "content": "I believe there is a separate allocation already in place for public goods funding. So growth will mean more for that pool as well. I am uncertain if i was clear enough in my original post; effort to improve the price is not coming from a place of price pumping for individual token holder gain. My proposal should not be construed as such at all. This is not about pupping price for the sake of it or to pump our bags. This is about creating future value propositions to attract formidable players. It is about gaining a spot among leaders. Do you think $265 million mc (with current outstanding tokens) is a fair valuation for a L2 pioneer like $OP? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.776041666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/Prometheus",
                    "index": "8",
                    "likes": "4",
                    "time": "06/06/2022-13:14:30",
                    "content": "    IceQueen:  Some argue that a governance token should be just a governance token and governance should be the only inherent value the token has. So if you are one of those members, well the rationale below is not for you.   Let’s be creative about this. Instead of Burning supply based on network/token metrics let’s just burn the tokens people want to use for governance. That said, we could burn OP for soulbound NFTs indicating the amount of tokens burned and this amount would be the voting Power. Holding OP, providing liquidity or whatever people want to do with OP wouldn’t give voting power, it would be entirely speculative but anyone willing to participate in governance would need to burn OP. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9375
                },
                {
                    "author_link": "https://gov.optimism.io/u/chhotushaw.eth",
                    "index": "9",
                    "likes": "1",
                    "time": "06/06/2022-17:14:31",
                    "content": "nice thoughts keep it up optimism team ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Vikram",
                    "index": "10",
                    "likes": "9",
                    "time": "06/06/2022-18:39:50",
                    "content": "Instead of focusing on artificial ways to increase the price, we should be focusing on creating proposals that will bring more users to Optimism. This in turn will increase the price of the token in a sustainable manner. There are a number of projects doing this and have submitted proposals. Optimism has created a vision and it’s not about focusing on making token go up. It’s about creating a Desoc that is focused on scaling ETH and retroactive public goods funding. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.833333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/dwarfpaladin",
                    "index": "11",
                    "likes": "1",
                    "time": "06/06/2022-18:40:29",
                    "content": "I would be interested in diverting all sequencer fees/profits to buying back OP tokens to then put in a fund for future distribution, such as Retroactive Public Goods Funding. We could therefore  align token price with health/activity of the actual network (more network activity means more profit for the sequencer and then more OP tokens for RPGF) Just as Ethereum is working on aligning whether ETH the asset is deflationary depending on gas prices (how much the network is being utilized) I think OP should do a similar thing. I could be completely off point, perhaps the profits of the sequencer are for now being used by the Optimism Foundation, but maybe they would love the idea of “pumping their bags” too since they have some OP locked up currently. All in all, I think everybody wins in a situation like this. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.949999999999999
                },
                {
                    "author_link": "https://gov.optimism.io/u/dwarfpaladin",
                    "index": "12",
                    "likes": "0",
                    "time": "06/06/2022-18:43:00",
                    "content": "Can’t we use OP tokens as the currency for public goods funding? The sequencers buys back OP and puts it in a treasury of some sorts for future PGF, token price goes up and everybody wins. Value accrual for the OP token I think will benefit all goals this L2 network is trying to achieve. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.375
                },
                {
                    "author_link": "https://gov.optimism.io/u/dwarfpaladin",
                    "index": "13",
                    "likes": "2",
                    "time": "06/06/2022-18:45:18",
                    "content": "I think both things dont need to be mutually exclusive. Sequencer fees go to OP token buybacks, and some of those OP tokens then are used in the future for PGF. I think if OP turned into a governance token that had value accrual and was tied to the health of the network itself, people would view price going up as a good metric for how much activity and value is actually locked on the Optimism network itself. I think we can have both. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.125
                },
                {
                    "author_link": "https://gov.optimism.io/u/Vikram",
                    "index": "14",
                    "likes": "0",
                    "time": "06/06/2022-18:56:15",
                    "content": "We don’t need both. If the focus is on RPGF the price will go up. Impact=profit ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/SMIN",
                    "index": "15",
                    "likes": "1",
                    "time": "06/06/2022-19:03:41",
                    "content": "    Vikram:  Instead of focusing on artificial ways to increase the price, we should be focusing on creating proposals that will bring more users to Optimism. This in turn will increase the price of the token in a sustainable manner. There are a number of projects doing this and have submitted proposals. Optimism has created a vision and it’s not about focusing on making token go up. It’s about creating a Desoc that is focused on scaling ETH and retroactive public goods funding.   THIS^  Buybacks and burns do not cause permanent user growth, utility, and demand for OP.  I think we need to stay true to the vision but this doesn’t mean we couldn’t implement buybacks/burns sometimes. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.9375
                },
                {
                    "author_link": "https://gov.optimism.io/u/Codeknight",
                    "index": "16",
                    "likes": "0",
                    "time": "06/06/2022-19:17:08",
                    "content": "It too early for this. Optimism should focus on using its funds to grow the ecosystem, then in a few years when its reached full potential they can look at directing funds back to investors. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/Prometheus",
                    "index": "17",
                    "likes": "2",
                    "time": "06/06/2022-19:17:19",
                    "content": "Governance tokens are broken. The majority don’t give much relevance to governance, they even give their voting power to delegates because they don’t have enough time available for everything. Value of something like that can only trend lower, with or without PGF. The only way to change this would be burning tokens in exchange of voting power (ideally minting a soulbound token in the process). There’s no better buyback/burn mechanism than one done by users willing to put their time and effort into governance. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.611111111111111
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "18",
                    "likes": "2",
                    "time": "06/06/2022-19:17:52",
                    "content": "First, we should not focus on pumping the price, artificially. This is never a good idea, its not gonna help anyone. Rather, we should focus on knowledge sharing, user on-boarding and overall OP ecosystem growth. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.125
                },
                {
                    "author_link": "https://gov.optimism.io/u/dwarfpaladin",
                    "index": "19",
                    "likes": "0",
                    "time": "06/06/2022-20:06:09",
                    "content": "Well if the token is divorced from the value of the network (which it is) it doesnt necessarily mean it will. If the sequencer profits are tied to OP buybacks then the network and token are more connected in action/growth. This is what Im saying. We can have both RPGF and positive price action tied to the growth/development of the network. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.643465909090909
                },
                {
                    "author_link": "https://gov.optimism.io/u/HuntTheFarmers",
                    "index": "20",
                    "likes": "0",
                    "time": "06/06/2022-20:07:39",
                    "content": "Anyone have any examples of buyback and burn schemes that were successful? Anyone? Total tokens? What date did buyback and burn scheme start? Price of token that day? Price of token the following month? Price of token today? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/IceQueen",
                    "index": "21",
                    "likes": "0",
                    "time": "07/06/2022-01:28:40",
                    "content": "Here is one idea! I believe you understood they core tenet of my proposal. Buyback and burn is a rather blanket approach and I would love if people contribute to mold that idea. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/IceQueen",
                    "index": "22",
                    "likes": "1",
                    "time": "07/06/2022-01:34:50",
                    "content": "Appreciate your feedback! However, the idea here is not inflate the price artificially for the sake of it. Its about discussing mechanisms to add value to the intrinsic value of the $OP token now that we have one. Also, keep in mind we have the lowest risk of “unsustainable” price growth because we have the fundamentals. I mean this is a functioning project. Further more, once a project has a token, thats it! Not everyone is a tech nerd nor are they passionate about the insides. The token will be the face of the project and we cannot inch towards market leadership or induce the expected impact unless the token perform well… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.635416666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/IceQueen",
                    "index": "23",
                    "likes": "1",
                    "time": "07/06/2022-01:36:35",
                    "content": "I have shared this towards the end of my initial post. Buyback and burn is a rather blanket approach and of course we should discuss the exact mechanics in detail with the community. From ethereum to matic to BNB, all leaders did some form iteration of a buyback and burn program. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://gov.optimism.io/u/Vikram",
                    "index": "24",
                    "likes": "0",
                    "time": "07/06/2022-05:52:41",
                    "content": "    IceQueen:  The token will be the face of the project and we cannot inch towards market leadership or induce the expected impact unless the token perform well…   This not entirely accurate, Uniswap’s token is a governance token and the project is thriving. It has already passed $1 trillion in total trading volume.   twitter.com   Uniswap Labs 🦄 @Uniswap  1/ It’s been one hell of a ride 🚀  As of today, the Uniswap Protocol has passed a lifetime cumulative trading volume of $1 Trillion.   7:12 AM - 24 May 2022           1.5K                311            ",
                    "links": [
                        "https://twitter.com/Uniswap/status/1529102980296867842?s=20&t=aNWXT93HSaPKhXjJ0C-_Ow",
                        "https://twitter.com/Uniswap/status/1529102980296867842?s=20&t=aNWXT93HSaPKhXjJ0C-_Ow",
                        "https://twitter.com/Uniswap/status/1529102980296867842?s=20&t=aNWXT93HSaPKhXjJ0C-_Ow"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/Sudo",
                    "index": "25",
                    "likes": "1",
                    "time": "07/06/2022-06:19:24",
                    "content": "Bnb had success with burning tokens and avax had. Even ETH ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/IceQueen",
                    "index": "26",
                    "likes": "1",
                    "time": "07/06/2022-06:59:26",
                    "content": "    Vikram:      IceQueen:  The token will be the face of the project and we cannot inch towards market leadership or induce the expected impact unless the token perform well…   This not entirely accurate, Uniswap’s token is a governance token and the project is thriving. It has already passed $1 trillion in total trading volume.   Ummm… that is an apples to oranges comparison. Uniswap is the bench mark of DEXs and pioneer of DEFI and the absolute benchmark for airdrops. Uniswap is the market leader and also the absolute GOAT in marketing. They had no comparable competitors at the time of airdrop launch and they set the standard for airdrops (which i must add that the airdrops that followed somehow keep missing the plot). Uniswap is in almost in every chain! They also had the first to market advantage in DEFI/SWAPS/AIRDROPS. They dont have to buyback and burn because its already staked with most leader pairs in the world. So comparing Optimism to UNI is not a fair comparison. Optimism is great but we have a long way to go. We are currently sitting at less 300 million USD MC. I would also like to reiterate the marketing angle since we are already here discussing UNI. UNI was propelled to its place by the surprise airdrop they did. They were incredibly popular and garnered so much popularity and along with that came success (granted there weren’t airdrop farmers because it was a surprise). I am beginning to notice a pattern here and I would later try to make a quantitative argument for it. What I am noticing is projects that were too hell bent on “removing Sybillers”  have in fact performed poorly as opposed to the ones who didn’t. This is not a debate about whether or not filtering airdrop farmers is good or bad rather this is strictly an observation. In theory airdrop farmers “do” the qualifying work means that they have contributed the project by using it (of course their intentions are debatable). Sybillers or not those who will dump will always dump and those who will buy will always buy. So the markets eventually balances things out.  In the process of all these stringent filtering and anti price growth sentiment is just bad marketing at the end of the day. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.1893939393939394
                },
                {
                    "author_link": "https://gov.optimism.io/u/ApePrince",
                    "index": "27",
                    "likes": "3",
                    "time": "07/06/2022-07:58:37",
                    "content": "How can we increase demand for the $OP token if it’s not going to be used for gas? How do we make sure that $OP does not just become another worthless governance token? Here’s an idea: A token that generates $ETH for stakeholders (or stakers) while simultaneously burning itself EIP-1559 style with every transaction. Here’s how it would work in theory: Users transact on Optimism > Gas fees are paid in $ETH > L1 Fees are subtracted > Leftover fees get added to the treasury > the treasury uses 20-30% of $ETH generated to buy and burn $OP > 70-80% of the $ETH fees that’s left gets spread across staked $OP tokens. This way, the Optimism economy is perpetually rewarding itself as usage grows, while being able to incentivize growth with a token that has created a “value” loop as antidote to the worthless governance token sickness. Assets that generate $ETH for their holders will significantly outperform in the long run imo. $OP can either become one of these assets or eventually be vampire attacked by an anon team. This only concerns “revenue” generated from transaction fees and what to do with it. Not related to the community fund of $OP tokens that reward projects or charities etc. Original post is below     The best of both worlds ($OP/$ETH) 💌 Ideas & Feedback       There seems to have been quite the debate lately on whether or not to use $OP as the token for gas payments.  While this may look like the most uniform and best way to go, some users have rightfully pointed out that this mechanism is terrible for value accrual towards the $OP token itself.  The reason for this is because Optimism’s security still comes from Mainnet Ethereum. Hence the fees for this security need to be paid in Ether.  This means that the protocol becomes a perpetual seller of its…     ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5625
                },
                {
                    "author_link": "https://gov.optimism.io/u/chien",
                    "index": "28",
                    "likes": "0",
                    "time": "07/06/2022-08:10:21",
                    "content": "Hmm… It looks like pumping. it’s not wrong but I think it’s quite unhealthy for optimism itself “in the long run”. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.666666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/IceQueen",
                    "index": "29",
                    "likes": "1",
                    "time": "07/06/2022-08:15:50",
                    "content": "    chien:  quite unhealthy for optimism   please elaborate in detail how it is unhealthy for a token value to go up? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/IceQueen",
                    "index": "30",
                    "likes": "0",
                    "time": "07/06/2022-08:22:04",
                    "content": "After reading most of these comments and replies; I am thinking? Should Optimism have gone for a stable voting token? I mean makes sense in governance terms; 1 OP = 1 vote? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.46875
                },
                {
                    "author_link": "https://gov.optimism.io/u/Preacher",
                    "index": "31",
                    "likes": "4",
                    "time": "07/06/2022-09:53:44",
                    "content": "A buyback and burn alone is not enough IMO. I’ve written a post on a solution that includes rewarding part of the ETH fees to stakers and using another part to also buy and burn. This way the token becomes yield bearing while increasingly scarce. That is a golden combination that surpasses a simple buy and burn. Dont get me wrong, a buy and burn would be good, but why choose good when you can have better? Heres my original post: https://gov.optimism.io/t/the-best-of-both-worlds-op-eth/2391 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.430555555555556
                },
                {
                    "author_link": "https://gov.optimism.io/u/Vikram",
                    "index": "32",
                    "likes": "0",
                    "time": "07/06/2022-14:32:31",
                    "content": "I was not comparing OP to UNI, but pointing out how your statement was not accurate, which it is not.     IceQueen:  We are currently sitting at less 300 million USD MC.   This is the problem, using market cap as the definition of success. There are other metrics that should be used to measure success. TVL, number of users, number of transactions, for example. If the sole focus is make token go up, yes focus solely on market cap and burn all the tokens, turn it into a gas token, and punish people who sell. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0773809523809526
                },
                {
                    "author_link": "https://gov.optimism.io/u/IceQueen",
                    "index": "34",
                    "likes": "0",
                    "time": "07/06/2022-20:12:44",
                    "content": "    Preacher:  A buyback and burn alone is not enough IMO. I’ve written a post on a solution that includes rewarding part of the ETH fees to stakers and using another part to also buy and burn.   Buyback and burn is a blanket term in this case and of course we can get creative and innovative with the idea. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://gov.optimism.io/u/Vikram",
                    "index": "35",
                    "likes": "0",
                    "time": "07/06/2022-20:29:05",
                    "content": "    IceQueen:  What made you think that I am pro punishing people. That’s against the whole marketing angle this proposal is going with. No its not our job to punish people who sold. This whole witch hunt vibe is just killing popularity and in this market we need all the positivity and popularity.   I’m not just responding to you. Great example of someone that thinks this tread revolves around one person. I was just making a point that this is just another proposal that is focused solely on token go up, which it is. You can write paragraphs that say otherwise, but that’s just a bunch of words saying nothing but how do we make token go up. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.000000000000001
                },
                {
                    "author_link": "https://gov.optimism.io/u/JenSenhaji",
                    "index": "36",
                    "likes": "2",
                    "time": "07/06/2022-21:28:47",
                    "content": "MakerDAO is probably the longest running example of a buy and burn design and some can say it has had mixed results. More DAI creation via Maker Vaults = more stability fees paid/revenue to the protocol. If there are more fees that means MKR holders are making good decisions on managing the protocol, from setting fees, on-boarding collaterals and managing risk (to name a few parameters). Poor governance decisions would then = less revenue and less burning of MKR. Increase in MKR price has not always correlated with burning and there is currently a divide in the community on re-starting the burn (which was voted on to pause in order to increase the surplus buffer to a larger size for growth objectives and risk management). Regardless of ones view to burn or not to burn, the more important issue is that once there is an  expectation to burn OP tokens as part of the system mechanics, it will be very complicated for the community  to undue that promise should it turn out not to be the best technique long term. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.770833333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/Daniel",
                    "index": "37",
                    "likes": "2",
                    "time": "07/06/2022-22:30:21",
                    "content": "Individuals respond to economic incentives. If we provide a mechanism whereby token holders benefit from increased economic activity in the ecosystem, then they will be incented to take governance seriously and support proposals that enable growth. Without any economic link, then there is no positive feedback loop and apathy persists. The buyback and burn mechanism has been implemented and effective for multiple top protocols. I fully support diverting 10-20% of revenues towards this mechanism. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.7831439393939394
                },
                {
                    "author_link": "https://gov.optimism.io/u/IceQueen",
                    "index": "38",
                    "likes": "0",
                    "time": "07/06/2022-22:34:10",
                    "content": "    Vikram:      IceQueen:  What made you think that I am pro punishing people. That’s against the whole marketing angle this proposal is going with. No its not our job to punish people who sold. This whole witch hunt vibe is just killing popularity and in this market we need all the positivity and popularity.   I’m not just responding to you. Great example of someone that thinks this tread revolves around one person. I was just making a point that this is just another proposal that is focused solely on token go up, which it is. You can write paragraphs that say otherwise, but that’s just a bunch of words saying nothing but how do we make token go up.   Again, this is not about pumping the token. Its about increasing the market share so $OP can be better positioned. Only way to communicate in this forum is to use words and mean it. Thats how productive communication goes; saying you never meant it is not a good defense to invalidate another’s statement. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.741071428571428
                },
                {
                    "author_link": "https://gov.optimism.io/u/Vikram",
                    "index": "42",
                    "likes": "1",
                    "time": "07/06/2022-23:29:49",
                    "content": "Yes, I agree. This is just a sad attempt to artificially prop the price up. Before submitting proposals some people need to read the mission and vision of the Optimism collective. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 2.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/vonnie610",
                    "index": "45",
                    "likes": "4",
                    "time": "08/06/2022-06:42:01",
                    "content": " Adhering to a core belief of optimism, we should continue with the belief that impact=price.  This is NOT the core belief, the core is impact = profit and that is profit to the individual(s) who created the impact, not the ecosystem as a whole that benefited from the impact. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/IceQueen",
                    "index": "46",
                    "likes": "0",
                    "time": "08/06/2022-07:37:08",
                    "content": "    vonnie610:  This is NOT the core belief, the core is impact = profit   My god are we here to argue semantics? On that same not how are individuals who created the impact not a part of the ecosystem as a whole? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/vonnie610",
                    "index": "47",
                    "likes": "1",
                    "time": "08/06/2022-08:25:10",
                    "content": "We are not here to argue semantics. But there is a difference between price (which implies price of the token) and profit (which just implies excess funds). The whole point of impact = profit is to reward impact, not pump $OP bags. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/WhiteHat",
                    "index": "48",
                    "likes": "6",
                    "time": "08/06/2022-08:38:18",
                    "content": "This article does not have any valid economic concern or merit. Buy back and burn does not contribute to the growth of the OP eco-system. We as a community need to promote OP for mass adoption through out web3 communities and make it more attractive for users to use OP network. We can also invite and fund developers to build new infrastructure to launch new projects on OP to create more diverse and vibrant eco-system. This will have positive impact on price over time. It’s not a sustainable option to pump token price artificially. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.033333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/shridhar.eth",
                    "index": "49",
                    "likes": "1",
                    "time": "08/06/2022-08:40:15",
                    "content": "VERY GOOD PROJECT…need agressive marketing to shine ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.549999999999999
                },
                {
                    "author_link": "https://gov.optimism.io/u/AlexJ",
                    "index": "50",
                    "likes": "0",
                    "time": "09/06/2022-08:21:37",
                    "content": "The price doesn’t matter, the eco is. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/junxinwang",
                    "index": "51",
                    "likes": "1",
                    "time": "12/06/2022-15:20:55",
                    "content": "I agree. Op token is very important for builders and supporters, it should be valuable. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.6
                },
                {
                    "author_link": "https://gov.optimism.io/u/IceQueen",
                    "index": "52",
                    "likes": "0",
                    "time": "13/06/2022-22:54:38",
                    "content": "I beg to differ. Eco cant grow  without a respectable market cap. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/Optimus",
                    "index": "53",
                    "likes": "0",
                    "time": "15/06/2022-12:35:44",
                    "content": "$OP buyback and burn sounds good to me. It should sustainably increase the price over time ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/Daniel",
                    "index": "54",
                    "likes": "1",
                    "time": "16/06/2022-15:25:45",
                    "content": "I believe a buyback and burn program will ultimately increase ecosystem growth and enable a higher degree of public goods funding than would exist without the program:   Aligns incentives between governance and ecosystem growth: If we create a feedback loop whereby governance decisions that promote sustainable ecosystem growth have a positive impact on $OP value, then on the margin you will have higher participation and decisions that are more in line with that outcome.  Show me the incentives and I will show you the outcome.   Improves incentives for new ecosystem participants:  Optimism is actively utilizing $OP tokens to incentivize ecosystem growth, both through future airdrops and allocations to ecosystem protocols for distribution.  But if that $OP token is of minimal value, the incentive for users to move liquidity to $OP diminishes.  L2’s will be an intensely competitive landscape where network effects (liquidity) are critically important for future growth.  Creating a mechanism to enable $OP to accrue value is an important competitive lever for the ecosystem.   If we allocate 20% of profits to a buyback program and 80% to public goods, I ultimately believe we will be able to grow the ecosystem and fund more public goods than we otherwise would have, to the benefit of Optimism and the broader Ethereum ecosystem (would be good to put numbers around this assumption, of course). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.957575757575757
                },
                {
                    "author_link": "https://gov.optimism.io/u/iSpeakNerd",
                    "index": "55",
                    "likes": "1",
                    "time": "16/06/2022-23:43:21",
                    "content": "Thank you for the patience and calm in responding to posts like this. Very much appreciate your replies in this thread. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.4
                },
                {
                    "author_link": "https://gov.optimism.io/u/Oppa",
                    "index": "56",
                    "likes": "3",
                    "time": "18/06/2022-07:49:55",
                    "content": "There’s an interesting proposal gaining support which has burning OP tokens baked in     [DRAFT] [GF: Phase 1 Proposal] Raptor Governance Fund: Phase 1   Project Name: Raptor Author Name: netrunner (@netrunner)   Number of OP tokens requested: 800,000   L2 Recipient Address: 0xB1e36fA14cEBC9754A581f92c59675F842513D88   Relevant Usage Metrics: (TVL, transactions, volume, unique addresses, etc.) • Trading Volume on Uniswap (30d): <$1M. MCap: ~35M. We just launched on Uniswap! (fair launch).   Optimism alignment (up to 200 word explanation): • Raptor is an Ethereum Infrastructure DAO focused on staking ETH2 Validator Nodes to provide a public…     ",
                    "links": [
                        "https://www.raptor.wtf"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.31875
                }
            ]
        }
    ],
    "group_index": "71"
}