{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/community-mottos-brainstorm/3681",
            "title": "Community Mottos Brainstorm ",
            "index": 3681,
            "category": [],
            "tags": [
                "season-2"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "1",
                    "likes": "14",
                    "time": "11/10/2022-21:44:24",
                    "content": "The Optimism Collective is an attempt to radically change how we work together to create a powerful and sustainable digital ecosystem governed by and for its citizens. Iterative experimentation requires a lot of feedback and governance discussions can touch on a wide range of difficult-to-navigate topics. We want our community to be able to work through these issues constructively and collaboratively, so we can achieve this vision as a Collective. A few weeks ago, Jing suggested the community create a few pithy mottos to set some norms around community engagement during (sometimes tough) governance discussions. Inspiration came from this: “Welcome to Cyberia: boringly earnest discussion of cryptocurrencies. Anyone trolling will be defenestrated. Please err on the side of extreme civility—there are lots of wonderful places to sling mud, but this isn’t one of them. Before inviting anyone new, please ping @ wheatpond. Thanks!” Opening this thread to move this forward and create an avenue for delegates to brainstorm. Can’t wait to see what you come up with! ",
                    "links": [
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/13",
                        "https://gov.optimism.io/t/recap-community-call-6-october-11th/3682",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/12",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-velodrome-finance/3736/37",
                        "https://gov.optimism.io/t/season-2-feedback-thread/3818/29"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.39806721056721
                },
                {
                    "author_link": "https://gov.optimism.io/u/Tjark",
                    "index": "2",
                    "likes": "0",
                    "time": "12/10/2022-13:50:38",
                    "content": "Reminds me a lot of an article I recently came across: AN END TO DOOMERISM, Or why I’m coming out as an impatient optimist by Hannah Ritchie Some quotes from it seem like a great fit:  Optimism is seeing problems as challenges that are solvable; it’s having the confidence that there are things that we can do to make a difference.   Pessimism is a barrier to progress  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPGovWatch",
                    "index": "3",
                    "likes": "5",
                    "time": "12/10/2022-15:36:23",
                    "content": "This is a great start. One suggestion would be to add something that encapsulates the idea the of “attack the idea, not the person.” It is essential in governance to be able to critically discuss the ideas and proposals in front of us. This will at times lead to conversations that feel heated and that is not necessarily bad thing as our goal is to get to the best outcomes. Where I’ve seen discourse break down in the past is when it shifts from a discussion of ideas in question to a discussion of individual identities or motivations. This can be used to effectively create a prima facie dismal of an individual’s perspective and can create a chilling effect on further discussion or debate which is not great for creating the best outcomes. Where there are concerns of ill-intent or bias driving particular ideas, those are best addressed by putting forward and building consensus around better ideas, not accusations or speculation around individual intention. This will help us to keep focused on what is most important: the ideas. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.3121693121693125
                },
                {
                    "author_link": "https://gov.optimism.io/u/TheDoctor",
                    "index": "4",
                    "likes": "1",
                    "time": "12/10/2022-18:54:14",
                    "content": "Optimistic paradigm killers ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/jrocki.eth",
                    "index": "5",
                    "likes": "1",
                    "time": "19/10/2022-07:25:57",
                    "content": "    OPGovWatch:  One suggestion would be to add something that encapsulates the idea the of “attack the idea, not the person.” It is essential in governance to be able to critically discuss the ideas and proposals in front of us. This will at times lead to conversations that feel heated and that is not necessarily bad thing as our goal is to get to the best outcomes.   I will up vote “attack the idea, not the person” AND will also add: “We can govern ourselves through effective collaboration or the regulators can do it for us after we implode” ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.041666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/TheDoctor",
                    "index": "6",
                    "likes": "0",
                    "time": "19/10/2022-19:46:19",
                    "content": "    OPGovWatch:  One suggestion would be to add something that encapsulates the idea the of “attack the idea, not the person.” It is essential in governance to be able to critically discuss the ideas and proposals in front of us. This will at times lead to conversations that feel heated and that is not necessarily bad thing as our goal is to get to the best outcomes.   There are a lot of experiments in cognitive bias and behavioral economics to consider too. For example, when several people have to express their idea, it is better if people write them down and then share all ideas together, rather than people expressing them one by one. We tend to agree and to be biased toward the majority opinion. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.371527777777778
                },
                {
                    "author_link": "https://gov.optimism.io/u/hait",
                    "index": "7",
                    "likes": "0",
                    "time": "02/12/2022-12:08:18",
                    "content": "oh that’s a good idea!  Let’s put our heads together. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.375
                }
            ]
        }
    ],
    "group_index": "294"
}