{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/draft-gf-phase-2-proposal-nested/2774",
            "title": "[DRAFT] [GF: Phase 2 Proposal] Nested ",
            "index": 2774,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Governance Fund: Phase 1"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/Thong",
                    "index": "1",
                    "likes": "3",
                    "time": "24/06/2022-11:50:45",
                    "content": "Project Name: Nested Author Name: @Thong Number of OP tokens requested: 450000 L2 Recipient Address: Relevant Usage Metrics: Latest TVL can be checked on Defillama Unique addresses: > 60000 (TVL, transactions, volume, unique addresses, etc.) Optimism alignment : Nested intends to democratize SocialFi and we believe that the idea of privileges does not go well with that of democratization. Optimism provides a protocol that is aligned with what Nested is trying to achieve because of how effectively it cuts cost, which increases accessibility. Nested’ service is technically elaborate and demanding. It is reassuring for Nested to work with companies that also set a bar high — just as we do. We enable users to buy or sell various assets and copy entire strategies in one click, with as high as 12 swaps and a burn in a single transaction. Optimism’s advanced solution is no easy feat either. Building rollup systems is a big technical challenge in and of itself. Optimism is just a perfect fit, both philosophically and technically. Proposal for token distribution : Trading competitions: The main goal of this grant is to partially fund pools of allocated tokens for trading competitions. As our trading competition model will evolve, these tokens will give us the ability to incentivise participation for Op-related trading competitions amongst our community. Growth and community: This is destined to help onboard new community members while maintaining and growing engagement of our existing community. We hope to create and incentivize engagement through various trading events to motivate people to create portfolios on op. More users mean more usage of both Nested and Op – it’s a win-win scenario. Early adopters: We want to thank all early-birds, those who believed in us from the get-go. They are the ones who have carried the torch and created the first Nested portfolios. We have learned from them and it is only logical to show our gratitude. Subsidies: 20% of the trading fees on Optimism could be reimbursed partially to further incentivize participation. The percentage might be adapted as the project progresses. How will the OP tokens be distributed and how will this distribution incentivize usage and liquidity on Optimism? Users will be able to create long term strategies–portfolios–that will return OP tokens according to their level of engagement on the Nested protocol. The more active they will be, the better for them. They will have to create portfolios, swap, and copy to be eligible. Additionally, we are also developing a DCA feature, staking and farming copy-trading features that will generate yield through other dapps. In other words, users will need to lock their capital (to be lent, provide liquidity, etc.) in other Optimism deployed protocols, which will increase TVL on the network overall. Why will the incentivized users and liquidity remain after incentives dry up? The real question is why should we let incentives dry up? We have no intention of sitting and waiting for people to get motivated, A share of OP tokens will be allocated to marketing campaigns to help users get to know Optimism better, and our platform is a social platform with trading events constantly being organized. We might be organizing all of them now, but the goal is also to see the community take further action and ownership for Nested. The more people will use Nested, the more events and mutual incentives will be generated to engage with the platform. Moreover, just as Optimism, we believe in a long term and sustainable vision for the ecosystem, and this is why we have focused on growing our community organically. Over what period of time will the tokens be distributed? We anticipate that these incentives will be distributed over a 6-18 months time frame. How much will your project match in co-incentives? We currently don’t have a token, so monetary incentives can’t be matched. ",
                    "links": [],
                    "GPT-summary": "The post is a draft proposal for a project called Nested, which aims to democratize SocialFi. The author explains the project's alignment with Optimism and proposes a token distribution plan for trading competitions, growth and community, early adopters, and subsidies. The post also addresses how the incentivized users and liquidity will remain after incentives dry up and provides a timeframe for the distribution of incentives. A third party could provide constructive criticism or ask questions about the proposal, while the author is advertising the proposal.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Token economics",
                        "Community and engagement",
                        "Interoperability and Scaleability",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal",
                        "None"
                    ],
                    "Sentiment": 5.783100157418339
                },
                {
                    "author_link": "https://gov.optimism.io/u/cappyz",
                    "index": "2",
                    "likes": "0",
                    "time": "29/06/2022-08:57:21",
                    "content": "I like Nested. This protocol help me a lot to manage my portfolio. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "3",
                    "likes": "0",
                    "time": "03/07/2022-20:46:08",
                    "content": "For my lazy frens. Screenshot of TVL from DefiLama  grafik482×527 24.2 KB  Could you also mention how much you are planning to spend in each section(early adopter, growth and community) . ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.875
                },
                {
                    "author_link": "https://gov.optimism.io/u/ScaleWeb3",
                    "index": "4",
                    "likes": "1",
                    "time": "04/07/2022-13:45:19",
                    "content": "Re Proposal: The number of Op tokens requested seems a bit high - especially for being very early-stage. At the same time, details on Op distribution are missing which makes it hard to say YES on your proposal. Re Product: Social Finance can become a major crypto product with the inherent transparency. That said, copytrading a portfolio on your dapp is very different from actually copytrading a successful trader (adverse selection effect among managers/influencers-users was also present on dHedge). What have you considered to prevent washtrading or gaming your KPIs? - Relevant for funding this proposal. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.428525641025641
                },
                {
                    "author_link": "https://gov.optimism.io/u/fewol",
                    "index": "5",
                    "likes": "0",
                    "time": "04/07/2022-22:27:44",
                    "content": "The amount requested is way to high when compared to your metrics. You have only $115,730 TVL on Optimism and $897,353 TVL across all the chains you support, but are asking for $248,760 which is 2x the amount you have on Optimism ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.4
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "6",
                    "likes": "0",
                    "time": "13/09/2022-21:37:34",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "114"
}