{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/optimism-quest-retrospect-and-future-direction/5300",
            "title": "Optimism Quest Retrospect and Future Direction ",
            "index": 5300,
            "category": [],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/CryptoKachu",
                    "index": "1",
                    "likes": "22",
                    "time": "19/02/2023-12:06:52",
                    "content": "Author:  CryptoKachu(katsu.philosophia@gmail.com, @CryptoKachu ) Robbie OH(robbie@philosophiavc.com, @robbie_philosophia )  Optimism Quest Retrospect The Optimism Quest has recently ended and the level of optimism network activation demonstrated during the event was amazing. The daily transaction volume and user count showed that Optimism outperformed Arbitrum. It’s worth mentioning that the level of participation during the Quest was remarkable. Specifically, projects that participated in the quest (Kwenta, Pika Protocol, Rubicon, Velodrome, Synapse Protocol) succeeded in making a lot of traction from Optimism users. Our analysis can be found in our dashboard here: Polygon, Arbitrum, Optimism Comparison: Transaction Tendency and DEX Volumes Points that should be addressed The effect of the quest did not last long where we witnessed the sharp decline in the network activation right after the event. Please take a look at the below figures: number of daily transactions per day with more than 10,000 transactions and number of daily transactions.  dapp_activation.2061×597 90.7 KB   transaction_decline1246×369 37.4 KB  Future Direction Although the transaction volume has decreased now, what if we prepare for the next phase? What if we think about ways that the Optimism Quest could help activate optimism more sustainably and in the long term? And if we propose a Quest based on that, we may be able to make the next phase more successful. Ways to do this include:  Conducting a protocol survey that helped Optimism grow as an L2 layer and targeting a quest to accomplish this Designing quests that align with the direction Optimism is heading, such as TVL, Dex Volume, NFT Volume, etc.  Would you be interested in analyzing and discussing these areas to help design the next step of the Quest? ",
                    "links": [
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/8/897fa2c85ea053d50acf533281f543466b515820.png",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/2/2a94ade80c42954a154127b9c41e14b42feaea12.png",
                        "https://gov.optimism.io/t/gf-phase-1-proposal-analysis-on-optimism-incentive-programs-and-framework-construction-for-future-programs/5456/3",
                        "https://gov.optimism.io/t/gf-phase-1-proposal-analysis-on-optimism-incentive-programs-and-framework-construction-for-future-programs/5456",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-rabbithole-quests-on-optimism/5377/2",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/35"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.898065476190476
                },
                {
                    "author_link": "https://gov.optimism.io/u/Mark_De.Fi",
                    "index": "2",
                    "likes": "4",
                    "time": "19/02/2023-18:08:04",
                    "content": "Great point that the quests that ended is only the first season, which was written about in the docs (can’t remember where, exactly, but I definitely saw that information when I was tweeting the thread about it) So yeah, there are definitely more quests ahead of us, but don’t you think it’s more likely that they could be an increase in community engagement in the first place From this fact also follows the point that it is quite possible it will be used for the following drops My opinion on this is that the team most likely already have a clear idea of their next steps is in the direction of developing quests / something similar to engage the community What do you think about that? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.984375
                },
                {
                    "author_link": "https://gov.optimism.io/u/hait",
                    "index": "3",
                    "likes": "4",
                    "time": "20/02/2023-04:27:31",
                    "content": "This quest seems to have a bigger voice of disappointment.  I’m not sure if the airdrop is over yet, but if there’s no additional reward after the recent gas fee reward, I don’t think it will be active even if a new quest comes out. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.29419191919192
                },
                {
                    "author_link": "https://gov.optimism.io/u/CryptoKachu",
                    "index": "4",
                    "likes": "5",
                    "time": "20/02/2023-13:12:00",
                    "content": "Thank you for the valuable reply. I have a different opinion. Even though the Optimism team might have a clear idea about the next quests, community members can take part to gather collective intelligence about how to design the next steps for the Optimism quest. Since it is just the first season of the event, we need to retrospect the quest and talk about better ways to make it a better one next time. Especially, in terms of the sustainability of the quest effect, we should find a better way to make longer quest effects.   Sharp decline in transaction count right after the event  transaction_decline1246×369 37.4 KB    dApps become inactive right after the quest ( I just visualize the contracts with more than 10,000 transaction per day)  dapp_activation.2061×597 90.7 KB    By addressing the problem that quest effect only maintains for a short time, we can make the quest to be one of ways to activate Optimism in the long run. ",
                    "links": [
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/8/897fa2c85ea053d50acf533281f543466b515820.png"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.807773109243698
                },
                {
                    "author_link": "https://gov.optimism.io/u/CryptoKachu",
                    "index": "5",
                    "likes": "6",
                    "time": "20/02/2023-13:17:54",
                    "content": "I totally agree with you. Even though Optimism quest has shown remarkable effect in activating the network, the effect does not last long. The real important issue to deal with is designing a neat quests to make the effect last longer. For this, we should think about ways to provide effectual rewards to participants and effective quests that can help the network in the long run. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.15625
                },
                {
                    "author_link": "https://gov.optimism.io/u/tkooq",
                    "index": "6",
                    "likes": "3",
                    "time": "20/02/2023-14:07:35",
                    "content": "Great threads! I hope to see future analysis. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/FractalVisions",
                    "index": "7",
                    "likes": "4",
                    "time": "20/02/2023-15:16:01",
                    "content": "I can’t wait to see how these charts look with the next series of quests !!! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/CryptoKachu",
                    "index": "8",
                    "likes": "1",
                    "time": "20/02/2023-23:47:33",
                    "content": "Thank you I will analyze the data of the following quest with more aspects  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/CryptoKachu",
                    "index": "9",
                    "likes": "1",
                    "time": "20/02/2023-23:48:03",
                    "content": "Thank you  Will post a new thread when next quest is over. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.340909090909091
                },
                {
                    "author_link": "https://gov.optimism.io/u/MSilb7",
                    "index": "10",
                    "likes": "5",
                    "time": "21/02/2023-18:58:23",
                    "content": "Note: I work at OP Labs, but making this comment in my personal capacity Hey, awesome to see more analyses on Optimism & thanks for sharing here! We’ve historically seen that programs like quests can get overrun by sybil attacks and massive farming operations (qualitatively, this was observed during Optimism Quests as well). So if the total usage number is known to be skewed, a large off drop post-quests should be expected. The stated purpose of the program was to “make Optimism more accessible for both new & experienced users.” So, comparing usage in the post-quest period versus the pre-quest period could get us closer to measuring the impact. The Optimism Quests - App Growth on Optimism After Quests  dashboard takes this approach. In the 30-days post-quests, we saw a +47% growth in all Optimism transactions post-quests vs pre-quests, and +100% growth among apps such as Pooltogether, Granary, Rubicon, Beethoven X, and more. While this still isn’t a ~perfect measure, I think the time-period selection gets us closer to a quality read. ~Early insights were shared here, but ideas for next steps could include benchmarking this against overall L2/L1 usage growth. It’s still unclear if quests had an impact, or if this growth would’ve happened anyway.  image2980×960 266 KB  Other scattered notes:   For raw transaction count, I recommend filtering out system addresses (labels.system_addresses table - example query using this). Optimism has a system transaction ~every L1 block, Arbitrum has one ~every L2 block (Optimism will have this in Bedrock). So, raw transactions can be a skewed indicator for L2s if the goal is to measure “user activity”.   Glad to see you used our queries & project tagging tables! Dune also has a “fork” function, which may help readers attribute queries back to the original source if that’s desired for you all.   Definitely happy to provide feedback if you all continue with these kinds of analyses! ",
                    "links": [
                        "https://dune.com/optimismfnd/Optimism-Project-Usage-Trends",
                        "https://twitter.com/MSilb7/status/1617579463402717198",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/a/aa9eb12700a0202de54c2455f3f4f71f48720c08.png",
                        "https://github.com/duneanalytics/spellbook/tree/main/models/labels/infrastructure/identifier/system_addresses",
                        "https://dune.com/queries/1064888/1829036",
                        "https://dune.com/optimismfnd/Optimism-Project-Usage-Trends"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.286367478675171
                },
                {
                    "author_link": "https://gov.optimism.io/u/CryptoKachu",
                    "index": "12",
                    "likes": "2",
                    "time": "22/02/2023-01:06:58",
                    "content": "Thank you for the kind feedback and your inputs on my analysis. I learned a lot from your comments and your queries! (I hope to become an excellent data analyst like you in the future  )   Glad to see you used our queries  & project tagging tables! Dune also has a “fork” function, which may help readers attribute queries back to the original source if that’s desired for you all.   First of all, I apologize that my previous queries were not written under \"fork\"ed query. Even if I wrote in the text widget that those queries were forked from yours, it is my mistake. I mistakenly confused that those queries were written under the ‘forked’ setting  (Other queries for the pie chart were written under the forked query and correctly shows the source of the code). I revised the query and you can see the changes in my dashboard.   For raw transaction count, I recommend filtering out system addresses (labels.system_addresses table - example query using this). Optimism has a system transaction ~every L1 block, Arbitrum has one ~every L2 block (Optimism will have this in Bedrock). So, raw transactions can be a skewed indicator for L2s if the goal is to measure “user activity”.   Thank you for the advice! I changed my query to wipe out the transactions that interacted with system addresses. Although overall trends have not been changed, I will look for more filtering to apply based on the query you shrared. ",
                    "links": [
                        "https://github.com/duneanalytics/spellbook/tree/main/models/labels/infrastructure/identifier/system_addresses",
                        "https://dune.com/queries/1064888/1829036"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.8175366300366305
                },
                {
                    "author_link": "https://gov.optimism.io/u/CryptoKachu",
                    "index": "13",
                    "likes": "6",
                    "time": "22/02/2023-01:43:48",
                    "content": "In this reply, I want to share some idea about 1) evaluating the impact of the quest, and 2) determining the future purpose of the quest. Evaluating the impact of the Quest It seems that in the twitter post and the associated Dune dashboard you shared in your reply, the activity level is compared between two periods: before 2022-09-19 and after 2023-01-18. Considering that the overall atmosphere in crypto industry has changed a lot in 2023, we should filter out the external effects (overall expectation of the public on token prices, yield demands, overall liquidities and … etc) To filter out the effects from external sources, we could design a comparative analysis on several aspects similar to clinical studies (acutally, I have some background in medical researches). Only with comparison on various aspects, we can enhance the probability that we can correctly assess the impact of the quest. I just brainstormed the analysis direction but each requires sophisticated design process.  comparing the growth with other L2 layers comparing the growth with L1 layers comparing the activities (pre/post Quest) of addresses between two groups: who already used Optimism before the event vs who just started using Optimism during the Quest  In evaluating the impact, I will look for some statistical techniques that can wipe out the effect from external sources. Furthermore, the changes should be observed for short-term and longitudinal basis to correctly understand the characteristics of the Quest’s impact on Optimism. Determining the future direction I perfectly agree with your statement that the quest is successful in terms of “make Optimism more accessible for both new & experienced users.”. First of all, however, as I stated in the “Evaluating the impact of the Quest”, we should assess the impact in a more sophisticated/various aspects with longitudinal observations. Another point I want emphasize in this post is that we should discuss “whether we can elaborate or further develop the purpose based on the retrospect on the Quest”. As we witnessed that the Quest have powerful impact on attracting user’s engagement, with more elaborate purpose and strategies, I believe we can utlize such event as one of the powerful fuel to drive the Optimism growth. This is the point I want to discuss in the governance post. Thank you posting your feedback and really nice inputs. I hope to listen about about thoughts on the above issues! ",
                    "links": [
                        "https://dune.com/oplabspbc/optimism-quests-project-usage-growth"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.119146005509641
                },
                {
                    "author_link": "https://gov.optimism.io/u/Mark_De.Fi",
                    "index": "14",
                    "likes": "3",
                    "time": "22/02/2023-16:42:00",
                    "content": "Well, my thoughts have changed on this, thanks for providing more detailed analysis in this particular regard I think this is where we need to look at how arbitrum does Because indeed we can see how optimism attracts a huge number of transactions through quests or similar It doesn’t look like the most stable growth anyway, despite the technological advances that optimism is making ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5476190476190474
                },
                {
                    "author_link": "https://gov.optimism.io/u/griptoe666",
                    "index": "15",
                    "likes": "2",
                    "time": "22/02/2023-20:17:19",
                    "content": "i guess there’s a hard to find optimum of incentivising short term action and so creating hype and having long lasting, healthy effects on the other hand. what’s also interesting is how to allocate future airdrops without giving away too much to a lot of airdrophunters with several wallets selling anyway. with this recent governance airdrop they made a nice move. but you also want to create the hype to have all this free advertisment on social media. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.802083333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/CryptoKachu",
                    "index": "16",
                    "likes": "4",
                    "time": "22/02/2023-23:45:05",
                    "content": "Thank you for the wonderful discussion! I think in-depth research on various growth strategy and evaluation each strategy is required for the agenda. I will try to make a research grant with detailed approach/methodology for the issue. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.333333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/CryptoKachu",
                    "index": "17",
                    "likes": "2",
                    "time": "24/02/2023-10:56:10",
                    "content": "Thank you for the nice idea. Feedback-based phases and meaningful rewards are key factors for successful airdrop I think. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.3125
                },
                {
                    "author_link": "https://gov.optimism.io/u/Mark_De.Fi",
                    "index": "18",
                    "likes": "2",
                    "time": "24/02/2023-18:05:51",
                    "content": "It’s definitely a good idea I will be glad to support at least and even help if necessary  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.125
                },
                {
                    "author_link": "https://gov.optimism.io/u/CryptoKachu",
                    "index": "19",
                    "likes": "3",
                    "time": "25/02/2023-02:05:12",
                    "content": "Sure. Thank you for the interest!! I will apply for this research as a grant proposal for Growth experiment. I will share the proposal with you when I post it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.90625
                },
                {
                    "author_link": "https://gov.optimism.io/u/Fot63life2000val",
                    "index": "20",
                    "likes": "2",
                    "time": "25/02/2023-11:00:07",
                    "content": "Yes I’ve seen many disappointed people in the discord about the quest and the 2nd airdrop. I believe they were under the impression that the quest was the way to get the airdrop, when in reality it was not. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.583333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/Mark_De.Fi",
                    "index": "21",
                    "likes": "3",
                    "time": "25/02/2023-20:38:07",
                    "content": "No, it’s still more of a way to get airdrop, but the point is to distinguish mere drop hunters from actual ecosystem users That’s exactly what airdrop 2 was made for, to reward active users and cover their costs for commissions, etc. But every activity that was beneficial to the development of the ecosystem will be rewarded P.S. this is my opinion and how I see solutions from a team who are primarily interested in developing their own product ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.69047619047619
                },
                {
                    "author_link": "https://gov.optimism.io/u/Fot63life2000val",
                    "index": "22",
                    "likes": "3",
                    "time": "05/03/2023-06:04:03",
                    "content": "Yeah and i dont like airdrop hunters, as im a holder. But it is part of every airdrop unfortunately you’ll always have people hunting the airdrop just to dump them once they recieve them. But to play devils advocate, wouldn’t them doing the quest and using the ecosystem in turn be what the devs wanted, for people to use the ecosystem and explore various parts of it? I have no skin in the game in that regards because i didn’t complete the quests, but one would naturally think that they did in fact use the ecosystem ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.3
                },
                {
                    "author_link": "https://gov.optimism.io/u/TheDoctor",
                    "index": "23",
                    "likes": "2",
                    "time": "05/03/2023-13:30:34",
                    "content": "    CryptoKachu:  Conducting a protocol survey that helped Optimism grow as an L2 layer and targeting a quest to accomplish this   I have already commented on the importance of surveys. They can provide a huge amount of valuable information from the user’s perspective.     Fot63life2000val:  Yeah and i dont like airdrop hunters, as im a holder. But it is part of every airdrop unfortunately you’ll always have people hunting the airdrop just to dump them once they recieve them. But to play devils advocate, wouldn’t them doing the quest and using the ecosystem in turn be what the devs wanted, for people to use the ecosystem and explore various parts of it? I have no skin in the game in that regards because i didn’t complete the quests, but one would naturally think that they did in fact use the ecosystem   I completely agree with your thoughts, but it’s not an easy task to manage airdrops in a way that promotes genuine users over hunters or sybils. However, I believe that the foundation knows what they are doing and future iterations will compensate real users who completed the quest. Besides airdrops, incentives can also come from being part of a collective that extracts value from the real world and not just from a temporary investment ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.430555555555555
                },
                {
                    "author_link": "https://gov.optimism.io/u/CryptoKachu",
                    "index": "24",
                    "likes": "2",
                    "time": "05/03/2023-13:35:34",
                    "content": "Totally agree with you. I think incentive programs like more like a complex organism because various entities and motivations can take part in the incentive programs.  I have already commented on the importance of surveys. They can provide a huge amount of valuable information from the user’s perspective.  So far, compared to Arbitrum or Polygon, Optimism do not have a representative dApp that make Optimism ecosystem distinctive from other Layer 2s. But I am sure there might be some niche markets where Optimism can outpace other competitors. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.527777777777779
                },
                {
                    "author_link": "https://gov.optimism.io/u/CryptoKachu",
                    "index": "25",
                    "likes": "2",
                    "time": "05/03/2023-13:38:10",
                    "content": "BTW, I have read your replies throughout the Optimism community and thank you for all the wonderful ideas you’ve shared to the community! Happy to see your comment in my post  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/Mark_De.Fi",
                    "index": "26",
                    "likes": "2",
                    "time": "05/03/2023-16:30:40",
                    "content": "Yes, they did, they used the ecosystem, but the problem is that these users will most likely not participate further in the project and will most likely just dump the tokens. In case there aren’t that many such users, it won’t cause any damage to Optimism, but if the second drop was as huge as the first one, my opinion is that the token could be at least under $2 now So my opinion on this is that too many drop hunters could do damage to the ecosystem at least in the price of the token… As for me, the goal that is set now for Optimism is to improve the ecosystem of both Optimism and Ethereum and for that you need to get regular, long-term users and a strong community that will not fall apart after airdrop P.S I also did not participate in the quests, unfortunately did not have time And of course I could be wrong about this, but my opinion is this ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.436274509803923
                },
                {
                    "author_link": "https://gov.optimism.io/u/CryptoKachu",
                    "index": "27",
                    "likes": "2",
                    "time": "07/03/2023-00:56:23",
                    "content": "I uploaded a proposal on the subject here     [GF: Phase 1 Proposal] Analysis on Optimism Incentive Programs and Framework Construction for Future Programs Governance Fund: Phase 1       Project name: Analysis on Optimism Incentive Programs and Framework Construction for Future Programs  Author name and contact info (please provide a reliable point of contact for the project):  Taeheon Lee, lee.t.h.0130@gmail.com  Robbie Oh, robbie@philosophiavc.com  Mike Kim, kimms213@gmail.com  Huisu Jang, yejooooo523@gmail.com  L2 recipient address:  0x160F00E48e50ABcE2d9262818B49752314E65857  Which Voting Cycle are you applying for?:  Voting Cycle 11, Season 3  I confirm that I have read the…     ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.722222222222222
                }
            ]
        }
    ],
    "group_index": "532"
}