{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/introducing-otterspace-a-soulbound-badge-solution-for-daos/3221",
            "title": "Introducing Otterspace, a Soulbound Badge solution for DAOs ",
            "index": 3221,
            "category": [],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/0xbendo",
                    "index": "1",
                    "likes": "11",
                    "time": "04/08/2022-14:54:31",
                    "content": "TL;DR Otterspace is building a flexible and easy-to-use infrastructure for DAOs to use non-transferable NFTs, which we call Badges. Badges can enable DAOs to perform non-financialized governance, automate permissions (access rights etc.), manage community-specific reputation/credentials and create better incentive systems. The Otterspace product is currently live on the Goerli Testnet and is accepting DAOs to its private Beta. Otterspace wants to get more active in the Optimism ecosystem and collaborate for the following reasons:  We are building Otterspace as an Optimism-first protocol We have a strong mission & values alignment for furthering public goods Optimism is already utilizing SBTs within governance, making Otterspace an ideal partner   Who we are Team Emily Furlong (Twitter: emthemaker)  Leading product and community at Otterspace Former Product Lead for creator to fan engagement and support at SoundCloud, Community Lead at Shark DAO, and contributor to Cabin DAO  Ben Dobbrick (Twitter: 0xbendo)  Leading all things commercial, including partnerships, ecosystem growth and marketing Former early-stage investor and operator in the Future of Work and Web3 space and contributor with PieDAO and SharkDAO  Rahul Rumalla (Twitter: rahulrumalla)  Leading all technical efforts Former Director of Integrations at SoundCloud – leading developer community, partnerships and integrations. Previously also Co-Founder/CTO of music Web3 startup Paperchain   What are we building? We are realizing our mission by building three components – a token standard, an open source protocol, and an application. Our goal is to provide any community with the tools they need to bring badges to life, whether it is just the token, the protocol or the application.  How do Badges work? In the Otterspace app, DAO operators can set up their DAO, create badges and distribute them to addresses. To avoid non-consensual minting, the Otterspace Protocol requires the recipient to claim and mint the badge themselves. Airdrops are not possible. As the protocol is on Optimism, the transaction costs incurred are marginal. Some of the common use cases we’ve seen in DAOs  Different levels of membership (think lurker vs. core-contributor) Different teams or guilds (media guild, dev guild…) Achievements/rewards like contributor of the month Different roles with a badge expiry date (for example the 90-day community lead role) Guest pass with a 7-day expiry Skills (for example Solidity level 10)  Badges have utility  Badges are especially powerful because they can have utility attached to them – Otterspace is collaborating with multiple DAO tooling providers to integrate the badges across the DAO tooling landscape. Badges can be used for governance (e.g., Snapshot), access permissions (e.g., Clarity, Discord), payments (e.g. Radicle drips) and more. Additionally, badges are useful simply as a way of showing off reputation, history and experience. The Otterspace Protocol is being developed as an open set of smart contracts, so DAOs can compose and integrate pieces into their own tech stack and other app developers can construct custom front-ends.  What problems do Badges solve? The current method of distributing influence in DAOs, oftentimes based on fungible token ownership, is problematic because influence disproportionately goes to whales, which runs counter to the philosophy of many DAOs. Contributors earning their ‘salaries’ in tokens end up selling their influence to cover expenses. Distribution of permissions is also problematic, as it requires manual management. The frequent turnover in DAOs creates overhead for adding and removing permissions from individuals. DAOs struggle to effectively incentivize participation and engagement from community members with ERC-20 tokens. By incentivizing community participation with fungible token rewards, the DAO financializes engagement and reduces participation to labor. Not every community member, however, is or should be a DAO contributor. Guiding community members in how they can participate is challenging because it is highly manual for community managers and very confusing for DAO joiners. There is a lack of clear paths for deeper engagement with the community.  Why is this relevant to Optimism  We are building on Optimism-first. We will be introducing Optimism on-ramps into our product and are designing a Web2-user-friendly interface that will onboard more users into the Optimism ecosystem. In addition to onboarding Web2 users, we are also working with many DAOs who are not yet on Optimism and could become long-term Optimism users. We have noticed that Optimism is skewing toward collaborating with DeFi projects, but we believe that Web3 infrastructure needs to stretch a lot further than financial infrastructure. Basic coordination primitives like badges are necessary for us to be able to work together to build things in Web3. We think working with Otterspace is an opportunity for Optimism to diversify the partnership network and publicly acknowledge the importance of human/social infrastructure alongside financial infrastructure.   What’s our ask We would like the Optimism community to engage with us to explore collaboration opportunities. We have a few ideas about how a collaboration could look and would like to hear suggestions from the Optimism team. We believe we can help construct a long-term solution for Optimism’s governance SBTs. There are a lot of specific problems to be solved around revocation, wallet reassignment, community recovery, token standard design and permissionless attestation. By collaborating, we can avoid duplicate work and come up with better solutions. We think that this ask could be met through:  Community input/feedback based on this proposal A call to exchange ideas   Important links Technical documentation: Notion – The all-in-one workspace for your notes, tasks, wikis, and databases. Twitter: @otterspace_xyz Mirror: https://otterspace.mirror.xyz ",
                    "links": [
                        "https://otterspace.mirror.xyz",
                        "https://gov.optimism.io/t/temp-check-give-incentives-to-solve-voters-apathy/3926",
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-otterspace/3445",
                        "https://gov.optimism.io/t/review-gf-phase-1-proposal-otterspace/3445/5",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/5"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.72663643827437
                },
                {
                    "author_link": "https://gov.optimism.io/u/ottrnaut",
                    "index": "2",
                    "likes": "1",
                    "time": "05/08/2022-10:37:31",
                    "content": "From a UI perspective, it would be interesting to discuss/explore patterns to best educate and encourage new users to switch to L2s like Optimism. Connect with me here or on twitter to discuss: @austinkeeble ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.727272727272727
                },
                {
                    "author_link": "https://gov.optimism.io/u/0xbendo",
                    "index": "3",
                    "likes": "2",
                    "time": "18/08/2022-14:54:54",
                    "content": "Based on feedback from @bobby and the broader community, we’re elaborating on some further aspects on this proposal below. Intention of the proposal The impulse of this proposal is to start engaging in a preliminary discussion on how Otterspace and Optimism could collaborate, based on strong mission and values alignment and the fact that we have an Optimism-first deployment. We believe this is only the starting point and we’d like to extend this into a funding proposal during Phase 6 of your governance cycle. Concrete ideas for initial collaboration We have three concrete ideas for collaboration, which are not mutually exclusive:  Collaborate with the Optimism Citizen House on building out the Soulbound membership model. We have been working on a protocol, token standard and application, all related to the implementation of Soulbound tokens for similar DAO use cases. Across these multiple facets, we realized that there are many technical edge cases (such as SBT revocation, wallet reassignment, community recovery in case of lost keys, token standard design and permissionless attestation) that are not trivial. We could help by both providing the technical backbone (protocol and/or application) and by helping with the conceptual design for the Citizen House. More concretely, Badges could help delineate the membership within the Citizen House and facilitate the process through which retroactive public goods funding is distributed. We believe that the newly founded Governance Committees could make use of an internal coordination mechanism that utilizes Otterspace Badges. Badges could be used within a Snapshot strategy to achieve consensus on how to vote on proposals within committees. Additionally, the Badges could delineate membership within the Governance Committee, i.e. Badges for the DeFi Committee. As an Optimism-first protocol, we want to partner with you to spur further growth of the Optimism ecosystem, especially within the DAOs, a segment that so far has not received much funding, compared to DeFi. This has two aspects: a) We are working with many DAOs who are not yet on Optimism and could become long-term Optimism enablers. b) Through our easy-to-use interface (familiar to Web2 users), we are introducing Optimism on-ramps into our product which will onboard more users into the broader ecosystem.  Where we are today Currently, we are in our private Beta with 16 DAO partners, including Radicle, Token Engineering Commons and Syndicate DAO, amongst others. Our product is deployed on Optimism Mainnet. Today, Badge collections can be designed and manually assigned by a DAO admin to members in the DAO through our easy-to-use user interface. Badges can have expiration dates and artwork  specific to the DAOs use case. With the Badges, we enable downstream permissions within Snapshot (used for governance) and Guild (used for Badge gating). Badges are also backward compatible with ERC721, allowing them to be displayed in common wallets, like Metamask. You can check out a current version of our product in the following short deck: https://pitch.com/public/feb16082-b252-4b08-a119-bd341b77bc6a/f26c8bf1-afbc-40bc-9341-53a299b36652 What’s next Soon badges can be earned by completing missions (e.g. meeting on and off chain requirements), DAOs can view their membership base and contributors can show off their DAO membership with their own profiles. ",
                    "links": [
                        "https://pitch.com/public/feb16082-b252-4b08-a119-bd341b77bc6a/f26c8bf1-afbc-40bc-9341-53a299b36652"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.460858585858586
                },
                {
                    "author_link": "https://gov.optimism.io/u/bobby",
                    "index": "4",
                    "likes": "3",
                    "time": "29/08/2022-19:46:15",
                    "content": "Hello Otterspace team! Thanks for starting this discussion. I’m a big fan of what you’re building and it seems like there’s lots of space to collab. Appreciate the three suggestions.   Would be happy to chat about how Otterspace could help with citizenship implementation. We have some specific design constraints but I’d love to hear how you’re approaching the edge cases you mention. If you shoot me an email at bobby@optimism.io we can find some time to chat.   Distributing some form of reputation for committee participation is a nice idea. I’d suggest you start a discussion around this in the gov-general or gov-temp-check channels in Discord to see if committee members themselves have any helpful feedback.   We’d love your help with growth, particularly around DAO tooling and onboarding. I’m interested to hear more about your on-ramps to OP. If there’s anything else specific here you have in mind, feel free to include in your email note and I can route you to the right folks at Labs or Foundation.   Keep up the good work! Excited to see where this goes  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.603641456582633
                },
                {
                    "author_link": "https://gov.optimism.io/u/0xbendo",
                    "index": "5",
                    "likes": "1",
                    "time": "31/08/2022-12:44:22",
                    "content": "Hey @bobby, Thanks for your response! Will follow up via email and post in the gov-general/gov-temp-check channel for feedback on the Committee Badges. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/jrocki.eth",
                    "index": "6",
                    "likes": "2",
                    "time": "07/09/2022-21:46:28",
                    "content": "This collaboration / exploration makes me bullish governance. Love it. Thank you all ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "7",
                    "likes": "0",
                    "time": "13/09/2022-19:24:26",
                    "content": "Phase 1 proposal in Proposal Discussion ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "188"
}