{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/cycle-10-final-grants-roundup/5418",
            "title": "Cycle 10 Final Grants Roundup ",
            "index": 5418,
            "category": [
                "\\xf0\\x9f\\x8f\\x9b Governance",
                "Grants"
            ],
            "tags": [
                "cycle-10"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/GrantsOps",
                    "index": "1",
                    "likes": "33",
                    "time": "04/03/2023-02:22:27",
                    "content": "Cycle 10 has concluded and the Grants Council is thrilled to announce that it has selected finalists. This Cycle represented a step-change in formalizing a community-run process. The reviewers worked very hard to run new operating procedures aimed at filtering for sufficiency, then threshold quality, then consensus. The applicants put in considerable effort and the quality of the final proposals shows the value of applying rigor to the grants process. Our goal is to continue to make Optimism’s grants program the best-in-class. The Council has learned a number of lessons that it will seek to put to good use in Cycle 11. The Cycle 11 form, milestone assessments guidance, and drafting workshops are all aimed at helping proposers present their best proposals. Now for the Finalists: Builders   Atomic Links: building infrastructure to connect web2 and web3 applications (50k OP)   Attestation Station Interface: no code solution for builders to interact with Attestation Station (20k OP)   Clique: identity oracles that bring web2 user behavior and identity data on-chain (25k OP)   DeFunds: automated DeFi strategies (2,500 OP)   Edge Wallet: self custody platform where key management and DeFi are simplified (50k OP)   ENS Wildcard Domains: tools that enable NFT communities on Optimism to acquire ENS sub-domains at zero cost (45k OP)   Front-running protection: a feasibility study for front-running and censorship protection via a shielded/encrypted mempool (30k OP)   Karma: a delegate registry for DAOs built on Optimism (50k OP)   Metronomo: open-source Web3-native programmatic ad network (22.5k OP)   rotki: opensource portfolio tracking and accounting tool that supports Optimism completely (40k OP)   Growth Experiments   Crypto LDFM: educational video series on how Optimism works and the basics of Optimism (10k OP)   KyberSwap: Dex aggregator and liquidity platform on Optimism that aims to provide the best rates (250k OP)   Mux: DeFi protocol suite that will offer optimized trading cost, deep liquidity, a wide range of leverage options and diverse market options for trader (250k OP)   Nested: non-custodial DeFi trading platform that enables users to create NFT representations of their portfolios and earn royalties (250k OP)   OPWeave: blog and podcast focused on the Optimism community (8,633 OP)   Parcel: marketplace that enables users to buy and sell in-game items including rare collectibles, land, and other NFTs (150k OP)   Premia: decentralized options protocol that will provide educational content through Learn to Earn program (235k OP)   Rubicon: order book protocol that implements fully on-chain order books and a matching engine for peer-to-peer trading of ERC-20 tokens (200k OP)   Sonne Finance: an EVM-compatible lending/borrowing protocol that launched on Optimism that Finance provides p2p lending solutions that are fully decentralized, transparent, and non-custodial (250k OP)   Thales: protocol that allows for creation and participation in novel on-chain automated parimutuel markets (250k OP)   The Optimistic Series: newsletter, podcast and research database focused on Optimism DeFi content (30k OP)   Via Protocol: cross-chain liquidity aggregator that offers a suite of tools, including Router and an SDK (250k OP)   The finalists can expect outreach from the Foundation to handle KYC, distribution of the grants, and other details in the near term. As always, you can reach out to the Council with any questions at optimismgrantsops@gmail.com. Final milestones will be added as a comment to this post on March 4. We look forward to working with the community to make Cycle 11 a great experience that yields great outcomes. As a reminder, proposals for Cycle 11 are due on March 8 at 19:00 GMT. You can learn more about the application process on the Council’s landing page. Note that the conferral of a grant is not an explicit or implicit promotion or endorsement of the projects or their underlying products but rather an acknowledgement that the projects’ applications were deemed most suited to receive a grant given the parameters applied by the mandate of Season 3 governance. ",
                    "links": [
                        "https://gov.optimism.io/t/milestone-assessment/5314",
                        "https://twitter.com/OptimismGrants/status/1630721836966092802?s=20",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-atomic-links/5029",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-attestation-station-interface/4827",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-clique/4980",
                        "https://gov.optimism.io/t/gf-phase-1-proposal-defunds-co-decentralized-finance/4912",
                        "https://gov.optimism.io/t/gf-phase-1-proposal-edge-wallet-integration-of-optimism-velodrome-lp-staking-swaps-tarot-lp-staking/3994",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-ens-wildcard-domains/5044",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-front-running-protection-via-shielded-mempool-for-op-stack-using-threshold-encryption/5036",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-karma-delegate-registry/4982",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-metronomo/5021",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-rotki/5025",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-crypto-lfdm/5030",
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-kyberswap/4068",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-mux-protocol/5037",
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-nested/4965",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-opweave-coverage-of-everything-optimism/4990",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-parcel/5032",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-premia/5034",
                        "https://gov.optimism.io/t/gf-phase-1-proposal-rubicon/5068",
                        "https://gov.optimism.io/t/draft-2-gf-phase-1-proposal-sonne-finance/4779",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-thales/4984",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-the-optimistic-series/4911",
                        "https://gov.optimism.io/t/gf-phase-1-proposal-via-protocol/4917",
                        "https://www.notion.so/Optimism-Grants-Council-090bb648d1854136b9630c608da7a8bc",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/37"
                    ],
                    "GPT-summary": "The post announces the finalists of Cycle 10 of Optimism's grants program and provides a brief description of each proposal. The post also mentions the lessons learned from Cycle 10 and the upcoming Cycle 11. The post does not explicitly ask for feedback or collaboration, but it does provide contact information for questions.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Smart contract updates",
                        "None",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 6.18188832772166
                },
                {
                    "author_link": "https://gov.optimism.io/u/edgeop",
                    "index": "2",
                    "likes": "3",
                    "time": "04/03/2023-03:01:34",
                    "content": "Thank you for the update! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/evention",
                    "index": "3",
                    "likes": "4",
                    "time": "04/03/2023-14:20:39",
                    "content": "Nice round. As I think ,Nested got the goal. can’t wait for cycle 11. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Whodoubts",
                    "index": "4",
                    "likes": "3",
                    "time": "04/03/2023-15:16:25",
                    "content": "That’s very good!    ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/greenwebapp",
                    "index": "7",
                    "likes": "4",
                    "time": "04/03/2023-15:55:37",
                    "content": "Thank you for update. I waiting for OP grow up 100x. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/GrantsOps",
                    "index": "8",
                    "likes": "7",
                    "time": "05/03/2023-04:21:26",
                    "content": "The Milestones tracker will be located at this address and monitored by the Council on an ongoing basis. While some of the projects are final, a number of projects have been given additional time to verify final milestones on account of time zone variability and ethDenver. This will be updated in final form the week of 3/6 before the Foundation makes any distributions.   docs.google.com    Cycle 10 Milestones (Draft) Builders  Builders Cycle 10 Milestones (Draft 3/4 - awaiting finalized milestones from Front-Running Protection for finalization) Project,Milestone,Milestone Type,Source of Truth,Deliver by Date Atomic Links,add basic web2 integrations: 1) External...      ",
                    "links": [
                        "https://docs.google.com/spreadsheets/d/16gxZSD0aErog652Ije4F8_uSR6QsOQ9oySg-hvGP0JU/edit#gid=0",
                        "https://docs.google.com/spreadsheets/d/16gxZSD0aErog652Ije4F8_uSR6QsOQ9oySg-hvGP0JU/edit#gid=0"
                    ],
                    "GPT-discussion-categories": [
                        "None"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "9",
                    "likes": "2",
                    "time": "05/03/2023-22:15:11",
                    "content": "Hey @choooose , could you please extend your thoughts, what damage you are referring to ? is it something related to Rubicon platform, if yes, then lets move the discussion to their gov forum ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/gowthambujee",
                    "index": "10",
                    "likes": "3",
                    "time": "05/03/2023-22:27:44",
                    "content": "thank you for all updates ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/mrpizza",
                    "index": "11",
                    "likes": "3",
                    "time": "05/03/2023-22:55:46",
                    "content": "Excellent projects for the further development of the Optimism ecosystem!   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/lionchenou",
                    "index": "12",
                    "likes": "1",
                    "time": "06/03/2023-05:17:58",
                    "content": "I have staked Rubicon for 10 days without any reward ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/forrest",
                    "index": "13",
                    "likes": "2",
                    "time": "06/03/2023-16:17:30",
                    "content": "Hi @lionchenou, two weeks ago the V1 Pools started winding down and went into Withdraw-Only mode so they will not receive any rewards. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.222222222222222
                },
                {
                    "author_link": "https://gov.optimism.io/u/bobby",
                    "index": "14",
                    "likes": "4",
                    "time": "06/03/2023-16:37:16",
                    "content": "Nice job grants council – excellent transparency and process over the past few weeks. Excited to see what these projects do!  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.61875
                },
                {
                    "author_link": "https://gov.optimism.io/u/Oxytocin",
                    "index": "15",
                    "likes": "4",
                    "time": "06/03/2023-19:52:42",
                    "content": "Congratulations to all the grants finalists! I’m very excited to see how these grants will help the ecosystem system grow. Also nice to see the first cycle where applications were fully handled by the council, it was very interesting seeing the discussions happening over at the discord as well. The  final project review could not be any clearer as well. Something that could be worth exploring at the end of the season is seeing in broad categories where the grants ended up being allocated, as right now with the current list it’s only possible to easily see the distributed amount, not the goals of each grantee. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.278769841269841
                },
                {
                    "author_link": "https://gov.optimism.io/u/Dreezy",
                    "index": "16",
                    "likes": "1",
                    "time": "09/03/2023-16:35:37",
                    "content": "This is a great action by the team, it’ll foster growth within the ecosystem! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.3125
                }
            ]
        }
    ],
    "group_index": "557"
}