{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/another-case-of-self-delegation-of-op-tokens-received-in-grants/3372",
            "title": "Another case of self-delegation of OP tokens received in grants ",
            "index": 3372,
            "category": [
                "\\xf0\\x9f\\x8f\\x9b Governance",
                "Grants"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/Defi_LATAM_axlvaz",
                    "index": "1",
                    "likes": "18",
                    "time": "26/08/2022-07:33:40",
                    "content": "Antecedents One debate that has been ongoing since the beginning of this governance is the use of tokens allocated in project grants to increase the voting power of their delegates. The first to speak on this topic was @OPUser  when @tongnk, of Perpetual Protocol, self-delegated the 9M OP tokens he had received in Phase 1. You can read the full thread here, “I want to discuss the project driving its proxy power with the governance fund.” For the sake of governance and after intense debate, Perpetual Protocol decided to revoke the delegation. As a result of this situation and at the beginning of the reflection period, the Optimism Foundation proposed in the new update of the “Proposal Template V2” that reads as follows:  “The expectation is that token grants will not be self-delegated for use in governance. The primary purpose of these token grants is to incentivize sustainable usage and growth of the Optimism ecosystem. If you plan to increase your voting power by delegating a portion or all of your grant tokens to your own protocol, or a closely affiliated party, this should be made clear in your grant proposal along with your reasoning.”  However, despite these measures, this week we have again had a case of self-delegation of Synthetix OP tokens by delegating tokens to @mastermojo of the Synthetix Ambassador Council. TD,LR While this is a case of self-delegation of tokens received in grant, I want to make it clear that this fact does not currently pose a threat to governance, nor to the votes that are in progress. Since the delegation was revoked prior to the snapshot that determines the voting power of each delegate at the beginning of the voting period (as made explicit in the Operating Manual). This is a wake-up call for all of us to be attentive to this type of movements and look for better tools to mitigate this type of actions or at least detect them quickly and thus avoid a possible attack on this governance by a malicious agent. Chronology of events On 08/24 on the Sintetix discord channel @MattL launched a campaign for community members to delegate OP tokens, in the same campaign he links to a mirrored guide, written by @mastermojo where he asks them to delegate to the OPsnxambassadors.eth address.  1302×694 210 KB  On the same day, Synthetix address, which received 9M OP tokens for the Phase 1 awards, delegated approximately 8.9M OP tokens to OPsnambassadors.eth address, temporarily giving them 27.76% voting power (prior to the delegation they had 0.56% voting power).  982×787 103 KB  The delegation of the 8.9M tokens occurred in block 20428907 on 08/24, in block 20550500 on 08/25 the delegation was revoked. The snapshots prior to the committee vote occurred between blocks 20558523 and 20558560. This means that the self-delegation of 8.9M was not included in this vote.  The facts described above are in chronological order. I want to clarify that I am not against protocol delegates campaigning to receive votes, nor am I against self-delegation of tokens received via governance. I think self-delegation is fine as long as it is a transparent process or has been established in the protocol proposal. Summary Although in this particular case it did not affect the outcome of any vote, in the future a similar action could affect governance. I also believe that an explanation of the events by the Synthetix team would be good, so that we can learn from the mistakes and look for tools or protocols to minimize this kind of actions. Finally, although this thread has some personal reflections and appreciations I firmly believe that all these events will lead us to be a better government. As I said before I am not against self-delegation of OP tokens received by grant, in my opinion this action should be in a transparent way and be explicit in the protocol proposal in this governance. I would like to hear opinions and ideas to avoid this kind of situations, I also accept criticism if there was some kind of mistake in this thread. Note: As I was writing this thread I am alerted by Discord that @OPUser had already made this warning about this self-delegation, on 8/25 I think perhaps this caused them to revoke the delegation. Which leads me to ask if we delegates are not vigilant about these actions, what are the actions the OF should consider? How can we avoid this without keeping an eye on the Dune board? Should we have clearer rules? ",
                    "links": [
                        "https://gov.optimism.io/t/i-want-to-discuss-project-boosting-their-delegate-power-with-governance-fund/2961/11",
                        "https://gov.optimism.io/t/governance-update-3/3232",
                        "https://gov.optimism.io/t/grant-proposal-template/3233",
                        "https://gov.optimism.io/t/delegate-commitments/235/103",
                        "https://discord.gg/synthetix",
                        "https://optimistic.etherscan.io/address/0x406b607644c5d7bfda95963201e45a4c6ab1c159",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/8/8ade19261eca1e7d2db0cd9d65b5bb2ae816c0db.png",
                        "https://optimistic.etherscan.io/address/0x9644A6920bd0a1923C2C6C1DddF691b7a42e8A65",
                        "https://gov.optimism.io/t/gf-phase-0-proposal-synthetix/1381",
                        "https://optimistic.etherscan.io/address/0x406b607644c5d7bfda95963201e45a4c6ab1c159",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/0/03fe2d3170335fe4befd476fc64e35eeed37562a.png",
                        "https://optimistic.etherscan.io/tx/0x2683f6cfd4b30e754ce2e8726d0abedfaa4e35ecdf76f4d3bd904d001007946f",
                        "https://optimistic.etherscan.io/tx/0x2683f6cfd4b30e754ce2e8726d0abedfaa4e35ecdf76f4d3bd904d001007946f",
                        "https://optimistic.etherscan.io/tx/0x268c59e826624f8fa1df3d47e528cc4035ec28ed6b037c50f006e2ace053e54d",
                        "https://optimistic.etherscan.io/tx/0x268c59e826624f8fa1df3d47e528cc4035ec28ed6b037c50f006e2ace053e54d",
                        "https://optimistic.etherscan.io/tx/0x268c59e826624f8fa1df3d47e528cc4035ec28ed6b037c50f006e2ace053e54d",
                        "https://gov.optimism.io/t/grant-proposal-template/3233/13",
                        "https://dune.com/optimismfnd/optimism-op-token-house",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/4",
                        "https://gov.optimism.io/t/draft-proposal-protocol-delegation-program/3946/45",
                        "https://gov.optimism.io/t/voting-power-grant-proposal/4197",
                        "https://gov.optimism.io/t/lets-settle-once-and-for-all-the-question-of-grantees-self-delegating/3577",
                        "https://gov.optimism.io/t/grant-proposal-template/3233/15"
                    ],
                    "GPT-summary": "The post discusses the issue of self-delegation of tokens received in grants and its potential impact on governance. The author provides a chronology of events related to a recent case of self-delegation of Synthetix OP tokens and highlights the need for better tools to detect and mitigate such actions. The author also suggests that self-delegation should be transparent and explicitly stated in the protocol proposal. The post invites opinions and ideas to avoid such situations in the future.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Law and regulations",
                        "Privacy, Security and risk management",
                        "Community and engagement"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.838247338247338
                },
                {
                    "author_link": "https://gov.optimism.io/u/MattL",
                    "index": "2",
                    "likes": "8",
                    "time": "26/08/2022-15:31:08",
                    "content": "Hey there, I’m happy this thread has been started so things can be discussed. I’d like to provide some clarity from the side of the SNX Ambassadors and the delegation as a whole. Let’s get a few things out of the way from the start. One individual does not run the SNX Ambassadors; it is a DAO elected by token holders at Synthetix to help adequately represent the interests of Synthetix and its ecosystem in the overall DeFi landscape. When the delegation occurred, it was not to one member. It was provided to the Ambassador DAO. The members of the ambassador dao are myself, Mojo, and Millie (edit: added members of ambassador dao) I’m not entirely up to speed with Perpetual Protocol and their self-delegation, but I am pretty sure they did not delegate their Phase 0 distribution in the same fashion (to a fully independent DAO with a clear mandate) But that’s not the point; let’s talk a bit about the current governance power held by the SNX Ambassadors. It does not have .56% of governance power. It holds more like ~ 6%. The only issue with the below delegate account is that it is inaccessible for voting. Synthetix Ambassadors had provided the same address / multisig that is used on L1 for Optimism. While it is still under the control of some signers, gnosis/ other multisig issues make it impossible for us to vote.  image2948×78 27 KB  While the fault does not lie on Optimism governance, it may have created a situation where Synthetix Ambassadors would be unable to support the Synthetix community’s interests properly. Synthetix is the top non-lending protocol by TVL and has been on Optimism from the beginning of Optimism. It is a shame that the Synthetix Ambassadors cannot utilize their original voting power. Lets get into the “Why” – I think there’s a bit more to explore there. The Synthetix Treasury Council received 9m in Optimism as part of the Phase 0 distribution. There had been no precedent at the time that self-delegating was not respected in the eyes of governance. If you look at the initial OP distribution that myself, Millie, and Mojo wrote, it makes clear that there was intent (at the time) for this Optimism to be delegated to the Ambassadors. Original Date of internal (to Synthetix governance) SIP discussing OP distribution  May 18th, 2022. See below: https://sips.synthetix.io/sips/sip-242/  image2948×518 147 KB   image1920×567 90.7 KB  So yes – this was something Synthetix Ambassadors had initially pushed for under its internal proposal and was approved by the Spartan Council at Synthetix. Furthermore, these tokens were directed to be held by the Synthetix Treasury council, as they were deemed the best fit to handle distributions for incentives and so on. It was not included on the OP 0 Distribution proposal on the Optimism forums, and I am pretty sure it was just simply missed. I think this stems from self delegations not being red flagged from others’ actions (as this proposal was before then), so it was not considered an essential part of the proposal. Once this campaign had been launched, I reached out to the Treasury Council and informed them we were moving our OP over to a new address (the one you mention, OPSNXAmbassadors.eth) because we have been unable to vote on our current one, and would like to make sure it is possible to vote going forward. I had also asked them to delegate this Optimism to the new address because that was the terms of our initial SIP proposal. They had done so, and that was that. After some time, OP users and Optimism folks had reached out asking about the delegation, and once it was clear that precedent was broken, it was removed to ensure no issues with upcoming votes. I still personally am of the view that this delegation did not have the potential to cause any harm to Optimism governance. Furthermore, I still support self-delegation to an independent DAO. Especially in the case of Synthetix, where this was a piece of the internal SIP, and delegation was included as one of the things it would be doing. It is unfair to look at Synthetixs Phase 0 distribution under the lens of 3-4 months of additional context as the original proposal was created & passed in May. As said earlier, Synthetix was the first protocol on Optimism, and it has used its reach across Twitter/Discord/ and other platforms to promote Optimism in every way possible. Furthermore, Synthetix Ambassadors hold weekly (sometimes twice a week) Twitter Space calls to promote protocols on Optimism. Some of these protocols aren’t even integrated with Synthetix, but they are still promoted to promote Optimism projects with the marketing reach of Synthetix. Synthetix & SNX Ambassadors have held these calls for a long time and will continue to do so. I’d like to stress one more time, that the delegation has since been removed out of respect for the token house, even though we do not believe the situation is fairly resolved, given that the Synthetix community will remain under-represented. The Synthetix Ambassadors will continue to play a prominent role in Optimism governance and will continue to support itself, its large ecosystem (Lyra, Kwenta, dHEDGE, Thales, Polynomial, Aelin, and so on), and Optimism as a whole. ",
                    "links": [
                        "https://sips.synthetix.io/sips/sip-242/",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/7/7065e50d58d544afbb8deecde127ffe9ec0c4aee.jpeg",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/4/438b93fbad4484dfd2cae4136809f735b0f8c0b5.jpeg"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.582958036587069
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "3",
                    "likes": "5",
                    "time": "26/08/2022-16:30:18",
                    "content": "Hi Matt, Thank you taking time and writing your thoughts on this matter. I think we all agree that projects should have a voice in the Gov especially the OP OG projects but I want to hear your or anyone else’s opinion on doing a self-delegation of whopping 27% of voting power. How is this sustainable ? My request to you would be:-   Consider delegating equal amount of token, before each season, delegated to your existing SNX ambassador and participate until issue with snapshot is resolved.   Why not delegate few % rather than total amount, follow the similar approach of Phase 0 token distribution. Project getting 9M has a bigger impact so they can use some token for self-delegate. One example, you got 9M → allowed to use token for self-delegation that can put you near to top 5, 3M-> top 20 and so on… Benefit would be that it will apply to all of Phase 0 project. For upcoming proposals we dont need to worry about as its covered in the template.   Agree to open communication, mention that you will share your reasoning for reach vote. This will help us avoid possible conflict   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.409090909090909
                },
                {
                    "author_link": "https://gov.optimism.io/u/millie",
                    "index": "4",
                    "likes": "5",
                    "time": "26/08/2022-17:15:05",
                    "content": " Why not delegate few % rather than total amount  The amount which is delegated can’t be specified, once an address delegates their OP all of the OP in that wallets gets delegated automatically. Delegating a specific amount would require some changes to how the treasury custody’s its assets and transferring a portion of OP to a new address.  I want to hear your or anyone else’s opinion on doing a self-delegation of whopping 27% of voting power. How is this sustainable ?  My only answer is that not many protocols will ever be eligible for such large rewards and likely none will ever hold that much. So this is a situation isolated to Synthetix and in a token governance system, I personally don’t think it’s surprising that larger protocols, with long term alignment, would participate in governance with sizeable voting power. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.26808905380334
                },
                {
                    "author_link": "https://gov.optimism.io/u/Defi_LATAM_axlvaz",
                    "index": "5",
                    "likes": "2",
                    "time": "26/08/2022-17:26:31",
                    "content": "Hi @MattL! Thanks for your reply, I think this answer is clear and transparent. It also clarifies some drawbacks that SNX ambassadors had, with voting, that I was unaware of. I have a point to consult: In the SIP it clarifies that only 2M OP tokens will be used for delegation, in this incident they delegated the whole tokens. can you give some explanation?  821×350 17.8 KB                                        ______________  Although we are in very early stages of gov optimism and communication and the rules are not very clear (I have raised this point several times both on the forum and in discord). The clarification of no self-delegation is written in the latest update to the grant proposal template, but again it is not very clear. The reason for raising this point is because I now understand that there are 3 delegates actively participating (correct me if I am wrong) and even @Millie made comments when the perpetual occurred. I understand that this point has escaped you as it is not possible to 100% follow everything that happens in gov and I understand that you also actively participate in other govs. This indicates that communication in gov is not entirely clear and always lends itself to confusion. I think this is a point where we should work on finding solutions together with the OF from whom we receive the guidelines. Finally, I would like to congratulate you for the communication work you are doing to make more users aware of the OP ecosystem. From DefiLatam and Optimism en Español we also make spaces on Twitter, calls to the community at least 1 or 2 times a week for the Spanish-speaking audience, we also translate all articles and news into Spanish to reach more people. In the last Twitter space we talked about the Synthtix incentive program at Optimism, we are big fans of the protocol. ",
                    "links": [
                        "https://gov.optimism.io/t/grant-proposal-template/3233",
                        "https://gov.optimism.io/t/i-want-to-discuss-project-boosting-their-delegate-power-with-governance-fund/2961/51"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.221127136752138
                },
                {
                    "author_link": "https://gov.optimism.io/u/Jadmat.Eth-DefiLatam",
                    "index": "6",
                    "likes": "1",
                    "time": "26/08/2022-20:44:22",
                    "content": "Hey; In the first instance, it is important to separate the Dao/multisig function from the purpose of the $Op received;     MattL:  Una persona no dirige SNX Ambassadors; es un DAO elegido por los poseedores de tokens en Synthetix para ayudar a representar adecuadamente los intereses de Synthetix y su ecosistema en el panorama general de DeFi.   the way in which Synthetix manages its interests has made it one of the most important protocols in the ecosystem, and has kept it that way since the beginning of defi; but this should not be confused with the purpose for which they received those tokens:    GF:Phase 0 Proposal] Synthetix    2M $OP para subvenciones 3M $OP para liquidez en USD e incentivos puente 4M $OP para incentivar un grupo SNX/sUSD en optimismo    anyway 1- I love Synthetix 2- what you say about the use of power voting is really negative 3- I am not at all against assigning tokens to delegates ALWAYS the proposal describes it that way ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.875
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "7",
                    "likes": "2",
                    "time": "26/08/2022-20:45:05",
                    "content": "    millie:  I personally don’t think it’s surprising that larger protocols, with long term alignment, would participate in governance with sizeable voting power.   I think we disagree on “sizeable”, you can also contribute and participate if you are in top 5, 27% in my opinion is domination. Such sizeable amount is only acceptable when its coming from community. I find this practice of self-delegation with such a huge amount, night before the snapshot, wrong, I used this platform to bring more clarity on the process and suggested a common ground. As an user and as a delegate, I believe that was my role and responsibility. On the other side, I feel that this only bothers me, I havent seen anyone else talking about this with exception of defiltam team, I also assume that before doing this self-delegation you must had a discussion with your DAO team and only after finding it justifiable you decided to do so and here I find this against dao gov and see this as potential hijacking, with such power you can flip any votes, only your support would be enough to change the tide which will lead to polarity in gov, no one will take smaller delegate seriously as long as they have your support. This, in my opinion, is not sustainable for a working and functional gov. What if we abstain from all possible conflict :- how many votes you will abstain, complete DeFi ecosystem revolves around SNX, its one the major pillar of our ecosystem( Lyra, Kwenta, dHEDGE, Thales, Polynomial, Aelin, and so on) and not just in term of community but also in term of on-chain transaction, fee generation and innovation. Apart from what I have said, I have nothing else productive to add to this discussion so I will refrain myself from participating in this conversation. What’s the point of repeating the same thing we did on Perp thread without making any progress, its not worth anyone time, we should rather focus on other open topic. With all being said, I am glad that you and your team is taking my last comment as feedback and replying as such, I was afraid that some might think I am some personal grudge against SNX and i am attacking them. I will come back if I have any fruitful suggestion to add. Looking forward towards our active participation in Season 2. happy weekend. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.274211711711711
                },
                {
                    "author_link": "https://gov.optimism.io/u/MattL",
                    "index": "8",
                    "likes": "3",
                    "time": "27/08/2022-18:06:05",
                    "content": "Hey there! I think the initial thought (yet again, 3 months ago as of now) was that the 7m would’ve been distributed at a quicker timeline and the 2m would be around for a longer period. Yet again, I’m more or less speculating here because while the Ambassadors prepared the proposal, the distributions were left in the hands of the Synthetix Treasury Council to ensure the OP was used wisely. With that said, Millie answers this question in the reply above yours where he says:  “The amount which is delegated can’t be specified, once an address delegates their OP all of the OP in that wallets gets delegated automatically. Delegating a specific amount would require some changes to how the treasury custody’s its assets and transferring a portion of OP to a new address.”  To your point regarding missing the drama regarding Perpetual Protocol and its self delegation – I’ll admit that while I had been discussing these points with Millie and others privately, I hadn’t been super closely following it on the OP forum. I was aware of this once the delegation was requested from the TC, but I had thought Synthetix Ambassadors were in a very different situation compared to Perp that warranted the delegation. I still believe that delegation isn’t a problem, and does not harm overall Optimism governance. I think this does bring up an interesting point to explore, though, governance tokens are governance tokens – do some tokens have less governance power because they’ve been distributed for the purpose of protocol incentivization? Should governance tokens now have tiers and such, where some have voting power, and others are only for incentivization? Should protocols such as Synthetix, that have such a sizeable impact on Optimism be left with an underrepresented community simply b/c of a missed line in a proposal? Furthermore, would delegates/OP governance forum users have had this same feedback if only 2m was delegated - which would’ve followed the exact proposal from May (disregard concerns of custody of funds and such for a moment discussed earlier by millie and myself) Millie also brings up a LOT of good points in his comments about Perp Protocol where he discusses the following:    I want to discuss project boosting their delegate power with governance fund   The precedent being set here is that if a project were to make any changes to their token distribution plan from the governance fund, that they are violating OP governance and should be blacklisted in the token house. So what if a project decides to re-direct incentives within their allocation or re-design their token distribution plan in light of new data or a lack of effectiveness in the original incentives plan? Are we to say that anything not explicitly stated in the original proposal is deemed a mis-use of funds? After reading this thread I am unable to gauge the sentiment around those things. On a another note, with the sheer volume of proposals coming through, I don’t find it reasonable that the fate of all those proposals be decided by an extremely small portion of the voting supply and by the handful of delegates who are active here. Personally I have more faith in Perp Protocol’s delegate voting genuinely and beneficially for the token house than I do in some random delegates who “like Optimism” but have no real tangible incentive alignment with Optimism.   I too am left with more questions than answers after this situation, but I am happy that we were able to have an open conversation. As of right now, we are in the midst of regaining control of our original wallet with the help of Ben Jones. I’d like to note that I don’t hold a grudge against any user, (OPUser references this at some point in his last message). I highly respect the role of governance in DeFi, and I’m happy that we continue to iterate to ensure this process gets better and better and that Optimism grows. Furthermore, the SNX Ambassadors plan to launch a large campaign with the goal of gaining governance power to properly represent the SNX community. On a complete side note, I’d love to chat about Twitter Space opportunities and the like with you as well. I respect your goals of marketing Optimism and would love to help in any way possible. ",
                    "links": [
                        "https://gov.optimism.io/t/i-want-to-discuss-project-boosting-their-delegate-power-with-governance-fund/2961/51"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.764064027370479
                },
                {
                    "author_link": "https://gov.optimism.io/u/Defi_LATAM_axlvaz",
                    "index": "9",
                    "likes": "3",
                    "time": "27/08/2022-23:34:14",
                    "content": "    Defi_LATAM_axlvaz:  The facts described above are in chronological order. I want to clarify that I am not against protocol delegates campaigning to receive votes, nor am I against self-delegation of tokens received via governance. I think self-delegation is fine as long as it is a transparent process or has been established in the protocol proposal.   For our part and as we have discussed in other threads I am not against self-delegation, as long as it is clarified in the governance proposal of this forum and it is 100% transparent and in accordance with the governance bylaws. I believe that first and foremost we should always be transparent, this avoids misunderstandings and confusion. If one day I am not transparent or correct enough, I would like to be informed. Just as I question, I want to be questioned as well, so we will always be better. On the issue of self-delegation, I think there is still a lot to debate. And I think one of the ways to avoid/problems and confusion is to have clear rules. This point has already been raised several times by @OPUser , I think we should insist more on this topic. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.642361111111112
                },
                {
                    "author_link": "https://gov.optimism.io/u/Ovetta",
                    "index": "10",
                    "likes": "3",
                    "time": "28/08/2022-03:16:08",
                    "content": "Thank you Profile - Defi_LATAM_axlvaz - Optimism Collective for raising this issue. What about introducing a “cap” on voting weights.   Or a “tier” system  to represent the amount of OP used for voting? That may dissuade hoarding grant funds for the sole purpose of accumulating high voting weights. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.4
                },
                {
                    "author_link": "https://gov.optimism.io/u/MinimalGravitas",
                    "index": "11",
                    "likes": "5",
                    "time": "28/08/2022-13:46:15",
                    "content": "    MattL:  Should protocols such as Synthetix, that have such a sizeable impact on Optimism be left with an underrepresented community simply b/c of a missed line in a proposal? Furthermore, would delegates/OP governance forum users have had this same feedback if only 2m was delegated - which would’ve followed the exact proposal from May   This is a pretty good question. The fact is that with 9m OP you would have had more voting power than the top 5 delegates (whether including snxambassador or not), who combined represent about 36,000 people. As the phase 1 proposals had an average around 18m OP voting, you would have represented a full third of the voting power in any decision. The fact that you don’t really seem to recognize why centralization of governance in your favor would be detrimental to Optimism is somewhat concerning. The broader Synthetix ecosystem is one of the best things on Optimism at the moment, but surely you can see that effectively giving control of which other dApps get given OP to incentivize use to any single entity is in the best case going to lead to accusations of bias and stifling competition, which will delegitimize both yourselves and Optimism as a whole. In the worst case it could actually mean that you just gain a monopoly of control and use that to tilt the playing field in your favour, meaning rather than the best platforms being given the best chance to succeed, only those that benefit you financially will get boosted. I think the latter scenario is unlikely, but just the possibility of it would have a negative impact on the way Optimism is viewed by potential users. If on the other hand, you had just delegated 2m, this would only have positioned you as the number 2 delegate (behind Linda). This would have given you a huge say in future decisions, but would not compromise the credible neutrality of Optimism’s governance. It might still have been seen by some as a centralization risk, but you could minimize that by committing to abstain in decisions that affect Synthetix, it’s partners and it’s competition. Above all, with 2m delegated at least no one would be able to accuse you of attempting a complete takeover! I’m glad you quickly resolved the issue, just like Perpetual Protocol did, and hope that further discussions on this kind of thing can continue to clarify how we expect this kind of thing to shake out in the future. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.856708829365079
                },
                {
                    "author_link": "https://gov.optimism.io/u/MattL",
                    "index": "12",
                    "likes": "7",
                    "time": "28/08/2022-14:49:52",
                    "content": "All very great points Minimal! Just a few points to explore I’ve never said anything regarding the centralization governance, my point thus far was that I don’t think the self-delegation would’ve been detrimental to Optimism. I’d say this is a mixture of the unique nature of Synthetix being the first project on Optimism, and with that understanding that incentivizing more on Optimism is better than being the biggest fish in a small pond. Furthermore, we’ve continued to market and support projects on Optimism for the betterment of the ecosystem instead of just comarketing for Synthetixs benefit. Lastly, Synthetix and Synthetix Ambassadors do not have a history of selling any Optimism tokens, nor using them for unintended uses, or anything along those lines. Gating off incentives for just Synthetix, or using this governance power for only SNX Ecosystem projects or the like would’ve been an incredibly poor idea. It wouldn’t have been done, and I wouldn’t expect any delegate who obtains a large amount of voting power to do this as well. I do understand that trusting one protocol with 27% of governance power isn’t a good idea, especially as these tokens were obtained through grant proposals instead of purchasing Optimism outright. I will without a doubt, agree with you that 9m would’ve centralized control for the Synthetix Ambassadors; that’s not wrong – but would it have been okay to delegate 9m if there was an extra line in the Synthetix proposal saying that all of these tokens would’ve been delegated? I expect that to still be no, because of the centralization of power. We plan to discuss the delegation of those 2m tokens in the future and may move forward with that. We’ll without a doubt be very transparent about this in advance of it being done, to ensure a situation like this does not repeat itself. Furthermore, I am of the view that direct token voting (1 token, 1 vote) is an incredibly poor governance system. The model of representative governance + quadratic voting, which Synthetix utilizes is far superior and ensures all votes matter greatly and vote-getting candidates are empowered to follow what their voters want. This is not a criticism of this situation though, more just a personal view that direct token voting creates interesting situations. With all of this said, I’m happy that we were able to discuss this conversation, and that it was resolved quickly. I think we’ve probably chatted through most things related to it, so I’ll be signing off of this thread from here. Thanks folks! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.199659863945578
                }
            ]
        }
    ],
    "group_index": "225"
}