{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/suggesting-on-chain-activity-based-citizen-selection-for-later-citizen-house-phases/4350",
            "title": "Suggesting On-chain Activity-based Citizen Selection for Later Citizen House Phases ",
            "index": 4350,
            "category": [],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/robbie_philosophia",
                    "index": "1",
                    "likes": "4",
                    "time": "18/12/2022-06:25:13",
                    "content": "Author:  CryptoKachu(katsu.philosophia@gmail.com, @CryptoKachu ) Robbie OH(robbie@philosophiavc.com, @robbie_philosophia )  Currently, citizens of Citizen House are mostly selected based on manually selected citizens and recommendations from those citizens. However, as pointed out in other threads(([optimism gov forum url]t/lets-talk-about-identity-in-the-citizens-house/2170/24), we should prepare for much more scalable criteria for the future phases and we believe that optimism community will be in need of data-based citizen selection soon, which will be more objective. Concerning this issue, we would like to initiate a discussion on on-chain-based citizenship selection that can be adopted in later phases of Citizen House. Benefits of adopting on-chain data We pose the following benefits that can be acquired when we use on-chain data for citizen selection.  Citizens could be selected more scalably  On-chain proofs could bring more credibility to the selection process We could give more governance power to addresses who contribute more to Optimism community on on-chain  Our research direction on on-chain-based selection Previous threads([optimism gov forum url]/t/lets-talk-about-identity-in-the-citizens-house/2170/6) argued that the citizenship grant process will be vulnerable to Sybil attacks and we also believe that on-chain-based citizen selection would be more vulnerable to those attacks. To cope with Sybil attacks and possible threats on the grant procedure, we derived two cost functions that can be used to measure the robustness of the on-chain-based granting method: 1) the Nakamoto cost function and 2) the Gini cost function. The Nakamoto cost function measures the required cost for attackers to abuse the granting mechanism and attack the system. The Gini cost function measures how evenly distributed the citizenships are. Based on the above indices, we can propose and evaluate on-chain indicators like the LP amount each address provides on OP-USDC pool, or transaction count and the amount of gas fee each address paid on the Optimism network.  1098×756 49.1 KB  For example, based on the acquired cost value for the provided indicators, we could discuss the suitability of the indicator and how each parameter, like the number of citizens selected from that indicator, should be tuned. Of course, the abovementioned indicators are just example indicators that can be considered and we believe we should elaborate more on the selection of the indicators. Furthermore, we could harmonically use multiple indicators to make more robust criteria. Last but not least, we want to stress that we are not arguing that on-chain-based selection should replace the current selection process. Rather, we want to argue that on-chain-based selection could be adopted in conjunction with the current mechanism to complement each other. If you are interested and share your opinions on our approach, we will provide our research results in the next proposal based on your feedback (with raw data and analysis code). ",
                    "links": [
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/24"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.685897435897436
                },
                {
                    "author_link": "https://gov.optimism.io/u/robbie_philosophia",
                    "index": "2",
                    "likes": "0",
                    "time": "23/12/2022-02:08:28",
                    "content": "Any feedback is welcome! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/MinimalGravitas",
                    "index": "3",
                    "likes": "3",
                    "time": "23/12/2022-09:01:13",
                    "content": "I’d be pretty hesitant to introduce criteria based on the value of assets on chain or in LPs or whatever, just because I don’t think we want barriers to entry that favour people who just happen to be more wealthy/come from a richer country. In my opinion if we want to scale past the individually assigned memberships and web of trust type model then maybe the way to go is setting a minimum ‘score’ on the Gitcoin Passport, which is an aggregate of several different decentralized ID systems like BrightID, Proof of Humanity etc. It would be both harder to game that, and would be equally restrictive on membership regardless of your worth. That said, there might also be some onchain metrics that can contribute, I just want to be certain that they aren’t going to be tests that make it easier for me to cheat than for someone with tighter budgets. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.233766233766234
                },
                {
                    "author_link": "https://gov.optimism.io/u/CryptoKachu",
                    "index": "4",
                    "likes": "0",
                    "time": "23/12/2022-14:18:20",
                    "content": "Thank you for your opinion. Basically, we agreed with your overall concern. However, to make it clear, as we have mentioned in the above, we are not suggesting the above-mentioned indices as a criteria for selecting citizen. Rather, we want to emphasize our approach that ‘some’ on-chain indices could be combined with other criteria when selecting citizens. Here, the important point lies in providing adequate cost function to evaluate probable index candidates for selecting citizens. With regard to your concerns, we believe adequate evaluation metrics could be adopted to avoid situation where only rich users can be citizens. Currently, taking Gini Coefficient into account during the evaluation process would be a possible method. Lastly, we want to make it clear that we are suggesting on-chain metrics as a indices that would work harmonically with previously suggested metrics (as well as those mentioned by you) where other criteria would complement some vulnerable points you have mentioned. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.2265625
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "5",
                    "likes": "2",
                    "time": "23/12/2022-23:31:54",
                    "content": "I think AtestationStation will be the House Citizen’s main filter in the future. We need about 6 months of data to see how’s working and how it can be attacked. If we are including LPs I suggest a time frame filter. It’s not the same as an address lping for 6 months than just a few minutes. But I agree with Minimal that any wealth filter is bad. Good to see a discussion about it though. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.904761904761904
                },
                {
                    "author_link": "https://gov.optimism.io/u/CryptoKachu",
                    "index": "6",
                    "likes": "0",
                    "time": "24/12/2022-00:16:29",
                    "content": "Agreed. If we include LP as an indicator, time frame is needed to avoid some sort of flash-like attacks on the selection. That’s why in our dune query, we set a parameter to take care of the amount of time each address LPed. link About your mention on wealth filter, we partially agree. Fundamentally, we also believe on-chain metrics should not work as a wealth filter that wipes out people from underdeveloped countries. However, we also think of some sort of measurements that count the costs each address spent to contribute/use Optimism. Otherwise, citizen house would be prone to be attacked by sybil attacks. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/CryptoKachu",
                    "index": "7",
                    "likes": "3",
                    "time": "24/12/2022-00:24:37",
                    "content": "Currently, Citizen House only selects citizen-like souls only by recommendations from pre-selected addresses. In my understanding, Optimism community also knows that this is not a scalable solution and there is a risk that only insiders are included in governance. However, they started Citizen House with this mechanism as this is a safe measure that leverages off-line relations to avoid sybil-attack like vulnerabilities. I think it is a perfect timing to discuss mechanisms for criteria used in AttestationStation. Here, finding an optimal point between selectiveness and accessibility of citizenship would be the only way to achieve scalable and robust citizenship selection. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.071428571428571
                }
            ]
        }
    ],
    "group_index": "385"
}