{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/draft-gf-phase-1-proposal-fluent-finance/5038",
            "title": "[DRAFT][GF: Phase 1 Proposal] Fluent Finance ",
            "index": 5038,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Grants Council"
            ],
            "tags": [
                "cycle-10",
                "not-passed"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/alejandro",
                    "index": "1",
                    "likes": "2",
                    "time": "02/02/2023-04:31:44",
                    "content": "Project name: Fluent Finance Author name and contact info (please provide a reliable point of contact for the project): Alejandro Acosta-Rubio, Head of Ecosystem  Email: alejandro@fluent.finance  Discord: Mr.A#7160 I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: Yes I understand that I will be expected to following the public grant reporting requirements outlined here: Yes L2 recipient address: 0xA33f9c0bd359B2061be13E8C08D28D4cAE1A1108 Which Voting Cycle are you applying for?: Cycle 10 Which sub-committee should review your proposal? (Builders Grants, Growth Experiment Grants): Growth Experiment Grants Project description (please explain how your project works): Fluent provides a two-way bridge between traditional finance and distributed ledgers. We created Plus, our fiat backed stablecoin infrastructure featuring 100% provable, liquid and verifiable cash reserves.Built on the Fluent Protocol, US+ currently operates as our flagship U.S. dollar backed stablecoin. We connect to core banking and public layers using a private settlement bridge, allowing us to verify bank customers and funds before issuing or redeeming stablecoins, all whilst maintaining realtime accountability of our collateral assets.Publicly accessible feed display balances of every Plus collateral account. With Active Proof of Reserves, Fluent publicly broadcasts US+ cash reserves straight from core banking through Chainlink’s industry-leading integrations. Website: https://fluent.finance/ Twitter: https://twitter.com/FluentDAO Discord/Discourse/Community: Fluent Other relevant links (including any demos): “Not a Trusted Stablecoin, a Verifiable Stablecoin” SmartCon 2022, presented by CEO Bradley Allgood      Additional team member info (please link): Bradley Allgood Co-Founder & CEOCo-Founder of the largest network of Special Economic Zones and SEZ investorsHas developed products for governments and blockchain companiesLinkedIn: https://www.linkedin.com/in/allgoodfuturist/-----Jaime Plata Co-Founder & CTOWinner of the Google Financial Services Reimagined ChallengeStrategic advisor to the Eastern Caribbean Central BankLinkedIn: https://www.linkedin.com/in/jaimeplata/-----Oliver Gale Co-Founder & DirectorFounder of the first CBDC companyFounded Panther Protocol (institutional dark pools), BaseTwo (investment firms), and Authentic Revolution (accelerator)LinkedIn: https://www.linkedin.com/in/oliverlgale/-----Full current team info also available here: Team | Fluent Please link to any previous projects the team has meaningfully contributed to: Panther Protocol (https://www.pantherprotocol.io/):An end-to-end solution for privacy and DeFi, specifically built for financial institutions, founded by Fluent Co-Founder and Director Oliver Gale.-----Catawba Economic Zone (https://catawbadigital.zone/):An autonomous jurisdiction, built for Web3 as a public-private partnership with the tribal government of the Catawba Nation. Founded by Fluent Co-Founder and CEO Bradley Allgood.-----ActioByte (https://www.actiobyte.com/):A firm that specializes in SAP technological solutions for companies in the financial industry. Fluent Co-Founder & CTO Jaime Plata served as their Lead Architect for core banking, trading and custodial service platforms. Relevant usage metrics (TVL, transactions, volume, unique addresses, etc. Optimism metrics preferred; please link to public sources such as Dune Analytics, etc.): N/A - New project Competitors, peers, or similar projects (please link): Ondo Finance: https://ondo.finance Stably: https://www.stably.io Is/will this project be open sourced?: No Optimism native?: Yes Date of deployment/expected deployment on Optimism: 12/21/2022 What is the problem statement this proposal hopes to solve for the Optimism ecosystem?: Dollar settlement in Web3 is difficult, risky, and asset-backed stablecoins expose users to highly volatile investments without rewarding them.DAOs and certain foreign institutions or individuals don’t have the mechanisms to reach yields of investment in real world assets, either by the limited access to financial services or other limiting thresholds for opening accounts. How does your proposal offer a value proposition solving the above problem?: Fluent connects non-custodial wallets to core banking, providing superior access to on-chain and real world value. Integrated into a consortium of banks, Fluent’s hybrid public and permissioned blockchain infrastructure enables real-time proof of reserves, as well as direct issuance and management of stablecoins from the core banking system. Utilizing our bank integrations and multi-layered infrastructure, we’ve launched US+, a dollar-pegged stablecoin designed to reliably store and transfer funds while delivering TradFi yield opportunities to qualified DeFi protocols and users. Fluent’s RWA is designed to be compliant with all regulatory mandates, enabling technological mechanisms to receive, administer, and pay yields derived from this contract. Traditional finance may well serve these individuals and institutions, but have opted not to; this is primarily because of infrastructure limitations, risk exposure or inadequate IT services needed to support the Web3 customer base. Decentralized networks offer a mechanism to transfer yields received and pay bond holders using the US+ stablecoin. Why will this solution be a source of growth for the Optimism ecosystem?: The Optimism ecosystem will grow as a result of the ability to plug into a network of institutions, each of which will have access to explore an institutional DeFi solution, opening up large pools of new liquidity to participate in the Optimism ecosystem. Additional on and off ramps for DEXs will also spur Optimism growth and increase the profitability of liquidity pools, which can be reinvested back into Optimism. Has your project previously applied for an OP grant?: No, our project hasn’t previously applied for an OP grant. Number of OP tokens requested: 200,000 OP Did the project apply for or receive OP tokens through the Foundation Partner Fund?: No If OP tokens were requested from the Foundation Partner Fund, what was the amount?: N/A How much will your project match in co-incentives? (not required but recommended, when applicable): N/A How will the OP tokens be distributed? (please include % allocated to different initiatives such as user rewards/marketing/liquidity mining. Please also include a justification as to why each of these initiatives align with the problem statement this proposal is solving.): 40% for liquidity mining on specific token pairs that will give us the ability to off ramp into USD in order to be able to mint US+ on Optimism in a compliant and regulatory fashion. 40% for liquidity mining on strategic token pairs to boost activity across top Optimism projects. This creates a positive incentive for users and in turn attracts liquidity. 20% to US+/OP pool on Velodrome Finance as bribes; since Velodrome is the premier AMM on Optimism, this apportioning serves as a gateway for growth for any project that wishes to utilize Velodrome liquidity. Over what period of time will the tokens be distributed for each initiative? Shorter timelines are preferable to longer timelines. Shorter timelines (on the order of weeks) allow teams to quickly demonstrate achievement of milestones, better facilitating additional grants via subsequent proposals: Week 1: The first 10% will be liquidated into an alternative stablecoin that Fluent can use to mint US Plus in a regulatorily-compliant fashion. The next 10% will remain as OP tokens, which Fluent will use to strengthen the US Plus liquidity pool (with a token pair consisting of US+/OP).  Weeks 2 through 5: Any additional grant funds will be used to add liquidity to various pools across Optimism (in order to bootstrap the US+/OP token pair).  Week 5 and on: 20% of the US+/OP pool will be added to Velodrome Finance as a bribe. Please clearly define the milestones you expect to achieve in order to receive milestone based installments. Please consider how each milestone relates to incentivizing sustainable usage and liquidity on Optimism. Progress towards each milestone must be trackable: Milestone #1: US+ trading exceeds $50,000 across Optimism Milestone #2: Achieving a market cap in excess of $100,000 (while also providing yield to token holders) Milestone #3: Reach a market volume equivalent to $200,000 USD in Velodrome Finance. Why will incentivized users and liquidity on Optimism remain after incentives dry up?: Fluent remains focused on the chains we launch on. While many projects will deploy smart contracts, market and move on, we intend to develop real value for builders and protocols; furthermore, we are constantly developing institutional use cases with global entities. Our strategy to support ecosystems includes:  Direct on-ramps to DEXs Revenue share of fixed income reserves being invested back into the ecosystem Improving the quality of data for the oracle ecosystem Developing PoC and MVPs with institutional partners Supporting cross Layer 1 and 2 partnerships Bringing liquidity partners into the ecosystem  Please provide any additional information that will facilitate accountability (smart contracts addresses relevant to the proposal, relevant organizational wallet addresses, etc.):  USPLUS (US+) Token Tracker | Optimism Confirm you have read and agree to the Eligibility Restrictions (here):  I have read the Eligibility Restrictions and agree to abide by their conditions ",
                    "links": [
                        "https://fluent.finance/",
                        "https://twitter.com/FluentDAO",
                        "https://discord.gg/Eex8dYwGXz",
                        "https://www.youtube.com/watch?v=cy4sUqI_j8k",
                        "https://www.linkedin.com/in/allgoodfuturist/",
                        "https://www.linkedin.com/in/jaimeplata/",
                        "https://www.linkedin.com/in/oliverlgale/",
                        "https://www.fluent.finance/team",
                        "https://www.pantherprotocol.io/",
                        "https://catawbadigital.zone/",
                        "https://www.actiobyte.com/",
                        "https://ondo.finance",
                        "https://www.stably.io",
                        "https://optimistic.etherscan.io/token/0x50a3fae61f1890a4def3dd54958b63b71e1e3355",
                        "https://gov.optimism.io/t/grant-proposal-template/3233"
                    ],
                    "GPT-summary": "The post is a draft proposal for a project called Fluent Finance, which aims to provide a two-way bridge between traditional finance and distributed ledgers. The proposal explains how the project works, its value proposition, and how it will solve the problem of dollar settlement in Web3. The post also includes information about the team, relevant links, and milestones. A 3rd party is not giving feedback or asking questions, but rather extending to the proposal by advertising it positively.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Interoperability and Scaleability",
                        "Token economics",
                        "Law and regulations",
                        "Privacy, Security and risk management"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal",
                        "None"
                    ],
                    "Sentiment": 5.531527554842162
                }
            ]
        }
    ],
    "group_index": "505"
}