{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/proposal-to-amend-operating-manual-of-the-optimism-collective-v0-1-2/2997",
            "title": "Proposal to amend OPerating Manual of the Optimism Collective (v0.1.2) ",
            "index": 2997,
            "category": [
                "\\xf0\\x9f\\x8f\\x9b Governance"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "1",
                    "likes": "7",
                    "time": "15/07/2022-08:14:56",
                    "content": "As the title says, this proposal is to amend OPerating Manual. With respect to “Treasury Appropriations” , we have two statement in current OPerating manual.  Here its clear that any proposal related to change must be submitted by an OP holder or their delegate.   image1276×465 47.8 KB   On the same page, we have this line stating that it will be initiated by OP Foundation.   image1071×520 36.6 KB  I assume and it has been confirmed that OP Foundation also hold some token and hence, they can submit a proposal. Important to note is that, such proposal will come from only from them or to put this in different word, I cant submit such proposal even if I hold OP token. What I am suggesting:- instead of this “Proposals to be initiated by the Foundation”, we should change it to \"Proposals must be initiated by the Foundation* \"  Optimism Foundation hold few OP token which give them rights to submit such proposal. (of course word can be changed and paraphrased to give a clear message).  My reasoning:- All though small change, its important to be precise as we look up to OPerating manual when in doubt and it acts as a pillar towards holding the constitutions. Also, this is not just me, there is a another proposal (on different topic) and the author was pointing to this statement, I did try to explain but if manual is not clear, we cant have proper discussion.     OPerating Manual of the Optimism Collective (v0.1.2) 🏛 Governance       This document describes the current governance proposal process of the Optimism Collective. It will evolve, with the Collective, over time. The authoritative version is maintained here on the Optimism Foundation Github.   OPerating Manual v0.1.2:  The Token House and OP Holders  Governance in the Optimism Collective begins with the launch of the Token House and its members, the OP holders.  As Token House members, OP holders are responsible for submitting, deliberating, and voting on various typ…     ",
                    "links": [
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/2/2228247eca86c88f0eba4e06f6276fe665164bc1.png",
                        "https://gov.optimism.io/t/operating-manual-of-the-optimism-collective-v0-1-2/592",
                        "https://github.com/ethereum-optimism/OPerating-manual",
                        "https://gov.optimism.io/t/draft-so2-committee-proposal-defi-group-c/3320"
                    ],
                    "GPT-summary": "The author of the post is proposing an amendment to the Operating Manual of the Optimism Collective related to the submission of proposals. The author suggests changing the wording to clarify that only the Optimism Foundation can initiate proposals related to Treasury Appropriations. The post also mentions another proposal that refers to the same statement in the Operating Manual. The post provides a brief overview of the current governance proposal process of the Optimism Collective.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.391304347826087
                },
                {
                    "author_link": "https://gov.optimism.io/u/Netrim",
                    "index": "2",
                    "likes": "1",
                    "time": "15/07/2022-12:21:47",
                    "content": "Agreed, 100%, clear information on the Operating Manual is a must ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/Defi_LATAM_axlvaz",
                    "index": "3",
                    "likes": "1",
                    "time": "16/07/2022-15:08:24",
                    "content": "In favor of this, it is important that the information in the instruction manual is clear. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/Maessedai",
                    "index": "4",
                    "likes": "1",
                    "time": "17/07/2022-11:50:31",
                    "content": "Nothing wrong with making things more clear. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.166666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "5",
                    "likes": "0",
                    "time": "13/09/2022-18:22:15",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        },
        {
            "thread_link": "https://gov.optimism.io/t/operating-manual-of-the-optimism-collective-v0-1-2/592",
            "title": "OPerating Manual of the Optimism Collective (v0.1.2) ",
            "index": 592,
            "category": [
                "\\xf0\\x9f\\x8f\\x9b Governance"
            ],
            "tags": [
                "season-1"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/system",
                    "index": "1",
                    "likes": "93",
                    "time": "17/05/2022-19:36:55",
                    "content": "This document describes the current governance proposal process of the Optimism Collective. It will evolve, with the Collective, over time. The authoritative version is maintained here on the Optimism Foundation Github.  OPerating Manual v0.1.2:  The Token House and OP Holders  Governance in the Optimism Collective begins with the launch of the Token House and its members, the OP holders. As Token House members, OP holders are responsible for submitting, deliberating, and voting on various types of Optimism Collective governance proposals. In carrying out these functions, OP holders may either vote their OP directly, or delegate their OP voting power to an eligible third party. The Token House is just the first part of the Optimism Collective governance structure. Launch of the Citizens’ House will soon follow and this OPerating Manual will be updated accordingly.  Governance Toolkit  The two primary tools for Optimism Collective governance are:   Snapshot: Where all Token House governance proposals are submitted for vote.  The Optimism Forum: A platform for discussion and deliberation about governance proposals.   Proposal Process – Components of a Valid Proposal  The lifecycle of a Token House governance proposal involves four phases:  (1) feedback; (2) submission; (3) voting; and (4) implementation. Each phase, and its associated requirements, are described below. 1 . Feedback Anyone submitting a proposal should make an effort to gather feedback from the community and from Delegates prior to submitting a proposal for vote. There are two primary avenues for feedback: (a) For lightweight or early feedback, authors may post a proposal (or an abbreviated version of your proposal) in the #gov-temp-check channel on Discord. This channel is open to the entire Optimism community and can be used as an easy way to get a quick temperature check. (b) For formal feedback from governance participants, authors may post a proposal in the Forum with a [DRAFT] label in the title. This signals your proposal is ready for feedback from Token House delegates. All feedback from these two forums is non-binding, but proposers are expected to engage in good faith. This step is designed to help craft thoughtful, effective proposals. After incorporating feedback, the proposal author may remove [DRAFT] from the proposal title and advance to proposal submission. 2 . Submission To be eligible for voting, a Token House governance proposal must be formally submitted by an OP holder or their delegate. This means that the proposal must be:   A valid Proposal Type. All v0.1 governance proposals must fall within one of the following categories:  Governance Fund (Phase 0 or Phase 1) Protocol Upgrade Inflation Adjustment Director Removal Treasury Appropriations Rights Protections    For a more detailed description of each Proposal Type, see “Proposal Process – By Proposal Type” below.   Properly formatted to the applicable template. Each Proposal Type will have a specific Template associated with it in the Forum. Prior to submission, a proposal author must conform their proposal to the format of the applicable Template in all material respects. This will include, for the time being, a requirement that all submissions be made in English.  Approved by at least one delegate. Over the course of discussion and feedback, at least one Delegate with more than 0.0005% of voting power must signal that they believe the proposal is ready for vote. In the spirit of governance minimization, this document will not codify an explicit approval mechanism but will expect community members to interpret this appropriately.  Formally submitted to voting. One week before the start of each voting cycle, the Foundation will start a Voting Period Submission thread on the Forum. To formally submit a proposal for voting, the proposal author must either (a) update their proposal title to start with [READY] or (b) add a link to this Voting Period Submission thread that points to their proposal on the Forum. At the start of the next Voting Period, the Optimism Foundation will submit all valid proposals marked as ready to Snapshot for voting.  Submitted proposals must satisfy all the above criteria to be considered valid. Invalid proposals will be thrown out. Anyone submitting a proposal is welcome to submit a draft version of the proposal for feedback on the Optimism Forum. To do so, please include [Draft] in your Forum title, then update the proposal title once the proposal body is finalized. 3 . Voting To minimize overhead, all votes are conducted on Snapshot at regular intervals called voting periods. Voting periods begin each Thursday at 7pm GMT and end 1 week and 6 days later, on the following Wednesday at 7pm GMT. Proposal types may require one or more voting periods before a resolution to the vote can be reached. A Token House governance proposal will only be approved if it satisfies the following minimum vote thresholds:   Quorum: The minimum number of total OP votes required to be cast in connection with a proposal. Here, a quorum is measured as a % of the total votable OP supply.  The total votable OP supply will be determined based on a reasonable estimate provided by the Optimism Foundation prior to each voting period.    Approval threshold:  The minimum number of OP votes required to be cast in favor of approving a proposal. The approval threshold for each proposal is measured as % of votes cast to approve relative to the total number of votes cast in connection with a proposal.  A snapshot to determine voting power for each delegate or OP holder will be taken at the commencement of a given voting period. Depending on the Proposal Type, exact quorum and approval threshold requirements may vary. 4 . Implementation Proposals that are rejected due to invalidity or insufficient support can be resubmitted. Approved proposals are routed to the Optimism Foundation for implementation, as more fully described in the “Implementation and Administration” section below.  Proposal Process – Lifecycle  While the details of a particular Token House governance proposal may vary by Proposal Type, a proposal’s lifecycle will generally look something like this:  Screen Shot 2022-06-07 at 6.07.45 PM2398×602 224 KB   Proposal Process  – By Proposal Type  The different requirements for submission and approval of each Proposal Type are summarized below.     Proposal Type Description Submission Requirements Vote Duration (# of voting periods) Quorum (minimum % of votable OP supply actually voted) Approval Threshold(minimum % of votes cast to approve relative to total votes cast)     Governance Fund  (Phase 0 Batch) OP distributions to proactively incentivize future growth of projects and communities in the Optimism ecosystem. Phase 0 specifically rewards existing projects that drove growth to Optimism before Airdrop #1  Eligibility requirements described here.   The Optimism Foundation will assist eligible Phase 0 candidates to structure submissions. Snapshot proposal for batch to be initiated by the Foundation. 1 (~2 weeks) 10% 51%   Governance Fund  (Phase 1) OP distributions to proactively incentivize future growth of projects and communities in the Optimism ecosystem. Phase 1 begins after Airdrop #1  Forum + Snapshot 1 (~2 weeks) 10% 51%   Protocol Upgrade Scheduled changes to the on-chain smart contracts comprising the mainnet Optimism protocol Snapshot 2 (~4 weeks) 10% 51%   Inflation Adjustment Changes to the inflation rate of newly minted OP (currently capped at 2% annually) Snapshot 2 (~4 weeks) 10% 76%   Director Removal Removal of a director of the Optimism Foundation Snapshot 2 (~4 weeks) 10% 76%   Treasury  Appropriations The amount of OP the Optimism Foundation may spend or distribute annually, beginning in Year 2 of its existence (the Year 1 budget is 30% of the initial total OP supply) Proposals to be initiated by the Foundation 2 (~4 weeks) 10% 51%   Rights Protections OP holders must consent to any changes to the founding documents of the Optimism Foundation, if those changes would materially reduce their rights Proposals to be initiated by the Foundation 2 (~4 weeks) 10% 51%     Implementation and Administration  In all cases, Optimism Collective governance is intended to be carried out consistent with the terms of its Working Constitution, the spirit of its Code of Conduct, and the pursuit of its Optimistic Vision. The Optimism Foundation will steward this process as described below. Administration The Optimism Foundation will facilitate the administration of the governance procedures described in this OPerating Manual with the aim of ensuring that OP holders may participate thoughtfully in Token House governance. Such administrative services may include:  Moderation of governance proposals to ensure they are validly submitted and voted upon; Removal of proposals that reasonably appear to be fraudulent, spam-oriented, defamatory, hateful, or otherwise inappropriate or inconsistent with the values of the Collective; Monitoring of votes, the votable token supply, and voting periods for purposes of determining whether quorums and approval thresholds are met; Management of mutually contradictory proposals that are submitted simultaneously or in close proximity to one another; Administration of network maintenance, such as emergency bug fixes or release rollbacks (with or without a governance vote); and Such other things as the Foundation deems appropriate in connection with the above.  Implementation Approved Token House governance proposals will be routed to the Optimism Foundation for implementation. Upon receipt of an approved proposal, the Optimism Foundation will determine whether the proposal is safe, secure, consistent with the purposes of the Foundation and the Collective, and capable of being implemented in a legally compliant manner.  If it is, the Foundation will act diligently and in a commercially reasonable manner to cause the proposal to be implemented. If it is not, the Foundation may remove the proposal for resubmission or cause the proposal to be implemented with certain guardrails, in its discretion, and coupled with an explanation to the Collective as to why the proposal was rejected or limited.  The Optimism Foundation will undertake this ministerial work with a view towards increasingly decentralizing its role over time.  Amendments  The procedures described in this OPerating Manual will go into effect at the time of Airdrop #1, and be adjusted later in connection with a series of governance experiments. These changes include but are not limited to introducing the Citizens’ House, and adding, removing, and modifying Proposal Types and rules relating to voting processes. Any non-clerical updates to the OPerating Manual will be reflected with a new version number at the top of this document, at which point the updated version will go into effect. ",
                    "links": [
                        "https://community.optimism.io/docs/governance/",
                        "https://snapshot.org/#/opcollective.eth",
                        "http://gov.optimism.io",
                        "https://discord-gateway.optimism.io/",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/1X/e9fa421762750c97c819154d92c7f4fa159deefe.jpeg",
                        "https://community.optimism.io/docs/governance/gov-fund/#:~:text=%23-,Phase%200,-Phase%200%20",
                        "https://community.optimism.io/docs/governance/gov-fund/#:~:text=%23-,Phase%200,-Phase%200%20",
                        "https://community.optimism.io/docs/governance/gov-fund/#:~:text=%23-,Phase%201,-Phase%201%20",
                        "https://gov.optimism.io/t/working-constitution-of-the-optimism-collective/55",
                        "https://gov.optimism.io/t/code-of-conduct/5/3",
                        "https://www.optimism.io/vision",
                        "https://gov.optimism.io/t/governance-fund-phase-1-how-to-create-a-proposal/216",
                        "https://gov.optimism.io/t/op-governance-update-1-june-9-2022/2620",
                        "https://gov.optimism.io/t/welcome-to-the-optimism-collective-discourse/7",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-ooki-protocol/1025/8",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-dforce/2420/2",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-optimistic-railway/2309/6",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-superfluid/2314/7",
                        "https://gov.optimism.io/t/draft-gf-meta-proposal-to-reserve-a-share-of-gf-distribution-for-liquidity-backstopping-and-stronger-governance/2969/43",
                        "https://gov.optimism.io/t/i-wan-to-discuss-project-boosting-their-delegate-power-with-governance-fund/2961/49",
                        "https://gov.optimism.io/t/op-as-an-mev-staking-token/3202/6",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-paraswap/2228/14",
                        "https://gov.optimism.io/t/proposal-to-amend-operating-manual-of-the-optimism-collective-v0-1-2/2997"
                    ],
                    "GPT-summary": "The post is an operating manual for the governance proposal process of the Optimism Collective. It explains the governance structure, tools, and proposal process, including the four phases of feedback, submission, voting, and implementation. The post also provides a summary of the different proposal types and their requirements for submission and approval. The post is informative and does not advertise or ask for collaboration. It may be of interest to those who want to understand the governance process of the Optimism Collective or those who want to submit a proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.627717652717652
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "2",
                    "likes": "17",
                    "time": "17/05/2022-19:50:14",
                    "content": "OP governance model is getting interested each passing day. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/cryptowanderer",
                    "index": "3",
                    "likes": "13",
                    "time": "17/05/2022-21:24:21",
                    "content": "Hello friends, It’s so wonderful to see your work continue to unfold in our shared worlds. Thank you, truly, for all you do. That said, this v0.1 is governance theatre (which is understandable, as a v0.1). The Foundation can administer however it deems appropriate, and all implementation is routed through it. I will be happy to see that evolve over time, especially given bringing Bryan, Eva and Abbey along for the ride. The only reason I point this out is:     system:  with the aim of ensuring that OP holders may participate efficiently and effectively   I genuinely believe that the order of those words (and the specific choice) is reason for pause.  Is efficiency really the primary goal here? Isn’t that a big part of the reason that the web is like it currently is? Why not “participate with both impact ad care” or something which better captures the humanist ideals the vision and recent blog posts paint?  With love  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.535714285714286
                },
                {
                    "author_link": "https://gov.optimism.io/u/Defi_LATAM_axlvaz",
                    "index": "4",
                    "likes": "9",
                    "time": "17/05/2022-22:44:39",
                    "content": "Here is the Spanish translation, as we had committed to the DefiLatam community. Este documento describe el proceso actual de propuesta de gobernanza de Optimism Collective. Evolucionará, con el Colectivo, con el tiempo.  Manual de operaciones v0.1: Token House y OP Holders La gobernanza en Optimism Collective comienza con el lanzamiento de Token House y sus miembros, los OP holders. Como miembros de Token House, los OP holders son responsables de presentar, deliberar y votar sobre varios tipos de propuestas en la gobernanza de Optimism Collective. Al llevar a cabo estas funciones, los OP holders pueden votar con OP directamente o delegar su poder de voto de OP a un tercero elegible. Token House es solo la primera parte de la estructura de gobierno de Optimism Collective. Próximamente se inaugurará la Cámara de los Ciudadanos y este Manual Operativo se actualizará en consecuencia.  Kit de herramientas de gobernanza Las dos herramientas principales para la gobernanza de Optimism Collective son:  Snapshot: donde todas las propuestas de gobernanza de Token House se envían para votación.  El foro del optimismo: Una plataforma de discusión y deliberación sobre propuestas de gobernanza.   Proceso de propuesta: componentes de una propuesta válida El ciclo de vida de una propuesta de gobernanza de Token House consta de tres fases: (1) presentación; (2) votación; y (3) implementación. Cada fase y sus requisitos asociados se describen a continuación. 1 . Envío de propuesta. Para ser elegible para votar, OP holder o su delegado debe presentar una propuesta de gobernanza válida en Token House. Esto significa que la propuesta debe ser:   Un tipo de propuesta válida. Todas las propuestas de gobernanza v0.1 deben estar dentro de una de las siguientes categorías:   Fondo de Gobernanza (Fase 0 o Fase 1)   Actualización de protocolo   Ajuste por inflación   Destitución del director   Asignaciones del Treasury   Protecciones de derechos   Para obtener una descripción más detallada de cada tipo de propuesta, consulte “Proceso de propuesta: por tipo de propuesta” a continuación.   Correctamente formateado a la Plantilla aplicable. Cada tipo de propuesta tendrá una plantilla específica asociada. Antes de la presentación, el autor de una propuesta debe ajustar su propuesta al formato de la plantilla aplicable en todos los aspectos materiales. Esto incluirá, por el momento, el requisito de que todas las presentaciones se realicen en inglés.  Enviado a los foros correctos. Todas las propuestas de gobierno de Token House deben enviarse a Snapshot para su votación. Si bien el uso del Optimism Forum es en su mayoría opcional, todas las propuestas del Fondo de Gobernanza (Fase 1) deben enviarse tanto al Foro como a Snapshot.  Finalmente, en la medida en que una propuesta de gobernanza se publique tanto en el Foro como en Snapshot, el contenido de esa propuesta debe ser idéntico en ambas plataformas. Las propuestas enviadas deben cumplir con todos los criterios anteriores para ser consideradas válidas. Las propuestas no válidas serán descartadas. Cualquiera que envíe una propuesta puede enviar una versión preliminar de la propuesta para recibir comentarios en el Optimism Forum. Para hacerlo, inclúya [Draft]en el título de su foro y luego actualice el título de la propuesta una vez que el cuerpo de la propuesta esté finalizado. 2 . Votación Para minimizar los gastos generales, todas las votaciones se realizan en Snapshot a intervalos regulares llamados períodos de votación. Los períodos de votación comienzan cada jueves a las 7 p. m. GMT y finalizan 1 semana y 6 días después, el miércoles siguiente a las 7 p. m. GMT. Los tipos de propuestas pueden requerir uno o más períodos de votación antes de que se pueda llegar a una resolución para votar. Una propuesta de gobierno de Token House solo se aprobará si cumple con los siguientes umbrales mínimos de votos:   Quórum: El número mínimo de votos OP totales requeridos para ser emitidos en relación con una propuesta. Aquí, el quórum se mide como un % del suministro total de OP votable .  El supply total de OP votable se determinará en función de una estimación razonable proporcionada por Optimism Foundation antes de cada período de votación.    Umbral de aprobación: El número mínimo de votos OP requeridos para ser emitidos a favor de aprobar una propuesta. El umbral de aprobación de cada propuesta se mide como un % de votos emitidos para aprobar (en relación con el número total de votos emitidos en relación con) una propuesta .  Se tomará un snapshot para determinar el poder de voto de cada delegado o titular de OP al comienzo de un período de votación determinado. Según el Tipo de Propuesta, los requisitos exactos de quórum y umbral de aprobación pueden variar. 3 . Implementación Las propuestas que sean rechazadas por invalidez o apoyo insuficiente pueden volver a presentarse. Las propuestas aprobadas se envían a Optimism Foundation para su implementación, como se describe más detalladamente en la sección “Implementación y administración” a continuación.  Proceso de propuesta: por tipo de propuesta Los diferentes requisitos para la presentación y aprobación de cada Tipo de Propuesta se resumen a continuación.     Tipo de propuesta Descripción Requerimientos de la sumisión Duración de la votación (# de períodos de votación) Quórum (% mínimo de supply OP votable realmente votado) Umbral de aprobación (% mínimo de votos emitidos para aprobar en relación con el total de votos emitidos)     Fondo de Gobernanza (Fase 0 Lote) Distribuciones OP para incentivar proactivamente el crecimiento futuro de proyectos y comunidades en el ecosistema Optimism. Fase 0 recompensa específicamente los proyectos existentes que impulsaron el crecimiento hacia Optimism antes de Airdrop #1  Requisitos de elegibilidad descritos aquí. Optimism Foundation ayudará a los candidatos elegibles de la Fase 0 a estructurar las presentaciones. Snapshop propuesta de lote a iniciar por la Fundación. 1 (~2 semanas) 0.1 0.51   Fondo de Gobernanza (Fase 1) Distribuciones OP para incentivar proactivamente el crecimiento futuro de proyectos y comunidades en el ecosistema Optimism. La Fase 1 comienza después del Airdrop #1  Foro + snaphop 1 (~2 semanas) 0.1 0.51   Actualización de protocolo Cambios programados en los contratos inteligentes on-chain que comprenden el protocolo Optimism mainnet Snapshop 2 (~4 semanas) 0.1 0.51   Ajuste por inflación Cambios en la tasa de inflación de los OP recién acuñados (actualmente con un tope del 2 % anual) Snapshop 2 (~4 semanas) 0.1 0.76   Destitución del director Destitución de un director de la Fundación Optimismo Snapshop 2 (~4 semanas) 0.1 0.76   Asignaciones del Tesoro La cantidad de OP que Optimism Foundation puede gastar o distribuir anualmente, a partir del año 2 de su existencia (el presupuesto del año 1 es el 30% del supply total inicial de OP) Propuestas a ser iniciadas por la Fundación 2 (~4 semanas) 0.1 0.51   Protección de derechos Los titulares de OP deben aceptar cualquier cambio en los documentos fundacionales de Optimism Foundation, si esos cambios reducirían materialmente sus derechos. Propuestas a ser iniciadas por la Fundación 2 (~4 semanas) 0.1 0.51     Implementación y Administración En todos los casos, la gobernanza del Optimism Collective pretende llevarse a cabo de conformidad con los términos de su Constitución de Trabajo, el espíritu de su Código de Conducta y la búsqueda de su Visión Optimista. The Optimism Foundation administrará este proceso como se describe a continuación. Administración The Optimism Foundation facilitará la administración de los procedimientos de gobierno descritos en este Manual operativo con el objetivo de garantizar que los OP holders puedan participar de manera eficiente y efectiva en la gobernanza de Token House. Dichos servicios administrativos pueden incluir:  Moderación de las propuestas de gobernanza para garantizar que se presenten y voten válidamente; Eliminación de propuestas que parezcan razonablemente fraudulentas, orientadas a correos no deseados, difamatorias, odiosas o inapropiadas o inconsistentes con los valores del Colectivo; Supervisión de los votos, el suministro de tokens votables y los períodos de votación con el fin de determinar si se cumplen los quórumes y los umbrales de aprobación; Gestión de propuestas contradictorias entre sí que se presentan simultáneamente o muy cerca unas de otras; Administración del mantenimiento de la red, como corrección de errores de emergencia o reversión de versiones (con o sin voto de gobierno); y Las demás que la Fundación estime convenientes en relación con las anteriores.  Implementación Las propuestas de gobernanza de Token House aprobadas se enviarán a Optimism Foundation para su implementación. Al recibir una propuesta aprobada, Optimism Foundation determinará si la propuesta es segura, consistente con los propósitos de la Fundación y el Colectivo, y si se puede implementar de manera legalmente compatible.  En caso afirmativo, la Fundación actuará con diligencia y de forma comercialmente razonable para que la propuesta se lleve a cabo. De no ser así, la Fundación puede eliminar la propuesta para volver a presentarla o hacer que la propuesta se implemente con ciertas medidas de seguridad, a su discreción, y junto con una explicación al Colectivo de por qué la propuesta fue rechazada o limitada.  La Optimism Foundation emprenderá este trabajo ministerial con miras a descentralizar cada vez más su papel con el tiempo.  Enmiendas Los procedimientos descritos en este Manual operativo entrarán en vigencia en el momento del Airdrop #1 y se ajustarán más adelante en relación con una serie de experimentos de gobernanza. Estos cambios incluyen, entre otros, la introducción de la Cámara de los Ciudadanos y la adición, eliminación y modificación de Tipos de propuestas y reglas relacionadas con los procesos de votación. Cualquier actualización no administrativa del Manual de operaciones se reflejará con un nuevo número de versión en la parte superior de este documento, momento en el que entrará en vigencia la versión actualizada. ",
                    "links": [
                        "http://gov.optimism.io/",
                        "https://community.optimism.io/docs/governance/gov-fund/#:~:text=%23-,Phase%200,-Phase%200%20",
                        "https://community.optimism.io/docs/governance/gov-fund/#:~:text=%23-,Phase%200,-Phase%200%20",
                        "https://community.optimism.io/docs/governance/gov-fund/#:~:text=%23-,Phase%201,-Phase%201%20",
                        "https://gov.optimism.io/t/working-constitution-of-the-optimism-collective/55/23",
                        "https://gov.optimism.io/t/code-of-conduct/5/3",
                        "https://mirror.xyz/0x3e4865634EC54dFF742E1a7452a456919B8e277b/G-Ss-W78Vfrckz2MkHHnWiB7wFaH2D5nsbh6KE5c050"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.022727272727273
                },
                {
                    "author_link": "https://gov.optimism.io/u/karl",
                    "index": "5",
                    "likes": "8",
                    "time": "18/05/2022-04:02:35",
                    "content": "  Why not “participate with both impact ad care” or something which better captures the humanist ideals the vision and recent blog posts paint?   This is a great catch & suggestion! Will meditate on the precise wording, but I agree we should update the doc with new language here. Efficiency & effectiveness doesn’t quite capture what we are trying to express. Really appreciate your thoughtful comment!!!  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.155438311688311
                },
                {
                    "author_link": "https://gov.optimism.io/u/wcc",
                    "index": "6",
                    "likes": "7",
                    "time": "18/05/2022-04:59:25",
                    "content": " The two primary tools for Optimism Collective governance are:   Snapshot: Where all Token House governance proposals are submitted for vote.   The Optimism Forum : A platform for discussion and deliberation about governance proposals.   I mostly agree on the manual v0.1 here. Just one point to mention as open discussion whether the forum is the most situable tool as a discussion platform. For me there are benefit and limitations that we need to trade. Benefit  Format-oriented Topic-oriented It’s a clean place where people would think and structure their opinions before actually submitting a reply which is pretty better than Discord.  Limitation  If participation is very high (say 10 pages), it may not be easy to follow what has been discussed so far. (I understand that forum works well for many protocols, but believe that the scale of OP governance we seek may consist of much more number of participants here)   To be honest, currently, I cannot think of a better alternative than the forum too, but just bring this in case anyone has an idea. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.674375
                },
                {
                    "author_link": "https://gov.optimism.io/u/Maessedai",
                    "index": "7",
                    "likes": "0",
                    "time": "18/05/2022-19:34:11",
                    "content": "Love this direction for sure. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/polynya",
                    "index": "8",
                    "likes": "11",
                    "time": "19/05/2022-03:58:25",
                    "content": "Regarding protocol upgrades, I assume keys will be held by the Optimism Foundation? I’d recommend decentralizing this as soon as possible. Emergency bug fixes can be approved by top N delegates + Optimism Foundation. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/chdonger",
                    "index": "9",
                    "likes": "1",
                    "time": "19/05/2022-05:48:44",
                    "content": "I do see Op Citizen will be more focus on to build a long term Op goverance rathen than short term financial enefit. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5625
                },
                {
                    "author_link": "https://gov.optimism.io/u/Graciouseats",
                    "index": "10",
                    "likes": "1",
                    "time": "19/05/2022-17:04:16",
                    "content": "Will there be an appeal process for decisions made by the OP Foundation?  I am not implying their decisions will be disagreeable. Process wise, I think there should be an avenue to appeal. Thanks!! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 7.53125
                },
                {
                    "author_link": "https://gov.optimism.io/u/solarcurve",
                    "index": "11",
                    "likes": "2",
                    "time": "20/05/2022-11:21:50",
                    "content": "One point I didn’t see directly addressed is how proposals will be put on snapshot - or was the part about the Foundation starting the snapshot votes applicable beyond just Phase 0 proposals? Will the Foundation start the snapshot vote for every proposal? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/Koqe1",
                    "index": "13",
                    "likes": "0",
                    "time": "28/05/2022-12:43:12",
                    "content": "Why you make things so complicated, very hard to follow what is going on damn. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 2.8020833333333335
                },
                {
                    "author_link": "https://gov.optimism.io/u/hena",
                    "index": "14",
                    "likes": "0",
                    "time": "29/05/2022-04:49:16",
                    "content": "the suggestion is good ,need the community to support it ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/bobby",
                    "index": "15",
                    "likes": "0",
                    "time": "01/06/2022-23:06:03",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/bobby",
                    "index": "16",
                    "likes": "0",
                    "time": "02/06/2022-01:22:58",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/zhangmeixi",
                    "index": "18",
                    "likes": "0",
                    "time": "02/06/2022-03:31:11",
                    "content": "This is a great catch & suggestion! Will meditate on the precise wording, but I agree we should update the doc with new language here. Efficiency & effectiveness doesn’t quite capture what we are trying to express. Really appreciate your thoughtful comment!!!  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 7.517613636363636
                },
                {
                    "author_link": "https://gov.optimism.io/u/RiverPhoenix.eth",
                    "index": "19",
                    "likes": "0",
                    "time": "02/06/2022-16:18:13",
                    "content": "    system:  osals to be initiated by the Foundat   good！OP governance model is getting interested each passing day. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/asianpersuasion",
                    "index": "20",
                    "likes": "1",
                    "time": "03/06/2022-02:20:01",
                    "content": "super interesting, I like it! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.395833333333332
                },
                {
                    "author_link": "https://gov.optimism.io/u/castro112",
                    "index": "21",
                    "likes": "0",
                    "time": "03/06/2022-04:14:24",
                    "content": "el protocolo de OP sera legendario para eth, solo es cuestion de tiempo, para que las masas empiesen a usarlo. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/witsarutp",
                    "index": "22",
                    "likes": "0",
                    "time": "03/06/2022-07:26:01",
                    "content": "Optimism governance model is very interested. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.625
                },
                {
                    "author_link": "https://gov.optimism.io/u/Dlaw2d",
                    "index": "23",
                    "likes": "0",
                    "time": "03/06/2022-13:47:55",
                    "content": "I like how the govenance system is transparent. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/taila",
                    "index": "24",
                    "likes": "1",
                    "time": "03/06/2022-15:17:18",
                    "content": "I am looking forward to the start of voting, we should speak up for the better development of the community ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/thanaphatchy",
                    "index": "25",
                    "likes": "0",
                    "time": "03/06/2022-17:48:57",
                    "content": "great op next project ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/testtest1212",
                    "index": "26",
                    "likes": "0",
                    "time": "04/06/2022-09:37:37",
                    "content": "Hi - Just came across this and excited for this new crypto governance experiment.  Curious if anyone here understands how stuff like changes to network parameters will work.  From this link (Governance Overview | Optimism Docs) it seems that it’s the responsibility of both houses.  So does that mean that each house must vote in favor of the proposal for it to pass? Sort of like both chambers of the US Congress (Senate & House of Representatives) approving a new bill of law? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.235227272727273
                },
                {
                    "author_link": "https://gov.optimism.io/u/mikew2479",
                    "index": "27",
                    "likes": "0",
                    "time": "04/06/2022-13:41:53",
                    "content": "Seems like there’s some good ideas coming out of optimism… May even help change the way the world works  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/joleza999",
                    "index": "28",
                    "likes": "0",
                    "time": "04/06/2022-13:42:40",
                    "content": "OP governance very interested! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.03125
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "29",
                    "likes": "0",
                    "time": "04/06/2022-18:16:18",
                    "content": "yes, you are right but there is more to that. more on this OPeratin Manual quite interesting, inst ? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.232142857142857
                },
                {
                    "author_link": "https://gov.optimism.io/u/possa",
                    "index": "30",
                    "likes": "0",
                    "time": "04/06/2022-18:21:25",
                    "content": "see you guys next 2 years  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/EddO.S",
                    "index": "31",
                    "likes": "0",
                    "time": "05/06/2022-00:02:57",
                    "content": "Very interesting concept. Looking forward on how Citizen’s house will come into play. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/nana",
                    "index": "32",
                    "likes": "0",
                    "time": "05/06/2022-01:32:49",
                    "content": "its such a good suggestion we can do moren from dao ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/cheva007",
                    "index": "33",
                    "likes": "0",
                    "time": "05/06/2022-03:53:38",
                    "content": "interesting  I like how the govenance system is transparent. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/Ovetta",
                    "index": "34",
                    "likes": "0",
                    "time": "05/06/2022-13:47:25",
                    "content": "I’m concerned about the use of third party, “Discord,” in governance.  Discord is not trusted by all OP citizens and from what I’ve read in the Delegate Commitments, not all prospective delegates own Discord accounts.  Why not just use the internal OP forum for such matters where at least you have relative certainty that you’re not dealing with a bot? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/Defi_LATAM_axlvaz",
                    "index": "35",
                    "likes": "0",
                    "time": "05/06/2022-19:06:24",
                    "content": "In the operating manual v0.1 of the official web site it describes 3 phases: OPerating Manual of the Optimism Collective (v0.1) | Optimism Docs  image866×202 12.7 KB  And in the governance forum the manual v.01.1 describes 4 phases: OPerating Manual of the Optimism Collective (v0.1.1)  To unify criteria, shouldn’t they mean the same thing? Which is the correct version? ",
                    "links": [
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/1X/e2061f30211eedac31d4529c8ff5b7cafbb6958d.png",
                        "https://gov.optimism.io/t/operating-manual-of-the-optimism-collective-v0-1-1/592"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.21875
                },
                {
                    "author_link": "https://gov.optimism.io/u/Eklypse",
                    "index": "36",
                    "likes": "0",
                    "time": "05/06/2022-21:34:30",
                    "content": "Hi, As the 0.1.1 version number is greater than 0.1, the 4 phases is the correct version  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/Eklypse",
                    "index": "37",
                    "likes": "1",
                    "time": "05/06/2022-21:36:34",
                    "content": "I agree that a lot of people, including me, doesn’t have any trust on discord. Maybe a group on Lens protocol can be an interesting option. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/wcc",
                    "index": "38",
                    "likes": "0",
                    "time": "06/06/2022-03:24:32",
                    "content": "    system:  In carrying out these functions, OP holders may either vote their OP directly, or delegate their OP voting power to an eligible third party.   Could you elaborate more on the cutting criteria between token holders casting their vote directly and delegating to 3rd party (delegates) to vote? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.428571428571428
                },
                {
                    "author_link": "https://gov.optimism.io/u/HoTaRu13aa",
                    "index": "39",
                    "likes": "1",
                    "time": "06/06/2022-14:15:31",
                    "content": "I wish Op Citizen will be  focus on to build a long term Op goverance. This L2 project have potential to set future L2 chain . ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.916666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "40",
                    "likes": "4",
                    "time": "06/06/2022-19:23:31",
                    "content": "if you delegate to yourself, you will need to vote on proposals and if you delegate your token to someone, you are trusting that person to vote on your behalf. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving informative feedback on proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/OkCozyNow2",
                    "index": "41",
                    "likes": "0",
                    "time": "07/06/2022-00:43:09",
                    "content": "Prob jumping the gun a bit but test proposals on snapshot not recognizing op balance, but i haven’t checked if i was in positive op balance at block 9,279,118 ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.136363636363637
                },
                {
                    "author_link": "https://gov.optimism.io/u/fenga",
                    "index": "42",
                    "likes": "0",
                    "time": "07/06/2022-00:54:31",
                    "content": "yes i support this project i think its nice ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Defi_LATAM_axlvaz",
                    "index": "43",
                    "likes": "0",
                    "time": "07/06/2022-02:53:14",
                    "content": "At Defi LATAM we set up a mirror of Optimism in Spanish, where we translate all the important information for the Spanish-speaking public. This is the translation of the Operations Manual (v0.1.2), we will update it as it is updated. In the mirror there are also translations of other articles.    mirror.xyz    Manual Operativo del Optimism Collective (v.0.1.2) Este documento describe el proceso actual de las propuestas de gobernanza del Optimism Collective. Evolucionará, junto al Collective, con el tiempo.      ",
                    "links": [
                        "https://mirror.xyz/0x3e4865634EC54dFF742E1a7452a456919B8e277b/fHdwsA6ghDwoCnvUQalN2uQhYpk3oN0bOHWp82hAdhg",
                        "https://mirror.xyz/0x3e4865634EC54dFF742E1a7452a456919B8e277b/fHdwsA6ghDwoCnvUQalN2uQhYpk3oN0bOHWp82hAdhg"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party auditing and reviewing proposal",
                        "None"
                    ],
                    "Sentiment": 5.2749999999999995
                },
                {
                    "author_link": "https://gov.optimism.io/u/homelukai",
                    "index": "44",
                    "likes": "0",
                    "time": "07/06/2022-06:26:12",
                    "content": "Thank yo for fully detailes much appreciated for this manual ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/bobby",
                    "index": "45",
                    "likes": "3",
                    "time": "08/06/2022-01:15:07",
                    "content": "Thanks for flagging. The Operating Manual has been updated to v0.1.2, and the version hosted on our docs (Governance Overview | Optimism Docs) now points to the canonical version on GitHub (OPerating-manual/manual.md at main · ethereum-optimism/OPerating-manual · GitHub) ",
                    "links": [
                        "https://github.com/ethereum-optimism/OPerating-manual/blob/main/manual.md"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.916666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/iyoine",
                    "index": "46",
                    "likes": "0",
                    "time": "08/06/2022-23:57:06",
                    "content": "its so good. It’s the first step in clarifying governance. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.375
                },
                {
                    "author_link": "https://gov.optimism.io/u/MAMI",
                    "index": "47",
                    "likes": "0",
                    "time": "09/06/2022-02:03:25",
                    "content": "That’s good. I’m interested. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.375
                },
                {
                    "author_link": "https://gov.optimism.io/u/Playdao2",
                    "index": "48",
                    "likes": "0",
                    "time": "09/06/2022-06:30:19",
                    "content": "    system:  OPerating Manual   Sooo many OP related puns we can go with here, i’m OPen to this governance model ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/Xspaceq3",
                    "index": "49",
                    "likes": "0",
                    "time": "09/06/2022-14:38:59",
                    "content": "I feel excited:) When will the Foundation start snapshot vote for every proposal? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.1875
                },
                {
                    "author_link": "https://gov.optimism.io/u/mgsre1999",
                    "index": "50",
                    "likes": "0",
                    "time": "09/06/2022-15:44:21",
                    "content": "happy to be a part of optimism family. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/gfhfh96832127",
                    "index": "51",
                    "likes": "0",
                    "time": "11/06/2022-16:07:40",
                    "content": "established procedure maual make op governance more structural ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/Vad",
                    "index": "52",
                    "likes": "0",
                    "time": "26/06/2022-19:54:44",
                    "content": "if i delegated my voting power, can i still vote? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/HaOm",
                    "index": "53",
                    "likes": "1",
                    "time": "26/06/2022-20:39:29",
                    "content": "Congrats on delegating! No, unfortunately. Once you entrust your vote, it’s in the trusted hands of your representative.    dictionary.cambridge.org    delegate 1. a person chosen or elected by a group to speak, vote, etc. for them…      You can always change your delegation at any time. That includes delegating yourself if you wish. ",
                    "links": [
                        "https://dictionary.cambridge.org/dictionary/english/delegate"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/DanieleSalatti",
                    "index": "54",
                    "likes": "1",
                    "time": "01/07/2022-20:12:06",
                    "content": "    Vad:  if i delegated my voting power, can i still vote?   No, you need to re-delegate to yourself. You can do that here: https://delegation.tools ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/thesleeper",
                    "index": "55",
                    "likes": "0",
                    "time": "02/07/2022-17:31:23",
                    "content": "snapshot is a good tool honestly this forum is very bad UX ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6499999999999995
                },
                {
                    "author_link": "https://gov.optimism.io/u/mteoptimism",
                    "index": "56",
                    "likes": "0",
                    "time": "20/07/2022-13:50:47",
                    "content": "Great piece of information. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Veyny",
                    "index": "57",
                    "likes": "0",
                    "time": "26/07/2022-02:44:47",
                    "content": "Good, interesting thing, stay optimistic ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/0x_Sam",
                    "index": "58",
                    "likes": "1",
                    "time": "29/07/2022-11:10:54",
                    "content": "Could you elaborate more? Would love to know what community’s forum has a better UX so we can continue to improve here ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/EL_PASO",
                    "index": "59",
                    "likes": "0",
                    "time": "01/08/2022-19:38:11",
                    "content": "I like this model, and I’m supporting! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5625
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "60",
                    "likes": "0",
                    "time": "25/08/2022-20:47:40",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        },
        {
            "thread_link": "https://gov.optimism.io/t/operating-manual-of-the-optimism-collective-v0-2-0/3370",
            "title": "Operating Manual of the Optimism Collective (v0.2.0) ",
            "index": 3370,
            "category": [
                "\\xf0\\x9f\\x8f\\x9b Governance"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "1",
                    "likes": "7",
                    "time": "25/08/2022-20:48:41",
                    "content": "This document describes the current governance proposal process of the Optimism Collective. It will evolve, with the Collective, over time. The authoritative version is maintained here on the Optimism Foundation Github.  Operating Manual v0.2.0: The Token House and OP Holders  Governance in the Optimism Collective begins with the launch of the Token House and its members, the OP holders. As Token House members, OP holders are responsible for submitting, deliberating, and voting on various types of Optimism Collective governance proposals. In carrying out these functions, OP holders may either vote their OP directly (by delegating their OP voting power to their own address), or delegate their OP voting power to an eligible third party. Addresses with delegated OP voting power are called “delegates.” Delegates are expected to exercise their authority responsibly and in accordance with community standards. The Token House is just the first part of the Optimism Collective governance structure. Launch of the Citizens’ House will soon follow and this Operating Manual will be updated accordingly.  Governance Toolkit  The primary tools for Optimism Collective governance are:   Snapshot: Where all Token House governance proposals are submitted for vote.  The Optimism Forum: A platform for discussion and deliberation about governance proposals.  Discord: For informal governance discussion and feedback.   Proposal Process  The Optimism Collective makes decisions through governance proposals. Proposals are accepted or rejected using a voting process. Anyone can submit a proposal to Optimism governance. The proposal must be one of the valid proposal types listed below, and it must follow the voting process described here.  Voting Process  The proposal Voting Cycle takes place in three one-week stages. Each “week” runs from Wednesday at 19:00p GMT (12p PST) until Tuesday at 19:00 GMT (12p PST).  Week 1: Community feedback ([Draft])  In the first week, draft proposals are open for review by anyone in the Optimism community as a form of temperature check. Proposal authors are expected to be responsive to community feedback and use this period of time to prepare their proposal for more formal review. Proposals should be:  Submitted as a new discussion thread on the Governance Forum in the appropriate category. Marked with [Draft] in the title.  Once posted on the form create a discussion thread in the Optimism Discord in the #gov-temp-check channel. To create a thread simply click the “+ Post” button and fill in your name, your projects name, and the link to your draft proposal. For a proposal to proceed to Week 2 (delegate feedback), the author must update [Draft] to [Review] by Tuesday at 19:00 GMT (12:00p PST). Authors should also include a summary of incorporated feedback as a comment on their proposal thread so future reviewers can understand the proposal’s progress. If feedback was gathered outside of the Forum (e.g. on Discord), proposal authors should include relevant links.  Week 2: Delegate feedback ([Review])  In the second week, Token House delegates are expected to provide feedback on proposals that (a) meet the requirements outlined in the proposal template, and (b) that have received feedback from the temperature check. Proposal authors are expected to engage in good faith and update their proposal based on what they believe makes sense for their project and the Optimism community. At the start of the Review Week, a governance administrator will create a Voting Cycle Roundup thread to collect all proposals that are ready for voting in Week 3. For a proposal to proceed to Week 3 (voting), two delegates with >0.5% of the current votable token supply must give explicit approval on the discussion thread. Delegates may not approve their own proposals. Delegates may signal approval by pasting the comment on the proposal discussion thread: ”I am an Optimism delegate [link to your delegate commitment] with sufficient voting power and I believe this proposal is ready to move to a vote.\" After a proposal has received two delegate approvals, the proposal author should add a link to their proposal in the Voting Cycle Roundup thread. If a proposal author does not get explicit delegate approval or wants more time for feedback, they should return the proposal to the [Draft] stage and continue to seek feedback from the community.  Week 3: Voting  In the third week, all delegates (including OP token holders who have self-delegated) are invited to vote on proposals on Snapshot. Proposals will be included in Snapshot only if they are (a) added to the Voting Cycle Roundup thread, and (b) have two approval comments from two delegates with >0.5% voting power. Without explicit delegate approval, proposals will not move to a Snapshot vote. A Token House governance proposal is approved if it satisfies the following minimum vote thresholds:   Quorum: The minimum number of total OP votes required to be cast in connection with a proposal. Here, a quorum is measured as a % of the total votable OP supply. “Votable supply” is the total amount of OP that has been delegated, and therefore can participate in voting. The total votable OP supply will be determined based on a reasonable estimate provided by the Optimism Foundation prior to each Voting Cycle. OP votable supply will be included in each Voting Roundup Thread.  Approval threshold: The minimum number of OP votes required to be cast in favor of approving a proposal. The approval threshold for each proposal is measured as % of votes cast to approve relative to the total number of votes cast in connection with a proposal.  A snapshot to determine voting power for each delegate will be taken at the commencement of a given voting period. Depending on the Proposal Type, exact quorum and approval threshold requirements may vary. For more information, refer to the proposal types below. If a proposal is submitted for a vote and does not pass, the proposal will not be executed. If a proposal author wishes to iterate on a proposal that has been rejected, they should:  Create a new proposal thread on the Forum. Include a link to the first proposal that did not pass. Clearly identify what has changed in the new proposal.   Valid Proposal Types  All v0.2 governance proposals must fall within one of the following categories:  Governance Fund (Phase 0 or Phase 1) Protocol Upgrade Inflation Adjustment Director Removal Treasury Appropriations Rights Protections  The different requirements for submission and approval of each Proposal Type are summarized below. In the table below, Quorum is the minimum % of votable OP supply actually voted. Approval Threshold is the minimum % of votes cast to approve relative to total votes cast.     Proposal Type Description Submission Requirements Vote Duration Quorum Approval Threshold     Governance Fund (Phase 1) OP distributions to proactively incentivize future growth of projects and communities in the Optimism ecosystem. Proposals should follow this template. Forum + Snapshot one three-week cycle 30% 51%   Protocol Upgrade Scheduled changes to the on-chain smart contracts comprising the mainnet Optimism protocol Snapshot three-week cycle plus two week extended vote window 30% 76%   Inflation Adjustment Changes to the inflation rate of newly minted OP (currently capped at 2% annually) Snapshot three-week cycle plus two week extended vote window 30% 76%   Director Removal Removal of a director of the Optimism Foundation Snapshot three-week cycle plus two week extended vote window 30% 76%   Treasury Appropriations The amount of OP the Optimism Foundation may spend or distribute annually, beginning in Year 2 of its existence (the Year 1 budget is 30% of the initial total OP supply) Proposals to be initiated by the Foundation three-week cycle plus two week extended vote window 30% 51%   Rights Protections OP holders must consent to any changes to the founding documents of the Optimism Foundation, if those changes would materially reduce their rights Proposals to be initiated by the Foundation three-week cycle plus two week extended vote window 30% 51%     Implementation and Administration  In all cases, Optimism Collective governance is intended to be carried out consistent with the terms of its Working Constitution, the spirit of its Contributor Code of Conduct and upcoming Delegate Code of Conduct, and the pursuit of its Optimistic Vision. The Optimism Foundation will steward this process as described below. Administration The Optimism Foundation will facilitate the administration of the governance procedures described in this Operating Manual with the aim of ensuring that OP holders may participate thoughtfully in Token House governance. Such administrative services may include:  Moderation of governance proposals to ensure they are validly submitted and voted upon; Removal of proposals that reasonably appear to be fraudulent, spam-oriented, defamatory, hateful, or otherwise inappropriate or inconsistent with the values of the Collective; Monitoring of votes, the votable token supply, and voting periods for purposes of determining whether quorums and approval thresholds are met; Management of mutually contradictory proposals that are submitted simultaneously or in close proximity to one another; Administration of network maintenance, such as emergency bug fixes or release rollbacks (with or without a governance vote); and Such other things as the Foundation deems appropriate in connection with the above.  Implementation Approved Token House governance proposals will be routed to the Optimism Foundation for implementation. Upon receipt of an approved proposal, the Optimism Foundation will determine whether the proposal is safe, secure, consistent with the purposes of the Foundation and the Collective, and capable of being implemented in a legally compliant manner.  If it is, the Foundation will act diligently and in a commercially reasonable manner to cause the proposal to be implemented. If it is not, the Foundation may remove the proposal for resubmission or cause the proposal to be implemented with certain guardrails, in its discretion, and coupled with an explanation to the Collective as to why the proposal was rejected or limited.  The Optimism Foundation will undertake this ministerial work with a view towards increasingly decentralizing its role over time.  Amendments  The procedures described in this Operating Manual will go into effect as releases are published on GitHub. Major releases to the manual will be made in connection with a series of governance experiments (“Seasons”). These changes include but are not limited to introducing the Citizens’ House, and adding, removing, and modifying Proposal Types and rules relating to voting processes. Any non-clerical updates to the Operating Manual will be reflected with a new version number at the top of this document, at which point the updated version will go into effect.  Process TLDR  Optimism has a three-week proposal review cycle. When you’re ready, draft a proposal and post it on the Forum with [Draft] in the title for feedback from the community. Remember to post your proposal in the #gov-temp-check channel on Discord to get community feedback. When you’re ready for formal review from Token House delegates, update [Draft] to [Review]. You are expected to have made an effort to get community feedback before submitting for formal review. During the next Review Week (every three weeks), delegates will provide feedback on your proposal. Use your judgment to incorporate feedback. Once your proposal has been approved for a vote by two delegates with >0.5% of voting supply, you may add a link to your proposal to the Voting Cycle Roundup thread. The proposal will be automatically added to Snapshot during the next one-week voting window. If your proposal is passed, the Optimism Foundation will facilitate its administration, including by distributing any approved OP grants. Note the Foundation may be in touch to collect additional information from your project in order to execute the grant. If your proposal fails, you can make a new proposal in the next cycle specifying how you have incorporated significant changes from your first proposal.  ",
                    "links": [
                        "https://community.optimism.io/docs/governance/",
                        "https://snapshot.org/#/opcollective.eth",
                        "http://gov.optimism.io/",
                        "https://discord-gateway.optimism.io/",
                        "http://gov.optimism.io/",
                        "https://discord-gateway.optimism.io/",
                        "https://gov.optimism.io/t/delegate-commitments/235",
                        "https://gov.optimism.io/t/grant-proposal-template/3233",
                        "https://gov.optimism.io/t/working-constitution-of-the-optimism-collective/55",
                        "https://gov.optimism.io/t/code-of-conduct/5/3",
                        "https://www.optimism.io/vision",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/4",
                        "https://gov.optimism.io/t/ready-gf-phase-1-pink-paper-decentralized-publishing-platform/3275/11",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-angle/2552/17",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/19",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/13",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/15",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-symphony-finance/3694/58",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/16",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/21",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/26",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/22",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/23",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/17",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/25",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/29",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/30",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/32",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/24",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/8",
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-curve/3089/61",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/28",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/5",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-tarot/3002/48",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/7",
                        "https://gov.optimism.io/t/review-gf-phase-1-proposal-otterspace/3445/5",
                        "https://gov.optimism.io/t/review-gf-phase-1-interest-protocol-development-deployment-to-optimism/2951/7",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/9",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/12",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/11",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/27",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/14"
                    ],
                    "GPT-summary": "The post is an operating manual for the governance proposal process of the Optimism Collective. It explains the Token House and OP holders' roles in submitting, deliberating, and voting on various types of governance proposals. The post also outlines the proposal process, including the three-week proposal review cycle and the voting process. The post provides information on the different types of proposals and their requirements for submission and approval. The post also mentions the Optimism Foundation's role in facilitating the administration of the governance procedures.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.674370272584558
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "2",
                    "likes": "0",
                    "time": "25/08/2022-20:51:15",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Niki",
                    "index": "3",
                    "likes": "2",
                    "time": "27/08/2022-14:32:39",
                    "content": "Anything about citizen house? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/berkery",
                    "index": "4",
                    "likes": "0",
                    "time": "29/08/2022-08:17:16",
                    "content": "Stay optimistic and go far ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/diligit",
                    "index": "5",
                    "likes": "3",
                    "time": "30/08/2022-18:48:48",
                    "content": "It is necessary to specify in the Operating Manual whether ‘Abstain’ votes are included in the quorum. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/dogstartaylor",
                    "index": "6",
                    "likes": "0",
                    "time": "31/08/2022-02:57:25",
                    "content": "I like this Operating manual but will this be voted on by the Collective?  Also what about a failed proposal? How many times can they keep resubmitting it? Until it finally gets approved? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/britt",
                    "index": "7",
                    "likes": "0",
                    "time": "01/09/2022-18:42:24",
                    "content": "The template linked in the first row of the table is not updated to the new template. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.965909090909091
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "8",
                    "likes": "0",
                    "time": "29/09/2022-19:31:42",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "9",
                    "likes": "0",
                    "time": "29/09/2022-19:31:49",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        },
        {
            "thread_link": "https://gov.optimism.io/t/operating-manual-of-the-optimism-collective-v0-2-1/3587",
            "title": "Operating Manual of the Optimism Collective v0.2.1 ",
            "index": 3587,
            "category": [
                "\\xf0\\x9f\\x93\\x8c Policies and Templates"
            ],
            "tags": [
                "season-2"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "1",
                    "likes": "25",
                    "time": "29/09/2022-19:30:31",
                    "content": "This document describes the current governance proposal process of the Optimism Collective. It will evolve, with the Collective, over time. The authoritative version is maintained here on the Optimism Foundation Github.  Operating Manual v0.2.1: The Token House and OP Holders  Governance in the Optimism Collective begins with the launch of the Token House and its members, the OP holders. As Token House members, OP holders are responsible for submitting, deliberating, and voting on various types of Optimism Collective governance proposals. In carrying out these functions, OP holders may either vote their OP directly (by delegating their OP voting power to their own address), or delegate their OP voting power to an eligible third party. Addresses with delegated OP voting power are called “delegates.” Delegates are expected to exercise their authority responsibly and in accordance with community standards. The Token House is just the first part of the Optimism Collective governance structure. Launch of the Citizens’ House will soon follow and this Operating Manual will be updated accordingly.  Governance Toolkit  The primary tools for Optimism Collective governance are:   Snapshot: Where all Token House governance proposals are submitted for vote.  The Optimism Forum: A platform for discussion and deliberation about governance proposals.  Discord: For informal governance discussion and feedback.   Proposal Process  The Optimism Collective makes decisions through governance proposals. Proposals are accepted or rejected using a voting process. Anyone can submit a proposal to Optimism governance. The proposal must be one of the valid proposal types listed below, and it must follow the voting process described here.  Voting Process  The proposal Voting Cycle takes place in three one-week stages. Each “week” runs from Thursday at 19:00 GMT (12p PST) until Wednesday at 19:00 GMT (12p PST).  Week 1: Community and Delegate Feedback ([Draft])  In the first week, draft proposals are open for review by anyone in the Optimism community as a form of temperature check. Proposal authors are expected to be responsive to community and delegate feedback and use this period of time to prepare their proposal for committee review. Proposals should be:  Submitted as a new discussion thread on the Governance Forum in the appropriate category. Marked with [Draft] in the title.  Once posted on the form create a discussion thread in the Optimism Discord in the #gov-temp-check channel. To create a thread simply click the “+ Post” button and fill in your name, your projects name, and the link to your draft proposal. At the start of the Week 1, a governance administrator will create a Voting Cycle Roundup thread in the forum to collect all proposals that meet the requirements for committee review in Week 2. For a proposal to proceed to Week 2 (committee review), two delegates with >0.5% of the current votable token supply must give explicit approval on the discussion thread. Delegates may not approve their own proposals. Delegates may signal approval by pasting the following comment on the proposal discussion thread: ”I am an Optimism delegate [link to your delegate commitment] with sufficient voting power and I believe this proposal is ready to move to a vote.\" If a committee member approves a proposal to move to a vote, it is not an endorsement of that proposal by the associated committee. It simply signifies that the proposal should move to the next stage of the cycle. After a proposal has received two delegate approvals, the proposal author should update the proposal title from [Draft] to [Review] and add a link to their proposal in the Voting Cycle Roundup thread by the last day of Week 1 at 19:00 GMT (12:00p PST). Authors should also include a summary of incorporated feedback as a comment on their proposal thread so future reviewers can understand the proposal’s progress. If feedback was gathered outside of the Forum (e.g. on Discord), proposal authors should include relevant links. If a proposal author does not get explicit delegate approval or wants more time for feedback, they should continue to seek feedback from the community and submit an updated proposal in the next voting cycle.  Week 2: Committee Review ([Review])  In the second week, committees will review all approved proposals listed on the Voting Cycle Roundup thread and publicly post their recommendations before the last day of Week 2 at 19:00 GMT (12:00p PST).  Week 3: Voting  In the third week, all delegates (including OP token holders who have self-delegated) are invited to vote on proposals on Snapshot. Proposals will be included in Snapshot only if they were (a) added to the Voting Cycle Roundup thread before the deadline, and (b) have two approval comments from two delegates with >0.5% voting power. Without explicit delegate approval, proposals will not move to a Snapshot vote. A Token House governance proposal is approved if it satisfies the following minimum vote thresholds:   Quorum: The minimum number of total OP votes required to be cast in connection with a proposal. Here, a quorum is measured as a % of the total votable OP supply. “Votable supply” is the total amount of OP that has been delegated, and therefore can participate in voting. The total votable OP supply will be determined based on a reasonable estimate provided by the Optimism Foundation prior to each Voting Cycle. OP votable supply will be included in each Voting Roundup Thread.  Approval threshold: The minimum number of OP votes required to be cast in favor of approving a proposal. The approval threshold for each proposal is measured as % of votes cast to approve relative to the total number of votes cast in connection with a proposal.  A snapshot to determine voting power for each delegate will be taken at the commencement of a given voting period, and voting will be hosted on the Optimism Collective Snapshot page. Depending on the Proposal Type, exact quorum and approval threshold requirements may vary. For more information, refer to the proposal types below. If a proposal is submitted for a vote and does not pass, the proposal will not be executed. If a proposal author wishes to iterate on a proposal that has been rejected, they should:  Create a new proposal thread on the Forum. Include a link to the first proposal that did not pass. Clearly identify what has changed in the new proposal.   Valid Proposal Types  All v0.2 governance proposals must fall within one of the following categories:  Governance Fund (Phase 0 or Phase 1) Protocol Upgrade Inflation Adjustment Director Removal Treasury Appropriations Rights Protections  The different requirements for submission and approval of each Proposal Type are summarized below. In the table below, Quorum is the minimum % of votable OP supply actually voted. Approval Threshold is the minimum % of votes cast to approve relative to total votes cast.     Proposal Type Description Submission Requirements Vote Duration Quorum Approval Threshold     Governance Fund (Phase 1) OP distributions to proactively incentivize future growth of projects and communities in the Optimism ecosystem. Proposals should follow this template. Forum + Snapshot one three-week cycle 30% 51%   Protocol Upgrade Scheduled changes to the on-chain smart contracts comprising the mainnet Optimism protocol Snapshot three-week cycle plus two week extended vote window 30% 76%   Inflation Adjustment Changes to the inflation rate of newly minted OP (currently capped at 2% annually) Snapshot three-week cycle plus two week extended vote window 30% 76%   Director Removal Removal of a director of the Optimism Foundation Snapshot three-week cycle plus two week extended vote window 30% 76%   Treasury Appropriations The amount of OP the Optimism Foundation may spend or distribute annually, beginning in Year 2 of its existence (the Year 1 budget is 30% of the initial total OP supply) Proposals to be initiated by the Foundation three-week cycle plus two week extended vote window 30% 51%   Rights Protections OP holders must consent to any changes to the founding documents of the Optimism Foundation, if those changes would materially reduce their rights Proposals to be initiated by the Foundation three-week cycle plus two week extended vote window 30% 51%     Implementation and Administration  In all cases, Optimism Collective governance is intended to be carried out consistent with the terms of its Working Constitution, the spirit of its Contributor Code of Conduct and upcoming Delegate Code of Conduct, and the pursuit of its Optimistic Vision. The Optimism Foundation will steward this process as described below. Administration The Optimism Foundation will facilitate the administration of the governance procedures described in this Operating Manual with the aim of ensuring that OP holders may participate thoughtfully in Token House governance. Such administrative services may include:  Moderation of governance proposals to ensure they are validly submitted and voted upon; Removal of proposals that reasonably appear to be fraudulent, spam-oriented, defamatory, hateful, or otherwise inappropriate or inconsistent with the values of the Collective; Monitoring of votes, voting power, the votable token supply, and voting periods for purposes of determining whether quorums and approval thresholds are met or accurately reflected. In the event of bugs in the Snapshot tool, the Foundation may manually count votes and override the results of a Snapshot vote – however, it will only do so where the the expected, bug-free outcome is unambiguous (for example, votes that are verifiable on-chain, but which did not propagate to the off-chain Snapshot tool); Management of mutually contradictory proposals that are submitted simultaneously or in close proximity to one another; Administration of network maintenance, such as emergency bug fixes or release rollbacks (with or without a governance vote); and Such other things as the Foundation deems appropriate in connection with the above.  Implementation Approved Token House governance proposals will be routed to the Optimism Foundation for implementation. Upon receipt of an approved proposal, the Optimism Foundation will determine whether the proposal is safe, secure, consistent with the purposes of the Foundation and the Collective, and capable of being implemented in a legally compliant manner.  If it is, the Foundation will act diligently and in a commercially reasonable manner to cause the proposal to be implemented. If it is not, the Foundation may remove the proposal for resubmission or cause the proposal to be implemented with certain guardrails, in its discretion, and coupled with an explanation to the Collective as to why the proposal was rejected or limited.  The Optimism Foundation will undertake this ministerial work with a view towards increasingly decentralizing its role over time.  Amendments  The procedures described in this Operating Manual will go into effect as releases are published on GitHub. Major releases to the manual will be made in connection with a series of governance experiments (“Seasons”). These changes include but are not limited to introducing the Citizens’ House, and adding, removing, and modifying Proposal Types and rules relating to voting processes. Any non-clerical updates to the Operating Manual will be reflected with a new version number at the top of this document, at which point the updated version will go into effect.  Process TLDR  Optimism has a three-week proposal review cycle. When you’re ready, draft a proposal and post it on the Forum with [Draft] in the title for feedback from the community and delegates. Remember to post your proposal in the #gov-temp-check channel on Discord to get community feedback. Delegates will also provide feedback on your proposal in the forum. Use your judgment to incorporate feedback. Once your proposal has been approved by two delegates with >0.5% of voting supply, add a link to your proposal to the Voting Cycle Roundup thread by the last day of Week 1 and update the title from [Draft] to [Review]. These proposals will move on to Week 2: Committee Review. Committees will provide recommendations on proposals by the last day of Week 2. These proposals will be automatically added to Snapshot during the next one-week voting window. If your proposal is passed, the Optimism Foundation will facilitate its administration, including by distributing any approved OP grants. Note the Foundation may be in touch to collect additional information from your project in order to execute the grant. If your proposal fails, you can make a new proposal in the next cycle specifying how you have incorporated significant changes from your first proposal.  ",
                    "links": [
                        "https://community.optimism.io/docs/governance/",
                        "https://snapshot.org/#/opcollective.eth",
                        "http://gov.optimism.io/",
                        "https://discord-gateway.optimism.io/",
                        "http://gov.optimism.io/",
                        "https://discord-gateway.optimism.io/",
                        "https://gov.optimism.io/t/delegate-commitments/235",
                        "https://snapshot.org/#/opcollective.eth",
                        "https://gov.optimism.io/t/governance-fund-phase-1-how-to-create-a-proposal/216",
                        "https://gov.optimism.io/t/working-constitution-of-the-optimism-collective/55",
                        "https://gov.optimism.io/t/code-of-conduct/5/3",
                        "https://www.optimism.io/vision",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/10",
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-messari/3739/42"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5933441558441555
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "2",
                    "likes": "12",
                    "time": "29/09/2022-19:31:20",
                    "content": " This is a minor version change to v0.2.0 of the Operating Manual which:  Adds clarification that delegate approval for a proposal to move to voting stage is not an endorsement of that proposal. Updates voting cycle to better incorporate committee operations Updates tl;dr section to reflect the above change Clarifies when Foundation may include uncounted Snapshot votes in final tally   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5625
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "3",
                    "likes": "0",
                    "time": "29/09/2022-19:32:01",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "4",
                    "likes": "0",
                    "time": "19/01/2023-16:52:32",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/PieterKlaas",
                    "index": "5",
                    "likes": "2",
                    "time": "30/01/2023-16:49:35",
                    "content": "Very usefull. and insightfull do not change a thing. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                }
            ]
        }
    ],
    "group_index": "163"
}