{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/seed-latam-delegate-communication-thread/2950",
            "title": "SEED LATAM - Delegate Communication Thread ",
            "index": 2950,
            "category": [
                "\\xf0\\x9f\\x8f\\x9b Governance",
                "Delegate Updates"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/SEED_LATAM_Joxes",
                    "index": "1",
                    "likes": "15",
                    "time": "11/07/2022-04:14:12",
                    "content": "Following @GFXlabs and @OPUser initiatives, this is our thread with all our relevant decisions and participation in OP governance. Presentation DeFi LATAM is a spanish speaker community for the Web3 & crypto ecosystem, focused on education and adoption of users in Latin America under the values of decentralization and towards the future of internet. We detect the potential of Ethereum’s scaling solutions for our region and for this reason we have decided to be a representative voice of the ideas and interests of this increasingly growing community in this part of the world. Read our full presentation in Delegate Commitments thread here. Delegate joxes.defilatam.eth Our procedure With the help of numerous contributors and member of DeFi LATAM and Optimism Español, every decision made on behalf of DeFi LATAM in governance is discussed, agreed upon and communicated to all those interested in participating through our discussion channels on Discord: DeFi LATAM>Gobernanza>Optimism-op. Participation in the forum’s discussion threads in daily activities are own opinions of the delegate and contributors in their way to keep up with their roles and commitment to the governance; use of “we” or “us” shall apply when representing decisions or communications arising from the community, such as voting decisions and proposal submissions, all through this profile.  Special thanks to PEPO, Cryptochica, our contributors @Defi_LATAM_axlvaz, @NicoEsp, @Netrim, @994.eth, all our community and people from Latin America who support us! ",
                    "links": [
                        "https://gov.optimism.io/t/delegate-commitments/235/27",
                        "https://comunidad.defilatam.com",
                        "https://gov.optimism.io/t/grant-council-reviewer-nominations/4372/7",
                        "https://gov.optimism.io/t/education-nominations-for-rpgf2/4640/148",
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-karma-discourse-forum-plugin/3412",
                        "https://gov.optimism.io/t/draft-s02-committee-proposal-tooling-governance-committee/3333"
                    ],
                    "GPT-summary": "The post is an advertisement for DeFi LATAM, a Spanish-speaking community focused on education and adoption of users in Latin America for the Web3 & crypto ecosystem. The post explains their decision-making process and communication channels for participating in governance. They also express their gratitude towards their contributors and supporters.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "3rd party or author is advertising proposal",
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.848901098901099
                },
                {
                    "author_link": "https://gov.optimism.io/u/SEED_LATAM_Joxes",
                    "index": "2",
                    "likes": "9",
                    "time": "11/07/2022-15:01:50",
                    "content": "Past actions. Governance Fund Phase 0 voting decisions:   Proposal A - Batch Vote: For. Reasons: we are ok supporting this proposal to start encouraging the growth of the optimism ecosystem. While we don’t agree with the vote taking place in a single batch, there is no reason to reject it among the 24 listed proposals included here.  Proposal B - Uniswap: Against. Reasons: did not follow the guidelines.  Proposal C - 0x: Against. Reasons: did not follow the guidelines.  Governance Fund Phase 1 voting decisions:   Proposal A: Optimistic Railway: No Reasons: in a very early stage, without clarity of what kind of positive impact it can have on the ecosystem.  Proposal B: dForce: Yes Reasons: protocol of the first to deploy in Optimism. Acceptable proposal and detailed.  Proposal C: GYSR: No Reasons: Amount higher than its potential use case. No clear strategy.  Proposal D: Mean Finance: Yes Reasons: a one-of-a-kind protocol. Reasonable distribution. This project is well known and supported in our region.  Proposal E: Raptor: No Reasons: does not apply to this phase.  Proposal F: Balancer & BeethovenX: Yes Reasons: reasonable proposal in general terms, it seems positive to us.  Proposal G: Summa: No Reasons: it doesn’t make sense at this stage, they ask for an excessive amount of tokens.  Proposal H: WardenSwap: No Reasons: DEX aggregator. Not very interesting proposal. It would be good to see the deployment first to judge better.  Proposal I: Pickle Finance: Yes Reasons: known team and protocol, reasonable proposal.  Proposal J: Ooki Protocol: No Reasons: excessive amount for the protocol use case (see metrics in other chains). Author does not ensure co-incentives.  Proposal K: Infinity Wallet: Abstain Reasons: difficult to evaluate, we leave it to the rest of the voters to establish their criteria.  Proposal L: Beefy: No Reasons: excessive amount according to distribution. Not deployed at the time of decision.  Proposal M: 0xHabitat: No Reasons: from our perspective they should finish defining ideas and deploying in Optimism. Happy to re-evaluate later.  Proposal N: Thales: No Reasons: this project received funding from Phase 0. Distribution has not started yet. It’s counterproductive to approve new funds without evaluating the use of previous funds.  Proposal O: Paraswap: Yes Reasons: reasonable proposal.  Proposal P: Roki: Yes Reasons: well detailed proposal, interesting use case. Reasonable.  Proposal Q: Candide: Yes Reasons: wallet focused on Rollups, with innovative features. Experimental proposal.  Other actions:   Proposal: Pause Phase 1 and start a discussion round to improve the governance process. Small improvements on Incentive Proposal Template for Phase 1.  1st Governance Call at DeFi LATAM (6th July) Several spaces, calls and on-line meetups (together with Optimism Español) in at differents spanish-speaker communities to talk about Optimism: scalability properties, vision and its governance.  ",
                    "links": [
                        "https://gov.optimism.io/t/governance-fund-phase-1-how-to-create-a-proposal/216"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.592619781012638
                },
                {
                    "author_link": "https://gov.optimism.io/u/SEED_LATAM_Joxes",
                    "index": "3",
                    "likes": "3",
                    "time": "14/07/2022-01:15:18",
                    "content": "In an effort made by community members, we have made a proposal to improve significatly the phase 1 templates: Update of the PHASE 1 protocol nomination template. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/SEED_LATAM_Joxes",
                    "index": "4",
                    "likes": "5",
                    "time": "19/07/2022-03:36:39",
                    "content": "Today our 2nd Governance Call was held after a past week as timeframe to discuss the proposals of cycle #3. In this call we settled our discussions and vote as a community. The results can be found below with details and our feedbacks following the links:  Proposal A: Superfluid: Yes.  Proposal B: Kromatika: No.  Proposal C: Hundred Finance: No.  Proposal D: Biconomy: Yes.  Proposal E: Dope Wars: No.  Proposal F: Infinity Wallet: No.  Proposal G: DexGuru: No.  Proposal H: Overnightfi: No.  Proposal I: Saddle Finance: No.   Despite significant negative votes, we believe that our feedback and that of other delegates and community can be useful for several proposals to be successful in passing in the next cycles. ",
                    "links": [
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-superfluid/2314/50",
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-kromatika/2650/48",
                        "https://gov.optimism.io/t/ready-gf-phase-1-hundred-finance/2733/27",
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-biconomy/2880/26",
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-dope-wars/2722/110",
                        "https://gov.optimism.io/t/ready-gf-phase-1-cycle-3-proposal-infinity-wallet/2713/95",
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-dexguru/2536/50",
                        "https://gov.optimism.io/t/ready-gf-phase-1-overnight-fi/2816/38",
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-saddle-finance/2842/45"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.375
                },
                {
                    "author_link": "https://gov.optimism.io/u/SEED_LATAM_Joxes",
                    "index": "5",
                    "likes": "4",
                    "time": "03/08/2022-04:11:08",
                    "content": "Hello all! Last friday we held the 3rd governance call on Discord to discuss the proposals for cycle 4. As in past calls, we focus on ratifying our decision as a community in the ongoing voting and also express opinions about the future of governance given the completion of Season 1. Participants: ~26 (special thanks to Pacha for the design) + various other members during discussion week. As result, our vote for cycle #4 has been as follows:  Proposal A: Rocket Pool: Yes.   Proposal B: Boardroom: Yes.   Proposal C: dHedge: No.   Proposal D: xToken Terminal and Gamma Strategies: No.   Proposal E: Byte Mason Product Suite: No.  Proposal F: GARD: No.  Proposal G: Beefy Finance: Yes.  Proposal H: BarnBridge: No.   Proposal I: QiDao: Yes.    Please click on Yes/No to read our conclusions. We commend the projects that took the time to consider the feedback from the community and delegates that led to some successful proposals passing. For the rest, keep working on the proper queries in the forum for the next cycle of Phase 1, see you in Season 2! ",
                    "links": [
                        "https://poap.gallery/event/57216",
                        "https://twitter.com/Pacha994_",
                        "https://gov.optimism.io/t/ready-gf-phase-1-rocket-pool/2822/32",
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-boardroom/2978/27",
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-dhedge/2982/42",
                        "https://gov.optimism.io/t/ready-gf-phase-1-xtoken-terminal-gamma-strategies-and-uniswap-v3-staker/3001/68",
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-byte-mason-product-suite/2887/103",
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-gard/3024/19",
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-beefy/2967/33",
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-barnbridge/2885/45",
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-qidao-protocol/2863/50",
                        "https://gov.optimism.io/t/draft-so2-committee-proposal-defi-group-c/3320"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.471726190476191
                },
                {
                    "author_link": "https://gov.optimism.io/u/SEED_LATAM_Joxes",
                    "index": "6",
                    "likes": "5",
                    "time": "18/08/2022-22:16:58",
                    "content": "Today, we have formalized our participation in the formation of Governance Committees proposed for season 2 of Optimism governance. Currently we’re part of two committees proposals as reviewers, details below:   Committee proposal: DeFi, lead by @OPUser We will be working alongside the following reviewers: Dhannte, MinimalGravitas, ScaleWeb3. We feel very comfortable with our team, as each and every one of them has had an important presence in the governance for Season 1 to have culminated with relative success. Also, we share the same values strongly aligned to Optimism itself. As expected, we will move so that the proposals make sense and everything is in accordance with alignments, proposed goals and shared values, while prioritizing long-term, genuine growth and derisk of gaming incentives. [DRAFT] S02 Committee Proposal: DeFi   Committee proposal: Tooling Governance Committee, lead by @krzkaczor We will be working alongside the following reviewers: lefterisjp, cryptotesters, ceresstation. Tooling and infrastructure is probably one of the most undervalued topics and does not necessarily directly impact the conscious interests of the end user, as it does in the DeFi category with the usual standard liquidity mining programs and other incentives. We are proud to have been able to deliver the proposal on time with a framework that we believe is an excellent starting point, considering the potential variety of proposals applying to this category and that we are ready to address as a team. [DRAFT] S02 Committee Proposal: Tooling Governance Committee    Our procedure in the current committees: As we stated in our first post, currently this delegation is performed by Joxes (myself) as a leader alongside a team made up of spanish-speaking contributors with experience in DeFi and other topics. Some members have been enormously active as @Netrim @Defi_LATAM_axlvaz @NicoEsp and other committeed to this commitment, without this having to mean any type of obstacle, but on the contrary, rapid execution of any task, and preserving our original mission as a community for Optimism governance. In the formal instances/aspects, I bear all responsibility as leader and representative of DeFi LATAM, delegate and sole owner of this account and ENS.  About our participation in two differents committees: We have absolute confidence in carrying out our work in favor of OP collective and these conditions were accepted by the rest of our committee teams. If the foundation, delegates or community strongly believe that this represents a severe problem, we can reach a resolution. However, we are pleased to contribute to making both proposals possible within the established times, and looking forward to season 2 being successful in all aspects. ",
                    "links": [
                        "https://gov.optimism.io/t/draft-s02-committee-proposal-defi/3320",
                        "https://gov.optimism.io/t/draft-s02-committee-proposal-tooling-governance-committee/3333",
                        "https://gov.optimism.io/t/draft-s02-committee-proposal-tooling-governance-committee/3333",
                        "https://gov.optimism.io/t/delegate-commitments/235/27",
                        "https://gov.optimism.io/t/draft-s02-committee-proposal-defi/3320/29"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.870382882882883
                },
                {
                    "author_link": "https://gov.optimism.io/u/SEED_LATAM_Joxes",
                    "index": "7",
                    "likes": "8",
                    "time": "07/09/2022-06:23:19",
                    "content": "Hello all! This monday we held our 4th Governance Call in Discord to discuss and decide our votes on selection of governance committees for season 2, according to Voting Cycle #5. Following our ethos and role as delegate, we carry out a decision-making process between our collaborators and the community we represent. Participants: +30 attendees (27 collected; special thanks again to Pacha for the design). Duration: 1hs 49min. In the last quarter, we had the presence of a Boardroom member, who told us about his work on the project. Below is a summary of this Governance Call: Our voting procedure After a review of each governance committee proposal received, we proceeded with the following format:  At first, we consulted the community on what should be the action of our delegation on our voting decision in the committees that we are part of (Tooling and DeFi - C). Through the discussion process we ratified the following decisions:   DeFi Committee [Group C] - we abstain Tooling & Infrastructure Committee [Group A] - we abstain   We now continue to discuss what approach we should follow regarding our voting decision in the DeFi A and DeFi B committees, considering our participation in DeFi C. We received different opinions, reaching consensus on:   DeFi Committee [Group A] - we vote for DeFi Committee [Group B] - we abstain   We finalize our voting decisions with the last NFT category committee:   NFT Committee [Group A] - we vote for  Our rational Collaborators and community are aligned with the desire to help Optimism but also ensure that the governance processes are genuine and authentic. In our case, our internal communication ensures that our community members can express their preferences and discuss until a consensus is reached. Regarding the vote for ourselves, we believe that it is not positive for the governance and leaves a bad signal with respect to the rest of the members of the governance and community who want to give their opinion and decide on our proposals. Interestingly, as a community working as such since the beginning of Optimism governance, we present a possible option of being able to choose to vote in favor of a DeFi committee that best fits the governance objectives and with a solid proposal, in an attempt to express which committee different from ours is ideal for the role. In this case, the framework shown by committee A plus its members was the preferred option, with respect to committee B, whose framework is not well seen with said system of points explained. Notably, some major contributors considered abstention for all three groups to be a better path. About the Optimism Foundation recommendation for voting for 1 or 2 committees, we take sides by voting in favor of the NFT committee as well, we truly believe that it is important for governance, and possible incursion into identity topic proposals should be ideal and critical to add experience for future iterations. Final words We are excited about the work done so far and to have the collaboration of the Optimism Español initiative to successfully carry out our entire participation process for Season 2. If you are a Spanish speaker and want to join our community, don’t forget to visit our Discord and stay tuned for future calls and updates. ",
                    "links": [
                        "https://mirror.xyz/0x3e4865634EC54dFF742E1a7452a456919B8e277b/0QDkO2_uDnhqhZx90S0veMlINYWS5pmJLDWq4b34Jjk",
                        "https://gov.optimism.io/t/delegate-commitments/235/27",
                        "https://poap.gallery/event/63728",
                        "https://comunidad.defilatam.com",
                        "https://gov.optimism.io/t/draft-so2-committee-proposal-nfts-gaming-group-a/3364/26",
                        "https://gov.optimism.io/t/s02-committee-proposal-decentralized-finance-governance-committee-group-a/3286/27",
                        "https://gov.optimism.io/t/draft-so2-committee-proposal-defi-group-c/3320/96",
                        "https://gov.optimism.io/t/draft-s02-committee-proposal-tooling-governance-committee/3333/31",
                        "https://gov.optimism.io/t/draft-s02-committee-proposal-category-defi-group-b/3318/28",
                        "https://gov.optimism.io/t/draft-so2-committee-proposal-defi-group-c/3320/74"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.959103396603397
                },
                {
                    "author_link": "https://gov.optimism.io/u/SEED_LATAM_Joxes",
                    "index": "8",
                    "likes": "11",
                    "time": "01/10/2022-03:45:56",
                    "content": "Hello again! This tuesday we had our 5th Governance Call on DeFi LATAM with the collaboration of Optimism Español to discuss the proposals of voting cycle #6. In this call we shared our experience in this first cycle of season 2 as members of the Tooling and DeFi C committees. In this call we share our experience in this first cycle of season 2 as members of the Tooling and DeFi C committees, and settle our discussions as a community on the decision-making of the current proposals, as usual. Participants: +35 (special thanks to Pacha for the design). Duration: 2h, 37min. A summary about our performance during Cycle #6 Keeping our intention to work as a group, we established an initial team (@Defi_LATAM_axlvaz, @Netrim, @Jadmat.Eth-DefiLatam) with contributors to our delegation on behalf of DeFi LATAM. First, through Joxes (me) as a direct member of the mentioned committees, we focus on organizing ourselves and dividing the tasks, doing the pertinent research and finalizing discussions in order to deliver our analyzes, follow up, and the committee to work as expected. Additionally, our members have been active in the forum addressing different proposals and other topics, which has helped a lot directly or indirectly to obtain the respective clarifications on each one and going forward. We’re really satisfied with the work done so far, and our lessons for the next cycle are quite obvious, work faster internally and have even more presence on the forum; by example, using our delegation to pass the appropriate proposals to the next snapshot round, in our own criteria. Our voting procedure Our procedure remains intact as previous Governance Calls, we encourage our members interested in Optimism to express their opinion and be an active part of the final decision-making, as a way of absorbing the expertise, criteria and preferences of all in a single voice, more beyond the views of direct contributors a Joxes. In the first place, we ratify with a YES to take into consideration and as a priority the recommendations of all the committees, being a starting point to decide how to vote on each proposal. As part of two committees, this also allowed everyone to quickly get into context where needed and discuss how it should be. As result, our vote for cycle #6 has been as follows:   Interest Protocol 2: For Following DeFi C committee recommendation, one of the highlights is the improved lending model introduced in Interest, which would be good to see in this ecosystem.   Socket: Against Following Tooling committee recommendation, we reiterate that the amount requested is seen as excessive, so we will be attentive in the next cycle to receive feedback and suggest the appropriate changes to make it favorable from the point of view of governance criteria. @khuranarishabh   OptiChads: For Following NFT & Gaming committee recommendation, we see as positive some of the intentions of the project towards Optimism. However, we’re aware that the NFT ecosystem is plagued with a lot of skepticism and some of our members expressed doubts as to whether the proposal would really add value to Optimism. In the end, we will remain “optimistic” so that this project and proposal makes sense and is fulfilled for our ecosystem. @Dicaso   Kromatika: For Following DeFi A committee recommendation, we’re pleased to know that your proposal has made the relevant changes compared to the previous cycle in season 1, where we voted against. Now the proposal was seen as reasonable.   Revert Compoundor: For Following DeFi A committee recommendation, as a community we believe that Revert has an interesting implementation to take advantage of Uniswap on behalf of LPs. The proposal was seen as seen as reasonable.   Bankless Academy v2: For Following Tooling committee recommendation, this academy is characterized by having a good reputation in the Ethereum ecosystem, additionally its added value will be potentially very beneficial for onboarding users in the globe. In particular, from DeFi LATAM we share many of these values that the Bankless community upholds and we’re pleased that communities like these are given the opportunity to promote initiatives such as the one in the proposal. The proposal itself is seen as reasonable. @Tetranome   Across Protocol: For Following Tooling committee recommendation, from the community we want to emphasize that optimistically designed bridges are of our full interest and we have closely followed teams like this throughout the year. For this reason we believe that accepting proposals like this will be positive for the diversity of bridges with acceptable safety models for the future of the Optimism ecosystem.   Tarot: Against Following DeFi A committee recommendation, the problem with this proposal is as the committee points out, we are happy that the Tarot team has already submitted a new draft based on the feedback received. @TigrisOfGaul   Otterspace: Against. Following Tooling committee recommendation, some members of DeFi LATAM community expressed their knowledge of the work of otterspace, however, the niche in which this project tries to capture deserves a review of the proposal to adjust it to the likely impact it may have if the ideas presented are implemented. We will be addressing it again for the next cycle with the corresponding feedback. @Lukas   dHEDGE DAO: Against Against the recommendation of the DeFi C committee, our community had a lengthy discussion near the close of voting and during this governance call about the impact and use of funds proposed by dHedge. Although the proposal can be seen as positive in terms of encouraging pool management and increasing its adoption, for the moment we were concerned about some points about its criteria, such as the lack of clearer parameters on which pools to benefit and under what regime. At the moment it’s specified that whitlisted pools will be supported and with their own governance procedure, of which we have observed a certain degree of centralization in decision making, so we encourage dHedge to allow its community to express itself genuinely about the pools to incentivize in Optimism. We believe that in this case the weight of conflict of interest should be avoided or clarified. Additionally, incentivizing this pool with its governance token is seen as a standard approach that doesn’t affect the evaluation of the proposal. Since the proposal has passed successfully, we encourage dHedge and its governance to have a fair criteria in favor of the users of the Optimism ecosystem when deciding which pools to incentivize. @Cyrus   We’re very happy with how the community has organized and shown interest in the future of the Optimism ecosystem and its governance. Alentamos a la comunidad hispanohablante y de latinoamérica a que se unan a nuestra travesía por el futuro de Optimism. _ ",
                    "links": [
                        "https://twitter.com/OptimismESP",
                        "https://poap.gallery/event/69617",
                        "https://twitter.com/Pacha994_",
                        "https://gov.optimism.io/t/review-gf-phase-1-interest-protocol-development-deployment-to-optimism/2951",
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-socket/3368",
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-optichads-nft-project/3430",
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-cycle-6-kromatika/3306",
                        "https://gov.optimism.io/t/ready-gf-phase-1-revert-finance-compoundor/3242",
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-bankless-academy-v2/3353",
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-across-protocol-updated-template/3401",
                        "https://gov.optimism.io/t/review-gf-phase-1-proposal-tarot/3002",
                        "https://gov.optimism.io/t/draft-gf-phase-1-voting-cycle-7-tarot/3567",
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-otterspace/3445",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-otterspace-v2/3583",
                        "https://gov.optimism.io/t/review-gf-phase-1-proposal-dhedge-v2-revised/3321"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.911363636363635
                },
                {
                    "author_link": "https://gov.optimism.io/u/TigrisOfGaul",
                    "index": "9",
                    "likes": "3",
                    "time": "02/10/2022-00:20:48",
                    "content": "Thanks for including a link to Tarot’s new proposal. It now focuses exclusively on direct incentives within Tarot, for borrowing activity (OP-based, and other Optimism pairs) and lending (OP, ETH, and USDC). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.389204545454546
                },
                {
                    "author_link": "https://gov.optimism.io/u/SEED_LATAM_Joxes",
                    "index": "10",
                    "likes": "6",
                    "time": "24/10/2022-04:57:14",
                    "content": "Hi frens! This last monday we held our 6th Governance Call in Discord to discuss about our decisions on cycle #7. We continue sharing our experience as delegates and part of governance committees. This call was made just after Devcon week. Participants: +17. Duration: 2h 12min. A summary about our performance during Cycle #7 As we said, this cycle happened during Devcon week (particularly during delegate feedback and voting weeks), in this case we work with our contributors to realize our tasks at time, but for example, some final coordination problems caused a delay at delivering all the tooling committee recommendations at time. Our voting procedure Continuing with our process explained in previous governance calls, we discussed the present proposals, ratifying once again the one taken into account by the governance committees or expressing our own rationale otherwise. As result, our vote for cycle #7 has been as follows:  Abracadabra Money: Against.  Overtime Markets: Against. Overnight dot fi: Against. Sushiswap: Against. Tarot: For. Alchemix: Against. Dope Wars: Against. Otterspace: For. Rainbow Wallet: For. Karma (Delegate Dashboard): For. Karma (Discourse forum plugin): For. Safe: For. Li Fi: For. Yearn: For.   Some notes about our presence on Ethlatam and Devcon With great joy, members of DeFi LATAM community between Optimism Español and Layer 2 en Español joined forces to have a presence all day in various stands during the Ethlatam event held on October 10 at the same venue prior to the Devcon. Also, our community participated in the following talks:   Erik Suazo “How to participate in DAO governance” disscusing about the state of Optimism Collective and how contribute. Full video here. Joxes and Axl “Introduction to Optimism”, a talk to explain how Optimism works and future with bedrock. Full video here.  A very very special thanks to @NicoEsp (leading Optimism Español), @CryptoChica and rest ethlatam organizers for make it possible and Optimism Foundation for support us. The rest of Devcon week we were attending EthBogotá, Rollup Day and Devcon, talking at the Optimism booths as well as meeting various governance delegates and our committee team members. We’re very happy that the whole Ethereum community had a great time in our continent, South America. ",
                    "links": [
                        "https://poap.gallery/event/76947",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-abracadabra-money-cycle-8/2918/62",
                        "https://gov.optimism.io/t/review-gf-phase-1-voting-cycle-7-overtime-markets/3579/60",
                        "https://gov.optimism.io/t/review-gf-phase-1-proposal-overnight-fi/3536/72",
                        "https://gov.optimism.io/t/ready-gf-phase-1-sushi-part-1/3301/34",
                        "https://gov.optimism.io/t/review-gf-phase-1-voting-cycle-7-tarot/3567/15",
                        "https://gov.optimism.io/t/review-gf-phase-1-cycle-7-proposal-alchemix/3475/84",
                        "https://gov.optimism.io/t/review-gf-phase-1-proposal-cycle-7-dope-wars/3592/46",
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-otterspace-v2/3583/9",
                        "https://gov.optimism.io/t/review-gf-phase-1-proposal-optimism-rainbow/3564/17",
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-karma-delegate-dashboard/3411/21",
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-karma-discourse-forum-plugin/3412/21",
                        "https://gov.optimism.io/t/review-gf-phase-1-proposal-updated-template-safe/3426/33",
                        "https://gov.optimism.io/t/review-gf-phase-1-proposal-li-fi/3360/30",
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-yearn/3509/31",
                        "https://twitter.com/OptimismESP/status/1579521551413964800",
                        "https://ethlatam.org/",
                        "https://twitter.com/ErikSuazo2",
                        "https://twitter.com/OptimismESP/status/1579601353072312320",
                        "https://www.youtube.com/watch?v=7je9hi6fwFw",
                        "https://twitter.com/OptimismESP/status/1579569064489680896",
                        "https://youtu.be/0Nf8SKikDWA"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 6.31832298136646
                },
                {
                    "author_link": "https://gov.optimism.io/u/SEED_LATAM_Joxes",
                    "index": "11",
                    "likes": "8",
                    "time": "20/11/2022-00:34:37",
                    "content": "Hi again! We’re always posting our procedures and activities, so this monday 11/7 we had our 7th Governance Call in DeFi LATAM in collaboration with Optimism Español to discuss the proposals of last voting cycle (#8). We continue to share our experiences as delegates and part of the governance committees in this season 2. This call was one of the longest we had and with a lot of debate about the proposals. We also had the pleasure of having the delegate @olimpio in our discussion with the community. Participants: +18 attendees. Duration 3hs. As always, many thanks to our contributor Pacha for the design of these POAP series. Our voting procedure Our procedure remains intact as the previous governance calls, we encourage our members interested in Optimism and its ecosystem to express their opinion and be an active part of the final decision-making, as a way to absorb the experience, criteria and preferences of all in one voice. During this round we were able to observe more participation/discussion from our community members. As a result, our vote for cycle #8 has been the following:   Alchemix: For Following DeFi committee A recommendations. In the previous period Alchemix received important feedback and they moved forward by resubmitting the proposal. Our community saw the changes applied by the Alchemix team very positively   Arrakis Finance: Against The three points considered by Committee A were well considered by our community. Also, the intentions of helping new illiquid projects on Uniswap V3 are noble, but it is appropriate to give more details of this approach and avoid gambling incentives, or else start low to judge the results later. Happy to see an improvement to the proposition, as boosting Uniswap liquidity is a positive for the broader ecosystem, more often than not.   Symphony Finance: Against Committee A showed two important points to correct and our community also agreed. The Latam community is convinced that Symphony adds value to the ecosystem, it’s popular among the members of our community. However, a more focused proposal is expected.   Homora V2 x Ironbank: Against Our community voted against the recommendation of the Defi C committee. The reasons are those expressed by several governance delegates, HomoraV2 in close source and the biggest beneficiary of the proposal is Iron Bank. Homora is a protocol used by members of our community, some members also collaborate with their community.   Angle Protocol: For Following DeFi C committee recommendations, forex currencies like agEUR are a space worth boosting for asset diversity in the Optimism ecosystem. Also, Angle’s track record is respectable so far, which is why our community leaned towards this proposal.   InsureDAO: For Following DeFi C committee recommendations. The insurance protocols aren’t widely used among members of the community or ecosystem in general, for various reasons such as their lack of efficiency in a good fit to the DeFi ecosystem and complexity of understanding, but organic growth demonstrated so far, the coverage of a large number of protocols within Optimism and the KPIs proposed by the team, were essential for the decision made by the community.   Curve: For Following DeFi C committee recommendations. Curve is one of the most popular protocols among the members of our community, not only because of the incentives generated in Ethereum and other chains, but also because of its solid history without vulnerabilities and great developers teams that have behind. We expect to see the same traction on Optimism.   Pool together: For Following DeFi C committee recommendations. Latam communities has shown a particular affection for PoolTogether, in addition to being widely used by members, many started in crypto via this protocol. It was also very positive to show the results of the grant received through the partner fund. We hope that Pooltogether will continue to insert users to crypto and especially to Optimism.   Overnight: For Following DeFi C committee recommendations. In cycle #7 our community had voted against, and then Overnight team made the expected changes and in this cycle it was voted in favor.   Socket: For Following Tooling committee recommendations. In cycle #6 our community had voted against, then Socket team made the expected changes and in this cycle it was voted in favor.   EthernautDAO: For Following Tooling committee recommendations. Without a doubt, EthernautDAO adds a lot of value to the Optimism ecosystem. Glad to know that some members of our community have been mentored by EthernautDAO and have provided positive feedback of it. In addition, the change made in the proposal has been seen as positive. Thanks to @Gonna.eth who has been on some of our governance calls, sharing his opinion with our community.   Tally Ho: Against Although it was voted against, the recommendation of the tooling committee was considered for this decision.   Ambire Wallet: Against Same situation as Tally Ho.   Messari: Abstain Following Tooling committee recommendations. Our entire community knows the product and Messari’s reputation, however we consider that it is being offered a “service” and not a “proposal” along with the Optimism ecosystem. We also believe that it should be dealt with by other governance processes.   Defillama: For Following Tooling committee recommendations. All members of our community voted in favor of this proposal. We know the work of the team and we use the tools provided by Defilllama on a daily basis.   Agora: For Following the recommendation of the Tooling committee. The community believes that Agora’s value proposition is different from other governance tools. We await the development of the protocol to be tested by our community.   Mochi: Against Our community voted against the tooling committee’s recommendation. We have voted for governance tools with proposals similar to Mochi’s, we want to see the impact of these tools on the ecosystem before approving this proposal.   Velodrome: Abstain Since there was no recommendation from the DeFi A committee, there was a lot of discussion about this proposal in our community. Velodrome is one of the most used protocols by members due to the incentives given. Which led to the question if Velodromo is sustainable without the incentives, there was no consensus among the members. The importance of the Velodrome team for the expansion of the Optimism ecosystem was also highlighted. Points for and points against were touched. Our members did not reach a general consensus, so we voted to abstain.   Some notes about our presence at LABITCONF With great joy, our members of DeFi LATAM community, Optimism Español, Layer 2 en Español, Mujeres en Cripto and Builders came together to have a presence all day in a booth during the LABITCONF event held on November 10 and 11 in Buenos Aires where +5000 people attended during the 2 days. @NicoEsp (leader of Optimism Español) gave a talk on the governance of Optimism in front of +200 people.  twitter.com    DeFi LATAM 🦇🔊 @DeFi_LATAM  Gm frens!🌞  Hoy los esperamos nuevamente en @labitconf 🤩  🎙️14.30 Entendiendo el paradigma modular by @0xJoxes @Layer2es   🎙️16.30 Cómo gestionar una gobernanza by @nicoproducto de @OptimismESP    Acercate a nuestro stand a conocernos, matear y charlar entre amigos 🥰 https://t.co/x0DcjGOXHi         11:18 AM - 12 Nov 2022           26                2              twitter.com    Optimism Español 🔴✨️ @OptimismESP  ¡GM Optimistas 🔴✨!  Gracias por haberse acercado a la charla brindada por @nicoproducto, donde habló de nuestra participación en la gobernanza de @optimismFND 🫂.  Esperamos, se hayan llevado muchos aprendizajes y muchas ganas de participar en gobernanza 🙌. https://t.co/TaPszExzKJ      4:04 PM - 13 Nov 2022           17                5            A special thanks to @CryptoChica and @NicoEsp who managed and organized so that Optimism Español could be present at LABITCONF. Conclusion Between events where we present Optimism and season 2, it has been an intense few months and a lot of work for our community. However, our team was up to the situation and we were not only able to have a presence in all the presentations, but we also fulfilled our tasks within governance in a timely manner. In the next few weeks we will be uploading our thoughts on the season 2 wrap up, season 3 start and the Council Grant. ",
                    "links": [
                        "https://twitter.com/OptimismESP/status/1589692836198617089",
                        "https://poap.gallery/event/81857",
                        "https://twitter.com/Pacha994_",
                        "https://twitter.com/DeFi_LATAM/status/1591389964624973824?s=20&t=zT7VMqyOH12TZL0SwItSAw",
                        "https://twitter.com/DeFi_LATAM/status/1591389964624973824?s=20&t=zT7VMqyOH12TZL0SwItSAw",
                        "https://twitter.com/DeFi_LATAM/status/1591389964624973824?s=20&t=zT7VMqyOH12TZL0SwItSAw",
                        "https://twitter.com/labitconf",
                        "https://twitter.com/0xJoxes",
                        "https://twitter.com/Layer2es",
                        "https://twitter.com/nicoproducto",
                        "https://twitter.com/OptimismESP",
                        "https://t.co/x0DcjGOXHi",
                        "https://twitter.com/DeFi_LATAM/status/1591389964624973824?s=20&t=zT7VMqyOH12TZL0SwItSAw",
                        "https://twitter.com/OptimismESP/status/1591824405969125378?s=20&t=zT7VMqyOH12TZL0SwItSAw",
                        "https://twitter.com/OptimismESP/status/1591824405969125378?s=20&t=zT7VMqyOH12TZL0SwItSAw",
                        "https://twitter.com/OptimismESP/status/1591824405969125378?s=20&t=zT7VMqyOH12TZL0SwItSAw",
                        "https://twitter.com/nicoproducto",
                        "https://twitter.com/optimismFND",
                        "https://t.co/TaPszExzKJ",
                        "https://twitter.com/OptimismESP/status/1591824405969125378?s=20&t=zT7VMqyOH12TZL0SwItSAw",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/17"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.829597821533305
                },
                {
                    "author_link": "https://gov.optimism.io/u/SEED_LATAM_Joxes",
                    "index": "12",
                    "likes": "6",
                    "time": "03/12/2022-04:29:44",
                    "content": "Season 2 has come to an end! and with this we write here our thoughts of community and participants for the DeFi LATAM delegation for this governance. Introduction First of all we want to clarify that this doesn’t represent isolated individual thoughts, but also a compilation of thoughts from members interested in the Optimism governance from our DeFi LATAM community delegation, as is described in our commitment as delegates. Very important say that this includes the thoughts of our work team to make possible our labours in DeFi C committee and the Tooling committee. Our contributors: @Netrim, @Defi_Latam_axlvaz and @Jadmat.Eth-DefiLatam. Next we are going to express positives, negatives and other thoughts that we learned from season 2. Internal work in DeFi LATAM As we expressed in our participation in the two committees, as a team we managed to carry out our work in a timely manner. As a team of 4, the division of labor for each of the proposals in the queue according to the corresponding committee, based on the expertise, knowledge, and context of each proposal and the team behind it, was correct. Then these discussions ended internally among our team, supporting our independent line of thought. Happily we were able to gain experience in a shared way. Positive  More minds, better ideas. The determination of tasks and responsibilities for each one facilitated the development and delivery of reasoning in an orderly and formal manner, ready for discussion. Each member worked on the proposals where they liked to focus the most and with the greatest motivation. Participation in the forum was remarkably active as a group and individually.  Negative  Coordination work is not easily achieved in the early stages.  Workflow between committees We are one of the few delegations that formally work as a group, which implies that coordination for the rest of the fellow committee members must be well managed. In this sense, we need to issue a special thanks to the committee leaders @OPUser and @krzkaczor because we are happy with the trust received, as well as the rest of the members. We learned a lot in the process and we hope that you all have also felt comfortable with our participation. Positive  Good relationship between the members of the committees from the beginning and motivations to do what is right at all times in our internal work. The discussions about the evaluation of the proposals in themselves and according to the expertise of each member were learning for all. Consensus was reached in relativegood way and was never a reason for division.  Negative  Communication is not always optimal. The lack of availability caused delays in some parts of the process, so it did not fit well with the timing of the governance processes.  Impact on season 2 Committees contributed at first to lighten the workload of the delegates to evaluate the proposals, but they quickly became a cause rather than a discouragement for the participation in the forum by delegates not involved in some form of committee, mainly. On the other hand, the presence of these committees as a “trusted source of consultation” for governance generated more friction and sometimes personal discussions that lost focus or turned the environment into a hostile one, for example, when some proposals were rejected. Seen from the outside, the committees failed on several occasions in their communicative role of being up to date, accompanying the proposals until their evaluation. From our side, we are proud that the reports issued by our committees had a comprehensive and even sophisticated analysis for the understanding of all parties. Positive  Iterative governance generated interesting discussions regarding the scope of the Committees that are reflected in Season 3, with the Council of Grants. Helped show which delegates were really involved, even if they were not part of any committees.  Negative  There was a dispersion of information between Discord and the Forum, making it difficult to follow the thread of certain conversations. Moderation in the Forum was non-existent. Too many backchannels and/or private communications, there was no open communication from the committees in general.  Final thoughts and conclusions Organization in governance is not easy, even more so when we’re just starting out for a protocol of such prominence as Optimism itself. As a result, following governance is not an easy task and we need to revisit how to align incentives so that contributing participants are rewarded in some way. Forum discussions are desirable but we note the need for a more moderated environment to stay on topic, fueled earlier by challenged action by committees, but surely in the future by action by the Grants Council. We want to note that since Phase 0 significant sums of OP tokens have been delivered to numerous projects, it’s time to thoroughly analyze the current impact and assess KPIs where appropriate, or have protocols report performance. On our side, our commitment to this governance remains the same as the first day and we remain committed to the Optimism ecosystem. We are going to continue working with our community and the entire ecosystem to continue representing Latam within this governance. Stay Optimistic! ",
                    "links": [
                        "https://gov.optimism.io/t/delegate-commitments/235/27",
                        "https://gov.optimism.io/t/draft-so2-committee-proposal-defi-group-c/3320",
                        "https://gov.optimism.io/t/draft-s02-committee-proposal-tooling-governance-committee/3333",
                        "https://gov.optimism.io/t/draft-proposal-moving-to-a-grants-council/3945/43",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/21",
                        "https://gov.optimism.io/t/evaluation-of-grant-processes/4264/3"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.853936864001799
                },
                {
                    "author_link": "https://gov.optimism.io/u/SEED_LATAM_Joxes",
                    "index": "13",
                    "likes": "7",
                    "time": "03/12/2022-04:33:35",
                    "content": "Special thanks to rest of our committee team members @lefterisjp @ScaleWeb3 @cryptotesters @Gonna.eth @ceresstation @MinimalGravitas ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.392857142857142
                },
                {
                    "author_link": "https://gov.optimism.io/u/SEED_LATAM_Joxes",
                    "index": "14",
                    "likes": "5",
                    "time": "05/12/2022-04:04:40",
                    "content": "In the context of upcoming Season 3, we’re issuing our first thoughts about these new process and proposals and its impact to the governance. Read below:   Re: [DRAFT PROPOSAL]: Moving to a Grants Council   Re: [DRAFT PROPOSAL]: Protocol Delegation Program   ",
                    "links": [
                        "https://gov.optimism.io/t/draft-proposal-protocol-delegation-program/3946/45"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 3.6079545454545454
                },
                {
                    "author_link": "https://gov.optimism.io/u/SEED_LATAM_Joxes",
                    "index": "15",
                    "likes": "8",
                    "time": "15/12/2022-21:15:10",
                    "content": "Hi again! The year 2022 is about to end, and this week we have decided to make our last governance call for the rest of the year, discussing our pending decisions, always in collaboration with Optimism Español, specifically to discuss the proposals of this last voting cycle (#9a) and sharing other important topics. Participants: +33 attendees. Duration: 2hs. Our voting procedure Sticking to our way of making decisions, we explain to the community the current status of active proposals. Then, we carry out the respective votes with the following results:  Grant Council: For   The feeling from us (as delegate + contributors) and the rest of the community is that a twist is needed to cover the gaps that the committees couldn’t fill last season. This new iteration looks reasonable, but it’s a big change for delegates to focus on now; if this proposal passes.  Protocol delegation program: Against   Despite several of us and contributors expressing about various positive aspects of this proposal, in the final consensus with our community there were more doubts or questions about the purpose of the proposal, such as, for example, if there is not a clearer path to where we should go, how to guide protocol representatives to pursue the interest of the network and not a shock of conflicting interests. About our committee and retroactive compensation As everyone can note, this delegation received a total sum of 16695 OP. In terms of contribution received by each delegate, joxes.defilatam.eth is positioned as the Top 1 delegation in funds received, which makes us feel proud of all the effort made. In details, the rewards have been received for the following reasons:   Participation in DeFi Committee C: 4043 OP - 24%   Participation in Tooling Committee: 4652 OP - 28%   Season 1 and 2 retroactive delegate rewards: 8000 OP - 48%   As we know, this delegation has worked together since its inception through Joxes (me), our group of contributors and Latam community, accompanied by an initiative started from DeFi LATAM called Optimism Español. In order to honor the efforts of our community, we have decided to distribute said funds to everyone involved in the community to participate in governance and support Optimism in its own growth and future:   Committee Contributors: who shared the responsibility of carrying out the work in both committees for season 2. Joxes, @Netrim @Defi_LATAM_axlvaz and @Jadmat.Eth-DefiLatam – 7200 OP.  Optimism Español: to support the group of contributors who helped this initiative in any meaningful way. @NicoEsp, @et_2244, Pacha, @CryptoChica, Candu, Lu, @eriksuazo, Gasm and @ahhsun – 4700 OP.  SEED Latam: an allocation for the next initiative to insert people from the web3 ecosystem of latam in governance – 2295 OP.  Community Airdrop: a distribution to those who frequently participated in our governance calls and contributed to governance discussion and decision-making, counted by POAPs, excluding the contributors listed above – 2000 OP. More details will be shared in the next few days.   1600×891 372 KB  Call for optimism We love working as a collective intelligence and transparency, something that makes us feel identified with the ethos of the Optimism ecosystem. If we want Optimism to be the transformative engine of Ethereum and the future of the internet, we must start iterating ourselves as best we can. So far, we’re all very proud of what we’re doing to encourage the rest of the Optimism community to appreciate these efforts, and we invite other delegates to refine their own participation processes, if applicable. For now, we are preparing for Season 3, Citizen House release and RetroPGF 2 to continue contributing to public goods and Ethereum ecosystem. ",
                    "links": [
                        "https://gov.optimism.io/t/draft-proposal-protocol-delegation-program/3946/45",
                        "https://twitter.com/0xJoxes",
                        "https://twitter.com/OptimismESP",
                        "https://twitter.com/Pacha994_",
                        "https://twitter.com/cryptocandu",
                        "https://twitter.com/0xBlonde",
                        "https://twitter.com/GustavoSuazo14",
                        "https://www.seedlatam.org/",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/e/eb276508e4f80eff447b89c2fffb23fd7beef3fc.jpeg"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.907731157731158
                },
                {
                    "author_link": "https://gov.optimism.io/u/SEED_LATAM_Joxes",
                    "index": "16",
                    "likes": "6",
                    "time": "20/12/2022-02:15:34",
                    "content": "Sharing my thoughts on the citizen house and public goods Finally the Citizen House has been announced for its first iteration. As we know, since its inception it has been thought to focus on the idea of funding public goods, as a way to potentially contribute to the future of the internet and free software, where Optimism and Ethereum are immersed. As a second iteration of RPGF, the amount allocated by the foundation has been 10m OP ($9m today), and it will be focused on Optimism and its new release OP Stack, although it would be desirable if it’s also accompanied by Public Goods built for Ethereum base layer. Anyways, it’s also understandable that starting with public goods that help Optimism itself and not beyond is easier to align incentives and take note of lessons learned before being ambitious and later broading scope. LATAM and public goods for Ethereum In this part of the so-called “third world”, the Internet has always remained relatively distant or under the radar of a good part of Western and Eastern capitalism, mainly in finance. Coupled with our political and economic particulars, it explains why free software initiatives have been relevant, and most notably, Ethereum. The role of Latin America for the Ethereum ecosystem has been important, as it happens in other regions. Despite the average low income, the masterminds have been at the start, in the formation of by example OpenZeppelin, MakerDAO, Hardhat, Flashbots, Decentraland and many other projects, not to make a long list. Different generations of builders have been contributing to the ecosystem and the different Ethereum communities in this region have accompanied and nurtured to impact Ethereum for good, including DeFi LATAM, with a remarkable degree of sophistication, recognized by Vitalik. Funding in Latin America is not easy to find, but fortunately the region has had access to these new mechanisms to build public goods such as having its own category in the Gitcoin Grants rounds, and Quadratic Funding in recent times such as:  Ethereum TGU Grants (12444 USD) EthLatam BA (25000 USD) EthColombia (292300 USD)  More than sixty projects have benefited, including open source contributions, communities and projects that try to solve problems in Latin America. In the process, many members of the ecosystem here have gained enormous experience on how to understand the proposed objectives, the selection process, voting, and how to improve it for future rounds. Our community members have been voters, applicants and even developers of some of these. There are several members of the Ethereum ecosystem in our region that I think could also contribute to the process in a significant way with direct experience in said rounds (in the same order) such as crisgarner.eth, @CryptoChica and juandav.eth; but also others like Mariano Conti, @Gonna.eth and @NicoEsp. My suggestion is that if any badge holder (elected by OF or by snapshot) wishes to nominate a person with a focus on this geographic location, my suggestion is on these persons. The values of this delegation and a wish list I must thank @kaereste for nominating this delegation (and @lefterisjp for keeping an eye out that we had a nomination), very excited by this. Elected or not, I will be looking closely at all infrastructure proposals with some priority as it is the key before building novel things on top of any form of Optimism. Again, the objectives of this RPGF are clear: to help Optimism and its OP Stack in their degree of sophistication as a competitive framework that developers prefer to use over others. Some interesting things to see are communication between OP chains, consensus mechanisms for them, new L2 clients of Optimism and focused on being the most optimized possible, infrastructure to enable other data availability schemes, VMs and innovative fraud proof systems, and of course, true education initiatives without value extraction to attract more developers and users to Optimism. Additionally, if any initiative is also matchable for the development of the Ethereum base layer in some way, it would be considered as a plus and not to be ignored. Lastly, although it’s not detailed yet, we expect Citizen House to have their own chat channels open prior to the launch of RPGF 2, including allowing them to iterate the process if there’s anything worth tweaking prior to the round. Excited for what’s to come! Happy Citizen House! ",
                    "links": [
                        "https://youtu.be/QXKqIIf6_AE?t=905",
                        "https://twitter.com/crisgarner",
                        "https://twitter.com/juandaveth",
                        "https://gov.optimism.io/t/token-house-badgeholder-election-information/4195/13"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.7638039044289044
                },
                {
                    "author_link": "https://gov.optimism.io/u/SEED_LATAM_Joxes",
                    "index": "17",
                    "likes": "4",
                    "time": "21/12/2022-15:33:13",
                    "content": "About Badgeholder Nomination Voting A total of 19 delegates were nominated to be part of Citizen House for this second iteration of RPGF. Regarding the voting decision, I have decided this time to receive an opinion from our main contributors about who could be the 10 most suitable for this round. It’s definitely not an easy task because all the nominees have demonstrated commitment to Optimism ecosystem and governance, and experience in public goods. As a result, the following people who we have voted for and who we believe can truly contribute to this next iteration are: Linda Xie, Bobbay (vía Stablenode), Lefteris, OPUser, Polynya, Scott Moore, Dhannte, Minimal Gravitas, Kris Kraczor and Jack Anorak. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.318181818181818
                },
                {
                    "author_link": "https://gov.optimism.io/u/SEED_LATAM_Joxes",
                    "index": "18",
                    "likes": "7",
                    "time": "26/12/2022-15:44:42",
                    "content": "As promised, we have decided to distribute a total of 2,000 OP tokens to our participants in governance calls throughout the year, being our first community airdrop. This was never intended until the announcement of the retractive rewards for Season 1 and 2. As a result, it allowed us to do a very simple fair distribution among those who listened and discussed our decision making for Optimism. The rules were: have claimed at least 2 POAPs from our governance calls (out of a total of 8 editions). A total of 35 eligible, under the following distribution and by number of addresses:  8 POAPs = 120 OP (2) 7 POAPs = 95 OP (3) 6 POAPs = 85 OP (2) 5 POAPs = 75 OP (3) 4 POAPs = 60 OP (1) 3 POAPs = 50 OP (6) 2 POAPs = 40 OP (18)  *This excludes all 13 contributors between DeFi LATAM and Optimism Español. These distributions and others can be followed watching my ENS, being also our delegation address (joxes.eth or joxes.defilatam.eth).   twitter.com    DeFi LATAM 🦇🔊 @DeFi_LATAM  Amigos 🤩 Nos complace anunciar que en #DeFiLATAM acabamos de distribuir el primer Airdrop comunitario 🪂 $OP @OptimismFND  2000 tokens a repartir entre más de 30 elegibles 🪙🎓  Pero antes 👉 Recap de nuestro año en @OptimismGov 🧠  🧵👇 https://t.co/7d2xw77naI   5:07 PM - 22 Dec 2022           55                13            Optimistic Holidays! ",
                    "links": [
                        "https://twitter.com/DeFi_LATAM/status/1605973257219211264",
                        "https://twitter.com/DeFi_LATAM/status/1605973257219211264",
                        "https://twitter.com/DeFi_LATAM/status/1605973257219211264",
                        "https://twitter.com/search?q=%23DeFiLATAM",
                        "https://twitter.com/OptimismFND",
                        "https://twitter.com/OptimismGov",
                        "https://t.co/7d2xw77naI",
                        "https://twitter.com/DeFi_LATAM/status/1605973257219211264"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.40625
                },
                {
                    "author_link": "https://gov.optimism.io/u/SEED_LATAM_Joxes",
                    "index": "19",
                    "likes": "3",
                    "time": "31/12/2022-20:59:46",
                    "content": "ICYMI – we’re postulating to Grants Council for Season 3 in Growth Experiment Sub Committee. An interesting thing, we’re proposing participate as a group, with Joxes (me) as leader and responsible to the vacant, but working as a group composed by 4 contributors. Read our entire proposal here: Grant Council Reviewer Nominations - #7 by DeFi_LATAM_Joxes ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 6.166666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/SEED_LATAM_Joxes",
                    "index": "20",
                    "likes": "10",
                    "time": "17/01/2023-23:44:32",
                    "content": "And, yes! Happy new year 2023!  The last year we have publishing all our activities, and this year we’re keep doing the same and making things better. So, this Monday 01/16 we had our 9th Governance Call in DeFi LATAM in collaboration with Optimism Español to discuss the proposals of this special #9b voting cycle. As a reminder, we continue to improve internally the way our contributors and rest of our community reach consensus on decision making within the Optimism Collective. Participants: +40 attendees. Duration 1hs 40min. As always, many thanks to our contributor Pacha for the design of these POAP series.  Our voting procedure and rational Our evaluation was shared among the contributors and then taken to the community to reach a consensus among the enthusiasts of the OP ecosystem.  Protocol Delegation Elections We have decided to vote for the following 8 protocols as most voted:  ENS BeethovenX & Balancer Connext Paraswap Li. Fi QiDao Protocol Revert 2Pi Network  These are a mix of protocols of which the community in some way reflects a preference regarding usability, appreciation or recognized builders behind it.  Grants Council Elections - Growth Experiments After a great debate about some considerations, mainly because our application to this council sub-committee, we have decided to vote 5 of most properly candidates:   @fig: his contributions to the ecosystem and expertise were well valued as The Optimist Score, as well as his trajectory.   @Bobbay_StableLab: their good level of participation and experience as a group (StableNode) and working with other protocols/DAOs. Bobbay has reproduced this for Optimism governance.   @GFXlabs: in the same line, this group has been in DeFi with a large experience in DAOs and helping to build and grow protocols.   @katie: good commitment and highly recognized in the space for her contributions. Expertise is also well known.   Joxes | DeFi LATAM: we’re generally against voting for ourselves (even before code of coduct was established), leaving the rest of governance to faithfully express their preferences for us, as by example in committee and badger holders elections. In this case OP foundation allowed the applicant delegates to vote for themselves as long as we chose 4 others and the community agreed to take this step. It should be noted that some of our contributors didn’t fully agree with this.    Grants Council Elections - Builders Regarding Builders, the community followed up with a good debate to choose the best 3 candidates, resulting in voting for:   @Gonna.eth: several community members acknowledge Gonna.eth (Dhannte) and their work on EthernautDAO, we believe that he is ideal for this work.  @kaereste: seems as a natural fit for this work also, well recognized in the community for his work on L2beat.  @jackanorak and @OPUser: there was a technical tie for 3rd place. We see in Jack as likely to strongly contribute in this council based on expertise in protocols and analytics, demonstrated here in governance. In the other hand, we worked with OPUser in DeFi C committee and continues to maintain a longstanding dedication to governance, vision, and product. Without a clear consensus, we voted for both.   Final thoughts Season 3 will be quite different than previous iterations of Optimism governance. Council will occupy efforts that will no longer be the direct responsibility of the full set of OP delegates as was the case last year.With the new approach for grants, let’s see how the new council and foundation can improve the system of delivery of funds to reduce the waste of resources and increase the impact with short periods of time to guarantee the growth of the Optimism ecosystem. Optimistic optimism! ",
                    "links": [
                        "https://twitter.com/Pacha994_",
                        "https://gov.optimism.io/t/grant-council-reviewer-nominations/4372/7",
                        "https://science.flipsidecrypto.xyz/optimist/"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party or author is advertising proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.044341709015622
                }
            ]
        }
    ],
    "group_index": "149"
}