{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/introducing-op-launcher-to-optimism-world/3386",
            "title": "Introducing OP Launcher to Optimism World ",
            "index": 3386,
            "category": [],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/Optimism_Launcher",
                    "index": "1",
                    "likes": "0",
                    "time": "27/08/2022-12:09:34",
                    "content": "Project Name: OP Launcher  Author Name: Jane Guinevere  GM Optimism Community I would like to introduce you to OP Launcher, a Decentralized Launchpad Built on Optimism. OPLauncher is a decentralized launchpad that allows users to launch their own token and create their own initial token sale. No deep knowledge of fund-raising is required, just simply navigate to our terminal and design your own token in just a few clicks. OPLauncher offers multiple other features to help you have an overall token launch, such as: Automatically listing your token on Velodrome Dex, locking Project’s token and LP to protect investors. OPLauncher provides 4 features features with everything you need to launch a project, purchase tokens from our launchpad, simply stake your tokens, and so on. Ultimately we are a Blockchain tech provider.    Launchpad : The place for developers can launch their projects and investors can join profit potential ones.    Staking: Tier system and earn protocol revenue.    Create Token: Create ERC-20 standard token.    Lock Liquidity / Token: Lock project’s Liquidity/Token.   We have done 2 Testnets on Optimism Goerli and prepared for mainnet stage. Listing on Coinmarketcap, Dapp Radar,… We hope to receive support from everyone. OPLauncher - Decentralized Launchpad  ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4921875
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "2",
                    "likes": "0",
                    "time": "13/09/2022-18:37:47",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "4",
                    "likes": "0",
                    "time": "13/09/2022-19:32:25",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "226"
}