{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/draft-gf-phase-1-proposal-router-protocol/3655",
            "title": "[DRAFT][GF: Phase 1 Proposal] Router Protocol ",
            "index": 3655,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Governance Fund: Phase 1"
            ],
            "tags": [
                "cycle-8"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/Aadith",
                    "index": "1",
                    "likes": "1",
                    "time": "06/10/2022-18:25:50",
                    "content": "Project name: Router Protocol Author name and contact info (please provide a reliable point of contact for the project): Aadith Narayanan aadith@routerprotocol.com Telegram:@Add_ith I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: Yes L2 recipient address: 0x031549EF02e6e5295055a2BC8809b42820fd0cb9 Which Voting Cycle are you applying for?: Phase 1, Cycle 8 Grant category: Governance Fund Phase 1 Is this proposal applicable to a specific committee? Tooling Project description (please explain how your project works): Router Protocol is building a suite of cross-chain infra primitives that aims to enable blockchain interoperability between current and emerging Layer 1 and Layer 2 blockchains. Router Protocol is deployed on Optimism Mainnet and the flag-ship DApp of Router - Voyager, a cross-chain swap app can be accessed at : The Voyager Cross-Chain Swap . Voyager is a mechanism for cross-chain messaging and communication that will initially focus on the specific use case of bridging assets across multiple layer 1 and layer 2 networks by using stablecoins as the medium of value transfer. With multiple AMM DEX, as its dedicated liquidity reservoir, XCLP is able to facilitate cross-chain asset transfers even if the protocol itself does not have sufficient liquidity reserves. In addition to asset transfers, Router Protocol also enables the flow of arbitrary messages across chains in a secure and seamless manner, thereby extending the composability of DeFi across various blockchains. Project links:  Website:https://routerprotocol.com/  Twitter :https://twitter.com/routerprotocol  Discord/Discourse/Community: Telegram: Contact @routerprotocol  Please include all other relevant links below: Whitepaper: https://docs.routerprotocol.com/  Discord: https://discord.gg/yjM2fUUHvN  Medium: https://routerprotocol.medium.com/   Additional team member info (please link): Our team is composed of individuals that have been building in crypto for the better part of the last decade. Router Protocol was founded in August, 2020, however most of the founders had been working together since 2017. We initially started off with building a bitcoin side chain for trading tokenized pre-IPO securities. We then moved onto building a DEX, way back in 2018, subsequently we built a leading crypto derivatives platform, or rather the matching engine behind it, and then a low latency algorithmic trading software through which we ran a crypto fund. Ramani Ramachandran (CEO & Co-founder) MIT, Deloitte, Moody’s, Schlumberger; In Crypto since 2014, built and ran Asia’s earliest crypto fund, returned 4x; Built Fordex - the world’s first stablecoin DEX; Qume, an institutional grade crypto exchange; Launched Asia’s first crypto-index token Shubham Singh (CTO & Co-founder) Full-stack Developer and Technical Architect building in crypto and blockchain since 2016; Built a crypto-index (108token) as well as Fordex - the world’s first stablecoin DEX. Mankena Venkatesh (Chief Blockchain Architect) An alumnus of a top Indian engineering institute, BITS Pilani, and winner of the 2019 ETH India hackathon. Previously worked on interoperability at Injective and Polygon. Please link to any previous projects the team has meaningfully contributed to: Our team has prior contributions in category defining projects such as Polygon, Injective Protocol, Qredo, Reef Finance, and Dfyn exchange. Relevant usage metrics (TVL, transactions, volume, unique addresses, etc. Optimism metrics preferred; please link to public sources such as Dune Analytics, etc.): Total Volume Processed:590M + Total Txns Processed: 89,000+ Volume Onboarded to Optimism: 410,000 + $ Wallets Onboarded to Optimism: 1,000+ Projects Leverage Router for a Smoother Bridging Experience. Projects on Optimism include: Perpetual Protocol and Grannary.   Looker Studio    Router Data - Cross chain swaps Looker Studio turns your data into informative dashboards and reports that are easy to read, easy to share, and fully customizable.      Competitors, peers, or similar projects (please link): Our major competitors include other cross-chain bridging infrastructures including ThorChain, Hop Protocol, Multichain (previously Anyswap) LayerZero and others Is/will this project be open sourced? Yes Optimism native? No, we are deployed in multiple chains including Optimism Date of deployment/expected deployment on Optimism: Deployed on April 2022 Ecosystem Value Proposition: What is the problem statement this proposal hopes to solve for the Optimism ecosystem? Various L2 chains are competing with each other for users and TVL, whilst users are spread thin across these chains. Once users are familiar with one chain they are less likely to check out other ecosystems or move to a new chain. Our cross chain messaging mechanisms and asset transfers can enable projects to open themselves to Optimism mobilising users to Optimism thereby increasing activity on Optimism network. How does your proposal offer a value proposition solving the above problem? Router protocol helps onboarding of users and also helps them test the projects in the ecosystem( through voyager competitions ) as it provides incentives to onboard and helps users experience the ecosystem. Likewise our Crosstalk SDK will enable builders to expand to Optimism bringing more projects into the ecosystem. Why will this solution be a source of growth for the Optimism ecosystem? This solution will be a well synergised effort along with other incentives that Optimism is providing to other protocols. It will help users to onboard onto Optimism and experience the ecosystem with ease and simplicity. Once the onboarding is done, they are likely to stick with the ecosystem ushering in massive user growth for the ecosystem. Has your project previously applied for an OP grant? No we haven’t applied for OP grants thus far. Number of OP tokens requested: 200,000 Did the project apply for or receive OP tokens through the Foundation Partner Fund? No If OP tokens were requested from the Foundation Partner Fund, what was the amount? Nil How much will your project match in co-incentives? (not required but recommended, when applicable): We wouldn’t be providing any co- incentives as of now. PS: We have already conducted a incentivised bridging competition in partnership with Perp protocol to Optimism : Proposal for token distribution: How will the OP tokens be distributed? User incentives [50% :100k]: We will be incentivizing on-chain activity for inbound-traffic to Optimism Network with the help of Voyager and Gas fees rebates.  Voyager [20% :40k] : Users will be incentivised with bridging competitions such as voyager contests which we have conducted in the past with partners. In these contests, users will be incentivized to bridge to Optimism and try dapps of partners in Optimism which indirectly also promotes users to stick to Optimism and explore other dapps within the ecosystem. All the projects integrating and partnering with router on optimism will be eligible for voyager contest through the integration. Gas fee rebates [30% :60k] : Gas fee rebates for users bridging to Optimism  Developer incentives [ 50% :100k ] : We would like to give incentives to build cross chain protocols/Dapps/Dexes/Products which work across multiple chains but have their core functions in Optimism. Example: Cross chain synthetics/ derivatives trading platform that has liquidity and backing in Optimism but can be traded across different chains including other L2s Over what period of time will the tokens be distributed for each initiative? The user incentives will be distributed over 3-5 months For developer incentives, it might take upto 6-9 months considering the development time for a new protocol/Dapp Please list the milestones/KPIs you expect to achieve for each initiative, considering how each relates to incentivizing sustainable usage and liquidity on Optimism. Milestones :  New users bridged : 20K No of assets bridged to : 30+ Volume of bridged asset:30M+ No of new users tried/ used/ deposited in the partner protocol : 10K Projects will build with Router crosstalk and we can measure metrics like how many cross chain contract calls are being made from and to Optimism: ( TB Determined : depends on types and architectures of the products deployed)  Why will incentivized users and liquidity on Optimism remain after incentives dry up? The incentives will be used to onboard users and liquidity to the best apps on Optimism first so they can get a feel of using Optimism. Once they try the very best apps on Optimism - we expect them to stay on Optimism because of the ecosystem, fast transactions, and great community. We will make the onboarding experience from other chains to be a very smooth process. Please provide any additional information that will facilitate accountability: Optimism bridge address: 0x33D9291CC2Eaabebd011D76765526f0C4c7ffe86 Security audits and other developer docs are available at the gitbook : Security Audit - Dev Documentation Updates : The marketing subsection under the OP token distribution plan has been removed as per the suggestion recieved from OP community ",
                    "links": [
                        "https://routerprotocol.com/",
                        "https://twitter.com/routerprotocol",
                        "https://t.me/routerprotocol",
                        "https://docs.routerprotocol.com/",
                        "https://discord.gg/yjM2fUUHvN",
                        "https://routerprotocol.medium.com/",
                        "https://datastudio.google.com/reporting/9fc8b9a8-ec20-491d-b044-585f21af998a",
                        "https://datastudio.google.com/reporting/9fc8b9a8-ec20-491d-b044-585f21af998a",
                        "https://twitter.com/perpprotocol/status/1544026201500655617?s=20&t=3WSv50XcMQkIhoEo0lOq_g",
                        "https://dev.routerprotocol.com/crosstalk-library/security-audit"
                    ],
                    "GPT-summary": "The post is a draft proposal for the Router Protocol, which aims to build cross-chain infrastructure to enable blockchain interoperability between current and emerging Layer 1 and Layer 2 blockchains. The proposal includes information about the project, its team, and its value proposition for the Optimism ecosystem. The post also includes links to relevant project information and usage metrics. The proposal requests 200,000 OP tokens and outlines how they will be distributed. The post does not include any entirely negative feedback or constructive criticism of the proposal.",
                    "GPT-proposal-categories": [
                        "Interoperability and Scalability",
                        "Grants, Funding and Resource Allocation",
                        "Smart Contract Updates",
                        "Community and Engagement",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.413590067340067
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "2",
                    "likes": "0",
                    "time": "09/10/2022-12:02:09",
                    "content": "Hi @Aadith , thank you for your proposal. Took some time to go through your medium and understand what router is trying to do. From my side, your proposal look good and will add value to Optimism. Could you provide information on what you want to with Marketing ? What’s the goal here and how are you planning to do it ? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/Aadith",
                    "index": "3",
                    "likes": "1",
                    "time": "11/10/2022-15:54:52",
                    "content": "Marketing: The purpose of the marketing plan for Optimism will be to ensure that our user and developer incentives reach a broad audience of users. For user incentives: The goal will be to ensure that the campaign and the rewards are reaching beyond just our community, and for that, we need to ensure that the incentives are well-known to the broader web3 community — for which we plan to spend on banner advertisements, thought leadership content, and paid placements. The ideal users for this campaign will be who have not tried Optimism before because our goal here is to introduce the power of Optimistic Roll ups to those who are not familiar with the Optimism eco-system yet, so we’ll be targeting the audiences of other layer-2 optimistic rollup based scaling solutions. For developer incentives: The goal will be to ensure that more and more developers are building by leveraging Optimism and Router Protocol. The incentives may be given out in the form of hackathon prizes or grants for building solutions. We will focus on DApps here which are already having an audience and make them consider deploying a node of their DApp or their token on Optimism and leverage Router Protocol for the cross-chain functionality. We plan to provide a clear view on spending on various of the above activities with a live dashboard to ensure 100% transparency along with the results achieved. We are well connected in South Asian ecosystem and we want to leverage that to build more awareness about Optimism in the region. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party or author is advertising proposal",
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.994318181818182
                },
                {
                    "author_link": "https://gov.optimism.io/u/ScaleWeb3",
                    "index": "4",
                    "likes": "2",
                    "time": "12/10/2022-10:00:38",
                    "content": "Thank you for your proposal. The value-add, timeframe & alignment with Optimism looks good!   The idea of bridging competitions in collaboration with Optimism projects is nice and should help spur growth of Router, Optimism and ecosystem projects    On one side, gas fee rebates for bridging should be a no-brainer as this helps bring in more users. On the other side, many other cross-chain bridging teams have previously applied for fee rebate grants as you can see here. Quite a few of those fee rebate programs are currently active, and, in our opinion, onboarding costs to Optimism shouldn’t be a big issue at this point.    How do you plan to implement the fee rebates? Do you want to fully refund fees or a percentage? What is the marginal value added of another fee rebate program? (Probably it would be good to understand better how important Router is in the cross-chain ecosystem, and how many more users this program could help. We saw that some protocols facilitate bigger volumes but there are quite a few unique daily users according to your analytics. Maybe you can shed a bit more light on this)    Developer incentives for cross-chain products with an Op focus make also sense. This is an area Optimism could focus much more to leverage its capabilities and position itself as an important DeFi/liquidity/etc. hub. Potentially, it could be interesting for you and for the core Optimism team to define interesting products and directly offer bounties & RFP.   We would prefer to see the marketing funds allocated in one of the above categories as we believe you should market your solutions & grant programs anyways. Also, incentives spent on clear value-adding initiatives can be better tracked & evaluated afterwards.   ",
                    "links": [
                        "https://explorer.routerprotocol.com/"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None"
                    ],
                    "Sentiment": 6.274193548387097
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "5",
                    "likes": "2",
                    "time": "17/10/2022-15:04:32",
                    "content": "Can you describe what Router offers re cross-chain messaging that LZ, Hop, CashmereLabs, Li-Fi, and others do not? I believe from a bridging standpoint there are others that are already sourcing from multiple liq pools as well. One thing I think it’s time to start being mindful about is the sheer number of bridges we’re throwing a ton of money at. Onboarding users is good but there’s a point where we start funding way beyond our likely needs. Dev grants ofc work toward a longer time horizon, but in these cases we should start being opinionated as a dev community with regard to what sorts of standards are more likely to succeed and encourage those. Could be worth a post cataloguing the bridge protocols we’ve funded to date. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/tao",
                    "index": "6",
                    "likes": "1",
                    "time": "17/10/2022-18:41:41",
                    "content": "I’d generally echo the comments here. Bridging incentives make sense, but it’d be good to know how Router fills any gaps left by other bridges. The marketing section is rather vague. How exactly do you plan on reaching developers / users and why would marketing convince them to develop tooling for Router / bridge to Optimism? What marketing channels will you use and how will the 40k OP be spent across channels? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.196428571428572
                },
                {
                    "author_link": "https://gov.optimism.io/u/Capt-Holt",
                    "index": "7",
                    "likes": "1",
                    "time": "17/10/2022-19:53:00",
                    "content": "Excellent proposal, better than spending million of $OP on Bribe for mercenary LP on dexes and funding protocol teams pocket. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/Aadith",
                    "index": "8",
                    "likes": "0",
                    "time": "18/10/2022-10:21:16",
                    "content": "Hey sorry for the delay ,   Yeah thanks we have found that bridging competition that directs towards project works better for both parties   Rebates: % and implementations:  A fee rebates of 50% for new users and 200% rebate(around 3$) of the fee if bridged above 200$. It will be implemented so that users who are new to optimism will be getting the rewards.   Router is different from other bridges and we are a cross chain swap which tap into all the tokens in the chain that has liquidity in a dex, It’s ecosystem and usages are mostly by polygon and fantom ecosystems and is one of the top volume dapp in polygon and fastest bridge, So the router is having a tap into different and potential users whom optimism can tap into and it can be interesting for users to check in and onboard to new chain, and we partner with projects to have the cross swaps enabled in their UI or so to have an easier onboarding too and conduct the voyages competition directed with a call to action towards them So i do think the synergistic effect of rebates + partnered voyages would drive more users than doing one or the other alone   We are looking forward to bring different cross chain products , we already have an internal team working on defining the products and making dev docs and sample codes, we have sample codes for NFTs already, cross chain stable coin and synthetics use cases are being designed and documented, if this can be done with the core Optimism team , together we could make more impact   Yeah thanks for the feedback taking this feedback and it makes sense and making the updates   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.631818181818183
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "9",
                    "likes": "0",
                    "time": "18/10/2022-12:09:05",
                    "content": "I’m curious what the unique user count claimed by your protocol can be attributable to. Was there some sort of incentive or quest provided on polygon? More importantly, is there any additional information on these wallets, eg a distribution of how much was swapped/bridged, other activity on poly and other chains, etc? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.803571428571429
                },
                {
                    "author_link": "https://gov.optimism.io/u/Aadith",
                    "index": "10",
                    "likes": "1",
                    "time": "18/10/2022-18:07:38",
                    "content": "Yes, there are other projects that tap into multiple liquidity sources as well. However, we are uniquely positioned when viewed from the lens of utilities. Take for instance how we have a powerful pathfinder akin to those seen in dex aggregators like 1 inch except ours is a cross-chain pathfinder. One of our advantages is that we accept multiple tokens as gas fees, which makes it much more convenient for users. In addition, we have a Widget, API and SDK which enable the integration of the bridge into any website, dapp or such. Ex: We have partnered with frontier wallet to enable bridging inside the dapp itself ( also the bridge can be used as an aggregator ), we have also partnered with altverse who will be implementing the bridge in the form of ATM machines to move funds inside their metaverse. We are not just looking to be a bridge app but rather be a core piece in the implementation of projects by improving their UX itself! About Cross chain messaging: Lifi is a cross-chain messaging aggregator, which means they are using other solutions  , Hop protocol I believe their product is still under development , Thus, Layer Zero  and Axelar network are the most similar products that are available however when we view from the lens of validation scheme ( Router has on chain validation) or Tx time( 90% of our transactions are done under 90 sec) Router performs better. At router we have been focussing on the tech side of things and we have been internally putting together cross chain products ourselves by conducting internal hackathons. One key transformation we discovered and that we added to our product suite is an atomic sequencer which enables devs to send tokens and instructions so that the actions are sequenced and are atomic ( meaning either both will happen or both will fail) which is an important component to any cross chain contract. In one of the hackathons we conducted,  we tested cross-chain yield aggregators, Cross-chain mixers, cross chain NFTs and such, and these products and code snippets are available at least at the testing stages, and We also have a library { https://dev.routerprotocol.com/} where we have shared details with sample codes for these products. We will be adding more soon along with more products. More sample codes are being documented. On top of these, we provide thorough tech support. We work along with partner teams in designing architectures so that products are built efficiently. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.728448275862069
                },
                {
                    "author_link": "https://gov.optimism.io/u/Aadith",
                    "index": "11",
                    "likes": "0",
                    "time": "19/10/2022-07:08:15",
                    "content": "Hey about the marketing part,  as per the ‘Secure Web3’ feedback, I will be removing the section and adding the allocation to other categories, will update it soon summing up how router is different : Router bridging is fast ( 90 % of our transactions are completed in 90 sec) We have a powerful pathfinder which allows the discovery of any token on any supported chain with the best price, something dex aggregators like 1 inch do (except we do in a cross-chain setting) We have different products ( widget/ API/ SDK) that suit all types of websites and dapps or apps. We allow projects to leverage our widget enhancing UX for their apps We accept bridge Fee in multiple tokens making it easier for users We are conducting Voyages ( bridging competitions) with Partner projects, so we are not just trying to onboard users to the chain but rather trying to handhold  them to the Ecosystem/ Dapps where the growth lies ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.796875
                },
                {
                    "author_link": "https://gov.optimism.io/u/Aadith",
                    "index": "12",
                    "likes": "0",
                    "time": "19/10/2022-11:13:13",
                    "content": "Hey ,yes we have conducted ’ Voyages ’ an incentivise bridging competition with partners ,and we wish to conduct them in Optimism too I have replied on OP discord about the same : Discord On optimism side we conducted voyage 4.0 in partnership with Perp protocol and you can see the results here https://twitter.com/routerprotocol/status/1549703456734453760?s=20&t=xqRtQI3fhIOW6cLiFsiRDg Also with Dfyn on polygon side : https://twitter.com/routerprotocol/status/1560283702437236736?s=20&t=HrsLfnv3q_Lhu7W_K6tg_A 125M$ in Dex trading volume was achieved ",
                    "links": [
                        "https://twitter.com/routerprotocol/status/1549703456734453760?s=20&t=xqRtQI3fhIOW6cLiFsiRDg",
                        "https://twitter.com/routerprotocol/status/1560283702437236736?s=20&t=HrsLfnv3q_Lhu7W_K6tg_A"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "289"
}