{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/transitioning-to-on-chain-voting/4193",
            "title": "Transitioning to On-Chain Voting ",
            "index": 4193,
            "category": [
                "\\xf0\\x9f\\x8f\\x9b Governance",
                "Metagovernance"
            ],
            "tags": [
                "season-3"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "1",
                    "likes": "60",
                    "time": "06/12/2022-17:58:20",
                    "content": "Over the course of Season 1 and 2, there have been well-documented issues with our voting infrastructure. Eliminating these constraints and moving to an on-chain voting system is a top priority for delegates and something the Foundation has spent much time considering given the need to move to a reliable, future proof alternative. We thank you for your patience. The Foundation ran a competitive process to select a vendor to fulfill this contract and we are excited to announce that the Foundation has contracted Agora, a Gov Fund grant recipient, to build an on-chain voting MVP for Season 3! In future Seasons, we plan to move to a more transparent and community-led vendor selection process. While we are excited to see Agora’s MVP up and running for Season 3, several votes will occur between now and then (Special Voting Cycle #9a, Token House badgeholder elections, and Special Voting Cycle #9b.) While we will continue to use Snapshot for these votes, the Foundation may manually count votes in the event of third-party application errors, as specified in the operating manual. In order to help our last few cycles on Snapshot run as smoothly as possible, we recommend the following:  Voters should avoid using the “batch” submission option in SAFE’s snapshot UI. Snapshot has a known issue where only the last vote in a batch will be recorded. Anyone who’s experienced issues with Snapshot in the past should consider voting well before the end of a voting period to avoid a last-minute scramble.  If you do experience issues voting with Snapshot, please let the Foundation know as soon as possible by messaging #lavande3900 or bmd#6461 on Discord. Please be ready to provide as much information about the bug or issue as possible, including screenshots, console errors, or block explorer links. Keep in mind that votes will only be manually added to a Snapshot vote when the expected, bug-free outcome is unambiguous (for example, votes that are verifiable on-chain, but which did not propagate to the off-chain Snapshot tool). ",
                    "links": [
                        "https://gov.optimism.io/t/review-gf-phase-1-proposal-agora/3752",
                        "https://github.com/ethereum-optimism/OPerating-manual/blob/main/manual.md",
                        "https://github.com/snapshot-labs/snapshot/issues/3124",
                        "https://gov.optimism.io/t/it-is-time-for-on-chain-op-voting/3956/9",
                        "https://gov.optimism.io/t/recap-community-governance-call-december-6th/4268",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/22",
                        "https://gov.optimism.io/t/for-beginners-here/4598/2"
                    ],
                    "GPT-summary": "The post explains that the Foundation is transitioning to an on-chain voting system for Season 3 due to issues with the current voting infrastructure. Agora has been contracted to build an on-chain voting MVP. The post also provides recommendations for voters to ensure a smooth voting process and asks for feedback in case of any issues.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.732314560439561
                },
                {
                    "author_link": "https://gov.optimism.io/u/fig",
                    "index": "2",
                    "likes": "11",
                    "time": "06/12/2022-19:40:19",
                    "content": "This a big day for the forum, and greater Optimism governance. We are deeply supportive of the transition to an on-chain voting model. While Snapshot is a great tool, chain voting allows for the further decentralization of the ecosystem and signals maturity. And it seems to welcome more delegates who previously reported problems… We are excited to see continued development with Agora, using their infrastructure and grant from the Governance Fund to further the OP ecosytem. This a model of continued ROI and value-add. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party or author is advertising proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.654166666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "3",
                    "likes": "0",
                    "time": "06/12/2022-20:26:19",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/NathanVDH",
                    "index": "4",
                    "likes": "18",
                    "time": "07/12/2022-17:02:02",
                    "content": "Hi, I’m Nathan, delegate in Optimism governance and the ecosystem lead at Snapshot. Though as a delegate, I am excited about the Foundation’s move to on-chain voting, I find it disappointing that we haven’t been included in that discussion. Snapshot has worked very hard to fix the issues that faced delegates voting with Safes on L2. Today we haven’t seen any reports that such issues were still ongoing except for batch submissions, a known issue, and @millie who is using a forked version of the Safe contract that hasn’t been updated. A lot of the complaints about Snapshot date from late October, prior to our fix. I am perplexed that we weren’t included in the discussion about building an on-chain voting framework for Optimism. A public request for proposal would’ve been a fair and transparent way to debate options, and I hope that the Foundation will consider it for such an important step in their development. Creating voting infrastructure that scales is quite complex, and while I wish the best of luck to Agora, I think choosing battle-tested options for such an important matter makes sense. The transition to on-chain voting is good and necessary, but it’s not as clear-cut as it is currently made to be. Without taking into account the logical risks of trustless execution, Snapshot has been focusing for two years on increasing participation and fostering community engagement. If we take the example of Uniswap, which uses Snapshot to perform temperature checks and consensus checks before bringing the matter to a final vote, even though the final vote has a larger impact we see much lower participation numbers. Cost is not a factor here as the uni.vote interface allows voters to cast their vote for free. To take the numbers of the last proposal: temperature check on Snapshot: 2,457 votes consensus check on Snapshot: 3,807 votes (gasless) on-chain vote: 500 votes We are also releasing Boost in a few weeks (a bit of an alpha leak here) which will allow communities to reward their users for participating in governance. Boost will be another way to improve participation and decentralization. We are also open to discussing building an on-chain voting solution for Optimism, integrated into Snapshot, that should allow for the best of both worlds. We love Optimism at Snapshot, and we’ve always developed our platform as an open-source public good. This alignment with Optimism is something we value immensely, and we hope we can further cooperate on a solution that is on-chain, on Optimism, and committed to the right values. ",
                    "links": [
                        "https://snapshot.org/#/uniswap/proposal/0xe6ad2033b04559b3db6be7fa9993f05ee68f43f1061c632382c88e367e76bfb1",
                        "https://www.tally.xyz/gov/eip155:1:0x408ED6354d4973f66138C91495F2f2FCbd8724C3"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.851603835978835
                },
                {
                    "author_link": "https://gov.optimism.io/u/GFXlabs",
                    "index": "5",
                    "likes": "6",
                    "time": "07/12/2022-18:26:03",
                    "content": "This is wonderful news, and thank you, @lavande, for bringing it! Many of Optimism’s delegates – including several very large ones such as GFX Labs – are excited to see what @zcf and the rest of the Agora team can provide. On-chain voting will ensure a safe, fair, reliable ballot box for decentralized governance. We fully support this goal, and cannot wait to try Agora’s solution as soon as is practicable. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party or author is advertising proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.095982142857142
                },
                {
                    "author_link": "https://gov.optimism.io/u/jia001",
                    "index": "6",
                    "likes": "1",
                    "time": "22/12/2022-00:35:40",
                    "content": "This is wonderful news ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Vind",
                    "index": "7",
                    "likes": "0",
                    "time": "26/12/2022-07:53:03",
                    "content": "That sound great ! I am fully support this idea. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/Dreamygeek",
                    "index": "8",
                    "likes": "0",
                    "time": "26/12/2022-17:41:24",
                    "content": "Isn’t snapshot voting the best web3 industry has to offer right now? It has a familiar interface and users are already accustomed to this. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.767857142857142
                },
                {
                    "author_link": "https://gov.optimism.io/u/Luckymonkey",
                    "index": "9",
                    "likes": "0",
                    "time": "31/12/2022-05:51:11",
                    "content": "Only in Optimism!  I love this feature on On-Chain Voting coz every OP supporter are entitled to have a vote! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5625
                },
                {
                    "author_link": "https://gov.optimism.io/u/dennison",
                    "index": "10",
                    "likes": "9",
                    "time": "03/01/2023-18:01:36",
                    "content": "Hey folks! This is Dennison from Tally here. We are really excited to see the transition to On-Chain governance. We’ve been an advocate of Optimism for awhile now, even building RollCall for cross chain governance using Optimism!   GitHub    GitHub - withtally/rollcall: Cross chain governance libraries for rollups Cross chain governance libraries for rollups. Contribute to withtally/rollcall development by creating an account on GitHub.      We are excited to support Optimism governance on Tally and wanted to see if there is anything we can do to help the Optimism or Agora team and if there is any information we could have access to be sure to support OP Governance on day one. Thanks! Great start to 2023! ",
                    "links": [
                        "https://github.com/withtally/rollcall"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 6.5625
                },
                {
                    "author_link": "https://gov.optimism.io/u/Canphuoc",
                    "index": "11",
                    "likes": "0",
                    "time": "07/01/2023-10:59:44",
                    "content": "Good news I love Optimism governance. Let’s do better together ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.833333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/gebranrefikoi",
                    "index": "12",
                    "likes": "0",
                    "time": "10/01/2023-02:49:58",
                    "content": "On-chain voting system is good. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/kbbaspqrz",
                    "index": "13",
                    "likes": "0",
                    "time": "10/01/2023-04:23:01",
                    "content": "Snapshot is good, but is not enough. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/CryptoBunny",
                    "index": "14",
                    "likes": "0",
                    "time": "10/01/2023-11:29:13",
                    "content": "On chain voting in the snapshot is best to know how much members are actively be a part of the optimism community ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.777777777777779
                },
                {
                    "author_link": "https://gov.optimism.io/u/nivenhuttonu",
                    "index": "15",
                    "likes": "0",
                    "time": "11/01/2023-12:18:43",
                    "content": "Will on chain Voting be better than Snapshot？ ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/wafflearaldid",
                    "index": "16",
                    "likes": "0",
                    "time": "11/01/2023-13:07:38",
                    "content": "Snapshot is boring. We need on-chain voting. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 0.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Bms",
                    "index": "17",
                    "likes": "0",
                    "time": "12/01/2023-03:32:04",
                    "content": "on-chain voting,Nice ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/larkinrebickn",
                    "index": "18",
                    "likes": "0",
                    "time": "13/01/2023-13:46:30",
                    "content": "Sounds great！ When to start? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/reidelheggiem",
                    "index": "19",
                    "likes": "0",
                    "time": "14/01/2023-08:37:21",
                    "content": "Sonds great. It is better than Snapshot. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/gowensmeleym",
                    "index": "20",
                    "likes": "0",
                    "time": "14/01/2023-12:17:03",
                    "content": "Yes, I think so. Yes, I think so. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/timfame",
                    "index": "21",
                    "likes": "0",
                    "time": "17/01/2023-02:44:22",
                    "content": "Looks good  . But snapshot is not the best way. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/Limi",
                    "index": "22",
                    "likes": "0",
                    "time": "17/01/2023-06:31:54",
                    "content": "Great news, in my point of view  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/linx",
                    "index": "23",
                    "likes": "0",
                    "time": "17/01/2023-19:06:06",
                    "content": "This is wonderful news ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/zcf",
                    "index": "24",
                    "likes": "11",
                    "time": "02/02/2023-17:18:29",
                    "content": "Hey everyone!  Charlie from the Agora team here, wanted to give everyone a quick update. We’re really excited to be nearing the finish line to launch on-chain voting with Optimism. In preparation for this move, we plan to put up a test proposal and would like to invite anyone in the community to test trial the voting experience and provide us with any feedback or bugs. We want to make sure all wallets are supported. Look out for an announcement next week. In the meantime, please don’t hesitate to reach out if you have any questions! I am #zcf9299 on Discord ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.510416666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/tnorm",
                    "index": "25",
                    "likes": "4",
                    "time": "04/02/2023-08:28:56",
                    "content": "Great to see a grant recipient contributing to the progression of optimism governance. Look forward to what Agora and @zcf have put together. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/FractalVisions",
                    "index": "26",
                    "likes": "2",
                    "time": "04/02/2023-14:18:14",
                    "content": "Very exciting! Welcome to the Optimism ecosystem. We look forward to the on chain voting experience. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.21875
                },
                {
                    "author_link": "https://gov.optimism.io/u/dennison",
                    "index": "27",
                    "likes": "4",
                    "time": "07/02/2023-20:51:32",
                    "content": "Hey folks! Dennison from Tally.xyz here. Looking forward to this, let us know if we can help in anyway. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/cryptoneversleeps",
                    "index": "28",
                    "likes": "1",
                    "time": "09/02/2023-13:17:17",
                    "content": "good news. very excited about optimism ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.96875
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "29",
                    "likes": "7",
                    "time": "10/02/2023-14:53:44",
                    "content": "Our new Optimism Governance Portal, built by Agora, is live! https://vote.optimism.io/ All Token House votes will now occur on-chain. Proposals will continue to be routed to the Optimism Foundation for implementation. A test vote has been implemented and will run until February 16th, ahead of voting for the Bedrock Protocol Upgrade.  If you run into any issues during the test vote, let us know! The Optimism Governance Portal will serve as our delegate registry. There is no need to submit delegate commitments on the forum anymore. If you submitted a commitment w/o an address, please re-register by connecting your wallet at: https://vote.optimism.io/ and following the template listed on the forum: Delegate Commitments Over time, it will replace the Optimism delegate app as well. Thanks again to Agora, an Optimism grant recipient, for making this a reality! ",
                    "links": [
                        "https://vote.optimism.io/",
                        "https://gov.optimism.io/t/delegate-commitments/235",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/32"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.749289772727273
                },
                {
                    "author_link": "https://gov.optimism.io/u/0x666",
                    "index": "30",
                    "likes": "1",
                    "time": "10/02/2023-15:14:54",
                    "content": "i just want to vote,i don’t want to submit delegate profile… consider not force delegate profile if user don’t want to receive others delegation ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/FractalVisions",
                    "index": "31",
                    "likes": "2",
                    "time": "10/02/2023-18:21:05",
                    "content": "Agora looks very  nice. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.9
                },
                {
                    "author_link": "https://gov.optimism.io/u/dennison",
                    "index": "32",
                    "likes": "2",
                    "time": "11/02/2023-02:14:06",
                    "content": "Hey folks, congrats! It will probably take us a few days before we have it up and running on Tally, but excited to see this! For other voting platforms such as Tally, Boardroom, Sybil and others, will Optimism be making the Delegation statements public as well? Would be great to be able to display those too. Congrats again to the transition to on-chain governance! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.120535714285714
                },
                {
                    "author_link": "https://gov.optimism.io/u/MoneyManDoug",
                    "index": "33",
                    "likes": "2",
                    "time": "11/02/2023-04:50:42",
                    "content": "Great to see this transition, hopefully this brings much relief to our previously stuck delegates. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.388888888888888
                },
                {
                    "author_link": "https://gov.optimism.io/u/Sukey",
                    "index": "34",
                    "likes": "2",
                    "time": "11/02/2023-11:08:03",
                    "content": "Waiting for this day since long time! OP ecosystem is growing and for sure we will have all native toolings developed within our ecosystem without any 3rd party dependency. I would recommand all community to go there and try your first vote on Agora, you will gonna love it.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 6.072916666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/FractalVisions",
                    "index": "35",
                    "likes": "1",
                    "time": "11/02/2023-21:09:15",
                    "content": "Lovin it so far ! I am happy to see on chain voting … ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.3125
                },
                {
                    "author_link": "https://gov.optimism.io/u/linx",
                    "index": "36",
                    "likes": "1",
                    "time": "11/02/2023-21:21:51",
                    "content": "Support it. Stay optimistic!) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Saludiego201",
                    "index": "37",
                    "likes": "2",
                    "time": "12/02/2023-04:18:37",
                    "content": "I recently joined Optimism as a Delegate because of this news, onchain voting is more valuable to me than Snapshot voting. Previous participations in governance and forums give me to my criteria to understand that this type of voting allows to be more realistic and increase the seriousness of the process. If you would like to stop by and support a new delegate with some experience you can find my profile here. Delegate | Saludiego201.eth ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.946969696969697
                },
                {
                    "author_link": "https://gov.optimism.io/u/npatel",
                    "index": "38",
                    "likes": "2",
                    "time": "12/02/2023-06:04:33",
                    "content": "Really Cool, So now we need to delegate to Agora governance ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/FractalVisions",
                    "index": "39",
                    "likes": "1",
                    "time": "12/02/2023-06:30:16",
                    "content": "Welcome  to the ecosystem!!! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/hank",
                    "index": "40",
                    "likes": "1",
                    "time": "12/02/2023-13:08:13",
                    "content": "This is the things that will take Optimism to the highest level. Voting is the fundamentally the most important problem to optimize and keep on improving. Great work again team Optimism! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 8.166666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/hank",
                    "index": "41",
                    "likes": "2",
                    "time": "12/02/2023-18:34:37",
                    "content": "Let the best solution win. We can just try and fail, try and succeed repeat over and over again. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.166666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/chaselb",
                    "index": "42",
                    "likes": "3",
                    "time": "14/02/2023-18:13:41",
                    "content": "Is the front-end and solidity contract code open source? If so, where can we find it? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/tosla",
                    "index": "43",
                    "likes": "1",
                    "time": "17/02/2023-14:26:23",
                    "content": "vote  not on snapshot,on optimism,this is right ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.428571428571428
                },
                {
                    "author_link": "https://gov.optimism.io/u/Mark_De.Fi",
                    "index": "44",
                    "likes": "2",
                    "time": "17/02/2023-17:08:52",
                    "content": "I think this transition is quite important and definitely has its advantages (as well as disadvantages for those who like Snapshot) Thanks for this opportunity and actually switching to Agora gives a much more convenient use of Governance rights imo ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving positive feedback on proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.1
                },
                {
                    "author_link": "https://gov.optimism.io/u/Axel_T",
                    "index": "45",
                    "likes": "2",
                    "time": "21/02/2023-00:15:59",
                    "content": "The new user interface looks good. I love that the voting location is a subdomain of optimism.io I just appear to have been 17 hours late, and missed the Test Vote  Looking forward to the first post-test proposals. EDIT: OP Governance Calendar? Where have you been all my life!?!?!?! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving positive feedback on proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.646715198863636
                },
                {
                    "author_link": "https://gov.optimism.io/u/zcf",
                    "index": "46",
                    "likes": "3",
                    "time": "28/02/2023-03:02:40",
                    "content": "Just wanted to say that Optimism is such an awesome community… It’s been a pleasure for our team interacting and working with the community here while building Agora, everyone’s so friendly, positive and helpful – from the Foundation to the people that I out-of-the-blue DM who responds back to me — thank you  Optimism Agora is still in beta and by no means a complete product. There’s still a ton of work left to be done, and improvements to be made. We’ve heard so much great feedback and want to implement all those changes. So we’ve made a separate thread here to help consolidate all the feedback and keep the community up to date as we make improvements and updates to vote.optimism.io!     Agora (vote.optimism.io) Feedback Thread 🏛 Governance       Hey everyone   Charlie here from team Agora.  Really appreciate everyone for trying out Optimism Agora Beta with the first test proposal and giving us such helpful feedback.  We’ve been reading all the posts, comments, and messages on Discord/Twitter/Discourse, and really appreciate the thoughtful responses. Special thank you to @lavande, @diligit, @TanBinh and the other mods for helping us triage, loop into convos and surface great feedback.  The feedback has been invaluable as we work to…     Thank you for being part of this journey with us since the early beta to building a first-class experience for Optimism. ",
                    "links": [
                        "https://gov.optimism.io/t/agora-vote-optimism-io-feedback-thread/5358"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.43659281894576
                }
            ]
        }
    ],
    "group_index": "365"
}