{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/review-gf-phase-1-proposal-cycle-7-ethernautdao/3500",
            "title": "[Review] [GF: Phase 1 Proposal Cycle 7] EthernautDAO ",
            "index": 3500,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Governance Fund: Phase 1"
            ],
            "tags": [
                "cycle-7"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "1",
                    "likes": "6",
                    "time": "20/09/2022-00:40:52",
                    "content": "Project Name: EthernautDAO Author Name: Dhannte, Twitter: https://twitter.com/DhannteG Reliable point of contact: Discord all dms open: #Dhannte1010 Twitter all dms open I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: [Yes/No] Yes I understand L2 Recipient Address: EthernautDAO multisig: 0x2431BFA47bB3d494Bd720FaC71960F27a54b6FE7 Signers:     Alejandro Santander theethernaut.eth     Gonzalo Diez dhannte.eth   Alberto Cuesta Cañada albertocuesta.eth   Ralf platschi.eth   Matias Lescano 0x117A5B25cEBb440C768a8dBFab0B4C0C2790Cb82   Sebas saeta.eth   Will wschwab.eth   Mario m4rio.eth    Grant category: Is this proposal applicable to a specific committee? [y/n, link to the committee] Yes, Tooling Project description (please explain how your project works): What is Ethernaut DAO It is a senior developer’s bridge from web2 to web3. As we see Ethereum’s body grow we need the head to get bigger too and this means people who can program smart contracts.  How does it work   3 types of mentorship  For a team (the project provides the mentor) Public good (someone wants to give free knowledge) Recruiting (a project asks the DAO for a mentor and pays)    We provide a place for mentors to post what they want to teach.   Mentees apply for mentorship   The mentor picks someone and the mentoring starts    Process We give guidelines on how this should be done, but each team, mentor, and mentees have its learning process and necessities. We believe in a 2-month process  First 2 weeks(4 hs/week): Low time effort, mentor and mentee talk about what the mentee knows, what he built, they set where to start. 3rd and 4th (6hs a week) week build or hack a small solidity project. 5th and 6th week (12 hs/week) start committing PRs for some project and start showing the mentee the value it can be borrowed to the space. (Start talking about salaries and possible positions and leave the web2 job) 7th and 8th week (20 hs/week) fully contributing.   Our difference  We are a public good project and we do not charge developers to learn nor mentors to teach. When mentorship is in progress we enable the mentor or mentee to ask for funds to cover the non-paid time they put in.  Project links:  Web: http://ethernautdao.io/  Mirror: https://ethernautdao.medium.com/  Twitter: https://twitter.com/EthernautDAO  GitHub: https://github.com/ethernautdao/  Gitbook https://docs.ethernautdao.io/  Discourse https://forum.ethernautdao.io/   Additional team member info (please link): Council members: The ethernaut: https://twitter.com/the_ethernaut theethernaut.eth https://github.com/ajsantander  Will Schwab: https://twitter.com/wschwab_ Wschwab.eth https://github.com/Wschwab  Mario https://twitter.com/m4rio_eth M4rio.eth Karmacoma: https://twitter.com/0xkarmacoma Karmacoma.eth https://github.com/karmacoma-eth  Ralf https://twitter.com/platschi Platschi.eth Dhannte (Gonzalo Diez) https://twitter.com/DhannteG Dhannte.eth Please link to any previous projects the team has meaningfully contributed: The Ethernaut: Synthetic core contributor / EthernautDAO founder Will: founding members of the ethereum cat herders, former Solidity team lead @ Linum Labs current: smart contracts team lead @ Polygon. Mario: optimarket, bears deluxe onchain game, security auditor. Karmacoma: showtime.xyz and smol-evm Ralf: Kwenta, OptiMarket Dhannte: EthernautDAO founder, BanklessDAO research guild founder. Relevant usage metrics (TVL, transactions, volume, unique addresses, etc. Optimism metrics preferred; please link to public sources such as Dune Analytics, etc.): 33 successful Solidity mentorships with new devs trained in less than 1 year, of which 80% are smart contract CC developers today for various projects on Optimism, such as Synthetix, Aelin, Kwenta, Yield, and Optimism itself. Competitors, peers, or similar projects (please link): only peers, DevDAO. Is/will this project be open-sourced? Yes Optimism native?: Yes Date of deployment/expected deployment on Optimism: deployed Ecosystem Value Proposition: Our main goal is to rapidly transform senior (web2) developers into senior Solidity developers. We do so by incentivizing experienced Solidity mentors but at the same time compensating those who create and share educational, curated and updated content for developers to follow and learn. Projects like Austin Griffith’s speed run, Ethernaut game from Open Zeppelin, and CryptoZombies are used by hundreds of devs and were never compensated properly. We are starting the distribution of Ethernaut EXP (ERC20 “soulbound” tokens on Optimism: EthernautExperience (EXP) Token Tracker | Optimism) to the community members who make these contributions, mentor new developers and add real value to the space (and a cool on-chain free-to-mint NFT to show off their experience level). We focus on pairing mentors and mentees for tailored mentorships and provide whatever they need. Our community is open and free to join, what we build is open source, and we focus on free educational content forever. We are a public goods DAO for developers adding verifiable value to the space.  Problem to solve:  We need more developers and better trained on how to bring big projects to Optimism.  How does your proposal offer a value proposition for solving the above problem?  By training senior developers actual teams can be expanded not only on the code side but also in coordination. It’s easy to have a 2/5 developer team but once it grows you need experienced developers in project managing to expand and grow. This seniority is only achievable with experience and those are the developers we want to migrate from the big web2 tech industry.  Why will this solution be a source of growth for the Optimism ecosystem?  Seniority will bring a more robust ecosystem, where quality and quantity will improve exponentially. EthernautDAO will become the way to go to expand developer teams that are always aligned with Optimim’s vision and culture. Has your project previously applied for an OP grant? If successful, please link to your previous grant proposal and provide a brief update on milestones achieved with the grant. If unsuccessful, and this is a resubmission, please specify how you have incorporated significant changes in accordance with feedback. We applied only as a Draft to get feedback and re-think how we wanted to apply. We never changed the Draft status: Old Proposal link  Number of OP tokens requested: 600.000 Did the project apply for or receive OP tokens through the Foundation Partner Fund?: No If OP tokens were requested from the Foundation Partner Fund, what was the amount?: How much will your project match in co-incentives? (not required but recommended, when applicable): Our fund will act as a pre-filter. Mentors will be able to ask for funds but those are going to be provided by the DAO’s own treasury. Only if the mentorship is successful and the new developer is hired into a project deploying in optimism OP tokens in the DAO treasury will cover the expenses. Proposal for token distribution: 240.000 OP will be given to future mentors. Each mentor will receive 3000 OP (if requested) for every successfully trained developer with up to 9000 OP until the pool dries up. When a mentor requests funds EthernautDAO will cover with its own treasury and only if successful the OP tokens will compensate the expense. We want to shield OP tokens from bad operators at our own expense. Trained devs will be tracked and reported in the forum when they integrate into any project deploying on Optimism. 360.000 OP will go to a monthly claim like this:  First-year 10.000 OP/monthly Second-year 20.000 OP/monthly  We combine a soulbound token (EXP) given to educational contributors with OP tokens as a liquid and transferable asset. Any developer holding (EXP) will be enabled to proportionally claim OP tokens on a monthly basis. EXP is earned by mentoring (10 EXP), creating developer educational content (3 EXP), hacking smart contracts (3 EXP), and reporting those hacks with educational content (3 EXP). We encourage these community members to provide liquidity and vote for Optimism proposals, but we will not enforce them. Every user is free to use their OP tokens as they see fit. A Cap at 99 EXP is considered for now. Claimable OP will follow this function: F(x) = x5 - 4 Claimable OP = 5 * (EXP balance) - 4 This will result in 1EXP = 1 claimable OP 99 EXP (max lvl) = 491 claimable OP EthernautDAO will keep up to 40 ETH from donations in the treasury, with the surplus going to the Uniswap OP/ETH liquidity pool. This process will be rebalanced every 3 months. (OP tokens are not considered part of Ethernaut DAO 40 ETH treasury). ",
                    "links": [
                        "http://ethernautdao.io/",
                        "https://ethernautdao.medium.com/",
                        "https://twitter.com/EthernautDAO",
                        "https://github.com/ethernautdao/",
                        "https://docs.ethernautdao.io/",
                        "https://forum.ethernautdao.io/",
                        "https://twitter.com/the_ethernaut",
                        "https://github.com/ajsantander",
                        "https://twitter.com/wschwab_",
                        "https://github.com/Wschwab",
                        "https://twitter.com/m4rio_eth",
                        "https://twitter.com/0xkarmacoma",
                        "https://github.com/karmacoma-eth",
                        "https://twitter.com/platschi",
                        "https://twitter.com/DhannteG",
                        "https://optimistic.etherscan.io/token/0x6354ce7509fb90d38f852f75b7a764eca6957629",
                        "https://gov.optimism.io/t/draft-gf-phase-1-ethernautdao-dev-education/2862",
                        "https://gov.optimism.io/t/review-gf-phase-1-proposal-cycle-8-ethernautdao/3800",
                        "https://gov.optimism.io/t/voting-cycle-7-roundup/3586/3"
                    ],
                    "GPT-summary": "The post is a proposal for EthernautDAO, a public good project that aims to train senior developers to become senior Solidity developers. The proposal explains how the project works, its goals, and how it plans to use the requested 600,000 OP tokens. The post also provides links to the project's website, social media accounts, and team members' information. The proposal is open-sourced and aims to incentivize experienced Solidity mentors while compensating those who create and share educational content for developers to follow and learn. The proposal also plans to distribute Ethernaut EXP tokens to community members who make contributions and mentor new developers.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Smart contract updates",
                        "Identity and reputation systems",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.84063555492127
                },
                {
                    "author_link": "https://gov.optimism.io/u/ethernaut",
                    "index": "2",
                    "likes": "4",
                    "time": "20/09/2022-11:59:34",
                    "content": "    Gonna.eth:  It is a senior developer’s bridge from web2 to web3. As we see Ethereum’s body grow we need the head to get bigger too and this means people who can program smart contracts.   A grant like this could really kick start incentive alignments in the EthernautDAO  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.69047619047619
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "3",
                    "likes": "4",
                    "time": "20/09/2022-17:22:27",
                    "content": "need to spend some more time w this but really like that you all are applying now and generally think this really helps the dev pipeline for Optimism i also like the idea of finding uses for OP while it’s waiting to be distributed and would def like to think through the scope of what might be possible here ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.949999999999999
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "4",
                    "likes": "2",
                    "time": "20/09/2022-17:48:21",
                    "content": "Thank you, I hope you can chime in some of your ideas into this proposal and hopefully open your own mentorship with EthernautDAO to expand the Velo devs team and claim some OP on the way. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party wanting to collaborate on proposal",
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/MattL",
                    "index": "5",
                    "likes": "3",
                    "time": "22/09/2022-15:59:16",
                    "content": "I am an Optimism delegate [Delegate Commitments - #65 by mastermojo] with sufficient voting power, and I believe this proposal is ready to move to a vote. The EthernautDAO is one of the best DAOs in all of DeFi, and I want to see it shine on Optimism. Great proposal! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 8.666666666666668
                },
                {
                    "author_link": "https://gov.optimism.io/u/phatnguyen",
                    "index": "6",
                    "likes": "2",
                    "time": "23/09/2022-13:29:33",
                    "content": "This proposal seems to be ready for voting stage ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/mastermojo",
                    "index": "7",
                    "likes": "2",
                    "time": "23/09/2022-17:26:43",
                    "content": "I am an Optimism delegate [Delegate Commitments - #65 by mastermojo ] with sufficient voting power, and I believe this proposal is ready to move to a vote ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Butterbum",
                    "index": "8",
                    "likes": "1",
                    "time": "02/10/2022-18:44:51",
                    "content": "Hey there @Gonna.eth I like the idea it’s an innovative way to teach and educate, and is much needed in the Solidity space. The only issue I see is running this program for 2 years. I believe the guidelines are asking for distribution programs to run on shorter time frames, to be able to gauge the impact of the allocation. Spreading it over multiple years defeats the perpetual nature of the Fund. Are there any specific reasons for running a 2 year program? What would the implication be for EthernautDAO to run a 6 month distribution program? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Defi_LATAM_axlvaz",
                    "index": "9",
                    "likes": "1",
                    "time": "03/10/2022-05:25:44",
                    "content": "    Gonna.eth:  240.000 OP will be given to future mentors. Each mentor will receive 3000 OP (if requested) for every successfully trained developer with up to 9000 OP until the pool dries up.   Do you have a list of mentors, could you explain how you select the mentors? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "10",
                    "likes": "2",
                    "time": "03/10/2022-12:06:07",
                    "content": "Good question! We do not select mentors. We do make a follow-up on mentors, mentees, and what they are teaching/learning. Anyone with proven knowledge (mostly GitHub history) can open a mentorship here following the template provided: https://forum.ethernautdao.io/ Mentees can apply (answers are private to the mentor for privacy) Once the mentees are selected by the mentor the forum proposal is closed and I keep in touch with both mentor and mentee. To request OP the mentor needs to open a request proposal and must be approved by the community. This proposal must show what mentor and mentee are building and deploying in Optimism. Most op teams use this to grow their teams and build more and better products in Optimism. let time know if this is clear enough please we want everyone to understand we are building something open source with an open DAO free for anyone who wants to join. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.0859375
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "11",
                    "likes": "2",
                    "time": "03/10/2022-12:12:53",
                    "content": "We do have a list of past mentors but they can’t apply unless they open a new mentorship:     Alejandro Santander https://twitter.com/the_ethernaut     Jeremy Chiaramonte https://twitter.com/_jchiaramonte   Cris Garner https://twitter.com/crisgarner   Austin Griffith https://twitter.com/austingriffith   Alberto Cuesta Cañada https://twitter.com/alcueca   Will Schwab https://twitter.com/wschwab_   Fabricio https://twitter.com/fabdaRice   Kelvin Fichter https://twitter.com/kelvinfichter   Gallo Da Sballo https://twitter.com/GalloDaSballo   Manuel Araoz https://twitter.com/maraoz   Matias Lezcano https://twitter.com/_mjlescano   jowguick#9615 https://twitter.com/jowguick   Alex the lizard https://twitter.com/AlexTheLizzzard   Bayological https://twitter.com/bayological   Eric Vander Wal https://twitter.com/TheVanderWal     ",
                    "links": [
                        "https://twitter.com/_jchiaramonte",
                        "https://twitter.com/crisgarner",
                        "https://twitter.com/austingriffith",
                        "https://twitter.com/alcueca",
                        "https://twitter.com/wschwab_",
                        "https://twitter.com/fabdaRice",
                        "https://twitter.com/kelvinfichter",
                        "https://twitter.com/GalloDaSballo",
                        "https://twitter.com/maraoz",
                        "https://twitter.com/_mjlescano",
                        "https://twitter.com/jowguick",
                        "https://twitter.com/AlexTheLizzzard",
                        "https://twitter.com/bayological",
                        "https://twitter.com/TheVanderWal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 4.8106060606060606
                },
                {
                    "author_link": "https://gov.optimism.io/u/MantisClone",
                    "index": "12",
                    "likes": "0",
                    "time": "03/10/2022-14:13:36",
                    "content": "Wow! This would be an amazing resource to grow EthernautDAO and support the Optimism ecosystem. Nice work! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.458333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/SEED_LATAM_Joxes",
                    "index": "13",
                    "likes": "1",
                    "time": "17/10/2022-19:49:06",
                    "content": " 1. Presentation  We are an officially recognized Tooling Governance Committee, responsible for assessing proposals related to tooling and infrastructure (wallets, bridges etc.).  2- About the project  EthernautDAO is essentially a bridge to help developers from web2 enter web3. The issue at hand is that while “there are millions of exceptionally skilled and experienced senior developers out there, senior Solidity developers remain scarce.” This project, if successful, would help improve the quality of developers in the Optimism ecosystem. Its mentorship model is one that’s been proven effective in other contexts, and would ensure any developer is vetted carefully before they join a new project. The ‘educational stipend’ component EthernautDAO also works closely with Synthetix, which is an aligned ecosystem partner.  3- About the following  The proposal was published on July 2nd asking for 1m OP tokens. The debate on the forum largely came down to the degree of value add the approach EthernautDAO was taking provided, amount requested, and whether funding should come from RPGF given that the project considered itself a “public good”. As a Tooling committee, the project was recently catalogued as “Tooling” in the Grant category, and so we’ve taken on the responsibility of issuing a recommendation.  4- About the proposal valuation    Added value (good to bad): good. Education in Web3 and access to tools is currently a recurring problem, and Ethernaut is clearly making strides in this direction. There’s clearly a good amount of value add by teaching more people solidity and placing them in relevant roles.  Impact or expected usage (high to low): medium. One downside of the mentorship model is simply scale, it’s unclear how many developers can be put through this program and whether it will scale with the needs of the Optimism ecosystem vs. something like the quests approach being undertaken now. It also requires consistent attention from the team cohort over cohort, and while this has been true in the past it’s not necessarily an indication of full future commitment.  Current Status [Development stage/Open Source?] (early to ready): ready. The project is active now and in use by Synthetix IIRC.  Expenditure plan and distribution (appropriate to inappropriate): needs improvement. We think the current distribution of tokens is good on a per developer basis, but have questions about whether or not it’s realistic to expect that they can train over 100 new developers at a meaningful level of quality. I’d love to understand more about the current throughput and expected growth beyond the 30+ devs already trained. I’m also not super clear on how quality is measured in the educational stipend (360k) as compared with mentor payments (240k), where payment is directly tied to placement.  Amount requested (high to low): medium. As above, we think the plan needs more detail before we can really claim that this budget is too high, it might very well be on point for their expected throughput.   5. KPIs and impact tracking We’d love to see more detailed metrics around how each developer is trained and what measures of quality are being used (when is a developer ‘trained’), and what examples of educational content that have been effective thus far look like. I’d also love to understand how Ethernaut is prioritizing which projects to place developers at. Given that they’re working with Synthetix, it’d be good to have some guarantee of equal access to these devs from projects in Optimism ecosystem, especially if this scales up to become a major pathway for new developers. We encourage the community stay in touch with the team if this proposal passes.  6- FINAL RECOMMENDATION: No (revision to 300k) We are inclined to give Ethernaut an initial stipend of 300k or so to work with at ~$1 / token, with a recommendation that they reapply for the second half of funding after publishing a further progress report.  We apologize for the delays during this cycle. Our work was mostly done on time but we had delays with the final confirmation from each member to properly publish our recommendations with the proper consensus (this was due to devcon week, but we recognize this is not an excuse). We promise that this situation will not happen again and we will carry out the respective improvements of the process and we will share our learnings received during this cycle. Thank you for patience. ",
                    "links": [
                        "https://gov.optimism.io/t/tooling-committee-season-2-recommendations/3551/10"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None"
                    ],
                    "Sentiment": 5.885901239283592
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "14",
                    "likes": "2",
                    "time": "17/10/2022-23:47:50",
                    "content": "    SEED_LATAM_Joxes:  We are inclined to give Ethernaut an initial stipend of 300k or so to work with at ~$1 / token, with a recommendation that they reapply for the second half of funding after publishing a further progress report.   Yes, we were thinking about this. Thank you for the feedback we will re write this proposal with less funds and a short term to show progress and real analytics. We will also try to answer some of your questions regarding how to track this mentorships. We skipped this cycle because one of our 0.5% delegate approvals (Ethernaut) is founder of the project and it was an edge case for a delegate to approve his own project. We are also considering setting a time frame and reimburse the OP tokens to the foundation if this doesn’t work as intended. (we would love some feedback on this idea) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.537037037037037
                },
                {
                    "author_link": "https://gov.optimism.io/u/ScaleWeb3",
                    "index": "15",
                    "likes": "1",
                    "time": "18/10/2022-00:46:32",
                    "content": "The proposed fund usage of onboarding mentors + devs should be very positive for Optimism. Some of the mentioned program specifics are interesting and might add some unique touch though we don’t believe you need a super sophisticated XP system to make this program work. Offering matchmaking, content, basics/advanced mentoring & support by mentors of the quality of prev contributors and some oversight from your side & approximate pricing per task would be great. The Initial Ask seemed very large. A re-fillable Tank of 200K - 300K OP seems more reasonable as there need to be enough funds to professionally set up the program, yet Optimism should not hand out too much funds at once without check-ins and give full control over funds spending to projects. Hence, we also like your idea of giving excess funds back. That’s in line with our thinking of defining a reasonable Ask for an Initiative for the next 6 months (for some projects, 1 month might also be enough to test 2, 3 growth approaches), assessing the success and adding more to the refillable tank or reclaim funds for Optimism grants. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 6.198180787466502
                }
            ]
        }
    ],
    "group_index": "260"
}