{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/delegate-code-of-conduct/3943",
            "title": "Delegate Code of Conduct ",
            "index": 3943,
            "category": [
                "\\xf0\\x9f\\x93\\x8c Policies and Templates"
            ],
            "tags": [
                "season-3"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/system",
                    "index": "1",
                    "likes": "79",
                    "time": "08/11/2022-19:57:01",
                    "content": " Delegate Code of Conduct Scope: This code of conduct applies to active delegates of the OP Token House. This code of conduct applies within all community spaces and when an individual is representing the community in public, either online or offline. The Rules of Engagement specifically pertaining to the Forum can be found here. This Code of Conduct will go into effect at the start of Special Voting Cycle #9a. The delegate code of conduct will not cover all possible scenarios and edge cases. We ask that delegates please act in accordance with the spirit of the code of conduct and refrain from exploiting loopholes that may exist.   Inclusivity  There will be no tolerance for discrimination against any person based on geographical, ethnic, sexual, religious, or other identifying features. Delegates should be respectful of differing viewpoints and experiences and show empathy towards community members. Pertinent delegate communications should be transparent and public. Communication in public is favored over DMs/private communication, whenever possible.   Extreme Civility   Delegates should provide constructive feedback supported by high quality and well researched arguments. Delegates must not personally attack the opinions or personal merits of proposal authors or any other party engaging in governance activity. Delegates must not make unsubstantiated claims to advocate for or against any proposal or proposal author.   Delegates must always act in a professional manner. The following behaviors are unacceptable and will not be tolerated:  Public or private harassment The use of sexualized language or imagery and unwelcome sexual attention or advances Intentionally publishing others’ private information, such as a physical or electronic address, without explicit permission    Delegates should actively discourage others breaking this code of conduct. Delegates should report serious or repeat offenses, as outlined below.   Delegates must abide by the Rules of Engagement when communicating on the Forum.    Good Faith and Best Interest  Delegates must act with honesty, integrity, and transparency, at all times. Delegates should operate in a way and vote in accordance with what they believe is in the best interests of the Optimism Collective.   Due Care and Attention  Delegates should maintain a working knowledge of developments at Optimism and in the wider cryptocurrency space. Delegates should make a professional and unbiased review of each proposal prior to voting. Delegates that are unable to review proposals should abstain from voting. Delegates are encouraged to maximize their voting participation rate, to the best of their ability. Delegates are encouraged to shape the development of Optimism’s governance structure by providing feedback during Reflection Periods.   Accountability   Delegates must uphold all delegate commitments.   Delegates that serve on the Grants Council must uphold the responsibilities outlined in the approved Grants Council proposal    No Self-Dealing  Delegates must avoid conflicts of interest where possible and mitigate their impact when not possible. We recommend over-communicating and disclosing potential conflicts of interest even when they do not warrant abstaining from a vote.   Any actual or reasonably anticipated conflicts of interest must be disclosed in writing and prominently displayed ahead of any voting (ie. when submitting delegate commitments, when running for an elected position, when making public recommendations, etc.).   Any offer for external compensation related to delegation or the Optimism Protocol must be promptly disclosed.   Delegates are prohibited from approving and voting on their own proposals. Delegates may not vote for their own candidacy in an election. In the case of approval/ranked choice votes, delegates may vote for themselves, so long as they also cast votes for the remaining elected positions. Example: I can vote for my own candidacy on the Growth Experiments committee, so long as I also cast 4 additional votes (a total of 5 votes, as there are 5 open positions on the sub-committee.)     Additionally, protocols participating in the Protocol Delegation Program must:  Abstain from using voting power delegated via the Protocol Delegation Program on any proposals that involve a direct competitor Abstain from providing voting recommendations to the general public, separate from any representative’s participation on the Grants Council    Reporting All delegates are expected to abide by this code of conduct. Any delegate that is found to be in breach of this code of conduct, will be subject to the below enforcement procedures.  Individuals who wish to report a breach should do so using this reporting form. The Foundation will review the submissions. The identity of a submission author will not be publicly disclosed by the Foundation without the author’s consent. Submission authors and/or the delegates in question may be contacted by the Foundation for additional information, if necessary. In future Seasons, the Foundation expects to reduce its role in this process.   Enforcement There are a variety of possible enforcement actions, depending on the severity of the offense:     Enforcement Type Type of Violation Enforcement Consequence     Warning First instance of inappropriate language or other behavior deemed unprofessional or unwelcome in the community, which is not already flagged by moderators on Discord or Discourse. In Season 3, the Foundation will process and issue reported warnings. A private, written warning from the Foundation, providing clarity around the nature of the violation and an explanation of why the behavior was inappropriate. A public apology may also be requested.   Temporary Suspension A serious violation of community standards, including sustained inappropriate behavior. In Season 3, the Foundation will process and issue temporary suspensions. A temporary ban, lasting the length of 1 month, from Discord and Discourse. No public or private interaction with the community members involved, including unsolicited interaction with those enforcing the Delegate Code of Conduct. Violating these terms may lead to longer term suspension.   Suspension Repeated violation of community standards, including sustained inappropriate behavior, or severe violation, including discrimination, harassment, intentional doxxing, dishonesty, or  undisclosed self-dealing. Token House must vote to suspend delegates that are reported to have committed severe violations, using the Delegate Suspension proposal type to be outlined in the operating manual. If a vote for suspension is approved by the Token House, the delegate will be suspended from Discord and Discourse and any sort of interaction within the community for a period of three months. Protocols receiving delegation via the Protocol Delegate Program will lose the corresponding delegation for the remainder of the Season.      Attribution   Maker’s Recognized Delegate Code of Conduct  Friends with Benefit’s Code of Conduct  Python’s Discord Code of Conduct  Gitcoin’s Code of Conduct  Radicle’s Code of Conduct   ",
                    "links": [
                        "https://gov.optimism.io/t/code-of-conduct/5",
                        "https://gov.optimism.io/t/delegate-commitments/235",
                        "https://docs.google.com/forms/d/e/1FAIpQLSeWdV673xKAUpu3PmeWapKW_PEnyVv0Bk8KLgD0Ysywol2geg/viewform",
                        "https://forum.makerdao.com/t/recognised-delegate-code-of-conduct/9384",
                        "https://github.com/friends-with-benefits/codeofconduct/blob/main/code.md",
                        "https://pythondiscord.com/pages/code-of-conduct/",
                        "https://support.gitcoin.co/gitcoin-knowledge-base/gitcoin-policy/code-of-conduct",
                        "https://radicle.community/t/updating-our-code-of-conduct/2667",
                        "https://gov.optimism.io/t/special-voting-cycle-9a-protocol-delegation-program/4200",
                        "https://gov.optimism.io/t/governance-update-5/4397",
                        "https://gov.optimism.io/t/grants-council-membership-information/4101",
                        "https://gov.optimism.io/t/grant-council-reviewer-nominations/4372/3",
                        "https://gov.optimism.io/t/grant-council-reviewer-nominations/4372/5",
                        "https://gov.optimism.io/t/grant-council-reviewer-nominations/4372/6",
                        "https://gov.optimism.io/t/grant-council-reviewer-nominations/4372/7",
                        "https://gov.optimism.io/t/grant-council-reviewer-nominations/4372/8",
                        "https://gov.optimism.io/t/grant-council-reviewer-nominations/4372/9",
                        "https://gov.optimism.io/t/grant-council-reviewer-nominations/4372/10",
                        "https://gov.optimism.io/t/grant-council-reviewer-nominations/4372/11",
                        "https://gov.optimism.io/t/operating-manual-v0-3/4834",
                        "https://gov.optimism.io/t/draft-proposal-moving-to-a-grants-council/3945",
                        "https://gov.optimism.io/t/grant-council-reviewer-nominations/4372/12",
                        "https://gov.optimism.io/t/grants-council-achieving-aims-in-season-3/4831",
                        "https://gov.optimism.io/t/badgeholder-conflict-of-interest-disclosures/5569",
                        "https://gov.optimism.io/t/operating-manual-v0-3-2/5468",
                        "https://gov.optimism.io/t/badgeholder-conflict-of-interest-disclosures/5569/4",
                        "https://gov.optimism.io/t/grant-council-reviewer-nominations/4372/13",
                        "https://gov.optimism.io/t/special-voting-cycle-9a-grants-council/4198",
                        "https://gov.optimism.io/t/grant-council-reviewer-nominations/4372/14",
                        "https://gov.optimism.io/t/grant-council-reviewer-nominations/4372/15",
                        "https://gov.optimism.io/t/draft-proposal-moving-to-a-grants-council/3945/43",
                        "https://gov.optimism.io/t/guide-to-season-3-course-correcting/3942",
                        "https://gov.optimism.io/t/council-reviewer-self-nomination-gonna-eth-dhannte/4104",
                        "https://gov.optimism.io/t/draft-proposal-protocol-delegation-program/3946",
                        "https://gov.optimism.io/t/grant-council-reviewer-nominations/4372/16",
                        "https://gov.optimism.io/t/grant-council-reviewer-nominations/4372/17",
                        "https://gov.optimism.io/t/special-voting-cycle-9a-protocol-delegation-program/4200/12"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.542295918367347
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "2",
                    "likes": "0",
                    "time": "08/11/2022-19:57:04",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "3",
                    "likes": "0",
                    "time": "08/11/2022-20:29:07",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "4",
                    "likes": "9",
                    "time": "08/11/2022-21:44:27",
                    "content": "This was much needed, last season was a rough road and happy to see foundation taking action in right direction. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.071428571428571
                },
                {
                    "author_link": "https://gov.optimism.io/u/theenlightened",
                    "index": "5",
                    "likes": "5",
                    "time": "08/11/2022-22:04:25",
                    "content": "Explicitly worded in simple and clear English . ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.166666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "6",
                    "likes": "6",
                    "time": "09/11/2022-07:18:05",
                    "content": "This looks like natural behavior thank you for taking the time to write it! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "7",
                    "likes": "6",
                    "time": "09/11/2022-11:47:14",
                    "content": "The code of conduct makes sense and is standard in most places.  Regarding the off-boarding though I am concerned by the lack of any transparency and by the centralization. How do you as a foundation offboard someone who has had tokens delegated to them by the community? The only one who can undelegate from the delegate is the users who delegated the tokens themselves. Giving the power to blacklist a delegate to the foundation is a terrible point of centralization. From what I understand it would not be technically possible but if the foundation decides a delegate is undesirable they can start this process and ask voters to undelegate. Which is a completely centralized process. I would like to see a more community-based appeals process where the foundation is not the central point of arbitration. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0625
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "8",
                    "likes": "6",
                    "time": "09/11/2022-12:21:49",
                    "content": "Thanks for the comments @lefterisjp. This could be more clearly written, but the Foundation will only process warnings and temporary suspensions (of one month). The Foundation will not have the ability to off-board a delegate. Off-boarding must go through a full Token House vote before any of the consequences are enforced, to prevent the scenarios you described. For example, voters would only be asked to un-delegate after the Token House had approved a Delegate Off-boarding proposal. Does that address your concerns? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.958333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/mastermojo",
                    "index": "9",
                    "likes": "5",
                    "time": "09/11/2022-13:58:51",
                    "content": "This makes sense and looks good. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/GFXlabs",
                    "index": "10",
                    "likes": "5",
                    "time": "09/11/2022-14:49:07",
                    "content": "    system:  No Self-Dealing   Excellent to see this. Will formal prohibitions on self dealing also apply to other empowered stakeholders in the community, like Labs, Foundation, and third-party service providers? If so, what would be the process to censure or off board offenders?     system:  The Foundation will review the submissions. The identity of a submission author will not be publicly disclosed by the Foundation without the author’s consent.   Is there a due process that will be made public for how this will work? Who within the Foundation would be the individuals charged with evaluating reported offenses, and how will they be asked to do that evaluation? It’s very exciting to see a code of conduct formed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.949999999999999
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "11",
                    "likes": "2",
                    "time": "09/11/2022-16:37:17",
                    "content": "    lavande:  This could be more clearly written, but the Foundation will only process warnings and temporary suspensions (of one month). The Foundation will not have the ability to off-board a delegate. Off-boarding must go through a full Token House vote before any of the consequences are enforced, to prevent the scenarios you described   Yes this sounds better, thank you for taking the time to clarify. That said, imo it still brings a centralization vector where none should exist or was even needed. Who in the foundation will be processing such requests? How do you ensure that requests are genuine? How would you fight spam? I can easily see this being a spam vector. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.427083333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "12",
                    "likes": "3",
                    "time": "11/11/2022-22:33:44",
                    "content": "Thanks for the feedback everyone! We hear you on the need to update our thinking on the enforcement mechanism and will suggest related changes shortly. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.416666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/Michael",
                    "index": "13",
                    "likes": "1",
                    "time": "20/11/2022-17:14:52",
                    "content": "Great to have an explicit & detailed post to reference, as well as a path for accountability. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "14",
                    "likes": "0",
                    "time": "28/11/2022-23:53:04",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "15",
                    "likes": "0",
                    "time": "29/11/2022-14:12:38",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "16",
                    "likes": "4",
                    "time": "02/12/2022-16:21:13",
                    "content": "Updated with the following changes, based on delegate feedback:  The “Off-boarding” enforcement type has been replaced by a three-month Suspension. More permanent, on-chain off-boarding may be added as an enforcement type in future Seasons. We have removed notification of voters to re-delegate in the event of a Suspension. While the Foundation will process reported violations during Season 3, severe violations must be voted on by the Token House, and the Foundation expects to reduce its role in processing all violations in future Seasons.  ",
                    "links": [
                        "https://gov.optimism.io/t/op-community-governance-call-december-6th-at-10am-pt-1pm-et-7pm-cet/4112"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://gov.optimism.io/u/GFXlabs",
                    "index": "17",
                    "likes": "1",
                    "time": "03/12/2022-21:49:48",
                    "content": "    lavande:  More permanent, on-chain off-boarding may be added as an enforcement type in future Seasons.   Out of curiosity, what would this look like from an implementation standpoint? A governor contract that blacklists a voting address? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "18",
                    "likes": "0",
                    "time": "06/12/2022-20:30:22",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Arsoner",
                    "index": "19",
                    "likes": "1",
                    "time": "07/12/2022-21:58:33",
                    "content": "sitting down and waiting further information ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.611111111111111
                },
                {
                    "author_link": "https://gov.optimism.io/u/globalpresident",
                    "index": "20",
                    "likes": "1",
                    "time": "11/12/2022-14:11:00",
                    "content": "code of conduct much needed for this ecosystem and growing thanks ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Faido",
                    "index": "21",
                    "likes": "1",
                    "time": "21/12/2022-04:28:16",
                    "content": "Great to have an explicit & detailed post to reference, as well as a path for accountability. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "22",
                    "likes": "3",
                    "time": "21/12/2022-19:01:33",
                    "content": "Minor update to remove contingency language around the Grants Council and Protocol Delegation Program now that both proposals have passed ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/Jayjoe",
                    "index": "23",
                    "likes": "2",
                    "time": "26/12/2022-11:33:09",
                    "content": "I’m so glad seeing a project with so much care about the character and behaviors of the member. I have so much people with different personality in the crypto space but with these guidelines and delegate code of conduct in a clear language. I’m sure everyone is set to order ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/Urban_Raccoon",
                    "index": "24",
                    "likes": "3",
                    "time": "05/01/2023-07:27:12",
                    "content": "Consider sharing this in Discord too. Degens tend to forget there are real people behind these accounts ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/bladex1994",
                    "index": "25",
                    "likes": "2",
                    "time": "08/01/2023-21:43:46",
                    "content": "facts!, stay optimistic! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "26",
                    "likes": "4",
                    "time": "10/01/2023-16:45:42",
                    "content": "Updated to reflect the below:   Added: Delegates may not vote for their own candidacy in an election.   Clarified: While the code of conduct stipulates that delegates may not vote on their own candidacy in elections, in the case of approval/ranked choice votes, delegates may vote for themselves, so long as they also cast votes for the remaining elected positions. Example: I can vote for my own candidacy on the Growth Experiments committee, so long as I also cast 4 additional votes (a total of 5 votes, as there are 5 open positions on the sub-committee.)   Added: The delegate code of conduct will not cover all possible scenarios and edge cases. We ask that delegates please act in accordance with the spirit of the code of conduct and refrain from exploiting loopholes that may exist.   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0625
                },
                {
                    "author_link": "https://gov.optimism.io/u/letmehear",
                    "index": "27",
                    "likes": "1",
                    "time": "13/01/2023-11:03:27",
                    "content": "    system:  Delegates   IF I delegate my OP to another wallet and this wallet vote, can I get snapshot ? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/kiefalconc",
                    "index": "28",
                    "likes": "1",
                    "time": "13/01/2023-16:18:48",
                    "content": "Got it! Thank you very mucn. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/basta",
                    "index": "29",
                    "likes": "1",
                    "time": "13/01/2023-22:19:59",
                    "content": "Explicitly written in simple and clear English ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.166666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/sgh90",
                    "index": "30",
                    "likes": "1",
                    "time": "15/01/2023-13:54:28",
                    "content": "thats so clear  , thank you for spending time to write it ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/Floyd11",
                    "index": "31",
                    "likes": "1",
                    "time": "16/01/2023-12:53:47",
                    "content": "This is a well-written and comprehensive Delegate Code of Conduct for the OP Token House community. It clearly outlines the rules and expectations for active delegates and covers a wide range of topics from inclusivity and professionalism to good faith and accountability. The rules of engagement for the Forum is also included which is a great addition. The emphasis on transparency, constructive feedback, and empathy towards community members is commendable and will help maintain a positive and productive atmosphere within the community. The fact that this code of conduct will go into effect at the start of Special Voting Cycle #9a is also a good move as it gives delegates adequate time to familiarize themselves with the rules and expectations. Overall, this code of conduct is a step in the right direction towards building a strong and healthy community. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.616716616716616
                },
                {
                    "author_link": "https://gov.optimism.io/u/Bennyj504",
                    "index": "32",
                    "likes": "1",
                    "time": "16/01/2023-23:43:11",
                    "content": "Hello,where I can see  listing of my delegates voting history?want to make sure they aren’t asleep at the wheel ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/Netrim",
                    "index": "33",
                    "likes": "2",
                    "time": "16/01/2023-23:47:17",
                    "content": "I use https://boardroom.io/ ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Bennyj504",
                    "index": "34",
                    "likes": "1",
                    "time": "16/01/2023-23:52:45",
                    "content": "Wow, this it!! Thanks for this ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.890625
                },
                {
                    "author_link": "https://gov.optimism.io/u/Doge",
                    "index": "35",
                    "likes": "2",
                    "time": "17/01/2023-14:37:30",
                    "content": "It is very very good!  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/ProFishNC",
                    "index": "36",
                    "likes": "2",
                    "time": "19/01/2023-04:37:20",
                    "content": "Very good guidelines and direction with transparency in focus along with community input. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.549999999999999
                },
                {
                    "author_link": "https://gov.optimism.io/u/bladex1994",
                    "index": "37",
                    "likes": "1",
                    "time": "03/02/2023-14:38:45",
                    "content": "i agree with it! Proud to be part of the Optimism Collective! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/a186r",
                    "index": "38",
                    "likes": "1",
                    "time": "15/02/2023-14:00:30",
                    "content": "Totally agree, let’s go down this route ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.611111111111111
                },
                {
                    "author_link": "https://gov.optimism.io/u/Luckymonkey",
                    "index": "39",
                    "likes": "1",
                    "time": "25/02/2023-23:47:11",
                    "content": "Very democratic !  All the best for OP! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.125
                },
                {
                    "author_link": "https://gov.optimism.io/u/Jayjoe",
                    "index": "40",
                    "likes": "1",
                    "time": "14/03/2023-01:50:41",
                    "content": "The delegate code of conduct is precise and good concised ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/cryptoAYA",
                    "index": "41",
                    "likes": "1",
                    "time": "18/03/2023-18:27:10",
                    "content": "It sounds fantastic. I always dreamed to be in a community where the rules are firm and implemented without being compromised at any cost. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                }
            ]
        }
    ],
    "group_index": "326"
}