{
    "poll_list": [
        {
            "id": "0x2ec590658618c2046565939f534284e7a431476af082bfee00505617145b5580",
            "title": "Season 2: Cycle 7: LI.FI",
            "discussion": "https://gov.optimism.io/t/review-gf-phase-1-proposal-li-fi/3360",
            "body": "This Governance Fund Phase 1 proposal is eligible for voting in Cycle 7. \n\nThis proposal is was reviewed by [Tooling Committee](https://gov.optimism.io/t/tooling-committee-season-2-recommendations/3551). You can find committee recommendations below:\n\n[Tooling Committee recommendations]([https://gov.optimism.io/t/tooling-committee-season-2-recommendations/3551](https://gov.optimism.io/t/tooling-committee-season-2-recommendations/3551))\n\nBy approving committees, the Token House entered a social contract to entrust and delegate the bulk of decision-making to official committees. However, delegates may vote against the recommendation of official committees but should provide a justification to the community as to why they voted differently.",
            "choices": [
                "For",
                "Against",
                "Abstain"
            ],
            "scores": [
                9198149.92353342,
                120881.29435216436,
                3280562.861045517
            ],
            "start": 1665692585,
            "end": 1666293785,
            "snapshot": "29192959",
            "state": "closed",
            "author": "0x47C88bb92B409fF25F6587EA611fac4e55f76007",
            "space": {
                "id": "opcollective.eth",
                "name": "Optimism Collective"
            }
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/review-gf-phase-1-proposal-li-fi/3360",
            "title": "[REVIEW] [GF: Phase 1 Proposal] LI.FI ",
            "index": 3360,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Governance Fund: Phase 1"
            ],
            "tags": [
                "cycle-7",
                "passed"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/cshg",
                    "index": "1",
                    "likes": "2",
                    "time": "23/08/2022-16:43:30",
                    "content": "Project Name: LI.FI Author name and contact info: Chris | LIFI (Discord), chris@li.finance (email) I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: Yes L2 Recipient Address: 0x4D218d77cDdD700565826A31837277e9e2Ea0564 Which Voting Cycle are you applying for? cycle-7 Grant category: Tooling / DeFi Is this proposal applicable to a specific committee? Tooling Project description: LI.FI enables a future multi-chain world by reducing complexity to navigate the fragmented landscape of bridges and DEXs across chains. The easy-to-use widget and SDK allow developers to easily integrate cross-chain capabilities into any existing product. With that users can move and swap assets without having to choose the right bridge or worry about available liquidity. Apart from the B2C showcase transferto.xyz (originally designed as a demo, now already driving a lot of traffic) more and more products are integrating LI.FI as the go-to bridge aggregator. Examples of current integrations are Alchemix, SpiritSwap, Frontier Wallet, Rubic, Etherspot, Treehouse, or specifically on Optimism: DeFi Saver, Perpetual Protocol, Etherspot, Superfluid, Omni. There are further contracts signed and tests running with bigger integration partners such as the largest wallets in the space (>20M monthly active users), which will then enable driving even more liquidity to Optimism through LI.FI. Project links:  Website: https://li.fi/  Twitter: https://twitter.com/lifiprotocol  Discord/Discourse/Community: LI.FI / TransferTo.xyz  Blog: https://blog.li.fi/  Github: LI.FI (Li.Finance) · GitHub  Substack: https://lifi.substack.com/   Additional team member info (please link):  Philipp Zentner (CEO): https://twitter.com/PhilippZentner / https://www.linkedin.com/in/philippzentner/  Max Klenk (CTO): https://www.linkedin.com/in/maxklenk/  Vilen Rodenski (Product Design): https://www.linkedin.com/in/vilenrodeski/  Ed Zynda (Solidity Lead): https://twitter.com/what_the_func  Matthias Moeller (Backend Lead): https://www.linkedin.com/in/mathias-moeller/  Adrian Weniger (Frontend Lead): https://www.linkedin.com/in/adrian-weniger-8a35b6132/  plus many other team members  Please link to any previous projects the team has meaningfully contributed to: N/A Relevant Usage Metrics: (TVL, transactions, volume, unique addresses, etc.)  Unique users: 80,342 Transfer volume: 260,434,102 USD Total transfers: 216,237 Bridges supported: 10 Networks / Chains: 17 DEXs: 17  Competitors, peers, or similar projects: Bridges and bridge aggregators such as Across, Axelar, Connext, Hop, Celer, Socket, Via, Rango, etc. Is/will this project be open sourced? open source and audited contracts, widget, B2C app and SDK can be found here: LI.FI (Li.Finance) · GitHub Optimism native? No (on several chains, 17 in total) Date of deployment/expected deployment on Optimism: December 2021 Ecosystem Value Proposition: What is the problem statement this proposal hopes to solve for the Optimism ecosystem? Users often have tokens on other chains and would like to use dApps on Optimism. For projects or dApps it’s significant development effort to be multi-chain compatible and complex to navigate the current bridging landscape. How does your proposal offer a value proposition solving the above problem? We provide an SDK and Widget which makes it easy for projects to support OP and enable users to bridge any token to OP without having to choose a bridge or leave the dApp. Why will this solution be a source of growth for the Optimism ecosystem? More bridging integrations for Optimism and projects providing such within the dApp will be a key factor to enable Optimism usage and adoption. Has your project previously applied for an OP grant? No Number of OP tokens requested: 200,000 Did the project apply for or receive OP tokens through the Foundation Partner Fund? No If OP tokens were requested from the Foundation Partner Fund, what was the amount? N/A How much will your project match in co-incentives? The co-incentives we’ll provide are technical support for integrating bridging to Optimism as well as content marketing based on in-depth research. We currently value our hands-on development support at $5k-$20k per project per month. We’d like to provide dev integration support valued at $20k per month (1-4 projects / month) over a time period of 6-9 months (up to $180k) in total. Apart from technical integration one of our biggest strengths is the content we produce, especially regarding the bridging space, to support understanding of emerging ecosystems. In the past we’ve e.g. written the bridges articles for the Ethereum Foundation (e.g. Introduction to blockchain bridges | ethereum.org) or published educational content regarding Arbitrary Messaging Bridges. We’d love to create content in terms of Optimism bridging in general (which we’d be happy to white label) as well as for specific projects. Marketing channels we will use to spread such knowledge are content posts in Twitter Threads, announcement articles, cross-chain insider newsletter, substack, Q&A interviews, Twitter spaces, Discord/Telegram and additional ways on a per team basis. Proposal for token distribution: As a bridge aggregator we provide the most straight-forward path for users and projects to onboard to Optimism. We’d like to support this with financial incentives for users (initial gas) to get started on Optimism as well as financial and technical support for projects to enable bridging to Optimism through LI.FI. How will the OP tokens be distributed?  Incentivize transfers to Optimism by providing initial gas for all bridges (50%)  In terms of initial gas we believe 0.003 ETH (~3.8 USD) for users after first time bridging is a good starting point to make transactions and interact with dApps on Optimism. At the current OP/ETH price we could onboard roughly ~26k new users to Optimism with that.  Support projects to integrate bridging to Optimism through LI.FI (50%)  We’d like to enable more projects to support Optimism and onboard users from other chains to Optimism. For that we’d like to provide different grants to such projects depending on the size and complexity of the integration. Smaller ones (<10k) for simple SDK / widget integrations and larger ones for deeper integrations including e.g. cross-chain contract calls. The priority will be for projects deployed on Optimism and seeking bridging from other chains. In addition to these grants we’ll provide technical and content marketing support to such projects, especially larger ones. Over what period of time will the tokens be distributed for each initiative? Currently we expect the time period for distribution to be around 6-9 months. This may vary though depending on market development, developer/user adoption, project integration speeds and further external factors. How will this distribution incentivize usage and liquidity on Optimism? The initial gas amounts will make it easier and more financially attractive for users to move assets to Optimism and start using dApps there. The financial and technical support for bridge integration will enable more projects to easily allow their users to adopt Optimism coming from other chains. Please list the milestones/KPIs you expect to achieve for each initiative, considering how each relates to incentivizing sustainable usage and liquidity on Optimism. Please keep in mind that progress towards these milestones/KPIs should be trackable. KPI for initial gas incentives:  number of new users who have received initial gas after bridging to Optimism  KPIs for project support to integrate OP bridging:  number of projects support total amount of financial support / grants given out to these projects number of new users who have received initial gas after bridging to Optimism (same as above as requested in feedback comments)  Why will the incentivized users and liquidity remain after incentives dry up? Over time users will be used to the UX of bridging to OP and enjoy the simplicity of being able to do so directly through different dApps’ integrated swapping/bridging capabilities powered by LI.FI. This improved first user experience with dApps on OP will provide a great entry point for more long-term usage. Please provide any additional information that will facilitate accountability: Smart contract addresses can be found here: Deployments - LI.FI Documentation ",
                    "links": [
                        "https://li.fi/",
                        "https://transferto.xyz/",
                        "http://LI.FI",
                        "http://LI.FI",
                        "https://li.fi/",
                        "https://twitter.com/lifiprotocol",
                        "https://discord.gg/lifi",
                        "https://blog.li.fi/",
                        "https://github.com/lifinance/",
                        "https://lifi.substack.com/",
                        "https://twitter.com/PhilippZentner",
                        "https://www.linkedin.com/in/philippzentner/",
                        "https://www.linkedin.com/in/maxklenk/",
                        "https://www.linkedin.com/in/vilenrodeski/",
                        "https://twitter.com/what_the_func",
                        "https://www.linkedin.com/in/mathias-moeller/",
                        "https://www.linkedin.com/in/adrian-weniger-8a35b6132/",
                        "https://across.to/",
                        "https://axelar.network/",
                        "https://www.connext.network/",
                        "https://hop.exchange/",
                        "https://www.celer.network/",
                        "https://socket.tech/",
                        "https://via.exchange/",
                        "https://rango.exchange/",
                        "https://github.com/lifinance",
                        "https://ethereum.org/en/bridges/",
                        "https://blog.li.fi/navigating-arbitrary-messaging-bridges-a-comparison-framework-8720f302e2aa",
                        "http://LI.FI",
                        "http://LI.FI",
                        "http://LI.FI",
                        "https://docs.li.fi/smart-contracts/deployments",
                        "https://gov.optimism.io/t/voting-cycle-7-roundup/3586/9",
                        "https://gov.optimism.io/t/gfx-labs-delegate-communication-thread/2728/17",
                        "https://gov.optimism.io/t/voting-cycle-6-roundup/3481/17",
                        "https://gov.optimism.io/t/protocol-delegation-self-nominations/4357/25"
                    ],
                    "GPT-summary": "The post is a proposal for a project called LI.FI, which aims to simplify the process of navigating the fragmented landscape of bridges and DEXs across chains. The proposal explains how LI.FI provides an SDK and Widget that makes it easy for projects to support Optimism and enable users to bridge any token to Optimism without having to choose a bridge or leave the dApp. The post also includes relevant usage metrics, team member information, and a proposal for token distribution. The post receives entirely positive feedback from a 3rd party and extends to other projects seeking bridging from other chains.",
                    "GPT-proposal-categories": [
                        "Interoperability and Scalability",
                        "Grants, Funding and Resource Allocation",
                        "Token Economics",
                        "Smart Contract Updates",
                        "Community and Engagement"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.564849887766554
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "2",
                    "likes": "0",
                    "time": "13/09/2022-14:39:01",
                    "content": "Thank you for your proposal. As a cross-chain swapping and bridging tool, I believe this will bring value of OP ecosystem. Could you please help me with this line, by integrating your SDK a project will be using the full capabilities of the SDK which support multi-chain right? its not focused entirely on Optimism chain. please share any article or document to read if my understanding is wrong.     cshg:  SDK / widget integrations and larger ones for deeper integrations including e.g. cross-chain contract calls   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.135714285714286
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "3",
                    "likes": "0",
                    "time": "13/09/2022-15:13:42",
                    "content": "@OPUser what this does is allow protocols based on optimism to send messages to other chains this is functionality that protocols often have on their roadmaps but may put off because, among other reasons, 1) the tech is too new, 2) they’re prioritizing TVL/bizdev (esp among those in early stages), 3) likely dev lift protocols that use tech like this effectively can quickly find themselves well differentiated, depending on how it fits into their overall development strategy ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.574810606060606
                },
                {
                    "author_link": "https://gov.optimism.io/u/cshg",
                    "index": "4",
                    "likes": "1",
                    "time": "13/09/2022-15:24:10",
                    "content": "@OPUser yes, that’s generally correct that full cross-chain functionality will be implemented. In combination with the first part of initial gas on Optimism there will be stronger incentives though for users to bridge to Optimism and therefore a higher focus on Optimism with the SDK implementation. The Optimism focus will be present in our communication with projects through highlighting grant support and gas incentives, which can then be passed on in communication to their users. In addition projects on Optimism will be prioritized for SDK implementation support, which puts further focus on the Optimism ecosystem. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.642857142857142
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "5",
                    "likes": "0",
                    "time": "13/09/2022-18:14:15",
                    "content": "Thank you for the tag @jackanorak, but I am lacking context here, what are you referring to ? use of SDK ? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/krzkaczor",
                    "index": "6",
                    "likes": "1",
                    "time": "20/09/2022-12:24:07",
                    "content": "Hey, Kris from Tooling committee. I am under the impression that the assessment of this proposal should be done by our committee (we did Across bridge too). @OPUser Did you already start your process? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "7",
                    "likes": "0",
                    "time": "20/09/2022-12:38:08",
                    "content": "Hi @krzkaczor No we are not looking in LIFI. To extend, we are not considering any proposal for committee review until they are in Review Phase ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/ScaleWeb3",
                    "index": "8",
                    "likes": "1",
                    "time": "20/09/2022-15:05:48",
                    "content": "Seems to fit both categories. Feel free to take it @krzkaczor  Re: Proposal  Covering bridging costs to Optimism helps Op growth (despite other bridge parties offering that too) Supporting Op projects with SDK / widget integrations offers a real value-add to the ecosystem Ask is reasonable for size of project & purpose of funds used  Most interesting would be deeper integrations, Optimism-specific use cases or cross-chain use cases. Are there already ideas and/or potential projects lining up? We expect builder-focused initiatives to be more sustainable and look forward to unlocking new potentials, for example contract calls between Eth l1 DeFi/NFT ecosystem <> Op’s low fee execution environment. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.1774475524475525
                },
                {
                    "author_link": "https://gov.optimism.io/u/cshg",
                    "index": "9",
                    "likes": "1",
                    "time": "20/09/2022-19:04:03",
                    "content": "Hey @krzkaczor, thanks a lot for reaching out regarding committee choice. We’d be happy to be assessed by your committee. I’ve adapted the committee in the description to “Tooling”. Welcoming any feedback on the proposal from your side. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/cshg",
                    "index": "10",
                    "likes": "0",
                    "time": "20/09/2022-19:11:51",
                    "content": "Thanks for your feedback on the proposal @ScaleWeb3. There’s several projects on Optimism where we see a deep LI.FI integration as beneficial for the ecosystem. E.g. for seamless deposits from all chains and starting trading on:  Perp (deeper integration with widget and cross-chain contract calls) Kwenta Lyra Pika Protocol Aelin  Or e.g. Quix for buying NFTs on Optimism using assets from any chain. We are happy to discuss further projects and deep integrations to support, e.g. with features such as cross-chain contract calls. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.611111111111111
                },
                {
                    "author_link": "https://gov.optimism.io/u/krzkaczor",
                    "index": "11",
                    "likes": "1",
                    "time": "22/09/2022-09:50:37",
                    "content": "We are working on a full assessment. Few quick questions:  How are you gonna prevent giving away a gas stipend to sibills? Regarding KPIs: 2a: I think for gas incentives it’s important to track how many users became active users, let’s say made a few other TXs on optimism. 2b: For projects that you want to support, the same KPIs as for initial gas incentives should apply. Can you give us some examples of projects that you would support building on OP?  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.4625
                },
                {
                    "author_link": "https://gov.optimism.io/u/krzkaczor",
                    "index": "12",
                    "likes": "1",
                    "time": "22/09/2022-10:49:27",
                    "content": "Most importantly this proposal doesn’t follow the new template. Please ping us once updated. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.7272727272727275
                },
                {
                    "author_link": "https://gov.optimism.io/u/cshg",
                    "index": "13",
                    "likes": "0",
                    "time": "22/09/2022-16:12:34",
                    "content": "Thanks for the questions @krzkaczor!   The most efficient way for us to stop farming gas stipends by sybils is by simply making it financially unattractive due to the gas stipend amount in comparison to payable bridge fee (e.g. 2-3 USD), so a sybil / bot won’t have a viable net gain from that. We’ve just further reduced the gas stipend amount to 0.003 ETH (~3.8 USD), which gives even less of an incentive to farm gas stipends.   KPIs 2a. We currently mainly tracking bridge transactions, but I agree for activity further TXs on OP would be great. Happy to align and find ways together how to best monitor that. 2b. Agree, added that above.   Yes, here some examples of projects to support with a LI.FI integration and OP bridging: Gamma (already on OP, add bridging), Pika Protocol (already on OP, add bridging), Dexible (add OP support), Rhino, Velodrome, Midas, Merlin (Valk), Apwine, Alpha Homora, etc. Additional deeper integrations (e.g. Perp) can be found in my answer above.   We’ve just reduced the overall number of OP tokens further to 200k to accommodate the higher sybil resistance with smaller initial gas and reduce usage time span for this proposal. We’d rather establish a long-term relationship with the OP ecosystem and continue with follow-up proposals in the future. Happy to answer more questions / discuss further. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.994791666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/cshg",
                    "index": "14",
                    "likes": "0",
                    "time": "22/09/2022-16:13:49",
                    "content": "Updated the proposal to follow the latest template update. Would be great to still get it in for the current cycle.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.166666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/cshg",
                    "index": "15",
                    "likes": "0",
                    "time": "22/09/2022-17:12:12",
                    "content": "@OPUser @jackanorak would you be willing to give a delegate approval to us so we can join this cycle? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "16",
                    "likes": "1",
                    "time": "22/09/2022-17:13:41",
                    "content": "sure thing. I am an Optimism delegate [Delegate Commitments - #136 by jackanorak ] with sufficient voting power and I believe this proposal is ready to move to a vote. I’ll also add that this is one of the few proposals that have made it to review to be precise with their KPIs, which I see as being necessary for inclusion – though in general these (and i’m not referring specifically to this proposal) ought to more fully consider the intended outcome, as outlined in the prompt. ",
                    "links": [
                        "https://gov.optimism.io/t/voting-cycle-6-roundup/3481/17",
                        "https://gov.optimism.io/t/voting-cycle-7-roundup/3586/9"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 6.035714285714286
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "17",
                    "likes": "0",
                    "time": "22/09/2022-17:33:04",
                    "content": "Sure thing, let me find the exact text to write. Editing to provide the reasoning. Li FI has a good market presence, OSS and audit, amount of token requested and distribution plan is good with long term growth in sight. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 7.1
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "18",
                    "likes": "1",
                    "time": "22/09/2022-17:35:41",
                    "content": "I am an Optimism delegate [Delegate Commitments - #26 by OPUser] with sufficient voting power and I believe this proposal is ready to move to a vote. ",
                    "links": [
                        "https://gov.optimism.io/t/voting-cycle-6-roundup/3481/17",
                        "https://gov.optimism.io/t/voting-cycle-7-roundup/3586/9"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Defi_LATAM_axlvaz",
                    "index": "19",
                    "likes": "0",
                    "time": "26/09/2022-00:29:27",
                    "content": "    cshg:  We’d like to enable more projects to support Optimism and onboard users from other chains to Optimism. For that we’d like to provide different grants to such projects depending on the size and complexity of the integration. Smaller ones (<10k) for simple SDK / widget integrations and larger ones for deeper integrations including e.g. cross-chain contract calls. The priority will be for projects deployed on Optimism and seeking bridging from other chains. In addition to these grants we’ll provide technical and content marketing support to such projects, especially larger ones.   Will you consider protocols that have already received a grant from this gov? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.113636363636363
                },
                {
                    "author_link": "https://gov.optimism.io/u/cshg",
                    "index": "20",
                    "likes": "1",
                    "time": "04/10/2022-22:31:07",
                    "content": "@Defi_LATAM_axlvaz Do you mean projects which have already received grants through an Optimism Governance proposal? Usually such projects won’t necessarily need the financial support anymore but we are happy to still support them on other fronts, e.g. provide technical support to them. We don’t want to make a hard cut-off rule here though but would rather look at them on a case by case basis. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.044270833333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "21",
                    "likes": "2",
                    "time": "05/10/2022-01:12:01",
                    "content": "my suggestion is to do whatever is most likely to add the most incremental value to the ecosystem, regardless of what the protocol may have received from governance. it could be, for instance, that they received a grant for something entirely separate from what you’d be offering them. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/marc",
                    "index": "22",
                    "likes": "2",
                    "time": "05/10/2022-14:12:49",
                    "content": "hello @cshg and you for your proposal. LiFi brings value to Optimism through its bridge aggregation widget tool and this proposal fits well with the goal of incentivizing usage on Optimism. You have adjusted to feedback that was given, so I believe your proposal is strong enough and ready for review. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.055555555555555
                },
                {
                    "author_link": "https://gov.optimism.io/u/cshg",
                    "index": "23",
                    "likes": "1",
                    "time": "05/10/2022-14:35:25",
                    "content": "thanks @marc for your feedback and encouragement. Changed the status to [REVIEW]. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/linda",
                    "index": "24",
                    "likes": "1",
                    "time": "14/10/2022-03:44:41",
                    "content": "I’m abstaining from this proposal since my fund Scalar Capital is an investor in LI.FI. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lazeeeerlin",
                    "index": "25",
                    "likes": "0",
                    "time": "14/10/2022-07:11:49",
                    "content": "LIKE li.fi , ui is more beauty, do more to make better. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "26",
                    "likes": "1",
                    "time": "15/10/2022-18:22:41",
                    "content": "Voted For Number to token requested, its distribution plan and KPI defined are aligned with user on-boarding and protocol integration. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/SEED_LATAM_Joxes",
                    "index": "27",
                    "likes": "2",
                    "time": "17/10/2022-20:05:15",
                    "content": " 1. Presentation  We are an officially recognized Tooling Governance Committee, responsible for assessing proposals related to tooling and infrastructure (wallets, bridges etc.). To begin with, for this proposal we identified a possible conflict of interest between our team member (@cryptotesters involved in Hop protocol) and thus that individual was excluded from assessing this proposal.  2. About the project  There is plethora of bridges of various designs out there**.** There is also vast amount of tokens, some with native cheap bridging solutions. Bridge aggregators try to find the best path to move (and possible exchange) tokens from one chain to another and are important primitive. In a nutshell, LiFi works in a way that a centralized backend provides routing information that is fed to and executed by decentralized smart contract system. LiFi itself doesn’t operate a bridge but rather aggregates already existing solutions. LiFi supports Optimism for a while now. As far as we can tell, there are no plans for LiFi token. Similar OP Governance proposals:   Socket Protocol - 500k OP  Hop Protocol - 1M OP  Across Protocol - 750k OP   3. About the following  Proposal was posted back in August and recently updated to fit new template. LiFi team was quick to answer any additional questions asked by community members.  4. About the proposal valuation  In this part, we focus on the following aspects:   Added value (good to bad): good. Bridge aggregators are the best products to use for many types of users.  Impact or expected usage (high to low): medium. Aggregators are important but it’s a crowded space with many competing solutions.  Current Status [Development stage/¿Open Source?] (early to ready): ready.  Expenditure plan and distribution (appropriate to inappropriate): standard. Funds will be used to subsidize product usage as well as fund more integrations. This is quite in line with similar proposals.  Amount requested (high to low): low/medium    5. KPIs and impact tracking We suggest tracking following KPIs:  Users bridged Users who bridged and stayed active  Same KPIs should apply to subsidised integrations. Further more, gas stipends should be monitored to detect any sybil-like behaviour.  6. FINAL RECOMMENDATION: Yes  We apologize for the delays during this cycle. Our work was mostly done on time but we had delays with the final confirmation from each member to properly publish our recommendations with the proper consensus (this was due to devcon week, but we recognize this is not an excuse). We promise that this situation will not happen again and we will carry out the respective improvements of the process and we will share our learnings received during this cycle. Thank you for patience. ",
                    "links": [
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-socket/3647",
                        "https://gov.optimism.io/t/gf-phase-0-proposal-hop-protocol/944",
                        "https://gov.optimism.io/t/review-gf-phase-1-proposal-across-protocol-updated-template/3401",
                        "https://gov.optimism.io/t/tooling-committee-season-2-recommendations/3551/10"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party auditing and reviewing proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.820344278363146
                },
                {
                    "author_link": "https://gov.optimism.io/u/katie",
                    "index": "28",
                    "likes": "1",
                    "time": "18/10/2022-01:01:23",
                    "content": "Voted yes - Following the Tooling Committee recommendation, this is also a reasonable amount requested and well written proposal with solid KPIs. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.333333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "29",
                    "likes": "0",
                    "time": "20/10/2022-12:05:59",
                    "content": "Voting YES following the recommendation we published with the tooling committee of which I am a member. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/SEED_LATAM_Joxes",
                    "index": "30",
                    "likes": "0",
                    "time": "20/10/2022-14:14:30",
                    "content": "[Final] Voting: Yes Following our own Tooling committee recommendation. ",
                    "links": [
                        "https://gov.optimism.io/t/defi-latam-delegate-communication-thread/2950/10"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "31",
                    "likes": "0",
                    "time": "21/10/2022-13:30:05",
                    "content": "Snapshot vote - passed ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "32",
                    "likes": "0",
                    "time": "21/10/2022-13:30:28",
                    "content": "@cshg can you provide a Telegram handle or other contact method so the Optimism team can get in touch about paying out this grant! Feel free to DM or email palash@optimism.io ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.609375
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "33",
                    "likes": "0",
                    "time": "21/10/2022-13:30:32",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "219"
}