{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/draft-gf-phase-1-liquity/2893",
            "title": "[DRAFT] [GF: Phase 1] Liquity ",
            "index": 2893,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Governance Fund: Phase 1"
            ],
            "tags": [
                "cycle-8"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/TokenBrice",
                    "index": "1",
                    "likes": "7",
                    "time": "06/07/2022-13:40:51",
                    "content": "  Project Name: Liquity  Author Name: TokenBrice, Liquity Strategist Number of OP tokens requested: 500 000 OP  I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: Yes.  L2 Recipient Address: 0x2f593f151aF4bb9A71bcA6cAce1d3c56C2844117  Voting Cycle: Cycle 8  Grant Category: DeFi  Additional team member info Liquity Team Info   Previous/relevant projects: Liquity, Chicken Bonds  Competitor/Peers: None. There are functionally similar protocols involving much trust or permission, like Maker, Spell/MIM or QiDAO.  Optimism Native: No.  Is this project open-sourced: Yes    Relevant Usage Metrics  Number of LUSD on Optimism: 4 M, with 90,758 transfers and 811 holders. On mainnet, Liquity has a 179.7M supply, with 276,810 transfers and 5509 holders.   Ecosystem Value Proposition LUSD has been one of the first stablecoins to come to Optimism, thanks to Synthetix, which used a LUSD wrapper to stabilize sUSD on Optimism that absorbed close to 45M of LUSD on Optimism at some point. Thanks to the launch of Velodrome and the veVELO NFT airdrop Liquity received, several LUSD-related pools have grown to sizeable TVL. Finally, the recently added support for LUSD in Stargate facilitates the fast withdrawal from Optimism to mainnet. While the Liquity protocol is not deployed on Optimism (mainnet only - any rollup deployment would require a full protocol re-deployment & migration), LUSD, the stablecoin outputted by the protocol, has a solid and growing presence on the network. Along with sUSD, LUSD is one of the few stablecoins that is not centralized nor collateralized by centralized and censurable stablecoins. Outside of the mainnet where the Liquity protocol operates, Optimism is currently the only network where LUSD is officially supported. More information about LUSD on Optimism is available here  Proposal for token distribution  How will the OP tokens be distributed? The OP tokens will be used to grow and sustain LUSD’s foothold on Optimism. They will help to attract attention and assets to new integrations and support their growth until a critical mass is reached:   Liquidity bribes [70%] on Velodrome to grow LUSD-related pools, focusing on the unstoppable LUSD/ETH (350k OP/year).  Borrow incentives [20%] (Once live) potentially – borrower incentives for LUSD on Aave/Optimism (100k OP/year)  Community/Ecosystem Grants [10%]: OP tokens will be distributed as grants to users and developers, building tools and partnerships to help the protocol grow its presence on Optimism. The grants will be paid out directly in OP. (50k OP)   How will this distribution incentivize usage and liquidity on Optimism? Optimism direly needs credible stablecoins that are not subject to censorship. Indeed, Liquity is a top-tier Ethereum protocol and still the only protocol offering a stablecoin 100% powered by immutable smart contracts. We believe that growing LUSD liquidity on the network is a net positive by itself, not only for Liquity but also for Optimism, as it diversifies the stablecoin offering and offers a credible hedge if regulation-related issues were to arise on a major centralized stablecoin.  image1809×678 113 KB  LUSD is already available in diverse pairing against other main stablecoins. >$5M of LUSD liquidity has been grown and maintained over the last six months without any grants. If obtained, the OP grants will help tremendously to keep growing LUSD’s presence on the network, especially the LUSD/ETH pool.  Why will the incentivized users and liquidity remain after incentives dry up? The low transaction fees on Optimism attract users who are concerned about the resilience of their stablecoin but not able to afford mainnet fees on L1 — LUSD on Optimism presents a credible offering to such profiles, currently filled by no other stablecoins. Before the incentives (currently), Liquity is already maintaining ~5M of LUSD-related liquidity on Optimism. We’re confident a year-long incentivization on a reasonable budget, as suggested, will push this baseline further.  Over what period will the tokens be distributed? The current proposed budget is tailored for yearly usage.  Has your project previously received an OP token grant? If yes, what’s the status of these tokens? Despite being the top stablecoin on Optimism supply-wise at the OP launch (~50M LUSD on Optimism then), Liquity has not received any OP grants. Moreover, LUSD was decisive in helping sUSD maintain its peg and reach the massive adoption it’s currently seeing on Optimism: Liquity  Optimism.  How much will your project match in co-incentives? Liquity has been a supportive actor of the Optimism ecosystem since the Velodrome launch. However, the team usage of incentives is minimal: even on mainnet. Instead, we’d rather support the ecosystem through other means, like our active role in documenting Liquity’s successful usage of Velodrome. To facilitate the tracking and reporting on the 500K OP requested, a separate and dedicated Safe has been deployed: 0x2f593f151aF4bb9A71bcA6cAce1d3c56C2844117 Proposal Last updated Dec 07 - updated notes ",
                    "links": [
                        "https://www.liquity.org/team",
                        "https://github.com/liquity/liquity",
                        "https://twitter.com/synthetix_io/status/1468982764435296258?s=20&t=37-a_imnIlfPfVBxynLGBg",
                        "https://www.liquity.org/blog/lusds-growing-usage-on-optimism",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/8/8e7447495a69b7e056071db38a47fc19dd27a25d.png",
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-velodrome-finance/3736/92",
                        "https://optimistic.etherscan.io/address/0x2f593f151aF4bb9A71bcA6cAce1d3c56C2844117",
                        "https://gov.optimism.io/t/draft-gf-phase-1-liquity/2893/22",
                        "https://gov.optimism.io/t/ready-gf-phase-1-across-protocol/3163/65",
                        "https://gov.optimism.io/t/draft-so2-committee-proposal-defi-group-c/3320",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-liquity/4979"
                    ],
                    "GPT-summary": "The post is a draft proposal for a Liquity project by TokenBrice, a Liquity Strategist. The proposal requests 500,000 OP tokens to grow and sustain LUSD's foothold on Optimism. The proposal explains how the tokens will be distributed and how they will incentivize usage and liquidity on Optimism. The post also provides relevant usage metrics and ecosystem value proposition. The proposal has not received any OP grants before. The post does not advertise the proposal, but it explains it in detail and provides constructive criticism and positive feedback.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Interoperability and Scaleability",
                        "Privacy, Security and risk management",
                        "Smart contract updates",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.541488983653162
                },
                {
                    "author_link": "https://gov.optimism.io/u/millie",
                    "index": "2",
                    "likes": "2",
                    "time": "06/07/2022-14:39:41",
                    "content": "Hey @TokenBrice thanks for the proposal, a few things come to mind off the bat:  Bridge incentives Incentives on cBridge to facilitate bridging LUSD back to mainnet (100k OP/year)   from what we’ve seen so far, bridging incentives are not a sanctioned use of OP allocation in Gov fund Phase 1   Grants: OP tokens will be distributed as grants to users and developers, building tools and partnerships to help the protocol grow its presence on Optimism. (50-100K)  I am a bit curious for the plan around this, afaik Liquity does not have a DAO or governance or any plans for “protocol growth” which can be publicly contributed to. What are the specific ideas behind how this grant allocation will be utilized? How will Liquity decide on whether a grant is worthy of funding or not? Given that there isn’t really much that can be “built on top” aside from LUSD integration similar to how Synthetix did,  what sort of “tools” and “partnerships” did you have in mind? Thanks. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.138888888888888
                },
                {
                    "author_link": "https://gov.optimism.io/u/TokenBrice",
                    "index": "3",
                    "likes": "2",
                    "time": "06/07/2022-15:12:14",
                    "content": "Hello @millie and thanks for providing feedback this quickly!  1/ Usage of incentives Your quote refers to Velodrome (=DEX / liquidity), but the text below mentions “bridging incentives”. Would you mind clarifying which one is not a sanctioned use of the OP allocation?  2/ Grants for projects building on top of Optimism/LUSD Indeed, we’re talking here about integrations similar to what Synthetix did. To give you a more concrete example, we’ve been chatting with the CompliFi team lately who is considering launching an instance of their product (derivatives) on Optimism using LUSD as the base currency. That would be a prime target to receive such a grants. Regarding the allocation decision, since Liquity has no governance nor DAO it will be the responsibility of the team indeed. Just like with our community grants though, we’ll make sure to establish clear guidelines on this front and provide transparency & reasoning for each decision. We’ll also implement a retroactive, result-based approach instead of a “pre-funding” of projects based on their intent. If needs to be, additional details regarding the grants allocation framework can be included in the proposal. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.575757575757576
                },
                {
                    "author_link": "https://gov.optimism.io/u/millie",
                    "index": "4",
                    "likes": "0",
                    "time": "06/07/2022-16:16:20",
                    "content": "Yes sorry about that, I fixed the mis-quoted reply. Indeed meant to reference the part about bridging incentives. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/TokenBrice",
                    "index": "5",
                    "likes": "2",
                    "time": "06/07/2022-16:23:13",
                    "content": "No worries and thanks for clarifying this. Would you mind sharing some context (links?) regarding why providing incentives to people supplying liquidity on bridges is not a sanctioned use? We could drop this part and re-allocate it if needed. Yet it was quite useful, as withdrawing LUSD from Optimism to mainnet takes a week with the official bridge. Offering a faster option makes users more comfortable with the idea of bridging their LUSD from mainnet to Optimism, to begin with. This is exactly what the cBridge enables, yet, the liquidity is quite unbalanced since users tend to do mainnet>Optimism with the official bridge and Optimism>mainnet with the cBridge: we end up with the bridge liquidity almost always heavily unbalanced to the Optimism side (as the mainnet LUSD are usually drained as soon as available). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/millie",
                    "index": "6",
                    "likes": "3",
                    "time": "06/07/2022-16:35:15",
                    "content": "yeah I fully appreciate the obstacles related to liquidity with some bridges and personally not against the use of OP incentives to ensure there is a healthy balance in liquidity to enable cross chain arbitrage. I have noticed other delegates reacting adversely to the use of OP for that purpose however:     Proposal: Pause Phase 1 and start a discussion round to improve the governance process 💌 Ideas & Feedback       I think we should at least pause it in between cycles to focus on those projects who got in and give good feedback aligned with Optimism’s vision. While proposals are active for 6 days on Snapchat we stop new proposals to be posted maybe?  At this rate, I’m nearly keeping it up and made my own filters on what to say yes and what to say no.  I got this from Exosphere in the discord and made it my own rule  OK usage : *  Protocol usage incentives  Grants and other forms of 3rd party developer ince…      Screen Shot 2022-07-06 at 12.28.44 PM847×239 29.3 KB  But you’ve actually answered my questions in regards to the proposal and I would vote YES to pass it in it’s current form. ",
                    "links": [
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/f/fed8c8c00a629273166e077c5a48b4864a7cc588.png"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.579744816586922
                },
                {
                    "author_link": "https://gov.optimism.io/u/TokenBrice",
                    "index": "7",
                    "likes": "2",
                    "time": "06/07/2022-16:57:30",
                    "content": "Mhn, at first glance I’m having trouble understanding the thought process leading to this conclusion, but I’ll dive into the link you shared, thank you for that. With the additional context provided above. I truly think that in that case incentivizing liquidity bridges would result in more confidence in LUSD on Optimism overall, and therefore more tokens bridged and activity there. So I’ll see how the other delegate reacts to the bridging incentives component of the proposal and adjust if needed. Thanks for your support! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.734375
                },
                {
                    "author_link": "https://gov.optimism.io/u/millie",
                    "index": "8",
                    "likes": "3",
                    "time": "06/07/2022-17:37:18",
                    "content": "Yeah realistically a main bottleneck for many stablecoins is that specific issue. A lot of stablecoins like DAI,LUSD, etc are only minted on ETH mainnet and also need to be used for liquidations on mainnet. When a lot of that liquidity gets bottled up on L2, it creates a liquidity crunch on L1 (since L2<>L1 withdrawals take 7days) which becomes amplified at times of volatility when there are a some large liquidations that need to occur but liquidity is thin. Having reliable bridge liquidity would increase the confidence of whales to bridge their LUSD over to Optimism long term, also it would stimulate volume and transaction activity from arbitrage flow between L1 and OP. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.307823129251701
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "9",
                    "likes": "1",
                    "time": "06/07/2022-20:05:46",
                    "content": "    TokenBrice:  incentives on cBridge to facilitate bridging LUSD back to mainnet (100k OP/year)   are you referring OP chain to main chain or vice-versa ? Also, how are trying to handle farmers here, lets say I bridge X amount and bridge it back and repeat the same process again and again. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.208333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/SEED_LATAM_Joxes",
                    "index": "10",
                    "likes": "1",
                    "time": "07/07/2022-01:22:44",
                    "content": "Echo of this, just to clarify:     OPUser:  Also, how are trying to handle farmers here, lets say I bridge X amount and bridge it back and repeat the same process again and again.   @TokenBrice  I’m assuming you plan to activate a Liquidity Mining program for LUSD providers on both sides of cBridge, correct? On average, the proposal looks reasonable and we will give more feedback in the next few days. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/TokenBrice",
                    "index": "11",
                    "likes": "3",
                    "time": "08/07/2022-09:33:38",
                    "content": "I’ll need to double-check with the cBridge what they can do but ideally, it would be a liquidity mining campaign only for one side: people providing LUSD on mainnet (and therefore enabling fast withdrawal of others from Optimism) The Optimism side doesn’t really need support since it’s getting filled naturally as people are fast-withdrawing. Edit ~2h later: so yes indeed the cBridge can handle LM campaigns for LP on one side only. So LM only for users providing LUSD on the Ethereum side seems preferable, as it would help to solve the current unbalance issue. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.8999999999999995
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "12",
                    "likes": "3",
                    "time": "03/08/2022-21:46:52",
                    "content": "Hey @TokenBrice thank you for the proposal.     TokenBrice:    Liquidity bribes on Velodrome to develop LUSD/USDC liquidity (200k OP/year)  Bridge incentives Incentives on cBridge to facilitate bridging LUSD back to mainnet (100k OP/year)  Grants: OP tokens will be distributed as grants to users and developers, building tools and partnerships to help the protocol grow its presence on Optimism. (50-100K)  Borrow incentives (Once live) potentially – borrower incentives for LUSD on Aave/Optimism (100-150K OP/year)    A suggestion here to make it more readable would be to add the % of the allocation you would like to devote to each category.     TokenBrice:  Bridge incentives Incentives on cBridge to facilitate bridging LUSD back to mainnet (100k OP/year)   Also why incentives to bridge back to mainnet? How is that supposed to help optimism growth?     TokenBrice:  Grants: OP tokens will be distributed as grants to users and developers, building tools and partnerships to help the protocol grow its presence on Optimism. (50-100K)   Would you forward the OP directly for the development grants or would you first liquidate them for stables?     TokenBrice:  Ultimately, it’s up for discussion within the Liquity team (since the protocol has no DAO and no governance), but I’d like to manage expectations: it’s unlikely.   Most other protocol teams had some form of co-incentives so this would help your proposal if you guys manage to match it with something. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.358901515151516
                },
                {
                    "author_link": "https://gov.optimism.io/u/TokenBrice",
                    "index": "13",
                    "likes": "2",
                    "time": "12/08/2022-08:41:34",
                    "content": "    lefterisjp:  A suggestion here to make it more readable would be to add the % of the allocation you would like to devote to each category.   Adding it to the top post, thanks for the suggestion.     lefterisjp:  Also why incentives to bridge back to mainnet? How is that supposed to help optimism growth?   We discussed this topic a bit above in the post: essentially, right now, the only liquid bridge is the official one with the 7 days withdrawal delay. Considering LUSD can only be minted on mainnet by taking on some debt, we’re confident users would be more comfortable bridging their LUSD to Optimism if they know they can withdraw them quickly to repay some debt if needed.     lefterisjp:  Would you forward the OP directly for the development grants or would you first liquidate them for stables?   They will be paid out as OP token, but that is a good point to clarify, I’ll update the opening post.     lefterisjp:  Most other protocol teams had some form of co-incentives so this would help your proposal if you guys manage to match it with something.   I understand, sadly the Liquity treasury is more limited than Optimism’s. I’ll still ask around and see if we can allocate some LQTY. Yet, even though Liquity is not contributing assets directly, Liquity has been decisive to Optimism’s success, as LUSD was the top stablecoin on Optimism for a while (before the OP token) and contributed to help stabilize sUSD on the network. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.1896997929606625
                },
                {
                    "author_link": "https://gov.optimism.io/u/MoneyManDoug",
                    "index": "14",
                    "likes": "3",
                    "time": "12/08/2022-11:34:14",
                    "content": "Hey brice, I like what LUSD offers in terms of being backed by eth, it’s certainly a value add to the ecosystem. I understand the need for bridge incentives here and believe the allocation is reasonable. In its current form I think this proposal is good enough for me  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party giving entirely positive feedback on proposal"
                    ],
                    "Sentiment": 6.011904761904762
                },
                {
                    "author_link": "https://gov.optimism.io/u/millie",
                    "index": "15",
                    "likes": "2",
                    "time": "14/08/2022-13:43:30",
                    "content": " Also why incentives to bridge back to mainnet? How is that supposed to help optimism growth?   We discussed this topic a bit above in the post: essentially, right now, the only liquid bridge is the official one with the 7 days withdrawal delay. Considering LUSD can only be minted on mainnet by taking on some debt, we’re confident users would be more comfortable bridging their LUSD to Optimism if they know they can withdraw them quickly to repay some debt if needed.  It’s worth mentioning that given LUSD’s liquidity on Mainnet it’s basically essential for there to be a fast bridge if this program were to go live. If a significant portion of the LUSD supply is on L2 and there is a period of sharp price volatility for ETH, liquidators may not be able to fully liquidate troves on L1 and the whole protocol would be at risk. For context Synthetix had integrated an LUSD wrapper on Optimism for many months but had to eventually shut it down due to risk of cornering too much of the supply on L2 without  fast bridging relief and risking the the possibility of Troves becoming under collateralized in a black swan event (or even just a market wide nuke like we saw in May and June). cc @lefterisjp ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.881637806637807
                },
                {
                    "author_link": "https://gov.optimism.io/u/mm3729_PrimeRating",
                    "index": "16",
                    "likes": "2",
                    "time": "15/08/2022-14:09:45",
                    "content": "Thanks for the proposal @TokenBrice. Last time we reviewed Liquity, there was a huge 63.7% of the LQTY token reserved for team + insiders (reference from Liquity Medium article here) which raises concerns of centralization. Also increases risk of insiders making a nice buck when the lock-ups end. How do you see this? ",
                    "links": [
                        "https://medium.com/liquity/liquity-launch-details-4537c5ffa9ea"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/TokenBrice",
                    "index": "17",
                    "likes": "5",
                    "time": "15/08/2022-16:19:07",
                    "content": "Hello @millie and @mm3729_PrimeRating, great questions! I’ll answer them in order.     millie:  If a significant portion of the LUSD supply is on L2 and there is a period of sharp price volatility for ETH, liquidators may not be able to fully liquidate troves on L1 and the whole protocol would be at risk.   This is a valid concern the team is not overlooking and partly why this proposal focuses a sizeable share of the OP budget on providing incentives for users providing LUSD liquidity to the mainnet bridge. We’re discussing with Hop protocol to examine how their solution might prove more efficient at ensuring balanced liquidity on both sides of the bridge at all times, although it comes with additional requirements. Finally, we’ve also slightly revised the budget to allocate more for the bridging incentives to ensure we have sufficient firepower if needed.     mm3729_PrimeRating:  Thanks for the proposal @TokenBrice. Last time we reviewed Liquity , there was a huge 63.7% of the LQTY token reserved for team + insiders (reference from Liquity Medium article here) which raises concerns of centralization. Also increases risk of insiders making a nice buck when the lock-ups end. How do you see this?   Since LQTY doesn’t have any governance capability, this is a non-issue, and there cannot be any centralization concerns stemming from this observation. I might also remind you that many of the protocols pleading for OP grants have a token with governance capability and similar ownership distribution, with a few actors able to be decisive in governance proposals. And to be sure we’re clear: this is not the case with Liquity since there is no governance. The LQTY allocated to investors already unlocked last April, without any significant impact on LQTY’s price nor massive sell-off, demonstrating strong confidence of the investors that are not looking for a quick buck. Meanwhile, the LQTY allocated to the team is under a 4 year vesting period, with no funds unlocked during the first year - meaning that team-owned LQTY barely started to unlock and won’t be fully liquid until 3 more years. Thus, a large share of the LQTY circulating today is made of the Community Allocation (mostly distributed to Stability Pool depositors), which was quite generous initially and progressively decreases. I hope this post addresses your concerns, let me know if that is not the case. ",
                    "links": [
                        "https://medium.com/liquity/liquity-launch-details-4537c5ffa9ea"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.339880952380952
                },
                {
                    "author_link": "https://gov.optimism.io/u/CriptoSpanglish",
                    "index": "18",
                    "likes": "0",
                    "time": "24/08/2022-00:41:00",
                    "content": "I find this proposal reasonable, might need to be adjusted here and there, but most importantly is the message that Optimism can send to different ethereum-aligned communities by adopting/supporting (yet another) decentralized stablecoin. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.375
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "19",
                    "likes": "0",
                    "time": "29/09/2022-02:16:31",
                    "content": "howdy @TokenBrice , wanted to check your level of interest in proceeding here for this round ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "20",
                    "likes": "1",
                    "time": "18/10/2022-20:03:23",
                    "content": "pinging @TokenBrice , new round coming up soon ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.840909090909091
                },
                {
                    "author_link": "https://gov.optimism.io/u/TokenBrice",
                    "index": "21",
                    "likes": "1",
                    "time": "29/10/2022-08:47:46",
                    "content": "Urgh sorry, I hadn’t enabled notifications on this post. Yes there is definitely interest! It seems like the template for proposals evolved, so I’ll adjust the format of this one ASAP. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 3.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/TokenBrice",
                    "index": "22",
                    "likes": "3",
                    "time": "30/11/2022-13:23:27",
                    "content": "First posted in July, this proposal has received extensive community feedback, and the situation for LUSD on Optimism evolved, leading to a sizeable update of the copy:  A new safe has been deployed to manage the OP grant, now included as the “L2 Recipient Address”. Liquidity incentives recentered around the LUSD/ETH pool. Updated LUSD market metrics Added mention of Stargate/LUSD released since: thus, the usage of OP as an incentive for bridge, the most controversial component of the proposal, has been removed. Added all missing entries required to match the template Other copy improvements  The goal was to prepare it for the Committee Review, hoping it would be included in one of the next voting rounds. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.895202020202021
                }
            ]
        }
    ],
    "group_index": "141"
}