{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/badgeholder-conflict-of-interest-disclosures/5569",
            "title": "Badgeholder Conflict of Interest Disclosures ",
            "index": 5569,
            "category": [
                "\\xf0\\x9f\\x94\\xb4 RetroPGF"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/system",
                    "index": "1",
                    "likes": "12",
                    "time": "10/03/2023-23:57:51",
                    "content": "All badgeholders are subject to the delegate code of conduct. This code of conduct includes a no self-dealing section that stipulates:   Any actual or reasonably anticipated conflicts of interest must be disclosed in writing and prominently displayed ahead of any voting.   Any offer for external compensation related to delegation or the Optimism Protocol must be promptly disclosed.   Delegates are prohibited from approving and voting on their own proposals.\" Badgeholders may interpret this to mean they should not vote for organizations where any portions of funds are expected to flow to them or affiliated projects.   Additionally, the badgeholder manual specifies that: “Badgeholders are expected to NOT cast votes in favor of any project they have a financial or reputational stake in.” The thread below is where badgeholders should disclose any conflicts of interest prior to voting in Round 2. ",
                    "links": [
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/39",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/38"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.1618589743589745
                },
                {
                    "author_link": "https://gov.optimism.io/u/polynya",
                    "index": "2",
                    "likes": "5",
                    "time": "13/03/2023-06:11:24",
                    "content": "I will NOT be voting for:  L2Beat (investor) Polynya (obviously)  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/SEED_LATAM_Joxes",
                    "index": "3",
                    "likes": "4",
                    "time": "13/03/2023-20:56:01",
                    "content": "For the RPGF2, I currently have some degree of involvement for the following projects nominated:   Smock: built by Wonderland, currently occupying as researcher for the company.   SEED LATAM: being part of the core team and delegate for this governance in behalf of the whole community.   Optimism en Español: as an external contributor.   Therefore, I will not vote for these projects. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.2
                },
                {
                    "author_link": "https://gov.optimism.io/u/lee0007",
                    "index": "4",
                    "likes": "2",
                    "time": "13/03/2023-22:06:05",
                    "content": "Originally posted in Discord This posts includes minor edits  I nominated TE Academy for RPGF2 as a former study group lead and student I have completed the Token Engineering Fundamentals Program During the first cohort (October 22) NFT certification was free, for myself and other students. Since 1 Mar 2023, the online course remains free to study but certification NFTs are now paid for (~ $249 per module OR $929 for full course 5 modules) as a path to sustainable course development. If funded under RPGF2 I understand from the submitted application that OP would be used to provide current and future scholarships for students to reduce or cover the cost of NFT certification I currently have a three-month contract totalling $3000 USD (Jan Feb Mar) to help establish a writers guild within the academy, as a potential path for students to contribute as copywriters to reduce/cover the cost of certification. It is unlikely that the current contract is extended due to the extent of time further volunteered, currently bandwidth is limited and I still need to cover living costs. I do however hope to continue to support TE Academy. This is not yet up for discussion as establishing the writer Guild infrastructure, policy and process is still WIP As a former student, I would not benefit directly from RFPG2 scholarships. However, supporting public goods, and especially education is a primary focus for me. I recognise this makes me biased towards education however I am committed to the code of conduct and will make a professional and unbiased review of each proposal prior to voting. Does this amount to a COI that would prevent me from voting in support of TEAcademy? Accept the need to abstain if necessary in this case. This is the only possible COI that I am currently aware of.  The only response to date here indicates this is not a conflict of interest that would prevent me from voting, and in my experience with COI where disclosure is provided,  I believed so too… Additional advice is that     system:  …the badge holder manual specifies that: “Badgeholders are expected to NOT cast votes in favour of any project they have a financial or reputational stake in.”   Under this terminology, I clearly should not vote for TE Academy. As per the 2023 Roadmap the certification NFTs are intentionally tied to reputation as a means of building industry credentials. Extending the common meaning of COI to encompass web3 reputation - when web3 is just beginning to quantify and account for the value of reputation - and as a basis to NOT vote seems imo a step too far. For another example, I would say that as Citizen House badge holders we all now have a reputational stake in Optimism which all nominees are working to advance. Under this definition of COI, it could be argued that a reputational stake in Optimism is grounds to question many more votes that would typically be legitimate, provided disclosure. Unless further discussed and clarified I will abstain from voting although with some disappointment because during the period being funded (~ Nov 22 - Jan 22) I was simply one of the many students that benefited from the free online TE Fundamentals course Would greatly appreciate some additional perspectives on this… ",
                    "links": [
                        "https://gov.optimism.io/t/education-nominations-for-rpgf2/4640/77",
                        "https://tokenengineering.net/user/6345c57c0efb4e16300d975e",
                        "https://app.optimism.io/retropgf-discovery/0x3b067Af83F540cB827825a6Ee5480441a4237E77",
                        "https://gov.optimism.io/t/delegate-code-of-conduct/3943",
                        "https://discord.com/channels/667044843901681675/892113251851206756/1082423528965541928",
                        "https://medium.com/tokenengineering/te-academy-roadmap-2023-9af753e9c0a8"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.41521164021164
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "5",
                    "likes": "4",
                    "time": "13/03/2023-22:44:25",
                    "content": "I will NOT be voting for:  EthernautDAO (founder)  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/diligit",
                    "index": "6",
                    "likes": "4",
                    "time": "14/03/2023-18:57:14",
                    "content": "I will not vote for diligit (myself) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/krzkaczor",
                    "index": "7",
                    "likes": "1",
                    "time": "14/03/2023-20:22:17",
                    "content": "I will not vote on projects that I am directly associated with:  L2BEAT dEth / TypeChain  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "8",
                    "likes": "2",
                    "time": "15/03/2023-20:27:50",
                    "content": "I will not vote for:  rotki (am the founder) safe (am an investor)  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/yoavw",
                    "index": "9",
                    "likes": "1",
                    "time": "15/03/2023-20:38:08",
                    "content": "I will not vote for:  Account Abstraction / ERC-4337 / Infinitism (I’m a co-author/builder)  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "10",
                    "likes": "3",
                    "time": "15/03/2023-23:13:49",
                    "content": "    lee0007:  Under this terminology, I clearly should not vote for TE Academy. As per the 2023 Roadmap the certification NFTs are intentionally tied to reputation as a means of building industry credentials.   I don’t know if my opinion counts anything here, but I believe your interpretation is a bit too strict here. I personally think you voting for TE Academy would be all right here. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.642857142857142
                },
                {
                    "author_link": "https://gov.optimism.io/u/lee0007",
                    "index": "11",
                    "likes": "2",
                    "time": "16/03/2023-08:20:05",
                    "content": "Thank you for taking the time to respond to my request for input /discussion. I value both your perspective and the time taken to share and the opportunity to respond w where I’ve landed on this since original disclosure. I would love to vote for TEAcademy hence the nomination and under a typical COI I would confidently vote, having disclosed the situation. However, for me, reputation is another matter entirely to simple interest. It’s much more than NFTs and a current contract. Reputation is me. My sense of reputation is intrinsic to who I am, it’s not determined by an NFT, nor how I am portrayed or sometimes perceived. Reputation = Me = Values Now I recently learned my values present an open attack vector. But attacks do not change who I am nor the values on which I operate - integrity, service, collaboration, excellence, gratitude, solutions, transparency, accountability, faith…values I consistently try to live by and upon which my reputation stands. I always invest my reputation where I work because my values are the basis with which I choose where to invest my time and talent. I volunteer and contract w TEAcademy I can’t subtract reputation without removing myself. Maybe this is naive &/or ego, hence the attack vector idk it is what it is… I abstain also because I trust others might also recognise some value in TEAcademy teaching the ethical responsibilities, rigour and discipline of token engineering via free education and OP scholarships. Happy to trust the wisdom of other optimistic citizens on this. Que cera cera ",
                    "links": [
                        "https://gov.optimism.io/t/retropgf-round-2-voting-rationale/5570/10"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.902852049910874
                },
                {
                    "author_link": "https://gov.optimism.io/u/Griff",
                    "index": "12",
                    "likes": "4",
                    "time": "18/03/2023-02:22:12",
                    "content": "GM My Disclosures: I founded: Giveth Commons Stack Praise Pairwise So I won’t be voting for any of the above projects. I hold tokens in BanklessDAO Gitcoin So I will give them both a smaller allocation than I other wise would because of my bias I am good friends with people on the teams of: Rotki TE Academy Trueblocks Goerli Gashawk Kernal Optimism DAppNode Package Week in Ethereum News Erigon dm3 Lodestar Nimbus Blobscan I have no direct financial stake in the orgs mention above in this section, but I also have insight into the value they provide, so I will be careful to check my bias and only give these projects the rewards they deserve. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5625
                }
            ]
        }
    ],
    "group_index": "598"
}