{
    "poll_list": [
        {
            "id": "0xac7ba616ebee96930f313ddb4b75de9024ff88f17bf3c82ca783d904ab38d551",
            "title": "Season 2 Governance Fund Proposal: Bankless Academy v2 ",
            "discussion": "https://gov.optimism.io/t/ready-gf-phase-1-proposal-bankless-academy-v2/3353",
            "body": "This Governance Fund Phase 1 proposal is eligible for voting in Cycle 6. For a complete list, check out [Voting Cycle 6 Roundup](https://gov.optimism.io/t/voting-cycle-6-roundup/3481).\n\nThis proposal is slated for review and recommendation by [committee name/link]. Please refer to [their thread] for this cycle to read more. Committees will post their recommendations by the 3rd day of the Voting Week. \n\nAs a reminder, since this is the first vote since the [introduction of committees](https://gov.optimism.io/t/introducing-governance-committees/3238): by approving committees, the Token House entered a social contract to entrust and delegate the bulk of decision-making to the committee. Therefore, any delegates voting against the committee recommendation are expected to provide a justification to the community as to why they voted differently.",
            "choices": [
                "For",
                "Against",
                "Abstain"
            ],
            "scores": [
                11271773.422163824,
                311181.2615139256,
                189723.96747296973
            ],
            "start": 1663873646,
            "end": 1664392046,
            "snapshot": "24629982",
            "state": "closed",
            "author": "0x47C88bb92B409fF25F6587EA611fac4e55f76007",
            "space": {
                "id": "opcollective.eth",
                "name": "Optimism Collective"
            }
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/ready-gf-phase-1-proposal-bankless-academy-v2/3353",
            "title": "[READY][GF: Phase 1 Proposal] Bankless Academy v2 ",
            "index": 3353,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Governance Fund: Phase 1"
            ],
            "tags": [
                "cycle-6",
                "passed"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/Tetranome",
                    "index": "1",
                    "likes": "10",
                    "time": "23/08/2022-07:19:13",
                    "content": "EDIT: We have updated our proposal to the new OP proposal format.  Previous Proposal:   (Proposal) Bankless Academy v1  Project Name  Bankless Academy  Untitled (3)1016×600 476 KB   Number of OP tokens requested  26,500 OP (We will update this to equal $30,000 USD at time of governance vote.)  Author’s name and point of contact (Telegram, Email, Discord)  Tetranome Telegram: @Tetranome Email: tetranome.academy@gmail.com Discord: Tetranome🏴#1965  L2 Recipient address Bankless Academy Optimism multisig: 0xbFBceA2a72Bc2e62E967fA0c79458dD507708469   Usage The Bankless Academy dApp launched at ETHDenver 2022, with 14,018 lesson completions (using only POAP incentives). In total, there have been 8015 unique addresses connected to Bankless Academy. Usages statistics as of posting: Wallet Basics (Released Feb 2022) 7465 Intro to DeFi (Released Feb 2022) 5877 Blockchain Basics (Released June 2022) 259 Academy Community (Released July 2022) 354 Web3 Security (Released Aug 2022) 105 Increasing metrics through SBT badge distribution: Since ETHDenver, our team has partnered with MintKudos.xyz to issue soulbound token badges to users who complete Academy lessons, allowing our community to display on-chain verification of their general onboarding and per-topic training. To mitigate badge farming and other sybil-behaviour, only users who have completed proof of personhood through our Gitcoin Passport integration will receive Academy badges. This sybil-protection gateway opens up the possibility for other on-chain rewards in the future. (Note: we will also be enabling retroactive badge claim for users who decide to complete proof of personhood at a later time.) Onboarding users to Optimism: For context, the Bankless Academy onboarding experience aims to guide users from Centralised Exchange through to becoming a DeFi/NFT/DAO Hero on Ethereum - building skills they can then take with them to other ecosystems should they choose. Our ‘Essentials’ onboarding journey includes:  Going Bankless Wallet Basics Web3 Security Blockchain Basics Layer 1s: Ethereum and the Trilemma Layer 2s: Solving the Trilemma  This is followed by a branching of paths, allowing the user to follow their curiosity deep into topics of DeFi, NFTs, DAOs, and more. We believe that by ending this ‘Essentials’ path with a lesson that shows engage with Layer 2s (in this case, Optimism), Bankless Academy can drive a large number of users to:  begin using Optimism as their default Layer 2 DeFi & NFT solution, complete Ethereum proof of personhood, discover and consider joining Optimism’s Citizen House, purchase OP tokens to engage in Optimism governance. flex their collection of Academy SBT credentials on the Optimism ecosystem, opening up an exciting range of possible ecosystem chemical reactions.  Our lessons also include an on-chain quest at the end, for which we would like to use a relevant Optimism service that helps the user test their knowledge on the topic of Layer 2s. We’d like to open this up as a topic of conversation with the Optimism community. As an example, our Wallet Basics lesson briefs the user on wallet types and best practices, before finally linking them to a Metamask download and asking them to come back once installed to sign their first message and claim their first badge. We also work with off-chain questions when appropriate. Our Blockchain Basics lesson runs the user through the basic functions of blockchain technology, and then requires them to enter the To & From addresses from the linked Etherscan transaction.  Optimism Alignment (< 200 words) Bankless Academy is a free-to-access, open-source, education hyper-structure seeking to empower internet society with the information and tools necessary to achieve financial self-sovereignty; with going Bankless. Our bDAO-native team is on a mission to provide quality web3 education as a free-for-everyone public good. With Optimism being a DAO that requires active participation to allocate value and build positive-sum structures, we believe that building a bridge between it and our growing Bankless Academy ecosystem will help to create an educated, sustainable and functional Optimism - and Ethereum - culture & economy. For the User:  Users can onboard to cheaper fees on Optimism L2. Users have a basis of understanding of Public Goods and why they’re valuable. Users have an easy onboarding to what makes Optimism special — an explicit focus on public goods funded retroactively from the sequencer while maintaining Ethereum’s core ideals of decentralization and security. Users have undergone proof of personhood (PoP), setting them up for Citizenship in Optimism.  For Optimism:  An Optimistic Ethereum L2 learning lesson. A Bankless-native onboarding funnel. Additional marketing within the Bankless ecosystem.  For Bankless Academy:  Development funding. Association with the Optimism ecosystem.   Token distribution (< 1000 words) Half of the tokens will be distributed to our contributors building the Ethereum Layer 2s (and Optimism) onboarding lesson. The other half will remain in the community treasury, to be deployed towards continued development of the Academy platform. We have presently decided to avoid lesson completion token incentives for the following reasons:   Even with current-gen proof-of-personhood, financial rewards disproportionately incentivise farming activity. We believe that our credential system poses a more interesting reward structure that inherently reduces farming behaviour and provides long-lasting ecosystem effects.   Our vision of a Web3 University is aimed at creating a space where learning and positive-sum thinking are welcome - thus we want to avoid building a community based on incentivising lesson completions for the wrong reasons. The Bankless Academy journey still has the potential to lead to financial gain, but this is left to post-education when users can deploy their credentials in finding web3 work.    How will this distribution incentivize usage and liquidity on Optimism?  We have already presented our usage incentivisation above, and have no direct liquidity incentives to add.  Why will the incentivized users and liquidity remain after incentives dry up?  The Bankless Academy journey, through its education, credential issuance, and practical exercises, focuses on building long-term adoption and community involvement.  Over what period of time will the tokens be distributed?  There is no planned community token distribution.  How much will your project match in co-incentives?  There is no planned community token distribution.  Grant category:  Tooling   Updated Proposal: Project name: Bankless Academy Author name and contact info (please provide a reliable point of contact for the project): Tetranome Telegram: @Tetranome Email: tetranome.academy@gmail.com Twitter: https://twitter.com/Tetranome Discord: Tetranome🏴#1965 I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: [Yes/No] Yes L2 recipient address: Bankless Academy Optimism multisig: 0xbFBceA2a72Bc2e62E967fA0c79458dD507708469 Which Voting Cycle are you applying for?: cycle-6 Grant category: Tooling Is this proposal applicable to a specific committee? [y/n, link to committee] No Project description (please explain how your project works): Bankless Academy is a free-to-access, open-source, education hyper-structure seeking to empower internet society with the information and tools necessary to achieve financial self-sovereignty; with going Bankless. Our bDAO-native team is on a mission to provide quality web3 education as a free-for-everyone public good.  Untitled (3)1016×600 476 KB  Project links:  Website: https://app.banklessacademy.com/  Twitter: https://twitter.com/BanklessAcademy  Discord/Discourse/Community: https://discord.gg/aDTvpmFd https://discord.com/channels/834499078434979890/875461442265051187  Please include all other relevant links below: https://gm.xyz/c/BanklessAcademy   Additional team member info (please link): DidierKrux Twitter: https://twitter.com/didierkrux Discord: DidierKrux.eth🏴#6120 iSpeakNerd Twitter: https://twitter.com/iSpeak_Nerd Discord: iSpeakNerd.eth #6969 OrnellaWeb3 Twitter: https://twitter.com/OrnellaWeb3 Discord: OrnellaWeb3🏴#1111 Please link to any previous projects the team has meaningfully contributed to: N/A Relevant usage metrics (TVL, transactions, volume, unique addresses, etc. Optimism metrics preferred; please link to public sources such as Dune Analytics, etc.): Bankless Academy initially launched with POAP incentives. We have since decommissioned POAP distribution in favour of Mintkudos.xyz soulbound tokens, which we will be launching next month. We plan to explore further incentivisation in the future. Usages statistics as of posting: 14,018 lesson completions 8015 unique addresses connected Wallet Basics (Released Feb 2022) 7465 Intro to DeFi (Released Feb 2022) 5877 Blockchain Basics (Released June 2022) 259 Academy Community (Released July 2022) 354 Web3 Security (Released Aug 2022) 105 Competitors, peers, or similar projects (please link): While https://rabbithole.gg/ is pursuing similar functionality to Bankless Academy, we believe that our focus on interactive lessons, on-chain quests, and community-driven content creation offer a unique product that the Rabbithole on-chain quest formula does not offer. Is/will this project be open sourced? Yes/No/In Future Yes, our project is open source. Optimism native?: Yes/No No Date of deployment/expected deployment on Optimism: We are expecting to deliver our first Optimism lesson within two months of grant issuance. Should our proposal pass through cycle-6, this would set projected delivery for end of November 2022. Ecosystem Value Proposition:   What is the problem statement this proposal hopes to solve for the Optimism ecosystem? Optimism would benefit from an incentivised onboarding ramp that bolsters informed, active participation in its construction/upkeep of OP’s positive-sum structures.   How does your proposal offer a value proposition solving the above problem? Education / Tooling: The Bankless Academy lesson format:  educates blockchain explorers on a specific topic, sends these explorers on an interactive platform quest, distributes composable soulbound-token badges for successful completions, providing on-chain certification that a user has completed the lesson.  Our user onboarding experience aims to guide users from Centralised Exchange through to becoming a DeFi/NFT/DAO Hero on Ethereum - building skills they can then take with them to other ecosystems should they choose. Our ‘Essentials’ onboarding journey includes:  “Going Bankless” Wallet Basics Web3 Security Blockchain Basics Layer 1s: Ethereum and the Trilemma Layer 2s: Solving the Trilemma  We believe that by ending this ‘Essentials’ path with a lesson that shows users how to engage with Layer 2s (in this case, Optimism), Bankless Academy can drive a large number of users to:  begin using Optimism as their default Layer 2 DeFi & NFT solution, complete Ethereum proof of personhood, discover and consider joining Optimism’s Citizen House, purchase OP tokens to engage in Optimism governance. flex their collection of Academy SBT credentials on the Optimism ecosystem, opening up an exciting range of possible ecosystem chemical reactions.  Following the completion of our ‘Essentials’ journey, users reach branching paths allowing them to explore their curiosity deep into topics of DeFi, NFTs, DAOs, and more. This provides limitless options for additional lessons and exploration for platforms/protocols operation within the Optimism ecosystem. User Research: Our lesson production pipeline includes iterative learning sessions that can help to identify OP user knowledge bottlenecks, and discover suitable metaphors for explaining advanced concepts. Marketing + Brand Association: Throughout lesson production, the Optimism ecosystem will benefit from:  Multiple build announcements via Bankless Academy communication channels. Multiple tweets via @BanklessDAO to its ~59,000 followers. A BanklessDAO newsletter feature - 10,000 regular subscribers, averaging 13,000 views. Multiple announcements in BanklessDAO community calls.  OPTIONAL: Twitterspace + AMA with members of the Optimism team, talking specifically about Optimism as an L2 solution.    Why will this solution be a source of growth for the Optimism ecosystem? . Through education, direct onboarding quests, proof of personhood, user research and marketing within the Bankless ecosystem, Bankless Academy has the ability to drive a large number of active and equipped users to use Optimism services - and even begin taking part in Optimism governance.   Has your project previously applied for an OP grant? If successful, please link to your previous grant proposal and provide a brief update on milestones achieved with the grant. If unsuccessful, and this is a resubmission, please specify how you have incorporated significant changes in accordance with feedback. No Number of OP tokens requested: 33,000 OP (We use USD valuations to reward our contributors, even though they will be sent OP. This number has been updated from our past proposal to reflect a valuation of $30,000 at time of posting.) Did the project apply for or receive OP tokens through the Foundation Partner Fund?: Yes/No/In Process No If OP tokens were requested from the Foundation Partner Fund, what was the amount?: N/A How much will your project match in co-incentives? (not required but recommended, when applicable): N/A Proposal for token distribution:   How will the OP tokens be distributed? (please include % allocated to different initiatives such as user rewards/marketing/liquidity mining. Please also include a justification as to why each of these initiatives align with the problem statement this proposal is solving.) Roughly 60% will be distributed to our contributors building and marketing the Ethereum Layer 2s (and Optimism) onboarding lesson. The other half will remain in the community treasury, to be deployed towards continued development of the Academy platform. We have presently decided to avoid lesson completion token incentives for the following reasons:  Even with current-gen proof-of-personhood, financial rewards disproportionately incentivise farming activity. We believe that our credential system poses a more interesting reward structure that inherently reduces farming behaviour and provides long-lasting ecosystem effects. Our vision of a Web3 University is aimed at creating a space where learning and positive-sum thinking are welcome - thus we want to avoid building a community based on incentivising lesson completions for the wrong reasons.The Bankless Academy journey still has the potential to lead to financial gain, but this is left to post-education when users can deploy their credentials in finding web3 work.    Over what period of time will the tokens be distributed for each initiative? Shorter timelines are preferable to longer timelines. Shorter timelines (on the order of weeks) allow teams to quickly demonstrate achievement of milestones, better facilitating additional grants via subsequent proposals. Distribution to contributors would take place according to our monthly distribution cycle that takes place on the 8th of every month.   Please list the milestones/KPIs you expect to achieve for each initiative, considering how each relates to incentivizing sustainable usage and liquidity on Optimism. Please keep in mind that progress towards these milestones/KPIs should be trackable. M1) Lesson production begins:  A consulting session, establishing lesson goals, content direction, and a timeline for the collaboration.  M2) Iterative Learning Sessions & build events:  3x 1.5 hour live learning sessions. Text AMA on our gm.xyz page (see our 1inch AMA here). Collaboration Twitterspaces event.  M3) Lesson launch:  Academy marketing campaign on Twitter and other media platforms. Announcement on the BanklessDAO Community Call. Announcement in the BanklessDAO Newsletter. Permanent feature on the Bankless Academy site and community pages.    Why will incentivized users and liquidity on Optimism remain after incentives dry up? The Bankless Academy journey, through its education, credential issuance, and practical exercises, focuses on building long-term adoption and community involvement.   Please provide any additional information that will facilitate accountability:(smart contracts addresses relevant to the proposal, relevant organizational wallet addresses, etc.) Bankless Academy multi-sig: https://gnosis-safe.io/app/eth:0xf80Cd14ec747b2AdF7B1A9911b38c65a885dAeeA/balances ",
                    "links": [
                        "https://app.banklessacademy.com/lessons",
                        "https://twitter.com/Tetranome",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/0/0054594b7af0e524681bd131f62e3f66f29b0992.png",
                        "https://app.banklessacademy.com/lessons",
                        "https://twitter.com/BanklessAcademy",
                        "https://discord.gg/aDTvpmFd",
                        "https://discord.com/channels/834499078434979890/875461442265051187",
                        "https://gm.xyz/c/BanklessAcademy",
                        "https://twitter.com/didierkrux",
                        "https://twitter.com/iSpeak_Nerd",
                        "https://twitter.com/OrnellaWeb3",
                        "http://Mintkudos.xyz",
                        "https://rabbithole.gg/",
                        "https://gm.xyz/c/BanklessAcademy",
                        "https://gm.xyz/c/BanklessAcademy/e4976323-4262-4f47-a39b-1a7d289a1219",
                        "https://gnosis-safe.io/app/eth:0xf80Cd14ec747b2AdF7B1A9911b38c65a885dAeeA/balances",
                        "https://gov.optimism.io/t/voting-cycle-6-roundup/3481/10",
                        "https://gov.optimism.io/t/defi-latam-delegate-communication-thread/2950/8",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/9",
                        "https://gov.optimism.io/t/gfx-labs-delegate-communication-thread/2728/16"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.531779188948307
                },
                {
                    "author_link": "https://gov.optimism.io/u/Ovetta",
                    "index": "2",
                    "likes": "7",
                    "time": "23/08/2022-15:14:23",
                    "content": "I love this proposed project.  Alignment is on point.  Modest number of Tokens requested.  Would like to see some co-incentives but  I’ll probably use this educational tool myself. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.416666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/NFThinker",
                    "index": "3",
                    "likes": "5",
                    "time": "24/08/2022-09:58:04",
                    "content": "I am fully on board with this initiative. I believe Bankless Academy is an innovative platform with endless potential to onboard new users to Web3, and what better use of that tool than to direct them to the Optimism ecosystem. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.926136363636364
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "4",
                    "likes": "5",
                    "time": "24/08/2022-12:07:17",
                    "content": "I love this proposal and you’ll have my full support. I’ll also recommend citizen NFTs for each individual involved on this project in the future given the perfect alignment with public goods this project has. I’m part of banklessDAO @Tetranome do you mind dming me on discord Dhannte#1010. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.541666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/Benjiming",
                    "index": "5",
                    "likes": "3",
                    "time": "25/08/2022-17:35:04",
                    "content": "Agree. Bankless Academy would be a good group to work/align with since Optimism is also onboarding the world to web3. This could also provide more exposure to Optimism as an L2 of choice. I’m also a member of BanklessDAO and have shared Optimism’s Get Started app with my network as a way to educate folks. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/katie",
                    "index": "6",
                    "likes": "3",
                    "time": "25/08/2022-20:41:59",
                    "content": "Huge fan of Bankless! This proposal sounds like the funds requested will be used to fund internal operations, is that correct? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/Tetranome",
                    "index": "7",
                    "likes": "2",
                    "time": "26/08/2022-12:41:22",
                    "content": "@Ovetta Thank you for the feedback! Hope to see you around our community. @NFThinker, @Gonna.eth, @Benjiming thanks for showing your support. Hi @katie, that’s correct, the OP would go towards team compensation during and post lesson build! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/TriaxialTick5",
                    "index": "8",
                    "likes": "2",
                    "time": "26/08/2022-13:12:49",
                    "content": "Well thought-out initiative. Wish you all the best!  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/diligit",
                    "index": "9",
                    "likes": "6",
                    "time": "26/08/2022-19:03:17",
                    "content": "I like your proposal, project which offers a unique area of contribution to the Optimism ecosystem (knowledge), and the requested grant meets the needs. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.1875
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "10",
                    "likes": "3",
                    "time": "28/08/2022-19:34:16",
                    "content": "Isn’t this more suited for RPGF. Knowledge and education by nature is public good, I also see that your website you’re mentioning your project as public good. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.8999999999999995
                },
                {
                    "author_link": "https://gov.optimism.io/u/CriptoSpanglish",
                    "index": "11",
                    "likes": "3",
                    "time": "31/08/2022-06:11:16",
                    "content": "Fully onboard with this proposal. If there’s anything in terms of onboarding users web3 needs in general, and L2s in particular, that is education. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.541666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/jrocki.eth",
                    "index": "12",
                    "likes": "2",
                    "time": "01/09/2022-04:26:30",
                    "content": "    Tetranome:   An Optimistic Ethereum L2 learning lesson. A Bankless-native onboarding funnel. Additional marketing within the Bankless ecosystem.    First off, Bankless, thank you for on boarding me into Layer 2s in 2021. Much appreciated! I agree with using the OP to fund internal developement work vs providing direct token incentives to users 100% at this point. Would you be able to go into a little more detail as to the items you listed as direct benefits to Optimism? For example what would be involved in the OP specific lesson and would users actually be interacting with OP apps or just learning about them on screen? How would the Bankless-native onboarding funnel work in general? Once the user is at the end of this funnel what would they have interacted with or been exposed to within the OP ecosystem? Would the marketing be Bankless promoting OP specific lessons and learnings? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.651041666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/hirokennelly",
                    "index": "13",
                    "likes": "4",
                    "time": "01/09/2022-16:08:46",
                    "content": "I’m fully in support of this proposal. Bankless Academy has been building a cutting-edge education platform for Web3. Would love to see a deeper integration with OP!! Great work! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.453125
                },
                {
                    "author_link": "https://gov.optimism.io/u/0xTrevor",
                    "index": "14",
                    "likes": "1",
                    "time": "01/09/2022-19:01:33",
                    "content": "Completely agree with the idea ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/iSpeakNerd",
                    "index": "15",
                    "likes": "2",
                    "time": "04/09/2022-00:34:40",
                    "content": "I’m a team member for Bankless Academy as well, thanks for all the support on here, it’s very encouraging to see the positive response the project has gotten so far! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.940340909090908
                },
                {
                    "author_link": "https://gov.optimism.io/u/arabianhorses",
                    "index": "16",
                    "likes": "2",
                    "time": "04/09/2022-16:01:54",
                    "content": "I want to support every project that tries to educate people about web3, any amount that is requested seems reasonable ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/Tetranome",
                    "index": "17",
                    "likes": "3",
                    "time": "05/09/2022-13:47:41",
                    "content": "Hi @jrocki.eth, great to see the Bankless movement is alive and well on Optimism. Thank you for your feedback, let’s dive in.     jrocki.eth:  I agree with using the OP to fund internal developement work vs providing direct token incentives to users 100% at this point.   Excellent, reassuring to hear this from within the OP community.     jrocki.eth:  Would you be able to go into a little more detail as to the items you listed as direct benefits to Optimism? For example what would be involved in the OP specific lesson and would users actually be interacting with OP apps or just learning about them on screen? How would the Bankless-native onboarding funnel work in general? Once the user is at the end of this funnel what would they have interacted with or been exposed to within the OP ecosystem?   At Bankless Academy we are very focused on balancing wide coverage of general crypto-knowledge with the recommendation of tools that align strongly with Bankless values. Because of this we want to build our ‘Essentials’ lessons - lessons that are supposed to focus on introductory blockchain theory - to focus on general topic theory (in this case Layer 2s), but end with an on-chain quest that interacts with a specific protocol to give the user real-world experience. At this point in the user journey, the Academy Explorer has come from their native CEX, learned about what it means to go Bankless, set up their first self-custody wallet, covered fundamental blockchain theory, and has learned about the blockchain trilemma and why we want to prioritise decentralisation/security on the base layer. They are approaching our Layer 2 lesson expecting to understand how Ethereum is solving the scalability aspect outlined in the previous lesson, thus it is important that we cover fundamental theory before we try to sell them on a specific ethos/product. So with this context, to answer your question, we would cover Optimism itself in the final slides of the lesson (what OP offers the user/ecosystem, why we’re sending the user there, and some tips on how to best get involved), and finish with an Optimism quest (perhaps funding their wallet through an OP on-ramp, or bridging from their CEX). Worth mentioning is that after the L2 lesson, the Explorer is ready to begin branching out into our DeFi, NFT, and DAO lesson branches (under construction), which of course would lead to the user interacting with further platforms/protocols and communities operating on OP. Our DAO branch aims to cover DAO-specific onboarding, where we could look to create a follow-up lesson, in the future, that allows the user to go beyond basic Optimism usage and delve into a full Optimism governance onboarding experience. We’re currently building one of these for BanklessDAO, where they will be ending the lesson with issuance of an on-chain badge, and membership purchase options.     jrocki.eth:  Would the marketing be Bankless promoting OP specific lessons and learnings?   Here’s what the Optimism community can expect:  3x small class iterative learning sessions where we cover the general topic and the collaborator’s platform/protocol + all marketing this includes. Multiple build announcements via Bankless Academy communication channels. Multiple tweets via @BanklessDAO to its ~59,000 followers. A BanklessDAO newsletter feature - 10,000 regular subscribers, averaging 13,000 views. Multiple announcements in BanklessDAO community calls.  OPTIONAL: Twitterspace + AMA with members of the Optimism team, talking specifically about Optimism as an L2 solution.  NOTE: Bankless Academy was born out of BanklessDAO, so we do not have direct access to BanklessHQ’s communication channels.  If the Optimism Collective is interested in joining us for a full collaboration build, like our current ‘DEX Aggregators’ lesson build with 1inch, the lesson build would receive heavily amplified marketing exposure. Lessons built with involvement from a well-known team tend to attract increased hype and legitimacy. This collaboration option requires the availability of an Optimism subject-matter expert who joins our team to:  interact with our learners in the 3x small class iterative learning sessions used to identify learning bottlenecks, join an Academy/Optimism Twitterspace, and text AMA event hosted on our gm.xyz community.  I hope this answers your questions! Please let me know if I can provide more information. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.595486111111111
                },
                {
                    "author_link": "https://gov.optimism.io/u/Tetranome",
                    "index": "18",
                    "likes": "4",
                    "time": "05/09/2022-13:56:16",
                    "content": "Hi @OPUser, yes we definitely aim to operate Bankless Academy as a public good. While I understand there will be more appropriate channels for public goods funding at Optimism in the future, we plan to begin building our L2 lesson within the next month and I understand that RPGF is not yet active. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.87037037037037
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "19",
                    "likes": "3",
                    "time": "05/09/2022-15:25:36",
                    "content": "Yes, you are right and I am super excited about Citizen house and wish to see the first batch in action in coming months. Although we have a dedicated funding on public good, we can be little flexible when reviewing an edge case proposal and this also was discussed quite a lot in the past. You have a huge user base, content you create help users understand the settlement layer along with overall web3 space. But in my opinion, for a proposal to be considered as an edge case it must be focused only on Optimism chain. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.464056776556777
                },
                {
                    "author_link": "https://gov.optimism.io/u/Tetranome",
                    "index": "20",
                    "likes": "0",
                    "time": "06/09/2022-08:54:00",
                    "content": " @OPUser  it is reassuring to hear that there are paths available for projects with alternative value propositions! I would like to address the concern around Optimism exclusivity. Our Layer 2 lesson is planned to follow the same structure of our Layer 1 lesson, where we cover the many varieties of L1s before focusing in on Ethereum. In our L2 follow-up, the lesson would reference both Optimism and alternative L2 solutions for comparison sake in the theory section. We would outline the trade-offs each L2 is making through their tech choice, and include references to the culture/principles underlying each. The Optimism-focused section in the closing half then explains why we believe Optimism aligns most closely with Bankless values. We would cover some key information to provoke curiosity around the various parts of the Optimism ecosystem, and end with an Optimism on-chain quest that rewards the user for beginning their Optimism L2 journey. In our team’s opinion, a lesson collaboration that covers fundamental blockchain theory and solution comparisons, followed by with an individual recommendation + information to get started + on-chain interaction makes for a stronger user experience than a fully sponsored lesson that omits surrounding information. We believe that helping the user build fundamental context around our recommendations and the areas of exploration we present builds a stronger and more sustainable ecosystem culture for everyone. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.916666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/Tetranome",
                    "index": "21",
                    "likes": "0",
                    "time": "06/09/2022-14:06:23",
                    "content": "With the weekly cycle deadline approaching this afternoon I would like to move this proposal from [Draft] to [Review] by OP delegates. We welcome non-delegates to continue the conversation. Feedback summary:  We have responded to questions regarding level of Optimism focus in the lesson by providing a breakdown of lesson content party exposure. There were requests to detail planned marketing events, to which we have responded with a complete list of planned events. Our team has split its build approach into two parts, to account for collaboration availability for the Optimism Collective: 1 - Our team manages lesson production, handling marketing events entirely on our end. 2 (OPTIONAL) - We invite the Optimism Collective to assign a team member to be our L2 subject-matter specialist, joining our Iterative Learning Sessions to teach Academy users, identify their learning bottlenecks, and refine the lesson content. The subject-matter specialist is also invited to both a Twitterspace event and a text AMA event, focusing on the collaborator’s story, L2 technology, and the lesson build process. While it appears that our proposal might be more suited for RPGF when available, we would like to request consideration as an edge-case proposal to begin building our collaboration lesson in the immediate future. We have responded to questions regarding internal distribution of requested funds, explaining that this grant would have ~50% allocated towards the lesson build (as contributor compensation), and ~50% allocated to the Bankless Academy treasury.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.125
                },
                {
                    "author_link": "https://gov.optimism.io/u/jrocki.eth",
                    "index": "22",
                    "likes": "3",
                    "time": "09/09/2022-03:04:37",
                    "content": "I am 100% for allowing this funding proposal to move through this pipeline. It’s well put together, every question was answered, and elaborated on. This proposal has the potential to generate a very high ROI. In addition, the risk is limited given the relatively small amount of $OP requested. Personally, I think if Optimism is to win the L2 wars we need to find more proposals like this: low initial investment, potential outsized returns Additionally there is time this week is actually still community feedback week:  image1170×799 112 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5393506493506495
                },
                {
                    "author_link": "https://gov.optimism.io/u/scorp",
                    "index": "23",
                    "likes": "1",
                    "time": "09/09/2022-06:15:54",
                    "content": "I like this proposal ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Tetranome",
                    "index": "24",
                    "likes": "2",
                    "time": "12/09/2022-12:19:06",
                    "content": "Ah pardon me, I misunderstood the cycle process. It looks like delegate feedback begins Sept 15th. Thank you for your support! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "25",
                    "likes": "1",
                    "time": "12/09/2022-23:51:53",
                    "content": "Thanks for the proposal! If you plan to have this reviewed in Voting Cycle 6, can you please specify which committee should review your proposal (NFTs and Gaming, Tooling, or DeFi) under the grant category field in the updated proposal template for Cycle 6? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/Tetranome",
                    "index": "26",
                    "likes": "1",
                    "time": "13/09/2022-16:47:22",
                    "content": "Hi @lavande, I have added the following to the main proposal post:  Grant category: Tooling  We missed this update. Are you expecting the entire grant to be updated to the linked format, or do you just want to see this edit? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.277777777777778
                },
                {
                    "author_link": "https://gov.optimism.io/u/Bobbay_StableLab",
                    "index": "27",
                    "likes": "0",
                    "time": "16/09/2022-10:20:06",
                    "content": "This is a great initiative. I have used your resource and think it is a great tool. However, I am inclined to say that your objectives aren’t exactly concrete. Could you expand on what you expect to build in the future for the academy since 50% of the tokens are being reserved for that? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.1875
                },
                {
                    "author_link": "https://gov.optimism.io/u/jrocki.eth",
                    "index": "28",
                    "likes": "2",
                    "time": "16/09/2022-15:36:57",
                    "content": "Bobbay, Tetranome provided some detail in this reply back to me. Hope this helps a bit.     [REVIEW][GF: Phase 1 Proposal] Bankless Academy Governance Fund: Phase 1       First off, Bankless, thank you for on boarding me into Layer 2s in 2021. Much appreciated!  I agree with using the OP to fund internal developement work vs providing direct token incentives to users 100% at this point.  Would you be able to go into a little more detail as to the items you listed as direct benefits to Optimism?  For example what would be involved in the OP specific lesson and would users actually be interacting with OP apps or just learning about them on screen?  How would the B…     ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6875
                },
                {
                    "author_link": "https://gov.optimism.io/u/Tetranome",
                    "index": "29",
                    "likes": "3",
                    "time": "16/09/2022-17:58:16",
                    "content": "Hi @Bobbay_StableLab, thanks for your question. Sharing our vision and roadmap with the community is something we’re considering in our current website update, where we will be making our user journey, product and content roadmaps more concrete and transparent. Our infrastructure objectives for 2022 and 2023 are as follows:  Finalise our soul-bound badge implementation and minting mechanism. Finalise our Gitcoin Passport integration for sybil resistance. Build a statistics dashboard for monitoring lesson, quiz and quest progression. Present lessons with a branching navigation UI (think skilltrees from gaming) that provides users with an overview of their learning journey and the areas of exploration available to them. Gauge lesson interest for upcoming lessons and topics as an early form of community governance. Improve our content management system and migrating the content to decentralized file storage. Multi-language support to open up the Academy onboarding experience to explorers across the globe. Explore avenues of community-driven content creation (permissioned writing).  These are paralleled by our content goals:  Continue launching independent (non-sponsored) lessons focusing on theory, best practices, web3 culture etc. Increase user learning research and the refine our existing user journey.  I hope that the items I’ve included here give you a clearer idea of where we’re headed.   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.175000000000001
                },
                {
                    "author_link": "https://gov.optimism.io/u/Bobbay_StableLab",
                    "index": "30",
                    "likes": "4",
                    "time": "18/09/2022-04:29:30",
                    "content": "looks good, I appreciate the detailed response. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/Tetranome",
                    "index": "31",
                    "likes": "2",
                    "time": "20/09/2022-09:06:08",
                    "content": "Hi all, my understanding is we need one more delegate approval on our proposal. If you have read our proposal and would like to see this move forward, please state your approval in the following OP-requested format: “I am an Optimism delegate [Delegate Commitments - LINK] with sufficient voting power and I believe this proposal is ready to move to a vote.” ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.166666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/Tetranome",
                    "index": "32",
                    "likes": "1",
                    "time": "20/09/2022-10:43:28",
                    "content": "Our proposal has been updated to the new OP proposal format outlined here. You will find the previous version of the proposal in a collapsible segment at the top of the first post on this thread. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.899621212121212
                },
                {
                    "author_link": "https://gov.optimism.io/u/mastermojo",
                    "index": "33",
                    "likes": "3",
                    "time": "20/09/2022-11:09:53",
                    "content": "I am an Optimism delegate [Delegate Commitments - #65 by mastermojo] with sufficient voting power, and I believe this proposal is ready to move to a vote. ",
                    "links": [
                        "https://gov.optimism.io/t/voting-cycle-6-roundup/3481/10"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/katie",
                    "index": "34",
                    "likes": "4",
                    "time": "20/09/2022-17:43:47",
                    "content": "I am an Optimism delegate [Delegate Commitments - #18 by katie] with sufficient voting power and I believe this proposal is ready to move to a vote. ",
                    "links": [
                        "https://gov.optimism.io/t/voting-cycle-6-roundup/3481/10"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Jadmat.Eth-DefiLatam",
                    "index": "35",
                    "likes": "1",
                    "time": "22/09/2022-11:36:34",
                    "content": "hey, beautiful project; just one question, do you plan to launch Bankless Academy in Spanish? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.125
                },
                {
                    "author_link": "https://gov.optimism.io/u/Tetranome",
                    "index": "36",
                    "likes": "4",
                    "time": "22/09/2022-14:28:34",
                    "content": "Hi @Jadmat.Eth-DefiLatam we have multi-language support on our product roadmap for next year  We will likely launch this feature with translation bounties. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/polynya",
                    "index": "37",
                    "likes": "3",
                    "time": "25/09/2022-05:39:30",
                    "content": "While this proposal is out of scope for Governance Fund (more suited to RPGF as others have mentioned) which is focused on incentivizing direct usage of Optimism through migrating L1 dapps and promoting novel L2-specific apps, Bankless has done plenty of very important education, and the tokens requested is reasonable enough for me to make an exception. I hope to see hjgh-quality Optimism-related content. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.32
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "38",
                    "likes": "2",
                    "time": "25/09/2022-07:21:09",
                    "content": "Voted: Against Difficult decision for sure. I agree that this is a public goods project and as per new guidelines we should consider public goods projects as well but to me this must only be focused on Optimism.    Governance Update #4   The Token House is welcome to consider any and all proposals which would drive growth or address a gap in the Optimism ecosystem, including public goods projects.   Bankless is leading the education frontier and would love to see such projects in RPGF round. ",
                    "links": [
                        "https://gov.optimism.io/t/opuser-delegate-communication-thread/2777/12"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.56198347107438
                },
                {
                    "author_link": "https://gov.optimism.io/u/krzkaczor",
                    "index": "39",
                    "likes": "7",
                    "time": "25/09/2022-08:42:06",
                    "content": " 1. Presentation  We are an officially recognized Tooling Governance Committee, responsible for assessing proposals related to tooling and infrastructure (wallets, bridges etc.).  2. About the project  This project addresses perhaps one of the most important and neglected sectors of the ecosystem, education; it does it in a very clean, clear and precise way; inviting to a creative and entertaining experience, which motivates to continue learning in each new stage that is completed; also encouraging with tokens that define the level of learning, being perhaps, for many, the first interaction with them. Something important that I add, as a personal conclusion; is that Bankless Academy is a leg of Bankless DAO, the latter being very inserted the ecosystem, the content is created and goes directly to the consumer; we see many educational initiatives, where the generators “take” the information from the web, order it and adapt it; Beyond the lack of quality that this generates, that the content is “direct” is key in an industry so tied to changes.  3. About the following  The proposal was published from August 23 in a previous format (now called v1) then being adapted to a v2 with the current system. Under the process, we saw a very explanatory and detailed proposal; and we celebrate their active disposition to precise and fast answers with the delegates and community interested on it. As a Tooling committee, the project was also cataloged as “Tooling” in the Grant category, we have decided to take the responsibility of issuing recommendations on it, while defining if proposals like these also oriented to education/content can be approached in another way with the current committees or not.  4. About the proposal valuation    Added value (good to bad): good. Education in Web3 and access to tools is currently a recurring problem on which it is easy to fall into the wrong methodology and ethos. Bankless has a reputable track record of addressing all of these topics on behalf of the community. The use of mintkudos is understood as a plus that the Optimism ecosystem may be interested in trying and taking note of.  Impact or expected usage (high to low): high. this aspect can have an unlimited impact, or better said, not directly tied to the grant - being an educational initiative, it reaches a range of interested parties that are not included in the average of the proposals that are normally addressed - This project is of use for free and with almost zero entry barrier (prior knowledge). Its impact is clearly dependent on how many users it can reach and high expertise, managing high attendance.  Current Status [Development stage/Open Source?] (early to ready): in development. The project is open source and free; some content specific to Optimism will be built or improved in the process.  Expenditure plan and distribution (appropriate to inappropriate): appropriate. The incentive must be where the value is, and in this case the value is in the construction and future development, such as contributors. A portion will go to the community treasury, which means that ~13,200 tokens will be independently managed by this initiative.  Amount requested (high to low): medium. Amount requested seems reasonable for the team members in the stipulated period.   5. KPIs and impact tracking As detailed in the proposal, a series of activities are contemplated that we will be happy to find out when they take place, please communicate in time with focus to the Optimism community any event that has been possible thanks to the approval of this proposal. In details, we ask Bankless Academy responsibles to provide statistics on at least the following aspects:  How many users started at least one of the materials releated to Optimism How many users finished the different modules Attendance at scheduled events Relevant experiences in the process, proof-of-personhood, use of mintkudos and others relevant to Optimism and its ecosystem.   6. FINAL RECOMMENDATION: Yes ",
                    "links": [
                        "https://gov.optimism.io/t/gfx-labs-delegate-communication-thread/2728/16",
                        "https://gov.optimism.io/t/tooling-committee-season-2-recommendations/3551/2"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.926607538802661
                },
                {
                    "author_link": "https://gov.optimism.io/u/Butterbum",
                    "index": "40",
                    "likes": "2",
                    "time": "25/09/2022-16:13:19",
                    "content": "I have voted against this proposal and the recommendation. My reason for voting against is the allocation of simply providing a team with working capital. I agree with others in echoing this proposal is better suited for RPGF. I refer to…    Grant Proposal Template   driving sustainable usage and engagement on Optimism (rather than simply providing teams with working capital or voting power).   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/arabianhorses",
                    "index": "41",
                    "likes": "2",
                    "time": "26/09/2022-12:25:39",
                    "content": "I have no problem with the proposal, I think Bankless deserves much more on the other hand as @OPUser mentioned this should be counted in the RPGF. However, Gov Update #4 says we can evaluate RPGF as the token house so I considered and my vote FOR    Governance Update #4   The Token House is welcome to consider any and all proposals which would drive growth or address a gap in the Optimism ecosystem, including public goods projects.   I believe that this 30 thousand dollars will be more efficient for the Ecosystem when we compare it with most of the projects that we have funded ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.8125
                },
                {
                    "author_link": "https://gov.optimism.io/u/katie",
                    "index": "42",
                    "likes": "2",
                    "time": "26/09/2022-20:36:01",
                    "content": "Voted yes - following Tooling Committee recommendation ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "43",
                    "likes": "2",
                    "time": "26/09/2022-21:19:48",
                    "content": "Votes yes as per our own committee’s recommendation. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Bobbay_StableLab",
                    "index": "44",
                    "likes": "3",
                    "time": "27/09/2022-11:56:43",
                    "content": "Vote: Yes Rationale: It is a minimal request for a project with extensive reach and helps educate web3 newbies. Ideally, this would go under RGPF but, Bankless Academy have a strong track record and this request helps support the greater ecosystem. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.733333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/Tjark",
                    "index": "45",
                    "likes": "2",
                    "time": "28/09/2022-11:06:53",
                    "content": "The PoolCollective voted yes, following the Tooling committee’s recommendation. Education hyper-structures ftw! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "46",
                    "likes": "0",
                    "time": "29/09/2022-19:11:03",
                    "content": "Snapshot vote - passed ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "47",
                    "likes": "0",
                    "time": "29/09/2022-19:11:08",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "48",
                    "likes": "0",
                    "time": "30/09/2022-21:24:41",
                    "content": "@Tetranome can you provide a Telegram handle or other contact method so the Optimism team can get in touch about paying out this grant! Feel free to comment on this thread, DM, or email palash@optimism.io ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.609375
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "49",
                    "likes": "1",
                    "time": "05/01/2023-19:26:12",
                    "content": "Hi @Tetranome! It’s been a few months since your OP grant distribution, checking in to see if there is a grant update you could share with the community? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "50",
                    "likes": "0",
                    "time": "08/01/2023-12:23:52",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Tetranome",
                    "index": "51",
                    "likes": "4",
                    "time": "10/01/2023-11:10:40",
                    "content": "Hello @lavande & Optimism community   Here is a progress update and release timeline for the Layer 2 Blockchains lesson @ Bankless Academy: We launched the precursor lesson, Layer 1 Blockchains, in early December.  twitter.com    Bankless Academy 👩‍🚀 🚀 @BanklessAcademy  🚨 NEW MISSION ALERT 🚨  Layer 1 Blockchains 1️⃣ is now LIVE! 🚀  Explorers, it's time to embark on a new adventure 💫  Be the first to learn, test your knowledge, and claim the Layer 1 Blockchains Academy Badge on-chain 🛡️  Get ready for takeoff! 👨‍🚀 🆙 👩‍🚀 app.banklessacademy.com/lessons/layer-…   12:22 PM - 14 Dec 2022           36                18            We completed the User Research component of the build the week before Christmas, where we partnered with Layer 2 educator Patrick McCorry to run our small-class learning sessions. These sessions hosted 17 frequent Academy users, and allowed our content team to understand how our users handle the learning of Layer 2 concepts.  twitter.com    Bankless Academy 👩‍🚀 🚀 @BanklessAcademy  This week, we're hosting our Level Up Live Learning Sessions for Layer 2 Blockchains - supported by @optimismFND 🔴  As Subject Matter Expert, we have Instructor @stonecoldpat0 and from the Academy Squad @iSpeak_Nerd 👨‍🏫  as Content Lead.  Let's learn more 🧵 https://t.co/MPjDIV084E   3:41 PM - 21 Dec 2022           11                8            These sessions showed us that we were missing content in the Academy user journey around funding Layer 2 wallets for users who aren’t established on Centralised Exchanges. We’ve launched a new micro-lesson format (Mirror articles embedded in the Academy app) to allow us to swiftly plug user journey gaps like this one. In this case, the first article focuses on three ways to fund a wallet on Layer 2 (using Optimism as the example). By including this in the user journey as prerequisite content (rather than inside the L2 lesson), we can maintain the L2 lesson focus on tech, benefits, and the Optimism ecosystem without having to dilute with explanations of wallet/funding UX.  twitter.com    Bankless Academy 👩‍🚀 🚀 @BanklessAcademy  Introducing THE EXPLORER'S HANDBOOK 📘 🧑‍🚀  A series of collectible articles to serve your #Bankless journey on the go.  First up: How to Fund a Wallet on Layer 2 🔴  LEARN, EXPLORE, COLLECT 🚀  ↓ app.banklessacademy.com/lessons/how-to… https://t.co/QfKkz7cQWR   4:00 PM - 28 Dec 2022           35                10            The Layer 2 lesson is now in the first pass of writing review, where our team is ensuring that the topics, sub-topics, examples and order of presentation our writers have delivered match up with constructive illustration progression, the quest planned by our dev, and the overall Academy user journey. After this review is complete, the writers will perform edits, and the content will be passed to the illustrators. Quest development and marketing preparations begin next week - @lavande I’m interested to know if there is availability for social media support by the Optimism Collective to boost engagement on launch? This will result in more people completing the Optimism onboarding quest and collecting their Academy soulbound badge. Speaking of, we just passed 2100 badges minted since our badge launch in October (reminder: these badges are protected by Gitcoin Passport, meaning they’re highly sybil resistant). We’re very happy to be receiving so much app activity during a bear market - it will be interesting to monitor these figures as we release more content and hit the next bull market and as various ecosystems build out utility for these badges   image1666×752 25.7 KB  We’re currently projecting the lesson release and launch campaign for the first week of February. Thank you for your patience with the build process. We’re excited to release this lesson - the last entry to our essentials curriculum - and get Academy user exploring the Ethereum Layer 2 ecosystem early next month! PS: We’re also looking for a tech/culture expert @ Optimism to review the lesson content in the coming weeks. Does anyone have a recommendation/interest themselves? @katie @mastermojo @polynya ",
                    "links": [
                        "https://twitter.com/BanklessAcademy/status/1603002475174248448",
                        "https://twitter.com/BanklessAcademy/status/1603002475174248448",
                        "https://app.banklessacademy.com/lessons/layer-1-blockchains",
                        "https://twitter.com/BanklessAcademy/status/1603002475174248448",
                        "https://twitter.com/stonecoldpat0",
                        "https://twitter.com/BanklessAcademy/status/1605589312690565120",
                        "https://twitter.com/BanklessAcademy/status/1605589312690565120",
                        "https://twitter.com/BanklessAcademy/status/1605589312690565120",
                        "https://twitter.com/optimismFND",
                        "https://twitter.com/stonecoldpat0",
                        "https://twitter.com/iSpeak_Nerd",
                        "https://t.co/MPjDIV084E",
                        "https://twitter.com/BanklessAcademy/status/1605589312690565120",
                        "https://twitter.com/BanklessAcademy/status/1608130739689902080",
                        "https://twitter.com/BanklessAcademy/status/1608130739689902080",
                        "https://twitter.com/BanklessAcademy/status/1608130739689902080",
                        "https://twitter.com/search?q=%23Bankless",
                        "https://app.banklessacademy.com/lessons/how-to-fund-a-wallet-on-layer-2?utm_source=banklessacademy&utm_medium=twitter&utm_campaign=l2articlelaunch",
                        "https://t.co/QfKkz7cQWR",
                        "https://twitter.com/BanklessAcademy/status/1608130739689902080",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/a/a8c21e01c8d5dec47f81692547de56c819de0a67.png"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.823939393939393
                },
                {
                    "author_link": "https://gov.optimism.io/u/mastermojo",
                    "index": "52",
                    "likes": "1",
                    "time": "10/01/2023-14:46:25",
                    "content": "Thanks for the update Tetranome! I am sure someone from the Optimism team can help with the lesson content, but you can also include Optimism Delegates to help with that as well if the team is tied up. Feel free to hit me up in DMs along with some of the other delegates, and we can help with any issues. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.28125
                },
                {
                    "author_link": "https://gov.optimism.io/u/simocach",
                    "index": "53",
                    "likes": "1",
                    "time": "10/01/2023-16:05:19",
                    "content": "I love this proposal and you’ll have my full support. I’m part of banklessDAO ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.125
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "54",
                    "likes": "2",
                    "time": "11/01/2023-22:18:15",
                    "content": "I think this could be a great integration into Atestation @smartcontracts what do you think? I’m also tagging @Matt he’s a wonderful host to promote these things, he helped us so much with EthernautDAO. If you ever need anything let me know @Tetranome always happy to support BanklesDAO ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/markyhabs",
                    "index": "55",
                    "likes": "2",
                    "time": "13/01/2023-06:22:35",
                    "content": "me too cant wait . lots of great gems here ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/letmehear",
                    "index": "56",
                    "likes": "0",
                    "time": "13/01/2023-11:04:39",
                    "content": "IF I delegate my OP to another wallet and this wallet vote, can I get snapshot ? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/valosh",
                    "index": "57",
                    "likes": "0",
                    "time": "15/01/2023-12:05:03",
                    "content": "I’ve just discovered Bankless and it looks brilliant. Im a little bit late but the team has all my support. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6875
                },
                {
                    "author_link": "https://gov.optimism.io/u/italo.a",
                    "index": "58",
                    "likes": "0",
                    "time": "15/01/2023-12:22:22",
                    "content": "Great Iniciative! Congratulations for this idea. Bankless is fantastic ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/Floyd11",
                    "index": "59",
                    "likes": "1",
                    "time": "16/01/2023-12:42:31",
                    "content": "Thank you for including me in the discussion about Layer 2s in 2021, Bankless. I fully agree with the approach of using Optimism (OP) to fund internal development instead of directly incentivizing users with tokens at this point. Could you please provide more information about the direct benefits of Optimism that you listed? For example, what topics will be covered in a specific OP lesson and will users have the opportunity to interact with OP applications or just learn about them through screen-based instruction? Additionally, can you explain how the Bankless-native onboarding process will work as a whole and what the user will be introduced to in the OP ecosystem at the end of that process? Lastly, will the marketing strategy be Bankless-native and focus on promoting specific OP lessons and knowledge? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5625
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gonna.eth",
                    "index": "60",
                    "likes": "1",
                    "time": "16/01/2023-15:33:02",
                    "content": "you can follow the Bankless proposal progress here:     [READY][GF: Phase 1 Proposal] Bankless Academy v2 Governance Fund: Phase 1       Hello @lavande & Optimism community   Here is a progress update and release timeline for the Layer 2 Blockchains lesson @ Bankless Academy:  We launched the precursor lesson, Layer 1 Blockchains, in early December.   We completed the User Research component of the build the week before Christmas, where we partnered with Layer 2 educator Patrick McCorry to run our small-class learning sessions. These sessions hosted 17 frequent Academy users, and allowed our content team to …     ",
                    "links": [
                        "https://twitter.com/stonecoldpat0"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.083333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/FractalVisions",
                    "index": "61",
                    "likes": "1",
                    "time": "17/01/2023-15:56:10",
                    "content": "Very cool!!! The Bankless crew are all over the OP space. We hired on a developer from Bankless to help us build on OP recently. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.2216796875
                },
                {
                    "author_link": "https://gov.optimism.io/u/mppi2002",
                    "index": "62",
                    "likes": "1",
                    "time": "18/01/2023-02:24:45",
                    "content": "dlfwjfkl nsd,mnf,ms nfdsgnjlsdkgn d,.sng,. dgs dfgfdg dfg ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Salmanzb",
                    "index": "63",
                    "likes": "1",
                    "time": "18/01/2023-06:44:12",
                    "content": "I love this proposal and you’ll have my full support ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.125
                },
                {
                    "author_link": "https://gov.optimism.io/u/Tetranome",
                    "index": "64",
                    "likes": "5",
                    "time": "15/02/2023-16:06:07",
                    "content": "Hello Optimism community… I am pleased to announce our release date for the lesson. The lesson will be published on February 22nd (next Wednesday) and we will begin the launch campaign. With that said, we’re launching the community beta… today! Both the Bankless Academy community and the Optimism community are welcomed to test the lesson early to provide comments, feedback, and to collect their badge.    app.banklessacademy.com    Layer 2 Blockchains | Bankless Academy Join the Layer 2 ecosystem to boost your transaction speed & reduce fees.      You’ll find a “comment” button on each slide, as well as a feedback form at the end of the lesson. A lot of work went into this lesson, with a great deal of meticulous detailing. Our team can’t wait to hear what you think. We’ve also launched a sister article with this lesson, acting as the quest walkthrough. This entry in our “Explorer’s Handbook” provides three pathways to funding an L2 wallet on Optimism. Explorers can collect the entry on mirror.xyz (on Optimism!).   app.banklessacademy.com    How to Fund a Wallet on Layer 2 | Bankless Academy Learn how to fund your wallet on L2 via CEXs, third-party onramps, and bridges.      ",
                    "links": [
                        "https://app.banklessacademy.com/lessons/layer-2-blockchains",
                        "https://app.banklessacademy.com/lessons/how-to-fund-a-wallet-on-layer-2",
                        "https://app.banklessacademy.com/lessons/how-to-fund-a-wallet-on-layer-2"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.4
                },
                {
                    "author_link": "https://gov.optimism.io/u/FractalVisions",
                    "index": "65",
                    "likes": "3",
                    "time": "15/02/2023-16:47:07",
                    "content": "Excellent!!! Get those people education and scaling in no time … ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Tetranome",
                    "index": "66",
                    "likes": "2",
                    "time": "16/02/2023-14:00:53",
                    "content": "Can’t wait to get more Bankless Explorers navigating L2s  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/Tetranome",
                    "index": "67",
                    "likes": "1",
                    "time": "21/02/2023-13:58:37",
                    "content": "Thanks to everyone who partook in our Community Beta review! We will be launching the lesson tomorrow  If you completed the lesson and filled out the feedback form, there is a special Academy Badge  waiting for you to claim it here:   mintkudos.xyz    🎉 Bankless Academy Community Feedback Thank you, Explorer, for participating in our Lesson Creation process. You are an eligible holder of this badge for participating in our Level Up Live Learning Sessions and/or sharing feedback during our Community Beta Release.  Thank you for...      ",
                    "links": [
                        "https://mintkudos.xyz/claim/e2884502-ba55-46bc-8233-6be850d2a213"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.429383116883116
                },
                {
                    "author_link": "https://gov.optimism.io/u/Tetranome",
                    "index": "68",
                    "likes": "1",
                    "time": "22/02/2023-15:15:41",
                    "content": "Hi everyone, today marks the launch of our “Layer 2s” lesson, sponsored by Optimism, at Bankless Academy. I want to give a huge thank you to the OP community for backing us and choosing to fund lesson production. We hope you like what we’ve built. Prepare to onboard more Bankless Explorers to Optimism!      twitter.com    Bankless Academy 👩‍🚀 🚀 @BanklessAcademy  Bankless Explorers, a new lesson awaits on the horizon, alongside your next badge. We've joined forces with @optimismFND & @stonecoldpat0 to navigate:  🔁 Payment Channels 🌉 Bridges ⛓ Sidechains 📜 Optimistic Rollups ⚡ ZK Rollups 💿 EVM Equivalence 🔴✨ Starting on Optimism 👇 https://t.co/FKcdNx6mjs   3:00 PM - 22 Feb 2023           5                2            Complete the lesson and collect your proof-of-knowledge badge, here:   app.banklessacademy.com    Layer 2 Blockchains | Bankless Academy Join the Layer 2 ecosystem to boost your transaction speed & reduce fees.      ",
                    "links": [
                        "https://twitter.com/BanklessAcademy/status/1628409302133374979",
                        "https://twitter.com/BanklessAcademy/status/1628409302133374979",
                        "https://twitter.com/optimismFND",
                        "https://twitter.com/stonecoldpat0",
                        "https://t.co/FKcdNx6mjs",
                        "https://twitter.com/BanklessAcademy/status/1628409302133374979",
                        "https://app.banklessacademy.com/lessons/layer-2-blockchains",
                        "https://app.banklessacademy.com/lessons/layer-2-blockchains"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.051136363636363
                }
            ]
        }
    ],
    "group_index": "218"
}