{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/gf-phase-0-proposal-rubicon/794",
            "title": "[GF: Phase 0 Proposal] Rubicon ",
            "index": 794,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Governance Fund: Phase 0"
            ],
            "tags": [
                "cycle-1",
                "passed"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/forrest",
                    "index": "1",
                    "likes": "33",
                    "time": "23/05/2022-21:06:01",
                    "content": "Project Name: Rubicon Author Name: Forrest Defillama TVL (at snapshot): $1.1 million Transactions/day (at snapshot): 504 Tier: 3 Optimism native: Yes Revisions to metrics used: N/A Number of OP tokens to claim: 900,000 L2 Recipient Address: 0x3204AC6F848e05557c6c7876E09059882e07962F Proposal for token distribution (under 1000 words): To kickstart $OP Summer, Rubicon plans to use this $OP allocation to incentivize liquidity providers, reward early users with an airdrop, and begin a Rubicon Grants Program for developers building on Optimism! How will the OP tokens be distributed? Liquidity Provider Rewards  60% (540,000 $OP) will be sent to the BathBuddy contract to begin a Rubicon $OP Liquidity Mining program. Rewards will vest to liquidity providers based on their proportional share of the pool. We used our historical trading volumes and total value locked (TVL) to determine tiers of $OP rewards for the pools, and figured $OP deserved to be in the top tier:  Rubicon Grants Program  15% (135,000 $OP) will remain at the listed address for the creation of a Rubicon Grants Program! The Rubicon Grants Program will reward individuals and teams who build on and contribute to the protocol. Contributing can take many forms, whether it be through code, content, research, translations, memes, or something else! Contributors can apply to the Rubicon Grants Program by submitting a form outlining goals and deliverables for their project, or grants can also be issued retroactively to someone who contributes to Rubicon but never applied for one. To learn more about the Rubicon Grants Program, join our Discord! There we will announce the starting date of the first round of grants and share the Grant Application form. $OP Liquidity Pool  10% (90,000 $OP) will be used to seed the $OP liquidity pool on Rubicon. This will ensure depth and liquidity on $OP order books for OP Summer and beyond. We would love to hear what trading pairs the community wants to see with $OP! Airdrop to Rubicon Users  15% (135,000 $OP) will be airdropped to early Rubicon users. Since our launch on Optimism, more than 10,000 unique wallet addresses have traded or provided liquidity on the protocol! In November 2021, some of our liquidity pools were vampire attacked and LPs lost funds. The majority of this airdrop will go to liquidity providers who were affected by this event. The rest will go to Rubicon traders, with a bonus for those who used the protocol before the OVM 2.0 network upgrade. Additionally, we plan to follow Hop’s precedent and filter out as many Sybil attackers as possible. We want genuine Rubicon users to receive this $OP drop, not bots. How will this distribution incentivize usage and liquidity on Optimism? This proposal directly incentivizes liquidity on Optimism for (W)ETH, USDC, DAI, USDT, and WBTC, which we consider to be essential tokens for any DeFi ecosystem. It also incentivizes SNX liquidity, with Synthetix being the first protocol to launch on Optimism and the largest by TVL. And last, but certainly not least, this proposal incentivizes $OP liquidity, through both rewards for $OP liquidity providers and a commitment of 10% of Rubicon’s allocation to order book liquidity for the $OP token. How do these liquidity incentives translate into Optimism usage? More liquidity → More trades → More transactions Rubicon uses order books; to reflect price changes on other trading venues, traders send transactions to place and cancel outstanding orders on the book. While these transactions are relatively cheap (cheaper than an AMM swap), active markets lead to a lot of them! Even during periods that we would consider to be relatively low usage, Rubicon was among the top protocols on Optimism by transactions per day. With liquidity incentives, our Rubicon v1 protocol upgrade, and a significant overhaul of our market-making system, we are confident that Rubicon will be a leader in increasing Optimism’s transactions per day. That means more ETH for public goods! Why will the incentivized users and liquidity remain after incentives dry up? Through the Grants Program, even after incentives run out there will be novel, Optimism-native, DeFi projects on the Rubicon order books! There will always be mercenary capital that tries to take advantage of incentive programs. We have taken some steps to penalize this “farm and dump” behavior on Rubicon:  $OP rewards for liquidity providers in Rubicon Pools can only be claimed upon withdrawing from the pool Both $OP rewards and the underlying pool token have a small (0.03%) withdrawal fee that is paid back to the pool. This penalizes those who try to actively hop in and out of the pools to realize rewards, and rewards those who remain in the pool for a longer duration  After rewards run out, Rubicon will have shown new users a trading experience and liquidity mechanism that is simply not possible on Ethereum mainnet. In particular, we think users will stick around for:  Truly on-chain limit orders (no reliance on off-chain keepers) Passive liquidity pools with the yields of actively managed liquidity Composable order book LP tokens (bathTokens)  Over what period of time will the tokens be distributed? The $OP rewards for Rubicon liquidity providers will last 6.9 months (209.875 days). The Rubicon Grants Program will budget with a target of distributing all $OP grants by the end of the 2022 calendar year. The $OP Airdrop to early Rubicon users will happen in June! How much will your project match in co-incentives? Rubicon does not have a token and we are not currently positioned to match with co-incentives. ",
                    "links": [
                        "https://twitter.com/WhinfreyChris/status/1525178626563420160",
                        "https://gov.optimism.io/t/voting-cycle-1-roundup/2619",
                        "https://gov.optimism.io/t/gf-phase-1-proposal-rubicon/5068/4",
                        "https://gov.optimism.io/t/gf-phase-1-proposal-rubicon/5068/6",
                        "https://gov.optimism.io/t/goverance-fund-accountability-an-overview/3591",
                        "https://gov.optimism.io/t/gf-phase-1-proposal-rubicon/5068"
                    ],
                    "GPT-summary": "The post is a proposal for the Rubicon project, which plans to use $OP allocation to incentivize liquidity providers, reward early users with an airdrop, and begin a Rubicon Grants Program for developers building on Optimism. The proposal explains how the OP tokens will be distributed and how it will incentivize usage and liquidity on Optimism. The post also answers questions about the distribution period and co-incentives, and invites collaboration through the Rubicon Grants Program. The post could benefit from constructive criticism and may prompt questions from third parties.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Token economics",
                        "Interoperability and Scaleability",
                        "Smart contract updates"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.875501336898395
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "2",
                    "likes": "3",
                    "time": "24/05/2022-07:42:48",
                    "content": "    forrest:  Rubicon plans to use this $OP allocation to incentivize liquidity providers, reward early users with an airdrop, and begin a Rubicon Grants Program for developers building on Optimism!   liquidity providers,users and grant program. excellent move.     forrest:  ubicon users to receive this $OP drop, not bots.   Thank you for doing this.     forrest:  community wants to see with $OP   ETH and USDC, please. Excellent proposal. Kudos to the team. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.90625
                },
                {
                    "author_link": "https://gov.optimism.io/u/ginpaang",
                    "index": "3",
                    "likes": "4",
                    "time": "24/05/2022-17:24:23",
                    "content": "I want to say that early-stage users have suffered some losses due to some problems. If only 15% of the quota is allocated to early-stage users, should this proportion be increased? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.6875
                },
                {
                    "author_link": "https://gov.optimism.io/u/forrest",
                    "index": "4",
                    "likes": "3",
                    "time": "24/05/2022-17:38:30",
                    "content": "Fair question. The majority of this airdrop will go to early liquidity providers who lost funds in the November vampire attack. We are happy that we can compensate early LPs for some of their losses, but liquidity rewards and a grants program are more effective uses of the OP because they incentivize the growth of both Rubicon and Optimism. Lastly, I can say that this airdrop is not the only compensation that early Rubicon liquidity providers will receive. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.611111111111111
                },
                {
                    "author_link": "https://gov.optimism.io/u/moeinbtc",
                    "index": "5",
                    "likes": "0",
                    "time": "24/05/2022-17:39:16",
                    "content": "    forrest:  snapshot   how wwe could see the eligibile addressees ? is there any link or list to see that ? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/forrest",
                    "index": "6",
                    "likes": "3",
                    "time": "24/05/2022-17:42:59",
                    "content": "We have a snapshot of early (pre-OVM 2.0) Rubicon traders and liquidity providers here. We will release the final list of all eligible addresses once our team is done filtering Sybil attackers  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/unknown",
                    "index": "7",
                    "likes": "1",
                    "time": "24/05/2022-23:38:37",
                    "content": "Hi, thank you for detailed proposal but I think 15% is so low for guys who trade daily in Rubby. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.666666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/brucewang614",
                    "index": "8",
                    "likes": "1",
                    "time": "25/05/2022-01:39:42",
                    "content": "Agree to increase to compensation of losses , it is fair ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/Kipto",
                    "index": "9",
                    "likes": "0",
                    "time": "25/05/2022-19:45:54",
                    "content": "Hi thanks also here for the detailed proposal but I also think the 15% for early users is really low and vague when the “majority of this airdrop will go to early liquidity providers who lost funds in the November vampire attack”. I would appreciate more precision/details here. Additionally the way I read your incentivization for new users is similar to what Lyra has done with $LYRA yet you plan to do it with $OP only.  Why will the incentivized users and liquidity remain after incentives dry up?  I believe the current shape of the grants program via discord is not currently in such a shape to suggest that novel things will replace $OP only incentives.  After rewards run out, Rubicon will have shown new users a trading experience and liquidity mechanism that is simply not possible on Ethereum mainnet. In particular, we think users will stick around for:  As you already had 10,000 unique wallets a long time ago. Current users are probably much fewer? Why not convince these early users to come back as well by focusing on these more. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.478693181818182
                },
                {
                    "author_link": "https://gov.optimism.io/u/0xWeston",
                    "index": "10",
                    "likes": "1",
                    "time": "26/05/2022-04:51:28",
                    "content": "This seems like a well thought out and smart proposal IMO. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.071428571428571
                },
                {
                    "author_link": "https://gov.optimism.io/u/Iris",
                    "index": "11",
                    "likes": "0",
                    "time": "27/05/2022-09:17:20",
                    "content": "good, I will be waiting… irisliang#0864 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/Justin",
                    "index": "12",
                    "likes": "0",
                    "time": "31/05/2022-04:44:39",
                    "content": "Balanced proposal and it’s good to ease the sting of loss from the vampire attack.  I support this. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/0xjason42069",
                    "index": "13",
                    "likes": "0",
                    "time": "02/06/2022-18:44:57",
                    "content": "I support everything said in this post ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/neekolas",
                    "index": "14",
                    "likes": "0",
                    "time": "08/06/2022-02:30:38",
                    "content": "Compensating victims is a generous proposal, thank you. I vote yes! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/sonya2015",
                    "index": "15",
                    "likes": "0",
                    "time": "09/06/2022-23:21:32",
                    "content": "user on the early state who found a lot of problem .if everything fair .exactly that good… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/vcomdo",
                    "index": "16",
                    "likes": "0",
                    "time": "10/06/2022-00:03:09",
                    "content": "This sounds like a good proposal!!! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Teno",
                    "index": "17",
                    "likes": "0",
                    "time": "11/06/2022-04:42:06",
                    "content": "I consider this proposal to be super interesting, it will help us to interact and obtain more knowledge about this new Optimism network and to be able to carry out certain operations and transactions through protocols such as Rubicon, which helps us provide liquidity to the pools and also, in turn, obtain benefits. for the same. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.364989177489178
                },
                {
                    "author_link": "https://gov.optimism.io/u/bbehnam86",
                    "index": "18",
                    "likes": "0",
                    "time": "01/07/2022-18:19:52",
                    "content": "Great Thank you it’s great ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/eynno",
                    "index": "19",
                    "likes": "0",
                    "time": "15/07/2022-01:09:06",
                    "content": "    forrest:  Rubicon   Solid proposal. Excited to see Rubicon finance growing as a project. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9375
                },
                {
                    "author_link": "https://gov.optimism.io/u/forrest",
                    "index": "20",
                    "likes": "1",
                    "time": "15/07/2022-19:11:26",
                    "content": "Hi all, update from Rubicon: Today we started the Liquidity Rewards program (540,000 OP over 6.9 months) We made the 90,000 OP deposit into our OP liquidity pool Up next: OP Airdrop (135,000 OP) - we are still filtering sybil attackers so real Rubicon users get the most OP possible, we will share an update next week Rubicon Grants Program (135,000 OP) - will launch next week! ",
                    "links": [
                        "https://optimistic.etherscan.io/tx/0xf728064b12a8c74a25b147b0ca0352af1bbf6e011d75ff535b1463d9d5827013"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.583333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "21",
                    "likes": "1",
                    "time": "15/07/2022-22:32:26",
                    "content": "    forrest:  we are still filtering sybil attackers so real Rubicon users get the most OP possible   Thank you for doing this. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.166666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/forrest",
                    "index": "22",
                    "likes": "0",
                    "time": "23/08/2022-17:25:19",
                    "content": "Another Rubicon update: Today our 135,000 OP airdrop to early traders and liquidity providers went live! Rubicon Liquidity Rewards (580,000 OP) were the first OP rewards live on the entire network and led to a massive increase in liquidity and trading volume Our Grants Program (135,000 OP) is actively rewarding contributors to Rubicon and the greater Optimism ecosystem And 90,000 OP went into the bathOP pool to serve as a reliable liquidity backstop This means Rubicon’s OP is now fully allocated! We will update this post with Grant milestones and halfway through the Liquidity Rewards program with some more stats! ",
                    "links": [
                        "https://www.notion.so/rubicondefi/Rubicon-Grants-Program-da930600be094e3eb8ae98dba89d93d6"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.337121212121212
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "23",
                    "likes": "1",
                    "time": "23/08/2022-17:42:58",
                    "content": "Thank you for keeping us all in the loop with incentives distribution. Wish others would do the same. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "24",
                    "likes": "0",
                    "time": "13/09/2022-18:27:30",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "637"
}