{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/gysr-growth-experiment-cycle-11/5626",
            "title": "GYSR - Growth Experiment - Cycle 11 ",
            "index": 5626,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Grants Council"
            ],
            "tags": [
                "growth",
                "cycle-11"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/jebbathehut",
                    "index": "1",
                    "likes": "5",
                    "time": "14/03/2023-19:09:07",
                    "content": "Basic Details Project name: GYSR Author name and contact info (please provide a reliable point of contact for the project.): Devin Conley (Twitter: @ devinaconley), Alex Jebb (@ jebbathehut) L2 recipient address: Optimism multisig wallet: 0x462cc7EA60a364410FeF8c621b73a1f1c78De513 Which Voting Cycle are you applying for?: Cycle 11 I confirm that I have read the landing pages for the Builders 25 and Growth Experiments 24 Sub-Committees and that I have determined my proposal is best suited to be reviewed by the Growth Experiments Sub-Committee: Yes I understand that Growth Experiments grants are subject to a “no sale rule,” as explained in this post and I have read the terms of the rule: Yes Project Details What are you building?: Incentivized membership programs on Optimism Why do you believe what you are building is going to succeed?: GYSR has already had some experience driving adoption on Optimism using incentives, and our upcoming v3 deployment includes a module for multi-rewards. This new module will allow projects to stream both OP and a token(s) of their choice as the rewards for staking in their pool, creating even closer alignment between projects and end users within the Optimism ecosystem. Projects will be able to use the multi-reward module for both ERC20 and ERC721 staking solutions, helping to grow the NFT presence on Optimism. This will help Optimism attract projects to the Optimism network, help projects attract users without needing to offer as much collateral as they otherwise would need to, and help users learn and experience the benefits of engaging with projects on Optimism. How many users does your project have currently? Please include how you arrived at this estimate: ~6k based on subgraph data How will receiving a grant enable you to further the mission of maximizing the number of users interacting with Optimism? Please include a step-by-step flow of how you imagine this grant can lead to a greater number of user interactions with Optimism: Utilizing the Growth Experiment grant to incentivize use of our new multi-reward module will attract both projects and users to GYSR on Optimism. We will be able to incentivize projects to deploy pools on Optimism by shifting some of the reward burden from exclusively the funding project to this grant. The new module will also ensure that we can distribute certain proportions of this grant back to OP end users if desired, as opposed to sending all of the incentive amount to the project separately. GYSR’s goal is to help make Optimism an easy choice for developers and communities to deploy new projects or expand their current ecosystem beyond Mainnet. To accomplish this, we need to ensure that the communities surrounding these projects have the correct incentives and confidence to move to Optimism to take advantage of the scaling infrastructure and ecosystem tools. Further, we want to encourage projects to use GYSR in order to accelerate development speed, improve safety and security, and stay focused on their core tech. We’d like to use the allocation in two ways:  Provide deployment bonus incentives on top of GYSR Pools deployed on Optimism Incentivize migration of projects in the GYSR ecosystem from our other supported networks to Optimism  Tell us about the users you plan to target with this grant. Include any defining characteristics that will help you identify and target them.: For the deployment incentives - any and all Optimism projects! Since GYSR is a no-code launch platform, we do not need to exclude any types of Optimism projects. We can support any project that needs to facilitate on-chain incentives. Additionally, we will leverage our existing relationships with partners such as Layer2DAO to publicize the grant and assist with introductions and engagements. For the migration incentive, we will target existing projects in the GYSR ecosystem who have deployed on Mainnet or Polygon. How would these users interact with Optimism? For how long?: The duration and flow rate of incentive rewards is configurable for each pool. We generally see pool durations in increments of 30 days, 90 days, or more, and the ability to extend and add additional funding to pools is seamless. Moreover, our new bond sale mechanism can be used to provide more permanent liquidity provision. We can work with Optimism and the individual projects to set rules for engagement. Provide us with links to any of the following for the project:  Demo:  v2 demo: www…youtube.com/watch?v=dCNlTnqCm-M NFT staking: www…youtube.com/watch?v=JKyq5Zgz7kU   Website: www…gysr.io/ Twitter: www…twitter.com/gysr_io Discord/Discourse/Community: www…discord.gg/74SnuTM8 Github: www…github.com/gysr-io/ Technical/Economic Documentation: www…docs.gysr.io/  Do you have any metrics on the project currently? (TVL, transactions, volume, unique addresses, etc. Optimism metrics preferred; please link to public sources such as Dune Analytics, etc.): GYSR has seen a spike in Optimism activity over the past several months, largely due to a smaller grant from Layer2DAO and our co-incentives program, and we expect the expansion on this incentives program to have a similar effect to continue this upward trajectory. Some overall metrics include:  Project TVL: $3M (down from high ~$50M) Transactions: To date, GYSR has handled over $1.5B in transactions and $26M in rewards across all networks (mainnet, polygon, optimism) Users: ~6k overall, 225 on Optimism (up from just 13 Optimism users in December 2022) Reference:  www…thegraph.com/hosted-service/subgraph/gysr-io/gysr www…thegraph.com/hosted-service/subgraph/gysr-io/gysr-polygon www…thegraph.com/hosted-service/subgraph/gysr-io/gysr-optimism    Who are your competitors, and are they on Optimism?: xTokenTerminal - yes, they are on Optimism but limited functionality. Please link to code audits (if any): www…docs.gysr.io/resources/safety Team Who are your founders?: Devin Conley, Alex Koren What makes your team well-suited to carry out the project described in this proposal? Strong experience in web3 development, partnerships, and overall execution when it comes to helping projects with the tooling they need. Is this your first Web3 project?: No If not, what else have you built? (Share links, Github repository, or any other useful information.): The GYSR team has built and deployed v1 and v2 of the GYSR platform, with v3 coming soon.  Github: www…github.com/gysr-io/ Technical/Economic Documentation: www…docs.gysr.io/ Application: www…app.gysr.io/  Grant Request What is the size of the grant request? (250k OP max): 75k OP How do you justify the size of the grant?: GYSR has seen a spike in Optimism activity over the past several months, largely due to a smaller grant from Layer2DAO and our co-incentives program, and we expect a grant from Optimism to have a similar effect to continue this upward trajectory. In terms of a rough order of magnitude (ROM) calculation for potential impact, we can give a lower bound on rewards here based on the qualifying criteria (see below) for distributions:  worst case scenario: assume each qualifying project only hits the bare minimum of 50k USD in funded rewards 75,000 OP / 5,000 OP per project = 15 projects overall lower bound: 15 * 50,000 = 750,000 USD (non OP) rewards adding the OP incentive: 750,000 + 2.80 * 75,000 = 960,000 USD rewards  Then we can estimate increase in staking value tied to those rewards  attractive staking APRs usually sit between 10% and 200% (depending on LP, single asset, risk, etc) - let’s call it 80% assume an average funding schedule of 90 days define apr = (rewards / staked) * (365 / period) then staked = rewards * (365 / period) / apr staked = 960,000 * (365 / 90) / 0.80 ~= 4,866,000 USD  This would bring the estimated value to a total of 5.6M USD, or a ~25x return on grant size. Roadmap and Distribution Plan Describe in discrete steps how you will successfully implement your grant plan:  Advertise co-incentive program - through both our channels (Twitter, Discord, TG, etc.) and partner channels (e.g. Layer2DAO) Targeted outreach to specific GYSR projects on Mainnet or Polygon Work with projects to set up multi-rewards module and funding with their token of choice and our OP  How will the OP tokens be distributed? (please include % allocated to different initiatives such as user rewards/marketing/liquidity mining. Please also include a justification as to why each of these initiatives align with the problem statement this proposal is solving. Distribution should not include the sale of any tokens by the grantee or the use of tokens for compensation, protocol expenses, etc. See the no sale rule): GYSR’s goal is to help make Optimism an easy choice for developers and communities to deploy new projects or expand their current ecosystem beyond Mainnet. To accomplish this, we need to ensure that the communities surrounding these projects have the correct incentives and confidence to move to Optimism to take advantage of the scaling infrastructure and ecosystem tools. Further, we want to encourage projects to use GYSR in order to accelerate development speed, improve safety and security, and stay focused on their core tech. We will distribute the two co-incentive path as follows:  45,000 OP to set up co-incentives for 3rd party Pools deployed on GYSR (on Optimism)   5,000 OP per project funding over 50k USD in rewards locked 10,000 OP per project funding over 200K USD in rewards locked   30,000 OP to set up co-incentives for project migration to Optimism over a year   5,000 OP per project funding over 50K USD in rewards locked, with existing pool on GYSR mainnet or Polygon  Over what period of time will the tokens be distributed for each initiative?: Each project will have a specific timeline that works best for them for distribution, which is why we have opted for total rewards funded as the key metric for providing co-incentives. However, we usually see projects opt for ~90 days of funding for the initial launch of their pool, with additional funding supplied later to extend the pool. Additionally, if we suspect projects may be acting in bad faith, then we can apply a minimum bound for funding timeline when we work with them to provide the co-incentives. Please provide benchmark milestones for this project. These milestones should guide the Optimism community on the progress of your project throughout your work on the project. Do not use distribution of the grant itself as a milestone: We aim to double the number of projects and users we have on Optimism within 6mo of grant receipt. Please define critical milestones for this project. Critical milestones are meant to show good-faith efforts to accomplish the project. Non-completion of these milestones could lead to revocation of remaining grant rewards. Do not use distribution of the grant itself as a milestone: Month 6: Reach 200k USD in project funded rewards by bringing new projects onto Optimism and migrating existing projects on Mainnet/Polygon to Optimism  To be documented/verified for the Grants Council Documentation to include breakdown of new projects vs migrated projects Team wallets are excluded from rewards and qualifying for metrics Note: we expect the full distribution of the rewards to stretch past the 6mo milestone, as it depends on projects achieving qualifying criteria  If the OP tokens are for direct distribution to users, why will incentivized users and liquidity on Optimism remain after incentives dry up?: The incentives we’ve described are only augmentations to the GYSR Pools that are created. Come for the OP and incentives, stay for the projects that you engage with along the way. GYSR is a hub for many projects to provide their distributions but also users who come to GYSR use it as a source of discovery. Landing on the platform means connecting with projects you know and finding new ones to engage with as they launch which is not dependent on the OP being provided temporarily. Please provide any additional information that will facilitate accountability (smart contracts addresses relevant to the proposal, relevant organizational wallet addresses, etc.): Optimism multisig wallet: 0x462cc7EA60a364410FeF8c621b73a1f1c78De513  For every incentive distributed, we will provide on-chain documentation of:   Funding transaction by project that qualified for award Funding transaction by GYSR team adding additional OP rewards   For every incentive distributed, we will provide on-chain documentation of:   Original GYSR pool on another network Funding transaction by project that qualified for award Funding transaction by GYSR team adding additional OP rewards  Optimism Relationship Does your project solve a problem for the Optimism ecosystem? If so how?: GYSR is designed to make liquidity mining and other on-chain incentives extremely easy to set up. By offering side-by-side rewards and incentives on Optimism, it will encourage users to move their assets to Optimism for better return rates. Since GYSR acts as an add-on for many projects, this means that people coming to GYSR are not only leveraging the GYSR platform - they’re interacting with DEXs, liquidity protocols, and more. That means users having breadth of usage on Optimism, not just on a single dapp. Why will this solution be a source of growth for the Optimism ecosystem?: GYSR is designed to make liquidity mining and other on-chain incentives extremely easy to set up. By offering side-by-side rewards and incentives on Optimism, it will encourage users to move their assets to Optimism for better return rates. Since GYSR acts as an add-on for many projects, this means that people coming to GYSR are not only leveraging the GYSR platform - they’re interacting with DEXs, liquidity protocols, and more. That means users having breadth of usage on Optimism, not just on a single dapp. Is your project Optimism Native?: GYSR is multi-chain, and supports Optimism native projects. Confirmations ****I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: Yes I understand that I will be expected to following the public grant reporting requirements outlined: Yes ",
                    "links": [
                        "https://twitter.com/gysr_io/status/1611408990566498321"
                    ],
                    "GPT-summary": "The post is a proposal for a grant from the Optimism Foundation for the GYSR project. The proposal explains the project's plan to incentivize membership programs on Optimism and attract projects and users to the platform. The post includes details on the project's current metrics, team, and roadmap. The post may receive constructive criticism or questions from third parties, and the author is seeking collaboration with Optimism to further their mission.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Interoperability and Scaleability",
                        "Smart contract updates",
                        "Community and engagement",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.522316002029985
                },
                {
                    "author_link": "https://gov.optimism.io/u/michaelmcquaidbloq",
                    "index": "2",
                    "likes": "3",
                    "time": "14/03/2023-22:41:32",
                    "content": "We worked closely with the team at GYSR in late 2020 and early 2021 when launching Vesper Finance. Great team.  Great tech.  We would definitely work with them again.  Looking forward to seeing them on Optimism ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving entirely positive feedback on proposal"
                    ],
                    "Sentiment": 6.4
                },
                {
                    "author_link": "https://gov.optimism.io/u/GFXlabs",
                    "index": "3",
                    "likes": "1",
                    "time": "15/03/2023-17:14:44",
                    "content": "Thank you for submitting this grant application! Throughout the application process, this forum thread will be one of the official means of communication. Please be sure to monitor it for updates over the course of the review period. At this stage, applications are mainly being reviewed for completeness, and nothing at this stage should be construed as support or opposition by any members of the Grants Council.     jebbathehut:  Please define critical milestones for this project. Critical milestones are meant to show good-faith efforts to accomplish the project. Non-completion of these milestones could lead to revocation of remaining grant rewards. Do not use distribution of the grant itself as a milestone: Month 6: Reach 250k USD in project funded rewards by bringing new projects onto Optimism and migrating existing projects on Mainnet/Polygon to Optimism Month 12: Reach 500k USD in project funded rewards by bringing new projects onto Optimism and migrating existing projects on Mainnet/Polygon to Optimism   As a general rule, we recommend grant plans extend no more than six months into the future, if only because the market value of OP is volatile. This is not a hard and fast rule, however, and applicants are free to disregard if they feel their plan has a compelling reason to be longer. Because critical milestones must be met to unlock successive tranches of any approved grant, we recommend making them as clear and unambiguous as possible. An example might be, “Reach 250k USD in project-funded rewards within six months of the receipt of the grant. Documentation will be provided to the Grants Council to easily verify when this milestone is completed. This documentation will include, to the extent available, what portion are new projects and which migrated from another chain.” We also recommend a statement somewhere in the grant plan that explicitly states team wallets will be excluded from both key metrics and any rewards. Further guidance on milestones can be found here: Milestone Assessment  Thank you, and GFX Labs or other Grants Council members will follow up here with any further questions throughout the process. Do not hesitate to ask questions here (tagging whichever Council Member a question is for, or @GrantsOps generally, will increase the speed of response). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.555984848484848
                },
                {
                    "author_link": "https://gov.optimism.io/u/jebbathehut",
                    "index": "4",
                    "likes": "1",
                    "time": "17/03/2023-01:11:33",
                    "content": "Thanks for the feedback @GFXlabs - agreed on clarifying the milestone to include documentation and the (very important) disclaimer about no team wallets! We just tweaked the critical milestone section to incorporate your feedback. Please let us know if you have any other thoughts or questions on the proposal! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.8671875
                }
            ]
        }
    ],
    "group_index": "617"
}