{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/i-want-to-discuss-project-boosting-their-delegate-power-with-governance-fund/2961",
            "title": "I want to discuss project boosting their delegate power with governance fund ",
            "index": 2961,
            "category": [
                "\\xf0\\x9f\\x8f\\x9b Governance",
                "Grants"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "1",
                    "likes": "29",
                    "time": "12/07/2022-14:37:23",
                    "content": "This is not a proposal or even an idea for something. I want to hear your opinion on project(s) using token allocated to their project to boost their delegate voting power. In GF Phase 0, top three project got 21M OP(9 + 9 + 3) token and if they choose to delegate those token to themselves, it will lead to centralization in DAO which will hurt us all and might cause bias in DAO which is even bigger problem. Maximum number of voting we have seen so far was in GF Phase 0 when we saw 20M votes.  image771×178 14.9 KB  Imagine 2 delegate holding voting power of 18M which can guide any voting decision in their direction. My opinion:-  They should use the token for distribution plan mentioned in their proposal. All delegate must follow the same process, create the profile and users would choose anyone they want. At least give them a chance ? I know it will be diluted slowly but it will take a year and I think, its enough amount of time to do the damage of early stage gov such as ours.  I am not against on person holding too much power, that’s a different discussion, I am questioning the approach. Better or ideal approach would be distributing the token as they seems fit as per their proposal plan and once its diluted, users will get a chance to choose their delegate. At least give us, a retail user,  a chance. What is your view on this ? Why this thought and discussion? because of this uptick I saw on Dune.  image1850×677 61.9 KB  Now, from my last experience, this is not directly towards anyone and please avoid name calling. ",
                    "links": [
                        "https://gov.optimism.io/t/can-delegates-become-too-powerful/2919/4",
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/2X/1/1d81352fe9252367eb838750a260224eaf9034d9.png",
                        "https://gov.optimism.io/t/voting-cycle-3-roundup/2923/13",
                        "https://gov.optimism.io/t/can-delegates-become-too-powerful/2919/10",
                        "https://gov.optimism.io/t/voting-power-grant-proposal/4197",
                        "https://gov.optimism.io/t/opuser-delegate-communication-thread/2777/8",
                        "https://gov.optimism.io/t/draft-so2-committee-proposal-defi-group-c/3320",
                        "https://gov.optimism.io/t/grant-proposal-template-v2/3233/13",
                        "https://gov.optimism.io/t/governance-weekly-recap/3352/4",
                        "https://gov.optimism.io/t/another-case-of-self-delegation-of-op-tokens-received-in-grants/3372"
                    ],
                    "GPT-summary": "The author is seeking feedback on the idea of projects using tokens allocated to them to boost their delegate voting power, which could lead to centralization and bias in the DAO. The author suggests that the tokens should be used for a distribution plan mentioned in their proposal, and all delegates should follow the same process. The author is not against one person holding too much power, but questions the approach. The post includes a chart showing an uptick in Dune.",
                    "GPT-proposal-categories": [
                        "Token economics",
                        "Governance and resource allocation",
                        "Privacy, Security and risk management",
                        "Law and regulations",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party or author wants to collaborate on proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.514705882352942
                },
                {
                    "author_link": "https://gov.optimism.io/u/Defi_LATAM_axlvaz",
                    "index": "2",
                    "likes": "8",
                    "time": "12/07/2022-14:56:42",
                    "content": "I think this approach is consistent. I think it is something we need to discuss. No project should use grants to increase its voting power. In my opinion we are allocating a lot of tokens without seeing the results yet. I mean we don’t know if the protocols are going to use it correctly, we should see the impact of all the voting processes and follow up. It is not about being agile and assigning tokens deliberately, this could bring a negative impact to governance. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.171875
                },
                {
                    "author_link": "https://gov.optimism.io/u/Netrim",
                    "index": "3",
                    "likes": "10",
                    "time": "12/07/2022-15:16:30",
                    "content": "Approach wise this is a very real possibility. The biggest issue I can see about this is how able we will be to monitor their usage. I know on chain metrics but it’s perfectly possible for them to simply take the backlash and still keep on voting. Ideally, token distribution should haven been vested as part of the proposals. This would help with the dilution. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.966666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/SEED_LATAM_Joxes",
                    "index": "4",
                    "likes": "5",
                    "time": "12/07/2022-23:52:00",
                    "content": "This is an interesting situation (and this case serves as an early example, don’t get me wrong) to take into account when OP governance approves allocation of funds for projects. In the worst case scenario, the project can simply lie and take tokens and ‘maliciously’ affect future decisions. As always, distribution is key (there is no a perfect way), but for example, delegates have been careful with proposals soliciting ‘excessive’ amounts during phase 1, encouraging projects to divide their goal into different proposals/stages (sometimes  semms like a sort of primitive KPI options) instead of a single-step-to-long-term proposal. And these cases can be interpreted in different ways, since this action (by example) wasn’t in the Token Plan, and it would be good if the project clarified this recent action. If any project expresses its desire to participate in some way it should not be misunderstood, Optimism is a protocol of protocols, and therefore we expect the participation of protocol teams, companies, DAOs, protocol communities, independent communities, organizations and individuals. However, transparency in the use of OP tokens is a must. Vested mechanism as proposed by @Netrim is worth considering (although it is not a good fit for many initiatives), in fact other networks have applied these mechanisms before, I will review their results and come back here. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.028409090909091
                },
                {
                    "author_link": "https://gov.optimism.io/u/tongnk",
                    "index": "5",
                    "likes": "6",
                    "time": "13/07/2022-01:39:36",
                    "content": "Thanks for bringing this up - I didn’t realise it was controversial but have a couple of thoughts. Firstly, we’re heavily invested in the future of OP given we are not deploying multi-chain and have gone all in on OP. With this we’d like to see OP tokens utilised to grow the entire chain and ecosystem. We see the success of Perp tied to the success of OP. We’d like to be able to maintain our voice going forward, especially given that over time this voice will decrease as we distribute tokens for the growth of OP. Given that other projects from Phase 1 will soon receive their tokens this is going to happen across the board. I’m of the opinion that giving protocols who are OP native a voice is actually a good thing. Restricting these tokens and their usage creates a two fold problem:  Monitoring and enforcement is extremely hard and it’s extremely easy for bad actors to bypass this You’re creating a second class of tokens and effectively signalling that OP projects should not participate in governance  If it’s a major concern we are happy to abstain from future votes until Phase 1 distributions to projects are completed. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.844791666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/Netrim",
                    "index": "7",
                    "likes": "6",
                    "time": "13/07/2022-02:07:08",
                    "content": "The issue at hand is simple, if the purpose was governance then your whole Phase 0 proposal is a lie. If the purpose was NOT governance then you need to abide for the Phase 0 proposal que get back on track. If you wanted to actively participate on Optimism governance, go ahead. Buy OP on the open market or persuade other people to delegate to Perp. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.951388888888889
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "8",
                    "likes": "4",
                    "time": "13/07/2022-02:38:27",
                    "content": " we’re heavily invested in the future of OP given we are not deploying multi-chain and have gone all in on OP  Yes, and I thank you for that and you also get heavy reward for that so its win-win situation.  With this we’d like to see OP tokens utilised to grow the entire chain and ecosystem.  Believe me you when I say this, I am not involved with OP and any project on OP what so ever and still investing my time and energy here, you know why,its because I want to see the success of OP too, so we are on the same page here.  We’d like to be able to maintain our voice going forward  Sure, I want that too but I am questioning your approach. You are a delegate like me and others here so you must follow the same approach, users will decide where they want to put their faith, if they choose you I am fine with that but at least give them a chance. You got those token not because you were able to create the traction for your project alone,is it ? All those TVL and addresses belongs to small users like me and not giving us a fair chance to raise our voice is wrong. I have just 140K votes assigned to me, do I have a place to raise my voice with that, Yes. Word you are looking for is “dominance”, you want to maintain your dominance in DAO gov and you choose the different approach, short one and wrong one.  Monitoring and enforcement is extremely hard and it’s extremely easy for bad actors to bypass this  Yes, this might happen but if you dilute the token first as per your proposal plan, there are chance that we will hear more than 1 person voice. Other users might delegate to themselves or they will choose someone else. I would like to see more participation and more decentralized voting power, top 1% dominating the DAO will lead us to three steps back, decision will be biased and it will lead to lack of motivation and confidence in DAO gov.  You’re creating a second class of tokens and effectively signalling that OP projects should not participate in governance  I never said that and that is/will never be my motivation, you are a delegate which means you have a voice in the DAO, I know for fact that other OP protects are also part of Delegates and on top of that, anyone can create a profile and advertise to get the voting power. Why should we give your special route ? That is my concern.  If it’s a major concern we are happy to abstain from future votes until Phase 1 distributions to projects are completed.  I guess, my main concern is not clear yet, I am fine if you hold 20M or even 100M voting power, once that happen I will look for another DAO to waste my time and energy. Concern is your approach, dilute the token first as per your distributions plan and let user decide where they want to put their faith or buy the token from open market. That is my concern, abstaining will not fix this. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.632298752834467
                },
                {
                    "author_link": "https://gov.optimism.io/u/Defi_LATAM_axlvaz",
                    "index": "9",
                    "likes": "2",
                    "time": "13/07/2022-03:01:19",
                    "content": "When they submitted their proposal in phase 0, they didn’t mention this direction they just took. Do you imagine that all the phase winners would apply the same strategy? I find it dishonest that they are doing what they are doing, in a way we are all betting on OP’s success.     [GF: Phase 0 Proposal] Perpetual Protocol Governance Fund: Phase 0       Project Name: Perpetual Protocol  Author Name: Nick  Defillama TVL (at snapshot): $31,274,396  Transactons/day (at snapshot): 21,301  Tier: 1  Optimism native: Yes  Revisions to metrics used: N/A  Number of OP tokens to claim: 9,000,000  L2 Recipient Address:  0xDcf664d0f76E99eaA2DBD569474d0E75dC899FCD  Proposal for token distribution (under 1000 words):   Background Perpetual Protocol is a leading decentralised perpetual swap protocol that has facilitated over 40 billion in un-incentivised trad…     ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/polynya",
                    "index": "10",
                    "likes": "7",
                    "time": "13/07/2022-03:54:20",
                    "content": "Should be part of the proposal, where they are required to disclose if they plan to use their OP in governance, or to state that they will not. Delegates can decide accordingly. In general, I agree using OP granted for governance is a de-facto governance attack, unless there’s a good reason to do so. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://gov.optimism.io/u/tongnk",
                    "index": "11",
                    "likes": "6",
                    "time": "13/07/2022-04:23:21",
                    "content": "For the sake of not escalating this issue further and focusing on the rest of the proposals, we will revoke the delegation ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Justin",
                    "index": "12",
                    "likes": "4",
                    "time": "13/07/2022-05:25:18",
                    "content": "They should absolutely spend the tokens pursuant to their proposal.  The primary purpose of Phase 0 is to stimulate usage and liquidity, not to hold in the treasury.  As you point out, a related issue is the centralization of power of delegates and this is another reason why there should be a check on delegate power as i suggested in my post. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Justin",
                    "index": "13",
                    "likes": "2",
                    "time": "13/07/2022-05:28:29",
                    "content": "    tongnk:  We’d like to be able to maintain our voice going forward   Is that goal consistent with the spirit and purpose of Phase 0?  I’ve read everything that i can find but do not see any evidence that token accumulation for purposes of maintaining voting power is beneficial to the Optimism community.  Have you seen any evidence of that and if so, can you link to that in this thread? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://gov.optimism.io/u/Defi_LATAM_axlvaz",
                    "index": "14",
                    "likes": "2",
                    "time": "13/07/2022-11:53:26",
                    "content": "You have made the right decision! This is the best thing for the Optimism ecosystem. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.392857142857142
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "15",
                    "likes": "2",
                    "time": "13/07/2022-12:09:42",
                    "content": "Thank you for your understanding. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Netrim",
                    "index": "16",
                    "likes": "3",
                    "time": "13/07/2022-12:31:22",
                    "content": "Thank for making this decision ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/optimist",
                    "index": "17",
                    "likes": "2",
                    "time": "13/07/2022-13:36:47",
                    "content": "    polynya:  Should be part of the proposal, where they are required to disclose if they plan to use their OP in governance, or to state that they will not. Delegates can decide accordingly.   +1, during this early stage of governance it seems critical that projects be transparent about this simply because a single grant is can currently be a huge power shift, as we’re seeing in this instance.     tongnk:  For the sake of not escalating this issue further and focusing on the rest of the proposals, we will revoke the delegation   I think this is the right decision for now, but I don’t think this means that projects should not be able to delegate OP in the future. As I said, I think it makes the most sense if part of the proposal template for OP grants includes a section that says something along the lines of “Do you waive your right to delegate the OP that you receive as part of this grant?”. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.909090909090909
                },
                {
                    "author_link": "https://gov.optimism.io/u/gabagool",
                    "index": "18",
                    "likes": "1",
                    "time": "14/07/2022-14:06:05",
                    "content": "While centralization is certainly an issue, another issue is stagnation. Most users delegated OP upon receiving their airdrops. It is unlikely that there will be another large scale delegation event without further retail distro (airdrop #2) that requires delegation, or an individual/project running a large-scale campaign to gain voting power. If $OP is a governance token, and grants are a key distribution method for that token, it seems illogical to me that that distribution would come with stipulation for how that voting power can be delegated. Further, $OP tokens have already been distributed, so this will not be an effective strategy. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.642857142857142
                },
                {
                    "author_link": "https://gov.optimism.io/u/Netrim",
                    "index": "19",
                    "likes": "3",
                    "time": "14/07/2022-16:52:30",
                    "content": "The issue is simpler, the original proposal did NOT include any governance allocation, ergo it’s underhanded to use it for such purpose ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9375
                },
                {
                    "author_link": "https://gov.optimism.io/u/katie",
                    "index": "20",
                    "likes": "4",
                    "time": "14/07/2022-19:22:23",
                    "content": "Well intentioned or not, this is not a good look.  It should be outlined explicitly in the the proposal if there are plans to use allocated tokens for governance.  I appreciate the tokens being undelegated in this case. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 3.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "21",
                    "likes": "2",
                    "time": "14/07/2022-19:35:11",
                    "content": "So governance tokens should only conditionally be used for governance? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/katie",
                    "index": "22",
                    "likes": "4",
                    "time": "14/07/2022-19:43:47",
                    "content": "No, these tokens were allocated via a governance fund and using the tokens for governance was not specified in the token plan of the proposal, see below.  If tokens are going to be used for governance, this should be specified in the proposal.  Distribution Token holders have recently passed the new tokenomics proposal which outlines two programs that can support these goals:   Liquidity Acquisition: are incentives for lenders to lend any type of collateral to the Market Making Entity  Liquidity Mining: are incentives for market makers to ensure deep liquidity and the best experience for traders  Builder Acquisition: we will extend our current grants program and further incentivise builders to build on top of Perp and utilise Perp as a base layer  Our plan is to have these tokens allocated towards three type programs. One key thing to note is that given our history of experimentation, we may scale incentives up or down depending on the outcomes of each program. Our goal is to ensure that we don’t overspend and that we maximize the impact of these tokens.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.34040404040404
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "23",
                    "likes": "2",
                    "time": "14/07/2022-19:44:25",
                    "content": "okay so there are different classes of OP tokens, only some of which have governance rights? i mean one way or another you’re saying that under some conditions an owner of a governance token can’t exercise those rights ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.234375
                },
                {
                    "author_link": "https://gov.optimism.io/u/katie",
                    "index": "24",
                    "likes": "3",
                    "time": "14/07/2022-19:50:26",
                    "content": "Tokens acquired via the governance fund are done so via a proposal which outlines the plan for those tokens very explicitly, then voted on accordingly.  If using the allocated tokens for governance is not outlined explicitly in the proposal then no, those tokens should not be used for governance as that was not part of the voted on proposal.  Do you disagree? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "25",
                    "likes": "1",
                    "time": "14/07/2022-19:51:03",
                    "content": "that’s a well-considered, precise way of saying that governance tokens are only conditionally so ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "26",
                    "likes": "1",
                    "time": "14/07/2022-19:53:15",
                    "content": "i’m more than sympathetic to the desire not to concentrate power i think it’s important to understand what the implication of what you’re outlining is, though, because whatever these protocols are getting, it’s not the same thing as what i have when i do get to vote. either that or my OP is not what i thought it was. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/katie",
                    "index": "27",
                    "likes": "1",
                    "time": "14/07/2022-19:56:25",
                    "content": "But you’re not obtaining your tokens through a governance proposal, that’s the difference.  Every proposal is conditional based on what they are actually proposing, that’s the nature of a DAO.  I appreciate the discussion  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/gabagool",
                    "index": "28",
                    "likes": "1",
                    "time": "15/07/2022-01:01:30",
                    "content": "the method of obtaining the tokens seems completely arbitrary? If Optimism wants to control how grant tokens are delegated, this is something that would need to be solved at the token/contract level - right? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.642857142857142
                },
                {
                    "author_link": "https://gov.optimism.io/u/gabagool",
                    "index": "29",
                    "likes": "1",
                    "time": "15/07/2022-01:04:59",
                    "content": "its underhanded to want to use tokens that have been freely granted to a project, to participate in governance? While I can see the potential for a negative impact from grants being delegated, would you feel the same way if teams delegated to existing delegates? How will new delegates be introduced - at size - if grant tokens are not delegated? Let’s say a team does this, would you exclude them from future grants? While it is true, proposals have not addressed delegation - neither has OP foundation or delegates themselves prior to this, recent discussion which is coming after funds have already been distributed. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.325757575757576
                },
                {
                    "author_link": "https://gov.optimism.io/u/gabagool",
                    "index": "30",
                    "likes": "1",
                    "time": "15/07/2022-01:08:21",
                    "content": "it is ridiculous to accuse some one of “lying” for using a token for its intended purpose, even if those tokens are also being used for other purposes! $OP is a governance token, simple as. Any holder should, and ideally WILL, be participating in governance. My suggestion would not be to accuse an existing partner - who is making a good faith  effort to discuss this issue, and seems well aware of the thorny nature of this - but rather to develop a standard that can be applied proactively, in the future: Any new grant must articulate plans for delegation. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.8315446127946124
                },
                {
                    "author_link": "https://gov.optimism.io/u/Netrim",
                    "index": "31",
                    "likes": "3",
                    "time": "15/07/2022-01:08:33",
                    "content": "Again, the proposal had no mention of delegation. And yes I would not in favor of them delegating 9M tokens, since their proposal never indicated directly or indirectly they were going to use the tokens for delegation. How will new delegates be introduced? same as it happened the first time around with the added benefit that protocols CAN select to have a reserve for such case, they just need to be upfront about it. Which is why some of us have created this nice thread that now includes updates to the template Update of the PHASE 1 protocol nomination template As for the accusation of lying, I will paste the merriam-webster link and let you take your own conclusions of a very straightforward definition. Lie Definition & Meaning - Merriam-Webster Note verb (2), second entry: to create a false or misleading impression ",
                    "links": [
                        "https://www.merriam-webster.com/dictionary/lie"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.886931818181818
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "32",
                    "likes": "0",
                    "time": "15/07/2022-01:14:35",
                    "content": "Ultimately i think the responsibility rests on the Collective to recognize that it has limited means to enforce limits on delegation. The most it can do is restrict further grants to these organizations, and frankly it should begin to budget the diffusion of voting rights to grantees into its decision-making. As an aside–it’s not necessarily a bad thing; member protocols are legitimate stakeholders! Though concentration in general can naturally be problematic for its own reasons, and of course that’s why we have a bicameral governance structure in the first place, to mitigate many of these concerns. Let’s say that Perp said, you know what, a governance token is just that – it is our right to exercise our governance power, and it was our presumption that we get it (not a lie if you take the right as given; i.e., it was not a thing you felt you had to disclose). They get 9mm votes in a governance structure where the average passing proposal gets 15-20mm yes votes. What do you do now? Do you fork Optimism? Blacklist the wallet? Print more tokens? Who do you deal them to? If you do any of these things, I now know that my governance token isn’t quite that, that there are conditions. And that has long-lasting effects. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.174107142857142
                },
                {
                    "author_link": "https://gov.optimism.io/u/SEED_LATAM_Joxes",
                    "index": "33",
                    "likes": "4",
                    "time": "15/07/2022-02:26:24",
                    "content": "Please everyone stay in topic, this is about projects giving an unstipulated use for received tokens (acording to a Token Plan/Distribution proposed by themselves), in this case, self-delegation and obviously talking about possible negative impact. Is OP a governance token? Yes. Can protocols or any organization participate? Yes. Can a protocol take OP tokens and give it a different use than thoses detailed in its proposal (by example, arbitrarily a self delegation >this topic<? No. Obviously anyone can say that they have ownership (objectively) but they shouldn’t, and we’re here to discuss and point this out. Suggestions to minimize this risk? it’s welcome, properly in a new thread. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.468181818181819
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "34",
                    "likes": "1",
                    "time": "15/07/2022-04:26:30",
                    "content": "    SEED_LATAM_Joxes:  Can a protocol take OP tokens and give it a different use than thoses detailed in its proposal (by example, arbitrarily a self delegation >this topic<? No. Obviously anyone can say that they have ownership (objectively) but they shouldn’t, and we’re here to discuss and point this out.   If you’re directing this at me and others, we have been sharing our concerns precisely because you have no grounds on which to pronounce conclusively that protocols can’t self delegate tokens. Nowhere in the rules prior to these applications or disbursements was there any mention of concerns regarding self-delegation. Governance hasn’t definitively ruled one way or another. OPUser raised the legitimate issue a few days ago, a handful of people stated that protocols shouldn’t self-delegate, and now a handful of people are disagreeing. When if not now would we come to consensus on this? You can personally believe that people shouldn’t make claims to ownership, but you certainly can’t close the book on the matter or dismiss our concerns as not relevant to the issue. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.233766233766234
                },
                {
                    "author_link": "https://gov.optimism.io/u/Prometheus",
                    "index": "35",
                    "likes": "3",
                    "time": "15/07/2022-12:28:58",
                    "content": "    jackanorak:  Nowhere in the rules prior to these applications or disbursements was there any mention of concerns regarding self-delegation.   Because the assumption is that projects use their tokens for precisely what they said they would (if they don’t mention governance then we assume they will not use it for governance). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "36",
                    "likes": "1",
                    "time": "15/07/2022-12:44:50",
                    "content": "There’s no basis for this assumption, though. I read and catalogued every single governance proposal through cycle 2 of phase 1. In my recollection there wasn’t a single request to use tokens for governance. So either this assumption wasn’t shared by any of the applicants, or projects are sending a strong signal regarding the value of governance power on Optimism. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.484126984126984
                },
                {
                    "author_link": "https://gov.optimism.io/u/SEED_LATAM_Joxes",
                    "index": "37",
                    "likes": "1",
                    "time": "15/07/2022-13:13:28",
                    "content": "    jackanorak:  I read and catalogued every single governance proposal through cycle 2 of phase 1. In my recollection there wasn’t a single request to use tokens for governance. So either this assumption wasn’t shared by any of the applicants, or projects are sending a strong signal regarding the value of governance power on Optimism.   That’s not completely true, see the first draft of Marker Proposal where they pointed (see date also):  As the incentives to scale Ethereum are aligned between MakerDAO and Optimism, it’ll be a great deal for both communities to save a % (up to Optimism’s governance) so that the Maker governance gains voting power in the governance decisions.  And this topic was duly discussed (authors removed it after an initial feedback but perfectly if it had been maintained and approved by others there would be no problem). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.3534226190476195
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "38",
                    "likes": "2",
                    "time": "15/07/2022-13:51:20",
                    "content": "Hey there, appreciate the context. Hope you can understand how I would have missed this, as it was no longer in the proposal.  Their assumptions weren’t really clear here. I actually read this as them asking OP to delegate some of their held tokens (i.e., not granted tokens in addition to their own) to Maker as a good steward of governance. This doesn’t presume that they wouldn’t have self-delegated their granted OP. If they were in fact asking to self-delegate, that would be the one case where someone had considered the possibility that the granted OP had conditions attached.  image715×472 69.7 KB  They respectfully backed off entirely when you individually made the claim above – which, I’d add, would appear to make this the first mention of such a standard. Their response suggests to me that these standards are conditional (i.e., specifically defined by each community) and not universally given. Although I’d certainly invite @Facundo to weigh in here.  And this topic was duly discussed (authors removed it after an initial feedback but perfectly if it had been maintained and approved by others there would be no problem).  Sorry, what do you mean by “if it had been maintained and approved by others”? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.750525210084033
                },
                {
                    "author_link": "https://gov.optimism.io/u/SEED_LATAM_Joxes",
                    "index": "39",
                    "likes": "2",
                    "time": "15/07/2022-14:13:13",
                    "content": "    jackanorak:  I actually read this as them asking OP to delegate some of their held tokens (i.e., not granted tokens in addition to their own)   Yes, this was part of this section “How will the OP tokens be distributed?”.     jackanorak:  (i.e., specifically defined by each community) and not universally given.   Yes, each community gives its point of view, but again, the first step to be correctly executed is to announce it in the proposal as part of the token plan.     jackanorak:  Sorry, what do you mean by “if it had been maintained and approved by others”?   Yes I mean, if this draft would have been kept as it is and any member of the community with 0.005% of the voting power would approve its pass to ready. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.541666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "40",
                    "likes": "0",
                    "time": "15/07/2022-14:28:03",
                    "content": "Ok don’t hate me but your position is inconsistent then. In that post above, you say that it’s impossible for Maker to ask for governance rights because then others would do the same, and this distribution (again, your words, nobody else has said this) is solely to incentivize layer and protocol use. You tell Maker they’re not even allowed to ask. And now here you’re saying if only they’d asked for it and gotten approval it’d be fine? This strikes me as unilateral rule making. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.34375
                },
                {
                    "author_link": "https://gov.optimism.io/u/SEED_LATAM_Joxes",
                    "index": "41",
                    "likes": "1",
                    "time": "15/07/2022-14:34:21",
                    "content": "    jackanorak:  In that post above, you say that it’s impossible for Maker   Sorry, not sure where I (Joxes) said that. on the contrary:     SEED_LATAM_Joxes:  And these cases can be interpreted in different ways, since this action (by example) wasn’t in the Token Plan, and it would be good if the project clarified this recent action. If any project expresses its desire to participate in some way it should not be misunderstood, Optimism is a protocol of protocols, and therefore we expect the participation of protocol teams, companies, DAOs, protocol communities, independent communities, organizations and individuals.   Before you ask, I’m obviously concerned that the plans will not be carried out as proposed.     SEED_LATAM_Joxes:  In the worst case scenario, the project can simply lie and take tokens and ‘maliciously’ affect future decisions.   An then the reasons given later by others I agree with them (about this case particulary). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.4944444444444445
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "42",
                    "likes": "0",
                    "time": "15/07/2022-14:44:37",
                    "content": "Apologies, on phone, but this says it pretty clearly  image1170×205 63 KB  OP only for funding usage. This not for funding usage. We can’t approve this because then other people would ask for it. No mention of this being an actual possibility, more stating authoritatively that it just can’t be done. “We can’t have protocols asking for governance power.” I think you misrepresented the standards to Maker. I’m sure that wasn’t your intention, but your position was inconsistent with what you’re saying now. This sort of confusion is why these standards needed to be spelled out in advance if people now are going to presume they exist. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.953125
                },
                {
                    "author_link": "https://gov.optimism.io/u/SEED_LATAM_Joxes",
                    "index": "43",
                    "likes": "2",
                    "time": "15/07/2022-14:47:37",
                    "content": "I see now, this is from @Defi_LATAM_axlvaz (we as a community encourage our members and collaborators to participate, there may be different points of view) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "44",
                    "likes": "1",
                    "time": "15/07/2022-14:48:10",
                    "content": "Crap. Apologies. I just read the prefixes. In any case, this was a unilateral misreprentation, and the overall point holds; calls to prevent granted tokens from exercising governance rights have been arbitrary and not rooted in any universally held assumptions or precedent ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 3.5999999999999996
                },
                {
                    "author_link": "https://gov.optimism.io/u/Defi_LATAM_axlvaz",
                    "index": "45",
                    "likes": "2",
                    "time": "15/07/2022-19:07:12",
                    "content": "After reading the entire thread on this topic, I will try to answer some questions and points of view: 1- First of all I clarify that I am not a delegate, nor a member of the Optimism Foundation. I am an active member of this government and of the DefiLatam and OptimismESP community (no - official). 2- As any member of this government as a participant in it, I give my personal opinion on the proposals of PHASE 0,1 … Any other member may agree or disagree with my opinions, which does not mean that mine are law. Any member can give his opinion. 3- The proposals receive the feedback from the delegates and the government members. So anyone can defend any particular point, the final decision is always taken in Snapshot. Having clarified these points, I will go to what we are discussing: 1- In the case we have been discussing, to my understanding it is simple, the protocol receives 9M OP voted by this government with the promise it made during its postulation, says one thing (proposal) and does another. I think at this point almost all of us agree that it is not ethically correct. This particular case may lead to all winning proposals doing the same thing with OP tokens, this ends up hurting governance and the ecosystem. This may even incite protocols to make of the tokens whatever they want and not respect their original plan published in this governance. 2- Can protocols include in their proposals to allocate a % of the OP tokens received to governance? Yes they can and surely more protocols will do so. Now, from my point of view it is not correct because if they want to have participation in the governance they should acquire tokens in the secondary market and delegate them to a candidate of theirs. If it is implicit to assign part of the PO token to their delegate and the reasons are approved by the governance in voting it seems to me appropriate since that is what governance is for, just as you can not approve and reject any proposal that has this kind of objective. 3- The protocols can have delegates in the governance, even there are already delegates that represent some protocols. I don’t see it bad at all, they can even ask to be delegated or have their treasuries buy OP tokens and delegate the taken ones to them to have more participation in this governance. In conclusion, these are my opinions and I will always want the best for this governance. In the future I may change my mind if there is a better proposal regarding self-delegated tokens received by the governance. At the end of the day these proposals may be approved in a vote, but that is a decision made by the collective as a whole. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.81125
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "46",
                    "likes": "2",
                    "time": "15/07/2022-19:25:26",
                    "content": " 1- In the case we have been discussing, to my understanding it is simple, the protocol receives 9M OP voted by this government with the promise it made during its postulation, says one thing (proposal) and does another. I think at this point almost all of us agree that it is not ethically correct.  That this statement is incorrect is the point I’ve been shouting into the void: this is based on a flawed premise, that everyone understands that governance tokens aren’t always for governance. It is highly likely that several protocols omitted any mention of governance power because they assumed that their tokens would carry it. Otherwise you would have seen many more proposals ask for it, not 0 or maybe 1. So yes, it’s flatly incorrect that we “all agree” omitting mention of governance usage is unethical (for instance, of the ~10 people who have weighed in here, at least Gabagool and I disagree), and it’s highly problematic that a handful of forum participants think they can definitively claim without precedent or consensus that protocols already granted OP under a set of different assumptions now aren’t entitled to the full use of OP tokens.  2- Can protocols include in their proposals to allocate a % of the OP tokens received to governance? Yes they can and surely more protocols will do so. Now, from my point of view it is not correct because if they want to have participation in the governance they should acquire tokens in the secondary market and delegate them to a candidate of theirs. If it is implicit to assign part of the PO token to their delegate and the reasons are approved by the governance in voting it seems to me appropriate since that is what governance is for, just as you can not approve and reject any proposal that has this kind of objective.  Okay, phew. Now that I know it was you who was responsible for the quote above, I can comfortably say that your position is inconsistent because what you outlined to Maker was the incorrect presumption that they in fact could not even ask for governance power because that’s “not what this was for.” I think this was damaging to Optimism’s credibility and a missed opportunity for Maker to lend their considerable expertise to governance. Overall, without backing, you and others have claimed to represent what was or was not allowed as part of this distribution, and that’s affected existing grantees’ actions. That people were doing it before this very thread was posted, one saying “hey we shouldn’t let them do this,” is problematic. That people in this thread proposing it! are treating it as already settled precedent without considering the consequences of this position is doubly so. I’m afraid I’m having trouble understanding your second paragraph here, but it seems like you’re making a very thoughtful point.  In conclusion, these are my opinions and I will always want the best for this governance. In the future I may change my mind if there is a better proposal regarding self-delegated tokens received by the governance. At the end of the day these proposals may be approved in a vote, but that is a decision made by the collective as a whole.  I appreciate your statement here and acknowledge there’s room for all of us to grow as part of this experiment. I’m pushing back on you here because I find the opinions I’m reading to be based on flawed presumptions, but I think we all agree that we’re trying to get to the right answer. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.630654761904762
                },
                {
                    "author_link": "https://gov.optimism.io/u/Defi_LATAM_axlvaz",
                    "index": "47",
                    "likes": "2",
                    "time": "15/07/2022-19:57:25",
                    "content": "    jackanorak:  Que esto no es correcto es el punto que he estado gritando al vacío: esto se basa en una premisa defectuosa, que todos entienden que los tokens de gobernanza no siempre son para la gobernanza. Es muy probable que varios protocolos hayan omitido cualquier mención del poder de gobierno porque asumieron que sus tokens lo llevarían. De lo contrario habrías visto muchas más propuestas pedirlo, no 0 o quizás 1.   The cards can be used for anything. It must be clear in the proposal what they are to be used for. This is explained here. The delegates and members then give their opinion on the proposal. All comments are the member’s point of view. The proponents can defend their point or change it as I said before, the snapshot is who ends up defining the will of the government.     jackanorak:  Así que sí, es rotundamente incorrecto que “todos estemos de acuerdo” en que omitir la mención del uso de la gobernanza no es ético (por ejemplo, de las ~10 personas que han opinado aquí, al menos Gabagool y yo no estamos de acuerdo), y es muy problemático que un puñado de Los participantes del foro creen que definitivamente pueden afirmar sin precedentes ni consenso que los protocolos ya otorgados OP bajo un conjunto de suposiciones diferentes ahora no tienen derecho al uso completo de tokens OP.   Ok, here may be a mistranslation of what I meant in English. I meant to say “the most.” In this case of those we are discussing in this thread, I never make reference to governance. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is seeking feedback",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "48",
                    "likes": "2",
                    "time": "15/07/2022-20:00:08",
                    "content": "Ah, okay - understood. Yeah I apologize for any potential gaps in meaning myself due to translation. Whether it’s that “most” or “all” of us agree, my point is that this is not at all a settled, uncontroversial premise on which we can make judgment calls unilaterally. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.175
                },
                {
                    "author_link": "https://gov.optimism.io/u/Defi_LATAM_axlvaz",
                    "index": "49",
                    "likes": "2",
                    "time": "15/07/2022-20:19:00",
                    "content": "    jackanorak:  Está bien, uf. Ahora que sé que fue usted el responsable de la cita anterior, puedo decir cómodamente que su posición es inconsistente porque lo que le explicó a Maker fue la suposición incorrecta de que, de hecho, ni siquiera podían solicitar el poder de gobierno porque eso \"no es lo que esto era para. Creo que esto fue perjudicial para la credibilidad de Optimism y una oportunidad perdida para que Maker prestara su considerable experiencia a la gobernanza. En general, sin respaldo, usted y otros han afirmado representar lo que estaba permitido o no como parte de esta distribución, y eso afectó las acciones de los beneficiarios existentes. Que la gente lo estuviera haciendo antes de que se publicara este mismo hilo, uno diciendo “oye, no deberíamos dejar que hagan esto”, es problemático. ¡Que la gente de este hilo lo proponga! están tratándolo como un precedente ya establecido sin considerar las consecuencias de esta posición es doblemente así. Me temo que tengo problemas para entender tu segundo párrafo aquí, pero parece que estás expresando un punto muy reflexivo.   This is expressed here     Defi_LATAM_axlvaz:  1- Antes que nada aclaro que no soy delegado, ni miembro de la Fundación Optimismo. Soy miembro activo de este gobierno y de la comunidad DefiLatam y OptimismESP (no - oficial). 2- Como cualquier miembro de este gobierno como partícipe del mismo, doy mi opinión personal sobre las propuestas de la FASE 0,1… Cualquier otro miembro puede estar de acuerdo o en desacuerdo con mis opiniones, lo que no significa que las mías sean de ley. Cualquier miembro puede dar su opinión. 3- Las propuestas reciben la retroalimentación de los delegados y de los miembros gubernamentales. Para que cualquiera pueda defender cualquier punto en particular, la decisión final siempre se toma en Instantánea.   Still, I will respond again. Both Maker and any protocol can do what we are doing, open a debate. In that particular case I gave my “opinion” on the proposal, I issued an opinion, it is not an order. In all the comments you refer to me as if I speak for the government, I am just someone who is interested in the good of this government. If there is something in my “opinion” that you guys don’t like, we can always enter into debate. On the other hand, I always express my opinion within what the operations manual allows. And if you know the rules of phase postulation, both Maker and other protocols you can resubmit a proposal and even change your proposal to take it to a grant and get it approved. As I said before, the will of the collective is expressed in the snapshot, not with my opinion. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5435606060606055
                },
                {
                    "author_link": "https://gov.optimism.io/u/shridhar.eth",
                    "index": "50",
                    "likes": "0",
                    "time": "16/07/2022-04:46:03",
                    "content": "Good idea…lets see how OP team will react to this ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/millie",
                    "index": "51",
                    "likes": "3",
                    "time": "16/07/2022-12:38:39",
                    "content": "So after browsing through this thread I am left with more questions than answers, at this point I don’t know if the issue was Perp delegating their OP tokens or because it was not explicitly stated in their proposal? I am of the opinion that protocols should participate in governance, and in fact, think that the token house is indeed vulnerable to governance attacks down the road if the major protocols living on it are not active participants of governance. If the issue is that they didn’t explicitly state it in their proposal that they plan to delegate their idle OP from phase 0, I think it’s too early to judge them on it since they haven’t clearly violated their original proposal. Now if they were to never distribute their OP allocation and strictly use the OP to vote for more OP tokens for them selves or something that would constitute a governance attack. I reject @polynya’s insinuation that this is a “de-facto governance attack” in it’s current form and would invite the other active delegates of this forum to tone down their rhetoric as well. The precedent being set here is that if a project were to make any changes to their token distribution plan from the governance fund, that they are violating OP governance and should be blacklisted in the token house. So what if a project decides to re-direct incentives within their allocation or re-design their token distribution plan in light of new data or a lack of effectiveness in the original incentives plan? Are we to say that anything not explicitly stated in the original proposal is deemed a mis-use of funds? After reading this thread I am unable to gauge the sentiment around those things. On a another note, with the sheer volume of proposals coming through, I don’t find it reasonable that the fate of all those proposals be decided by an extremely small portion of the voting supply and by the handful of delegates who are active here. Personally I have more faith in Perp Protocol’s delegate voting genuinely and beneficially for the token house than I do in some random delegates who “like Optimism” but have no real tangible incentive alignment with Optimism. To sum things up, I would appreciate some clarity from those who had strong feelings on this topic to detail what the main concerns are, so at least there is some consensus to go off after reading this long thread. ",
                    "links": [
                        "https://gov.optimism.io/t/another-case-of-self-delegation-of-op-tokens-received-in-grants/3372/8"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.279336332070708
                },
                {
                    "author_link": "https://gov.optimism.io/u/Prometheus",
                    "index": "52",
                    "likes": "1",
                    "time": "16/07/2022-13:01:41",
                    "content": "    millie:  Are we to say that anything not explicitly stated in the original proposal is deemed a mis-use of funds?   Correct. If it wasn’t explicitly mentioned they don’t have the approval for that specific use. We don’t have to guess how projects will use this funds. Guessing isn’t how governance works. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.9375
                },
                {
                    "author_link": "https://gov.optimism.io/u/millie",
                    "index": "53",
                    "likes": "1",
                    "time": "16/07/2022-13:10:05",
                    "content": "Sadly you are replying to one sentence in my post without answering anything else in that paragraph. Please be a little more thoughtful in your responses as we are fracturing the thread with micro replies.  Correct. If it wasn’t explicitly mentioned they don’t have the approval for that specific use. We don’t have to guess how projects will use this funds. Guessing isn’t how governance works.  So what if a project realizes that there is a more effective way at stimulating activity on OP and make a change to their distribution plan and target the incentives in a way that’s different to how it was outlined in the original proposal? Are projects strictly bound by their governance fund proposal and cannot make any changes to their incentive program? That sounds unnecessary imo ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.64375
                },
                {
                    "author_link": "https://gov.optimism.io/u/Prometheus",
                    "index": "54",
                    "likes": "0",
                    "time": "16/07/2022-13:21:48",
                    "content": "I like objectivity… it’s easier to make a point.     millie:  Are projects strictly bound by their governance fund proposal and cannot make any changes to their incentive program?   Anyway, following this thinking what about requesting some kind of approval from the community? Projects can follow up on their success or issues and request feedback from the community or not? It shouldn’t be hard to find some balance since using funds/voting power without explicit consent isn’t exactly how governance works. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.858333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/Defi_LATAM_axlvaz",
                    "index": "55",
                    "likes": "0",
                    "time": "16/07/2022-14:24:18",
                    "content": "    millie:  Soy de la opinión de que los protocolos deberían participar en la gobernanza y, de hecho, creo que la casa de fichas es vulnerable a los ataques de gobernanza en el futuro si los principales protocolos que viven en ella no son participantes activos de la gobernanza.   There is a mistake here, no one is against protocols participating in governance. Even if you note that there are already protocols that have delegates in governance. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 2.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/polynya",
                    "index": "56",
                    "likes": "3",
                    "time": "16/07/2022-14:30:26",
                    "content": "Sorry, I don’t have any strong feelings, and I’m a novice to this governance stuff. I apologize for the wording. In future, it’d be best of the projects declare if they’ll use the granted OP for governance voting, and if so, why. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.166666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/Defi_LATAM_axlvaz",
                    "index": "57",
                    "likes": "1",
                    "time": "16/07/2022-14:46:47",
                    "content": "    millie:  Si el problema es que no indicaron explícitamente en su propuesta que planean delegar su OP inactivo desde la fase 0, creo que es demasiado pronto para juzgarlos ya que claramente no han violado su propuesta original. Ahora, si nunca distribuyeran su asignación de OP y usaran estrictamente el OP para votar por más tokens de OP para ellos mismos o algo que constituiría un ataque de gobierno. rechazo@polynyaLa insinuación de que se trata de un “ataque a la gobernabilidad de facto” en su forma actual e invitaría a los otros delegados activos de este foro a bajar el tono de su retórica también.   Here it depends on the flexibility of each one, let’s imagine that all projects do the same and use the inactive tokens from the OP for different activities as long as they don’t “violate the original proposal”, it would be very difficult to follow and verify that each one complies with its original proposal. I think this would blur the main goal of governance and open the door to constant cheating.     millie:  El precedente que se establece aquí es que si un proyecto hiciera algún cambio en su plan de distribución de tokens del fondo de gobierno, estaría violando el gobierno de OP y debería estar en la lista negra de la casa de tokens. Entonces, ¿qué sucede si un proyecto decide redirigir los incentivos dentro de su asignación o rediseñar su plan de distribución de tokens a la luz de nuevos datos o la falta de efectividad en el plan de incentivos original? ¿Debemos decir que cualquier cosa que no se establezca explícitamente en la propuesta original se considera un mal uso de los fondos? Después de leer este hilo, no puedo medir el sentimiento en torno a esas cosas.   Protocols can always reapply for another application, and they can also propose a tokenization change through governance, I don’t see any problem here. If they want to change they can propose it and bring it to a vote. If they want more OP tokens they can reapply for the next phase     millie:  En otra nota, con el gran volumen de propuestas que llegan, no me parece razonable que el destino de todas esas propuestas sea decidido por una porción extremadamente pequeña de los votantes y por el puñado de delegados que están activos aquí. Personalmente, tengo más fe en que los delegados de Perp Protocol voten de manera genuina y beneficiosa por la casa de fichas que en algunos delegados aleatorios a los que “les gusta el optimismo” pero que no tienen un incentivo tangible real alineado con el optimismo.   Proposals are on the forum for at least 2 weeks, sometimes even longer, no great activity is required. It is also part of the commitment made by the delegates when they applied to the forum. See here. So I don’t see what’s wrong with a delegate fulfilling the commitment they made, just like other delegates who don’t, we can’t force them to spend time on governance.     millie:  Para resumir, agradecería un poco de claridad por parte de aquellos que tienen fuertes sentimientos sobre este tema para detallar cuáles son las principales preocupaciones, por lo que al menos hay cierto consenso para continuar después de leer este largo hilo.   I think it’s clear, protocols have to be clear what the OP tokens are going to be used for, that’s what the application template is for. The final decision is always in the snapshot. ",
                    "links": [
                        "https://gov.optimism.io/t/delegate-commitments/235/1"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author is advertising proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.19927536231884
                },
                {
                    "author_link": "https://gov.optimism.io/u/millie",
                    "index": "58",
                    "likes": "1",
                    "time": "16/07/2022-15:49:00",
                    "content": " Protocols can always reapply for another application, and they can also propose a tokenization change through governance, I don’t see any problem here. If they want to change they can propose it and bring it to a vote. If they want more OP tokens they can reapply for the next phase  Are you implying that any change to a project’s distribution plan should be voted on through OP governance even after a project has received their allocation? I don’t think that’s feasible to police and nor should it be pursued, the best way to assess a project’s distribution plan is upon future gov fund applications. When a project applies for a second allocation, the entirety of their OP distribution and it’s impact can be assessed at that time. Delegates would have a clear picture of how a protocol contributed to Optimism’s growth and improvement and make a decision accordingly. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author is advertising proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.333333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/Defi_LATAM_axlvaz",
                    "index": "59",
                    "likes": "1",
                    "time": "16/07/2022-16:21:30",
                    "content": "I don’t think I expressed myself well. What I meant in general terms is that protocols can always fall back on governance. I think whether it is for a change or to request more OP tokens, governance in my opinion has to be a useful tool for all participants. Even if a protocol decides to make a change in the token utilization plan, I think it would be correct or more transparent to communicate it through governance. I think this way this kind of debates and controversies could be avoided in the future. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.392857142857142
                },
                {
                    "author_link": "https://gov.optimism.io/u/lefterisjp",
                    "index": "60",
                    "likes": "8",
                    "time": "16/07/2022-19:22:18",
                    "content": "This is a very interesting question. I am actually not sure what the right answer should be here. Perhaps we should make it standard to specify in a governance funding proposal what they intend to do with the idle funds while they are not being spent/allocated. I may be on the minority here but I don’t see it as bad to have more people/projects involved in governance, even if that comes from using idle funds from governance funding. Perhaps proposals for funding should be structured and paid out so there is no funds sitting idle but that’s another topic altogether. Right now governance power seems quite concentrated. Perhaps allowing this would help to change this? But since this seems to be a hot topic and already debated a lot here, would it not make sense to make it part of the proposal template? Something like: “Do you intend to use the idle funds for governance?” ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.638392857142858
                },
                {
                    "author_link": "https://gov.optimism.io/u/Defi_LATAM_axlvaz",
                    "index": "61",
                    "likes": "3",
                    "time": "16/07/2022-19:31:26",
                    "content": "Yes, even after several conversations, among some participants we have made this proposal     Update of the PHASE 1 protocol nomination template 💌 Ideas & Feedback       This is a joint collaboration of:  @OPUser (delegate),  @Netrim @NicoEsp @DeFi_LATAM_Joxes @Defi_LATAM_axlvaz  (DeFi Latam & Optimism Español [no oficial])  If I am missing the name of any contributor, please let me know.  Summary  Noting the number of proposals and consultations made by the delegates to the proponents. We request, along with other delegates and government members, this modification to the application template. So that projects/protocols/proponents can more robustly and strongly…     ",
                    "links": [
                        "https://twitter.com/DeFi_LATAM",
                        "https://twitter.com/OptimismESP"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.21875
                },
                {
                    "author_link": "https://gov.optimism.io/u/nana",
                    "index": "62",
                    "likes": "0",
                    "time": "17/07/2022-10:55:15",
                    "content": "ha i think its a good idea .but dao is the most important decider ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.666666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/nana",
                    "index": "63",
                    "likes": "0",
                    "time": "17/07/2022-13:44:34",
                    "content": "support the opinion,its a good idea ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/MinimalGravitas",
                    "index": "64",
                    "likes": "3",
                    "time": "17/07/2022-16:45:33",
                    "content": "That was a really good spot @OPUser, I don’t in principle mind if projects want to delegate a small portion of received funds to voting, IF they state in their proposal that this is what they will be doing. As @lefterisjp says, it might even be a good thing for project teams who have received funding from Optimism to have some say in the governance, not only does it help decentralize power amongst more different people, but they are going to be teams that we’ve already assessed as being well aligned with Optimism. On the other hand, I don’t think an optimal outcome has grant recipients instantly having a multiple times bigger say than the biggest delegates, who are each representing about 12k users. While Perp have done the right thing and undelegated now the issue has been brought to light, we do probably need to address the issue in a way that doesn’t rely on the honest actions of unknown individuals. From what I understand there is no way to blacklist addresses from SnapShot votes, therefore a harmful governance attack from other recipients in the future seems like a very real possibility if we don’t come up with a solution. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.836974789915966
                },
                {
                    "author_link": "https://gov.optimism.io/u/millie",
                    "index": "65",
                    "likes": "2",
                    "time": "19/07/2022-12:08:06",
                    "content": "Yeah I’m on the same page and agree with the reasoning, I don’t think it’s necessarily a bad thing that we have protocol participation in token house. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 3.250000000000001
                },
                {
                    "author_link": "https://gov.optimism.io/u/gabagool",
                    "index": "66",
                    "likes": "1",
                    "time": "25/07/2022-13:32:32",
                    "content": "I fully agree. For some context: the Velodrome team has done a review of every single proposal for funding submitted up to this point. (Shoutout primarily to @jackanorak) We are deeply engaged in Optimism’s growth, we are an Optimism native protocol, and have been trusted to a large degree by OP Labs to help fulfill the promise of more users and more liquidity. It would seem to me (and yes, I am deeply biased) that we are exactly the sort of people that Optimism would WANT to participate in Governance. We happen to have ~3m OP tokens, tokens that were granted to us separate from any governance process. But because of community discomfort about protocol’s self-delegating - in any amount - we have zero stake in governance voting & decision making. To me, this is a missed opportunity. Are there risks here? Yes, teams could act maliciously, teams could self-serve. But these are risks regardless of self-delegation. Our alternative option is to aggressively campaign for people to shift their delegation to us. I’m all for including $OP delegation plans in funding proposals, I’m all for implementing a process. But I can’t help but feel like what we witnessed in this thread is a small number of people gate-keeping what is meant to be a decentralized governance process, with no clear positive outcome. IMO having PERP as partners in governance would have strengthened the Optimism Collective. We lost those voices and votes, and missed an opportunity to have protocol level involvement in governance decisions in the process. What have we gained? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.781877213695395
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "67",
                    "likes": "1",
                    "time": "25/07/2022-13:45:02",
                    "content": "I’ll take this a step further: What’s preventing the Perp team from capturing a majority of its own granted tokens through liquidity mining and then self-delegating individually? Essentially the same outcome would occur, the Perp team having the same voting influence it wanted, but now we’ll never know who’s behind their votepower, and we’d lack a delegate with a voice in the forums. Now consider all the liquidity mining that teams have proposed to date (I’m soon going to propose an updated state of grants), and now there is a huge leak in transparency relative to protocol-owned votepower. I’d argue that retroactively allowing teams to self-delegate is a vote for transparency in addition to what I hope is a broadly shared belief that projects have a unique perspective to share to the collective and are legitimate stakeholders in this community. Perhaps we simply ask that they create delegate profiles to reflect their intentions. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.471590909090908
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "68",
                    "likes": "1",
                    "time": "25/07/2022-13:47:34",
                    "content": "No one is saying or even suggesting that a project  should not have a say in gov. Gov is open and any can and should participate. We already have many delegates from different project, even Perp has a delegate representation. If you or anyone wants to be part of the delegate, they should follow the same approach as others. Create a delegate profile and participate just like others. I dont see a problem in asking users to delegate their votes to you. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.699999999999999
                },
                {
                    "author_link": "https://gov.optimism.io/u/HuntTheFarmers",
                    "index": "69",
                    "likes": "1",
                    "time": "25/07/2022-15:42:16",
                    "content": "    jackanorak:  Now consider all the liquidity mining that teams have proposed to date (I’m soon going to propose an updated state of grants), and now there is a huge leak in transparency relative to protocol-owned votepower.   Interesting. So there’s a possibility a massive amount of $OP liquidity mining rewards are going to team/initial investor/team controlled entities/VC wallets??? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.125
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "70",
                    "likes": "1",
                    "time": "25/07/2022-16:04:18",
                    "content": "Yeah, without question – the analysis of Perp’s own liq mining is one such example. In many cases, VC’s value add is “we’ll provide liquidity on your pool,” and so on. It’s not inherently a bad thing, and often it’s not preventable, as when a team’s currently supporting the protocol and owns many of the tokens, and the hope is that the incentives will make this less the case. But this is why you want to see growth in wallets LPing in the course of these incentives, to show you’re not just paying a ton of OP to the 10 DAUs of some project and the dev team over many many months or letting them self-delegate and accrue OP votepower for the next round of incentives. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.8106060606060606
                },
                {
                    "author_link": "https://gov.optimism.io/u/gabagool",
                    "index": "71",
                    "likes": "0",
                    "time": "26/07/2022-12:05:55",
                    "content": "    OPUser:  I dont see a problem in asking users to delegate their votes to you.   As I’ve said in past points - getting users to change delegation is an uphill battle following the initial airdrop / delegation flood.  It requires users to click buttons + spend gas. Always a bad thing I imagine we will not see any significant shift in delegates until another airdrop that requires delegation.  If the delegates are the same as last time, we will simply se a further centralization of delegate power.  I know that no one is saying or suggesting that a project should not have a say in governance, governance is open and any one CAN and SHOULD participate - just not with the tokens they currently have. A big “just not”. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.738636363636363
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "72",
                    "likes": "2",
                    "time": "26/07/2022-12:12:28",
                    "content": " just not with the tokens they currently have  Well it depends how they got the token.  It requires users to click buttons + spend gas. Always a bad thing I imagine we will not see any significant shift in delegates until another airdrop that requires delegation. If the delegates are the same as last time, we will simply se a further centralization of delegate power.  I am glad you mentioned this as there is a proposal in current voting cycle focusing on fixing this. Also, there has been lot of discussion around solving voters apathy so i expect some changes in season 2 around that too. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "3rd party or author is advertising proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.109375
                },
                {
                    "author_link": "https://gov.optimism.io/u/gabagool",
                    "index": "73",
                    "likes": "3",
                    "time": "26/07/2022-12:28:00",
                    "content": "One thing I love about you, @OPUser, is your dedication to the governance process. While we may have disagreed at several times I respect that you continually show up in this forum and try to push forward Optimism’s Governance Process. I’d like to be able to do the same, currently I have 30k OP delegated. Velodrome will gain voting power, and we’ll do so without ruffling feathers. I do think any future grant should: Allow some % of Protocol Granted OP to be self-delegated to ensure Protocol participation in governance, say 25% ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "74",
                    "likes": "0",
                    "time": "26/07/2022-13:16:11",
                    "content": "Hey @gabagool, thank you. And indeed, we have disagreement on couple of topic but I see that as a positive things as it leads to discussion and open engagement. As long as we are fighting towards a common goal and not with each other, gov will win. Believe me, like you, I want more delegate and users participation in our gov process but instead of locking 25%, how about this ? from total voting power available, project can request for max X% of voting power as self-delegate. This percentage can be decided with a proposal. Keeping in mind that, it should not be permanent. Problem with 25% is that its quite relative, a project asking for 1M OP token and self-delegating 25% will put them in top  10 while another project asking for 300K will put them into top 80-90 range. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.021780303030303
                },
                {
                    "author_link": "https://gov.optimism.io/u/gabagool",
                    "index": "75",
                    "likes": "0",
                    "time": "26/07/2022-14:23:04",
                    "content": "  Delegation is never permanent, particularly as these tokens are all being distributed. Over time, they will be re-delegated depending on who holds the particular token   25% was an example, I think it makes sense to have a cap X% of granted OP.   As more and more OP tokens are distributed, we should not use “current delegates %” as a metric, as those delegates received their voting shares when OP circulating supply was much smaller.   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.333333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "76",
                    "likes": "0",
                    "time": "26/07/2022-14:29:55",
                    "content": "Agreed, would love to participate if a proposal comes along regarding this. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/hait",
                    "index": "77",
                    "likes": "1",
                    "time": "01/12/2022-06:28:43",
                    "content": "Hmm… It’s a complicated problem. I think we need a real method. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.25
                }
            ]
        }
    ],
    "group_index": "151"
}