{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/draft-gf-phase-1-proposal-opweave-coverage-of-everything-optimism/4990",
            "title": "[DRAFT][GF: Phase 1 Proposal] OPweave: Coverage of everything Optimism ",
            "index": 4990,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Grants Council"
            ],
            "tags": [
                "cycle-10",
                "passed"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/GrantsOps",
                    "index": "1",
                    "likes": "3",
                    "time": "01/02/2023-04:39:15",
                    "content": "Project name: OPweave: Coverage of everything Optimism Author name and contact info (please provide a reliable point of contact for the project): ProofOfCake. Email: proofofcake8669@gmail.com Discord: ProofOfCake#8669 I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: Yes I understand that I will be expected to following the public grant reporting requirements outlined here: Yes L2 recipient address: 0x66A44DAB44D21E2631e61B21759A30b73E94ae69 Which Voting Cycle are you applying for?: Season 3, Cycle 10 Which sub-committee should review your proposal? (Builders Grants, Growth Experiment Grants): Growth Experiment Grants Project description (please explain how your project works): We propose an impartial third-party journalistic approach to improve awareness across the Optimism ecosystem. To do so, we will post a weekly blog and podcast to discuss current updates, active projects, contributions, and goals, as determined by Grants Council and community guidance. Our team will be able to help aggregate and filter information for the wider community by:1. Concisely presenting new projects that deploy on Optimism2. Following existing projects for any new releases or updates3. Attending Optimism community calls4. Monitoring the Discord channels5. Summarizing and reporting on RFPs/funding rounds6. Highlighting public good initiatives supported by Optimism Website: We will set up a structure for the OPweave project that is similar to the one that we currently have in place for Synthetix, as referenced in following links. SNXweave-Gov - Synthetix Blog https://snxweave.medium.com/ Twitter: https://twitter.com/snx_weave Discord/Discourse/Community: Other relevant links (including any demos): SNXweave - YouTube SNXweave • A podcast on Anchor Additional team member info (please link): We are the team behind SNXweave, Synthetix’s main governance news platform. We provide Weekly Recap blog posts and podcasts to help users better stay up to date with the Protocol and the many happenings of their elected Councils. Our team works hard to address governance needs within Synthetix, as evident by us introducing the protocol’s first-ever Quarterly Report. In addition to this, we have also introduced Council Attendance & Participation Reports, Debate-Style Election Panels, research papers as commissioned by Synthetix, and more.Working in accordance with the goals of the Grants Council, we have been able to help maintain accountability across the protocol by attending and recording weekly meetings/calls and working closely with the Council members. An additional outcome of this level of transparency has been making voting easier for community members come election time. Our team possesses the following set of experiences and skill sets that will be utilized for this project: Education:-Degrees from top 10 universities-Team members possess varying degrees of education ranging from Bachelor’s to Graduate-level Experience:Writing experience:-IP law firm synthesizing research and simplifying information into concise legal documents-Research done and published for Synthetix Grants Council: The Synthetix grantsDAO Retroactive Public Goods Grants Program | by Synthetix Grants | Medium-SNXweave blogsMarketing experience:-Research for a company to produce an online marketing tool (coded in JavaScript, HTML, and CSS)-Social media management-YouTube channel creation and managementPodcasts:-Writing, editing, and producing podcasts-Producing SNXweave weekly recap podcasts-Hosting and producing SNXweave Election Panel podcastsDigital graphic design:-Experience designing company logos-Created and sold graphic design products onlineProgram and project management Skills:-Technical: digital production and development; Adobe Audition-Programming: experience working with Java, JavaScript, HTML, CSS, and Python-Communications: proficient in Microsoft Office and Google Suite for written communications as well as visual communications (presentations, slideshows, data analysis, reporting, etc.) Please link to any previous projects the team has meaningfully contributed to: The Synthetix grantsDAO Retroactive Public Goods Grants Program | by Synthetix Grants | Medium Relevant usage metrics (TVL, transactions, volume, unique addresses, etc. Optimism metrics preferred; please link to public sources such as Dune Analytics, etc.): This is a new initiative, and therefore has no history of usage metrics. These metrics will be developed as the project progresses. Competitors, peers, or similar projects (please link): dYdX Grant: The dYdX Report (Newsletter)https://aavenews.substack.com/The Lyra Short Put #13 November 30, 2022 — MasterMojo.eth Is/will this project be open sourced?: No Optimism native?: No Date of deployment/expected deployment on Optimism: 1/31/2023 What is the problem statement this proposal hopes to solve for the Optimism ecosystem?: The digital asset ecosystem moves at lightning speed with a constant barrage of information and updates. As a result, a solution is necessary to allow users to meaningfully follow multiple projects at a time. How does your proposal offer a value proposition solving the above problem?: OPweave seeks to synthesize available information in the Optimism ecosystem and create a periodical that provides valuable community updates, and allows token holders to make informed governance decisions. The entire Optimism ecosystem stands to benefit tremendously from OPweave, by improving communication and transparency for the project. Why will this solution be a source of growth for the Optimism ecosystem?: A weekly blog and podcast is a powerful marketing tool and will serve to further expand Optimism’s reach in the DeFi community. This will also create an essential record of events for newcomers who are looking for ways to get involved in the community. As projects mature, the burden of providing this service becomes too high as an auxiliary function of a core contributor. Also, the addition of a third party to carry out this task adds a layer of objectivity and accountability that is harder to achieve in a self-reported update. Has your project previously applied for an OP grant?: No Number of OP tokens requested: Equivalent of $24,000 in OP (for the 12 weeks proposed, see below) Did the project apply for or receive OP tokens through the Foundation Partner Fund?: No If OP tokens were requested from the Foundation Partner Fund, what was the amount?: N/A How much will your project match in co-incentives? (not required but recommended, when applicable): N/A How will the OP tokens be distributed? (please include % allocated to different initiatives such as user rewards/marketing/liquidity mining. Please also include a justification as to why each of these initiatives align with the problem statement this proposal is solving.): All tokens will be spent on operating expenses for OPweave efforts. Over what period of time will the tokens be distributed for each initiative? Shorter timelines are preferable to longer timelines. Shorter timelines (on the order of weeks) allow teams to quickly demonstrate achievement of milestones, better facilitating additional grants via subsequent proposals: We propose a 12 week trial period for OPweave, for the Grants Council to effectively evaluate the positive outcomes of the neutral third-party reporting services that we will provide around the state of Optimism governance/proposals/grants/upgrades/etc. After this trial period, the timeline of OPweave may be extended on a more long-term basis. Please clearly define the milestones you expect to achieve in order to receive milestone based installments. Please consider how each milestone relates to incentivizing sustainable usage and liquidity on Optimism. Progress towards each milestone must be trackable: Milestones will be met weekly and will include a published OPweave blog and podcast that each review the previous week. Why will incentivized users and liquidity on Optimism remain after incentives dry up?: While financial incentives do not apply to this proposal, the addition of a neutral news source for the ecosystem will keep users engaged and provide a research hub for prospective users looking for a concise summary of Optimism developments over time. Please provide any additional information that will facilitate accountability (smart contracts addresses relevant to the proposal, relevant organizational wallet addresses, etc.): None! Confirm you have read and agree to the Eligibility Restrictions (here): I have read the Eligibility Restrictions and agree to abide by their conditions ",
                    "links": [
                        "https://blog.synthetix.io/tag/snxweave-gov/",
                        "https://snxweave.medium.com/",
                        "https://twitter.com/snx_weave",
                        "https://www.youtube.com/@snxweave",
                        "https://anchor.fm/snxweave",
                        "https://medium.com/@SynthetixGrants/the-synthetix-grantsdao-retroactive-public-goods-grants-program-629ec299c4d4",
                        "https://medium.com/@SynthetixGrants/the-synthetix-grantsdao-retroactive-public-goods-grants-program-629ec299c4d4",
                        "https://www.dydxgrants.com/grants/the-dydx-report-newsletter",
                        "https://aavenews.substack.com/",
                        "https://mirror.xyz/mastermojo.eth/t1D236oaIXziAluAY1Mgh_Ju77fghC-AsottThzFgmw",
                        "https://gov.optimism.io/t/grant-proposal-template/3233",
                        "https://gov.optimism.io/t/cycle-10-final-grants-roundup/5418",
                        "https://gov.optimism.io/t/cycle-10-grant-review-roundup/5284"
                    ],
                    "GPT-summary": "The post is a proposal for a new project called OPweave, which aims to provide impartial third-party journalistic coverage of the Optimism ecosystem. The proposal explains the project's goals, team, and expected outcomes. The post also includes information about the team's previous work on Synthetix's governance news platform, SNXweave. The proposal is open to feedback and questions, and a 3rd party could potentially extend to the proposal by collaborating with the team.",
                    "GPT-proposal-categories": [
                        "Community and engagement",
                        "Grants, Funding and resource allocation",
                        "Smart contract updates",
                        "None",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.542824147397319
                },
                {
                    "author_link": "https://gov.optimism.io/u/MoneyManDoug",
                    "index": "2",
                    "likes": "1",
                    "time": "05/02/2023-16:21:19",
                    "content": "    GrantsOps:  All tokens will be spent on operating expenses for OPweave efforts.   More clarity is needed to move forward, as this would violate the no-sale rule. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/ProofOfCake",
                    "index": "3",
                    "likes": "1",
                    "time": "05/02/2023-18:02:02",
                    "content": "Hey! Just to clarify for that section: The grant will be held as is (in $OP) and distributed to OPweave contributors in $OP tokens, as the objectives of the proposal are achieved. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/akharito",
                    "index": "4",
                    "likes": "1",
                    "time": "05/02/2023-18:08:45",
                    "content": "Good proposal! I’d vote for, definitely! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.1875
                },
                {
                    "author_link": "https://gov.optimism.io/u/GrantsOps",
                    "index": "5",
                    "likes": "0",
                    "time": "06/02/2023-04:22:27",
                    "content": "This is simply to make sure you are aware of the parameters discussed in the Feb 3 AMA, which includes references to the no sale rule. This is not a comment on the compliance / non-compliance with the rule, but to ensure you have an opportunity to review. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/GrantsOps",
                    "index": "6",
                    "likes": "1",
                    "time": "19/02/2023-21:46:32",
                    "content": "Hey @ProofOfCake can you clarify whether you mean the “community” vs the contributors to the project? This is a bit ambiguous and was pointed out by a member of the community. Both reviewers thus far have read this as meaning community. If this is intended for compensation to the contributors, that would not comply with the no sale rule. It would be helpful if you can give some clarity on the distribution plan generally, which would be required if you were to receive a final grant, as the no sale rule is a strict rule. The no sale rule covers the grant recipient, their affiliates and any other related persons. Refer here for the full text of the rule. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.044642857142857
                },
                {
                    "author_link": "https://gov.optimism.io/u/ProofOfCake",
                    "index": "7",
                    "likes": "0",
                    "time": "21/02/2023-17:14:14",
                    "content": "Hey @GrantsOps yes, to clarify - we have reviewed the no sale rule and neither us nor any affiliates intend to sell the OP allocation. Please let us know if any further clarity in the proposal is needed! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/ProofOfCake",
                    "index": "8",
                    "likes": "0",
                    "time": "24/02/2023-19:44:44",
                    "content": "@MattL @danelund.eth Here is an addendum to the milestone section of our proposal, detailing our intended milestones. Thank you! There will be 12 total milestones, Critical and Benchmark, for this proposal: Critical Milestone 1 (CM1): The first critical milestone will be a fully published blog post (published on a unique Medium or Ghost site) and podcast (published on Anchor/Spotify) that detail Optimism’s current events, updates, active projects, contributions, etc. from the previous week. This will be the first blog post and the first podcast posted on their respective OPweave sites, and will include an introduction to the project. Milestone Completion: The proposed 12-week trial period will begin two weeks after the proposal is approved by the Grants Council. The first milestone will come the first Friday (or whichever day of the week is deemed best for publishing purposes) following this initial two weeks. 1/12th of the requested OP will be awarded after the completion of this milestone (equivalent of $2,000 in OP). Benchmark Milestone 1 (BM1): The first benchmark milestone will be the second blog post and podcast published to their respective sites, also detailing the previous week’s events. Each delivery of the blog and podcast will be weekly (on the same previously decided day of the week) from here on out. Milestone Completion: 1 week after delivery of CM1. 1/12th of the requested OP will be awarded after the completion of this milestone (equivalent of $2,000 in OP). Benchmark Milestone 2 (BM2): The BM2 will be the third blog post and podcast published to their respective sites. Milestone Completion: 1 week after delivery of BM1. 1/12th of the requested OP will be awarded after the completion of this milestone (equivalent of $2,000 in OP). Benchmark Milestone 3 (BM3): The BM3 will be the fourth blog post and podcast published to their respective sites. Milestone Completion: 1 week after delivery of BM2. 1/12th of the requested OP will be awarded after the completion of this milestone (equivalent of $2,000 in OP). Benchmark Milestone 4 (BM4): The BM4 will be the fifth blog post and podcast published to their respective sites. Milestone Completion: 1 week after delivery of BM3. 1/12th of the requested OP will be awarded after the completion of this milestone (equivalent of $2,000 in OP). Benchmark Milestone 5 (BM5): The BM5 will be the sixth blog post and podcast published to their respective sites. Milestone Completion: 1 week after delivery of BM4. 1/12th of the requested OP will be awarded after the completion of this milestone (equivalent of $2,000 in OP). Benchmark Milestone 6 (BM6): The BM6 will be the seventh blog post and podcast published to their respective sites. Milestone Completion: 1 week after delivery of BM5. 1/12th of the requested OP will be awarded after the completion of this milestone (equivalent of $2,000 in OP). Benchmark Milestone 7 (BM7): The BM7 will be the eighth blog post and podcast published to their respective sites. Milestone Completion: 1 week after delivery of BM6. 1/12th of the requested OP will be awarded after the completion of this milestone (equivalent of $2,000 in OP). Benchmark Milestone 8 (BM8): The BM8 will be the ninth blog post and podcast published to their respective sites. Milestone Completion: 1 week after delivery of BM7. 1/12th of the requested OP will be awarded after the completion of this milestone (equivalent of $2,000 in OP). Benchmark Milestone 9 (BM9): The BM9 will be the tenth blog post and podcast published to their respective sites. Milestone Completion: 1 week after delivery of BM8. 1/12th of the requested OP will be awarded after the completion of this milestone (equivalent of $2,000 in OP). Benchmark Milestone 10 (BM10): The BM10 will be the eleventh blog post and podcast published to their respective sites. Milestone Completion: 1 week after delivery of BM9. 1/12th of the requested OP will be awarded after the completion of this milestone (equivalent of $2,000 in OP). Critical Milestone 2 (CM2): We will have published 12 blog posts and 12 podcasts by this critical milestone. CM2 marks the end of the initial 12-week trial period and will be the final delivery for this proposal. Milestone Completion: 1 week after delivery of BM10. The final 1/12th of the requested OP will be awarded after the completion of this milestone (equivalent of $2,000 in OP). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.287393162393163
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "9",
                    "likes": "1",
                    "time": "05/03/2023-19:50:13",
                    "content": "Hi @ProofOfCake! Can you provide a Telegram handle or other contact method so the Optimism team can get in touch about paying out this grant! Feel free to DM or email lavande@optimism.io ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.609375
                },
                {
                    "author_link": "https://gov.optimism.io/u/ProofOfCake",
                    "index": "10",
                    "likes": "1",
                    "time": "05/03/2023-20:23:20",
                    "content": "Hey @lavande - Discord would be best, I will DM you there! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                }
            ]
        }
    ],
    "group_index": "484"
}