{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/draft-gf-phase-1-scratch-crypto/3476",
            "title": "[DRAFT] [GF: Phase 1] Scratch Crypto ",
            "index": 3476,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Governance Fund: Phase 1"
            ],
            "tags": [
                "cycle-7"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/kirilligum",
                    "index": "1",
                    "likes": "1",
                    "time": "14/09/2022-21:04:44",
                    "content": "Project name: Scratch Crypto Author name and contact info (please provide a reliable point of contact for the project): Kirill Igumenshchev, kirill.igum@gmail.com, Profile - kirilligum - Optimism Collective, https://twitter.com/kirill_igum I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: Yes L2 recipient address: 0xDcCafbDDd382AeadA0789C5A54Dc1a14C2D6499b Grant category: Governance Fund (Phase 1 Batch). Is this proposal applicable to a specific committee? No Project description (please explain how your project works):  Product   Tagline: Hard-cash onramp  One-liner: We sell paper-card crypto vouchers in convenience stores. We provide a low-tech UX, compliance, and security against physical theft.   Customers (we sell to consumers through convenience stores)  bank distrusting (half the people in the USA keep their savings in cash) unbanked (can’t get a bank account) low-tech (easier than Coinbase or cash app)   how it works  The customer (C) buys the card in a convenience store The cashier, registered and tracked in our system to avoid theft, activates the card. C scratches the card to get a QR code that takes them to our web app (https://kirilligum.gitlab.io/s4c/5c04xy1u22ld61wz/get in progress) Our web app asks for a photo of the customer’s ID to do KYC verification (see our winning zk-kyc-sbt project below). C enters an email or gets a link to the out low-tech wallet. C receives a stablecoin on optimism. In our wallet, C has options to send the crypto to other wallets or smart contracts (DeFi and DApps) or cash out.   web app (in the process) https://kirilligum.gitlab.io/s4c  Vision  This onramp project is the first step towards our vision. Our end goal is decentralized consumer banking, where any village with the internet should be able to start a credit union with a click of a button. Credit scores and access to credit should be available to anyone with an internet connection. Our onramp and future consumer banking system will save costs over traditional banking and microfinance by decentralizing trust and security. Our project will evolve into a DAO once we optimize the procedures. Consumer banking should not be slowed down by the current regulations developed for centralized finance. Buying crypto can now be as simple as ordering food in a restaurant during a pandemic since everyone has learned to use a QR code. Low-tech people should have access to the knowledge of how crypto is reliable storage of value and a non-reversible payment system like hard cash.   my background  After working for Paxful (p2p crypto for fiat and gift card marketplace with 6M active users) and helping them to fight fraud, I kept testing the p2p exchange of crypto for gift cards and electronic methods of payment. I personally lost a large amount of money and got blocked by amazon and Venmo due to gift card frauds taking advantage of the reversibility of electronic payment methods (chargebacks). I dove into the mechanics of payments and the legal aspect of it. I realized that all traditional electronic payments, including wire, are reversible, and the banks will freeze your account even if you are not at fault. A proper system needs to be built ground up. My background (https://www.linkedin.com/in/kirilligum/): I got a Ph.D. in quantum chemistry. I worked on technologies that took a while to get adopted because people didn’t have the savings to make the switch. I realized that with access to proper credit and financial systems, people would have access to technologies that are ready for use but too expensive for a one-time payment. I lead an internal AI consulting agency for a Brazilian digital bank. Our job was to understand the problems that departments had and solve them with AI. More people are working on this with me but need to get paid to work: a lawyer and a front-end developer.   Strategy  Our initial strategy is to go after the underserved market and grow. This is similar to how the Bank of America in 1906 grew by giving loans to the unbanked Bank of America: The Humble Beginnings of a Large Bank | OCC, or how Square grew customer base by giving street vendors access to visa and master card with a cheap terminal. The future plan is to build a decentralized consumer banking system for anyone with the internet: POS terminals for farmer markets to accept crypto, private payments with optional reporting, small business credit, and consumer credit. The idea is to be the starting point for people’s journey onto crypto, similar to how Chrome browser is the starting point for the internet.   Traction  in the process of building an MVP (React App) won the best DeFi prize ($5000) from WalletConnect at the NYC Eth hackathon with a ZK KYC SBT ZK KYC SBT | ETHGlobal  studied legal documents on money transmission and literature on the philosophy and anthropology of money and credit    Project links:  Website: React App  Twitter: Discord/Discourse/Community: Please include all other relevant links below:  Additional team member info (please link):  Kirill Igumenshchev (me) – leader, full-stack, solidity, consumer banking https://www.linkedin.com/in/kirilligum/  Gorsha Sur – general council and operations https://www.linkedin.com/in/gorsha-sur/  Business and customer development and full-stack Alex Alekseyenko – full-stack https://www.linkedin.com/in/alex-alekseyenko-81416323/  Full-Stack Developer x1-3 Community Manager 3-5 call center support and sales  Please link to any previous projects the team has meaningfully contributed to: We have won the first DeFi prize from wallet connect at NYC eth global ZK KYC SBT | ETHGlobal Relevant usage metrics (TVL, transactions, volume, unique addresses, etc. Optimism metrics preferred; please link to public sources such as Dune Analytics, etc.):  Relevant Usage Metrics: (TVL, transactions, volume, unique addresses, etc.)  new product – no usage metrics besides 50+ customer interviews We are creating a new market and also tapping into the existing one.  Crypto ATMs, have an average volume is $20k a month; there are 32,000 ATMs in the USA; $640M monthly volume Gift card onboarding using Paxful and Cardcoins is of the order of $500M/month     USA target market size (after, we will go globally)  90k single-owner convenience stores in the USA. 3k monthly revenue per atm $2.17 trillion in circulation in hard cash in the USA We are focusing on MT and WY due to their friendly money transmitter license requirements.   expecting in 2-5 years:  TVL in the USA $180m due to 30 days delay to get cash out of the stores transactions 180k in 24 hours volume $9M   50M unique household addresses  Competitors, peers, or similar projects (please link):  Onramp with a bank account: Coinbase ($100B valuation), FTX ($32B), Upbit ($10B), Kraken ($10B), Square. Cons: require a bank account, and the KYC is too complicated, Gift card and digital payments: Paxful, Localbitcoins, Cardcoins. Cons: high fraud, high fees, and complicated process. Crypto ATMs: Bitcoin depot, Coincoud, Coinflip. Cons: hard to set up, high fees Crypto Vouchers: Azte.co, cryptovoucher. Cons: no money transmitter license Display a bar code in an app: Square, BDCheckout. Cons: only major chains, complicated process.  Is/will this project be open sourced? In Future Optimism native?: No / Maybe Date of deployment/expected deployment on Optimism: 12/01/2022 Ecosystem Value Proposition:  What is the problem statement this proposal hopes to solve for the Optimism ecosystem?  more TVL on optimism Stimulate the development of the collective ecosystem   How does your proposal offer a value proposition solving the above problem?  New users on optimism for a large number of users, Optimism will be the initial chain for crypto Simplification and education of the ecosystem (One of the past recipients of Optimism grant is a wallet [READY] [GF: Phase 1 Proposal] Candide Wallet. Its value for Optimism is similar to the value that we provide. We also create a wallet. Our wallet will store crypto that the customers got in return for hard cash. )   Why will this solution be a source of growth for the Optimism ecosystem?  The transfer of the tokens (to customers in exchange for fiat and within DApps) on Optimism chain will require gas fees. More gas fees – more demand for eth on optimism; therefore, more value on optimism chain. Creating a new market will bring new users Bringing new users to crypto through the optimism ecosystem creates a first-mover advantage for the optimism chain. Given that a lot of these new users are low-tech, their cost of switching to a different chain will be high    Has your project previously applied for an OP grant? If successful, please link to your previous grant proposal and provide a brief update on milestones achieved with the grant. If unsuccessful, and this is a resubmission, please specify how you have incorporated significant changes in accordance with feedback. Number of OP tokens requested: 200,000 Did the project apply for or receive OP tokens through the Foundation Partner Fund?: No If OP tokens were requested from the Foundation Partner Fund, what was the amount?: na How much will your project match in co-incentives? (not required but recommended, when applicable):  None, it’s a new project. We will be applying for other grants already invested over $300K in time we will build a native token along with traditional funding. we plan on raising $2-5m preseed after grants  Proposal for token distribution:  How will the OP tokens be distributed? (please include % allocated to different initiatives such as user rewards/marketing/liquidity mining. Please also include a justification as to why each of these initiatives aligns with the problem statement this proposal is solving.)  10% tech. Alignment (A): building the app  integrating optimism chain and eco-system web2 of the app   20% sales and customer development. A: getting users  getting the products into convenience stores and customer acquisition 20K for onboarding convenience stores (setting up a call center and marketing material) educational workshops and blog posts 80k + 20k for workshops   20% legal. A: complying with regulations  To save on costs, we are starting in WY and MT, where we don’t need money transmitter licenses. We still need to check money business laws and prepare the agreement with the store and the end users.   10% liquidity. A: helps to start the initial liquidity pool to get the app running and increase the throughput.  add initial liquidity due to 30 days collection of USD from the convenience stores   10% rewards. A: incentivizes new users to learn the OP token and the ecosystem since they will have the token.  even though our pricing (1-6%) is already competitive with the atm fees (11-25%), we will reward OP for referrals. Both the referrer and the customer they brought get 5-10% of OPs of the value of the card ($25, $50, and $100).   10% referral incentives. A: efficient growth of the user base   Over what period of time will the tokens be distributed for each initiative? Shorter timelines are preferable to longer timelines. Shorter timelines (on the order of weeks) allow teams to quickly demonstrate achievement of milestones, better facilitating additional grants via subsequent proposals.  6 months   Please list the milestones/KPIs you expect to achieve for each initiative, considering how each relates to incentivizing sustainable usage and liquidity on Optimism. Please keep in mind that progress towards these milestones/KPIs should be trackable.  tech, sales, and legal will make the on-ramp app possible and increase the number of unique users with at least $25 in their account that they would transfer or lock into liquidity. Liquidity – KPI: TVL Rewards – KPI: % of users sending the OP token they got as the reward, converting their on-ramped funds to OP. referral incentives – number of new active users   Why will incentivized users and liquidity on Optimism remain after incentives dry up?  The app will stay and eventually be decentralized users are not tech-friendly, and the cost of switching will be high for them For our target market, learning about these new technologies is challenging. For them, the cost of switching is high. We expect the customers to prefer staying in optimism ecosystem.    ",
                    "links": [
                        "https://twitter.com/kirill_igum",
                        "https://kirilligum.gitlab.io/s4c/5c04xy1u22ld61wz/get",
                        "https://kirilligum.gitlab.io/s4c",
                        "https://www.linkedin.com/in/kirilligum/",
                        "https://www.occ.treas.gov/about/who-we-are/history/1866-1913/1866-1913-bank-of-america.html",
                        "https://kirilligum.gitlab.io/s4c/",
                        "https://ethglobal.com/showcase/zk-kyc-sbt-ozwb2",
                        "https://kirilligum.gitlab.io/s4c/",
                        "https://www.linkedin.com/in/kirilligum/",
                        "https://www.linkedin.com/in/gorsha-sur/",
                        "https://www.linkedin.com/in/alex-alekseyenko-81416323/",
                        "https://ethglobal.com/showcase/zk-kyc-sbt-ozwb2",
                        "http://Azte.co",
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-candide-wallet/2656"
                    ],
                    "GPT-summary": "The post is a proposal for a project called Scratch Crypto, which aims to provide a low-tech onramp for customers to buy and use cryptocurrency. The proposal explains how the project works, the team behind it, and its vision for decentralized consumer banking. The post also includes information on the target market, competitors, and metrics for success. The proposal is open to feedback and questions, and the author is seeking a grant from the Optimism Foundation to fund the project.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Privacy, Security and risk management",
                        "Interoperability and Scaleability",
                        "Community and engagement",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal",
                        "None"
                    ],
                    "Sentiment": 5.274841565979625
                }
            ]
        }
    ],
    "group_index": "253"
}