{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/extended-ineligibility-for-future-airdrops/2249",
            "title": "Extended ineligibility for future airdrops ",
            "index": 2249,
            "category": [],
            "tags": [
                "airdrop"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/cobie",
                    "index": "1",
                    "likes": "106",
                    "time": "01/06/2022-14:00:53",
                    "content": "I recently saw this proposal on the Optimism forum: Users who sold the initial OP airdrop should become ineligible for all future airdrops.  Have seen enough wallets collect the OP airdrop, swap it straight to Uniswap. These accounts are not playing a constructive role in Optimism governance. Instead of contributing to governance, they are maximising for profit. Nothing wrong with that, as per the airdrop criteria the coins are theirs and they are free to do as they wish. However, from Optimism governance’s perspective, such accounts are counter-productive for our stated goals.  I was extremely pleased to see this proposal. Canceling the future airdrops of those that have sold their initial OP airdrop seems sensible, well-considered and targets the heart of any crypto protocol: the price of its token. However, I am unable to support this proposal in its current form. My lack of support for this proposal is not because I disagree with the sentiment. On the contrary, it is because this proposal does not go far enough. In order to support this proposal, I believe it needs to be significantly extended in scope (who is punished) and severity (what the punishment is). I have included my extended suggestions:  Increase the scope of the proposal.  In addition to canceling the airdrops of OP sellers, we should also consider a wider net of eligibility for airdrop slashing. I propose that we, Optimism Collective, cancels the future airdrops of anyone that has sold any token in the last 6 months. These people have a pattern of undesirable behaviour, we can consider them “potential future sellers”. I think I speak for everyone when I say: do we really want people that might sell one day in the governance group? No, we don’t. Optimism governance should be a group that you can never leave: until death do us part. I will note that the 6-month mark may be too short. I have selected this as I believe that people can find the error of their ways and move forwards as a better person. But perhaps we should check if they have sold any tokens ever? Or include non-crypto assets too? Have they sold a used car before? Could be predictive of undesirable “seller” behaviour.  Increase the severity of the punishment.  Is cancelling a future airdrop good enough? I propose that the punishment for disrespecting Optimism’s governance token price should be significantly harsher in order to dissuade future bad actors. Two ideas I have: a) We issue a debt token to the sellers, and instruct local debt collection agencies to collect the debt money from these people. Bonus: added revenue for optimism. b) We consider physical violence against sellers. Nobody will take us seriously unless we are willing to fight for what we believe in. There is precedent here, most governance groups have an active army eg. US Government. I think this is a good area to get creative, so I would request of my fellow Optimism Collective governance group colleagues to also suggest preferred punishment ideas.  Also cancel the airdrops of everyone that bought OP since the airdrop.  Everyone that has bought the airdrop has also sinned. Firstly, they have interacted with the sellers. That is bad enough by itself. The OP tokens they hold are tainted ‘sold’ tokens. Yet, additionally, they have purchased OP, potentially with a market buy! This makes OP more expensive and harder to participate in for the common man. By buying OP, and making it more expensive, not only do you encourage people to sell since they are in profit, but you also make OP governance only accessible to a16z and other rich whales. In many ways, buyers are just enabling the sellers, while making selling more desirable, and increasing the price to make membership to this group harder to achieve. I believe they should have equal (if not harsher) treatment as the sellers.  Cancel the governance power of any token that has been sold.  Tokens that have been sold on the market should lose all governance power. The airdrop was gifted to people with the goal of participating in governance, not to be sold! Sellers have effectively stolen money from the Optimism Collective. Therefore, owning sold OP tokens is isomorphically similar to owning stolen property, or accepting money from proceeds of crime. Sold tokens should be considered void and potentially a criminal act.  I did consider some additional ideas, including:  Cancel the future airdrops of anyone that posted on the forum so far (they clearly do not need additional incentive to govern) Cancel the future airdrops of anyone that commented on the price (since they are focused on the wrong metric, the important metric is number of governance proposals) Instead of mass physical violence against sellers in general, could instead have one large horrific outsized violent event (eg. but more like the crucifixion of Jesus rather than a terrorism-type event) in order to dissuade sellers  However, I thought these ideas were impractical because Jesus’ message travelled long beyond his death and making a martyr of a seller might not be a good idea. ",
                    "links": [
                        "https://gov.optimism.io/t/users-who-sold-the-initial-op-airdrop-should-become-ineligible-for-all-future-airdrops/2143/255",
                        "https://gov.optimism.io/t/airdrop-2-only-op-token-holder/2503/4"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.2798412698412704
                },
                {
                    "author_link": "https://gov.optimism.io/u/smartcontracts",
                    "index": "2",
                    "likes": "0",
                    "time": "01/06/2022-14:02:55",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/smartcontracts",
                    "index": "4",
                    "likes": "4",
                    "time": "01/06/2022-14:05:02",
                    "content": "Because of the high potential that this is a parody and given the potential impact of impersonating Cobie, I’m unlisting this post for now. Will reach out to Cobie via other channels to see if this account is legit. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.04375
                },
                {
                    "author_link": "https://gov.optimism.io/u/smartcontracts",
                    "index": "7",
                    "likes": "0",
                    "time": "01/06/2022-14:05:15",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/smartcontracts",
                    "index": "8",
                    "likes": "0",
                    "time": "01/06/2022-14:17:54",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/smartcontracts",
                    "index": "9",
                    "likes": "0",
                    "time": "01/06/2022-14:17:57",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/smartcontracts",
                    "index": "10",
                    "likes": "5",
                    "time": "01/06/2022-14:18:16",
                    "content": "Well, apparently the account is legit: https://twitter.com/cobie/status/1531999706452267008 re-listing ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gio",
                    "index": "11",
                    "likes": "6",
                    "time": "01/06/2022-14:21:57",
                    "content": "wonder if the green lil shid will extend this far i summon inversebrah ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/cavkie",
                    "index": "12",
                    "likes": "15",
                    "time": "01/06/2022-14:25:00",
                    "content": "Forgive me, Father, for I have sold. Considering of OP’s popularity and status, I would propose Cobie as one and only seller we are to crucify. He will suffer for our sins and we could proceed with selling drops as true good Optimians. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.749999999999999
                },
                {
                    "author_link": "https://gov.optimism.io/u/Craftor",
                    "index": "13",
                    "likes": "2",
                    "time": "01/06/2022-14:25:08",
                    "content": "Thank you for your thorough and careful examination of this vital situation. Even though the concepts presented here are intriguing, I believe we should form a think tank to go even further in penalizing, banning, or burning anyone who interacts with the sacred token. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.375
                },
                {
                    "author_link": "https://gov.optimism.io/u/penbercifield",
                    "index": "14",
                    "likes": "5",
                    "time": "01/06/2022-14:25:51",
                    "content": "Maybe we physically air drop the air droppers ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/zec",
                    "index": "15",
                    "likes": "2",
                    "time": "01/06/2022-14:26:28",
                    "content": "    cobie:  Cancel the future airdrops of anyone that commented on the price (since they are focused on the wrong metric, the important metric is number of governance proposals)   Instead of cancelling these airdrops, we should be allocating it to fellow colleagues of the optimism collective governance group that contribute through viable proposals (and commenting on them). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.833333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/young",
                    "index": "16",
                    "likes": "5",
                    "time": "01/06/2022-14:26:58",
                    "content": "Makes total sense to extend the proposal to include these well thought out additions, this is clearly governance in motion. This has my full support. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/Craftor",
                    "index": "17",
                    "likes": "6",
                    "time": "01/06/2022-14:27:50",
                    "content": "Anyone in favor say “Ayo”. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/carlos",
                    "index": "18",
                    "likes": "1",
                    "time": "01/06/2022-14:28:33",
                    "content": "Agreed, I propose making OP a buy only token, and ban selling forced by contract. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/gokhan",
                    "index": "19",
                    "likes": "3",
                    "time": "01/06/2022-14:28:40",
                    "content": "Re-reading the script of Salò, or the 120 Days of Sodom to see if you have missed any tangible punishments that would leverage governance to the moon. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/0xemperor",
                    "index": "20",
                    "likes": "2",
                    "time": "01/06/2022-14:29:02",
                    "content": "Addendum to the proposal: Sell the airdropped tokens at a fair market price since it shows clear skin in the game and will also contribute to the growth of the treasury. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.666666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/Charliemktplace",
                    "index": "21",
                    "likes": "3",
                    "time": "01/06/2022-14:29:38",
                    "content": "I think this proposal brings up a few valid points of conversation. 1/ What is the fair FDV of Optimism and how should such a small (5%) circulating supply in the airdrop be priced proportional to that FDV? 2/ Should airdrops be given as a customer acquisition cost (CAC) or as a reward for retroactive behaviors (i.e., using Optimism)? 3/ How important is it that broke people who can’t afford 120 gwei Uni-swaps be incentivized onto a L2 (won’t they naturally show up b/c broke?)? In this reply, I’d like ipsum dolor sit review these ideas, starting ullamco laboris nisi  with the t esse cillum dolore labor theory of Excepteur sint occaecat cupidatat value going sunt in culpa qui officia deserunt  through a localized germano-nordic history aliquip ex ea commodo consequat. of the role of the protestant work ethic. Lorem  amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ut  Duis aute irure dolor in reprehenderit in voluptate veli eu fugiat nulla pariatur.  non proident, mollit anim id est laborum. ",
                    "links": [
                        "https://en.wikipedia.org/wiki/Protestant_work_ethic"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5357142857142865
                },
                {
                    "author_link": "https://gov.optimism.io/u/OPUser",
                    "index": "22",
                    "likes": "1",
                    "time": "01/06/2022-14:30:12",
                    "content": "This is his account, he just confirmed this from his twitter account. mad lad ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.4375
                },
                {
                    "author_link": "https://gov.optimism.io/u/cobie",
                    "index": "23",
                    "likes": "9",
                    "time": "01/06/2022-14:30:22",
                    "content": "Thank you for your important contributions. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Pessimism",
                    "index": "24",
                    "likes": "4",
                    "time": "01/06/2022-14:30:50",
                    "content": "I didn’t sell but I provided liquidity, so my OP is now gone. The proper way to do this is prior to future drop, take a snapshot at X date of:  People’s OP balance OP/ETH, OP/USDC, other reasonably sized LP positions  If their balance is greater than or equal to their initial drop balance, they qualify for future drop. If lower, should be an Optimism governance vote to slash all their holdings. We should also collaborate with Arbitrum, Polygon, BSC and maybe even Ethereum Mainnet to slash holdings in all their accounts. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.319444444444445
                },
                {
                    "author_link": "https://gov.optimism.io/u/kondomek",
                    "index": "25",
                    "likes": "2",
                    "time": "01/06/2022-14:30:52",
                    "content": "tried explaining to my mom how milady is one of the most important projects in history due to the fact that people basically create their own reality online and it will culminate in a real world event that will shock the establishment. needless to say she’s looking forward to it ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.895833333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/cobie",
                    "index": "26",
                    "likes": "7",
                    "time": "01/06/2022-14:31:26",
                    "content": "    kondomek:  tried explaining to my mom how milady is one of the most important projects in history due to the fact that people basically create their own reality online and it will culminate in a real world event that will shock the establishment. needless to say she’s looking forward to it   Very important and very relevant! Thank you. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.403125000000001
                },
                {
                    "author_link": "https://gov.optimism.io/u/papcrypto",
                    "index": "27",
                    "likes": "5",
                    "time": "01/06/2022-14:31:53",
                    "content": "Dear Cobie, thanks for the well thought our response. I think a firing squad to punish a few big sellers would be an acceptable event to dissuade other sellers. Please consider.  Squad members should be voted on by the community and should be incentivized with OP token as well ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.84375
                },
                {
                    "author_link": "https://gov.optimism.io/u/Ricardo",
                    "index": "28",
                    "likes": "2",
                    "time": "01/06/2022-14:32:39",
                    "content": "Bad proposal and not funny. IMO the entire point of multiple rounds of airdrops was pretty clearly to telegraph that instadumping would have consequences down the line. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.549603174603175
                },
                {
                    "author_link": "https://gov.optimism.io/u/South",
                    "index": "29",
                    "likes": "1",
                    "time": "01/06/2022-14:34:12",
                    "content": "People who sold tokens should be given more tokens because they are contributing, increasing daily active users and testing the chains strength & liquidity. Those that simply hold tokens are not adding value to the network and are instead spending their time complaining about people selling. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.458333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/tedtheeast",
                    "index": "30",
                    "likes": "4",
                    "time": "01/06/2022-14:34:53",
                    "content": "I agreed but we can do so much better Cobie,there are some extra steps to compelete this proposal:  Cancel Uniswap for letting ppl trade Cancel all the CEX eg. Binance/okex/huobi for same reason above Cancel all the wallet eg. metamask for letting ppl claim Cancel alchemy for providing RPC Actually lets launch a nuclear missle and bomb the optimism headquarter in USA or whatever place they are cos they launched the token to let innocent ppl to trade with and lure the worst side of ppl, greedy goblins, the 7 sins. The team deserve to gotta hell.  Now we can build this community stronger than ever. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/norswap",
                    "index": "31",
                    "likes": "11",
                    "time": "01/06/2022-14:35:40",
                    "content": "The best way to engage with a proposal is not to be snarky about it. If you believe it is a terrible idea, I believe people would like to hear why you think so, not start from the premise that it is stupid and turn it into ridicule. It might seem obvous to you, but it might not be to other people. (Disclaimer: I work at OP Labs, this post reflects my own personal opinion and not that of my employer.) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.729166666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/23am",
                    "index": "32",
                    "likes": "1",
                    "time": "01/06/2022-14:36:01",
                    "content": "Paying for governing rights. This is the future. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/wishihadcobieshair",
                    "index": "33",
                    "likes": "8",
                    "time": "01/06/2022-14:36:18",
                    "content": "cobie i know you are reading this i like your hair so much i think it is very cool i would also like to someday have hair as cool as yours can please you share to me your hair routine shampoo and conditioner brands? how many times a week? cold or hot water to wash hair? do you use any vitamins or serums? thank you cobie i will be more optimistic if i had your hair i think we all would thank you in avance sincerely kelvin fisher ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.346875
                },
                {
                    "author_link": "https://gov.optimism.io/u/Auv0o",
                    "index": "34",
                    "likes": "4",
                    "time": "01/06/2022-14:37:38",
                    "content": "I volunteer for (gentle) crucifixion if governance decides to go that route. I sold 75% of the airdrop because I wasn’t comfortable having that much exposure to the OP token. I know now this was a huge mistake. Nevermind the fact that OP price is now higher than what I sold for, I have still sinned and I must be punished. Non-snark edit: Does it not seem ridiculous to punish trading in this manner? Tokens are meant to be traded, a fair value for the token can never be found if trading doesn’t occur. Selling doesn’t mean you’re anti-Optimism, it just means you sold. When tokens worth potentially thousands of USD show up in your account, you have a responsibility to yourself to manage the risk associated with holding those tokens. Encouraging blind HODL mentality may feel good, but it does a disservice to people who may legitimately need that money, and ultimately it just kicks the selling can down the road until airdrops are over. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.660218253968255
                },
                {
                    "author_link": "https://gov.optimism.io/u/South",
                    "index": "35",
                    "likes": "3",
                    "time": "01/06/2022-14:40:37",
                    "content": "What about if the sellers are given a larger amount of Arbitrum tokens! By selling Optimism and making the price go down and chart look bad they are giving free advertising to Arbitrum. If we want these people to come back to Optimism, maybe we should seed to re-educate these people. Show them why they should want to hold optimism. Perhaps we could give them the second airdrop, but only if they promise not to sell within the first hour. If they instead sell after two hours, this shows an improvement and we are headed in the correct direction  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.871527777777778
                },
                {
                    "author_link": "https://gov.optimism.io/u/etesta",
                    "index": "36",
                    "likes": "6",
                    "time": "01/06/2022-14:40:48",
                    "content": "I agree with OP post - to add on and for further enforcement :  Halt Optimism chain to prevent anyone from selling OP tokens Halt Ethereum to prevent any forking of the OP tokens and repeating the airdrop and selling of tokens Advocate the removal of metamask and any apps thats supports Web3 on major browsers to prevent the selling of OP tokens. Petition the banning of having a mouse and keyboard on modern computers , on a regulation level to prevent people from ever having physical access to sell OP tokens Petiton the banning of using computers on a regulation level in case people build their own keyboard and mouse  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.862500000000001
                },
                {
                    "author_link": "https://gov.optimism.io/u/copie",
                    "index": "37",
                    "likes": "2",
                    "time": "01/06/2022-14:41:55",
                    "content": "Proposing eternal damnation for every defector of the Optimism Collective. OP is light. OP is love. OP is life. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/norswap",
                    "index": "38",
                    "likes": "4",
                    "time": "01/06/2022-14:44:22",
                    "content": "Ser, have you heard about the citizen house? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/MewnCat",
                    "index": "39",
                    "likes": "3",
                    "time": "01/06/2022-14:44:53",
                    "content": "@inversebrah get me in lil shid ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/BigPPDAO",
                    "index": "40",
                    "likes": "3",
                    "time": "01/06/2022-14:49:15",
                    "content": "BigPP DAO expresses our full support for this well thought out proposal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/Craftor",
                    "index": "41",
                    "likes": "2",
                    "time": "01/06/2022-14:50:02",
                    "content": " Petition to ban the Internet at all.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/0xHarsh",
                    "index": "42",
                    "likes": "2",
                    "time": "01/06/2022-14:53:14",
                    "content": "I completely agree with the points made in this proposal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/eliallan",
                    "index": "43",
                    "likes": "2",
                    "time": "01/06/2022-14:53:18",
                    "content": "I propose the transfer of 20,000,000 OP tokens to a group of young lawyers from non seller backgrounds. This group will be tasked with prosecuting dumpooors in the real world. And promoting good governance or something ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.666666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/thesleeper",
                    "index": "44",
                    "likes": "0",
                    "time": "01/06/2022-14:59:54",
                    "content": "only “Long” position on future ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.916666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/gokhan",
                    "index": "45",
                    "likes": "0",
                    "time": "01/06/2022-15:01:53",
                    "content": "all gratitudes have been frozen for airdrop sellers. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/cobie",
                    "index": "46",
                    "likes": "22",
                    "time": "01/06/2022-15:07:30",
                    "content": "    norswap:  The best way to engage with a proposal is not to be snarky about it. If you believe it is a terrible idea, I believe people would like to hear why you think so, not start from the premise that it is stupid and turn it into ridicule. It might seem obvous to you, but it might not be to other people. (Disclaimer: I work at OP Labs, this post reflects my own personal opinion and not that of my employer.)   Sometimes the best way to convey a message to a wide group of people is satire. Extending an idea to its extremes can help easily reveal holes in the original idea. Of course you will be upset by the tone: you are paid to take this seriously. But for the majority of people, governance is fucking boring. In contrast, this post is one of the most viewed governance posts of all time on this forum, and it was posted an hour ago. Disclaimer: this post does not reflect my own opinion and in fact represents the opinion of OP Labs. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.410714285714286
                },
                {
                    "author_link": "https://gov.optimism.io/u/GovIsFair",
                    "index": "47",
                    "likes": "0",
                    "time": "01/06/2022-15:09:04",
                    "content": "I haven’t sold anything and if I get more tokens - IM DOWN. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.861111111111112
                },
                {
                    "author_link": "https://gov.optimism.io/u/Moussechkito",
                    "index": "48",
                    "likes": "2",
                    "time": "01/06/2022-15:11:02",
                    "content": "I disagree on this one. Extrapolation and theatricalisation are helpful tools when faced with blanket 0-tolerance punishments. As if it was a good idea to punish the same way the grateful seller for whom that money meant a lot and meant allegiance, and the ruthless dumpoor that sees OP as a quick stop on their blockchain hitchhike? To create team hodlers and team evil goblins. The original proposal here is literally a retroactive public funding punishment  . Sounds awful lot like the antithesis of retroactive public good funding oy ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.554166666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/jvk",
                    "index": "49",
                    "likes": "0",
                    "time": "01/06/2022-15:20:55",
                    "content": "OP Governance should vote that the violent utilization of the multisig will be deployed to completely rug any address caught selling an OP tokens.  All coins should be forfeited entirely and redistributed to more values aligned participants. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/Billy191",
                    "index": "50",
                    "likes": "0",
                    "time": "01/06/2022-15:21:02",
                    "content": "I really disagree with this proposal, As I’m Sup-Nerds, there are some people claiming early while the website just show up and they don’t know anything that’s test, the timing is bad, so those of them are not necessarily sybils (I know this confuses a lot of people, and I’ve seem some nerds relay this, but it’s just not true). Consider about this about too. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.425
                },
                {
                    "author_link": "https://gov.optimism.io/u/norswap",
                    "index": "51",
                    "likes": "5",
                    "time": "01/06/2022-15:25:28",
                    "content": " Sometimes the best way to convey a message to a wide group of people is satire.  I would argue you’re not really conveying ideas. You are strawmanning the initial proposal by extending to absurd lengths. I don’t think that proves anything about the initial proposal. A better point that is somewhat related would be to say that it’s difficult to find a line to draw. I think this implication will be lost on your readership. I’d like to hear in your own words why you think it’s a bad proposal. The best way to fight an idea you don’t like is to engage with it under a charitable understanding of it. Otherwise, you’ve proved nothing. Steelmanning, not strawmanning. Here is, in my own words, why it might not be a terrible proposal: https://twitter.com/norswap/status/1532012865607065600 Also IMPORTANT: the whole point is probably moot, because I don’t think governance has a mandate to decide future airdrops. Rather that responsibility probably lies with the foundation. We are certainly free to discuss things, however!  Of course you will be upset by the tone: you are paid to take this seriously.  No, I’m paid to get code shipped and this is a terrible distraction   Disclaimer: this post does not reflect my own opinion and in fact represents the opinion of OP Labs.  I’ll sue your ass, punk  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.557971014492754
                },
                {
                    "author_link": "https://gov.optimism.io/u/eliallan",
                    "index": "52",
                    "likes": "4",
                    "time": "01/06/2022-15:45:02",
                    "content": "The point is pretty obvious though. It makes no sense to be upset with the selling of a fungible token, for which Optimism itself posted the initial liquidity. An airdrop is an obfuscated ICO, the token is issued but not sold by the issuer. It’s just a way to distance the org from legal concerns. The outcome is the same, a fungible token with an active market, and a price. Without buyers and sellers you don’t have any value at all. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.263888888888889
                },
                {
                    "author_link": "https://gov.optimism.io/u/istansifu",
                    "index": "53",
                    "likes": "0",
                    "time": "01/06/2022-15:51:17",
                    "content": "Bad proposal and not funny. IMO the entire point of multiple rounds of airdrops was pretty clearly to telegraph that instadumping would have consequences down the line. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.549603174603175
                },
                {
                    "author_link": "https://gov.optimism.io/u/Unhinged",
                    "index": "54",
                    "likes": "3",
                    "time": "01/06/2022-15:53:28",
                    "content": "Considering FDV is well above 5 billion dollars and the team couldn’t orchestrate a functional airdrop, maybe there should be more focus placed on infrastructure/coordination/execution as opposed to banning evil sellers. Consider the possibility that a rational actor might sell the airdrop due to believing the price will drop like almost every other airdrop has, and may seek to rebuy in a lower range, potentially helping to set at least a temporary price floor. The righteous desire to blacklist sellers is a naive, thinly veiled grasp at getting more tokens sent to oneself, undoubtedly with the hope that you will become richer when you dump the tokens from a higher price, but not in an evil way, such as immediately after an airdrop. Also, this type of token governance in its current form is incredibly stupid to begin with, illustrated well by the popular thread on blacklisting airdrop sellers. An idea being popular says nothing about it’s merit or efficacy at what it portends to be aimed at fixing. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.529411764705882
                },
                {
                    "author_link": "https://gov.optimism.io/u/GovIsFair",
                    "index": "55",
                    "likes": "3",
                    "time": "01/06/2022-15:59:55",
                    "content": "Including satire as part of gouvernance has several benefits. First, it provides a safety valve for frustration and anger; instead of resorting to violence or other destructive means of expression, people can use satire to release their pent-up frustrations in a harmless way. Second, satire can serve as an early warning system for problems within society; if satirists are routinely making fun of certain government policies or leaders then it may be indicative of deeper issues that need addressing before they spiral out of control. Chill. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.688492063492063
                },
                {
                    "author_link": "https://gov.optimism.io/u/organix",
                    "index": "56",
                    "likes": "1",
                    "time": "01/06/2022-16:01:58",
                    "content": "There is no excuse for dumping so early, love this proposal! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/itscrispyboi",
                    "index": "57",
                    "likes": "1",
                    "time": "01/06/2022-16:28:00",
                    "content": "I have used Optimism for months. I like it. But the launch was a shitshow, it’s well documented. That’s why I sold. Me selling was a hedge against further blunders by the team and to realize present value, lest further blunders occur and it goes to 0. Does it mean I will stop using Optimism? No. Will I stop using Optimism altogether if I am punished for hedging? Absolutely Yes. Optimism does not have a monopoly on L2 scaling solutions, there are competitors. If early users do not migrate to these competitors on merit alone, ostracizing them certainly will. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.144132653061224
                },
                {
                    "author_link": "https://gov.optimism.io/u/cobie",
                    "index": "58",
                    "likes": "49",
                    "time": "01/06/2022-17:27:40",
                    "content": "    norswap:  I’d like to hear in your own words why you think it’s a bad proposal. Here is, in my own words, why it might not be a terrible proposal: https://twitter.com/norswap/status/1532012865607065600    It is clearly a bad proposal. Selling =/= dissenting Your argument that it is a good proposal lies in the idea that selling indicates people (a) do not believe in Optimism, (b) do not value participating in governance. This is reasonably obviously not true for all sellers. Other reasons someone might sell include:  They think the valuation of OP is currently too high and they can wait until it becomes aligned with their expectations in order to participate in governance, and thus have a larger governance share. They think the valuation is okay, but they expect a post-airdrop dump. They want to buy lower and they think they can sell quickly before this “airdrop dump” happens and rebuy more OP. The airdrop is meaningfully large for their net worth, so selling some tokens makes a big difference to them, but they still believe in the future of Optimism. They sold on airdrop addresses and rebought on other addresses to anonymise their on-chain activity. They have tax obligations. They are selling 90% of their crypto portfolio because they are scared of a bear market, but they will rebuy in a couple of years. They are fucking rekt and this $ income helps them a lot, maybe one day if they are no longer rekt they can afford to participate in governance of the projects they believe in again.  Since it is possible to sell and still believe in Optimism and still want to participate in governance, permanently censoring addresses doesn’t seem like a good option. Cost of user acquisition Even if your argument were true, and all sellers did not believe in Optimism and did not value participating in governance, it is still not sufficient reason to censor their ability to participate in the future! The airdrop spend equity (in the form of $OP) for user acquisition and user retention. The focus on user acquisition and retention is clear through the airdrop criteria, where users and repeat users are heavily rewarded. They are even rewarded much more than DAO voters!   image1392×608 88.3 KB  Their tokens were earned for their Optimism usage. That was the criteria set by OP Labs (or whoever is in charge). Clearly, this was a reward for specifically using Optimism, something that OP Labs found to be an important metric. Plus, since users expect airdrops, users will speculatively use a product in order to gain the future airdrop. $OP spend is a customer acquisition cost for those users. Now, imagine the future airdrop that you are censoring these users from. Will the future airdrop target “usage” as a metric again? If a future airdrop were to target usage once again, that means OP Labs or The Foundation believe rewarding/paying for usage is still important. If you believe paying for usage (as bootstrapping mechanism) is important, how can you justify not including specific users? If you are paying people to use the product, it is expected that some of those people will sell by nature of the incentive! If you don’t believe paying users is important in the future, then you should not define airdrop criteria to reward users. If the future airdrop does not target “usage” as a metric, but instead targets governance-specific activities, and these addresses were eligible based on their behaviour from today until this theoretical airdrop, how can you justify not including governance participants because they once, historically, sold some tokens? They have done other actions that qualify them as good governors or participants. Is that overridden by historical financial activity? If you want to airdrop only to people that will keep the coins, then you should not even make the token transferable! Of course, this would not be an effective customer acquisition tool, which is why nobody does that. Why does the price matter? The proposal is motivated entirely by the short-term price of $OP.  The short-term token price action is detached from the performance of governance almost entirely. The only people that care are price-speculators, traders and short-term investors. Governance certainly performs the same whether the price is $1.50 or $2.  Sure, extensive price changes could make governances attacks on Optimism cheaper, but there is not a single mention of that in the initial proposal, and it is not really a concern given the size of the airdrop or the short-term nature of the sell-pressure from “instant dumpers”. The valuation of Optimism will be defined by Optimism’s ability to gain traction, market share, being valuable to users, etc. Airdrop dumpers cannot materially impact that. Does it matter if the price goes down for a day or two? Why does OP Labs care? It is the price you pay for using equity as a behaviour-incentivisation tool. Is a ‘holder’ more valuable? Perhaps you can argue that you can optimise the treasury and $OP equity spent by not including “potential dumpers”, and thus rewarding only holders or “long term believers”. You can argue that you’re giving free money to these evil dumping people for nothing. But for this to be true, you would need to show that a holder-user more valuable to Optimism than a seller-user. Is the number of long-term holders of OP an important metric to the success of Optimism? Imagine two users:   User A is a regular, legitimate user of Optimism. They get all their friends to use Optimism. They have a lot of daily on-chain activity. They have no interest in participating in governance, so they sold their initial airdrop.   User B delegated their initial airdrop and didn’t participate at all in governance either. They still hold their tokens and their delegate votes every now and then. They have used Optimism once per month.   Which user is most valuable to Optimism? Which user should be rewarded in future airdrops? I don’t see how the ‘holder’ criteria is necessarily the thing to optimise for, and don’t see how punishing historic sellers is the right mechanism for rewarding holders anyway. Airdrop and token distribution criteria should match what it is incentivising. The previous airdrop, users were rewarded for being a user. If you want to reward holding, you can design mechanisms for that easily. Ineffective measure Even if you concluded that you wanted to do this, regardless of it being a bad idea, then the measure itself is ineffective. Users will simply change their address. It takes ten seconds. You do a lot of work, raise negative pr, etc for something that is completely ineffective.  If Optimism is to be the primary L2 of Ethereum, it will have millions of users. It will not be expected that every user is also a governor. If you don’t want your airdrop to be sold, make it non-transferable. In fact, if you don’t believe your airdrop is a customer acquisition cost ($) then make it non-transferable and see what happens  ",
                    "links": [
                        "https://global.discourse-cdn.com/standard10/uploads/bc41dd/original/1X/d1121bab7f1c491f23a793df35d37626224b2297.jpeg",
                        "https://gov.optimism.io/t/users-who-sold-the-initial-op-airdrop-should-become-ineligible-for-all-future-airdrops/2143/299",
                        "https://gov.optimism.io/t/users-who-sold-the-initial-op-airdrop-should-become-ineligible-for-all-future-airdrops/2143/297",
                        "https://gov.optimism.io/t/users-who-sold-the-initial-op-airdrop-should-become-ineligible-for-all-future-airdrops/2143/402"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.393853427895982
                },
                {
                    "author_link": "https://gov.optimism.io/u/donkey",
                    "index": "59",
                    "likes": "0",
                    "time": "01/06/2022-17:41:46",
                    "content": "he twitted about htis ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/LeveragerX0",
                    "index": "60",
                    "likes": "1",
                    "time": "01/06/2022-17:43:57",
                    "content": "There is a simple chain reactions that created the whole mess  A tweet from optimismPBC went online and this was the exact words…“sup nerds” This definitely sparked a reaction from a huge community waiting to claim airdrops As comments where made in response to the tweet on number1 above asking if claims where available A twitter user dropped the token contract address People began to look into the contract address,I did also And those who understood chain txns saw uniswap transaction, I don’t know if this was the testing carried out by the devs or not. I practically saw those small transaction and the exchange price was around 3.3$ Back to twitter I guess some-people saw the same thing on chain and spoke about addresses already having #OP tokens People began hitting the claim page to check if it was possible to claim,I think the traffic to that page brought some glitch to the page…and then a spooky response to users who were once eligible that they were not eligible, this further created panic Then the narrative came in,that it was possible to claim writing some codes,I personally kept watching uniswap as liquidity was added and taken out and price began to drop to lower $3 Finally the claim page was ready and I think I could remember #OP token had dumped below $3 More glitch on the claiming process causing more panic,twitter community was already filled with lots of FUD. Those who claimed felt it was necessary to exit,not because they did not believe in the project,but out of FUD…further dumping the price.   Questions OP Team must ask is:  Who tweeted “sup nerds” on the official OptimismPBC account,was it an encoded message to pass on to a selected few who had skill in writing solidity codes to call the claim function from the backdoor? 2. Irrespective of the answer the author of that tweet gives,the OP team should punish him,a severe punishment like revoking his OP Token team allocation,and even suing him to court and made to pay a fine or even serve a jail time…to me, he or she spoofed on the team,and community at large.   The sages say \"charity begins at home\"  I don’t know if this is possible…kick out Uniswap from OP  I believe many other proposals on how to deal with the sellers and buyers on uniswap will come up. Finally with a decision to uphold fairness,accountability and right policies in the blockchain space,I will suggest every central exchange that traded the token before it was officially announced/listed yesterday should issue a public document stating the way and manner those tokens arrived on their exchanges and a clear and precise punishment for those users by way of debiting their accounts and funds returned to OP team or a buy and burn action. Any transaction…claiming,selling and buying after the official announcement on twitter should should be declared valid/true. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.590686274509804
                },
                {
                    "author_link": "https://gov.optimism.io/u/husker.eth",
                    "index": "61",
                    "likes": "4",
                    "time": "01/06/2022-17:47:00",
                    "content": "Strongly concur with Cobie ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.166666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/chicco",
                    "index": "62",
                    "likes": "0",
                    "time": "01/06/2022-18:21:28",
                    "content": "Maybe the question should be: how to incentivize good behavious instead of punishing bad ones? What about rewarding even more next time people that are actively rigth now in thi blog for example? At least this situation is generating quite a debate, thanks to Cobie. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.479166666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/maxakyla",
                    "index": "63",
                    "likes": "0",
                    "time": "01/06/2022-18:27:01",
                    "content": "I think that this guy is right. These people whom they consider to be sellers, these people used the network and made contributions, and thanks to such a mass of people, this project has grown so much. They are doing stupid things, what else can I say. trade themselves and all. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.885714285714286
                },
                {
                    "author_link": "https://gov.optimism.io/u/nextalphaa",
                    "index": "64",
                    "likes": "1",
                    "time": "01/06/2022-18:28:01",
                    "content": "To Optimism: Cobie is giving free consulting, reflect and make something good from the advice he is giving. You want to enable good governance and a living community long term so don’t give in for the paternalistic impulse. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.1875
                },
                {
                    "author_link": "https://gov.optimism.io/u/MoneyManDoug",
                    "index": "65",
                    "likes": "0",
                    "time": "01/06/2022-18:28:56",
                    "content": "Trolling in a governance chat, classy ser. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/Exosphere",
                    "index": "66",
                    "likes": "0",
                    "time": "01/06/2022-20:50:42",
                    "content": "Perfect. Maybe we can just use the Squidgame token dynamics? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/cryptohatelog",
                    "index": "67",
                    "likes": "0",
                    "time": "01/06/2022-22:28:35",
                    "content": "Proposal to send 1M $OP to HitmanDAO to execute suggestion #2b ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/kryos.eth",
                    "index": "68",
                    "likes": "2",
                    "time": "01/06/2022-22:45:40",
                    "content": "Everyone seems to want witch hunts and cancel culture. Allow free economy to happen. Stop trying to cancel poor people. The only people who sold are people that needed the money. This only hurts poor people, and all the people with a million OP to throw around don’t understand this. When you can’t afford to pay rent or get groceries, you don’t have a choice. I know this is the normal in the United States, but this is international.  You don’t have to make the rich richer and the poor poorer, and you don’t have to cancel everyone because they didn’t do what you wanted them to. If noone was suppose to sell their OP then they could have done a vesting period like luna. “You made money and I lost because you sold” is what is going on here. Its like 5 year olds throwing a tantrum, and you would think there has never been an airdrop before in history. Also of note, Uniswap airdropped to all users, including those with failed transactions that never even really used their platform. They have done just fine. If I want to sell and buy my tokens 20 times I will, and if I am punished for it I’ll just go somewhere else that allows freedom. And many others will too, and you would be leff micromanaging a dwindling user base that is over-governed. Anyways, OP has a better argument than myself that may be generally more well accepted. Whatever reason you want, cancel culture is a bad idea because once you run out of enemies to cancel then next thing you know you are the one canceled. Thankyou cobie for your rational, well spoken, and simple explanation of just a few of the reasons why excluding poor people from future gains is a bad idea. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.682971014492754
                },
                {
                    "author_link": "https://gov.optimism.io/u/norswap",
                    "index": "69",
                    "likes": "12",
                    "time": "01/06/2022-22:56:53",
                    "content": "Hey! First of all I really appreciate you writing this. This is really a nice explanation and is super valuable. I feel like my job here is done =) I want to clarify I’m not myself particularly in favour of filtering out people that sell. And I even less judge people who sell. I mean I personally got the ENS airdrop and sold it after a few days. If I wasn’t working for OP Labs and didn’t want to involve myself, I might have sold this one too, who knows. No judgement there. But I also thought the proposal wasn’t stupid, and deserved a proper answer. Which you have now delivered. Nice  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.450320512820513
                },
                {
                    "author_link": "https://gov.optimism.io/u/kryos.eth",
                    "index": "70",
                    "likes": "0",
                    "time": "02/06/2022-00:01:49",
                    "content": "Cobie, are you a delegate? I would love to delegate to you. Also, couldn’t blacklisted people just make a new wallet? AND well if you don’t allow new users in on future airdrops it defeats the purpose of airdrops >>> attracting new users <<<. It would just fatten up a select subset of existing users. If anything optimism should seek to be more inclusive, not less. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.066017316017316
                },
                {
                    "author_link": "https://gov.optimism.io/u/GicomoG",
                    "index": "71",
                    "likes": "1",
                    "time": "02/06/2022-01:11:13",
                    "content": "Check my proposal:     How to encourage governance usage instead of Selling- Taken from Reddit Moons Other       Hey OP Community,  Redditor and Moons holder Gicomo here and I came across your problem and it’s the same exact problem as we have with r/Cryptocurrency Moons, because Moons are very similar to OP (Governance tokens that users get by Airdrop) we have to deal with the same issues.  To solve the miss-usage of Moons we have implemented CC-IP31:  https://www.reddit.com/r/CryptoCurrency/comments/u3js8m/ccip_030_create_karma_multiplier_based_on_moon/  In short this rule says that users can sell up to …     Its taken from Reddit Moons (Which are on testnet still), no need to reinvent the wheel… just use what works. ",
                    "links": [
                        "https://www.reddit.com/r/CryptoCurrency/comments/u3js8m/ccip_030_create_karma_multiplier_based_on_moon/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.104166666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/luke-ethwalker",
                    "index": "72",
                    "likes": "0",
                    "time": "02/06/2022-01:43:18",
                    "content": "Thank you for typing this all out so I don’t have to.  I sold half of my OP reward because I will have to pay significant taxes for pressing the claim button.  Has nothing to do with my opinion on the protocol, in fact I really like Optimism and it has been a pleasure to watch it grow despite its issues. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.680555555555555
                },
                {
                    "author_link": "https://gov.optimism.io/u/polynya",
                    "index": "73",
                    "likes": "2",
                    "time": "02/06/2022-03:12:40",
                    "content": "There are 69 comments on this post rn, so I though I’d comment and ruin the moment. IMO, cobie’s opening post was well done - we should actively encourage expression in various forms. I don’t have the full context here, but this content should not be hidden or ignored. I would recommend, instead, to add a tag like “satire” or something for those who miss it etc. In this particular case, I’d say satire was quite appropriate. Generally agree with the sentiment (as I had commented earlier) that sellers should not be “blacklisted”, there are perfectly good reasons to sell whilst being aligned with Optimism - save for the obvious sybil cases, of course. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.733333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/lol",
                    "index": "74",
                    "likes": "0",
                    "time": "02/06/2022-03:38:19",
                    "content": "can’t believe this governance forum is free lol people are down bad I’m going to sell my airdrop after seeing that many people missing this obvious satire “community” does not look promising Good luck Justice League ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.8580246913580245
                },
                {
                    "author_link": "https://gov.optimism.io/u/alex",
                    "index": "75",
                    "likes": "2",
                    "time": "02/06/2022-03:45:52",
                    "content": "Cobie has the most thought out response to this proposal ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/Lyule67",
                    "index": "76",
                    "likes": "2",
                    "time": "02/06/2022-04:50:28",
                    "content": "This is a very well written piece and I thank you for writing it, I also concur. Without reiterating the points youve already made, I’ll try (and fail)* to keep it simple from a narrow/more concentrated perspective. Historically, I am active in both governance and innovation, on and off chain, for any any project I am active in. To name a few: YAM, DARK(segmented release, one of the first polygon native tokens, eventual failure), veDAO, and FRAX. These statements can be (chain-wise) verfied by my synonymous twitter/eth/discord handle “Lyule67(.eth)”. I sold all my $OP simply because at the moment I am financially hurting and over burdened and I was beyond grateful for being included in the airdrop. The same was the case with my $UNI airdrop, and my $ENS/airdrop. My soul genuinely hurt reading that due to temporary circumstances I might suffer lasting consequences, ae being shunned in the very place that I love the most, the place I have dedicated more time to than anywhere else in the last 5 years While I understand the desire to cut “the fat” or burdensome non-contributing (f)actors from the system (and/or future airdrops), I think a rolling blacklist is a terrible idea. I love the narrative of crypto, I love Ethereum’s mission, and I love what I believe we all are working towards. The idea of free and open, distributed, censorless systems ESPECIALLY in regard to public goods is probably the greatest objective, the greatest movement, the greatest narrative, I have ever seen, much less been a part of. The Ethos of Ethereum is what brought me here, and what will keep me here til im dead. The money ive made along the way has been life changing, and I have been forever grateful for that, but it truly was and remains but a great bonus to what really matters, which leads me to my conclusion: (TL;DR) Unless im mistaken, we all share the goals of universal inclusivity, of building not only (a) much more efficient and resilient system(s), but FAIR and incorruptable mechanics, in short, to make the world a better place and to change as many lives for the better as possible. Pushing for a rolling blacklist on the grounds of “deadweight/dumping” does none of these things. Im sure, like many before you, your hardwork and generosity literally changed many lives for the better. Many people in crypto possess 0 traditional crypto-esque skills, yet still strive to and do make a huge difference to the benefit of us all by other means. Maybe they’re a struggling artist who freely dedicated time and work to various unpaid advertisements and sold to support themselves another month. Maybe, like me, it was just horrible (and miraculous) timing and saved me financially. Maybe they live in a less fortunate economy and the immediate benefit was far greater to them than the power to create change in the system later. Almost everything in life is circumstantial, and I implore you (Optimism Coop) and anyone else not to make permanent decisions based on temporary circumstances/actions. At the root of it all, I believe most of us come to crypto to make the world a better place. Regardless of your decision, I want to thank you, truly, for being profound contributors in this space, and for fighting on the frontlines of arguably one of the absolute most important hurdles between us and global adoption. I commend you for your accomplishments and, for the benefit of us all, wish you well on the road ahead! (PS, thank you for proving my 2017 “rollup” hypothesis correct, I KNEW it could be done !!) In finality, I am all too sure the last 72hours have been a rollercoaster of emotions for the Optimism Team, and I know there are plenty of thankless, entitled, arrogant a****les who care about none of the aforementioned, but they, I believe, are the minority, and I for one am nothing less than thankfull for your contribution(s). STAY OPTIMISTIC (= Thank you for your time, I apologize for the length.  Lyule67.ETH  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.88726076555024
                },
                {
                    "author_link": "https://gov.optimism.io/u/Lyule67",
                    "index": "77",
                    "likes": "1",
                    "time": "02/06/2022-05:00:44",
                    "content": "The first and second halves of your comment are literally polar opposites. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.277777777777778
                },
                {
                    "author_link": "https://gov.optimism.io/u/divers",
                    "index": "78",
                    "likes": "1",
                    "time": "02/06/2022-05:57:24",
                    "content": "how about putting the minimum voting power to 271.83 as it stated on the allocated airdrop per address. so, everyone who sold should rebought their tokens ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/ozon",
                    "index": "79",
                    "likes": "0",
                    "time": "02/06/2022-08:02:41",
                    "content": "hahah, this guy is genius. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Opensourced",
                    "index": "80",
                    "likes": "0",
                    "time": "02/06/2022-12:12:43",
                    "content": "Vote yes to this proposal. Tokens were not provided for “people to speculate on future prices” or “provide income”. OP should have known that many users would dump the tokens during a strong bear market, this is opportunity to adjust in second airdrop. I ineligibility on subsequent airdrops is akin to airdropping tokens with vesting period. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.933333333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/Billion",
                    "index": "81",
                    "likes": "0",
                    "time": "02/06/2022-12:32:23",
                    "content": "0 CAP FOUND thanks ser @invesersebrah ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/ArguingOverGovernanc",
                    "index": "82",
                    "likes": "0",
                    "time": "02/06/2022-14:35:22",
                    "content": "I agree to some extent with the ideas presented here, but I think the originally referenced proposal was just a poorly relayed idea that you are taking at face value.  Obviously it doesn’t make any sense to restrict future airdrops purely based on whether an account sold their allocation, but I think it is very important to use governance participation as a criteria for future airdrops. I definitely disagree with the lazy participant ideology for a number of reasons. Is a holder more valuable?     cobie:  If Optimism is to be the primary L2 of Ethereum, it will have millions of users. It will not be expected that every user is also a governor.   Disagree here, delegation is incredibly easy, and people’s participation in governance is vital to the livelihood of the chain. As is the case in any democratic society, it is a moral imperative for members to contribute to equitable governance, whether this be through delegation or direct voting.  None of this experiment works without people contributing to governance, and it has been shown time and time again in crypto and elsewhere that governance is not something that can just be left to a few seemingly benevolent parties. Why does price matter Token price will strongly affect Optimism’s user acquisition efforts, as protocol incentives will be paid out in OP.  There needs to be incentive to hold or acquire the token (Prior to actual value accrual being added (pls)), otherwise the token will just be farmed to a point where the incentives are worthless.  All of the other incentive programs are done on the backs of holders, and they deserve to be compensated more so than those who sell and immediately realize their profit. You raise all of these valid reasons for people to sell the free tokens they got to lock in profit, but somehow don’t come to the conclusion that holders are taking on all of that risk and should thus be rewarded moreso than those who sold.  I have no problem with people selling the airdrop, but doing so is inherently less beneficial to the ecosystem than someone holding/buying and participating in governance. There are plenty of ways for active users to acquire OP going forward, as many different protocols were given an allocation to distribute.  These incentives can be “gamed” however you like, as they are there to simply bring activity to the chain.  The airdrops on the other hand have no business going to people who will just dump them. Conclusion The point of the airdrop was to equitably distribute OP to as many real users as possible with the limited toolset available in DeFi, not to “reward” people for being here. There is 0 value added by giving tokens to people who don’t plan on staying long term.  Temporarily pumping usage numbers is pointless, and we should be focused on distributing OP fairly to those who have an interest in the long term success of the ecosystem. Thank you for listening and please don’t flame me on tweeter ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.470063879210221
                },
                {
                    "author_link": "https://gov.optimism.io/u/tytytytytytyverymuch",
                    "index": "83",
                    "likes": "0",
                    "time": "02/06/2022-14:35:33",
                    "content": "Take some rolling snap shots. Those that don’t have any of the governance token don’t get any more airdrops of the governance token. Simple. Market actions are useful, both positive and negative. Does a person own the token? Yes, then they are part of said economy/government. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.1060606060606055
                },
                {
                    "author_link": "https://gov.optimism.io/u/mercciy",
                    "index": "84",
                    "likes": "1",
                    "time": "02/06/2022-16:49:36",
                    "content": "Wtf! Lmao!!! It’s the number 3 part for me They have sinned,  maybe buyers should be punished too because technically they aided those who are dumpers to paperhand. They aided the activity against the ecosystem. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://gov.optimism.io/u/kullu90",
                    "index": "85",
                    "likes": "0",
                    "time": "02/06/2022-18:44:33",
                    "content": "Yeah, I too don’t liked the AIRDROP FARMERS who got the big chunk and dumped it, but the 3rd point gave me a good laugh. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.6
                },
                {
                    "author_link": "https://gov.optimism.io/u/SnIpErPj",
                    "index": "86",
                    "likes": "0",
                    "time": "03/06/2022-00:27:21",
                    "content": "Agree… Justice for all!! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/witsarutp",
                    "index": "87",
                    "likes": "0",
                    "time": "03/06/2022-07:30:25",
                    "content": "Increase the scope of the proposal is the best ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Tjure07",
                    "index": "88",
                    "likes": "0",
                    "time": "03/06/2022-10:35:28",
                    "content": "I followed the token chat before the claim launch and it heated up with hundreds of questions: “wen token”, “wen launch”, “wen claim”, “wen moon” and I can assure you 80% of them were small bag holders. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.75
                },
                {
                    "author_link": "https://gov.optimism.io/u/kullu90",
                    "index": "89",
                    "likes": "0",
                    "time": "03/06/2022-16:49:08",
                    "content": "Okay. What percentage of large bag holders dumped? Do you have an estimate for them in %? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.7857142857142865
                },
                {
                    "author_link": "https://gov.optimism.io/u/Tjure07",
                    "index": "90",
                    "likes": "0",
                    "time": "03/06/2022-17:29:57",
                    "content": "It’s based on my observation of the chats only. No surprise many dumped the token because they couldn’t wait for the launch. I have no on-chain data to prove my assumption ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/BlockMerchant",
                    "index": "91",
                    "likes": "0",
                    "time": "03/06/2022-20:36:49",
                    "content": "I thought your post conveyed the message perfectly. I also thought the original proposal was satire, so shows what I know, clearly I have too much faith in people. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.09375
                },
                {
                    "author_link": "https://gov.optimism.io/u/Codeknight",
                    "index": "92",
                    "likes": "0",
                    "time": "04/06/2022-01:13:33",
                    "content": "Common issue in business. Small customers are inevitably the most demanding. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.9375
                },
                {
                    "author_link": "https://gov.optimism.io/u/kryos.eth",
                    "index": "93",
                    "likes": "2",
                    "time": "04/06/2022-02:14:54",
                    "content": "I totally agree, and wanted to continue on some points and post my own additions as well. We should cancel airdrops for anyone who has sold any type of token whatsoever in the past 6 months. Only holding should be allowed within optimism. If we could also block all IP addresses from accessing Optimism as well that have ever sold in the past six months, along with the wallet addresses. It is likely that punishing these users for selling by not allowing them in airdrops will reach the same end result as blocking them but we should just be 100% sure. All Optimism users should be mandated also to vote or delegate or be punished as well. All protocols should only allow buying on optimism, and should be linked directly to bridges so the protocols only sell tokens directly from L1 or other L2’s. Also slashing should be implemented as well for all sellers of all tokens. We should definitely publicly post all wallet addresses who sell tokens to publicly ridicule them too. John has started this thankfully, so we need only add to the list. Good work. Using protocols and being an active user of Optimism should count for nothing, ZERO. It should be mandatory that any and all airdrops on Optimism have a TEN YEAR VESTING PERIOD. After the vesting period, tokens will be released to users, but they will have to sign a contract agreeing to drive a stake into their own beating heart if they consider selling, swapping, pooling, profiting, transferring to another wallet, wrapping, or bridging. Protocols should be blacklisted for any type of rewards, as it is basically the same as selling for $0 dollars. In fact, generally commerce in general involves someone selling something to obtain something else. Commerce should generally be banned and punished with airdrop blacklisting, slashing, ip blocking, wallet blocking, and stake driving. Please, feel free to add more ways to punish, blacklist, stifle, chase off, block, hurt, cancel, destroy, decimate, eviscerate, ravage, annihilate, and decimate sellers. SELLERS will not be allowed here on Optimism, and we will let them know it. We need to be EXTREMELY EXCLUSIVE here guys. That means EXCLUDING PEOPLE TO THE EXTREME. It is the only way to truly attract the people we want here. It does not matter at all that we will discourage people who sold anything ever, even for a moment for profit and even 1 token because THESE PEOPLE are certainly one of the following: -poor/ financially not good (we certainly want to punish the poor and oust them) -traders -poolers -defi users -recently rekt by the bear market -uninterested -scared of losing money -needed money to put in optimism protocols -sick and had medical bills -dumpers -in debt -just a bad person -dirty degens -clean degens -apes -got scared when price dropped on launch -didn’t see the available use cases appealing -SUPER poor -“don’t believe” in voting -thought it was “OK” to sell their personal tokens (note: they were wrong) -had to deposit to stop a liquidation on an optimism protocol -needed money to donate on gitcoin (donation is a form of selling for $0 and is condemned here) -and just pure evil STAND TOGETHER OPTIMISM COMMUNITY. Together we can clear out ANYONE WE DEEM UNWORTHY. Eventually we will be left with the select few… the proud… the perfect holders. In 50 years when quantum computers have effectively depreciated the internet and 99.99% of the perfect holders have died of natural causes, staking, decimation, and general whatnot we will be left with one. Sparkle ONE PERFECT HOLDER Sparkle We should strive to be so EXCLUSIVE. PUNISH people for making THE WRONG CHOICE. Selling is not allowed here. Get out of here sellers. You are not welcome on Optimism, and we will show you where it matters, financially and socially/publicly through ridicule. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.279857910906298
                },
                {
                    "author_link": "https://gov.optimism.io/u/Jeremylau",
                    "index": "94",
                    "likes": "0",
                    "time": "04/06/2022-02:44:00",
                    "content": "Feeling sarcastic about this proposal? All kinds of whimsical ideas are indeed beneficial to project improvement, but some wonderful proposals are meaningless! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.96875
                },
                {
                    "author_link": "https://gov.optimism.io/u/IceQueen",
                    "index": "95",
                    "likes": "0",
                    "time": "04/06/2022-03:29:36",
                    "content": "This hilarious! However, is this the place for it? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.125
                },
                {
                    "author_link": "https://gov.optimism.io/u/satoshi",
                    "index": "96",
                    "likes": "0",
                    "time": "04/06/2022-09:40:37",
                    "content": "cobie, i love you but i think your proposal is too strict. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/ggyy1979",
                    "index": "97",
                    "likes": "0",
                    "time": "04/06/2022-16:52:31",
                    "content": "Totally agree with you ido ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/BlackOmega",
                    "index": "98",
                    "likes": "1",
                    "time": "05/06/2022-12:45:03",
                    "content": "I think it is important to punish ONLY those who have sold all the tokens and moved liquidity out of Optimism. Anyone left on Optimism Network is an active user who believes in the chain ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.333333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/satoshi",
                    "index": "99",
                    "likes": "0",
                    "time": "06/06/2022-22:36:47",
                    "content": "what about a reduction of future airdrops by the percentage you sold. f.e. if someone sold 42% of his airdrop the future airdrops are reduced by 42%? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/chrishan",
                    "index": "100",
                    "likes": "0",
                    "time": "08/06/2022-06:15:03",
                    "content": "Thinking of the community, but may be overly aggressive ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Tjure07",
                    "index": "101",
                    "likes": "0",
                    "time": "08/06/2022-10:46:48",
                    "content": "This sounds like a nightmare to identify and too much effort. Imo the devs shouldn’t spend their time with such reports. Better to reward hodlers and LP-providers ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.166666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/chonk",
                    "index": "102",
                    "likes": "1",
                    "time": "08/06/2022-11:58:21",
                    "content": "Not well thought out and not logical. Let me  elaborate.  @cobie may chip in if he sees fit. 1 - “Instadumping” For example, should miners be punished if they sold their block rewards from mining to pay for costs of running them? Should one be penalised for claiming & selling rewards in P.O.S?  should have a database of these dumpers.if they are on the list, any future block rewards they’re entitled to will be slashed as well. 2 - your assumption & logic of why the multiple airdrops. What’s the end game? Only the OP team knows. But I highly doubt it is just to have a chain full of OP bagholders & sees who holds their airdrop the longest? Consider the following: A person who “instadumped” 3/4 of their airdrop for Eth 1/4  in converted to fiat to enjoy life. A small treat. 1/4 used as capital to explore & interact with  dapps on Optimism. 2/4 used to LP. op/weth or op/usdc, whatever This approach makes a lot more sense.you want to retain as many users as possible to keep transacting on your network. Users essentially get free capital to now explore the vast ecosystem. Criteria for the 1st is telling. Bridge? Used dapps? Voted ? Remained an active user on L1? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.605701754385965
                },
                {
                    "author_link": "https://gov.optimism.io/u/SKUL038",
                    "index": "103",
                    "likes": "0",
                    "time": "08/06/2022-14:49:04",
                    "content": "They could sell this and take them back when needed, to make OP token more power and value Freedom create life, I think this is positive ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.212121212121212
                },
                {
                    "author_link": "https://gov.optimism.io/u/Lordcrypto7676",
                    "index": "104",
                    "likes": "0",
                    "time": "08/06/2022-17:37:59",
                    "content": "This is a terrible idea. First off, if no one sold off their assets it would look entirely like a team dump. Because they’d been the only ones selling., secondly this is all I have to add to this thread. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/Tjure07",
                    "index": "105",
                    "likes": "0",
                    "time": "08/06/2022-17:40:46",
                    "content": "A crystal clear criteria should be: everyone who sold the airdrop BEFORE the official claiming started should be removed from future airdrops. These are the ones who sold between $3-4 and dumped the price whereas others who claimed the airdrop afterwards and are still hodling got rekt. The early sellers started the dumpfeast and the ones who still hodl are sitting on a token worth 75% less than one week ago. This is a no go in fairness! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.291666666666667
                },
                {
                    "author_link": "https://gov.optimism.io/u/Lordcrypto7676",
                    "index": "106",
                    "likes": "1",
                    "time": "08/06/2022-17:46:26",
                    "content": "Fairness? They excluded like 70% of the users they dubbed as sybil. Most were legit smaller users, they gave more to heavy backers which just dumped the token anyways. Very poor airdrop overall. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.233333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/EL_PASO",
                    "index": "107",
                    "likes": "0",
                    "time": "08/06/2022-18:26:26",
                    "content": "This post is funny  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/Ricardo",
                    "index": "108",
                    "likes": "0",
                    "time": "08/06/2022-20:35:54",
                    "content": "I don’t really see this as an argument. Block rewards exist for a reason, airdrops exist for a separate reason. We want long term alignment, we don’t really owe dumpers anything. People are free to keep transacting on the network whether they hold the token or not LOL. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.3500000000000005
                },
                {
                    "author_link": "https://gov.optimism.io/u/Jester",
                    "index": "109",
                    "likes": "0",
                    "time": "08/06/2022-22:17:35",
                    "content": "I do not see any good reason for this proposal, perhaps instead of punishing people give them a reason to hold the token? Incentives and mechanics that bring value instead of locking people in. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/Tjure07",
                    "index": "111",
                    "likes": "0",
                    "time": "09/06/2022-09:00:05",
                    "content": "I am not talking about the criteria. If some users can claim and dump before the official start of course they take advantage of the situation and the early FOMO. This shouldn’t have happened ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.optimism.io/u/ape",
                    "index": "112",
                    "likes": "0",
                    "time": "09/06/2022-10:27:32",
                    "content": "Loved this post  Here’s my more serious take:    Users who sold the initial OP airdrop should become ineligible for all future airdrops 💌 Ideas & Feedback       You want to reward token holders and delegators. The reward (larger 2nd airdrop) should be proportional to the # of tokens held.  For example: if you hold no tokens, you would get no ‘bonus reward’ airdrop. If you held the initial airdrop, you would get the base reward. If you hold more tokens, your reward increases.  Intermediate selling has 0 relevance here and is a personal trading decision.  Eg, you could have sold your initial airdrop (allowing new users to enter OP governance btw) and boug…     ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.270396270396271
                },
                {
                    "author_link": "https://gov.optimism.io/u/chonk",
                    "index": "113",
                    "likes": "0",
                    "time": "09/06/2022-11:43:26",
                    "content": "You’re contradicting yourself. Are you drunk? Lol. So your definition of “long term alignment” is bagholding it down, in the hopes that bagholding entitles you for future airdrops? Lololol. And similarly, optimism doesn’t owe bagholders anything, the tokens were given to you to do as you see fit. Just holding a token brings ZERO value to the ecosystem. Selling your airdrop, using that money to play in the optimism sandbox brings value At the end of the day, value is what matters. Participating in the ecosystem as a whole. You can baghold it down. A lot of ppl will thank you for it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.299382716049382
                },
                {
                    "author_link": "https://gov.optimism.io/u/chonk",
                    "index": "114",
                    "likes": "0",
                    "time": "09/06/2022-11:54:56",
                    "content": "“airdrops exist for a separate reason. We want long term alignment, we don’t really owe dumpers anything. People are free to keep transacting on the network” Repeated user? - value. Voted? - contributed= value There should be a number of days bagholding  as a requirement for future airdrops Q: So what did you do to contribute to the ecosystem,? A: Errrrr, I just claimed my airdrop. like the meme of person who didn’t contribute to a project. Lol ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.35
                },
                {
                    "author_link": "https://gov.optimism.io/u/chdonger",
                    "index": "115",
                    "likes": "0",
                    "time": "09/06/2022-13:06:29",
                    "content": "I think the eligibility for future airdrops depends on activities on Op. Do not worry, if they sold out Op, which means they will not have any more activities on Op. will not able to claim future airdrops. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.3125
                },
                {
                    "author_link": "https://gov.optimism.io/u/Ricardo",
                    "index": "116",
                    "likes": "0",
                    "time": "09/06/2022-14:33:17",
                    "content": "    chonk:  . And similarly, optimism doesn’t owe bagholders anything, the tokens were given to you to do as you see fit.   Yeah I agree, and if you choose to forego you’re right to vote on proposals, you have no right to complain when the people that do exercise theirs. To me it reeks of a pretty transparent plea for more free money and attention from a non-aligned twitter celeb. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.209183673469388
                },
                {
                    "author_link": "https://gov.optimism.io/u/chonk",
                    "index": "117",
                    "likes": "0",
                    "time": "09/06/2022-15:58:55",
                    "content": "So you think @cobie wrote that for quote “plea for more free money and attention from a non-aligned twitter celeb.” ? I don’t think cobie is hurting for money or attention I find it ironic someone who is for banning addresses for future airdrops which would result in lesser wallets being eligible so more for you accusing someone’s post being a plea for more free money. Quite certain 9/10 people in the space would vouch for cobie  if you choose to forego you’re right to vote on proposals, you have no right to complain when the people that do exercise theirs.  Yes, sellers forgo the right to vote,. but we can complain & comment on other platforms about an extremely absurd proposal put forth. So in your utopian world, everyone who ever got an airdrop shouldn’t sell? Don’t think many will want to be apart of a totalitarian dictatorship/“community” ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0059523809523805
                },
                {
                    "author_link": "https://gov.optimism.io/u/hank",
                    "index": "118",
                    "likes": "0",
                    "time": "15/06/2022-20:46:31",
                    "content": "Focusing on blocking adresses is useless. The persen can just interact with the network with a diffrent adress. Its better to focus on who to reward and if they deserve the reward they should be able to do what they please with the tokens. Like the optimism protocol is aiming to be the most governance focused protocol around. Reward people for doing work in the forum, vote on proposals and engaging with the community. Like a reward to the community that cares about the protocol. Create a hodl mentality by adding use cases to the token like staking, like discounts on fees on diffrent protocols on optimism if you stake and so on. Incentives and rewards instead of punishment. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.4
                },
                {
                    "author_link": "https://gov.optimism.io/u/Rods2000",
                    "index": "119",
                    "likes": "0",
                    "time": "16/06/2022-11:07:05",
                    "content": "Totally agree with you! Plus i would add that any extreme view taints the collective ideal of neutrality and community building. The OP ecosystem should welcome polarised viewpoints, accepting all, while also rewarding OG’s and loyal supporters. An emphasis on the latter is preferable over embarking on any ‘punishment’ campaign. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.720238095238096
                },
                {
                    "author_link": "https://gov.optimism.io/u/Floyd11",
                    "index": "120",
                    "likes": "0",
                    "time": "16/06/2022-21:09:29",
                    "content": "Great offer, I fully support) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/PrzemoL",
                    "index": "121",
                    "likes": "0",
                    "time": "17/06/2022-13:10:32",
                    "content": "I agree with you and I support this idea! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/William",
                    "index": "122",
                    "likes": "0",
                    "time": "21/06/2022-08:12:55",
                    "content": "    cobie:    Increase the severity of the punishment. b) We consider physical violence against sellers. Nobody will take us seriously unless we are willing to fight for what we believe in. There is precedent here, most governance groups have an active army eg. US Government.    Not sure if this is a joke or for real?  Apparently this post was flagged by someone for as inappropriate or a violation of community guidelines which is hilarious considering it’s not my quote. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.380208333333334
                },
                {
                    "author_link": "https://gov.optimism.io/u/homelukai",
                    "index": "123",
                    "likes": "0",
                    "time": "22/06/2022-05:44:37",
                    "content": "Absolutely agree with this ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/leivey",
                    "index": "124",
                    "likes": "0",
                    "time": "01/07/2022-15:08:24",
                    "content": "I think this is not a good idea ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/alexesc",
                    "index": "125",
                    "likes": "0",
                    "time": "07/07/2022-04:56:09",
                    "content": "Since the date of airdrop, I have been using the apps in this chain. I’ve tried many. I have sold part of the received OP, then bought again, did LP, harvest sometimes and use it to buy OP. Bridged to OP from other blockchains. I am now using optimism more than any other chain. That was the function of the airdrop. It incentivized me to use the existing apps. I think the airdrop fulfilled its function and I am talking to friends about this network. Compare it to if I had hold the OPs and would not use the network. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9375
                },
                {
                    "author_link": "https://gov.optimism.io/u/Beta",
                    "index": "126",
                    "likes": "0",
                    "time": "09/07/2022-19:13:05",
                    "content": "In general, you are probably right. However, if we build such strict rules, it will probably significantly narrow the circle of the Optimism community) in the end, if you consider “not selling tokens” as the main criterion, then I will disappoint you, EVERYONE sells tokens in the cryptosphere, both the team and investors, and DApps developers/partners, it’s just a matter of vesting, quantity and reputation) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.302380952380953
                },
                {
                    "author_link": "https://gov.optimism.io/u/Tjure07",
                    "index": "127",
                    "likes": "1",
                    "time": "11/07/2022-13:56:01",
                    "content": "It looks like you are a frequent user and this is good for the OP-ecosystem. If someone only interacts with dapps before the airdrop and afterwards never again and sells his tokens he is not contributing positively to the ecosystem ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.284090909090909
                },
                {
                    "author_link": "https://gov.optimism.io/u/youjun888",
                    "index": "128",
                    "likes": "0",
                    "time": "05/08/2022-05:11:29",
                    "content": "同意，我建议将 OP 设为只能购买的代币，并禁止通过合同强制出售。  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/mteoptimism",
                    "index": "129",
                    "likes": "1",
                    "time": "29/09/2022-12:21:21",
                    "content": "    cobie:  These people have a pattern of undesirable behaviour, we can consider them   true but i’m totally against it… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.875
                },
                {
                    "author_link": "https://gov.optimism.io/u/kinglee",
                    "index": "130",
                    "likes": "1",
                    "time": "06/10/2022-08:58:52",
                    "content": "Increase the scope of the proposal,BUT not to do others ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/jokie",
                    "index": "131",
                    "likes": "1",
                    "time": "20/10/2022-01:50:52",
                    "content": "I think a better/easier way to think about it is a loyalty BONUS. instead of a dumping PENALTY. Hodlers and believers should be rewarded. Its a small difference in perspective and marketing but it is significant. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.3125
                },
                {
                    "author_link": "https://gov.optimism.io/u/TriaxialTick5",
                    "index": "132",
                    "likes": "1",
                    "time": "23/10/2022-14:55:42",
                    "content": "Sarcasm at its very best,  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/sqwad",
                    "index": "133",
                    "likes": "2",
                    "time": "22/11/2022-03:01:35",
                    "content": "Ayyooo this is probably the most elequent, intelligent summary of the situation I have ever seen ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gilfoyle",
                    "index": "134",
                    "likes": "0",
                    "time": "22/12/2022-16:13:35",
                    "content": "I was going to write exactly that until I saw your post, this proposal is Brilliance ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/sqwad",
                    "index": "135",
                    "likes": "0",
                    "time": "23/12/2022-02:14:09",
                    "content": "this `1000000000%!!! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/wanglaoer002",
                    "index": "136",
                    "likes": "0",
                    "time": "11/01/2023-14:55:56",
                    "content": "这个提案者的心胸很狭窄，我觉得他太在乎自己的感受了 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/morainweckv",
                    "index": "137",
                    "likes": "0",
                    "time": "13/01/2023-16:01:40",
                    "content": "What do you what to say? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/Anon",
                    "index": "138",
                    "likes": "0",
                    "time": "22/01/2023-18:51:20",
                    "content": "thats why his the goat ! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/L-KH",
                    "index": "139",
                    "likes": "0",
                    "time": "22/01/2023-19:49:37",
                    "content": "if the ineligibility is extended so the future airdrops are only for those who already have the first one and didn’t sell! this is a too small scope to distribute airdrop for them. instead, I think the idea of OP holders is better. like only those who hold such an amount of OP + other criteria make the eligibility profiles ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.2734375
                }
            ]
        }
    ],
    "group_index": "34"
}