{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/draft-gf-phase-1-proposal-clique/4980",
            "title": "[DRAFT][GF: Phase 1 Proposal] Clique ",
            "index": 4980,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Grants Council"
            ],
            "tags": [
                "season-3",
                "cycle-10",
                "passed"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/kvny2046",
                    "index": "1",
                    "likes": "2",
                    "time": "01/02/2023-03:51:04",
                    "content": "Project name: Clique Author name and contact info (please provide a reliable point of contact for the project): Kevin Yu / tg @kvnyu24 / Twitter @kvny2046 I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: Yes I understand that I will be expected to following the public grant reporting requirements outlined here: Yes L2 recipient address: 0xeF43993D36145a74ED34bc17656789A28a7c60C7 Which Voting Cycle are you applying for?: Cycle 10 Which sub-committee should review your proposal? (Builders Grants, Growth Experiment Grants): Builders Grants Project description (please explain how your project works): Clique builds a new type of primitives, identity oracles, that bring web2 user behavior and identity data on-chain. It serves two primary goals: establishing more robust reputation and identity systems on-chain, and bridging the gap between value-creating activities in web2 and incentive distribution layers in web3. We use advanced cryptographic tools like ZKP, TEE, and MPC to design modular privacy-preserving pipelines with custom trust assumptions. Website: https://www.clique.social/ Twitter: https://twitter.com/Clique2046 Discord/Discourse/Community: Clique Other relevant links (including any demos): https://2046-inc.gitbook.io/clique-documentation/ Additional team member info (please link):  Kevin: https://twitter.com/kvny2046 / https://www.linkedin.com/in/kevin-yu-4b3650191/  Jaden: https://twitter.com/Jaden2046 / https://www.linkedin.com/in/jaden-yan-898b65188/  Han: https://www.linkedin.com/in/han-wu-23b05a28/?originalSubdomain=uk  Wentao: DCMMC (Wentao Xiao) · GitHub  Oliver: https://twitter.com/0xEillo  Tom: nanjingboy (Tom Huang) · GitHub   Please link to any previous projects the team has meaningfully contributed to: We were mostly working in traditional industries before Clique. Kevin was a math/cs student at Duke and serial entrepreneur in industries like healthcare/RE, Jaden was the founder of a video production company, Han used to work at Citi/BH before starting an asset management firm. Relevant usage metrics (TVL, transactions, volume, unique addresses, etc. Optimism metrics preferred; please link to public sources such as Dune Analytics, etc.): Clique has an overall 80k+ unique users. In particular, there are about 40k users on Optimism who have made their attestations through Clique. Links at  Contract Address 0xD34A8775D06D41b36054d59EF2d09a79B7aa1FA2 | Optimism Optimism Attestation Review | graham | Flipside Orbiter  Competitors, peers, or similar projects (please link):  Peers on zk-based credentials: https://www.sismo.io/  Peers on on-chain credentials: https://galxe.com/   Is/will this project be open-sourced?: In the Future. Optimism native?: Yes, OP is the first chain on which we’ve deployed our attestor contracts. Date of deployment/expected deployment on Optimism: 1/3/2023 What is the problem statement this proposal hopes to solve for the Optimism ecosystem?: We are trying to solve the following problems for the OP ecosystem:  Lack of credible user reputation and identity system on-chain.  On-chain Sybil resistance is hard to achieve in incentive distribution and governance.  Lack of reputation limits usecases in SocialFi (contributions, engagement, etc.), GameFi (gamer ranking), NFT (influence), and DeFi (undercollateralized lending, credit scores) applications.  Lack of precise incentive distribution for tokens, NFTs, rights to governance, etc.  Incentives are often given out indifferently to users who have completed certain on-chain behaviors, which can be easily automated & botted. This creates huge upfront costs for the project (token sell pressure) and can be deemed as wasted marketing + growth budgets.  How does your proposal offer a value proposition solving the above problem?: We have introduced a new primitive — identity oracles — that focuses on verifying the provenance of off-chain user behavior & identity data and bringing them into different decentralized data vehicles. These vehicles include oracle subscription contracts, SBTs, DIDs/VCs, evolving NFT and many more. On top of the oracles themselves, we’ve designed a modular privacy layer to support user anonymity, data confidentiality, as well as full privacy & integrity of operations. This is supported by a composition of zero-knowledge proofs, trusted execution environments, and multi-party computation.  We have already integrated Clique Attestor with the OP AttestationStation contract. Right now, users can make attestations for their social media data like engagement, influence, and contributions to the OP community through our attestor contract. We are launching the following features  Anonymous data attestations based on zk set-membership proofs  Confidential data attestations based on zk range proofs  Fully decentralized & private attestation process with TEEs  Pipeline support of gaming data (LOL, Dota, CSGO, etc.), content platform data(YouTube, Instagram, Spotify, etc.), and KYC data (Jumio, Sumsub, Plaid, etc.).  Why will this solution be a source of growth for the Optimism ecosystem?: We believe that identity infrastructure is a core building block of a booming OP application layer, and that identity oracles will be among the most important of such infra. This is due to the current lack of robust purely on-chain user behavior and identity data. As more and more of this data goes on-chain, composable reputation systems can be built to power different dApps, in turn generating network effects for attestation usage. Currently, there are over 35k users of the Clique OP Attestor 3 weeks after launch. PoolTogether, among other OP dApps, is starting to develop further usecases on top of these attestations. Our most recent launch of the OP zk-attestor has 7.5k+ unique users in less than a week. Has your project previously applied for an OP grant?: No. Number of OP tokens requested: 25,000 Did the project apply for or receive OP tokens through the Foundation Partner Fund?: No If OP tokens were requested from the Foundation Partner Fund, what was the amount?: 25,000 How much will your project match in co-incentives? (not required but recommended, when applicable): Currently no plans How will the OP tokens be distributed? (please include % allocated to different initiatives such as user rewards/marketing/liquidity mining. Please also include a justification as to why each of these initiatives align with the problem statement this proposal is solving.): a) The usage of the Clique OP attestor by end users (50%). This includes the reimbursement of gas fees through a relayer contract, prize pool contracts that can be claimed proportionally for usage, etc. This is supposed to incentivize more end users to put a diverse array of their identity and behavior data on OP, including social, gaming, KYC, and financial data, with different privacy-preserving assumptions. b) The usage of created OP attestations by other developers (50%). This includes setting up a prize pool for developers to claim based on the usage of user attestations within their protocols. This is supposed to incentivize developers to unlock more usecases such as on-chain reputation systems, Sybil-resistant governance, undercollateralized lending, etc. Over what period of time will the tokens be distributed for each initiative? Shorter timelines are preferable to longer timelines. Shorter timelines (on the order of weeks) allow teams to quickly demonstrate achievement of milestones, better facilitating additional grants via subsequent proposals: The incentives will be distributed through smart contracts in the next 3-12 months. The distribution curve won’t be linear, but would rather be proportional to contract usage. Ideally, the distribution would be finished in 6 months. No received funds will be used for marketing. Please clearly define the milestones you expect to achieve in order to receive milestone-based installments. Please consider how each milestone relates to incentivizing sustainable usage and liquidity on Optimism. Progress towards each milestone must be trackable:  Benchmark Milestones  We will reach 50k users by the end of March (5% incentive given out). We will reach 75k users by the end of May (10% incentive given out). We will reach 100k users by the end of July (15% incentive given out). We will reach 150k+ users by the end of September (15% incentive given out). We will integrate with 5 OP projects by end of March (those who consistently use our attestations in various ways, 5% incentive given out). We will integrate with 15 OP projects by end of May (10% incentive given out). We will integrate with 30 OP projects by end of July (15% incentive given out). We will integrate with 50 OP projects by end of September (15% incentive given out).   Critical Milestones  We will deploy a zk attestor based on zk set-membership proofs for user anonymity by end of February (Done since proposal submission). We will deploy a zk attestor based on zk range proofs for data confidentiality by end of March. We will deploy a TEE-based environment for zkp generation by mid-April. We will deploy a more diverse set of social oracles (30+ pipelines from 3-5 different platforms) by end of April. We will deploy a set of on-chain (cross-chain) data attestors by end of April. We will deploy our gaming oracles on OP by end of May. We will deploy our KYC oracles on OP by end of June.    Why will incentivized users and liquidity on Optimism remain after incentives dry up?: Because the created attestations can be used to construct composable on-chain reputation systems and unlock more usecases for different dApp developers. As long as more and more projects adopt such attestations, then the users will keep creating them. Please provide any additional information that will facilitate accountability (smart contracts addresses relevant to the proposal, relevant organizational wallet addresses, etc.): IssuerV1: Contract Address 0xD34A8775D06D41b36054d59EF2d09a79B7aa1FA2 | Optimism Issuer V2: Contract Address 0x33413c433DD28c5e0a90cbA7B0A6f98D3AB971fb | Optimism Dune Dashboard: attestation-station Orbiter Research Stats: Orbiter Confirm you have read and agree to the Eligibility Restrictions (here): I have read the Eligibility Restrictions and agree to abide by their conditions ",
                    "links": [
                        "https://www.clique.social/",
                        "https://twitter.com/Clique2046",
                        "https://discord.com/invite/nADagttQBq",
                        "https://2046-inc.gitbook.io/clique-documentation/",
                        "https://twitter.com/kvny2046",
                        "https://www.linkedin.com/in/kevin-yu-4b3650191/",
                        "https://twitter.com/Jaden2046",
                        "https://www.linkedin.com/in/jaden-yan-898b65188/",
                        "https://www.linkedin.com/in/han-wu-23b05a28/?originalSubdomain=uk",
                        "https://github.com/DCMMC",
                        "https://twitter.com/0xEillo",
                        "https://github.com/nanjingboy",
                        "https://optimistic.etherscan.io/address/0xD34A8775D06D41b36054d59EF2d09a79B7aa1FA2",
                        "https://next.flipsidecrypto.xyz/graham/optimism-attestation-review-2Zo33e",
                        "https://www.orbiter.finance/data?rollup_tab=optimism",
                        "https://www.sismo.io/",
                        "https://galxe.com/",
                        "https://optimistic.etherscan.io/address/0xD34A8775D06D41b36054d59EF2d09a79B7aa1FA2",
                        "https://optimistic.etherscan.io/address/0x33413c433DD28c5e0a90cbA7B0A6f98D3AB971fb",
                        "https://dune.com/clique/attestation-station",
                        "https://www.orbiter.finance/data?rollup_tab=optimism",
                        "https://gov.optimism.io/t/grant-proposal-template/3233",
                        "https://gov.optimism.io/t/cycle-10-final-grants-roundup/5418",
                        "https://gov.optimism.io/t/cycle-10-grant-review-roundup/5284",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-attestation-station-interface/4827/19"
                    ],
                    "GPT-summary": "The post is a draft proposal for a project called Clique, which aims to build identity oracles that bring web2 user behavior and identity data on-chain. The proposal explains how the project works, the problems it aims to solve, and how it offers a value proposition to the Optimism ecosystem. The post also includes relevant links, team member information, and usage metrics. A third party could give entirely positive feedback on the proposal, extend to the proposal, or ask questions about it.",
                    "GPT-proposal-categories": [
                        "Identity and reputation systems",
                        "Grants, Funding and resource allocation",
                        "Interoperability and Scaleability",
                        "Smart contract updates",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.846746687655778
                },
                {
                    "author_link": "https://gov.optimism.io/u/kvny2046",
                    "index": "2",
                    "likes": "2",
                    "time": "06/02/2023-05:40:47",
                    "content": "Hi, this is Kevin from Clique. Upon reviewing the AMA information here Notion – The all-in-one workspace for your notes, tasks, wikis, and databases., we want to confirm that we are aware of the 1 year lockup period for the builders’ grant and will abide the no-sale rule. To modify the distribution schedule of the relevant tokens, the entire received grant will be used to incentivize the following a) The usage of the Clique OP attestor by end users (50%). This includes the reimbursement of gas fees through a relayer contract, prize pool contracts that can be claimed proportionally for usage, etc. This is supposed to incentivize more end users to put a diverse array of their identity and behavior data on OP, including social, gaming, KYC, and financial data, with different privacy-preserving assumptions. b) The usage of created OP attestations by other developers (50%). This includes setting up a prize pool for developers to claim based on the usage of user attestations within their protocols. This is supposed to incentivize developers to unlock more usecases such as on-chain reputation systems, Sybil-resistant governance, undercollateralized lending, etc. The incentives will be distributed through smart contracts in the next 3-12 months. The distribution curve won’t be linear, but would rather be proportional to contract usage. Ideally, the distribution would be finished in 6 months. A major difference from the previous distribution schedule is that no received funds will be used for marketing. @lavande It would be helpful if I could have control over the post to edit this directly! Appreciate the efforts. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.792191876750701
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "3",
                    "likes": "2",
                    "time": "23/02/2023-17:47:22",
                    "content": "Hey @kvny2046 wanted to direct you to a new piece Milestone Assessment . Aligning your milestones with these guidelines is not mandatory for cycle 10, but you can get a better score on the final review if you do implement it. These are intended to provide some more concrete tracking of this work. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 6.155303030303029
                },
                {
                    "author_link": "https://gov.optimism.io/u/kvny2046",
                    "index": "5",
                    "likes": "2",
                    "time": "24/02/2023-06:29:55",
                    "content": "Updated the milestone report as required! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/jackanorak",
                    "index": "6",
                    "likes": "1",
                    "time": "27/02/2023-20:07:45",
                    "content": "quick q - how does this differ from flipside’s offerings? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.666666666666666
                },
                {
                    "author_link": "https://gov.optimism.io/u/kvny2046",
                    "index": "7",
                    "likes": "1",
                    "time": "27/02/2023-23:37:22",
                    "content": "I think Flipside is more like Dune Analytics, where they are building dashboards & API endpoints for on-chain data. We focus on attesting for off-chain & cross-chain user identity & behavior data (hence we need the privacy stack w. zk/TEE/MPC), and designing different on-chain data vehicles & reputation systems based on this data. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.optimism.io/u/lavande",
                    "index": "8",
                    "likes": "2",
                    "time": "05/03/2023-19:30:16",
                    "content": "Hi @kvny2046! Can you provide a Telegram handle or other contact method so the Optimism team can get in touch about paying out this grant! Feel free to DM or email lavande@optimism.io ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.609375
                }
            ]
        }
    ],
    "group_index": "477"
}