{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.optimism.io/t/draft-gf-phase-1-proposal-dforce/5004",
            "title": "[DRAFT][GF: Phase 1 Proposal] dForce ",
            "index": 5004,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Grant Proposals",
                "Grants Council"
            ],
            "tags": [
                "cycle-10",
                "not-passed"
            ],
            "content": [
                {
                    "author_link": "https://gov.optimism.io/u/MGGYY",
                    "index": "1",
                    "likes": "2",
                    "time": "01/02/2023-15:34:43",
                    "content": "Project name: dForce Author name and contact info (please provide a reliable point of contact for the project): Margaret (TG: @MGGYY) I understand that I will be required to provide additional KYC information to the Optimism Foundation to receive this grant: Yes I understand that I will be expected to following the public grant reporting requirements outlined here: Yes L2 recipient address: 0x69C1a51711B061E5935c648beb16e349898B17dF Which Voting Cycle are you applying for?: Cycle 10 Which sub-committee should review your proposal? (Builders Grants, Growth Experiment Grants): Growth Experiment Grants Project description (please explain how your project works): dForce is a complete set of DeFi protocols covering assets, lending, and trading, serving as DeFi infrastructure in Web3. dForce is on Ethereum, Arbitrum, Optimism, BSC, Polygon, Avalanche, and KAVA currently.dForce DAO is a community-driven project, with major protocol changes driven by the community and jointly decided by dForce token (DF) holders through governance voting via Snapshot. Community members can participate in all governance related discussions on our forum. dForce is backed by a world-class investor consortium including Multicoin Capital, CMBI and Huobi Capital.  Website: https://dforce.network/ Twitter: https://twitter.com/dForcenet Discord/Discourse/Community: Telegram: Contact @dforcenet Other relevant links (including any demos): Forum: https://forum.dforce.network/ Additional team member info (please link): N/A Please link to any previous projects the team has meaningfully contributed to: N/A Relevant usage metrics (TVL, transactions, volume, unique addresses, etc. Optimism metrics preferred; please link to public sources such as Dune Analytics, etc.): dForce recorded a TVL of $19m on Optimism (dForce Dapp). We also support lending and borrowing of $OP on dForce Lending. dForce is currently the largest ETH LSD lending market on Optimism, as well as the 4th largest holder of $wstETH on Optimism (Wrapped liquid staked Ether 2.0 (wstETH) Token Tracker | Optimism). We received a $LDO grant from Lido Finance to incentivize lending activities around $wstETH and $USX (Snapshot).dForce stablecoin USX achieved a market cap of $16.9m on Optimism with 201 addresses and 14.5k transactions on Optimism (dForce USD (USX) Token Tracker | Optimism). dForce is also #9 holder of $USDT and #12 holder of $USDC on Optimism. Competitors, peers, or similar projects (please link): N/A - dForce is a decentralized lending protocol featuring a built-in stablecoin protocol, namely USX, which can be minted through: 1) interest-bearing collaterals supplied to dForce Lending; 2) collaterals (i.e., Curve LP token) supplied to dForce Vault (sitting in separate pools with customized parameters to safeguard against any potential risks); 3) 1:1 swap between USX and USDC, DAI, USDT, BUSD on different networks. dForce Trade is a cross-chain DEX aggregator which enables the bridging of USX from other blockchains to Optimism at minimized cost (users only need to pay gas fees associated).  Is/will this project be open sourced?: Yes Optimism native?: No Date of deployment/expected deployment on Optimism: 12/7/2021 What is the problem statement this proposal hopes to solve for the Optimism ecosystem?: dForce aims to help Optimism develop into the default layer2 network. With a full suite of DeFi primitives (lending, decentralized stablecoin, bridge, trade aggregators), dForce can help Optimism strengthen its leading position across layer2 networks. dForce has witnessed explosive growth on Optimism since the launch of liquidity mining in June 2022. However, in order to further integrate dForce into the Optimism DeFi ecosystem, we will need to collaborate with more protocols (preferably protocols implementing multi-chain strategy so that we can onboard more users from other networks) to facilitate faster growth of both TVL and users. How does your proposal offer a value proposition solving the above problem?: dForce offers a general lending protocol, decentralized stablecoin, bridge, and trade aggregator. Users of dForce lending and stablecoin USX will be incentivized to lock value on Optimism, including but not limited to providing liquidity for USX on top DEXes, lending and borrowing on dForce. dForce is now the 4th largest holder of $wstETH, #9 holder of $USDT, #12 holder of $USDC on Optimism. We are partnering with selected protocols (i.e. Velodrome, Lido Finance, Curve etc) to co-incentivize participants and onboard new audiences from other networks. Why will this solution be a source of growth for the Optimism ecosystem?: Taking Lido Finance for example - dForce has recently received $LDO rewards from Lido for our contribution to the growth of $wstETH on L2s. dForce has recorded ~6k newly minted $wstETH (or >$7m in dollar value) from our referral link. Today, dForce is #4 holder of $wstETH on Optimism and #2 holder on Arbitrum, with more than 7k (or $9.3m in dollar value) $wstETH supplied to dForce across all networks. dForce will partner with Lido to incentivize lending activities around $wstETH and $USX (Snapshot), where users will be rewarded to leverage dForce to mint more $wstETH and interact with various DeFi protocols, accelerating the wide adoption of $wstETH and $USX across the broader Optimism ecosystem. It demonstrates a great opportunity for users of $wETH to mint more $wstETH on Optimism and benefit from leveraged staking and other DeFi activities. Users can mint $USX against $wstETH or its LP token to further enhance their DeFi yields. Has your project previously applied for an OP grant? Yes - dForce received 300k $OP grants during Phase 1 Cycle 2 ([READY] [GF: Phase 1 Proposal] dForce). We kicked off dForce liquidity mining on Optimism from June 2022 with a total distribution of 4m DF tokens by date (dForce provides long-term incentives on Optimism) (Join dForce’s Liquidity Mining Kick-off: Polygon & Optimism ! - dForce - Medium ). In addition, we started to incentivize users of dForce protocol on Optimism with $OP token from December 2022 (Introducing ‘dForce Optimistic Winter’ Campaign on Optimism | by dForce | dForce | Medium). Today, dForce recorded a TVL of $19m on Optimism (dForce Dapp). dForce stablecoin USX achieved a market cap of $16.9m on Optimism with 201 addresses and 14.5k transactions on Optimism (dForce USD (USX) Token Tracker | Optimism). dForce is currently the largest ETH LSD lending market on Optimism, as well as the 4th largest holder of $wstETH on Optimism. In addition, dForce is also #9 holder of $USDT and #12 holder of $USDC on Optimism. Number of OP tokens requested: 250,000 OP Did the project apply for or receive OP tokens through the Foundation Partner Fund?: No If OP tokens were requested from the Foundation Partner Fund, what was the amount?: N/A How much will your project match in co-incentives? (not required but recommended, when applicable) At least $1 DF for $1 OP. We have distributed more than 4m $DF tokens since June 2022 and will continue to incentivize users of dForce protocols on Optimism. How will the OP tokens be distributed? (please include % allocated to different initiatives such as user rewards/marketing/liquidity mining. Please also include a justification as to why each of these initiatives align with the problem statement this proposal is solving.)  40% for USX liquidity on Optimism 40% for lending activities around USX on Optimism 20% for bounties on teams building on top of dForce on Optimism and/or marketing campaigns in collaboration with partners across the Optimism ecosystem.  Over what period of time will the tokens be distributed for each initiative? Shorter timelines are preferable to longer timelines. Shorter timelines (on the order of weeks) allow teams to quickly demonstrate achievement of milestones, better facilitating additional grants via subsequent proposals: We anticipate that these incentives will be distributed over a 6-12 months’ time frame. Please clearly define the milestones you expect to achieve in order to receive milestone based installments. Please consider how each milestone relates to incentivizing sustainable usage and liquidity on Optimism. Progress towards each milestone must be trackable:  Accumulated borrowing on Optimism reach $58m, representing 33% QoQ growth from January 2023 USX liquidity on major DEXes reach $4m on Optimism, representing 100% growth from January 2023  Why will incentivized users and liquidity on Optimism remain after incentives dry up?: dForce is currently deployed on a number of blockchains including Ethereum, Optimism, Arbitrum, BSC, Polygon, Avalanche, KAVA. $USX can be bridged over from other blockchains to Optimism at near-to-zero cost - users will be given the opportunity to interact with other DeFi protocols and lock value on Optimism in one way or another. Once they migrate to Optimism and gain familiarity with the ecosystem, most would become regular users and reside on Optimism. Please provide any additional information that will facilitate accountability (smart contracts addresses relevant to the proposal, relevant organizational wallet addresses, etc.): Deployed contracts of dForce Lending & USX on Optimism: Deployed Contracts - dForce | Developers Confirm you have read and agree to the Eligibility Restrictions (here): I have read the Eligibility Restrictions and agree to abide by their conditions ",
                    "links": [
                        "https://dforce.network/",
                        "https://twitter.com/dForcenet",
                        "https://t.me/dforcenet",
                        "https://forum.dforce.network/",
                        "https://app.dforce.network/#/Markets/Optimism?AssetsType=Lend&currentPool=general",
                        "https://optimistic.etherscan.io/token/0x1f32b1c2345538c0c6f582fcb022739c4a194ebb#balances",
                        "https://snapshot.org/#/dforcenet.eth/proposal/0x5bbad4a4fade42b779ce5bab561fb889fe80872425a3b651090894cb0ebaf5ce",
                        "https://optimistic.etherscan.io/token/0xbfD291DA8A403DAAF7e5E9DC1ec0aCEaCd4848B9",
                        "https://snapshot.org/#/dforcenet.eth/proposal/0x5bbad4a4fade42b779ce5bab561fb889fe80872425a3b651090894cb0ebaf5ce",
                        "https://gov.optimism.io/t/ready-gf-phase-1-proposal-dforce/2420",
                        "https://medium.com/dforcenet/join-dforces-liquidity-mining-kick-off-polygon-optimism-d666eb747b5d",
                        "https://medium.com/dforcenet/introducing-dforce-optimistic-winter-campaign-on-optimism-f7aecf150e84",
                        "https://app.dforce.network/#/Markets/Optimism?AssetsType=Lend&currentPool=general",
                        "https://optimistic.etherscan.io/token/0xbfD291DA8A403DAAF7e5E9DC1ec0aCEaCd4848B9",
                        "https://developers.dforce.network/lend/lend-and-synth/deployed-contracts",
                        "https://gov.optimism.io/t/grant-proposal-template/3233"
                    ],
                    "GPT-summary": "The post is a draft proposal for the dForce project, which is a DeFi protocol covering assets, lending, and trading. The proposal aims to help Optimism develop into the default layer2 network by collaborating with more protocols to facilitate faster growth of both TVL and users. The proposal offers a general lending protocol, decentralized stablecoin, bridge, and trade aggregator. The post also includes relevant usage metrics and information about previous grants received. The proposal is explained by the author, and a 3rd party gives entirely positive feedback, extends to the proposal, and wants to collaborate on it.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Interoperability and Scaleability",
                        "Board composition",
                        "Smart contract updates",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.575813279857398
                },
                {
                    "author_link": "https://gov.optimism.io/u/MattL",
                    "index": "2",
                    "likes": "1",
                    "time": "03/02/2023-16:20:56",
                    "content": "    GrantsOps:  Number of OP tokens requested: 1m OP   There is currently a strong recommendation for grants to not exceed 250,000 OP. I recommend revising the number down to lower than 250k and tailoring the rest of your proposal to align with these numbers. To edit your proposal, @MGGYY please coordinate with @lavande on gaining ownership of this forum post. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.694444444444445
                },
                {
                    "author_link": "https://gov.optimism.io/u/Gregster",
                    "index": "3",
                    "likes": "1",
                    "time": "04/02/2023-12:35:41",
                    "content": "@MattL Didn’t projects last round apply with much higher amounts and they could sell it? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.083333333333333
                },
                {
                    "author_link": "https://gov.optimism.io/u/FractalVisions",
                    "index": "4",
                    "likes": "0",
                    "time": "04/02/2023-14:23:18",
                    "content": "You mean they couldn’t distribute the tokens properly ? If that’s the case we do need to take that into consideration when voting this round. Protocols who were not able to follow through with the intention of their first grant should not be allowed to receive additional funding especially if the issue has not been resolved with the distribution of the first grant. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 4.8125
                },
                {
                    "author_link": "https://gov.optimism.io/u/MattL",
                    "index": "5",
                    "likes": "0",
                    "time": "04/02/2023-18:33:14",
                    "content": "This 250k cap is new for proposals, but projects have never been allowed to sell their tokens – they’ve always had to incentivize usage. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.681818181818182
                },
                {
                    "author_link": "https://gov.optimism.io/u/MGGYY",
                    "index": "6",
                    "likes": "0",
                    "time": "06/02/2023-06:15:12",
                    "content": "Thanks for the reminder. We will revise the number down to 250,000 OP in accordance. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.111111111111111
                },
                {
                    "author_link": "https://gov.optimism.io/u/MGGYY",
                    "index": "8",
                    "likes": "1",
                    "time": "06/02/2023-06:40:52",
                    "content": "Users of USX receive $OP token rewards on dForce:  image2693×637 76.9 KB  We also confirm that grants received have been distributed according to our proposal through liquidity mining and marketing campaigns on the Optimism network. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.optimism.io/u/FractalVisions",
                    "index": "9",
                    "likes": "0",
                    "time": "06/02/2023-12:53:54",
                    "content": "The original question here was whether the last tokens received in grant form had been fully distributed. Do you have any metric data showing the account the tokens were held in and that they have all been used for distribution already? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.9375
                },
                {
                    "author_link": "https://gov.optimism.io/u/MGGYY",
                    "index": "10",
                    "likes": "1",
                    "time": "07/02/2023-08:06:06",
                    "content": "We didn’t ask for higher amount in the last round. 300,000 OP tokens received from last Cycle have been 100% distributed to users and developers on the Optimism network, in accordance with our proposal to the Optimism community: dForce proposal: DIP031 - Use of $OP Grant on Optimism (snapshot.org) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0625
                },
                {
                    "author_link": "https://gov.optimism.io/u/MGGYY",
                    "index": "11",
                    "likes": "1",
                    "time": "07/02/2023-08:19:53",
                    "content": "On top of that, we have distributed more than 4m $DF tokens for users on the Optimism Network since June 2022 (please view our announcement and schedule here). dForce aims to help Optimism develop into the default layer2 network and collaborate with elite partners to further grow the Optimism ecosystem. For example, we collaborate with Lido to power the adoption of $wstETH on the Optimism network by rewarding qualified users with $LDO token (see announcement here). ",
                    "links": [
                        "https://forum.dforce.network/c/general/liquidity-mining/109",
                        "https://medium.com/dforcenet/dforce-collaborates-with-lido-to-power-the-adoption-of-wsteth-on-l2s-a3ea657ebdb1"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://gov.optimism.io/u/MattL",
                    "index": "12",
                    "likes": "1",
                    "time": "07/02/2023-20:21:58",
                    "content": "Hey @MGGYY - These milestones need to be defined to include metrics that dForce would like to achieve, as of right now they are too broad. Lmk once this is done, thanks!     MGGYY:  Please clearly define the milestones you expect to achieve in order to receive milestone based installments. Please consider how each milestone relates to incentivizing sustainable usage and liquidity on Optimism. Progress towards each milestone must be trackable:   Integrate with more DeFi protocols to facilitate wide adoption of $USX and enhance its ability to interact with other DeFi protocols and assets across the Optimism ecosystem.   As #4 holder of $wstETH on Optimism, dForce has received $LDO grants from Lido Finance to incentivize lending activities around $wstETH and $USX (mint $USX against collateralized $wstETH and $wstETH/$wETH LP on Curve) (Snapshot)   Have sizable liquidity for $USX on all major DEXes and bridges.   Onboard more assets (including LP tokens) to dForce to support lending activities around $USX.     ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.853174603174604
                },
                {
                    "author_link": "https://gov.optimism.io/u/MGGYY",
                    "index": "14",
                    "likes": "2",
                    "time": "08/02/2023-07:15:52",
                    "content": "Updated the post with defined milestones as suggested.  Accumulated borrowing on Optimism reach $58m, representing 33% QoQ growth from January 2023 USX liquidity on major DEXes reach $4m on Optimism, representing 100% growth from January 2023  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.3125
                }
            ]
        }
    ],
    "group_index": "488"
}