{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/chris-blec-the-reluctant-delegate/7439",
            "title": "Chris Blec: The Reluctant Delegate ",
            "index": 7439,
            "category": [
                "Delegation Pitch"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/chrisblec",
                    "index": "1",
                    "likes": "14",
                    "time": "20/10/2020-18:26:07",
                    "content": "I’m Chris Blec and I’m offering myself up as an option for UNI vote delegation. My delegate address is reluctantdelegate.eth, or  0x84bb5196F0085D61a7C9AC5B903a26D7f009aC13 Why a “reluctant delegate”? I believe that adding a governance token to Uniswap may have been a mistake. The protocol was working well without governance, and I believe that the token issuance was less about decentralizing power and more about increasing potential ROI for venture capital investors. I understand the need to be able to compete with competitors who may attempt to suck liquidity out, however I’m not convinced that tokenized governance is the best way to do it. With that being said, as of now, I still believe that Uniswap is the best option available for fans of decentralization. As a delegate with absolutely no big-money connections, I will be committed to only voting in favor of proposals that will actually decentralize decision-making. I will never vote in favor of a proposal that will give more power or weight to UNI whales, since the current system freely offers them the vast majority of the power. I will be highly transparent and regularly share my point of view on my YouTube channel at https://youtube.com/chrisblec. I will also conduct regular UNI voter conversations like this one. ** While I do hope that my efforts result in a stronger UNI economy due to increased governance participation, my primary goal will not be focused entirely on the value of UNI. I will often criticize UNI whales, investors, founders, and the governance process itself if I see reason to. I am not necessarily here to build a strong public image for Uniswap. But, I do hope that the addition of my unique point of view will ultimately make Uniswap and UNI stronger and more resilient to attacks on liquidity, governance, or otherwise. My primary mission will be to always ensure that we are working toward a system that puts the wishes of small token holders on the same level as whales, and to increase governance participation amongst minnows. In that regard, less governance may often be better than more. Do not expect me to vote YES very often, especially on proposals that originate from whales and corporations. It’s good for you to understand in advance that my highly principled approach will likely be called obstructionist, trouble-making, and a general pain-in-the-butt by the governance community. Be ready for this. I will not even consider voting YES for a Dharma airdrop proposal that is put forth by Dharma, a DeFi whale or a corporation. I will, however, consider hearing arguments in favor an airdrop proposal that is thoughtfully put forth by a user without VC connections, preferably in an autonomous proposal with considerable support from many unique small UNI holders. If there is a chance that more UNI voting power can reasonably be put into the hands of individual end-users, I will consider it. I believe that the next year of UNI governance may play a significant role in the founding principles of future - hopefully better - DeFi governance models. I hope that the work that we do here inspires future projects to launch with better, more trustless governance. My goal is to provide a reliable delegation option for those who share the above outlined principles. If you have any questions for me, please comment below.  ** Quick disclaimer: I monetize my DeFi video content as a primary source of income, and I may begin offering some video content (possibly UNI-related) behind a paywall.  Thanks for hearing me out, Chris Blec ",
                    "links": [
                        "https://ondkloss.github.io/uniswapdelegates/#/address/0x84bb5196F0085D61a7C9AC5B903a26D7f009aC13",
                        "https://ondkloss.github.io/uniswapdelegates/#/address/0x84bb5196F0085D61a7C9AC5B903a26D7f009aC13",
                        "https://youtube.com/chrisblec",
                        "https://youtu.be/SJrazSFZsdo?t=103"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.016666666666667
                },
                {
                    "author_link": "https://gov.uniswap.org/u/melveyr",
                    "index": "2",
                    "likes": "0",
                    "time": "20/10/2020-18:38:05",
                    "content": "Would you vote for renewal of existing mines given they are expiring in less than 30 days? Now that the cat is out of the bag this how LPs get rewarded and incentivized to stay and so its important to me that key pairs such as USDC/ETH continue to be supported. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.291666666666667
                },
                {
                    "author_link": "https://gov.uniswap.org/u/chrisblec",
                    "index": "3",
                    "likes": "1",
                    "time": "20/10/2020-20:47:47",
                    "content": "I am aware of how important pairs like USDC/ETH are to all swaps on Uniswap so it seems that it would be a good use of the treasury to continue incentivizing liquidity on those. I am definitely leaning towards it but haven’t finalized a view on that yet. I still want to explore whether there is a way to achieve similar effects with more decentralized coins. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.541666666666667
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Hiturunk",
                    "index": "4",
                    "likes": "4",
                    "time": "20/10/2020-21:55:36",
                    "content": "Penguin Party here! Chris Blec is very intelligent and the Penguin Party absolutely endorses candidates like him arising from the wider defi community to represent true community interests! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.729166666666667
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Danpi314",
                    "index": "5",
                    "likes": "1",
                    "time": "21/10/2020-00:43:41",
                    "content": "I’m not exactly sure either on the exact distribution, ideally we need to incentivise tokens which would cause Uniswap to be even more competitive with other DeFi and more importantly CeFi programs. Firstly, not continuing the ETH rewards in some capacity could lead to mini flash crash (Due to masss selling of ETH), which would be bad for the whole ecosystem. Perhaps and this is just a guess, we keep the ETH/DAI reward where it is but reduce the ETH/USDT and ETH/USDC reward by perhaps 40%. ETH/WBTC I’m not to sure on, perhaps leave that where it is to. This would free up about 20% of the rewards, this could be split 2% each towards 10 smaller tokens, so as not to artificially pump the price too much. Again, not to sure on what exactly, but tokens like LEND/AAVE, COMP, LINK, MKR, CRV, NXM, REP, YFI? or even UNI might be the types of coins best to use. Uni is a controversial one, as it would disincentivize voting, however it could also help bring those tokens off centralised platforms, where they could be voted from there. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0562499999999995
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Alex17",
                    "index": "6",
                    "likes": "2",
                    "time": "21/10/2020-02:40:03",
                    "content": "Chris, good to see you standing up for smaller voters.  Where do you stand on flipping the fee switch as well as a UNI/ETH rewards pool in order to make UNI a productive asset as well as lower sell pressure from farming and vested unlocks? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://gov.uniswap.org/u/chrisblec",
                    "index": "7",
                    "likes": "3",
                    "time": "21/10/2020-02:42:12",
                    "content": "I’m in favor of flipping on the fee switch, although I do think it should be considered in context with other ideas that are floating around. Doing this in conjunction with other changes could cause unintended consequences. I’m conflicted on UNI/ETH rewards because it would mean locking up UNI that should really be used for voting. I’d like to discuss solutions to this problem though - perhaps it can be solved with a wrapper? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.546875
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Alex17",
                    "index": "8",
                    "likes": "1",
                    "time": "21/10/2020-02:52:09",
                    "content": "This makes sense, thank you. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/GreyEcologist",
                    "index": "10",
                    "likes": "1",
                    "time": "21/10/2020-14:55:33",
                    "content": "Yes, LP should be able to vote. There are different ways to enable this, either via snapshots or via some staking derivative (i.e Stafi). But in general, we should incentivize  this pool so that more farmers hodl instead of dumping. Dharma has a proposal coming this Friday, so we should really come up with a community driven proposal ahead of them. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.uniswap.org/u/MarkOSullivan94",
                    "index": "11",
                    "likes": "4",
                    "time": "21/10/2020-17:35:40",
                    "content": "Honestly makes me so happy that you’ve put yourself forward @chrisblec although I’m sure you already know this      chrisblec:  As a delegate with absolutely no big-money connections, I will be committed to only voting in favor of proposals that will actually decentralize decision-making.   Every single protocol which has some kind of governance needs people like Chris - people who want nothing more than to ensure the protocols stay decentralized & trustless as much as possible Already delegated my UNI to Chris, here’s hoping he gains enough support to reach the threshold required to suggest proposals  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.285714285714286
                },
                {
                    "author_link": "https://gov.uniswap.org/u/3.1415r",
                    "index": "12",
                    "likes": "2",
                    "time": "24/10/2020-22:02:10",
                    "content": "Hi Chris, very happy to see you reluctantly put yourself forward as a delegate. Unsurprisingly, I like what you outlined here very much and just gave you my votes. I take the opportunity to thanks you big time, I watch your content regularly on youtube and consider you one of the best crypto educator out there. Best, Pierre ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.4714285714285715
                },
                {
                    "author_link": "https://gov.uniswap.org/u/L.A.SanJose",
                    "index": "13",
                    "likes": "2",
                    "time": "25/10/2020-15:51:02",
                    "content": "Thanks for your enlightening! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.4375
                },
                {
                    "author_link": "https://gov.uniswap.org/u/TheMantis",
                    "index": "14",
                    "likes": "0",
                    "time": "20/11/2020-17:04:02",
                    "content": "Interesting post here Chris, you do raise several valid points! I dig your work bro, thanks for your contributions yo  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.166666666666667
                },
                {
                    "author_link": "https://gov.uniswap.org/u/zbtiqua",
                    "index": "15",
                    "likes": "1",
                    "time": "06/05/2021-22:53:25",
                    "content": "A review of this man’s twitter will make you think twice about delegating him any power. This is not the kind of person who is going to move the world forward in a positive direction. It is not in the best interest of Uniswap, or any of you, to delegate to him. Look elsewhere. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.045454545454545
                }
            ]
        }
    ],
    "group_index": "435"
}