{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/building-uniswaps-moat-attracting-non-defi-developers/12419",
            "title": "Building Uniswap's Moat: Attracting Non-DeFi Developers ",
            "index": 12419,
            "category": [
                "Proposal Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/Danconia.crypto",
                    "index": "1",
                    "likes": "0",
                    "time": "22/05/2021-22:15:34",
                    "content": "Proposal: fund a campaign to bring non-defi native developers into the Uniswap ecosystem. Uniswap has the largest treasury in DeFi. At $3.5B at the time of writing, Uniswap’s treasury is multiples larger than Compound ($1.5B), Aave ($0.9B), Sushiswap ($0.5B), and a long tail of smaller protocols (source). Yet the Uniswap community is doing shockingly little to capitalize on its advantage. The Uniswap Grants Program is a great start, but it’s a drop in the bucket in the context of the overall treasury [1]. The Uniswap community needs to find ways to productively invest more of its treasury. Uniswap is better capitalized than other protocols, which makes it uniquely capable of investing to build moats around the Uniswap ecosystem and drive long-term value to UNI tokenholders. Maintaining the status quo will give other protocols a chance to close the gap, and could make Uniswap fail to reach its full potential. Like the spirit behind UGP, I believe that growing developer activity on Uniswap (rather than, say, incentivizing LPs) is the highest-leverage activity for driving long-term value to UNI. To be clear, I think UGP is an incredible program and I believe it should be funded more aggressively. However, there are clearly diminishing returns to scale – increasing UGP’s budget by 20x will not increase developer activity on Uniswap by 20x. So the question remains – how do we find productive and scalable channels to increase developer activity on Uniswap? The Uniswap community should vote to allocate funding towards initiatives that bring non-defi native developers into the Uniswap ecosystem. My reasoning is simple. There are, say, 500K solidity developers in the world [2], which I understand to be the primary audience for UGP. On the other side of the marketplace, there are dozens of defi protocols that have announced grants programs with their native tokens to bootstrap their ecosystems [3]. The limited supply of developers, combined with a menu of grants to choose from, creates a sellers’ market for defi developer talent – eventually, protocols will need to increase grant sizes as they bid against each other to acquire a limited pool of developers. Rather than play this game, Uniswap should experiment with ways of bringing non-defi developers into the Uniswap ecosystem. It’s intuitive that a large number of talented engineers inside FAANG companies, tech startups, and other institutions will transition to defi. Uniswap is the most exciting and innovative developer brand in defi – there’s no reason that a defi-curious engineer at say, Google, should spend their time building anything besides Uniswap. It’s up to the Uniswap community to make this a reality. We shouldn’t underestimate the long-term value that comes from being the first defi touchpoint for talented developers. While I’m 100% convinced the community should do something to capitalize on Uniswap’s advantage, I have less conviction on what the best path forward looks like and I welcome discussion + feedback from the community. As a straw man, here’s what I propose:   The Uniswap community allocates $500K in total funding from the treasury to this effort, with a structure similar to UGP’s budget (i.e., two installments of $250K, three months quarter apart). The funds will be controlled by a multi-sig of community 5 community members, similar to UGP.   At least 20% of the funds will be allocated to each of three initiatives ($100K each). The remaining 40% ($200K) will be allocated to whichever initiative is the most promising. These initiatives will be decided by the 5 community members on the multi-sig. My ideas are:    pay 50 UNI to any developer who verifies a work email address from a tech company and crosses some commitment threshold (e.g., makes an API call to Uniswap).     buying billboard space near the offices of companies with a large pools of talented developers (e.g., big tech like Google, Amazon, Microsoft, DropBox; quant funds like Jane Street, Citadel, Two Sigma; CeFi companies like Paypal, Square, Stripe).     buying ads in podcasts with developer appeal (e.g., Lex Fridman, Tim Ferris, HIBT).      After deploying the grants, the multi-sig members and broader community should find ways to measure the effectiveness of the campaigns, and determine whether the “cost to acquire” a developer through these channels merits additional funding from the treasury. Again, I encourage the community to take a long-term perspective towards capital allocation. I see the controversy of diluting the UNI treasury to “pay” big tech developers, but we need to consider the bigger picture. From hanging around the community, I believe there are <100 developers who are actively building on Uniswap today, perhaps much less. These sub-100 developers have created over $10B in market value to UNI holders, or $100M+ per developer. If we can attract talented developers to the Uniswap ecosystem for say, <$5K per head, we should be doing it all day long. I appreciate in advance any engagement from the Uniswap community. My goal of this post is two-fold. First, to understand whether such an initiative has enough support amongst the community to warrant a more formal proposal – to this end, please vote in the poll below. The second goal is to find members with community support to serve as a multi-sig holders.     Agree – the initiative merits funding Disagree – the initiative does not merit funding Agree, but with different parameters     0 voters     FOOTNOTES [1] At a $1.5M quarterly budget (source), and assuming constant prices, UGP’s annual budget is only 17bps of the treasury, implying 400+ years of “runway” before exhausting the treasury. If you think of the treasury as a perpetual endowment, then assuming it can generate a 5% annual yield and has a 5% expense ratio policy (i.e., spend the gains, protect the principal; similar to university endowments’ strategy in the US), then the current UGP budget would be <4% Uniswap’s annual spend. [2] There are reports from mid-2019 of ~200K solidity developers, which I’ve assumed to have grown 150% since then. Using any reasonable assumption, it’s intuitive that the number of defi-native developers today is much smaller than the number of non-defi developers (who may someday become defi developers). [3] Chainlink, Compound, Aave, Algorand, Alpha Homora, Orbs, Unstoppable, Qtum, STP, Conflux, among many others. ",
                    "links": [
                        "https://snapshot.org/#/uniswap/proposal/QmWe6Krc81pkCtQFbd2AxytFCp1imLGUnFTEEom9YNwFte",
                        "https://chain.link/community/grants",
                        "https://www.comp.xyz/t/compound-grants-program/1292",
                        "https://governance.aave.com/t/arc-aave-community-grants-program/3642",
                        "https://algorand.foundation/grants-program",
                        "https://alphafinancelab.gitbook.io/alpha-finance-lab/alpha-grants-program/alpha-builders-open-grants/grant-1-alpha-dashboard",
                        "https://www.orbs.com/white-papers/orbs-grant-program-2/",
                        "https://www.businesswire.com/news/home/20191114005142/en/Unstoppable-Domains-Launches-1-Million-Grant-Program-for-Wallets-Browsers-and-Exchanges#:~:text=The%20goal%20of%20the%20%241%2C000%2C000,sold%20more%20than%20150%2C000%20domains.",
                        "https://blog.qtum.org/qtum-foundation-announces-grant-program-for-defi-developers-d34bcb5e7198",
                        "https://docs.google.com/forms/d/e/1FAIpQLSdQmyryEWqFVpxQ_2NaaEAs3yfRaBtJJNu2zqGtBjmTEnf7og/viewform",
                        "https://confluxnetwork.org/developers/grants/",
                        "https://gov.uniswap.org/t/temperature-check-deploy-uniswap-v3-on-harmony-through-an-additional-use-grant-to-hermes-defi/16128"
                    ],
                    "GPT-summary": "The author proposes a campaign to bring non-DeFi developers into the Uniswap ecosystem, funded by the Uniswap treasury. The author argues that Uniswap's large treasury should be invested in building moats around the ecosystem and driving long-term value to UNI tokenholders. The author suggests allocating $500K in total funding from the treasury to this effort, with a structure similar to UGP's budget. The author proposes three initiatives to attract non-DeFi developers and encourages the community to take a long-term perspective towards capital allocation. The author welcomes discussion and feedback from the community.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Change to proposal pipeline",
                        "Token economics",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.720637882018479
                },
                {
                    "author_link": "https://gov.uniswap.org/u/jcp",
                    "index": "2",
                    "likes": "0",
                    "time": "24/05/2021-07:18:10",
                    "content": "I like the idea of getting more developers into Ethereum / Uniswap, but I believe the ideas above would simply be gamed for profit by most developers at tech companies. I don’t believe that billboards or giving out UNI for such a low-effort action would actually activate many new developers. The way I’ve seen most developers get into building on Uniswap or other DeFi protocols is by learning something about how one of these protocols works that got them excited building something. So to me, the way to activate non-DeFi developers is to build clear documentation and developer guides for how to accomplish interesting use-cases with Uniswap / DeFi APIs and smart contracts. However, I think there’s a lot more upside in getting more of the existing solidity / web3 developers building on Uniswap specifically than by trying to recruit non-crypto or FAANG developers from a completely cold start. There are tons of developers in the space that are capable of building on Uniswap who simply haven’t done so yet. I think a combination of increasing the budget of UGP and launching several other, similar programs is probably the most immediately useful way to take advantage of treasury funds. Also, one note: UGP isn’t just for solidity developers! Take a look at recent projects and you’ll find people working on things like web apps, documentation, marketing, branding, and community research as well. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.894355644355644
                },
                {
                    "author_link": "https://gov.uniswap.org/u/kenneth",
                    "index": "3",
                    "likes": "0",
                    "time": "26/05/2021-01:21:23",
                    "content": "thanks for posting, this is super dope! to start, by no means is UGP perfect and definitely should not be considered the standard for resource allocation. i’d love for more UGP-alternatives to be funded by treasury, we’re already starting that with our subcommittees but it’s definitely not enough. i think the sentiment in your post is great and i’m definitely not a good recruiter, but i’ll play devils advocate a bit here:     Danconia.crypto:     pay 50 UNI to any developer who verifies a work email address from a tech company and crosses some commitment threshold (e.g., makes an API call to Uniswap).     buying billboard space near the offices of companies with a large pools of talented developers (e.g., big tech like Google, Amazon, Microsoft, DropBox; quant funds like Jane Street, Citadel, Two Sigma; CeFi companies like Paypal, Square, Stripe).     buying ads in podcasts with developer appeal (e.g., Lex Fridman, Tim Ferris, HIBT).      are these the right incentives and values alignment for recruiting the types of devs we want in the ecosystem? are financial barriers the biggest blockers for people to join the space? if not - then what actually is the right incentive?     jcp:  The way I’ve seen most developers get into building on Uniswap or other DeFi protocols is by learning something about how one of these protocols works that got them excited building something. So to me, the way to activate non-DeFi developers is to build clear documentation and developer guides for how to accomplish interesting use-cases with Uniswap / DeFi APIs and smart contracts.   is it intellectual curiosity? is it the education of, or the lack of awareness of interesting problems? i definitely don’t have the answers but these are the questions that keep me up at night! in the same vein though, if you do happen to have some conviction on an idea you’d like to experiment with on a small scale please DM us! would be great to see it as a tight feedback loop grant before spinning into it’s own grants program or UGP subcommittee! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.223575036075037
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Danconia.crypto",
                    "index": "4",
                    "likes": "2",
                    "time": "05/06/2021-21:35:49",
                    "content": "Kenneth appreciate you playing devil’s advocate. Here’s what I think:  are these the right incentives and values alignment for recruiting the types of devs we want in the ecosystem? are financial barriers the biggest blockers for people to join the space? if not - then what actually is the right incentive?  You’re 100% right that for the developers i’m talking about, there is no financial barrier to joining defi. That’s a feature of this plan, not a bug! These are developers who, in general, are cash-rich enough that they could quit their day jobs for a period of time without meaningfully changing their quality of life. There are tens (maybe hundreds) of thousands of these developers. Everyone on this forum knows that working on Uniswap is 100x more exciting than working on the marginal product at a FAANG company – so why haven’t more developers made the jump into defi? It’s because they don’t know what defi is, or they’ve never seen its potential. This is the point of the $[5]K. It won’t change their life, but that’s not the point; it’s about virality. If you think about the category-defining fintech companies in cefi, they’re all built around an extremely simple value prop…  eg Robinhood with commission-free stock trading. “Write an API call, earn $5K in crypto” has the same ring. We’ll know this proposal is successful if internal slack channels at FAANG companies have developers raving to their coworkers about how they made $5K in a day building on Uniswap. Again, many developers will take the $5K and leave. That’s fine. We only want the most intellectually curious, open-minded, and ambitious developers from FAANG companies in defi anyway  and that’s exactly the type of developer that will be the first to realize Uniswap’s potential after skimming through the API docs for 5 minutes and writing 10 lines of code. The economics I walked through in the original post make me comfortable that giving $5K away to the “bad” developers is a cheap price to pay for acquiring great developers at the same cost.  However, I think there’s a lot more upside in getting more of the existing solidity / web3 developers building on Uniswap specifically than by trying to recruit non-crypto or FAANG developers from a completely cold start. There are tons of developers in the space that are capable of building on Uniswap who simply haven’t done so yet. I think a combination of increasing the budget of UGP and launching several other, similar programs is probably the most immediately useful way to take advantage of treasury funds.  JCP thanks for engaging. Let me push back on this point because I think it’s short-sighted. You’re right there are tons of developers in the space that could build on Uniswap and haven’t – Uniswap is, and should continue to find ways to attract these developers… But this is a limited pool, anecdotally i doubt there’s >50K defi-native developers (happy to be proven wrong by data). In the short to medium term, this is plenty of runway; Uniswap has the biggest treasury and leading brand in crypto, so it has natural recruiting advantages vs other crypto projects. But what about the multi-year, or multi-decade perspective? Here’s how I think about this idea – imagine Uniswap’s potential in 5 years. Will the protocol still be competing for a pool of 50K developers? I doubt it. So where will the next generation of defi developers come from? Naturally, from outside defi. Why shouldn’t Unsiwap be the project the pulls them into defi? I believe it should, because it will drive activity and value to the protocol long-term. And if Uniswap is going to target non-defi developers, why not go after the FAANG companies that have already vetted and aggregated tens/hundreds of thousands of developers?  i definitely don’t have the answers but these are the questions that keep me up at night! in the same vein though, if you do happen to have some conviction on an idea you’d like to experiment with on a small scale please DM us! would be great to see it as a tight feedback loop grant before spinning into it’s own grants program or UGP subcommittee!  100%! This is all probabilistic but I think it’s an experiment worth running at a small scale and seeing if the results merit more funding. I agree with @JCP’s comment that the #1 KPI should be how many new active developers join the Uniswap community because of it. I’ll follow up and DM you with some concrete ideas – it’d be awesome to find a way to test this on a small scale through UGP! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.95070803609536
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Danconia.crypto",
                    "index": "5",
                    "likes": "0",
                    "time": "06/06/2021-20:28:07",
                    "content": " Screen Shot 2021-06-06 at 1.26.12 PM869×857 99.9 KB  The best recruiters in defi are doing this, let’s get Uniswap doing it too  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                }
            ]
        }
    ],
    "group_index": "66"
}