{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/order-book-view-for-analytics/17303",
            "title": "\"Order Book\" view for Analytics ",
            "index": 17303,
            "category": [
                "Proposal Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/dexman.eth",
                    "index": "1",
                    "likes": "13",
                    "time": "29/07/2022-12:50:42",
                    "content": "The “Liquidity” view in Uniswap analytics is not only hard to read for anyone used to traditional finance, but also technically misleading. Each vertical bar shows the “amount of liquidity” locked at that level: not the number of tokens. In fact - the SAME “liquidity amounts”, at different price points, do equal different numbers of tokens and also different dollar values. Bizarre! Try hovering over the different bars, to verify this by reading the text pop-ups. Example (ETH/USDT @ 0.05%) https://info.uniswap.org/#/pools/0x11b815efb8f581194ae79006d24e0d814b7697f6  image1241×584 12.6 KB  The technical concept of liquidity, required to run v3, has limitations that make it extremely user-unfriendly. If you are used to Binance, TradFi, or any other non-DeFi trading system really, likely you think and expect the (simpler) view of an order book. Example. The same liquidity pool above, transformed into an order book (see the relevant section next to the price chart) https://app.civfund.org/pro-trade/0xc02aaa39b223fe8d0a0e5c4f27ead9083c756cc2  image472×918 54.3 KB  The Civilization community built this: a layer to transform v3 concentrated liquidity data into the view that users expect. Running for well over 6 months by now. Since launch, we filed a patent to protect the significant development investment, from a community that is self-funded without any VC investors. However, our goal is to build a decentralised hedge fund and help DeFi get broader adoption. Our community would love to see more people benefit from this tech, so that DeFi can continue its march to overtake TradFi! We would therefore be extremely happy for everyone’s benefit to contribute this entire order book visualisation tech to be integrated into Uniswap Analytics, either complementing or completely replacing the current “Liquidity view”, including all rights of usage, so long as a tiny “powered by” acknowledgement would be added at the bottom. Might this be a helpful new trading signal and view for anyone around here? Have a great day! ",
                    "links": [
                        "https://global.discourse-cdn.com/business6/uploads/uniswap1/original/2X/6/6c8b5d52bfb61e456d2029b33270c09d4f74de67.png"
                    ],
                    "GPT-summary": "The post discusses the limitations of the \"Liquidity\" view in Uniswap analytics and proposes an alternative \"Order Book\" view developed by the Civilization community. The author of the post is advertising the alternative view and is extending the proposal to integrate it into Uniswap Analytics. The post also gives constructive criticism of the current view and explains the technical concept of liquidity. The author is open to collaboration and wants to contribute the entire order book visualization tech to benefit the DeFi community.",
                    "GPT-proposal-categories": [
                        "Interoperability and Scalability",
                        "Token economics",
                        "Smart contract updates",
                        "Community and engagement",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party or author is advertising proposal",
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.640782828282829
                },
                {
                    "author_link": "https://gov.uniswap.org/u/dexman.eth",
                    "index": "2",
                    "likes": "6",
                    "time": "29/07/2022-12:59:01",
                    "content": "Note: due to the blockchain design (1 new block every ~12 seconds on Ethereum), the order book is not updated in real-time but every ~15 seconds. This inter-time can be tailored per blockchain but the maximum frequency of update is a strict limit: no new information can be computed, while new blocks are still being mined! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.142045454545454
                },
                {
                    "author_link": "https://gov.uniswap.org/u/belvonefelpato",
                    "index": "3",
                    "likes": "5",
                    "time": "29/07/2022-13:06:13",
                    "content": "Thank you @dexman.eth this is such a nice post!! Incredible how Civilization is developing such wonderful technologies that pushes the limit of crypto adoption further! @UniswapLabs please consider implementing Civilization CivTrade’s Order Book! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party or author is advertising proposal",
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.364583333333333
                },
                {
                    "author_link": "https://gov.uniswap.org/u/IceCimmo",
                    "index": "4",
                    "likes": "6",
                    "time": "29/07/2022-13:10:25",
                    "content": "Very nice usage of Uniswap v3 concentrated liquidity model. This application can simplify a lot the DeFi space and expand the v3 adoption in the market. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 8.9
                },
                {
                    "author_link": "https://gov.uniswap.org/u/mrfuji22",
                    "index": "5",
                    "likes": "4",
                    "time": "29/07/2022-13:41:23",
                    "content": "I think the Civilization Order Book can be much more useful and surely more precise.  And btw the general design is better! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.979166666666666
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Falco",
                    "index": "6",
                    "likes": "3",
                    "time": "29/07/2022-14:36:00",
                    "content": "With more institutional investors moving to crypto, allowing them to see data in a view they are used to could be a huge help! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/KriptoRaptor",
                    "index": "7",
                    "likes": "1",
                    "time": "17/09/2022-01:47:19",
                    "content": "Hello everyone I have been involved with blockchain,dapps,de-fi for over 3yrs have also been helping build communities around. Amazed by such huge contributions. Thanks devs/designers  Awesome! I’m not on development side but community. I appreciate  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author is advertising proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.0
                }
            ]
        }
    ],
    "group_index": "210"
}