{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/uni-staking-for-il-reduction/1385",
            "title": "$UNI staking for IL reduction ",
            "index": 1385,
            "category": [
                "Proposal Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/mak",
                    "index": "1",
                    "likes": "4",
                    "time": "17/09/2020-17:34:40",
                    "content": "Hi all, As we all know deeper liquidity pools generally get more volume in the absence of artificial incentives. This could be either due to the smaller spread asked for large orders or simply because of arbitrage transactions keeping price in parity with other exchanges needing more volume to move the price by the same amount. As $UNI holders we should try to increase volume of the uniswap exchange in a way that is sustainable in the long term. In my observation people are reluctant to pool their liquidity with AMMs due to the Impermanent Loss (IL) problem. Short term solutions to incentivize liquidity such as yield farming might bring in new liquidity for a short duration but as evidenced from the SushiSwap debacle they don’t create long terms users. I want to present an idea that might help us create a long term solution to the IL problem. I propose that  $UNI holders should be allowed to lock and stake their $UNI tokens against a specific pool that has been approved by the governance. These stakers will act as “IL guardians” of that pool whose job is to make LPs whole in the event of large IL. The stakers can then interact with a newly created user interface through which they can take up uni-directional or bi-directional positions with a specified spread in options contracts (via decentralized venues e.g Hegic Options). If the pair doesn’t face IL in the duration before the options contract expires then the Staker’s locked $UNI is liquidiated and added to make the pool LPs whole. If the pool did face a severe Impermanent loss then the relevant option is exercised via the uniswap UI by the staker which adds majority of the proceeds to the pool and shares some part with the staker. A small percentage of the uniswap platform’s fees may also be routed to a “IL reduction” fund which is used to provide additional incentive to the staker in proportion to the IL reduced by them vs normal market prices. Additionally the staker’s $UNI is released. This basically adds a mechanism to reduce IL where the staker’s incentives are aligned with the liquidity providers and with the Uniswap platform therefore increasing the amount of liquidity that the platform can offer on a long term basis. I’d be glad to know what you think. It’s possible I’ve missed some aspect so any criticism is more than welcome  BR, MAK ",
                    "links": [],
                    "GPT-summary": "The author proposes a solution to the Impermanent Loss (IL) problem faced by liquidity providers on Uniswap. The proposal involves allowing $UNI holders to lock and stake their tokens against a specific pool approved by governance, acting as \"IL guardians\" who can take up uni-directional or bi-directional positions with a specified spread in options contracts. If the pool faces severe IL, the relevant option is exercised by the staker, adding the majority of the proceeds to the pool and sharing some part with the staker. The proposal is open to criticism and feedback.",
                    "GPT-proposal-categories": [
                        "Token economics",
                        "Privacy, Security and risk management",
                        "Smart contract updates",
                        "Interoperability and Scaleability",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.464211924439198
                },
                {
                    "author_link": "https://gov.uniswap.org/u/France1234",
                    "index": "2",
                    "likes": "0",
                    "time": "20/09/2020-06:39:19",
                    "content": "Not a bad idea however what will happen if people have Uni in Exchanges? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.749999999999999
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Mr_Po",
                    "index": "3",
                    "likes": "0",
                    "time": "23/09/2020-23:41:38",
                    "content": "Hi @mak, To be honest, I didn’t quite grasp all the nuances of your proposition, but the question that comes to my mind is: why do we need UNI token to be used here? If we were to introduce this type of game, why shouldn’t we just use the original pair’s tokens to do this hedging? It seems that would spare us a couple of exchange transactions on the operation and free our UNI tokens to do other stuff. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.85
                }
            ]
        }
    ],
    "group_index": "123"
}