{
    "poll_list": [
        {
            "id": "QmUrYMZrS97ZA5FeSAgs6xk7qNong5pjwXkQyYi7M6WmkC",
            "title": "Create a CAPITAL PROTECTION Tool for v3!! ",
            "discussion": "",
            "body": "Would you like to have 100% protection against volatility for your crypto?? This could be done using the new Concentrated Liquidity of v3 by just changing or adding a few things! \n\nImagine adding liquidity to the ETH/USDC pair for example (50% of each), and in case the ETH price drops and gets out of your range, your capital is turned 100% into USDC!! This way you would be 100% PROTECTED against LOSSES! And in case the ETH price goes up again and completely crosses your range in an upward direction, your capital would be automatically swaped 100% into ETH!!\n\nYou could even manually FOLLOW or TRAIL the ETH price every time it goes up, by removing and adding a new liquidity range at a higher price, and this could help you MAXIMIZE YOUR PROFITS!! You could very efficiently trade tops like this! Just imagine trading perfectly the ETH TOP of this Bull market! Either if it is 10k, 15k, or 20k, you could just follow it and trade it perfectly!! And after it drops, you can continue to follow the price, GROWING YOUR CAPITAL thanks to a high yield from fees, and volatility itself! Knowing your capital is always completely PROTECTED against ANY LOSSES!!\n\nThe problem now is that the direction of the swaps inside a liquidity range are exactly the opposite as they should be... Using the same example, if the ETH price drops out of your range, your capital is swaped 100% into ETH, and if the price goes up and gets out of the range, your capital is 100% swaped into USDC... It should be the exact opposite!\n\nSo this is a PROPOSAL to change the direction the swaps are made inside a liquidity range to the exact opposite they are now, or to at least let the users choose the direction of the swaps when they add liquidity to the pools or create ranged orders.\n\nIf we make this change, it would be DISRUPTIVE and Uniswap will completely BREAK all other DEXs and CEXs!! People would LOOSE the FEAR of loosing their money because of volatility!! This would easily help with crypto's mass adoption!! And it will definitely drive more LPs to v3!! Please think about it and support this proposal! Thanks!! ",
            "choices": [
                "YES",
                "NO"
            ],
            "scores": [
                6373.039835133381,
                4214022.723597472
            ],
            "start": 1625931900,
            "end": 1626191100,
            "snapshot": "12800468",
            "state": "closed",
            "author": "0x77848888BeCe35979dbE948C7931a3E7Bb7e0d50",
            "space": {
                "id": "uniswap",
                "name": "Uniswap"
            }
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/temperature-check-create-a-capital-protection-tool-for-v3/13267",
            "title": "Temperature Check - Create a CAPITAL PROTECTION Tool for v3! ",
            "index": 13267,
            "category": [
                "Temperature Check"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/Luchango",
                    "index": "1",
                    "likes": "2",
                    "time": "10/07/2021-15:42:16",
                    "content": "Would you like to have 100% protection against volatility for your crypto?? This could be done using the new Concentrated Liquidity of v3 by just changing or adding a few things! Imagine adding liquidity to the ETH/USDC pair for example (50% of each), and in case the ETH price drops and gets out of your range, your capital is turned 100% into USDC!! This way you would be 100% PROTECTED against LOSSES! And in case the ETH price goes up again and completely crosses your range in an upward direction, your capital would be automatically swaped 100% into ETH!! You could even manually FOLLOW or TRAIL the ETH price every time it goes up, by removing and adding a new liquidity range at a higher price, and this could help you MAXIMIZE YOUR PROFITS!! You could very efficiently trade tops like this! Just imagine trading perfectly the ETH TOP of this Bull market! Either if it is 10k, 15k, or 20k, you could just follow it and trade it perfectly!! And after it drops, you can continue to follow the price, GROWING YOUR CAPITAL thanks to a high yield from fees, and volatility itself! Knowing your capital is always completely PROTECTED against ANY LOSSES!! The problem now is that the direction of the swaps inside a liquidity range are exactly the opposite as they should be… Using the same example, if the ETH price drops out of your range, your capital is swaped 100% into ETH, and if the price goes up and gets out of the range, your capital is 100% swaped into USDC… It should be the exact opposite! So this is a PROPOSAL to change the direction the swaps are made inside a liquidity range to the exact opposite they are now, or to at least let the users choose the direction of the swaps when they add liquidity to the pools or create ranged orders. If we make this change, it would be DISRUPTIVE and Uniswap will completely BREAK all other DEXs and CEXs!! People would LOOSE the FEAR of loosing their money because of volatility!! This would easily help with crypto’s mass adoption!! And it will definitely drive more LPs to v3!! Please think about it and support this proposal! Thanks!! VOTE HERE: Snapshot ** To VOTE you need to DELEGATE the UNI in your wallet to use them as votes here: Uniswap Interface  Uniswap Liquidity Ranges1470×692 146 KB  ",
                    "links": [
                        "https://app.uniswap.org/#/vote",
                        "https://global.discourse-cdn.com/business6/uploads/uniswap1/original/2X/d/d07d933f2d2e25720d197cf047bcf29bd055bd05.jpeg",
                        "https://gov.uniswap.org/t/delegate-your-uni-votes-to-the-harvard-law-school-blockchain-and-fintech-initiative/10184/2"
                    ],
                    "GPT-summary": "The author proposes a change in the direction of swaps inside a liquidity range in Uniswap v3 to provide 100% protection against losses due to volatility. The proposal suggests that users should be able to choose the direction of swaps when adding liquidity to the pools or creating ranged orders. The post also asks for support and votes for the proposal. A 3rd party could give constructive criticism or ask questions about the proposal, while the author is explaining and advertising the proposal.",
                    "GPT-proposal-categories": [
                        "Token economics",
                        "Smart contract updates",
                        "Interoperability and Scalability",
                        "Privacy, Security and risk management",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 6.104298527475612
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Luchango",
                    "index": "2",
                    "likes": "0",
                    "time": "11/07/2021-14:46:11",
                    "content": "Thank you all for your votes! Now tell all your crypto whale / dolphin / shark friends to support our proposal so we can make this a reality!! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Luchango",
                    "index": "3",
                    "likes": "0",
                    "time": "12/07/2021-01:38:08",
                    "content": "Monetsupply, care to explain why did you vote NO with 4 million UNI?? This change will benefit you and other whales more than anyone! Specially when you have 83 million USD worth of UNI… wouldnt you want to be able to protect your investment better with this small change?? This doesnt even have a negative effect on anyone, why would you do this?? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.0044642857142865
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Luchango",
                    "index": "4",
                    "likes": "0",
                    "time": "12/07/2021-03:06:01",
                    "content": "My guess is that Monetsupply is a core developer at Uniswap and for some reason he doesnt want this change to go live, maybe because is hard to do or simply cant make it? Any other core devs care to confirm this? Either way its too much overkill for a temperature check proposal, very weird indeed!! ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 4.099747474747475
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Luchango",
                    "index": "5",
                    "likes": "0",
                    "time": "14/07/2021-01:40:59",
                    "content": "Thank you all for your awesome votes!! We will do a follow up proposal simplifying the end goal so its easier to understand and hopefully we get some whale support! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Noah",
                    "index": "6",
                    "likes": "0",
                    "time": "29/09/2021-18:39:19",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "96"
}