{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/uni-rewards-how-to-distribute-uni-reward-tokens-best/14989",
            "title": "\\xf0\\x9f\\xa6\\x84 UNI rewards - How to distribute UNI reward tokens best ",
            "index": 14989,
            "category": [
                "Temperature Check"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/sommi",
                    "index": "1",
                    "likes": "9",
                    "time": "17/11/2021-04:48:03",
                    "content": " Hi friends, I am not a writer but I made a medium article to share below. I am here to gauge peoples thoughts on implementing the best tokenomics model we can get for Uniswap (UNI) … Link to article:  Medium – 14 Nov 21   WHAT IS THE #1 BEST TOKENOMICS IN CRYPTO? The Ultimate  Tokenomics — Diamond Hands Staking Model (DHSM)💎🙌  Reading time: 6 min read       I now present my case for my Uni Community  GOAL OF DHSM (Diamond Hand Staking Model) UNISWAP TOKEN: Long-Term Pumpamental Benefits:  Turn UNI community into Diamond Hand Believers & boost Network Effect Allow UNI community members to take a long-term view (5–10yrs as opposed to 5–10 months) Reduce UNI token gambling and speculation by weak hands (this will always exist, but we can lower it) Prevent UNI shareholders from being their own worst enemy — when their tokens are locked up, they cannot sell the lows in panic. Shift rewards to UNI Token Holders with 10yr view, instead of benefiting short-term dumpers     I strongly believe that we should implement the Diamond Hands Staking Model (DHSM) in order to distribute Uniswap Revenue sharing   My article explains more in detail, but the premise is that it just copies the HEX staking model such that:   You are able to stake your UNI token from 1 day to 10 years People who stake longer receive higher rate of UNI rewards This allows a healthy ecosystem network, whereby people are able to take a long-term view on UNI and be compensated for it This also distributes rewards to the believers  In this system  There is a penalty if you Emergency End Stake. UNI would be taken from your principle or interest (depending how early you unstake) and given 50% to the UNI Treasury and 50% to the remaining stakers  I believe this system creates the best Price performance over time and also aligns UNI believers with the system. The alternative to this system is that people with a lot of UNI can unfairly get UNI rewards and dump them when staking or rewards are available I am a bag holder of many DeFi projects and I am currently on a mission to at least open the mind of our beloved protocols to implement this DHSM in some form.   Of course, this would require UNI to turn on “Revenue Sharing” first. Because with HEX, it gives out rewards from inflation, but from UNI we can give out rewards from the Revenue Fee generated from trades…  imho if we do this we’ll create the biggest beast the world has ever seen and UNI can get above $100 bill market cap and start to head towards $1 trill before 2030 is here  Thanks for your time, please share thoughts! ",
                    "links": [
                        "https://medium.com/@yourfriendsommi/-8f03b106a6ba"
                    ],
                    "GPT-summary": "The author of the post is proposing the implementation of the Diamond Hands Staking Model (DHSM) for Uniswap (UNI) to distribute UNI reward tokens. The post asks for feedback and presents the benefits of the DHSM, including reducing UNI token gambling and speculation, preventing UNI shareholders from selling at lows, and shifting rewards to UNI token holders with a long-term view. The post also explains the DHSM in detail and how it would work.",
                    "GPT-proposal-categories": [
                        "Token economics",
                        "Interoperability and Scalability",
                        "Community and engagement"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.353395061728396
                },
                {
                    "author_link": "https://gov.uniswap.org/u/mitch007",
                    "index": "2",
                    "likes": "0",
                    "time": "26/08/2022-04:33:05",
                    "content": "Nice I would love that ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.75
                }
            ]
        }
    ],
    "group_index": "152"
}