{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/please-add-ethereum-fair-and-ethereum-to-the/17795",
            "title": "Please add Ethereum Fair and Ethereum \\xe1\\xb4\\x98\\xe1\\xb4\\x8f\\xe1\\xb4\\xa1 to the \\xe1\\xb4\\x9c\\xc9\\xaa ! ",
            "index": 17795,
            "category": [
                "Proposal Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/ytrezq",
                    "index": "1",
                    "likes": "3",
                    "time": "02/10/2022-18:50:00",
                    "content": "Those chains are hard forks from the mainnet started with the Merge hard fork. It’s like Bitcoin and Bitcoin cash. As a result, all the contracts and the liquidity is there using the exact same addresses than on Ethereum ! All what’s needed is to add the chain ɪᴅs to the ᴜɪ which are 10001 for ᴇᴛʜᴘᴏᴡ and 513100 for Ethereum Fair ! Please just do it ! ",
                    "links": [
                        "https://gov.uniswap.org/t/governance-weekly-recap/17803/4"
                    ],
                    "GPT-summary": "The author is proposing the addition of two hard forks of Ethereum, Ethereum Fair and Ethereum POW, to the UI. The post explains that these chains have the same contracts and liquidity as Ethereum and only require the addition of their chain IDs to the UI. The post is primarily an explanation of the proposal, with a request for the addition of the chains to the UI.",
                    "GPT-proposal-categories": [
                        "Smart contract updates",
                        "Interoperability and Scalability",
                        "None",
                        "None",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.284722222222222
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Kades",
                    "index": "2",
                    "likes": "0",
                    "time": "03/10/2022-14:20:30",
                    "content": "Hi, @ytrezq! Why do we need this movement? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/ytrezq",
                    "index": "3",
                    "likes": "1",
                    "time": "03/10/2022-18:45:27",
                    "content": "There are plenty of Uniswap liquidity on those sidechains but there’s no way centralized or not to exchange any of the tokens against the native currency of those chains. Uniswap would have a monopoly for those providing liquidity there. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Kades",
                    "index": "4",
                    "likes": "0",
                    "time": "03/10/2022-22:15:38",
                    "content": "But do you think that these forks are relevant to the Uniswap’s network? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/ytrezq",
                    "index": "5",
                    "likes": "2",
                    "time": "03/10/2022-23:35:03",
                    "content": "The Uniswap contracts are deployed there and there’s thousands of millions worth of Uniswap liquidity being staked. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Kades",
                    "index": "6",
                    "likes": "0",
                    "time": "04/10/2022-13:20:09",
                    "content": "But it is really worth for Uniswap and LPs to create this kind of pool? Such assets are too volatile. I’m not against it, i’m just trying to understand your point of view. These questions are being made for me to understand your thesis ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/ytrezq",
                    "index": "7",
                    "likes": "2",
                    "time": "04/10/2022-14:50:27",
                    "content": "Nothing has to be created. Everything is inherited from the real Ethereum mainnet. It’s just a matter of copying Ethereum parameters in the ᴜɪ with just changing the chain ɪᴅ. Uniswap is somewhat already supported on those chains in the same way the torn token is not completely censored. It’s just you have to handle bytes using a hex editor to perform the required swaps along using your archive node frontend since there’s no explorers. Neverless, my point is only Ethereum Fair and EThereum ᴘᴏᴡ is listed on many exchanges while their tokens have to be traded through a hex editor. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.125
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Kades",
                    "index": "8",
                    "likes": "0",
                    "time": "04/10/2022-15:07:56",
                    "content": "My point is not the effort of making these pools, but the profit of LPs given that these assets are too volatile ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/ytrezq",
                    "index": "9",
                    "likes": "0",
                    "time": "04/10/2022-15:48:45",
                    "content": "They aren’t too volatile since those assets aren’t currently tradable efficiently. Because of the lack of interest, I don’t think the ʟᴘ tokens would be withdrawn by their owner though being able to withdraw what is inadvertently stacked can also be an argument for allowing the ᴜɪ to access the networks. It’s not that much about allowing profit from stacking since mass stacking for the thousands of supported tokens is there but exchanging. So either the supply side doesn’t matter for being able to exchange or if it matters it’s yet another argument in order to add support to the ᴜɪ (in order to be able to withdraw it). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.699999999999999
                }
            ]
        }
    ],
    "group_index": "227"
}