{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/call-for-research-collaboration-uniswap-proposal-creators-and-governance-contributors/15866",
            "title": "Call for Research Collaboration: Uniswap Proposal Creators and Governance Contributors ",
            "index": 15866,
            "category": [
                "Governance-Meta"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/tobyshorin",
                    "index": "1",
                    "likes": "12",
                    "time": "17/01/2022-20:39:06",
                    "content": "As part of our investigation into the roles of interest representation and ecosystem-level issues in Uniswap governance, Other Internet is seeking collaborators from the Uniswap community to participate in governance proposal shadowing and governance contributor interviews. Governance proposal shadowing Other Internet would like to offer observational shadowing of groups and individuals working on Uniswap governance proposals. If you’re looking to start a proposal and you’re interested in contributing to our research, get in touch with us. We are interested in proposals of all kinds, with a particular focus on those that address the role of Uniswap within the larger web3 ecosystem. Such proposals might address any of the following topics:  L2s and scaling Uniswap MEV and existential threats Treasury diversification Token swaps with other protocols Uniswap V3 code licensing Ethereum public goods Investments, grants, and treasury deployment  We’re looking to answer the following questions:  What are the main issues faced by proposal creators at each stage of the process, from ideation to temperature check, to consensus check to on chain vote, to execution? How do they attempt to solve these problems, and through which (public or private) channels? Which actors do they involve? Are these solutions sustainable over time? How are proposals implemented when they require action beyond the smart contract layer? Who is responsible? How do follow ups and accountability happen?  If you are working on proposal at the ideation, pre-temperature check or temperature check stage, please send us a DM at twitter.com/otherinternet__. If you were responsible for a proposal in the past and would like to share with us how that went, we’d love to hear from you too. Participating teams will be compensated with a small DAI reward, with the option to donate the reward to a public goods project of their choice. An executive summary with key insights from this process will also be published. Governance contributor interviews In addition to proposal shadowing, we’ll also be conducting interviews with contributors to the Uniswap governance forum. We have a particular interest in hearing from members who have been active in the past, but have disengaged in recent months. Our key questions include:  What are the main sources of disillusionment among governance contributors? What are their stories of how and when they lost interest? What motivates people to stay involved in governance initiatives? How does their participation in Uniswap compare with their involvement in adjacent communities? What are the main issue areas that community members care about? What’s the typical pipeline from user of the protocol to governance participant?  Our learnings from these conversations will be shared with the Uniswap community in the form of a report. Interview participants will be anonymized. If you’d like to contribute to our research by sharing your experiences with us, send us a DM at twitter.com/otherinternet__ and we’ll arrange a short call that fits your schedule (30-45min)!  ",
                    "links": [
                        "http://twitter.com/otherinternet__",
                        "http://twitter.com/otherinternet__",
                        "http://twitter.com/otherinternet__"
                    ],
                    "GPT-summary": "Other Internet is seeking collaborators from the Uniswap community to participate in governance proposal shadowing and governance contributor interviews. They are interested in proposals of all kinds, with a particular focus on those that address the role of Uniswap within the larger web3 ecosystem. They are looking to answer questions about the main issues faced by proposal creators, how proposals are implemented, and how follow-ups and accountability happen. They are also conducting interviews with contributors to the Uniswap governance forum to learn about their experiences and motivations.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "3rd party or author wants to collaborate on proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.175409226190476
                },
                {
                    "author_link": "https://gov.uniswap.org/u/jonsnow",
                    "index": "2",
                    "likes": "2",
                    "time": "19/01/2022-04:27:52",
                    "content": "No UNI tokenomics and implementation research? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/caideguang",
                    "index": "3",
                    "likes": "3",
                    "time": "20/01/2022-03:19:44",
                    "content": "We need to reward the approved proposal and voting users. We need a team to help the proposer promote the governance proposal. At present, the proposal has high requirements for the proposer, and it is difficult for ordinary players to successfully complete all steps. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 4.51
                }
            ]
        }
    ],
    "group_index": "160"
}