{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/temperature-check-turn-the-fee-switch-on-for-v2-pools-that-were-incentivized/13014",
            "title": "Temperature Check - Turn the FEE SWITCH ON for V2 Pools That Were Incentivized ",
            "index": 13014,
            "category": [
                "Temperature Check"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/Donzo",
                    "index": "1",
                    "likes": "7",
                    "time": "16/06/2021-15:36:24",
                    "content": "Last November the Uniswap protocol incentivized liquidity in the following V2 pools:  ETH/USDT ETH/USDC ETH/DAI ETH/WBTC  We now have some data on how that may have driven liquidity to the protocol and how much of that liquidity proved to be sticky. V3 of Uniswap has been out for over a month now and is steadily gaining traction. Rather than incentivize liquidity to move to V3, I think it makes more sense to TURN THE FEE SWITCH ON IN THE FORMERLY INCENTIVIZED POOLS ON V2. This will give us data on how turning the fee switches on may affect the liquidity that is already in the protocol. I suspect most of the liquidity will stay in these pools despite the fees but we won’t know until we turn on the switch. Also, turning on the switch will turn the UNI token into a productive asset, one that generates fees for token holders. I think that is a net positive for the protocol. What do you all think? ",
                    "links": [],
                    "GPT-summary": "The author proposes to turn on the fee switch in the V2 pools that were previously incentivized by Uniswap protocol, instead of incentivizing liquidity to move to V3. The author believes that this will provide data on how turning on the fee switches may affect the liquidity already in the protocol and turn the UNI token into a productive asset. The author asks for feedback on this proposal and what others think about it.",
                    "GPT-proposal-categories": [
                        "Token economics",
                        "Smart contract updates",
                        "Community and engagement"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.885521885521885
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Danpi314",
                    "index": "2",
                    "likes": "7",
                    "time": "16/06/2021-17:32:00",
                    "content": "I believe in V2 fees are all or nothing, only in V3 can you pick and choose. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Jorropo",
                    "index": "3",
                    "likes": "3",
                    "time": "17/06/2021-10:27:12",
                    "content": "Exactly, v2 is 1/6 of fees on all pools or nothing. v3 allows to pick pools and the protocol fee rate. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Jorropo",
                    "index": "4",
                    "likes": "1",
                    "time": "17/06/2021-10:31:12",
                    "content": " This will give us data on how turning the fee switches on may affect the liquidity that is already in the protocol.  Saying “we enable the fee switch but only for a short while / testing” is one of the worst thing you can do on v2. As on v2 the fees are moved from a user account into the fee switch recipient when the user remove liquidity. The only thing you incentivise then is just removing liquidity later as if you enable the fee switch but only for a short while, only the liquidity removed while it was enabled will count towards it. This would give unreliable data due to a part of LP that would prefer to wait when the testing is done instead of taking their money now (and giving up 1/6 of the fees to the goverance). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.375
                },
                {
                    "author_link": "https://gov.uniswap.org/u/neverselling",
                    "index": "5",
                    "likes": "1",
                    "time": "18/06/2021-01:03:12",
                    "content": "I still say we flip the switch on everything, if liquidity providers want that exposure, buy some UNI if you dont have any. Most I assume, are UNI whales ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Buckerino",
                    "index": "6",
                    "likes": "3",
                    "time": "18/06/2021-09:29:54",
                    "content": "After the Community Call on the 16th of June, the topic of the fee switch being turned on as a, “Buyback and Keep” model was thoroughly discussed with the community being overwhelmingly in favor of implementing such a proposal. The fee switch would be turned on the V2 to incentivize people to migrate to V3 with a 90 day timelock for V3 when the fee switch would turn on there as well. Some key delegates also expressed their approval of such a proposal and the next steps will be discussed on the Penguin´s Party discord. I´ll keep you in the loop. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Figu3",
                    "index": "7",
                    "likes": "0",
                    "time": "23/06/2021-12:46:45",
                    "content": "I don’t think incentivizing v2 is a good strategy. Pushing for v3 transition is probably the way to go, as mentioned in the last community call. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Kripto",
                    "index": "8",
                    "likes": "0",
                    "time": "07/07/2021-12:33:58",
                    "content": "innovation is always good.  We must make the change happen immediately. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                }
            ]
        }
    ],
    "group_index": "85"
}