{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/celo-x-uniswap-update/19722",
            "title": "Celo x Uniswap Update ",
            "index": 19722,
            "category": [],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/nraghuveera",
                    "index": "1",
                    "likes": "2",
                    "time": "09/12/2022-19:55:37",
                    "content": "Hi all, Nikhil from the Celo Foundation here. It’s been tumultuous the last month or two, hope everyone is doing well. I wanted to share an update on the Celo ecosystem’s work with the Uniswap protocol since it’s been some time since my last post in July. I’ll focus this update on three key items: (1) natural capital assets, (2) liquidity rewards, and (3) climate impact assessment. Natural Capital Assets The University of Michigan and the Celo Foundation deployed Uniswap v3 to support the growth of natural capital assets on Celo. Climate-focused projects remain one of the most active developer ecosystems on Celo, with projects including but not limited to Toucan, Senken, Spirals, Untangled Finance, Flow Carbon, Kolektivo, Cyberbox, Carbon Title, Neutral Protocol, Thallo, and Plastiks, committed to deploying or having deployed on Celo. We also have a collaboration with Deutsche Telekom & T-Mobile US for web3 development in which one vertical is focused on sustainability. This work continues as projects engage with major carbon registries (e.g., Verra and Gold Standard) about tokenizing carbon credit assets, and create robust processes for web3-native carbon credit issuance. Several of the major carbon credit registries temporarily halted the use of token-based carbon credit assets earlier this summer, in order to engage with web3 projects to determine appropriate models for tokenization and usage across web3 protocols unprecedented to the carbon markets. This temporarily blocked liquidity for natural capital assets from flowing onto Celo, Uniswap, and web3 more broadly. Celo Foundation and Climate Collective took the opportunity to provide comments to Verra’s public consultation and support efforts to explore innovative solutions in using blockchain to bring transparency and integrity in the voluntary carbon market. Toucan, Flow Carbon, and other projects in the Celo ecosystem also submitted letters to Verra’s consultation and are working closely with the registries through working groups; and the Climate Collective continues to align efforts with stakeholders across multiple ecosystems including BICOWG, Protocol Labs, HBAR Foundation, Regen Network, and other key web3 x climate actors. Currently, the most liquid carbon credit asset on Celo is NCT, created by Toucan. The supply of additional NCT is limited pending approval from the carbon registries. This, however, does not derail from the mission of Uniswap facilitating climate action as NCT is being actively used and further adopted by a number of projects in the Celo ecosystem, such as Spirals and Cyberbox, for carbon offsets. This month, Toucan also expects to launch native offsets on the Celo blockchain for NCT holders after spending the last few months developing this retirement mechanism. The contracts for this are currently deployed on the Alfajores testnet with certain contracts around TCO2 being finalized before developers can leverage them. Immediately thereafter, new projects such as Senken will be able to support full retirement functionality on Celo. Once native offsets with NCT are possible, the Celo ecosystem also plans to explore how NCT can be used for native offsets for the Celo blockchain as a whole (draft is in progress!). This harkens back to Celo’s first community governance proposal to direct epoch rewards to offset the energy consumption of the Celo blockchain. I include all this because native offsetting functionality on the Celo blockchain will mean more use of Uniswap on Celo as projects acquire NCT to perform carbon offset activity (something that has been a blocker). If the Celo community also agrees to use NCT to offset the chain’s climate footprint, Uniswap will be the core DEX for this activity. Similarly, future climate-based assets may have similar types of activity as they launch and the community looks to do Celo blockchain offsets with them. Some recent projects are also defining their own community-led standards for climate action. This comes down to the thesis that blockchain technology helps solve the mass coordination problem of climate action. One project doing this is Spirals, which recently began adding their assets to Uniswap and has expressed interest in doing this further. We will expect to see more of this activity as these types of projects driving broader community action continue to launch on Celo. Liquidity rewards The Celo Foundation remains committed to providing liquidity rewards to support the growth of Uniswap on Celo. I know we haven’t deployed rewards yet and I wanted to provide some context as to why.   We were waiting for LP management tools to deploy on Celo and pass our due diligence and compliance checks. We now have Gamma Strategies and Cargo.   General market conditions and concerns around mercenary capital that would not help Celo ecosystem projects grow their TVL. The Celo Foundation has been engaging with Celo-based projects on this topic of when it might make sense to deploy rewards and how we can ensure sustainable growth of TVL.   Ongoing conversations and engagement with carbon offset registries will not be helped if members in these external organizations notice unsustainable incentivized TVL. This may damage reputations of web3 projects and appear to look like greenwashing.   Limitations in supply of tokenized carbon credit assets given ongoing engagement with carbon offset registries (discussed above).   Given these reasons, the Celo Foundation has primarily helped projects seed sufficient liquidity to support climate action. We see this as a way to help users and projects transfer assets that are then retired on chain to ensure transparency and verifiability, while ensuring that liquidity remains to support the project. Gamma Strategies recently launched on Celo and I’ve been actively engaging with them on all of these topics. I appreciate all of Brian’s help at Gamma as we’ve spent some time brainstorming on these different facets and the best ways to support liquidity of natural capital backed assets on Celo. Climate Impact Assessment The Celo Foundation and the Climate Collective are currently exploring the research and publication of several climate-related content. We recently joined with other web3 entities to create the Ethereum Climate Platform which will be analyzing and addressing the Ethereum-based carbon footprint (including Uniswap’s footprint). Additionally, the Climate Collective is working on developing a framework to evaluate the quality of carbon credits to be used towards credible offsetting of protocol emissions from Uniswap (on Celo) and the Celo blockchain. I know some members of this community were interested in collaborating on a climate assessment. Let me know and I’m happy to bring you into these conversations with the Climate Collective and the Celo Foundation. The Future—Together Looking forward, projects starting in the Celo ecosystem and supported by the Celo Foundation are now also collaborating with the Uniswap Foundation, such Numoen. We’re excited about how we can continue working together to build out real world use cases in web3. The Celo Foundation and the Uniswap Foundation also hosted a social event a few months ago and I hope we can do something together again soon in the new year between the Celo and Uniswap communities. On that note, if you’re ever in SF do let me know and I’d love to host you at the Celo ecosystem office. We also have offices in NYC and Berlin, and a co-living community hub Bogota. Lastly, for those of you celebrating holidays during this time of the year I want to wish you happy holidays. Hope you’re able to get some rest and enjoy time with your loved ones. Thanks! Nikhil Raghuveera Celo Foundation ",
                    "links": [
                        "https://www.senken.io/",
                        "https://www.spirals.so/",
                        "https://untangled.finance/",
                        "https://www.flowcarbon.com/",
                        "https://www.kolektivo.network/",
                        "https://cyberbox.art/",
                        "https://www.carbontitle.com/",
                        "https://www.neutralprotocol.co/",
                        "https://www.thallo.io/",
                        "https://plastiks.io/",
                        "https://www.t-mobile.com/news/network/2023-t-challenge",
                        "https://climatecollective.org/",
                        "https://docs.google.com/document/d/1u1NSCIOGByNone8S6vE3WlgClB0lADLN/edit",
                        "https://verra.org/public-consultation-verras-approach-to-third-party-crypto-instruments-and-tokens/",
                        "https://github.com/celo-org/governance/blob/main/CGPs/cgp-0001.md",
                        "https://www.gamma.xyz/",
                        "https://www.cargo.finance/",
                        "https://twitter.com/UniswapFND/status/1572630727065313286",
                        "https://medium.com/@casacelo/blooming-colombia-is-waiting-for-you-at-casa-celo-c0b8599deff2"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.686151065183323
                }
            ]
        }
    ],
    "group_index": "244"
}