{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/proposal-uniswap-purchases-presenting-sponsorship-spot-at-permissionless-the-worlds-largest-defi-conference/14249",
            "title": "Proposal: Uniswap purchases presenting sponsorship spot at Permissionless, the worlds largest DeFi conference ",
            "index": 14249,
            "category": [
                "Temperature Check"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/austinfgreen",
                    "index": "1",
                    "likes": "2",
                    "time": "20/09/2021-14:55:25",
                    "content": "Hey! It’s Austin Green. I lead partnerships at Blockworks, where we educate investors about crypto. Disclaimer, I own UNI and would also get a commission if Uniswap sponsors the Permissionless event. Blockworks has partnered with The Bankless Podcast to launch the world’s largest DeFi conference, Permissionless.  We want to extend an opportunity to UNI governance to have Uniswap purchase the presenting sponsor for Permissionless. You can see pricing and information here: The event will be held in Palm Beach, Florida. May 17-19, 2022. Total: $500,000. The Presenting sponsor includes:  20x20 Booth Keynote or Fireside Chat (main stage) Panel Participation (main stage) VIP and General event tickets Social Media Promotion Press Release inclusion All registration lanyards will have your logo Podcast interview on the Bankless Podcast Podcast interview on the Empire Podcast Dedicated marketing email blast sent to the entire registration list.  More info here - https://hubs.ly/H0XGYTJ0 Permissionless is the cultural event of the year, with over 5,000 people attending it is going to be the world’s largest DeFi conference. Just over a year since DeFi summer and it is still what everyone is talking about. It is only right that Uniswap would have a chance to sponsor the event that is representing DeFi. Today DeFi is a $100 billion economy. Tomorrow it will touch every aspect of our lives. Really excited about this opportunity to help promote Uniswap and what it can do to help bring forth the future of finance! ",
                    "links": [],
                    "GPT-summary": "The author of the post is proposing that Uniswap purchases the presenting sponsorship spot for the Permissionless conference, the world's largest DeFi conference. The post provides details about the sponsorship package and the benefits that come with it. The author is extending an opportunity to UNI governance to sponsor the event and is advertising the event to potential sponsors. The post is entirely positive about the proposal and highlights the cultural significance of the event.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.741921768707483
                },
                {
                    "author_link": "https://gov.uniswap.org/u/wijuwiju",
                    "index": "2",
                    "likes": "2",
                    "time": "21/09/2021-11:16:34",
                    "content": "hey @austinfgreen, thank you for sharing, imho I don’t think something that uses “VIP” and “exclusive” to characterise its product offering is worth sponsoring or associating with for Uniswap Protocol. At this stage will vote against ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/austinfgreen",
                    "index": "3",
                    "likes": "1",
                    "time": "21/09/2021-15:34:01",
                    "content": "Thanks for your feedback. I would love to answer any further questions you may have about all the offerings. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.166666666666667
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Buckerino",
                    "index": "4",
                    "likes": "2",
                    "time": "24/09/2021-07:42:08",
                    "content": "Yeah, this is absolutely ridicilous. There are 100 if not 1000s of better ways how to spend the money in a more effective way. I will vote NO. Could you elaborate on the value proposition this proposal presents further perhaps? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.916666666666666
                },
                {
                    "author_link": "https://gov.uniswap.org/u/jonsnow",
                    "index": "5",
                    "likes": "1",
                    "time": "24/09/2021-22:24:40",
                    "content": "Should we start buying ads on CNN and Fox News? This is ridiculous. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.333333333333334
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Naught",
                    "index": "6",
                    "likes": "1",
                    "time": "25/09/2021-17:43:18",
                    "content": "A better use of funding would be for a Uniswap focused hackathon. The type of sponsorship proposed here is too marketing focused. The target demographic at this DeFi conference would be those who already know about Uniswap. So it would not be informing a new audience. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.590909090909091
                },
                {
                    "author_link": "https://gov.uniswap.org/u/jonsnow",
                    "index": "7",
                    "likes": "1",
                    "time": "25/09/2021-22:14:22",
                    "content": "This proposal is a pure marketing hustle. I do like the uniswap focused hackathon idea. I think Uniswap Grant already sponsored one recently ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5357142857142865
                },
                {
                    "author_link": "https://gov.uniswap.org/u/lee0007",
                    "index": "8",
                    "likes": "0",
                    "time": "26/09/2021-09:02:18",
                    "content": "I 'd be interested to see how you justify 500k in direct relation to each of the 10 sponsor benefits listed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.875
                },
                {
                    "author_link": "https://gov.uniswap.org/u/kenneth",
                    "index": "9",
                    "likes": "2",
                    "time": "28/09/2021-22:03:50",
                    "content": "yeah! it’s call unicode you can find out more here - https://unicode.ethglobal.com/ it’s going to be a fun one ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/austinfgreen",
                    "index": "10",
                    "likes": "0",
                    "time": "01/02/2022-20:33:42",
                    "content": "Just replying to this now. The presenting sponsor was purchased by Coinbase.  The justification of the price comes from the audience that will be attending. 5000+ builders, investors, degens, and more all in the same place. The price is justified by putting the presenting sponsor as the face of the world’s largest DeFi and Metaverse event. I understand that it didn’t make sense for Uniswap to sponsor the event this year. I look forward to meeting with other community members that end up attending. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.96875
                }
            ]
        }
    ],
    "group_index": "134"
}