{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/delegate-your-uni-votes-to-the-harvard-law-school-blockchain-and-fintech-initiative/10184",
            "title": "Delegate your UNI Votes to the Harvard Law School Blockchain and Fintech Initiative ",
            "index": 10184,
            "category": [
                "Delegation Pitch"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/HarvardLawBFI",
                    "index": "1",
                    "likes": "7",
                    "time": "05/02/2021-20:00:41",
                    "content": "The Harvard Law School Blockchain and Fintech Initiative (HLSBFI) is a student group at Harvard Law. Our mission is to promote educational and career-developing opportunities for students interested in working in industries that utilize blockchain and financial technologies. We’ve seen Uniswap’s tremendous growth over the past months, and we are excited to spearhead initiatives and utilize our diverse membership to provide insight on proposals. Over the past weeks, HLSBFI has created core values that will provide the basis for our decision-making on various proposals. Long-term value creation: Commitment to make informed votes that will benefit the long-term development of decentralized finance. Fairness: We will not vote in favor of proposals that are fraudulent or that disproportionately benefit the proposal creator. Education: Increasing public awareness, education, and accessibility to decentralized finance and the potential benefits that a decentralized exchange provides. Maintenance of Uniswap’s Original Mission: Strengthening the fundamental pillars of permissionless access, security, and immutability. Diversity and Inclusion: Utilization of Uniswap Treasury pools to invest in projects that facilitate equity, diversity, and inclusion across decentralized finance. Transparency Commitment to being transparent about our decision-making process. We are always open to answering questions related to our votes on proposals. Independent decision-making We are always open to receiving input and discussing the merits behind proposals, but the votes we allocate will be a function of our own independent decision-making—we are committed to remaining free from undue influence from interested third-parties. If these core values resonate with you, delegate your votes to HLSBFI. Thank you! To delegate: 0x61c8D4e4BE6477Bb49791540Ff297Ef30Eaa01c2 Twitter: @HarvardLawBFI Web: DeFi Governance – HLS Blockchain and Fintech Initiative ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.498958333333333
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Luchango",
                    "index": "2",
                    "likes": "0",
                    "time": "12/07/2021-22:35:53",
                    "content": "Will you guys help me out with my proposal? I can delegate my votes to you if you help me! Thanks! This is the proposal: Temperature Check - Create a CAPITAL PROTECTION Tool for v3! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5625
                }
            ]
        }
    ],
    "group_index": "3"
}