{
    "poll_list": [
        {
            "id": "0x4dd49ee723a7e506c6c6c15c8eabc8a7057f3f0760e44ed2f475d42203c4e3e8",
            "title": "Temp Check: \"Fee switch\" activation for ETH/USDC & USDC/USDT",
            "discussion": "https://gov.uniswap.org/t/fee-switch-design-space-next-steps/17132",
            "body": "See governance forum for details: https://gov.uniswap.org/t/fee-switch-design-space-next-steps/17132",
            "choices": [
                "Yes",
                "No"
            ],
            "scores": [
                3530507.2498909337,
                53.86017294820375
            ],
            "start": 1658191292,
            "end": 1658419200,
            "snapshot": "15169882",
            "state": "closed",
            "author": "0x067b9Bbbbc42d2AB9b9Ab6bB62646dAF7F344A76",
            "space": {
                "id": "uniswap",
                "name": "Uniswap"
            }
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/fee-switch-design-space-next-steps/17132",
            "title": "\"Fee Switch\" Design Space & Next Steps ",
            "index": 17132,
            "category": [
                "Proposal Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/Leighton",
                    "index": "1",
                    "likes": "30",
                    "time": "19/07/2022-00:41:15",
                    "content": "There has been a lot of discussion around whether the “Fee Switch” should be turned on. In most of this discussion I see an assumption that using the fee switch = money going to UNI token holders. I think this is limiting. The design space around how a fee switch can be used is much larger and it’s crucially important to all of DeFi that we consider the design space broadly. Mindlessly adopting a generic “stake UNI = get some sort of fee” would miss the incredible opportunity we have to think creatively about how protocols, governance, and value accrual can work in Web3. The purpose of this post is make clear UNI governance has two very different decisions to make 1). should a fee switch be turned on? and 2) how should fees be utilized? By separating these decisions we may actually be able to move faster. The stakes are high Uniswap is the #1 DeFi protocol – both in terms of utilization and ethos. What Uniswap chooses to do with the “fee switch” will set precedent for the whole industry. Much like the retro-active UNI token airdrop set precedent for how to distribute governance. The high stakes make complacency a comfortable option but there is equal risk in waiting too long to explore this tool. The “fee switch” Design Space I believe the term “fee switch” is a misnomer. It refers to the ability for the Uniswap protocol to retain a portion of what is already being paid to the liquidity providers. The protocol retaining a portion of this gives UNI token holders new tools to leverage in furthering the growth and mission of the protocol. It does not create any expectation the retained tokens will be paid out to UNI token holders.   Public goods funding (thus far the #1 use of the protocol treasury)   Building protocol owned liquidity   Funding grants / developers / etc. for the Uniswap Protocol specifically   Other things we can imagine!    Should the “fee switch” be turned on? I believe the answer to this question is “yes”. It should be turned on in a limited testing capacity. Doing this now will 1) provide us with real data and 2) provide the community more time to consider how assets accrued via this mechanism should be used. At this point, it’s too large of an unexplored design space to neglect. As mentioned already, this will not increase fees for people using the protocol to swap. It will simply retain a small portion of what is currently being paid out to liquidity providers. What are the next steps? Uniswap V3 sets fees on a per pool basis. This means we can turn the fees for a limited set of pools. We can analyze the impact this change has and use results to discuss. I’m suggesting a simple standard – if trading execution is not diminished for the pools with the “fee switch” turned on – the experiment is a success. I suggest we start with two of the largest pools, one stable <> stable pairing and one stable <> volatile. I also suggest we start with the lowest possible setting of 1/10. Based on recent data, these modest changes should accrue $20-$40k per day to the protocol. According to this Dune dashboard, total LP fees over the last 7 days have been $9.5 million. Assuming the lowest possible setting (1/10) that’s 950k per week the protocol hypothetically could be accruing. The cost of inaction is high. Specification:  USDC / ETH @ 0.05%, initialize 1/10 “protocol fee” USDC / USDT @ 0.01%, initialize 1/10 “protocol fee”  Feedback! This is an important decision, let’s discuss! In accordance with governance procedures, I’ve created a temperature check vote here: Snapshot ",
                    "links": [
                        "https://snapshot.org/#/uniswap/proposal/0x4dd49ee723a7e506c6c6c15c8eabc8a7057f3f0760e44ed2f475d42203c4e3e8",
                        "https://gov.uniswap.org/t/consensus-check-fee-switch-pilot/17384",
                        "https://gov.uniswap.org/t/fee-switch-pilot-update-vote/19514",
                        "https://gov.uniswap.org/t/fee-switch-pilot-update-vote/19514/50",
                        "https://gov.uniswap.org/t/uniswap-proposal-an-alternative-use-case-for-the-fee-switch/20779"
                    ],
                    "GPT-summary": "The author of the post is proposing the implementation of a \"fee switch\" in the Uniswap protocol, which would allow the protocol to retain a portion of what is already being paid to liquidity providers. The author argues that this would provide UNI token holders with new tools to leverage in furthering the growth and mission of the protocol. The post suggests turning on the fee switch in a limited testing capacity and starting with two of the largest pools. The author also invites feedback and discussion on the proposal.",
                    "GPT-proposal-categories": [
                        "Token economics",
                        "Grants, Funding and resource allocation",
                        "Interoperability and Scaleability",
                        "Law and regulations",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.651374072356216
                },
                {
                    "author_link": "https://gov.uniswap.org/u/jcp",
                    "index": "2",
                    "likes": "12",
                    "time": "19/07/2022-00:57:21",
                    "content": "Like the proposal and discussion. I think a major consideration here is whether or not liquidity providers remove liquidity as a result. Given that we don’t know for sure how this type of change would play out, I think using 2 of the largest and most important pools is pretty high risk. Personally, I would prefer to try something like this on a couple of smaller but significant pools to start before going this big, but this discussion is interesting and I’m following along. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.144791666666666
                },
                {
                    "author_link": "https://gov.uniswap.org/u/tobyshorin",
                    "index": "3",
                    "likes": "14",
                    "time": "19/07/2022-01:00:35",
                    "content": "Large-scale LPs are conspicuously absent from a lot of the discussion on this forum and it would be really beneficial to hear from them in this discussion. If you are a LP, especially on the USDC / ETH and UDSC / USDT pools, consider this an invitation to make an account if you haven’t got one and comment. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/monet-supply",
                    "index": "4",
                    "likes": "6",
                    "time": "19/07/2022-20:05:47",
                    "content": "Cosigning @jcp comment above. I think it would be better to start out with less important pools / pools that provide relatively less utility to traders. Eg. switch the USDC/USDT 0.01% pool for the 0.05% pool, and USDC/ETH 0.05% pool (arguably highest utility pool on Uniswap v3) for 1% pool. This positions the proposal as somewhat of a win-win; if LPs are put off by the protocol fees, they may be interested to move their liquidity to the lower fee tier pools which would provide improved utility to the Uniswap ecosystem. ",
                    "links": [
                        "https://info.uniswap.org/#/pools/0x7bea39867e4169dbe237d55c8242a8f2fcdcc387"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.680555555555555
                },
                {
                    "author_link": "https://gov.uniswap.org/u/wilsoncusack",
                    "index": "5",
                    "likes": "4",
                    "time": "19/07/2022-20:32:51",
                    "content": "Seems like to get the best data we should select a sample of pools, varying in  fee tier liquidity trade volume  Trialing with too few pools could lead to a lot of disagreement about what was actually learned. Ideally have maximal parity in the size and composition of the control group and test group. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.125
                },
                {
                    "author_link": "https://gov.uniswap.org/u/massnomis",
                    "index": "6",
                    "likes": "0",
                    "time": "19/07/2022-22:02:40",
                    "content": "The largest pools that can be reasonably coordinated are the 5bp and 1bp DAI/USDC. 1.5 billy between them, what do you think @monet-supply? I’m sure this would be a great move with makerdao. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Buckerino",
                    "index": "7",
                    "likes": "2",
                    "time": "19/07/2022-23:53:20",
                    "content": "I think at this stage the fee switch should not be the highest priority on the list for the UNI token holders. Restructuring the community, streamlining the governance process, providing white glove support for proposals should all be prioritized first and then implement limited fee switch. Personally, I believe this would bring more value to the UNI token holders, but Im not against it in principle. I feel like @monet-supply points are valid. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.678571428571429
                },
                {
                    "author_link": "https://gov.uniswap.org/u/PierreYves",
                    "index": "8",
                    "likes": "5",
                    "time": "20/07/2022-02:05:33",
                    "content": "One idea I’d like to propose is to potentially use the fee switch to incentivize LPs to lock their liquidity on Uniswap. Incentivizing LPs to lock their liquidity within specific ranges for certain periods of time would make Uniswap TWAP oracles provably harder to manipulate (ref: https://blog.euler.finance/eulers-oracle-risk-grading-system-93f47d68205c). Safer oracles would make it easier for lending protocols to adopt Uniswap TWAP oracles instead of relying on more centralized solutions like Chainlink. I think it could be an interesting way to experiment with the fee switch for the following reasons:  Safer oracles would benefit the whole DeFi space; Over time this initiative could lead to Uniswap TWAP oracles becoming the gold standard in DeFi; All of the fees would still go to LPs, therefore potentially limiting the loss of pre-existing LPs as the fee switch is enabled; The fees would compensate longer focussed LPs over Just In Time liquidity providers; This initiative would be quite easy to roll back if it fails vs paying $UNI holders a dividend.  Just my two cents. Curious to see if there is any interest in this! ",
                    "links": [
                        "https://gov.uniswap.org/t/fees-switch-follow-up-supporting-the-evolution-of-uniswap-protocol-design/20751"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.52420634920635
                },
                {
                    "author_link": "https://gov.uniswap.org/u/BP333",
                    "index": "9",
                    "likes": "4",
                    "time": "20/07/2022-03:09:01",
                    "content": "I’m from Gamma Strategies, which is an active liquidity manager on Uniswap v3, and I will say that USDC / ETH is one of the hardest pairs to be profitable on due to the lack of correlation between the two assets which leads to higher impermanent loss.  The fees are desperately needed to offset any IL in that pair.  So, I would not take fees away from USDC / ETH.  It’s one of Uniswap’s most dominant pairs, and any fees taken away from that pool will likely diminish Uniswap’s market dominance. USDC/USDT 1 bps fee tier pool is extremely dependent on fees to make a respectable profit as well.  The margins are razor thin already.  Curve and CEXes also do offer respectable competition for these swaps. I guess the main purpose of this test is to see how much liquidity would leave after implementing a fee switch? I think that’s a dangerous game.  The AMM design of Uniswap v3 was genius in that the concentration of liquidity allowed it to have an amplified effect, which got Uniswap 80% trade volume market share on a fraction of the TVL, but I don’t think it should get too cocky or complacent with that lead.  Other AMMs like Curve v2, Sushi, Quickswap, Orca, and Shell Protocol are all developing their own concentrated liquidity platforms, which will likely make some dent in the trade volume market share of Uniswap in the future. Uniswap seems to be very well capitalized and endowed with a lot of funds for protocol development.  They even have enough funds to make venture investments of its own. So why is this needed?  Protocol owned liquidity is great, but it need not come from the fees.  I would rather see Uniswap fund these developments via providing liquidity in their own pools.  There are plenty of stable-stable pairs where good income can be made through either incentives programs provided by other protocols (such as Frax Finance and Angle Protocol, which offer double digit yields on Uniswap’s stable-stable pairs) and via leveraged stablecoin liquidity providing.  Thus, I’d rather see Uniswap bring in this income via liquidity providing in their own pools versus taking fees away from the LPs.  Its double benefit that way where you increase Uniswap’s liquidity and maintain a competitive edge over other AMMs that are vying to take market share away from Uniswap. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.525537634408602
                },
                {
                    "author_link": "https://gov.uniswap.org/u/ConcernedLP",
                    "index": "10",
                    "likes": "4",
                    "time": "20/07/2022-06:22:20",
                    "content": " It will simply retain a small portion of what is currently being paid out to liquidity providers.   I also suggest we start with the lowest possible setting of 1/10.  10% of the fees from any pool is not a small portion, especially when the LP still has to consider impermanent loss. Those fees are often the difference between profit and loss.  LPing on V3 is already challenging enough. I can understand concentrated liquidity managers and others building on top of Uniswap charging fees for managed services. But the base layer? 10 percent of all fees?! Just like in government or business, if you’re going to create taxes or fees that make you less competitive and less capital efficient, you should probably have a rigorous plan of how you wish to spend those funds. A plan with accountability that benefits the protocol, UNI holders, and LPs (especially LPs in this case).  Public goods funding (thus far the #1 use of the protocol treasury) Building protocol owned liquidity Funding grants / developers / etc. for the Uniswap Protocol specifically Other things we can imagine!   This is not an acceptable plan. The last one is particularly concerning. Just fund whatever you want because you can? That’s defi education fund vibes. Seriously consider reducing the % of the fees you are seeking, create a spending plan for any raised funds, and create a backtest for a variety of pools (small, large, stable-stable, stable-eth) before you just stick it to the LPs. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.829294217687075
                },
                {
                    "author_link": "https://gov.uniswap.org/u/ArtemFrantsiian",
                    "index": "11",
                    "likes": "0",
                    "time": "20/07/2022-11:58:03",
                    "content": "So, If Uniswap invests money received from fees to handle impermanent loss issues somehow, will it be a win-win? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/BP333",
                    "index": "12",
                    "likes": "0",
                    "time": "20/07/2022-12:23:31",
                    "content": "Can we think of other ways to generate income without exerting this negative pressure on LPs?  I think there are plenty of other ways to generate this income via delta-neutral liquidity providing in Uniswap’s own pools, which have a positive as opposed to negative effect on the amount of liquidity.  Also, it does not seem that Uniswap at this moment is strapped for cash given its recent venture investments. Taking fees away from LPs should be a last resort.  Let’s explore other income generating ideas first that don’t have this negative effect on the LPs. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 4.910123966942149
                },
                {
                    "author_link": "https://gov.uniswap.org/u/BP333",
                    "index": "13",
                    "likes": "0",
                    "time": "20/07/2022-12:29:39",
                    "content": "Unless the opportunity cost of capital is a Curve pool versus a lower fee tier Uniswap pool ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/hek",
                    "index": "14",
                    "likes": "2",
                    "time": "20/07/2022-13:02:57",
                    "content": "Would love to see a DeFi protocol act more as a protocol than a business personally.  Most protocols are charging their TradFi analogue level fees currently. A small %ge over a looooong period of time (hundreds or thousands of years if all plays out well for Ethereum/Humanity) is a better realization of the capital efficiency crypto promises than taking larger middle-men level cuts. Unpopular opinion probably but meh. That’s what one random guy on the internet thinks. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.892857142857143
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Leighton",
                    "index": "15",
                    "likes": "0",
                    "time": "20/07/2022-13:44:06",
                    "content": "I think you and @jcp have a good point. How do you think about the value of varying the assets vs. varying the fee tiers? To me it makes a bit more sense to use the same low fee set but on trading pairs with less volume. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 6.033333333333333
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Leighton",
                    "index": "16",
                    "likes": "1",
                    "time": "20/07/2022-13:47:19",
                    "content": " 10% of the fees from any pool is not a small portion  This is the smallest portion the code allows, it’s impossible to set it lower.  This is not an acceptable plan. The last one is particularly concerning. Just fund whatever you want because you can? That’s defi education fund vibes.  The whole point of my post is that I am suggesting NO PLAN for how these accrued tokens might be used. I’m explicitly trying to separate the testing of value accrual from how / if that value is disbursed.  create a backtest for a variety of pools (small, large, stable-stable, stable-eth) before you just stick it to the LPs.  Agreed on being more thoughtful on what pairs this is tested on. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.382936507936508
                },
                {
                    "author_link": "https://gov.uniswap.org/u/eek637",
                    "index": "17",
                    "likes": "5",
                    "time": "20/07/2022-14:00:05",
                    "content": "Speaking for Avantgarde here, I agree with @Buckerino’s sentiments almost entirely. I’m pro-experimentation but think this proposal is riskier than it seems on the surface. The risk in my opinion doesn’t necessarily come from the action of turning on the fee switch itself, and indeed I think that liquidity providers should build their businesses around the assumption that that happens some day in the future. Instead, I think the decoupling of two distinct but related questions (“Can the protocol charge fees” and “What will the protocol do with the fees that it earns”) is where the danger lies. Uniswap’s governance is still in its formative stages and though the past year has seen some positive outcomes, kicking the can down the road and trusting that we’ll figure out how to manage and deploy this income stream is not a good look. It’s irresponsible to make a foundational shift in the economics of an entire set of users without telling them why that shift is being made. And this is not even taking into account the regulatory risk to token holders which, \\ __o __/, I’m not qualified to speak on. With that said, there is definitely an opportunity to fund research around this topic so that we can make a more comprehensive plan on how to change a key tenet of the biggest dex in the market and arguably the most important protocol on Ethereum. Off the top of my head, I’d like to have as a start:  a framework for categorizing pool types. @wilsoncusack gets at this a bit in his post but I think a more rigorous quantitative and qualitative definition would be useful in figuring out a) how to test and b) assuming test results positive, how to roll out to all existing pools a plan for converting long-tail shitcoins into useful stables (a la 1Inch) and a backtest run on that plan including a sensitivity analysis on what happens when LPs leave in varying quantities.  I would be hugely supportive of anyone that wants to propose that type of research and am happy to be a sounding board for anyone that’s thinking along those lines. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.958122895622896
                },
                {
                    "author_link": "https://gov.uniswap.org/u/lpuniswap",
                    "index": "20",
                    "likes": "0",
                    "time": "20/07/2022-16:32:45",
                    "content": "I just created an account. I am an LP in uniswap v1, v2 and now in v3. The only reason I am a LP is because the fees. I am against reducing this fee in any way of form. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely negative feedback on proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/guil-lambert",
                    "index": "21",
                    "likes": "12",
                    "time": "20/07/2022-19:44:18",
                    "content": "TL;DR: I am 100% supportive of this proposal to add the 1/10 protocol fee to a selected number of “sister” pools. I propose to first activate it for the following pools:  DAI-ETH-0.05% USDT-ETH-0.3% USDC-ETH-1%  The Uniswap Grants program (or internal research) should then study the effects of the protocol fee on LP revenue to guide the general decision-making process for fee activation.   I think a major consideration here is whether or not liquidity providers remove liquidity as a result.  The impact on the revenue liquidity providers for doing so will be minimal, here’s why. First, one has to understand where fees come from. While fees obviously result from trading activity, the way orders are routed play an important role in how much volume each pool gets. Transactions will always be routed to the pool that minimizes the slippage, which means that the 0.05% fee pool will “allow” more transactions through because it will always capture all transactions between 0.05% and 0.3% slippage limit. We can see the price of each pool and the number of transactions in each pool for the ETH-USDC pools:  image1920×1053 93.9 KB  Note how the price in the lower left panel is much finely-grained for the 0.05% than for the 1% pool. However, the 1% pool sees larger jumps between trades. But each of these pools should track the same price and, by association, each pool should have the same properties, including the fees collected and the price’s realized volatility. How does volatility relate to LP revenues? I explicitly derived this relationship between volatility (which is related to expected revenues), feeTier, liquidity and dailyVolume in several post (this post is the most relevant), and it is given by  image1400×221 68.8 KB  where gamma γ is the feeTier+protocolFee, and LP revenue is ~Impl.Vol * √timeInPool Therefore, regardless of the feeTier+protocolFee, each pool of the same asset pair should generate the same amount of fee per unit of liquidity. An intuitive way to think about this is that if PoolA generates less revenue than PoolB, then rational LPs will relocate their liquidity to PoolB to capture that edge. This is also true if we look between the ETH-stablecoin “sister pools” like ETH-USDC/DAI/USDT: they should all generate the same revenue as long as the keep the same peg, and that means they should all have the same implied volatility. Is this really a valid assumption? If we look at the implied volatility as derived above for all ETH-stablecoin pairs, we see that the IV for all pool are somewhat consistent at around 130% for most pools:  image1920×995 92.2 KB  hint: rational LPs should re-deploy liquidity to the high IV pools to maximize revenue There are a couple of outliers, but let me focus on the USDC/ETH pools:  USDC/ETH 0.05%: IV = 116% USDC/ETH 0.3%: IV = 131% USDC/ETH 1%: IV = 125%  While each pool has a different feeTier, transaction routing means that each pool gets a different amount of daily volume, and this daily volume is matched by a different amount of “tick liquidity” that minimized slippage. This, in a way, magically brings them all within a similar implied volatility and LP revenue range, but there is no clear trend (we have IV: 0.3% > 0.05% > 1%, but volume is: 0.05% > 0.3% > 1% and tickTVL is: 0.3% > 1% > 0.05%). Hence, I predict that activating a 1/10 protocol fee to any one of those pools would re-shuffle some of the liquidity provisioning, but all pools will still converge to the same IV and LP revenue at the end of the day. So, I propose that the Uniswap Governance enables the 1/10 protocol fees for a few ETH-stablecoin sister pools and use the Uniswap Grants program (or internal research) to study the effects of the protocol fee on LP revenue. The pools could be:  Dai/ETH 0.05% ETH/USDT 0.3% USDC/ETH 1%  Or any combination of ETH-stablecoin pools across non-overlapping feeTiers. ",
                    "links": [
                        "https://lambert-guillaume.medium.com/on-chain-volatility-and-uniswap-v3-d031b98143d1",
                        "https://global.discourse-cdn.com/business6/uploads/uniswap1/original/2X/9/9d4d4ffca945287d17b833c013c5f26edf8e1a36.png",
                        "https://global.discourse-cdn.com/business6/uploads/uniswap1/original/2X/e/edf61e97b83406000e50a32f7d673f7e596f4315.jpeg"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5006340579710145
                },
                {
                    "author_link": "https://gov.uniswap.org/u/rfritsch",
                    "index": "22",
                    "likes": "3",
                    "time": "20/07/2022-22:13:40",
                    "content": "Super interesting discussing so far! Two things, I’d like to add:   We’ve recently done some research related to the fee switch question. More precisely, we modelled how high the take rate (or “protocol fee”) should optimally be. For more details, see this post: Research on the Fee Switch That being said, for the beginning, the lowest possible value, i.e. 1/10 = 10%, as suggested by the proposal, is probably a good choice.   One crucial question that could be answered by experimenting with the fee switch, is measuring how strong Uniswap’s moat is over other DEXs. (In a fully rational market, the DEX with the lowest protocol fee should attract most liquidity and volume. But in reality, Uniswap, as the clear market leader, likely has an competitive advantage over other DEXs, and can afford a higher protocol fee. The question is, by how much?) However, one Uniswap v3 pool of course has no moat over another. So this effect could not be measured, if the fee switch is only flipped for one fee tier for a certain pair. Instead, flipping the switch for all fee tiers for a certain pair could be considered (maybe for a “less important” token pair?).   Finally, a more philosophical thought  In the long run, it might be inevitable that a part of trading fees goes to UNI token holders - simply due to the fact that exactly these token holders can decide on the matter. The longer token holder receive no rewards, and the lower the expectation of this happening in the future becomes, the more the value of UNI tokens declines. Until at some point, it becomes cheap enough for someone to buy a sufficient amount of UNI tokens to vote to distribute fees to token holders (including themselves). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.962914862914863
                },
                {
                    "author_link": "https://gov.uniswap.org/u/BP333",
                    "index": "23",
                    "likes": "0",
                    "time": "21/07/2022-00:38:43",
                    "content": "Hey @guil-lambert, Love your analysis as always!  One of the things that I think we need to be aware of is not just the allocation of trade volume and the IV of strictly the Uni v3 pools, but the effect this would have in diverting the trade volume away from Uniswap as a whole to another AMM when using a DEX aggregator.  Small divergences in liquidity could lead to leakage of trade volume that would have been allocated to Uniswap.  I think it’s a mistake to assume that the fee switch would involve liquidity or volume moving to a different Uniswap v3 pool as they could just leave Uniswap entirely! For example a 10 ETH trade for USDC on Paraswap does not even make it to a Uniswap v3 pool as the price impact would be lower going through Paraswap’s pools instead.  image1790×896 105 KB  So, I can’t imagine that any further restrictions on liquidity such as a fee switch would help us in competing as a whole against other AMMs when it comes to DEX aggregators.  Therefore, I think a technical analysis needs to include how a fee switch could affect our competitiveness on DEX aggregators as well. But more importantly, before we even get there, I wish there was more clarity and information given on whether implementing a fee switch is really the best way to achieve the outcomes we’re trying to accomplish.  I’m not so sure.  What alternatives are there to implementing a fee switch in getting the revenue that we need to get?  I worry that this sets a dangerous precedent and moral hazard issues when it comes to a treasury that is flush with trade fee revenues.  Like it hasn’t been made entirely clear what specifically these funds would be used for.  Like what kinds of public goods?  Like the DeFi Education Fund?  I sure hope not. I’d rather we have the specific goal in mind first before getting the funds.  Right now, it seems like we’re getting the funds first and then figuring out what to do with them.  It creates a moral hazard in my opinion.  Right now the UNI distribution is still very much concentrated in the hands of a very few influential parties.  I would wait for a more decentralized distribution of UNI before implementing this kind of power. Research without actually implementing the fee switch is certainly possible thru backtesting.  Using the pretenses of “research,” to actually implement a fee switch into production for the first time is a very dangerous precedent. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.762355212355212
                },
                {
                    "author_link": "https://gov.uniswap.org/u/ConcernedLP",
                    "index": "24",
                    "likes": "0",
                    "time": "21/07/2022-02:11:48",
                    "content": " This is the smallest portion the code allows, it’s impossible to set it lower.  Is that a feature or a bug? It seems kind of silly to be limited to such a large increment increase. Can this be changed?  The whole point of my post is that I am suggesting NO PLAN for how these accrued tokens might be used. I’m explicitly trying to separate the testing of value accrual from how / if that value is disbursed.  But this plan does propose how these funds might be used, by suggestion and omission. The glaring one is no distributions to UNI holders. I get what you’re saying, but any fee switch is inevitably going to discuss the trade-offs from taking said fees. Just like a tax increase, someone has to pay for this, and someone gets to spend the money on something. I think that is the most important part of a fee switch scenario. If this is just a test in prod of how the fee switches will affect liquidity, the LPs, and determine fee generation/mechanics, I would suggest conducting a controlled test over a specific period of time. Then stopping to assess the test. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.307359307359308
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Brenner",
                    "index": "25",
                    "likes": "0",
                    "time": "21/07/2022-03:06:34",
                    "content": " The purpose of this post is make clear UNI governance has two very different decisions to make 1). should a fee switch be turned on? and 2) how should fees be utilized?  I agree these are separate decisions. I think they are being asked in the wrong order. The first decision should be the business decision: What is Uniswap looking to fund, and to who’s benefit? Only then should we think about the financing decision: How are we going to fund what we want to fund? Said another way: By taxing LP’s fees by 10%, you’re implicitly saying “Uniswap governance knows what to do with this 10% of these fees better than you do”. I agree with @Buckerino’s point that it’s not the most important question. I think the most important question is “What is goal/mission of Uniswap and its treasury?” Until that question is answered, along with how funds would be allocated to further that goal, it doesn’t make sense to divert fees from LPs to the treasury. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.977272727272727
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Flipflop",
                    "index": "26",
                    "likes": "1",
                    "time": "21/07/2022-08:57:39",
                    "content": "I just created an account to voice my concerns as liquidity provider about this idea. It’s an absolute bad idea to me. Taking 10% of the fees away from LP’s is an enormous cut.  That 10% is often the difference between making a gain or a loss. If the Fee Switch would be 1-2% I could live with it as liquidity provider. In the case that the 10% fee would be introduced I would remove my liquidity and use my capital somewhere else. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.545454545454546
                },
                {
                    "author_link": "https://gov.uniswap.org/u/MRKWH",
                    "index": "27",
                    "likes": "0",
                    "time": "21/07/2022-09:23:54",
                    "content": "Meanwhile Kyberswap, fee switch fully enabled and no shenanigans on getting around of paying it to holders. Concentrated Liquidity tick-based or as LP tokens both. Deployed on 12 chains. Faster in deployments (see OP 0.01% fee tier). All Uniswap has at this point is the brand. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party comparing proposal to a similar existing solution"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Nickpcity",
                    "index": "28",
                    "likes": "0",
                    "time": "21/07/2022-15:20:01",
                    "content": "I am for using a fee on strategic pools as @guil-lambert has stated. It is true that if you charge a fee on only a part of the fee levels, the liquidity will spread out to where it is treated best. The idea is maximum extraction of value for minimum effects on liquidity. I would also restrict fees from full-range liquidity positions, since they protect from long tail events, but are inefficient during normal conditions. At the same time, I do not think the specific plan matters for the revenue, and starting small and gathering some empirical evidence minimizes the risk for the protocol ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.6499999999999995
                },
                {
                    "author_link": "https://gov.uniswap.org/u/tobyshorin",
                    "index": "30",
                    "likes": "4",
                    "time": "22/07/2022-18:04:58",
                    "content": "I’d like to offer an alternative perspective on some comments I’m seeing. @ConcernedLP, @Brenner, @Buckerino and @eek637 have all voiced concerns along these lines:  Fee switch is not high priority at this stage, and other projects are higher priority Uniswap Governance needs to figure out what it wants to even spend funds on first  Other Internet has studied Uniswap governance extensively and has talked to stakeholders of many different types, and while I hear these concerns, I do not believe they are entirely correct.   Part of the reason for general governance inaction in Uniswap is, in fact, the lack of non-UNI funds in the treasury. Without stables or more liquid currencies like ETH to spend, the UNI token must be liquidated every time a significant opportunity arises. We currently are in a situation in which UNI selloffs to service providers, public goods projects, and grantees that exert downward price pressure on the token in the long run. (Recall the significant backlash about UNI price when DeFi Education Fund liquidated $12.5m in one day). Moreover, generating assets in the treasury that can be spent on protocol growth and expansion makes the governance token more valuable. Recently governance nerds have been obsessed with NounsDAO, a protocol with extraordinarily high levels of governance activity. The number one reason Nouns has generated such a high volume of proposals is that it has significant treasury holdings, spending of which do not dilute Noun holders’ token value. Everything we’ve seen so far suggests that if Uniswap were generating even $10k of ETH & USDC in fees per day, we would likewise see a much higher volume of governance activity and proposals on this forum.   Firstly, we have to stop referring to “Uniswap Governance” as a monolith. What we are is a collection of actors with very different incentives. Uniswap is very poorly structured from an ownership perspective, having airdropped to all classes of users. This makes it incredibly unrealistic for people to come together to intentionally decide what to fund at the current moment. Outside of an off-site retreat for major UNI voters, I don’t see a good way to reach consensus on this. OI has taken some responsibility for advocating for specific outcomes we’d like to see here; one of these is the creation of concentrated centers of authority, such as an expanded version of Uniswap Grants Program with a bigger mandate, who we believe would be suitable to set specific goals and drive specific visions. In lieu of these authority centers existing right now, I believe that the higher volume of proposals stimulated by more liquid assets in the treasury would incentivize a greater degree of competition and higher quality proposals brought to this forum. Right now delegates have too little work to do. Perhaps this is idealistic, but more competition among a higher volume of proposals would force all of us to be more selective and evolve a set of criteria for treasury spend.   A final comment is that nonnative assets in the treasury would make it easier to conceive of spending money on things like paid delegation programs, which would overall improve the quality of governance. In short, I can’t conceive of the fee switch initiative as low priority. The fee switch is one of the few clear on-chain levers we have available to us to drive more governance work and better outcomes at this time. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.670119047619048
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Brenner",
                    "index": "31",
                    "likes": "1",
                    "time": "22/07/2022-20:26:46",
                    "content": "    tobyshorin:  Part of the reason for general governance inaction in Uniswap is, in fact, the lack of non-UNI funds in the treasury. Without stables or more liquid currencies like ETH to spend, the UNI token must be liquidated every time a significant opportunity arises.   There are two ways to get non-UNI funds into the treasury.  Sell UNI from the treasury, which impact UNI holders (by decreasing the price) take a portion of LP fees, which impacts LPs (by taxing them)  Assuming LPs are providing liquidity out of pure economic interest, to impose #2 on LPs, the case has to be made “this tax will improve your economics in the long run”. I have looked through everything I can find from/on Uniswap, and I cannot find a stated goal or mission.* I agree that having some amount of ETH or USDC in the treasury might attract more proposals. But without having a more clear goal or mission for UNI holders and arguably more importantly, for LPs to get behind, the fee switch is a hard case to make. A world in where I see turning on some fees working:  State the goal of UNI is to create the deepest liquidity and thus the best to trade in the universe Pick a number: $5m, $10M, and turn fees on for less important pools until that number is reached, and then turn them off. It’s a seed round. Fund individuals / teams that are directly aligned with the stated goal of UNI.  Long term, I think fees on top of LP fees instead of taking a portion of the LPs’ fees is more sustainable. It affects LPs less, and doesn’t directly drive liquidity to other AMMs.  Which can or may be separate from Uniswap Lab’s goal or mission. Since it’s a C-corp, by default it is “make a return on investment for shareholders”. And I’m sure they have their own way(s) they plan on doing that, separate from the fee switch.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.074862637362637
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Leighton",
                    "index": "32",
                    "likes": "1",
                    "time": "24/07/2022-21:55:33",
                    "content": "I like some of this thinking, specifically #2. I’ve been thinking of it being more time bounded though rather than focused on acquiring a specific amount of capital. i.e. run this experiment for 90 days after which fees revert to 0%. Functionally somewhat similar to what you are suggesting but IMO simpler because you avoid needing to determine any specific usage of capital. As stated in my original post, I think that is crucial to keep the discussion simple and empirically driven. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.609375
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Cliff.eth",
                    "index": "33",
                    "likes": "1",
                    "time": "25/07/2022-17:36:25",
                    "content": "This is a good point. My gut tells me that instead of removing liquidity, LPs will go and buy UNI token… Most LPs love the protocol and will be willing to contribute more capital to the ecosystem by buying UNI token. I also would like feedback on my Temperature check here, for UNI-based Fee Tiers. Upon turning on the fee switch, this would provide additional incentive for LPs to buy UNI instead of withdrawing liquidity.     Temperature Check - UNI-based Fee Tiers Temperature Check       Hello Uniswap Community!  I’d like to propose a change that enables lower trading fees for UNI holders.  Tier 1: Holders of 1k-5k UNI pay a 25bps fee on trades on Uniswap.  Tier 2: Holders of 5k-25k UNI pay a 20bps fee.  Tier 3: Holders of 25k+ UNI pay a 15bps fee.  Of course there can be more tiers (if we wanted to be fancy… we could even design a curve [Amt_UNI vs Fee_Bps]).  Lmk if any folks are interested in discussing this. I believe it makes sense for those who hold the core asset of the p…     ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.375
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Cliff.eth",
                    "index": "34",
                    "likes": "4",
                    "time": "25/07/2022-17:44:55",
                    "content": "For example, Imagine you are an LP and the fee switch is turned ON. What do you say to yourself? You say, “Ok, now I am making less return because we are paying UNI holders. What should I do?” Let’s explore that – What can you do? Option 1) Move liquidity to another AMM that is far less reputable and has far less growth momentum, or Option 2) Buy UNI tokens so that i) you partake in the fees switch being turned ON, ii) partake in any other future utility ascribed to the UNI token, iii) continue accruing significant fees as an LP on Uniswap, iv) gain voting power in Uniswap governance. I’d choose option 2 all day, everyday. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.125
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Brenner",
                    "index": "35",
                    "likes": "0",
                    "time": "25/07/2022-18:01:45",
                    "content": "    Leighton:  because you avoid needing to determine any specific usage of capital.   This is the crux of where you and I disagree. As an LP, why would I want to be taxed without any explanation as to where my taxes are going? LPs are here to trade IL risk for fees. Theoretically, UNI holders hold UNI because they are aligned with UNI’s goals (which aren’t even explicitly “make the value of UNI go up”). If UNI leadership wants more eth/usdc in the treasury to prove out UNI’s ability to allocate capital efficiently towards UNI’s goals in a way that is net-positive to LPs, I think they should sell enough UNI to reach that number. Only then, with some track record for LPs to look at, should the ask for capital be directed to LPs ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.583333333333334
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Leighton",
                    "index": "36",
                    "likes": "1",
                    "time": "25/07/2022-18:22:43",
                    "content": "    Brenner:  Assuming LPs are providing liquidity out of pure economic interest, to impose #2 on LPs, the case has to be made “this tax will improve your economics in the long run”.   Taking your assumption as true. The “why” actually doesn’t matter at all to LPs. If they are purely acting in economic interest they will leave if it no longer benefits them and return if / when it does benefit them. There would be no reason to stay in anticipation that it might benefit them more in the future. They would simply return at that future time. The “why” does not matter to an LP acting purely in economic interest. Perhaps there is some subset of LPs that don’t act purely in economic interest and therefore might stick around solely based on a “why” but I doubt that is a large amount. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.676190476190476
                },
                {
                    "author_link": "https://gov.uniswap.org/u/research",
                    "index": "37",
                    "likes": "1",
                    "time": "26/07/2022-09:57:35",
                    "content": "Hey, LP speaking, I think this proposal is great, whichever form it takes. However, the ratio should be carefully considered. Taking away 10% of revenues from LPs risking impermanent loss etc… Might be considered too high. On the other hand, LPs are indeed interested in seeing Uniswap have more assets to incetivize development and innovation. Instead of doing a unilateral proposal for fee switch with predetermined parameters, I think an invite to LPs should be done and ask what would be an ideal fee switch for them to decide to provide more liquidity, in different pairs, for example. I think this kind of proposal should be really discussed with LPs, a roadmap should be designed, and the future should not be uncertain, the opposite as Uniswap only exists because of the LP-protocol relationship. Having said that, until april 2023, Uniswap has a form of protection, what will happen after that, what about VCs, using the Uniswap code, forking it and developing for stocks for example… So many questions out there, but honestly, I feel like the fee switch is something that could benefit everyone if enacted properly. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.190277777777777
                },
                {
                    "author_link": "https://gov.uniswap.org/u/research",
                    "index": "38",
                    "likes": "1",
                    "time": "26/07/2022-10:21:44",
                    "content": "After having read a lot of interesting comments, there is one crucial thing that comes to my mind, as a large LP on UNI V3. Decentralized governance is achieved through holding UNI tokens. If LPs want to have a say here, they should hold UNI tokens and vote on proposals. The power of UNI V3 is its safety and liquidity. Safety will not be impacted by the fee switch. Liquidity can be controlled by the fee switch, for example, do a proposal to award UNI tokens at a discount to LPs that commit to provide liquidity for a certain amount of time. That would be “money well spent” or some sort of incentive so that research can strive along the giants that provide for “gasoline”… ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.1607142857142865
                },
                {
                    "author_link": "https://gov.uniswap.org/u/alanalevin",
                    "index": "39",
                    "likes": "6",
                    "time": "26/07/2022-13:50:43",
                    "content": "Disclaimer: this comment was co-authored by Alana Levin and Derek Walkush, investment partners at Variant. Variant is an investor in the UNI token and Uniswap Labs, Inc. TLDR:  In favor of experimentation The experiment should test non-core pools for data points that map to the rest of Uni pairs; strong candidates include WBTC/USDC, DAI/ETH, and USDC/ETH The first fee switch worth testing may be one that generates non-UNI assets for the treasury; these funds should be used to incentivize ecosystem growth among other Uni stakeholders  Derek and I are in favor of experimentation with fee splits, and think the proposal outlined is incredibly thoughtful and a strong step in the right direction. Pool Analysis We agree that the biggest risk, as pointed out by several commentators, is a liquidity drain among core pools. As such, there’s likely a good middle ground of pools to test – ones that are not core pools (e.g., USDT/USDC and USDC/ETH, as pointed out by Monet Supply) but are still sufficiently large to gather data points that map to the rest of Uni pairs. Having relevant data points will help better understand the potential impact of broader / more widespread fee switch implementations. The optimal pool should satisfy the following conditions:  Relatively high Volume / TVL (APY) so LPing still remains profitable Relatively deep liquidity to not potentially drain important liquidity Ideally relatively similar valued assets to avoid potential IL increases  Below is an analysis of Uni V3 pools 11th-20th in TVL:  From the analysis, WBTC/USDC, DAI/ETH, and USDC/ETH (1% tier) seem to be suitable pools for experimentation. Fee Switch Design We’re supportive of directing a portion of the fees toward building non-UNI reserves in the treasury (with funds potentially stored in stables), in line with Toby’s comment. We agree that those funds should be invested in continued growth, e.g., funding grants, incentivizing integrations, and whatever else the community determines may help Uniswap grow. ",
                    "links": [
                        "https://gov.uniswap.org/t/fee-switch-design-space-next-steps/17132/30",
                        "https://gov.uniswap.org/t/fee-switch-pilot-update-vote/19514/38"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.0929012345679014
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Leighton",
                    "index": "40",
                    "likes": "0",
                    "time": "26/07/2022-23:10:30",
                    "content": "I agree it would be nice to test this on pools that are a bit less important (measured by volume) but curious what you both think of @guil-lambert’s comment? It seems important to pick one stable / volatile pair and then compare across non-overlapping fee tiers with a consistent fee switch setting. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.152777777777779
                },
                {
                    "author_link": "https://gov.uniswap.org/u/alanalevin",
                    "index": "41",
                    "likes": "2",
                    "time": "27/07/2022-12:48:30",
                    "content": "It’s a good point, and our suggested pools are mostly in line with @guil-lambert’s argument. DAI/ETH (0.3%) and USDC/ETH (1%) are both stable/volatile pairs with non-overlapping fee switches, while still being in the top 11-20 pools by TVL. A solid candidate for a third pool to test might be ETH/USDT (0.05%) instead of our original WBTC/USDC suggestion. The key difference between these suggested pools and the ones @guil-lambert suggests is that our proposed pools rank much higher in TVL, which we think is important for simulating the outcome should new fee switch designs be implemented on more core pools. We do agree that having stable/volatile pairs and non-overlapping fee tiers is useful. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.100524475524476
                },
                {
                    "author_link": "https://gov.uniswap.org/u/randomishwalk",
                    "index": "42",
                    "likes": "2",
                    "time": "27/07/2022-16:34:55",
                    "content": "It is difficult to gauge the likely impact on LPs from a fee switch without understanding the state of profitability for LPs in various pools. The “Impermanent Loss in Uniswap v3” paper released in Nov’21 sampled pools representing ~50% of TVL and found that those LPs, in aggregate, are operating at a -30% margin. If this is still the case today, I don’t think it would suggest a lot of room for the protocol to extract revenue. To that end, has anyone seen a more updated version of this study or seen / has conducted similar analysis on LP profitability? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/research",
                    "index": "43",
                    "likes": "0",
                    "time": "27/07/2022-19:12:07",
                    "content": "I see a lot of good comments, good ideas, and good direction toward the question “how should the fee switch be enabled” - rather than -should we enable the fee switch\" - as this discussion matures, LPs will slowly but surely realize that the UNI token price is currently extremely low compared to what it will be when decentralized governance starts to really work out. This experimentation is amazing, thrilling, and it will probably be seen by others as one of the biggest revolutions in Web 3.0 if properly enacted. Probably a sort of “think-tank” should be put in place and the HOW should be discussed extensively. More than happy to participated. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.9375
                },
                {
                    "author_link": "https://gov.uniswap.org/u/papayajones",
                    "index": "44",
                    "likes": "0",
                    "time": "27/07/2022-20:53:43",
                    "content": "One problem with only enabling certain pools to “test” is you are now changing the properties of very similar pools. You’re very likely to see liquidity leave ETH/USDT 0.30% pool if you enable the fee switch because they can just join ETH/USDC 0.30% pool without the fee switch on. If you’re going to turn it on for a pool, it needs to be on all comparable pools (same/similar risk profile) if you actually want a proper test. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.178571428571429
                },
                {
                    "author_link": "https://gov.uniswap.org/u/willreid",
                    "index": "46",
                    "likes": "0",
                    "time": "27/07/2022-21:27:54",
                    "content": "Disclaimer: I work at Pantera Capital but views expressed are my own TLDR:  You can’t create protocol fees for free Either traders or LPs have to pay, and in practice both will A protocol switch will result in worse net pricing for traders  @guil-lambert’s post is excellent but could be slightly misleading - there isn’t, of course, any way to create protocol fees ‘out of thin air’ without the ‘tax’ being paid by someone. Guillaume suggests that liquidity reshuffling between fee tiers would create an equilibrium of LP fees per unit of liquidity provided, which is in theory completely correct. However, this equilibrium would either be:   a) Lower than the previous equilibrium - i.e., the protocol fee is ‘spread’ across all fee tiers (and ‘sister pools’ in theory) and still paid by LPs, albeit by each pool in a smaller amount;   b) The same/similar, but transaction routing moves trades to tiers with worse net pricing as a result of liquidity reshuffling, and so traders pay the fee;   c) Some combination of a) and b), which is what would happen in reality.   A key insight from a) is that a lower equilibrium fee switch, i.e., below the 1/10 minimum, could be applied to all LPs by only turning on the fee switch in select pools (as is being suggested for testing). To think about this differently, the current liquidity distribution is, of course, optimizing for LP revenue, which in turn is optimizing for maximum daily volume per unit of liquidity in each pool, which in turn is optimizing to give traders the best net pricing experience across the pools. Turning on a switch in any fee tier will alter the liquidity distribution and result in sub-optimal/worse net pricing across all tiers for a given pair/collection of ‘sister’ pairs. The traders who would have been trading in that pool on the margin will then either continue with their trade anyway (i.e., scenario b) or halt their trade entirely (scenario a). The extent to which scenario a or b occurs will be determined by the price sensitivity of the traders, which in turn will be determined by the availability of strong alternative protocols. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.454545454545454
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Cliff.eth",
                    "index": "47",
                    "likes": "2",
                    "time": "28/07/2022-04:16:41",
                    "content": "Thank you for this proposal. I agree that we must explore this design space. However, I think that you are not giving enough credit and consideration to the unique potential of UNI holders passively accruing fees simply by staking UNI. This possibility should neither be written off nor disregarded. Please consider this more carefully. The Uniswap protocol touches just about every compelling asset in cryptocurrency landscape by enabling permissionless liquidity provision. Now imagine staking UNI and passively accruing an entire portfolio of assets (volume-weighted by trading volume on uniswap). UNI, in this sense, could become the ultimate Web3 “fixed-income” asset. Holders of UNI can passively accrue every asset that trades on the protocol. This is incredibly powerful and unprecedented. Wealth managers across the world would pile into UNI simply to have this exposure, and accrue exposure for their clients to all Web3 assets trading on the Uniswap protocol.  Nothing like this has ever been done before. It’s magical, in a way. Eventually, we can assume that tokenized equities, fixed income assets, tokenized real estate, tokenized fiat currencies, tokenized derivatives/options/swaps/etc and much more may trade on Uniswap v3. And simply by holding the UNI token, one can slowly accumulate exposure to all these different assets… Imagine that. WoW! Incredible… You say at the beginning of your proposal: “I see an assumption that using the fee switch = money going to UNI token holders. I think this is limiting.” I disagree strongly. I don’t think this line of thinking is limiting at all. In fact, it is fascinating! I believe this is what UNI was in part destined to be… the primary asset that allows holders to accumulate and accrue a vast and diversified portfolio of positions across every Web3 asset that trades on the Uniswap protocol. To me, a veteran of traditional finance, this is simply an incredible opportunity for the UNI asset - and it should not be ignored. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.057098765432098
                },
                {
                    "author_link": "https://gov.uniswap.org/u/crypto_rachel",
                    "index": "48",
                    "likes": "3",
                    "time": "28/07/2022-05:35:59",
                    "content": "So the last community call got me thinking about the fee switch and ways to overcome all the obsticles there are in creating this outside of a contract The idea of testing this out with V3 having full control over which pools have this fee switch and how much my proposal is that we create a Staking contract in conjunction of the fee switch contract receiver, and also adding on a ERC20 Wrapped UNI where this wrapped Uni is used in a ETH/WUNI pool, allowing this to be unwrapped as well via contract. This would allow UNI holders to stake the uni and provide that wrapped UNI to the pool to limit loss from the fees lost in the LP, Also having a UNI/WUNI pool would allow routing through this pool with regular UNI token routes Now the main reason we can bring in UNI LP providers is that in this contract we would want to retain UNI Holder Voting rights, the Vote would need to be done via this contract and have a ipfs site to vote on, but by tracking and setting the users ability to send vote via the contracts holding of their UNI, this would allow them to still Vote, although a different delegate system would also have to be set up But by reducing the loss in LP fees and allowing UNI holders to keep their voting power, I do believe this would be enough incentive for LP providers of UNI token at least Obviously this would be a very complicated contract, but I do believe that this would offer a good incentive to open a Fee Switch Testing pool ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.17948717948718
                },
                {
                    "author_link": "https://gov.uniswap.org/u/WeAreAllSatoshiN",
                    "index": "49",
                    "likes": "0",
                    "time": "28/07/2022-10:20:26",
                    "content": "Can’t we combine these two things? Everyone who participated in governance gets 2x as those who only hold UNI tokens but not improve the protocol. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/research",
                    "index": "50",
                    "likes": "0",
                    "time": "28/07/2022-20:02:10",
                    "content": "Question is, what about UNI token becoming a security because of this. Also, can we make sure JIT MEV and other scalpers get double taxed ? Or something like that? Do they actually accrue value to the protocol ? Anyway, talk soon. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.825
                },
                {
                    "author_link": "https://gov.uniswap.org/u/DecentMusings",
                    "index": "51",
                    "likes": "2",
                    "time": "28/07/2022-22:33:17",
                    "content": "Wanted to try to give some constructive feedback as a UNIv3 LP and how the fee switch would affect profits and even the decision to LP at all or move liquidity elsewhere. As a constructive idea that will make this easier for LPs: The #1 aspect that affects LP profit is trading volume.  What if there is a way to have fee switch dialed up/down (0% to 100%) based on a pairs recent trading volume.   When volume is down, LP profits are down and the fee switch will be ‘felt’ more for LPs, when volume is up respective to some recent time frame, the fee switch could be dialed up to max and an LP may be fine with a portion of fees being deducted. Not quite sure how the time frame would work to decide how much to dial up/down fee switch, but just something that could help ease the LPs mind. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.7253086419753085
                },
                {
                    "author_link": "https://gov.uniswap.org/u/DeFiRaptor",
                    "index": "52",
                    "likes": "1",
                    "time": "29/07/2022-09:05:14",
                    "content": "What if we added 5-10% to the fees for the end users. Instead of 0.3% we would charge 0.33% and those that hold a certain amount of Uniswap and have it staked will not have to pay the extra fee + other incentives. **** Important **** I would want to see the fees generated being used to also provide liquidity for major pairs acting as a treasury for Uniswap holders where we can compound the rewards in major stable pairs like DAI/USDC further deepening liquidity for the protocol and protecting against those leaving LP. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.383928571428571
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Naught",
                    "index": "53",
                    "likes": "2",
                    "time": "29/07/2022-11:48:11",
                    "content": "It is better to make data based decisions, then assumptions about the outcome. A few items that is unknown till data is gathered is: -Is the liquidity sticky? If a fee switch goes on higher tier pools, do those LP’s move towards a lower tier fee or move to another platform? If the LP’s move to a lower fee tier, then this provides better liquidity, and pricing for traders (instead of “worse net pricing”). -Is the LP experience, trust and branding on Uniswap enough for LP’s to not mind a fee switch? I am for having the fee switch on higher fee tier pool’s and for the protocol to collect data on how LP’s in those pool’s react to make more informed decision’s. I am curious to your insight on how Pantera portfolio companies such as FTX, Bitstamp, Coinbase etc… are able to charge fee’s and make profit without losing trader’s/user’s. Is there a price sensitivity metric of the typical CEX user accross platform’s, or is there some other evaluation tool? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.645833333333333
                },
                {
                    "author_link": "https://gov.uniswap.org/u/dexman.eth",
                    "index": "54",
                    "likes": "3",
                    "time": "29/07/2022-12:13:28",
                    "content": "What an exciting conversation! Our community (Civilization) have been working over the past 12 months on building a decentralised hedge fund, with an initial priority focus on v3 liquidity mining. So we have collected a significant body of evidence, research and technical expertise. Rather intimate knowledge of the mechanisms surrounding concentrated liquidity. This proposal directly affects and changes our ability to generate a return for our community, and I feel it’s worth sharing my perspective for everyone’s benefit (in case anyone cares to follow up, please feel free to give me a shout @civ100 on Telegram). In my view, the “fee switch” is equivalent to a “revenues-based income tax”, similar to European-style VAT, whereby the government earns a % of revenues before anything is paid into the seller’s account. There are some technical differences, in who pays how much and how, but substantially the outcome is the same, minus the important “recover VAT on purchases” element, which makes VAT sustainable. As an income-generating entity, the LP provider will only get 90% of their earnings, whereby 10% is paid to the “government” (UNI governance). In this way, the “government” effectively can accrue a benefit equivalent to having up to $400mln of TVL invested = 10% of current total TVL of >$4 billion, assuming the fee will be switched on for all pools, which eventually would likely be, post-experiments. Crucially, the “government” doesn’t suffer any entrepreneurial risk, no impermanent loss, and doesn’t actually need to invest those $400mln. Is this beneficial, desirable and survivable for both Uniswap and UNI? Yes, for sure. Uniswap has a strong enough brand and technology lead for sustaining this over the medium term, beyond the initial experiment. The concentrated liquidity research was pioneering and market-defining, and I am sure Uniswap will continue to lead the rest of the DEFI market by a wide margin. However painful this will be for LP, who already contend with extremely razor-thin profits after hedging, this is unavoidable. Today, v3 is the only protocol with a chance of going mainstream. Also, this must be tested and implemented well ahead of the 2-year code-lock expiring, so it feels like the time has come. Writing and maintaining protocols is complex and expensive, and after all, there must be rewards for their authors, it’s only fair. But - will this be sustainable long-term? It depends. If the comparison reference is to the government’s VAT tax, then a 10% tax is relatively cheap when compared to a 20% VAT rate, or even higher in some countries. If the comparison is the government’s “revenues tax” levied by some countries on e.g. technology companies, then 10% is a lot: 2-3% is more common. However, crucially, if the comparison was to TradFi, I can’t begin to imagine how exporting Uniswap technology beyond DeFi could sustain this type of monopolistic margins. A traditional market-maker charged 10% of their revenues to access a platform just feels unreal. Market-making will need to be more profitable and easier than would be the case for v3 LPs after the fee switch, so the new technology can be equally beneficial to all parties. Long story short: I think the fee switch is inevitable, but in Uniswap v4 it better be brought to a lower level than 10%. This brilliant tech will then get the mainstream adoption it fully deserves! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.606601731601732
                },
                {
                    "author_link": "https://gov.uniswap.org/u/MattOnChain",
                    "index": "55",
                    "likes": "7",
                    "time": "29/07/2022-19:54:46",
                    "content": "Disclaimer: The authors of this post do not currently hold UNI tokens or provide liquidity to the protocol, although they have in the past. We are an unbiased third party. This post was co-authored by Matt Fiebach and Dan Smith from Blockworks Research. In our opinion, the protocol fee switch should be activated for a trial period at the minimum 1/10 protocol fee with revenue flowing to the Uniswap treasury address 0x1a9C8182C09F50C8318d769245beA52c32BE35BC. Uniswap’s most valuable pool is USDC/ETH 0.05% as it single-handedly generates ~50% of protocol volume. Therefore, including it in the trial risks liquidity outflows that jeopardize Uniswap volume dominance. Selecting the remaining highest volume pools limits the risk of the trial while accurately measuring its impact on LPs. Including one USDC, USDT, and DAI pool allows LPs who are not happy with the fee switch to move to different pools for the same assets. The following pools should be included in the trial set: • DAI/ETH 0.05% • USDT/ETH 0.30% • USDC/ ETH 1.00%  We agree with “guil-lambert” that LP shuffling is an essential factor in determining which pools to include in the trial set. The repercussion of implementing the protocol fee across the board is very different than for only 1 fee tier as the protocol fee is effectively dispersed across pairs.      guil-lambert:  Hence, I predict that activating a 1/10 protocol fee to any one of those pools would re-shuffle some of the liquidity provisioning, but all pools will still converge to the same IV and LP revenue at the end of the day.    Prior to activation, we strongly suggest agreeing on a “circuit breaker” level that discontinues the fee switch if Uniswap stable/ETH volume market share decreases by X% for Y length of time. However, this metric can be maliciously influenced by LPs. If a circuit breaker is not determined prior to the activation of the fee switch, the protocol risks losing market share while governance debates potential options.  It is worth noting that if this test goes successfully without a liquidity drain, it does not necessarily imply that the same would be true if the fee were imposed on all stable/ETH pools. In the scenario that the trial period is deemed a failure and the fee switch is discontinued (i.e. leads to a negative impact on Uniswap’s stable/ETH volume), we believe LPs should be compensated using treasury held UNI. We propose LPs are repaid, in UNI, for the 1/10 protocol fee they forfeited. To prevent immediate UNI dumping (negative UNI price impact), creating a vesting contract that would look something like LPs getting the protocol fee back in 2 year locked 6 month vested UNI. This essentially acts as a Uniswap treasury swap to diversify assets without the same implications as market selling UNI. ",
                    "links": [
                        "https://gov.uniswap.org/t/fee-switch-design-space-next-steps/17132/21"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.304597701149425
                },
                {
                    "author_link": "https://gov.uniswap.org/u/teemulau",
                    "index": "56",
                    "likes": "4",
                    "time": "30/07/2022-09:49:03",
                    "content": "Really happy to see this discussion take place. I’ll share my current thoughts: Firstly, restating the important and obvious: Currently, all initiatives (costs) are paid by UNI holders by diluting the token price. The only upward pressure to UNI price comes from investors expecting a return in the future. Thus, the first conclusion is that something needs to be done to generate revenue or alternatively run an unsustainable operation to zero. I’d like to echo @tobyshorin’s first point. I’ve previously had the intuitive sense that activating the fee switch would supercharge Uniswap governance. Toby’s first point argues that having a treasury of stables would make governance participation more attractive. It should also result in more financial discipline in the DAO. The external positive effects seem understated in the discussions. I believe there is a wide false sense of “having a lot of money to spend” from the UNI treasury (= genesis allocation). This capital should be treated with the same level of rigour as corporate equity. Uniswap needs stables to its treasury to have better understanding of real costs and to always carefully consider when to dilute the UNI token. The fee switch is probably the best bet of accumulating this treasury. As for the execution, I support @guil-lambert’s direction of testing out the fee switch in various “sister” pools. I do see the risks involved to run the tests on the most important pools as outlined by @BP333. I’d also encourage people to dive into @rfritsch’s model. The main purpose of running the fee switch test should be to get an understanding of Uniswap’s real market position and possible moat (Modeled by sticky volume & sticky liquidity). We could then use this information to estimate the behavior in other pools. @MattOnChain’s idea of compensating LPs with vested UNI tokens for possible losses is interesting, but I am against this. Having this type of “bailout” mechanism could distort the test behaviour of LPs, leading to results not beneficial to future use. Furthermore, any protocol revenue generated this way would not count as net revenue. Liquidity mining programs could be run at some point again but should be kept separate from this test. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.919226044226045
                },
                {
                    "author_link": "https://gov.uniswap.org/u/research",
                    "index": "57",
                    "likes": "0",
                    "time": "31/07/2022-23:04:12",
                    "content": "    Naught:  I am curious to your insight on how Pantera portfolio companies such as FTX, Bitstamp, Coinbase etc…   Actually, they end up charging 0%. Yeah, and they probably have matching engines that charge ultra-low spreads and also do some high-speed trading and so on… On these exchanges, once you have a high enough volume, trading is “free”. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0600000000000005
                },
                {
                    "author_link": "https://gov.uniswap.org/u/research",
                    "index": "58",
                    "likes": "3",
                    "time": "31/07/2022-23:09:48",
                    "content": "    dexman.eth:  A traditional market-maker charged 10% of their revenues to access a platform just feels unreal.   Good writing, however, think about how easy it is to become a market maker with UNI v3, and a profitable one, with each its own parameters. Taking this into account, 10% is okayish… Not ideal, but okayish, and hell, market makers should buy some UNI if they wish to increase their revenues and have a say in the governance =) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.486111111111112
                },
                {
                    "author_link": "https://gov.uniswap.org/u/NRC",
                    "index": "59",
                    "likes": "0",
                    "time": "01/08/2022-10:39:17",
                    "content": "It 's interesting and informative . ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/NRC",
                    "index": "60",
                    "likes": "0",
                    "time": "01/08/2022-10:45:01",
                    "content": "It is important. You need to check in practice ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/dexman.eth",
                    "index": "61",
                    "likes": "0",
                    "time": "01/08/2022-19:11:23",
                    "content": "Thanks for the feedback!  market makers should buy some UNI  I totally agree with incentivising LPs to buy (more) UNI and directing governance, however, that shouldn’t be the only strategic answer here. Too easily manipulated. So it’s important to have accurate numbers and hard facts to inform the democratic process.  think about how easy it is to become a market maker with UNI v3, and a profitable one, with each its own parameters.  To become a market-maker and earn tokens in liquidity fees is agreeably very easy. Are you sure, however, that to do so on a consistently profitable basis is equally easy? We have been researching hedging strategies against impermanent loss over quite a long period of time. We ended up with a complex delta-neutral hedge operation, involving automation of multiple dex and cex positions linked to each LP. This FYI is the main point of our own Civilization protocol - to offer broad access. And if our fund is still in pre-launch mode 1 year later, this is only due to the complexity of an operation that saw other providers attempting a similar development in the past suffering either zero profits, hacks (or both). For sure, such hedging strategies are beyond reach of the average retail investor. If I remember correctly, even the white paper of Uniswap v3 suggested that devs expected this not to be a retail-friendly system. Unsurprisingly, some 2021 research suggested that many LPs operate at a loss. Now I do not trust that piece of research at face value, as it was partial and funded by other protocols with conflicting interests. However, the complexity of running a consistently profitable operation at scale (vis-a-vis buy-and-hold or simple staking) does match my field experience. If my hypothesis was indeed correct, then a 10% tax could make the whole difference between profit and loss, or even sustainable profit vs unsustainably razor-thin margins, even for professional operators. Do you have personal experience with easily profitable LP strategies on v3 at scale? If so, I would love to chat further: our decentralised protocol offers immediate incentives to anyone helping to improve our service to the broader DeFi and crypto community. Making v3 liquidity provision consistently profitable would be a huge step toward mass adoption in TradFi, wouldn’t it? So let’s make it right  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.814660973084886
                },
                {
                    "author_link": "https://gov.uniswap.org/u/danhsiu",
                    "index": "63",
                    "likes": "0",
                    "time": "03/08/2022-07:23:23",
                    "content": "Some people here think that the fee-switch is a standalone 10% fee on each swap. To provide clarity: on the lowest setting, it is a 10% fee on the swap fee. Asserting my own opinion… I don’t believe taking an academic/research driven approach prior to proceeding with the fee-switch for experimenting with non-core pools is exactly necessary. The Uniswap governance has the flexibility to learn from liquidity data of how toggling the fee switch on the pools suggested by @guil-lambert, and @alanalevin impacts liquidity drain. Backing out of the protocol fee is an option at a later date. I would wager with high conviction that the minimum 10% protocol fee as a percentage of the swap fees on three (small low-TVL) non-core pools is unlikely to be an existential threat to the attractiveness of Uniswap being the dominant AMM for consistent APY. Only after we have collected data can the community be okay with making heuristic arguments on whether if the protocol fee can be extended to a wider list of pools (or the protocol in its entirety). I don’t mean to sway away researchers, but we need to maintain a healthy balance between practical solutions rather than surgically polished academic research that would realistically take months to produce. Hypothetically speaking, if the protocol fee of 10% on all swap fees can be broadly applied to all pools, what would stop the governance to pushing-up the protocol fee to 25% for all swap fees, or variable based on the classification of the pool? What we’re trying to achieve here can never be fully described and optimized in formal language. We need to maintain focus and keep the momentum up with a monumental 40M large voting barrier, or we risk stagnation. There probably are going to be times where we can get it wrong for some select pools. Though how hard would it be re-incentivize liquidity by backtracking the fee-switch? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.127240896358543
                },
                {
                    "author_link": "https://gov.uniswap.org/u/research",
                    "index": "64",
                    "likes": "0",
                    "time": "03/08/2022-11:18:54",
                    "content": "    dexman.eth:  Are you sure, however, that to do so on a consistently profitable basis is equally easy?   It is not easy if you don’t have the numbers to back it up, it is easy if you have the numbers and stats, to know which type of IL risk you want to take compared to the revenues you should be able to generate. One big caveat though is that the theoretical yields that you can make are in general slashed by MEV players that ripp off a lot of fees with JIT liquidity providing, which at first seems annoying to me. My questoins regarding the MEV JIT LPs is, is it positive for Uniswap? Is it a necessary evil in order to make sure the pools are liquid enough for traders ? Or without it is it better because of a better redistribution to passive LPs ? Maybe UNI should implement a fee switch in order to foster research in this direction, and maybe manage to prevent bad actors (if MEV JIT LPs are actually bad) to “steal” liquidity from “honest” LPs… It’s a lot of question marks here, I honestly don’t have the final answers as to this phenomenon. Any MEV JIT LPs care to answer ? =) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.380681818181818
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Game_Theorist",
                    "index": "65",
                    "likes": "3",
                    "time": "03/08/2022-22:44:37",
                    "content": "Posted this on twitter but going to repost here because I think this direction is a huge mistake. I absolutely want fee teirs on but turning it on on a few pools to “collect data” seems incredibly stupid to me. Imagine you are in a casino that doesn’t charge rake. The casino is thinking about charging rake so it turns on the rake on a few tables. What happens? Everyone will leave the newly raked tables to go to the non raked tables. The casino concludes that they should avoid rake because everyone would stop playing if there was a rake. But this is wrong because at casinos that have every table raked people still play. TLDR the data that comes from “turning on a few pools to test” will be completely useless and lead to false conclusions bc of spillover effects. We know that exchanges can exist with rake, just add it on everything. Posting a reply to my tweet since it was also relevant:  Mihai: or add it to all pools of a certain pair, so there’s no rake-less pool to go to (on uniswap)  My reply: Yes this is good but there is still the issue of bypassing since Uniswap is a network For example, if you rake DAI ETH, you can go DAI → USDC via DAI/USDC 0.01% fee their and then USDC → ETH via USDC/ETH so you bypass the rake for only a 0.01% fee. This is particularly a problem for orders that are routed using a smart router, since you will see flow tend to bypass the pool which creates a vicious cycle that can basically make the pool obsolete. no hard feelings towards @guil-lambert, OP, or anyone else who is advocating for this approach but IMO this is completely the wrong way to go about this. The data we gather will be incredibly misleading. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.827960729746444
                },
                {
                    "author_link": "https://gov.uniswap.org/u/tobyshorin",
                    "index": "66",
                    "likes": "1",
                    "time": "04/08/2022-13:58:41",
                    "content": "Following up on some of this conversation, I agree with @brenner and @leighton that targeting a specific number or a time bound period for fees to be activated would be an appropriate way to proceed. I don’t think it’s necessary to specify a use for these funds, but some obvious things come to mind. In terms of adding funds to existing initiatives, options are:  Funding next version of Uniswap Grants Program with fees. Adding funds to the bug bounty.  In terms of new initiatives, there is an enormous amount of value to be gained in funding dedicated entities to take on certain aspects of protocol governance work that currently is not happening because none of us are getting paid.  Designing a paid delegation program. Creating a special purpose vehicle to act as legal counterparty on dao2dao transactions and contracts, e.g. like those that have happened with Voltz, the Polygon team, Moonbeam, and so on. (We have another report coming out soon that details some of the accountability issues that we’ve seen in the Uniswap ecosystem that covers this in greater detail). Independent team focused on procurement work along the lines of what we have been doing with our crosschain governance initiative. This is especially critical now that Uniswap Labs has increasingly stepped back. Hiring new development orgs to make new contributions to the protocol, like what Scopelift has done with its recent grants from UGP.  Even without deciding a larger “mission” for Uniswap, these opportunities are pretty obvious and I daresay necessary steps for growing Uniswap’s competitiveness. @leighton I think a viable next step for moving this conversation forward would be writing the code for a parameter change that takes the preceding conversation here into account and posting it here as a concrete artifact for debate and more discussion. Is there someone on your team who would be willing to take that on? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.616762866762866
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Leighton",
                    "index": "67",
                    "likes": "3",
                    "time": "04/08/2022-15:07:40",
                    "content": "Yep! 100% agree. I actually drafted this last night (pretty much along the lines of what you just outlined). I will post it today or tomorrow so we can move to next steps! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.45
                },
                {
                    "author_link": "https://gov.uniswap.org/u/mont",
                    "index": "68",
                    "likes": "1",
                    "time": "04/08/2022-23:40:23",
                    "content": " Lp can either buy UNI for revenue compensation or let UNI deflate.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/maxholloway",
                    "index": "69",
                    "likes": "2",
                    "time": "06/08/2022-04:59:12",
                    "content": "Hello all, excellent discussion so far. Some thoughts as a humble Uniswap tourist.  I don’t quite get why LPs are particularly concerned with this experiment on a limited set of pools. Either (a) the margins on the pools are really low and they leave, (b) margins are high for some LPs and they stay while others leave, or (c) LPs leave the pools that have the fee switch turned on en masse. In any case, LPs can vote with the purse, and I don’t buy that turning the switch on is an irreversible transgression against LPs.  @Game_Theorist, you and I share a name and a passion for algo game theory! Your approach aligns perfectly with a rational-self-interested-agent approach, which is where my dispositions lie as well. But I see the point of this proposal being to test just how efficient liquidity provision is on Uni V3. I love hypothesizing from theory as much as the next guy, but to fully reject this proposal on your grounds, one would need to assert that these markets are efficient. And who the hell would dare rest their name on a claim that crypto markets are efficient? I think there’s been precious little said about the legal concerns with this. I’m no lawyer, but I at least know there’s stuff I don’t know, and it’d be great to get someone who knows one to start thinking about the intricacies of the fee switch legally. This seems much higher priority than squabbling about LPs’ opportunity costs for a short period of time on a limited number of pools. In a way, the fact that so much debate has occurred already on the fee switch is perhaps a valuable prior for understanding the probability that turning on the fee switch (for some pools) is “good”. When optimal parameters are not known, it is necessary to search the param space to hone in on optimal parameters. Of course, if this exploration is extremely high-cost, e.g. in the form of securities backlash or bitter LPs, then there’s reason for pause. But if LPs’ capital allocation is nearly as rational as the naysayers claim, then their equilibrium strategy will be to return their liquidity once the experiment concludes, same as before (assuming these LPs don’t have enough power to grim-trigger the pools, which I think is a fair assumption). Under a consequentialist framework, which seems to be the one most agreeable to economics, taking no action is an action itself. And if legal concerns are resolvable, the search for optimal fee switch obviously requires turning some on.  As I said, I am but a tourist, and I’m likely missing context here. But if this experiment is tractable legally, the conversation should be on how it should be conducted, rather than if it should be conducted, due to the apparent lack of clarity that the community currently has regarding the effect of a fee switch. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.633696283391405
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Game_Theorist",
                    "index": "70",
                    "likes": "1",
                    "time": "07/08/2022-00:23:51",
                    "content": "I’m not saying reject the proposal, I want the fee switch on, but this experiment will exaggerate the effects of turning on the fee switch which may actually hurt progress towards turning on the fee switch. I think we need to think carefully about conducting the expiriment in a way that minimizes spillovers for example we should do the experiment on an entire chain of pools, since bridging is expensive and can be considered enough of a moat to contain most of the spillovers. I would recommend turning on fees on Arbitrum system wide for all pools and all fee tiers. Going back to the casino starting to rake pools, imagine you own a chain of casinos. you want to figure out how raking will affect your attendance and the sale of ancillary stuff like hotel rooms and drinks/food. So instead of turning on rake on a few tables in every casino, you turn on the rake in a few casinos. As long as there is sufficient geographic distance, you will have contained the spillovers pretty well. I think markets are pretty localized here so for example it wouldn’t make any sense to have a market for a bunch of arbitrum tokens exist on polygon or visa versa. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.15
                },
                {
                    "author_link": "https://gov.uniswap.org/u/neogeox",
                    "index": "71",
                    "likes": "0",
                    "time": "07/08/2022-17:33:53",
                    "content": "Hey everyone, I’m from Fluidity and we have experimented with an alternative solution to this, which uses both the fee switch and our Transfer Reward Function (TRF). Fluidity works by rewarding users for spending their crypto, including swaps on DEXs. For every reward that is paid out, it is split between sender and receiver, which means that the Uniswap treasury would earn yield every time somebody performs a transaction on Uniswap using fluid assets. We have done some calculations with this, and they have shown that Fluidity would generate approximately the same amount of revenue for the three pools that have been chosen for the test run. Because of this, we propose a hybrid model that uses both fluid assets and the fee switch, where fluid assets would be used on pools that have lower LP fees and where it would otherwise become unprofitable for LPs to provide liquidity. For pools where this is not the case, the fee switch can be activated. With this, Uniswap would prevent liquidity leakage while still generating revenue for the treasury that can be used to incentivise token holders. It also discounts any increase in trading volume due to incentivising utility. For example, we can assume around 200,000 daily transactions on Uniswap V3. If Fluidity captures only 5% of this volume, we can estimate the mean daily revenue for the treasury to be $1,100, or $400,000 annually. If we compare this to the DAI-ETH-0.05% pool, it would have earned the treasury an average of $136 daily in the last 7 days. For some reason I can’t include images in this post, but we have written an extensive blogpost on how this would work as well as this thread. This is first and foremost meant as a thought experiment and not an official proposal, nevertheless we would love to hear your thoughts on this! Edit: embedded links ",
                    "links": [
                        "https://blog.fluidity.money/an-alternative-solution-to-uniswaps-fee-switch-problem-61a5e4f6057c",
                        "https://twitter.com/fluiditymoney/status/1556261566424793089"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.1139705882352935
                },
                {
                    "author_link": "https://gov.uniswap.org/u/uni2",
                    "index": "72",
                    "likes": "1",
                    "time": "08/08/2022-03:31:22",
                    "content": "Hi everyone! All being equal, a successful fee-switch would mean LPs help finance development costs, right? It would be good to have some a-priori statistics of LP impermanent loss, for different pairs, liquidity concentrations, time-scales up to 120 day max bins. Data should exist that if show LP are mostly in profit, would be good to know. If I read this right, with the fee switch turned-on: a small fee percentage on every pool Tx would go to a treasury fund. But what then of these funds? Can they be matched by the long term released UNI team funds to fund development? Although this might put buy pressure to Uni holders, it might be difficult to take for LPs that have encumbered significant impermanent loss on liquidation so though LPs might not be too deeply involved in this discussion, if loses are significant they may still want to pull-out of those LP pools, against the best interest of the protocol so caution seems good advice. Lastly: What about Pros/Cons of choosing either ETH/WBTC or WETH/WBTC pools in the pilot switch study? (For statistical purposes might be useful, since both are inextricably tied to “bitcoin”, the commodity!) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.158482142857143
                },
                {
                    "author_link": "https://gov.uniswap.org/u/research",
                    "index": "73",
                    "likes": "1",
                    "time": "18/08/2022-11:59:25",
                    "content": "There are several tools to gauge this. From the top of my head, most long-only LPs or passive large brackets LPs are in losses right now. JIT LPs are making a decent return, as long as they manage to hedge their position properly, not sure how that would work, but my guess is that they manage, as they continue doing it. Running a system at a loss would be stupid. What would be really nice would have some JIT liquidity providers and automated arbitrage BOTs talking here, as they are generating most of the volume on DEXes from my understanding. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.757575757575758
                },
                {
                    "author_link": "https://gov.uniswap.org/u/undernotoverwater",
                    "index": "74",
                    "likes": "0",
                    "time": "16/09/2022-10:56:34",
                    "content": "any chance you could link where frax incentivises stable/stable pairs - i wasn’t able to find this myself  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/BP333",
                    "index": "75",
                    "likes": "0",
                    "time": "16/09/2022-16:50:42",
                    "content": "Sure, there’s quite a few.  Check here for all their gauges:  Frax Finance. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://gov.uniswap.org/u/WeAreAllSatoshiN",
                    "index": "76",
                    "likes": "0",
                    "time": "23/09/2022-10:14:40",
                    "content": " Blockzitat But if this experiment is tractable legally, the conversation should be on how it should be conducted, rather than if it should be conducted, due to the apparent lack of clarity that the community currently has regarding the effect of a fee switch. Blockzitat  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.15625
                },
                {
                    "author_link": "https://gov.uniswap.org/u/logart123",
                    "index": "77",
                    "likes": "3",
                    "time": "14/10/2022-16:54:05",
                    "content": "Hello guys, I have an idea, but first I need to tell that UNI only current utility which is governance is weak, it needs to capture value somehow, governance doesn’t capture value, maybe it captures value In the treasury but not in the UNI hodlers pockets, so it makes sense the fee switch to actually give UNI hodlers the value they deserve, and giving fees to UNI hodlers, will increase the demand for the UNI token and give passive income to UNI hodlers. Instead of paying dividends to UNI hodlers, there are other ways to capture value for UNI hodlers, here’s my idea: Essentially we need to align the interests of UNI hodlers and LP’s and at the same time increase demand for the token. So, Instead of paying 0.25% to LP’s, and 0.05% to UNI hodlers, we need to make LP’s THE UNI hodlers, so how we do that? Don’t take the option from lp’s to keep earning the 0.3% from fees, give them two options:   first option is they will only earn 0.25% if they do not wish to hodl UNI tokens   second option is, they will be entitled to earn the full 0.3% If they hodl a portion of the capital they are putting to provide liquidity in UNI tokens   For example: If they put $1,000,000 of capital in ETH/USDC pair, to earn the full 0.3% of fees, they need to lock or stake 16.66% (1/6) of the 1M in UNI tokens, so in this example they will need $500,000 in ETH, $500,000 in USDC and if they want to earn the full 0.3% of that 1M, $166,600 in UNI they will need to lock, otherwise they will earn only 0.25% of the fees. This will inevitably create demand for the token and UNI hodlers and LP interests will be finally aligned, and also… this will be considered a utility and not a security under the eyes of the SEC. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.263888888888889
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Stastny",
                    "index": "78",
                    "likes": "0",
                    "time": "14/11/2022-19:54:21",
                    "content": "Hey folks - Uniswap Foundation funded some research from @SamB23 and myself over at Alastor to take a look at this issue. We’ve posted our report here. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/d3rwisjnodes",
                    "index": "79",
                    "likes": "0",
                    "time": "21/11/2022-12:42:06",
                    "content": "I concur. Firing up on smaller pools to do “test-like” runs is paramount for safety and oversight I believe.  I think using 2 of the largest and most important pools is pretty high risk.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.3100000000000005
                }
            ]
        }
    ],
    "group_index": "207"
}