{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/uni-devs-should-create-a-better-way-to-vote/6257",
            "title": "UNI Devs should create a better way to vote ",
            "index": 6257,
            "category": [
                "Governance-Meta"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/Shitcoingambler",
                    "index": "1",
                    "likes": "2",
                    "time": "28/09/2020-18:46:11",
                    "content": "As the title suggests, many suggestions are failing to get past the initial 10M UNI requirement. Largely, I believe this is because current solutions are inconvenient. There’s no way to know how many UNI is delegated to a certain address (unless that party ends up creating a UI/UX, like yuni did, which is a completely redundant process). To encourage users participating in the governance, the process and UX should be smooth - delegating votes should be easy, people should be able to see the progress (how much is missing for certain addresses/ideas, etc). Furthermore, because many are failing behind the 10M requirement, now people are asking to “enable” them to propose. The process could instead be improved if anyone could propose projects, which would only be “considered” if 10M UNI vote is reached. Alternatively, the 10M requirement could be reduced. In any case, current situation has to be improved, largely on Uniswap’s Development team (improving the current token page). Thoughts? ",
                    "links": [],
                    "GPT-summary": "The author of the post is suggesting that the current process for proposing and voting on ideas in UNI is inconvenient and needs improvement. They propose that the process should be made smoother and more transparent to encourage more users to participate in governance. The post also invites thoughts and feedback on the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.604875283446712
                },
                {
                    "author_link": "https://gov.uniswap.org/u/TMod_Marco",
                    "index": "2",
                    "likes": "2",
                    "time": "28/09/2020-20:28:13",
                    "content": "‘’ Uniswap has always embraced the tenets of  neutrality and trust minimization  : it is crucial that governance is constrained to where it is strictly necessary. With this in mind, the Uniswap governance framework is limited to contributing to both protocol development and usage as well as development of the broader Uniswap ecosystem.’’ - from the blog. That being said, I’m pretty sure the team has thought of this before implementing the minimum thresholds. There are very many suggestions/proposals that seem to not be approved by the majority of the community, as proven by the lack of support on certain suggestions. That’s not an opinion or comment towards a specific proposal. It’s a fact based on what I’m seeing right now. I’m not necessarily sure that’s a bad thing, it’s an interesting situation. That being said, I personally as a community member would vote no on a proposal to reduce this number. That being said, I’m locking this topic as there’s already such proposal/topic out there. See: Proposal: Reduce amount of UNIs required to submit governance proposal & please continue the discussion there  ",
                    "links": [
                        "https://gov.uniswap.org/t/proposal-reduce-amount-of-unis-required-to-submit-governance-proposal/3320"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.492346938775511
                },
                {
                    "author_link": "https://gov.uniswap.org/u/TMod_Marco",
                    "index": "3",
                    "likes": "0",
                    "time": "28/09/2020-20:28:25",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "396"
}