{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/uni-price-stability-and-future-price-growth-mechanism/5724",
            "title": "UNI Price Stability and Future Price Growth Mechanism ",
            "index": 5724,
            "category": [
                "Governance-Meta"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/YNinja",
                    "index": "1",
                    "likes": "22",
                    "time": "24/09/2020-09:27:22",
                    "content": "A mechanism should be put in place to enforce UNI’s price stability and strong growth, which should be based on the inherent financial strength of our Uniswap project going forward. UNI should be available only for sale and should never be distributed again without being backed by underlying cash reserve and proportional liquidity, based on profits earned by the project. We should stop emission of UNI immediately after the current liquidity based mining on the 4 different pools comes to an end in November. Governance tokens are equivalent to shares held by shareholders of any profit making project. The 1 Billion Max supply of UNI is like authorized capital and the current supply is like issued capital. Any UNI Rewards going forward should be bonuses to UNI holders based only on the profits and cash reserves held by the Uniswap Project after being voted for and approved by the community members. This will make sure the price will be stable at the Nov 2020 levels and keep increasing as we go forward. In order to increase user base and attract further investments on a continuous basis we need to distribute rewards to all UNI holders using other tokens traded on Uniswap and never use UNI for this again. This reward should be a function of individual UNI holdings and the Time Period for Which UNI is being held. The Longer a person holds UNI the Higher the relative proportion (UNI Amount Held x Time Period of Holding UNI) of rewards that can be claimed. The “Time Period of Holding UNI” variable should have higher weight-age in the function than the “UNI Amount Held” variable, in order to discourage whales and speculators to buy UNI for the short-term only to claim monthly rewards. A continuously yielding staked pool of 10 % of fees collected as Different Tokens should be set aside for this. Any unclaimed rewards in other tokens should be sold on a monthly basis and be used to create liquidity for UNI and for buy back of UNI. Live tracking of potential monthly rewards that can be claimed, based on the above mechanism should be searchable and displayed on Uniswap.info. As the financial reserve of Uniswap keeps increasing based on volumes and the fees generated, it will keep increasing the net worth of the project and hence keep pushing the price of UNI on an upward trajectory. Future revenue generating operations should be introduced with active discussion and participation by community members. For example the daily volume of Deribit Futures and Options exchange with just BTC and ETH as the underlying assets, is approximately 250 million USD. The profit earned by Deribit with this volume on a daily basis is more than half a million dollars. The core business and strength of Uniswap is earning profits by providing liquidity based exchange services. Hence getting into the business of providing Futures and Options trading on Uniswap platform will be a natural evolution for the Uniswap project. If Uniswap can get into leveraged Futures and Options trading and introduce the top 20 Coins/Tokens or may be make this facility available for every token that is listed on Uniswap, that has sufficient liquidity, the potential volume of trading per day is an additional Billion Dollars and a potential profit of 3 million dollars per day. Today centralized exchanges decide on their own as to which projects can be listed in the futures and options section. Being a truly decentralized project, if Uniswap offers this to every project that can bring in liquidity without any bias, this will attract several new and old projects who wish to have their Tokens on the Futures and Options market, to Uniswap. This will result in more daily volumes, profit, cash reserves and increase in net worth of Uniswap, which will result in constant upward pressure on the price of UNI. The future looks bright for our Uniswap project and the prospects of UNI becoming a true, Blue Chip security, with regular returns and long-term wealth creation for investors and long-term holders, is an absolute given with unquestioned certainty, if these mechanisms are put in place. ",
                    "links": [],
                    "GPT-summary": "The author proposes a mechanism to enforce UNI's price stability and growth, based on the financial strength of the Uniswap project. The proposal suggests that UNI should only be available for sale and never distributed again without being backed by underlying cash reserve and proportional liquidity. The post also suggests introducing revenue-generating operations, such as futures and options trading, to increase daily volumes, profit, cash reserves, and the net worth of Uniswap. The proposal invites constructive criticism and collaboration from third parties.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.487148268398268
                },
                {
                    "author_link": "https://gov.uniswap.org/u/emobe",
                    "index": "2",
                    "likes": "1",
                    "time": "24/09/2020-09:54:34",
                    "content": "How will this work when inflation comes in 4 years? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/YNinja",
                    "index": "3",
                    "likes": "3",
                    "time": "24/09/2020-10:05:15",
                    "content": "In 4 years with this mechanism in place the valuation of Uniswap Project will be a trillion dollars. No amount of dilution will reduce the underlying net worth of the project. Any one who is investing in the project is aware of the Authorized Capital (Max Supply) and the Schedule of Issued Capital (Total Supply at any point) which is based on actual profits there by ensuring that the valuation of UNI can never be diluted. It can only be strengthened and will keep pushing the price of UNI upward. There can sometimes be speculative buying of UNI which will give occasional sudden volatility of price. But the underlying financial strength of the project will give strong stability to the price of UNI and steady growth in price, if emission is based only on profits and cash reserves. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.479166666666667
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Moonshot",
                    "index": "4",
                    "likes": "1",
                    "time": "25/09/2020-07:22:41",
                    "content": "How would a say 5% airdrop of historical wallets pre snapshot yearly be bad for the price? Wont we just be at the mercy of whales? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.250000000000001
                },
                {
                    "author_link": "https://gov.uniswap.org/u/YNinja",
                    "index": "5",
                    "likes": "2",
                    "time": "25/09/2020-14:20:16",
                    "content": "Take the example of real life successful projects MSFT, GOOG, APPL, FB, AMZN and the likes… Did they give out airdrops to be successful? Are the small investors in these companies at the mercy of the big investors that you have suggested might happen with the case of Uniswap? AMZN struggled a lot during its early days before becoming successful. But eventually went on to become a trillion dollar marketcap company. Take the example of APPLE. During the middle years in which Apple struggled to establish itself and beat the Intel Clones with Microsoft OS, Steve Jobs was with a different company, since he had been ousted from the board earlier. But eventually he fought his way back in and the rest they say is history. Today APPL is a 2  Trillion dollar marketcap company. The focus of Uniswap should always to be profitable and to grow bigger. All stake holders should work towards this. I am sure we will all be rewarded handsomely if we focus on this. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Gonzo",
                    "index": "6",
                    "likes": "0",
                    "time": "25/09/2020-15:42:57",
                    "content": "The people are the profit. Help me, help you, help us. It’s of value if it is valued. Founders and holders that flounder and smolder die often from lack of exposure. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/YNinja",
                    "index": "7",
                    "likes": "3",
                    "time": "25/09/2020-15:51:32",
                    "content": "Uniswap has understood that concept of people being the power behind any project exceedingly well. They have rewarded everyone, even those who have not contributed a single penny to the development of the project. If you can understand the empathy of Uniswap in rewarding around 12000 members, I mean those who had failed transactions, who had only tried to do a transaction on Uniswap and had failed in their efforts and most probably were small investors who did not have enough ETH balance with them, to try it again for fear of another failed transaction and losing money, then you can only expect more such rewards to the deserving small investors, in the future from Uniswap! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.7988445378151265
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Gonzo",
                    "index": "8",
                    "likes": "1",
                    "time": "25/09/2020-16:01:00",
                    "content": "I like this public discourse. You are insightful and it’s been a joy to read your energy.  I see good things for all of us.  We’re already positioned to do well for ourselves. The goal now is to be good stewards of an idea, nurturing its growth and ours as well.  “You will get all you want in life, if you help enough other people get what they want.” - Zig Ziglar  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.729166666666667
                },
                {
                    "author_link": "https://gov.uniswap.org/u/egk10",
                    "index": "9",
                    "likes": "0",
                    "time": "14/10/2020-21:59:43",
                    "content": "Very good proposal. Let’s vote! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/YNinja",
                    "index": "10",
                    "likes": "3",
                    "time": "15/10/2020-10:40:00",
                    "content": "Thanks for your response and for your support. Binance recently announced that they had more than a Trillion Dollars in Futures trading volume during the last trading year. If we take 0.3% as the Fees Uniswap can potentially earn an additional 3 Billion Dollars per year if we can tap the Futures Market. There is no time to be wasted. Every project wants to be on the Futures Market. If we can introduce this on Uniswap the revenue will shoot through the roof and UNI Price can hit 10 to 15 dollars which it truly deserves. If we can make this Futures Trading launch to coincide with the End of the current liquidity mining program which will come in November, it will be an added boost to the UNI Price. Some platforms like Unitrade, Dharma, etc., are offering through their interface, the option to set Target Prices and Stop Loss while trading on Uniswap. We should not wait for other projects to come up with such innovations. We should lead from the front as far as these innovations are concerned. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party suggesting revenue-generating operations"
                    ],
                    "Sentiment": 5.306818181818182
                },
                {
                    "author_link": "https://gov.uniswap.org/u/cryptoveganrei",
                    "index": "11",
                    "likes": "0",
                    "time": "20/10/2020-19:06:54",
                    "content": "I love the idea of futures and options. I believe with the constant addition of new projects being added to the platform. There should be just as constant futures and options availability. Imagine the ability to execute a short position on a newly added coin immediately after the coin offering. This has never been done and is highly needed in the space. I don’t believe it should only be btc and eth but I believe it should be all newly added and existing coins. How can liquidity be guaranteed and uni price be positively effected? I believe forcing users to stake uni and or stake the future contract coin would bring liquidity and new users to purchasing uni to participate. The more uni staked the more leverage allowed etc. Also stakers/ liquidity providers can receive the fees from the contracts. Finally a way to profit from poorly ran projects as the decrease in value with short positions. Hopefully we can get a vote for such a thing, or an admin can see this. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.564646464646464
                },
                {
                    "author_link": "https://gov.uniswap.org/u/mjgla4",
                    "index": "12",
                    "likes": "1",
                    "time": "21/10/2020-21:16:15",
                    "content": "I think this is an interesting proposition and seems sound at first glance. Price stability of this asset will also make future developments and growth using the treasury more impactful, as with price stability the treasury in turn becomes more valuable and gives us more resources. I am for this proposal, but would like to hear any dissenting opinions on why this is not favourable. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.892857142857142
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Million",
                    "index": "13",
                    "likes": "0",
                    "time": "29/10/2020-06:25:31",
                    "content": "I agree, this is a sound proposal. Good job @YNinja ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.75
                },
                {
                    "author_link": "https://gov.uniswap.org/u/gonkwa",
                    "index": "14",
                    "likes": "0",
                    "time": "31/10/2020-15:31:20",
                    "content": "The futures and options ideas for coins on the uniswap platform is really a great idea… I hope it can be integrated in the coming uniswap v3 …using uni or staking uni for more leverage in the futures and options market would also place positive impact/boost to the uni price… Looking forward to the futures and options market on the uniswap platform… ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.545454545454547
                },
                {
                    "author_link": "https://gov.uniswap.org/u/cryptogoth",
                    "index": "15",
                    "likes": "0",
                    "time": "10/11/2020-18:58:21",
                    "content": "Thanks for starting this discussion and making good points. I also believe UNI needs to have some intrinsic value tied to the profitability of the Uniswap project and its continued operations as the leading DEX in the world. I’m in favor of limiting UNI issuance, but how much to limit it is complex as it has a triple role:  incentivizing LPs to hold in Uniswap rather than any other fork governance token treasury token of the Uniswap project  I’m also in favor of beginning to trade options on Uniswap, as derivatives would benefit from the liquidity and attention that Uniswap has currently gathered. The notion of “impermanent loss” indicates that either half of a trading pair on Uniswap could experience (temporary) price volatility, and there’s no way for LPs to hedge against these while continuing to deposit in Uniswap pools: they can choose good pairs and ride out the storm. As in any casino, the platform that allows users to place bets by holding these derivative positions accrues fees in a low-risk way, and this is one revenue stream that can be distributed to UNI holders in a trustless way that would give it intrinsic, growing future value, similar to the stock of viable companies like Berkshire Hathaway, Tesla, or others mentioned above (Google, Amazon, Apple, etc.) While I’m not an economist (and I would certainly support an economic analysis of this proposal), I see the purpose of inflation here as increasing the user base and stakeholders of UNI in a “fair” way by letting anyone democratically buy/sell them on the market, as you’ve said above. That’s the intent behind many of these airdrop proposals,  Inflation is not needed, as in the case of Ethereum and Bitcoin, for the base functioning of validating tx’s on the network, or the U.S. Federal Reserve issuing new USD to stimulate spending or provide economic relief, with no real plans to buy burn dollars when the emergency is past. Deflation is usually linked to hoarding, and indeed, Bitcoin and YFI are classic examples of deflationary crypto assets that are becoming increasingly scarce, and therefore less useful in and of themselves. I would find it acceptable and even desirable for UNI to be deflationary in this way, and for treasury spending to be in the form of stablecoins borrowed with UNI collateral, e.g. in AAVE or MakerDAO. I would be in favor of a proposal that limited inflation in a governance controlled way, but it would have to separate the governance and treasury token. Similar to the Federal Reserve Board setting interest rates, minting new USD, and buying back assets, but in a more democratically elected way. If USD holders elected and fired the Fed Reserve chairman, he could buy new votes by simply issuing more USD to overwhelm the votes of existing voters whose USD would be devalued. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.25142797017797
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Unlicashflow",
                    "index": "17",
                    "likes": "0",
                    "time": "23/11/2020-22:54:51",
                    "content": "This is really true and I totally agree with it. I am holding UNI since I received it from airdrop and I never sold it. I just hodl UNI in my personal wallet. But to be honest sometimes I am thinking to sell it for I think I didnt get any rewards from it just by holding UNI in my personal wallet and the price of UNI is not increasing now as compared to its last price somewhere in October 2020 when it reached its ATH around $9. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.791666666666666
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Aeris",
                    "index": "18",
                    "likes": "0",
                    "time": "03/02/2021-14:27:27",
                    "content": "Agree!  I wouldn’t mind getting back my lost ETH from the good ol’ clueless days of my Uniswap experimental trial and errors. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.333333333333333
                }
            ]
        }
    ],
    "group_index": "381"
}