{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/discussion-good-governance-practices/4575",
            "title": "[Discussion] Good Governance Practices ",
            "index": 4575,
            "category": [
                "Governance-Meta"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/monet-supply",
                    "index": "1",
                    "likes": "11",
                    "time": "20/09/2020-20:00:46",
                    "content": "Hi Uniswap fam, Given that UNI governance is still relatively new, I think that it would be productive to think about proposal procedures and standards before we make changes to the protocol. Uniswap borrows governance functionality from COMP and the Compound community, and I think this reference on good governance from Robert Leshner is a great jumping off point:    Compound Community Forum – 13 Jul 20    Good Governance Transitioning governance of the Compound protocol to the community is the most exciting, and powerful experiment we’ve ever conducted.  It’s up to all of us, working together, to create the governance standards and processe that will carry Compound... Reading time: 1 mins 🕑 Likes: 3 ❤      TL;DR Proposals should be submitted in the forums and discussed by the community before going on chain. Technical changes should be publicly vetted. Proposals should address 1 change at a time.  Please share any other ideas you have about good governance, proposal etiquette, moderation, etc! ",
                    "links": [
                        "https://www.comp.xyz/t/good-governance/27"
                    ],
                    "GPT-summary": "The author of the post is explaining the importance of good governance practices in the Uniswap community and suggests that proposals should be discussed by the community before being implemented. The post also invites readers to share their ideas on good governance, proposal etiquette, and moderation. The post may receive constructive criticism, questions, and reviews from third parties.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.6558441558441555
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Tim",
                    "index": "2",
                    "likes": "3",
                    "time": "20/09/2020-20:11:57",
                    "content": "What does comp has to do with uniswap? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/dcota",
                    "index": "3",
                    "likes": "3",
                    "time": "20/09/2020-20:52:54",
                    "content": "nothing. @monet-supply is just trying to show an example of how governance works in other protocols. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.375
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Uniguy772",
                    "index": "4",
                    "likes": "3",
                    "time": "22/09/2020-14:53:28",
                    "content": "Great reference would be great to see Uni go down a similar process for their own governance starting with discussion in a single forum post moving up towards testing and audit and finally proposal. Hopefully this example will show people making a proposal shouldn’t be a 2 second thing where you click a few buttons and that’s it. Proposals take time and require hard thinking, open discussion and dissection and auditing both by knowledgeable community members and then a trusted 3rd party before finally reaching the proposal stage at which point the community vote if this is the change they really want (hopefully by the time the final stage is reached the community would have known its what they want) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.525421626984127
                }
            ]
        }
    ],
    "group_index": "342"
}