{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/rfc-uniswap-optimism-protocol-delegation-program/20242",
            "title": "[RFC] Uniswap Optimism Protocol Delegation Program ",
            "index": 20242,
            "category": [
                "Governance-Meta"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/kenneth",
                    "index": "1",
                    "likes": "9",
                    "time": "01/02/2023-22:01:22",
                    "content": " Uniswap-Optimism Delegate Committee In 2021, Uniswap v3 launched on the Optimism network. Since then, it has become one of the most popular protocols on Optimism. In order to further protocol engagement in Optimism governance, Optimism is experimenting with a Protocol Delegation Program to give the Protocols building on Optimism a voice in the ecosystem’s decision making. As a part of this initiative, the Uniswap Foundation has accepted the delegation of 199,501 $OP tokens on behalf of the Uniswap Protocol. In order to ensure that Uniswap’s votes on Optimism proposals accurately representation our community’s interests, we are proposing the creation of a committee of 5 members to lead this engagement in Optimism governance. These 5 members will make up a multi-sig that will vote on behalf of the Uniswap community. These committee members will serve as a representative of the Uniswap community’s interests. To be clear, they will represent Uniswap, and not their primary affiliated entity. Below lays out the format, criteria, and expectations of the committee.  Committee format  A group of 5 entities or individuals on a multi-sig voting as one Optimism delegate. 3 of the 5 members have been selected by the UF based on the criteria listed below, but we invite community members to nominate themselves below to fill the last 2 multi-sig spots. Self-nomination will happen on this forum post, and the UF will host a Snapshot vote to determine these 2 members.  Criteria   Demonstrated contributions to the Uniswap and/or Optimism ecosystems Familiarity and experience with DAO governance Demonstrated Uniswap and Optimism protocol knowledge Commitment to being an active delegate based on proclaimed bandwidth No already existing OP delegations to avoid moat building, while contributing new perspectives into the Optimism governance process   Expectations   This will be a ~10 week commitment for Season 3 of Optimism governance Each participant will be expected to maintain 100% participation in voting discussions Each participant will be expected to maintain 100% voting participation through multi-sig Voting rationale of the committee will be shared via the Optimism and Uniswap delegate communication threads Attend bi-weekly community calls hosted by other Optimism delegates  More specific details regarding expectations will be discussed directly with the committee members after voting is over.  Current committee    Cameron ODonnell & Erikson Herman (ConsenSys) Cameron is a DAO Governance Strategist at ConsenSys focusing on Web3 participation & research. He represents ConsenSys through Uniswap delegation and has been an active contributor for ~6 months. ConsenSys champions DAO first ideals that align with the continuity of the organization.  As ConsenSys continues to pursue the decentralization of its products, the Web3 participation  team is also responsible for applied research to leverage within the organization. Erikson Herman is a DAO strategist at ConsenSys focused on maximizing ecosystem value through partnerships. He also is the co-lead and creator of the MetaMask Grants DAO (MMG DAO) that supports >2M/year to developers within the Metamask ecosystem. His experience includes and managing grant programs and communities while working on several Consensys product teams.   Charlie Feng (Agora) Charlie is a co-founder at Agora, a governance tooling team that is actively contributing on both Optimism and Uniswap through its delegation products. Their team is deeply interested in governance innovation and have been actively developing in the Nouns and ENS ecosystem as well. Currently, Agora is supporting the Optimism Foundation in the move towards on-chain voting as well as helping implement liquid delegation for Uniswap’s ecosystem. Agora is focused on improving the governance and ecosystem experience for a few DAOs and Optimism and Uniswap have been a huge part of their future roadmap. The team is uniquely positioned as DAO governance and tooling builders with deep team expertise in both design and engineering. Charlie, as well as the entire Agora team, has an open commitment towards building governance tooling as a neutral party.   Brian Park (Gamma Strategies) Brian is a co-founder of Gamma Strategies, which is an active liquidity manager and market maker on Uniswap v3 with a focus on business development and operations. Specifically, he reaches out to different DeFi projects and DAOs about the benefits of managing liquidity on Uniswap v3 through governance forums and proposals. Recently, Gamma wrote a joint proposal with xToken to manage OP-WETH liqudity on Optimism. Gamma is also currently assisting the Uniswap Foundation in carrying out its liquidity mining program on Optimism. Both Optimism and Uniswap are a huge part of Gamma’s protocol, and for that Gamma would love to dedicate resources to being an active delegate. The team’s unique perspective as a liquidity manager would bring diversity of thought.    Nomination process  If you wish to nominate yourself, please answer the following prompts as a forum post reply and verify yourself through Tally or Twitter. Instructions from Optimism: ”To avoid impersonation, we ask that delegates complete a profile using Tally. This can be done by logging into Tally with Twitter and associating an Ethereum address with your profile that matches the address you submitted on this form (example 105). If you’d prefer not to use Tally, you may post a tweet that links to your delegate submission, then edit your submission to link to the tweet.” Name: Discord username: Telegram: Verification (Tally profile or tweet, example): I have read and understood the Optimism Delegate Commitment Process: I understand that becoming a delegate is a significant commitment: My reasons for wanting to be a delegate: My view on the Optimistic Vision 151: My view on the first three articles of the Working Constitution: Skills and areas of expertise: Past contributions to the Uniswap and/or Optimism ecosystems: Conflicts of interest:  Timeline and Next Steps  The forum post will be up for 1 week (until February 8th), and we will set up a 3 day snapshot voting poll (until February 11th) shortly thereafter to have the committee finalized as soon as possible. Once the votes are finalized, we will be reaching out to the top two members with the most votes.  Final Notes   If a multi-sig member is no longer able to fulfill their responsibility as a committee member, they will be responsible for giving the rest of the committee a 2 week notice in order for the team to determine how to address best steps forward. Again, please remember that you will be representing the Uniswap community with your decision making and diligence and not your primary affiliation. As mentioned in the above criteria, we are looking for people/teams that are not already Optimism delegates to avoid moat building and to encourage the introduction of new perspectives. If you are self-nominating, we ask that you abstain from voting on the final multi-sig members vote to avoid conflict of interest.  Thank you, and we are excited to represent the Uniswap community in Optimism’s governance! ",
                    "links": [
                        "https://gov.optimism.io/c/governance/delegate-updates/45",
                        "https://twitter.com/DAOstrategy",
                        "https://twitter.com/thisisthetruth",
                        "https://twitter.com/charliecfeng",
                        "https://twitter.com/BP_Gamma",
                        "https://gov.optimism.io/t/delegate-commitments/235",
                        "https://www.tally.xyz/voter/profile/15EZK4",
                        "https://www.tally.xyz/voter/profile/15EZK4",
                        "https://gov.optimism.io/t/delegate-commitments/235",
                        "https://www.optimism.io/vision",
                        "https://gov.optimism.io/t/working-constitution-of-the-optimism-collective/55/1"
                    ],
                    "GPT-summary": "The post explains the Uniswap Optimism Protocol Delegation Program, which aims to give protocols building on Optimism a voice in the ecosystem's decision-making. The Uniswap Foundation has accepted the delegation of $199,501 OP tokens on behalf of the Uniswap Protocol. The proposal suggests creating a committee of five members to lead this engagement in Optimism governance, with three members already selected by the UF based on specific criteria. The post invites community members to nominate themselves to fill the last two multi-sig spots and provides detailed information on the nomination process, criteria, and expectations of the committee.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.679629284649776
                },
                {
                    "author_link": "https://gov.uniswap.org/u/devenmatthews",
                    "index": "2",
                    "likes": "2",
                    "time": "02/02/2023-04:54:29",
                    "content": "Really cool to see Uniswap begin to voice an opinion on other protocol’s governance, Optimism is a clear first partner in this. The concept of DAOs participating in other DAOs is tricky, we should consider Uniswap governance’s ability to ‘override’ use of these tokens by the committee. There could be more fancy veto or override mechanisms written natively into a smart contract wallet, though I think having the $OP tokens owned by Uniswap DAO and voting power delegated to this committee multisig is a strong and simple solution for this use case. Would Uniswap DAO retain full custody of the $OP tokens? I only hope Uniswap can trustlessly remove delegation to this committee if necessary. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.811507936507936
                },
                {
                    "author_link": "https://gov.uniswap.org/u/OPuser",
                    "index": "3",
                    "likes": "1",
                    "time": "02/02/2023-21:53:51",
                    "content": "    devenmatthews:  Would Uniswap DAO retain full custody of the $OP tokens   OP Foundation is delegating those token to Uniswap only for season 3 and post that we will brainstorm and decide on next steps which might include contributing protocol delegation into season 4 and beyond. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.583333333333334
                },
                {
                    "author_link": "https://gov.uniswap.org/u/OPuser",
                    "index": "4",
                    "likes": "0",
                    "time": "02/02/2023-21:56:11",
                    "content": "not sure if i can recommend someone but @StrategicReserve u up for this ?? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.75
                },
                {
                    "author_link": "https://gov.uniswap.org/u/StrategicReserve",
                    "index": "6",
                    "likes": "0",
                    "time": "03/02/2023-05:53:13",
                    "content": "Hey thanks, but Gamma already has a voice in this. Would love to see some other people though. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.958333333333333
                },
                {
                    "author_link": "https://gov.uniswap.org/u/kenneth",
                    "index": "7",
                    "likes": "1",
                    "time": "03/02/2023-14:15:37",
                    "content": "Thanks for the comment and glad to see you are excited about this program!     devenmatthews:  The concept of DAOs participating in other DAOs is tricky, we should consider Uniswap governance’s ability to ‘override’ use of these tokens by the committee.   This is definitely something we considered when creating the committee as well. For this 10 week trial run, we plan to account for this risk in two ways.  One, the UF will be on the multlisig in case the committee were to take any actions against Uniswap’s best interests Two, as stated in the criteria, we will be requiring the committee to proactively communicate their voting rationale to the Uniswap community, allowing them to flag their concerns at any point  However, in the future, we would love to empower more community members to play a bigger role within the Uniswap community and allow them to implement the necessary executive action system to appropriately account for any risks. For instance, we might introduce a new method where the community is able to remove certain delegates from the committee in future trials. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.321882161955692
                },
                {
                    "author_link": "https://gov.uniswap.org/u/GuzMassAdoption",
                    "index": "8",
                    "likes": "2",
                    "time": "09/02/2023-21:43:45",
                    "content": "Thanks @kenneth and the UF team for spinning this up! Allow this post to act as my submission/application for the Delegation program. Below I have filled out the aforementioned nomination criteria.  Name: Jeremy Guzmán Discord username: Guzman_MassAdoption#0820 Telegram: @Guzman_MassAdoption Verification (Tally profile or tweet:  Tally Twitter  I have read and understood the Optimism Delegate Commitment Process: I understand that becoming a delegate is a significant commitment: Yes My reasons for wanting to be a delegate: Aside from just being passionate about DeFi Governance holistically, the Optimism Collective embarked on delivering an innovative and refreshing approach to governance with the prioritization being agile, impactful decisions first that consequently results in protocol profit. This framework piqued my interest and seeing a public good primitive such as Uniswap and the UF exploring collaborative community efforts just makes it all worthwhile. My view on the Optimistic Vision 151 1: As mentioned in the section above, the Optimism Collective’s vision is one that emphasizes community collaboration and long-tailed protocol scalability ideals. In effect, this creates a perpetual flywheel of creativity, growth, and (of course) governance optimization - further driving the fundamental pillar of acting as a public good. My view on the first three articles of the Working Constitution 3: Exciting. The fact that we’re already half way through the WC (Working Constitution) transitory period without an issue is impressive and speaks volume of the quality of community Optimism has. Curious to see any drafts related to the permanent Bedrock Constitution! Skills and areas of expertise: Past contributions to the Uniswap and/or Optimism ecosystems:  Lead the UNIversity Governance initiative with an aim to educate, assist, and provide exposure to emerging Collegiate Clubs looking to participate in UNI governance as well as offering Unigrant Grantees an opportunity to showcase and explain their project/protocol. See all relevant links below:   The Emergence of Collegiate DAOs (The Emergence of Collegiate DAOs - YouTube) Bring on The Stable (BEN Uniswap Meta-Delegate: Bring on The Stable! - YouTube) Penguin Party (BEN Uniswap Meta-Delegate: March Of The Penguins - YouTube) What is PolyWrap? (BEN Uniswap Meta-Delegate: What is PolyWrap - YouTube) Checking out Flipside Crypto (BEN Uniswap Meta-Delegate: Checking Out Flipside Crypto - YouTube) Introduction to Gitcoin (BEN Gitcoin Meta-Steward: Kickoff Meeting - YouTube) Uniswap v3 Launch (BEN Uniswap Committee: Uniswap V3 Celebration - YouTube) BEN Uniswap Governance Call (Uniswap Governance Call: Universities - Let's Talk about Uniswap V3 - YouTube) BEN Uniswap Governance Call: March 13, 2021 (BEN Uniswap Governance Call (3/13/21) - YouTube) Becoming a Uniswap Delegate (Becoming a Uniswap Delegate w/ Harvard & Berkeley - YouTube) DeFi 101 with Tufts and Boston College (DeFi 101 with Tufts and Boston College - YouTube)    Published a research piece detailing a possible renovation of Uniswap governance through the use of DAOlitical parties and the implementation of veUNI: https://twitter.com/Guz_MassAdopt/status/1503452225934397445?s=20&t=15icOyFb5ViD67F29f0T1A   Currently working on a research piece that expands on the benefits of Uniswap implementing a veUNI token & governance model.   Conflicts of interest: n/a ",
                    "links": [
                        "https://twitter.com/Guz_MassAdopt",
                        "https://www.youtube.com/watch?v=KPSZHEAFPkA",
                        "https://www.youtube.com/watch?v=l1BJS9xcOf8&t=450s",
                        "https://www.youtube.com/watch?v=fvvMxCbms4Q",
                        "https://www.youtube.com/watch?v=fi2juYNYxdo",
                        "https://www.youtube.com/watch?v=A3Qn05dOmAE",
                        "https://www.youtube.com/watch?v=nRRQ6PdqrSQ",
                        "https://www.youtube.com/watch?v=DQhA9u5noOk&t=710s",
                        "https://www.youtube.com/watch?v=PxbQxtHyb1Y",
                        "https://www.youtube.com/watch?v=ok3-znxz_Vo",
                        "https://www.youtube.com/watch?v=txBt_dMmpg8",
                        "https://www.youtube.com/watch?v=BOoIvLi2i9Q",
                        "https://twitter.com/Guz_MassAdopt/status/1503452225934397445?s=20&t=15icOyFb5ViD67F29f0T1A"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party wants to collaborate on proposal",
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.211021505376344
                },
                {
                    "author_link": "https://gov.uniswap.org/u/devenmatthews",
                    "index": "9",
                    "likes": "0",
                    "time": "17/03/2023-07:44:25",
                    "content": "Is there a continuation of this conversation elsewhere? Would be great to get clarity on the outcome of this program in this forum thread. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                }
            ]
        }
    ],
    "group_index": "267"
}