{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/uniswap-and-web3/17555",
            "title": "Uniswap and Web3 ",
            "index": 17555,
            "category": [],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/pcfreak30",
                    "index": "1",
                    "likes": "3",
                    "time": "25/08/2022-22:13:54",
                    "content": "Hello, I represent a project (https://lumeweb.com ) that aims to bring web3 to the masses. I define web3 as the dweb (p2p, ipfs, tor, bittorrent) plus economy/blockchain. I have been looking at some of the top Ethereum defi projects since the Tornado event/incident, and I am finding that almost no “defi” project is ready to be a part of web3 and be as decentralized as it claims to be for the long term. While unrelated, to prove this point, compound finance is planning on censoring transactions on their frontend, even on IPFS. https://twitter.com/pcfreak30/status/1562092418291453952 For the Uniswap project, I am looking to see what is required for the project to:  Update the uniswap.eth ENS domain to be a direct IPNS hash and not point to a domain for DNSLink lookup, which effectively centralizes a decentralized uniswap to an ICANN domain Ensure the decentralized copy does not censor its users/block addresses.  Lume Web is currently testing a prototype Firefox-only extension (v2 for the project, v1 was in march or so) that will enable access to all of the above (arweave in the future) in a purely decentralized way via web3 technology being actively developed. This includes access to 6 different blockchain registries/domains on 2 content/storage networks at present. If anyone is interested in assisting in testing on that, you can join the server at https://web3extension.com (top right) My goal here is to be proactive and assist all major defi protocols that wish to actually be decentralized and not turn into Cefi or even what I have recently heard fairfi as a marketing spin by some lawyers of projects. Mods, if this is better as an informal proposal/something else, feel free to move, but I see this as simply an introduction and, ideally, an open discussion on real decentralization and what I view as the true web3. Kudos. ",
                    "links": [
                        "https://twitter.com/pcfreak30/status/1562092418291453952",
                        "https://web3extension.com/"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.877604166666667
                },
                {
                    "author_link": "https://gov.uniswap.org/u/egk10",
                    "index": "2",
                    "likes": "1",
                    "time": "29/08/2022-13:00:48",
                    "content": "excellent initiative ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                }
            ]
        }
    ],
    "group_index": "217"
}