{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/mhonkasalo-teemulau-delegate-platform/17064",
            "title": "Mhonkasalo & teemulau Delegate Platform ",
            "index": 17064,
            "category": [
                "Delegation Pitch"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/teemulau",
                    "index": "1",
                    "likes": "12",
                    "time": "06/07/2022-13:26:58",
                    "content": " Key Info Name: mhonkasalo & teemulau Delegate Address: 0x553F674dD7D102ad79C644103974a1cc53b62Ac2 Forum: @mhonkasalo, @teemulau Twitter: @mhonkasalo, @teemulau Discord: mhonkasalo#3692 & teemulau#7395  About us  Long-time crypto investors who have participated in and actively researched the DeFi ecosystem for years. Today, we are working together on protocol research and governance efforts. We are also delegates on MakerDAO. Many of you may know @mhonkasalo on Twitter. I was previously on the research team at The Block and on the investment team for ParaFi Capital. @teemulau has experience organizing one of the largest tech events globally, Slush, and working in finance & ops positions in startups. We are long-term UNI holders and have been part of the community for years.   Our initiatives  Background Uniswap is the leading decentralized exchange, with a market share that has oscillated between 65-75% over the past year on Ethereum and success on e.g. Optimism and Polygon. The protocol is the most likely candidate to be the “order book of the world” and with it the most important DeFi infrastructure component. On the downside, there’s quite a bit of negativity around the perceived progress that Uniswap has made recently. UNI token economics are considered poor due to the lack of value capture and the activity of Uniswap Labs — e.g. its venture arm — doesn’t necessarily drive value to token holders. In the big picture, the UNI community should remove its reliance on Uniswap Labs. Instead, the Labs entity should eventually become just one (albeit important) team that works on the behalf of the protocol. In the shorter term, the community should start the journey to maximizing value for itself. Note, it’s possible Uniswap Labs would be supportive of the community taking charge of (parts) of the project — including regulatory reasons. To date, the community governance over the project’s large treasury (roughly $1.6 billion held in UNI) hasn’t provided much value. Token holders don’t need to rely on a single team to execute on their behalf. This is the essence of decentralized protocols and will help drive Uniswap’s growth in the future.  Roadmap Below, is outlined a rough roadmap for what a better community-led effort could look like. This is split up into 4 steps, with the 1st 2 being baby steps to token holders becoming more active in the protocol overall:  Fee switch experimentation. Recognized delegate program. Start forming teams outside Uniswap Labs. Establishing a development roadmap   Fee switch experimentation Uniswap has a fee switch that can be turned on for between 10-25% of LP fees on a given pool. The common misconception is that startups should not distribute profits but instead reinvest them — note that in Uniswap’s case, currently, the marketplace isn’t taking a cut at all and providing the exchange service for free. Extracting a fee does not equal necessarily a profit distribution but profits could be collected into a treasury. Uniswap does not have a business model and generates 0 revenue for its owners. There is a question on whether or not reducing LP profits would lead to Uniswap becoming less competitive in competition with other DEXs. Overall, the next steps should be a data-driven research report (a task we’d be happy to take on):  What the impact on LPs will be and whether an e.g. 10% fee would be detrimental to Uniswap liquidity. A recommendation on which pool would be the best place to start with.   Recognized delegate platform MakerDAO pays its delegates an annual salary. This is a good idea and could be replicated on the cheap with UNI incentives. Recognized delegate programs are a good idea because token holders can elect competent people who drive both vision and strategy for a DAO. They are responsible for representing the will of the token holders and are aligned because their incentives are tied to success. In practice, starting this would mean creating a proposal similar to MakerDAO’s recognized delegate program. With both the fee switch working and the consequential selection of paid delegates, UNI community involvement will be supercharged.  Start forming teams outside Uniswap Labs MakerDAO has Core Units that work for MKR holders. These Core Units ask for budgets and have some scope for their work. Examples include Protocol Engineering, Real World Finance, Data Insights, and others. UNI holders would vote on onboarding development teams and budget approvals via a standardized process. What the needs are for teams that develop the protocol comes from the roadmap. This is a great opportunity for builders to come in and work on a DEX while receiving upside and not starting up a competitor with only minor improvements.  Establishing a development roadmap This is really about:  Establishing a development roadmap (and vision) for the project that UNI holders understand. Working with Uniswap Labs on not replicating work and strategic synergies.  A short list of potential low-hanging fruits for a DEX includes (from Hasufl). Not all of these may be applicable to Uniswap, but directionally:  Front-running protection. Revert protection. More order types (e.g. TWAPs) Solver/market-maker competition for user fills. Account abstraction. Payment-for-order-flow.  In addition to this, there are interesting larger opportunities for Uniswap to go after such as perpetual swaps and synthetic stock trading — with the goal of exiting the “internal DeFi casino”. This would start with a series of Proposal Requests, where the community could come together on desired features moving forward. ",
                    "links": [
                        "https://gov.uniswap.org/u/mykha2/summary",
                        "https://gov.uniswap.org/u/teemulau/summary",
                        "https://twitter.com/mhonkasalo",
                        "https://twitter.com/teemulau",
                        "https://vote.makerdao.com/address/0xaa19f47e6acb02df88efa9f023f2a38412069902",
                        "https://twitter.com/mhonkasalo",
                        "https://twitter.com/teemulau",
                        "https://gov.uniswap.org/t/temperature-check-create-the-uniswap-foundation/17358/50"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.819429637526651
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Athayde3586",
                    "index": "2",
                    "likes": "1",
                    "time": "09/07/2022-09:00:00",
                    "content": "So y’all going to keep trying to steal not ur keys please leave my stuff alone asking nicely ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/teemulau",
                    "index": "3",
                    "likes": "1",
                    "time": "10/08/2022-11:26:03",
                    "content": "We are starting a process to update our reasoning for voting decisions here on this thread: ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/mhonkasalo",
                    "index": "4",
                    "likes": "4",
                    "time": "10/08/2022-11:26:14",
                    "content": "We support the proposal to form the Uniswap Foundation. Having a foundation that has the necessary resources to attract top talent and build out a growing ecosystem of Uniswap products is key to the decentralization of the protocol and its continued growth. We know Devin and the advisors/team members here, and believe they are the right people to take this initiative forward. This is a step that aligns with our Delegation Platform pitch and is a good next step in UNI token holders becoming more active in the ecosystem. It will take a lot of work and motivated UNI holders/delegates to make the best of these resources and we are excited to contribute. ",
                    "links": [
                        "https://gov.uniswap.org/t/mhonkasalo-teemulau-delegate-platform/17064"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.671536796536797
                },
                {
                    "author_link": "https://gov.uniswap.org/u/devinwalsh",
                    "index": "5",
                    "likes": "1",
                    "time": "12/08/2022-00:07:18",
                    "content": "Thanks for writing this up for the community @mhonkasalo and @teemulau !! Excited to see you both get more involved in Uniswap governance ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.979166666666666
                },
                {
                    "author_link": "https://gov.uniswap.org/u/mhonkasalo",
                    "index": "6",
                    "likes": "3",
                    "time": "26/09/2022-15:49:11",
                    "content": "We decided to vote yes to both zkSync and Aurora deployments. In particular, we are excited about the scalability offered by zk-Rollups and these will be high-impact for both Ethereum scaling and Uniswap’s continued dominance. We’d like to see a proposal to deploy Uniswap on Starknet as well. Snapshots in question:  Aurora temperature check: Snapshot  zkSync temperature check: Snapshot  zkSync consensus check: Snapshot   ",
                    "links": [
                        "https://snapshot.org/#/uniswap/proposal/0xab1dbb6e3486073b81cc64b81d15d24a7bf82efcfc94e533de0779250df06ba9",
                        "https://snapshot.org/#/uniswap/proposal/0xe6ad2033b04559b3db6be7fa9993f05ee68f43f1061c632382c88e367e76bfb1"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.354166666666666
                },
                {
                    "author_link": "https://gov.uniswap.org/u/teemulau",
                    "index": "7",
                    "likes": "1",
                    "time": "14/11/2022-17:59:55",
                    "content": "We voted “Yes” for the temperature check to Deploy Uniswap v3 to Boba Network, simply because we see little to no downside in extending Uniswap v3 to new networks. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.914772727272727
                },
                {
                    "author_link": "https://gov.uniswap.org/u/mhonkasalo",
                    "index": "8",
                    "likes": "1",
                    "time": "23/11/2022-18:02:42",
                    "content": "Polls - 11/23/2022  “Yes” for the consensus check to deploy Uniswap v3 to Boba Network. Given the size of the grant from the Boba side ($1m in tokens) and the commitment to incentivize liquidity, there’s no downside for Uniswap to deploy on Boba in our view. “Yes” for the temperature check to fix cross chain messaging bridge on Arbitrum.  ",
                    "links": [
                        "https://snapshot.org/#/uniswap/proposal/0xa4a21c808b28a61562c6b4ebf5b71c0cd37ee2d630bcbdf91ffaf5f683cc650f",
                        "https://gov.uniswap.org/t/governance-weekly-recap/17803/11"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "201"
}