{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/buying-vs-mining-uni/1002",
            "title": "Buying vs. Mining $UNI ",
            "index": 1002,
            "category": [],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/phillipchaffee",
                    "index": "1",
                    "likes": "2",
                    "time": "17/09/2020-12:45:53",
                    "content": "I am hoping someone smarter than me can explain their thoughts around the tradeoffs between buying $UNI directly and mining it via one of the pools. Is one cheaper overall? Will I get more $UNI for my money if I just purchase it directly? Is maxing my amount of owned $UNI even a good idea? I am thinking maybe mining is good because you get the interest + $UNI. Buying $UNI would be good to maximize owned $UNI? Any thoughts/insight appreciated. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://gov.uniswap.org/u/TMod_Marco",
                    "index": "2",
                    "likes": "2",
                    "time": "17/09/2020-12:57:29",
                    "content": "It’s hard to really provide insights in what rewards mining will offer you at this point. It most likely depends on how much liquidity you provide in the pool & how much is provided in total, as rewards will be distributed evenly. There’s some good info under ‘liquidity mining’ here: https://uniswap.org/blog/uni/. Myself, I’m looking to purchase more $UNI in the near future. Most likely around $2-2.5, I’m expecting this to hit shortly as many people immediately try to cash out their ‘airdrop’. I can’t tell you which provides you better returns, can tell you that mining is most likely less risky as you’re not directly putting your capital at risk. You’d only be able to lose out on the swap rates (e.g. if you provide liquidity on USDT/ETH and ETH goes down in value). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.962752525252526
                },
                {
                    "author_link": "https://gov.uniswap.org/u/phillipchaffee",
                    "index": "3",
                    "likes": "0",
                    "time": "17/09/2020-12:59:21",
                    "content": "This makes a ton of sense. Thanks. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/TMod_Marco",
                    "index": "4",
                    "likes": "0",
                    "time": "17/09/2020-13:03:32",
                    "content": "No problem at all, good luck! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.375
                },
                {
                    "author_link": "https://gov.uniswap.org/u/h4xurb00ty",
                    "index": "5",
                    "likes": "0",
                    "time": "17/09/2020-13:14:32",
                    "content": "Powernoob here  Bought my first crypto this morning after staying up half the night to get accounts and and bunch of humdrum set up. STILL have no $UNI and running the regular workday now, can anyone help point the easiest way to get UNI with these ETH I just got. (Driving, eating, talking calls all while trying to remember email passwords for a bunch of new accounts in a completely new area of interest is getting me a little off my rocker lol) UNIpowerSWAPPER$ please! Come to my rescue ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.834686147186146
                },
                {
                    "author_link": "https://gov.uniswap.org/u/TMod_Marco",
                    "index": "6",
                    "likes": "0",
                    "time": "17/09/2020-13:18:37",
                    "content": "You could purchase UNI on Uniswap, Binance, KuCoin… whichever you prefer. Uniswap might be the easiest : https://uniswap.info/pair/0xd3d2e2692501a5c9ca623199d38826e513033a17. Or do you mean you want to claim the airdrop? As that can basically be done on any of the swap pages (top right corner), if you’ve used Uniswap before September 1st. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.788690476190476
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Negan",
                    "index": "7",
                    "likes": "0",
                    "time": "18/09/2020-17:34:36",
                    "content": "    TMod_Marco:  Myself, I’m looking to purchase more $UNI in the near future. Most likely around $2-2.5, I’m expecting this to hit shortly as many people immediately try to cash out their ‘airdrop’.   Hihi. Seems that this didnt happen. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.333333333333333
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Dodecagon",
                    "index": "8",
                    "likes": "0",
                    "time": "18/09/2020-17:44:30",
                    "content": "Buying it has a chance of higher returns in a very short term outlook but locking assets up in mining ASAP is what is going to be an insensitive for people to buy UNI. If anyone is in for the long term they’ll lose the power your votes have and the non-circulating and unstaked tokens can give people reason to believe this is another get rich scheme with no long term value. Using an exchange to buy UNI then transferring it to my wallet has been the cheapest and quickest way I’ve found for buying it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6000000000000005
                },
                {
                    "author_link": "https://gov.uniswap.org/u/TMod_Marco",
                    "index": "9",
                    "likes": "0",
                    "time": "19/09/2020-11:32:28",
                    "content": "$2.50 hit  $2.45 in fact hehe. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/David1992",
                    "index": "10",
                    "likes": "0",
                    "time": "20/09/2020-13:30:01",
                    "content": "Anoche entre en la minería a 0.48 uniswap a la semana ya comentaré el mes que viene si mereció la pena ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/DanDD",
                    "index": "11",
                    "likes": "1",
                    "time": "23/09/2020-07:09:21",
                    "content": "    h4xurb00ty:  TODAVÍA no tengo $ UNI   Hello, the passwords better save them in a .txt with a backup and you do not waste the rocker time :), to use Uniswap I recommend you install the Metamask extension for the browser, and here the most important thing, after entering the password (that you are going to have to remember or save where you can find it) you will see the key (and that if you do not lose it is access to your wallet when you want to change devices, those 12 words save them and take care of them well, and as the saying without seed They are not your coins) make a backup on a pendrive in the cloud on a metal stone where you like, those are the keys, after the password and unlock so you can see the keys it will ask you to enter it in an order, that is your wallet, you add eth from your other account you go to the link that you put right TMod_Marco in Hello, the passwords better save them in a .txt with a backup and you do not waste the rocker time :), to use Uniswap I recommend you install the Metamask extension for the browser, and here the most important thing, after entering the password (that you are going to have to remember or save where you can find it) you will see the key (and that if you do not lose it is access to your wallet when you want to change devices, those 12 words save them and take care of them well, and as the saying without seed They are not your coins) make a backup on a pendrive in the cloud on a metal stone where you like, those are the keys, after the password and unlock so you can see the keys it will ask you to enter it in an order, that is your wallet, you add eth from your other account you go to the link that you put in your answer and you give it where it says trade and there you enter Uniswap on the right margin it will tell you to connect wallet click and it connects itself, then you swap it whatever you want, add the tokens from e etherscan copies where it says contract from Uni 4,in Metamask you give it add token custom token and paste contract , best regards to everyone. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.565126050420168
                },
                {
                    "author_link": "https://gov.uniswap.org/u/zhenegr",
                    "index": "12",
                    "likes": "0",
                    "time": "23/09/2020-10:19:00",
                    "content": "That’s for sure  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/TMod_Marco",
                    "index": "13",
                    "likes": "0",
                    "time": "23/09/2020-14:34:41",
                    "content": "Locking this topic, if you wish to continue the discussion then feel free to do so on Discord  : https://discord.gg/gZbNc4 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/TMod_Marco",
                    "index": "14",
                    "likes": "0",
                    "time": "23/09/2020-14:34:44",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "0"
}