{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/rfc-a-mechanism-to-use-the-uni-treasury-to-grow-and-defend-uniswap/17015",
            "title": "[RFC] A mechanism to use the UNI treasury to grow and defend Uniswap ",
            "index": 17015,
            "category": [
                "Proposal Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/firstprinciples",
                    "index": "1",
                    "likes": "6",
                    "time": "26/06/2022-17:49:19",
                    "content": "We believe that, just as in traditional companies, capital and ‘equity’ should be used for growth, future value creation and moat building. This post is a proposal for a mechanism we think would help Uniswap allocate, in size, towards that.  Current state of the treasury: On the one hand, Uniswap currently has the largest treasury in DeFi in dollar terms (per: OpenOrgs.info). On the other, its ~100% in UNI tokens. Some vested, some unvested:  1358×532 40 KB  As @Hasu  outlines in his A New Mental Model for DeFi Treasuries, native tokens in DAO treasuries can be looked at as “the crypto-equivalent of authorized but unissued shares”. Furthermore, a sale of just 1% of the vested UNI tokens in the treasury for USDC would result in 50% price slippage on 1inch. This means that this capital is effectively unusable for any relevantly-sized CaPex or OpEx.  Opportunity: From the above, our view is that Uniswap’s treasury is potentially an extremely valuable asset for the protocol and DAO, but that current use cases don’t unlock a fraction this potential value. The Unigrants program is incredible, but there ought to be other and larger scale allocation opportunities for the treasury.  Goals: We’d like to:   Have a more diversified treasury.  Reducing the treasury’s exposure to just pure UNI and ensuring Uniswap thrives under different market conditions.    Use treasury funds specifically to grow Uniswap.  There can be disagreement about what the best KPIs for Uniswap’s growth ought to be, but volume as the core one and TVL, liquidity and users as others seems directionally correct.    Use UNI to deepen Uniswap’s moats and build durable defensibility.   Competitive advantages that can’t be forked or copied and that contribute to keeping Uniswap the leading DEX.    We’ll look at this proposal through the lens of how it may impact all three.  Idea:  High-level: Uniswap provides $x value in UNI tokens from the treasury and a partner protocol/project/DAO provides $x value in their governance (or otherwise) token to LP in an uniswap pool between the two tokens. The resulting LP shares are split proportionally between the two treasuries (uniswap and the partner’s).  Process: The way to determine these and other parameters would be via standard governance. An interested protocol/project/DAO/community would publish a proposal to uniswap governance following a standard, to be created, template (similar to templates for asset listings on Aave, for example). They’d refer what the value of x should be and why, their metrics, their token’s value (governance or otherswise) or value accrual, why aligning their community with uniswap’s would be valuable, amongst other relevant information for a decision. After discussion here in the forum, it’d move to a governance vote and be acted upon if passed. We’d always want these “partner” projects to be high quality or high potential, and that would be assured by UNI governance deciding individually on each.  Pro case: We believe that, over time, this allocation mechanism would bring material diversification, growth and moats to Uniswap – the three goals stated above.   Treasury Diversification Over time, the treasury becomes more diversified into other high quality assets, in the form of XYZ-UNI LP positions. 1.1. In particular, this is a way to diversify the treasury without ever directly selling UNI (which, like seen above, wouldn’t even be possible in size). No immediate/direct selling pressure would be put on UNI, contrary to most anternative diversification methods. 1.2. Not only does this diversification mechanism not put selling pressure on UNI, it in fact increases UNI’s liquidity (potentially by many multiples). This has additional benefits such as making UNI a better/more sought after collateral asset across DeFi as well as opening up more ways to employ treasury funds in the future (due to liquidity for bigger size).   Capital efficient and durable expansion of TVL For every dollar in UNI invested by the treasury, this “joint LP mechanism” would add two dollars of TVL to Uniswap. Moreover, this liquidity provision is neither from mercenary capital nor from short-term LP profit maximizing agents. It’s rather from DAOs committed to hold the LP shares long-term. As such, this mechanism should lead to sizeable and predictably permanent TVL expansion. 2.1. Alongside point 1., this creates an unforkable moat for Uniswap in the form of protocol owned liquidity, but in a much more sustainable way than previous attempts at POL – like bonding (there is no dilution nor induced selling pressure in our mechanism).   Incentive Alignment As discussed, partners that get approved for this joint LP deal will be approved by UNI governance and, as such, should always be high quality or high potential protocols/projects/DAOs. After entering this “exchange” with Uniswap, their treasuries will be positively exposed to UNI, financially aligning their communities and teams with Uniswap’s long-term success. From this, we expect the mechanism to create, over time, a bigger and bigger network of top DeFi/web3 projects that are rationally incentivized to want Uniswap to prosper. We think this can constitute yet another unforkable moat and contribute to keeping Uniswap the leading DEX.   Demand Many if not most other protocols/projects/DAOs face the same challenge of having most of their treasuries’ value in their own governance token (just look at openorgs.info or hasu’s article). This joint LP token exchange presents a new possibility for them to diversify their treasury into another high quality asset without generating selling pressure on their token (which would happen in market selling). As an additional benefit, they would also get the reverse incentive alignment pointed out in 3. As such, we expect strong and sustainable demand from interested partners.   UNI as a part of Uniswap’s product The MKR and AAVE tokens play a role in Maker and Aave’s products and directly add value to them. Altough in different ways, in both cases these governance tokens’s value is used to cover/insure bad debt the protocols may acumulate in extreme scenarios (further reading: maker, aave). For both, their governance tokens – as assets – make the protocols better. In their case, being debt protocols, ‘better’ here means safer for depositors. This is another possible moat in DeFi (see Multicoin’s Protocols Don’t Capture Value, DAOs Manage Risk). Currently, UNI as an asset doesn’t directly contribute to Uniswap’s product – the DEX – in any analogous way. The mechanism outlined in this proposal would make UNI a very relevant pair in Uniswap pools and hence an unforkable value-add to the protocol (adding liquidity, volume and TVL). We think that, over time, UNI could become the third or fourth most prevalent trading pair, after ETH, BTC and stables.    Considerations: The obvious main aspect this proposal leaves out is implementation of such a mechanism in v3. It is quite straightforward to do these token swaps via LP with uniswap v2 positions (no upfront decision on liquidity range, no maintenance, fungible LP shares, very clean process overall). The same isn’t true if done in uni v3 (which could be more capital efficient but much more complex to manage). We don’t have a strong view either way here. There are pros and cons. As such, we’d love to see discussion around this point if the uniswap community finds the overall proposal to make sense.  Finally, this is a Request for Comments, not a proposal yet. We’d love to get all questions, feedback and improvement ideas from the community. We’re also open to providing more data, run simulations, and present models on this mechanism, if you think it’d be helpful. ",
                    "links": [
                        "https://global.discourse-cdn.com/business6/uploads/uniswap1/original/2X/a/aeac99ca1a70a2609a4543b492d0ba6086c0bad2.png",
                        "https://uncommoncore.co/a-new-mental-model-for-defi-treasuries/",
                        "https://postimg.cc/m1SD71qJ",
                        "https://app.1inch.io/#/1/swap/UNI/USDC",
                        "https://members.delphidigital.io/reports/unforkable-moats-in-defi/",
                        "https://coinmarketcap.com/alexandria/glossary/mercenary-capital",
                        "https://www.google.com/search?q=protocol+owned+liquidity",
                        "https://medium.com/coinmonks/what-is-protocol-owned-liquidity-a-primer-on-the-model-developed-by-olympus-dao-55368f200d66",
                        "https://openorgs.info/",
                        "https://uncommoncore.co/a-new-mental-model-for-defi-treasuries/",
                        "https://makerdao.com/en/whitepaper/#maker-protocol-auctions",
                        "https://docs.aave.com/aavenomics/safety-module",
                        "https://multicoin.capital/2021/09/16/daos-manage-risk/"
                    ],
                    "GPT-summary": "The author proposes a mechanism to use the UNI treasury to grow and defend Uniswap. The proposal suggests that Uniswap's treasury is an extremely valuable asset for the protocol and DAO, but current use cases don't unlock a fraction of its potential value. The proposal suggests a joint LP mechanism where Uniswap provides $x value in UNI tokens from the treasury and a partner protocol/project/DAO provides $x value in their governance (or otherwise) token to LP in a Uniswap pool between the two tokens. The resulting LP shares are split proportionally between the two treasuries. The author requests feedback and improvement ideas from the community.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Token economics",
                        "Board composition",
                        "Interoperability and Scaleability",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.659078771695594
                },
                {
                    "author_link": "https://gov.uniswap.org/u/rfritsch",
                    "index": "2",
                    "likes": "0",
                    "time": "29/06/2022-09:25:39",
                    "content": "I very much appreciate suggestions to diversify the treasury and would like to share my opinion on this one: For me, a protocol treasury should be a reserve to support development of the protocol (and the surrounding ecosystem), specially during difficult times (in which the protocol’s token may have a very low value). I would mentally split the suggested plan in two steps:  Swap UNI tokens of value v from the treasury for “other protocol” token of value v. Use two assets in the treasury to provide liquidity in an AMM pool.  I don’t think either of the two steps help to make the treasury a safer reserve:  Replacing UNI tokens by “other protocol” tokens doesn’t necessarily make the treasury any less volatile. The treasury should probably hold mostly stablecoins (and at most some ETH or similar assets). Providing liquidity with treasury assets introduces extra risks and operational complexity. I don’t think liquidity provision is the purpose of a treasury.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.386580086580086
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Brook_CIAN",
                    "index": "3",
                    "likes": "0",
                    "time": "30/06/2022-08:28:51",
                    "content": "Conclusion: Reject Rationale: The increased pool with this form of exchange does not hold/influence the pricing power of the tokens, but actually just increases the arbitrage space. This is of very limited help to the UNI ecosystem ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 4.767857142857142
                }
            ]
        }
    ],
    "group_index": "199"
}