{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/proposal-template-2-0-upgrade-for-deployments-agreements/19936",
            "title": "Proposal Template 2.0 - Upgrade for Deployments & Agreements ",
            "index": 19936,
            "category": [
                "Governance-Meta"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/tobyshorin",
                    "index": "1",
                    "likes": "0",
                    "time": "05/01/2023-17:54:58",
                    "content": " This proposal is an improvement to the Cross-Chain Deployment Proposal Template that adds accountability mechanisms to ensure terms of the agreements with Uniswap deployers and partners are upheld. It addresses accountability by requiring:  KPIs & success metrics Engagement terms Budget & financing Proposal code  Future deployments and partnership offers to Uniswap DAO may this template to improve the credibility of proposals to delegates. This template is one output of a working group convened by Other Internet in November and December to address accountability issues in Uniswap partnerships. The template is intended to be complemented by a full Accountability Committee that we will be proposing in the coming weeks. Contributors: Toby Shorin, Charlie Feng (Agora), Laura Lotti, Aaron Lewis   Proposal Title Point of Contact: [ Name, Contact Information, ETH Address ] This person will be the main point of contact on the partner’s side throughout the proposal and engagement process.  Proposal summary Tweet-length summary of the proposal  Overview of proposal  Description of the proposal including timeline, benefits to Uniswap, and other relevant information.  Motivation  What opportunity or challenge is this partnership addressing, and why is it impactful for Uniswap?  Partner Details Partner Details Who is making this proposal and what should we know about them? Who is on the proposer team? Partner Legal What legal entity, if any, is making this proposal? Clarify whether the partner is an unincorporated DAO or a legal entity in a jurisdiction. Delegate Sponsor Is a delegate co-authoring or sponsoring this proposal on behalf of the partner team? What is the delegate’s relationship with the proposed partner? Conflict of Interest Declaration Partner organization and team members must disclose any past or existing financial or contractual relationship to Uniswap Labs, UNI token, or investments of Uniswap Labs Ventures. Additional information for cross-chain deployments If you’re proposing a cross-chain deployment, please include some information about the application ecosystem, size of user base, daily transfer volume, etc. + stage of development of the project (e.g. pre-launch, testnet, mainnet)  Engagement Terms  Project Financing Itemized Budget (denominated in USD) What is the proposed budget for this project, if it is going to be funded by Uniswap Treasury? Please list a detailed cost breakdown including:  Team rates License, subscription, or server costs Other resource costs  What discounts or subsidies if any are applied? Funds Provided (denominated in USD) What payments, subsidies, or grants if any are being offered to Uniswap?  KPI & Success Criteria KPIs & Metrics Which KPI or Strategic Priority is this initiative targeting? There are generally 2 forms of projects:   Growth-driven projects: on-chain, trackable metrics preferred here.  Screen Shot 2023-01-05 at 12.42.22 PM1246×422 95.5 KB    Strategic Initiatives: that targets a specific goal (e.g. Uniswap Foundation core initiatives). These are more completion based.  Screen Shot 2023-01-05 at 12.42.33 PM1236×286 67.8 KB    Success Criteria What does success look like? Risk Profile What potential risks are there for this project’s success? How could they be mitigated?  Protocol security Please address the following questions if you’re proposing a cross-chain deployment:  Does the bridge support arbitrary message passing? Is the bridge secured by a trusted entity, by a multi sig, or a protocol/set of incentivized nodes? Does the bridge leverage the security of the source chain (e.g. Ethereum L1) or destination chain, or is security provided by another third party entity? Is it possible for a fraudulent message to be passed to the destination chain? If so, are there any recall mechanisms? What are the ramifications of fraud to the malicious actor? Has the bridge code been audited? By a third party? What attack vectors and vulnerabilities were identified, if any? Have the identified vulnerabilities been remedied?   Timeline & Engagement Structure Milestones What milestones are relevant for budget disbursement? Note: Preference placed towards milestones that are attached to KPI or Success Criteria. On what timeline is this partnership reevaluated for renewal, if relevant?  Duration & milestones of the engagement Criteria after which engagement is considered complete   On-Chain Details Proposal Code   Proposal Code Listed Here Proposal code goes here   Code Description In plain language, explain the intended state of the chain after a successful on-chain vote. *Note: Proposal code must be included to proceed to the Consensus Check phase.  License exemption details Legal entity receiving the exemption Sample language for a Layer 2 solution: \"Team [or Company] X may use the Licensed Work to deploy it on Y, a layer 2 solution for Ethereum, provided that the deployment is subject to Ethereum layer 1 Uniswap Protocol governance and control.” ",
                    "links": [
                        "https://otherinter.net/research/uniswap-accountability/",
                        "https://global.discourse-cdn.com/business6/uploads/uniswap1/original/2X/a/a7f2d31aea283aae96a2e18a8c30badeba702d6f.png",
                        "https://global.discourse-cdn.com/business6/uploads/uniswap1/original/2X/c/cb3bb480aa0a9ae1b520f73a0e0c16654f8f9e33.png",
                        "https://gov.uniswap.org/t/rfc-deploy-uniswap-v3-on-starknet/19938/3",
                        "https://gov.uniswap.org/t/cross-chain-deployment-guide/19988",
                        "https://gov.uniswap.org/t/rfc-ammended-deployment-proposal-process/20777",
                        "https://gov.uniswap.org/t/rfc-accountability-committee-proposal/20316",
                        "https://gov.uniswap.org/t/temperature-check-accountability-committee-proposal/20579"
                    ],
                    "GPT-summary": "The post is a proposal template for cross-chain deployment that aims to add accountability mechanisms to ensure the terms of agreements with Uniswap deployers and partners are upheld. The proposal includes details such as KPIs, success metrics, engagement terms, budget, and financing. The post also includes information on the contributors, partner details, legal aspects, delegate sponsor, conflict of interest declaration, engagement terms, project financing, KPIs, success criteria, risk profile, protocol security, timeline, engagement structure, on-chain details, and license exemption details. The post is not advertising the proposal, but rather explaining its details and seeking feedback and collaboration.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.456501831501831
                },
                {
                    "author_link": "https://gov.uniswap.org/u/dennisonb",
                    "index": "2",
                    "likes": "0",
                    "time": "05/01/2023-21:03:12",
                    "content": "This is excellent to see. A question, where is this proposal to actually live- In the forum in this format? How should this proposal template translate to the voting platforms? IE: What should be used when creating a Snapshot versus what should be used when creating the On-Chain vote on Tally? It would be interesting to standardize this proposal template in general across proposals to make them easier to read, and act upon. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 7.107954545454546
                },
                {
                    "author_link": "https://gov.uniswap.org/u/tobyshorin",
                    "index": "3",
                    "likes": "1",
                    "time": "05/01/2023-21:31:53",
                    "content": "This isn’t really a proposal, it doesn’t need approval by the community to be used. It’s a heuristic that (I hope it is self-evident) is an improvement over the existing heuristics. Unfortunately the forum is basically the best thing we have for documentation. To your last point - most proposals are already converging to subsets of things identified in this template, so I’m expecting people to use some variation of this as time goes on. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.2
                }
            ]
        }
    ],
    "group_index": "253"
}