{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/allow-uni-tokens-locked-in-pools-to-vote/5559",
            "title": "Allow UNI tokens locked in pools to vote ",
            "index": 5559,
            "category": [
                "Governance-Meta"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/Snuffy",
                    "index": "1",
                    "likes": "31",
                    "time": "23/09/2020-10:30:39",
                    "content": "Preface: I was not entirely sure if this is the right section to post this. we discussed it on discord and the consensus was that this could be in the scope of governance so here we are. PROBLEM Uniswap is built on the concept of liquidity pools. more liquidity means more stable prices and therefore healthier pairs. coins are locked in these pools for great lengths of time. One of those pairs is UNIETH, with currently ~5.6 million UNI locked up in the pool. The problem I see is that currently it is not possible to vote with pooled UNI. in order to vote, one would have to leave the pool altogether and repurpose their UNI to the vote. on a personal level this leaves us with a problem, where we have to choose between pulling out and voting at the risk of loss, or not voting on a topic that we would actually care about. On a macro scale, the setup is forcing us to choose between either a stable pool or using the tokens for their intended purpose. I believe this problem is quite substantial as ideally we would be doing both. the pools are what gives uniswap its title as the top dex out there and the governance is a great leap forward, yet the UNI coin in effect is incompatible with the platform’s own core defining feature. SOLUTION allow us to stake our LP tokens in a voting contract which returns us some sort of IOU token useful for votes and delegation, conservatively representing our share in the UNI pool (like, factoring in slippage by calculating our pool share at 80% of a holder’s UNI share at the time of staking). This way we can actually hold UNI, strengthen the pair and do our part in the governance of uniswap by propsing and casting votes. This proposal needs thought and development, its easier said than done to just create a vote staking mechanism, not to mention it will probably include updating the current vote contracts. therefore a part of my proposal would be to free up adequate funding from the treasury to compensate the team for time put into making this work. ",
                    "links": [
                        "https://gov.uniswap.org/t/announcement-unofficial-community-call-thursday-12-nov-17-00-utc/8371/4",
                        "https://gov.uniswap.org/t/there-should-be-no-proposals-until-we-are-all-can-vote/7647/7"
                    ],
                    "GPT-summary": "The author proposes a solution to the problem of not being able to vote with pooled UNI tokens on Uniswap. The proposal suggests allowing LP tokens to be staked in a voting contract, which would return an IOU token for votes and delegation. The post also acknowledges the need for thought and development in creating a vote staking mechanism and suggests freeing up funding from the treasury to compensate the team for their time. The post does not contain any advertising or collaboration requests.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.574735449735449
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Zer0dot",
                    "index": "2",
                    "likes": "3",
                    "time": "23/09/2020-15:40:15",
                    "content": "Interesting idea! I’m just concerned about the fluctuating “voting power” associated with liquidity tokens. How would this be handled? A snapshot? Who knows! Definitely worth talking about. Thanks for bringing this up. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.135416666666666
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Portuno",
                    "index": "4",
                    "likes": "2",
                    "time": "17/09/2020-20:22:13",
                    "content": "I would actually prefer it the other way around. Only the holders be able to vote/delegate/etc. That way, you either invest in the community with your time, holding the token and being an active part of it, or you can be a liquidity provider, only for the tokenomics. And the best part, is that you can be both of them, having part of your $UNI as a Liquidity provider farming more tokens (for ex.), and holding the token  and deciding for the future of the company. Nevertheless this is something i would like to be clarified as well ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.967592592592592
                },
                {
                    "author_link": "https://gov.uniswap.org/u/nicoGD",
                    "index": "5",
                    "likes": "6",
                    "time": "18/09/2020-09:50:50",
                    "content": "What benefit would there be if we force the choice between governance rights and liquidity providing ? Why would we want to prevent the voting community to provide all the liquidity they can or want to provide ? More liquidity => more volume => more fees => more liquidity… this is the core principle of uniswap, isn’t ? This is why we should include $UNI tokens locked in uniswap pools for calculating governance rights IMHO Maybe someone know what is scheduled on this subject ? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.833333333333334
                },
                {
                    "author_link": "https://gov.uniswap.org/u/nicoGD",
                    "index": "6",
                    "likes": "5",
                    "time": "17/09/2020-17:50:53",
                    "content": "$UNI holders gain governance rights by holding $UNI tokens (i.e. one can vote, delegate, submit a governance proposal if they reach 1% of total supply…) I think it would be logical to also include $UNI tokens locked in uniswap pools for calculating governance rights. Maybe this is already intended, but I didn’t read it in the Introducing UNI blog. Any thoughts ? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Snuffy",
                    "index": "7",
                    "likes": "0",
                    "time": "23/09/2020-18:07:05",
                    "content": "The way I would go about this is by using conservative estimates. following LP logic, we can somewhat calculate the fluctuations of how a pool is composed and what sort of values a pool token represents. when I lock up 1 ETH along with its equivalent value in UNI, I would say we take a conservative percentage of the UNI part of the lockup and have that be represented in its vote power at the time of staking for a vote (like 80%). that said, exact formulas need tinkering, for which I propose we free up funding for the core team to put time into this issue. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.083333333333334
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Snuffy",
                    "index": "8",
                    "likes": "1",
                    "time": "23/09/2020-18:09:34",
                    "content": "unless I misunderstand what you are saying, this is exactly what I am proposing. figure out a way to use pooled UNI to vote. this would fix the issue of forcing a choice between either strengthening the pair or actively voting. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.291666666666667
                },
                {
                    "author_link": "https://gov.uniswap.org/u/nicoGD",
                    "index": "9",
                    "likes": "2",
                    "time": "23/09/2020-18:30:41",
                    "content": "I agree with you @Snuffy, I think it would benefit everyone to allow locked UNI to vote/propose/delegate. My message seems confusing because it was moved from another post I created last week. (Probably because it was not in the right section ^^) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.976190476190476
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Snuffy",
                    "index": "10",
                    "likes": "1",
                    "time": "23/09/2020-18:31:30",
                    "content": "hah alright! was just checking  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Bullrun",
                    "index": "11",
                    "likes": "2",
                    "time": "22/10/2020-09:57:44",
                    "content": "Has there been any more discussion about this topic anywhere? From browsing the governance forums, I’ve been surprised to see relatively little mention of it. Seeing as both pooling and Uniswap governance is at the heart of DeFi right now, I’d imagine most holders are interested in being able to partake in both at the same time if its possible. I’m particularly interested in hearing if this is even technically feasible. Could LP tokens represent voting power somehow? ",
                    "links": [
                        "https://gov.uniswap.org/t/discussion-uniswap-liquidity-incentive-plan/8590/55"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.999188311688312
                },
                {
                    "author_link": "https://gov.uniswap.org/u/L.A.SanJose",
                    "index": "12",
                    "likes": "1",
                    "time": "22/10/2020-22:36:03",
                    "content": "This is a good idea. I have all my Uni tokens in the LP. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Joncatch",
                    "index": "13",
                    "likes": "2",
                    "time": "03/11/2020-18:30:42",
                    "content": "I agree totally as well let’s try and make this proposal a priority. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/allo",
                    "index": "14",
                    "likes": "1",
                    "time": "09/11/2020-21:27:37",
                    "content": "This proposal should be spearheaded by all major delegates. In my humble opinion, LPs should have been able to vote from the start, as they are the holders that are supporting UNI the most. Also, this proposal will pave the way to UNI-ETH LP incentivization as well as make other potentially interesting proposals possible. Thanks ! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.965277777777778
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Ezzy",
                    "index": "15",
                    "likes": "2",
                    "time": "10/11/2020-16:44:18",
                    "content": "Good thoughts, maybe this should come up as a proposal…assigning voting rights to UNIs locked in LPools. Check out recent community call,     Announcement: unofficial Community Call - Thursday 12 Nov 17:00 UTC       Hi Uniswap community!  I will be hosting a community call this Thursday November 12 at 1700 UTC (9am PT, 12 noon ET, 6pm CET).  Everyone is welcome to attend!  If you’d like to present about anything related to Uniswap governance, projects building on or integrating with Uniswap, or something else that the community would appreciate, post in this thread or direct message me.  Meeting link: https://us02web.zoom.us/j/83379780196?pwd=Ukt5Nm1RUTVseEZiRGZrSkNXY1FYQT09  Meeting ID: 833 7978 0196  Pass…     ",
                    "links": [
                        "https://us02web.zoom.us/j/83379780196?pwd=Ukt5Nm1RUTVseEZiRGZrSkNXY1FYQT09"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Bullrun",
                    "index": "16",
                    "likes": "5",
                    "time": "10/11/2020-21:49:25",
                    "content": "I personally doubt this is a technically feasible idea, due to the UNI amount represented by an LP token being inherently variable. I can’t think of a solution that allows LP holders to vote which doesn’t also require an overhaul of the entire voting system - completely recharacterizing delays, vote locking and UNI vote power, which would be a massive undertaking with far-reaching and possibly unintended effects. Are there any projects that have attempted something similar in the past? I figure that if the intention is to present the idea at the community call, someone should at least come prepared with what the proposal might look like. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.738636363636363
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Ezzy",
                    "index": "17",
                    "likes": "2",
                    "time": "11/11/2020-06:44:06",
                    "content": "I can’t think of any other project that has such voting process but adopting it will make Unicorn unique and I believe it’s feasible. I equally presume that bringing up the issue in the community call is a prime step. The technicality behind the adoption will ideally become a matter of community contribution at least, and it could pass as a proposal if the puzzle is solved. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.321428571428571
                },
                {
                    "author_link": "https://gov.uniswap.org/u/TheMantis",
                    "index": "18",
                    "likes": "0",
                    "time": "20/11/2020-16:35:16",
                    "content": "You’re a Genius! (you know that right??) :)) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.9642857142857135
                },
                {
                    "author_link": "https://gov.uniswap.org/u/BMZied",
                    "index": "19",
                    "likes": "1",
                    "time": "21/11/2020-16:24:55",
                    "content": "Problem there is people will always look for benefit, and often short term benefit. Plus as there is competitors in this sector you have tonalways be competitive and attract investors liquidity. So being able to invest in lp and votes should be very helpfull. Concerning how value lp UNI locked it can be a fixed percentage (example 75%) . So holders vote will be considered as more important ? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.416666666666666
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Aeris",
                    "index": "20",
                    "likes": "2",
                    "time": "12/01/2021-09:33:53",
                    "content": "Voting and being democratic in Uniswap is so important in it’s governance.   I wrestle with how accurate Uniswap’s voting model is reflective of UNI holders interests both in the short and long term. In the short term Uniswap has historically been one of the most fair token distributions in the crypto space.   My concern is with whale pump/dumps around the time a vote would pass.  The UNI Token purchase would move the token value granted their was an entity up for that task. In the long term,  I see UNI tokens flat out being collected quietly and have the power to sway voting predictably or actively work in opposition of the Uniswap community as a whole.  Or, on the otherhand,  hemmorage the UNI token value and sizzle to other projects in 2 or so years in the UNI Community does not stay competitive.  Decentralized governance takes more work at an individual level staying tuned and the decision making process more arduous. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.685185185185185
                },
                {
                    "author_link": "https://gov.uniswap.org/u/cobie",
                    "index": "22",
                    "likes": "1",
                    "time": "13/07/2021-22:32:27",
                    "content": "I don’t think suing people sounds very productive ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                }
            ]
        }
    ],
    "group_index": "378"
}