{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/long-term-value-sustain-and-prevent-farming-dump-like-curve/2035",
            "title": "Long term value sustain and prevent farming dump like curve ",
            "index": 2035,
            "category": [
                "Proposal Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/coolcryptomaniac",
                    "index": "1",
                    "likes": "5",
                    "time": "18/09/2020-03:00:50",
                    "content": "To make long term value accrual , it’s must that , whales don’t farm all the tokens and dump on retail users in Centralised exchages. To prevent this 1- UNI liquidity pool with liquidty  rewards must be created with major rewards going to UNI pool 2- Small liquidity providers( say providing  liquidty below 1000usd) must be incentivised and a fix number of tokens kept for them , also it needs to mentioned that some mechanism to protect Sybil attack must be done to do this safely 3- partner with yearn and other good ecosystem  projects to to grow more utility 4- Make governance gasless and apply quadratic Voting to nullify whale attack Please if you like my idea , comment   hail Uniswap  and like and suggest improvements on above. Also any generous person put this proposal as I don’t know how to do it. Thanks , Hail Uniswap  ",
                    "links": [],
                    "GPT-summary": "The author of the post is explaining a proposal to prevent whales from farming all the tokens and dumping them on retail users in centralized exchanges. The proposal includes creating a UNI liquidity pool with rewards, incentivizing small liquidity providers, partnering with other ecosystem projects, and making governance gasless. The author is asking for feedback and suggestions for improvement. A third party is extending to the proposal, giving constructive criticism, and asking questions about the proposal.",
                    "GPT-proposal-categories": [
                        "Token economics",
                        "Privacy, Security and risk management",
                        "Interoperability and Scalability",
                        "Community and engagement",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.7437499999999995
                },
                {
                    "author_link": "https://gov.uniswap.org/u/RodAthens",
                    "index": "2",
                    "likes": "0",
                    "time": "19/09/2020-16:02:45",
                    "content": "i think proposal nr 2 is difficult to implement. How would you prevent whales from just dividing their capital into small pieces to collect the incentive? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 3.125
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Joshie",
                    "index": "3",
                    "likes": "1",
                    "time": "05/01/2021-01:10:28",
                    "content": "Thanks for the knowledge really gained a lot ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                }
            ]
        }
    ],
    "group_index": "270"
}