{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/uniswap-goes-to-hollywood/14322",
            "title": "Uniswap goes to hollywood? ",
            "index": 14322,
            "category": [
                "Proposal Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/mrmcintosh",
                    "index": "1",
                    "likes": "3",
                    "time": "28/09/2021-09:44:59",
                    "content": "Hi Friends! I have been listening to Bankless for the last 6 months and with the call to action to head to the Uniswap governance forums and I am glad I have done so! My Name is Tim Nagle and I am the founder of a film production company called Apostle Digital. We create feature length films all the way through to commercial advertising to help the cause of the clients we partner with! What I would like to get a temp check and propose is probably an unusual approach but something that I think would have a great impact highlighting the Uniswap protocol as well as putting the overall crypto space in a positive light. The idea would be to create a FEATURE FILM that is based around a well told, scripted story on the origin of the Uniswap protocol crafted as a fun entertaining story. It would be a fun exciting film that would highlight both the social movement of Crypto and the turning point of using UniSwap that our main character would enter a new world of possibility unknown to them before. The film would be played out in a world of high stakes, friendship, adventure and crypto. Some film references that come to mind are the Social Network meets Money Ball meets *Richie Rich. ( These would be explored extensively and a complete script will be provided to review before being filmed and created by the entire team )* These are of course references and we would be creating something totally unique for Uniswap that is able to accurately propel the brand and message through popular culture. Overall this would be a first in the space and Uniswap would have that first! Creating a complete high production film that supports both a positive message about crypto currency, educates the audience about the protocol and also syncs deep with culture a brand such as Uniswap to take it to the next level. The Uniswap protocol would be an executive producer on the film in credits as well as all the participants who vote for this proposal could also be credited as associate producers of the film! The estimated time line for this production would be as follows. 6 weeks  Script Creation with our writer 2 weeks consultation and governance feedback 8 weeks in Pre Production ( Casting, Crewing, Admin, artistic direction, pre vis, Line Producing ) 12 weeks in Production ( Film shoot ) 20 weeks in Post-Production ( Editorial, VFX, Grade, Foley, Sound, Score, Finalise and Master the film ) *Budget estimate 200,000 UNI ~ 4.5m USD ( cast dependant. ) To follow up on the back of this, we would create a marketing campaign that takes the trailer, the imagery from the film, interviews with cast, directors, crew, and build a world of content that speaks to the meaning behind the film and the Uniswap protocol and push this out globally to make sure there is hype and reach for the film. This marketing would go out to facebook, instagram, youtube, tik tok as well as traditional media, and be used to actively promote the Uniswap brand and positive message without the limitations of what is and isn’t allowed to be promoted on these centralised platforms around the crypto space. Budget estimate 5800 UNI~ 130K USD + Media ad spend over a defined length of time. ( It really depends on the extent of the content that gets created but would be an extensively be explored to make sure the film was adequately provided for. ( This is not mandatory but would be highly advised to get the most out of the investment as any normal film would encounter ) The film would then be able to be sold to global territories, could have its own cinema run but predominately play in the VOD space like netflix, amazon prime, etc to bring a return back to Uniswap. Over the past 10 years there have been some notable films thats have been made for this type of lower budget. Paranormal activity, the last 5 of their films were all made for about 4.5 million and returned upwards of 250million each. Magic mike was made for about 7 million and returned 167 million. Moonlight had a budget of about 2 million and returned about 65 million. These are some recent examples that have been popular with culture but have also had a monetary return on investment. This would mean a broad potential financial return over time to the Uniswap treasury as well as various broad reach PR opportunities on morning TV shows, podcasts, web articles for positive exposure and mainstream reach that could far outweigh monetary return of the films sales. Some other opportunities for a return on the investment would be exclusive NFT creations for individual frames of the movie, behind the scenes content, director and cast signed posters and photographs that are one of a kind and could be tradable into the future. This is something we are most passionate about helping create, well executed incredible stories for the world to see. Our team have been apart of many feature films, short films, 100’s of commercials, and generated 10’s of millions of dollars in revenue from the entertainment assets we have helped create. We are passionate about the crypto space and would be honoured to work along side Uniswap if this sort of proposal feels like a good fit for the community. I would love to get your initial thoughts before it gets put it forward for a complete proposal! My apologies if I need to create a snap shot for this part of the discussion, I can do this going forward if needed! Cheers and thanks for your consideration. T. ",
                    "links": [
                        "https://www.youtube.com/watch?v=-4QPVo0UIzc",
                        "https://www.youtube.com/watch?v=Yddr5thpDTE"
                    ],
                    "GPT-summary": "The author of the post is proposing to create a feature film that highlights the Uniswap protocol and the crypto space in a positive light. The film would be a first in the space and Uniswap would have that first. The author provides a detailed timeline and budget estimate for the production of the film. The author also proposes a marketing campaign to promote the film and the Uniswap brand. The author is seeking feedback and collaboration from the Uniswap community.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.95303245523416
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Buckerino",
                    "index": "2",
                    "likes": "0",
                    "time": "29/09/2021-12:06:47",
                    "content": "I dont think spending 4,5M USD on a movie is considered “high production”. I´d say that is a rather low budget. In my view, it is a noble idea, but you most likely will not attract the attention you are hoping for and the resources would be lost forever. I´d say cut the budget to 50k-500k total and try to get the most out of it. Structure the proposal like a call option - limited downside with an unlimited upside because right now…the downside is gigantic and the upside is rather limited. I know you listed the “unicorns among Hollywood movies” as an example, but it is EXTREMELY rare to achieve such level of success. I´d rather focus on the list of failures which is never ending. Spending 4,5M USD + 130k (extremely small budget for marketing btw) total hoping to be the next Blair Witch project sounds like a recipe for disaster. Selling a lottery ticket for 4,5M + 130k with the odds of having a payout in the 0,01-0,001 %s does not sound like a compelling argument to me. I´d say the idea itself has its potential, but asking the treasury to bear all the risk presents  rather poor value. Other option would be to fundraise on Mirror and see if people like it - similar to the Ethereum: The Infinite Garden documentary project which raised 2M this way. Spreading the risk among multiple participants whilst gauging their interest would be a better way to go around this idea. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.451636904761905
                },
                {
                    "author_link": "https://gov.uniswap.org/u/mrmcintosh",
                    "index": "3",
                    "likes": "0",
                    "time": "01/10/2021-02:14:00",
                    "content": "Hi Buckerino! Thank you for your excellent points! I really appreciate you taking the time to share and provide feedback.  I do agree on many of your points as well. After thinking about it, it really feels like the risk and investment needs to be spread over multiple parties as you say. I think getting other DAO’s involved or additional singular parties like on Mirror would be a great case moving forward to make this a success. Initially I was thinking that this would be Uniswap specific through the narrative but perhaps it could be much broader and positively enforce the values and futuristic possibilities with multiple entities. Absolutely, this being a unicorn in the film world would be very rare but also the marketing opportunity for the DAO ( you are right, an increase in that marketing budget as well as including the ad spend is needed! ) for a crypto backed film asset may help really drive interest & understanding of what is possible globally. This would be something that has not really been explored in great depth other than a few examples like the 1000 Eth raised on Mirror for the infinite garden doco and one other low budget example I can find online. ( I am excited to see this ETH documentary too! ) After being involved with 4 feature films now, ranging in budget from 1-12 million I have found the appropriate amount of funds for this style of low budget film making yet still achieving a high quality outcome to be around this 4.5m range.  As it allows to properly pay crew and get adequate amount of funding for the production and post services and see to any overages that often occur. It also makes sure that people are not left without or burnt because of lack of budget. It would not be Avatar or Ready Player One but would see similar film quality standards to movies like Getout, Animal Kingdom, Ouija, Requiem for a dream. But this as you say is considered low budget in the world of Hollywood films! The funds would need to be used incredibly wisely and get the most potential out of the asset once it is finished. If there was greater interest in the community It could most certainly be increased, but this would be a great place to start from. If the treasury was up for a 500k investment, this is still an incredibly sound commitment and would would be very helpful for the films creation. I think it would be a great way to progress and get traction on this sort of real world asset as well as the aim to be a positive cultural point on the worlds timeline for the crypto community. Appreciate your thoughts and consideration Buckerino! Look forward to hearing from others here too. ( as more interest builds I will get together a deck presentation with the team to help solidify this idea further ) Cheers! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.195606476856477
                },
                {
                    "author_link": "https://gov.uniswap.org/u/3.1415r",
                    "index": "4",
                    "likes": "0",
                    "time": "04/10/2021-20:38:18",
                    "content": "I like the idea, if you manage to put together a good production, this could be a great marketing tool for the industry and help sensibilise non-crypto people to the benefits of decentralisation. Agree with @Buckerino on funding, looking for smaller commitments from multiple protocols and even individual investors make much more sense, and not making the movie about any specific protocols. Beyond spreading the risk, this should help spread the idea across the ecosystem and generate some buzz. You could also consider including in the casting a bench of crypto-famous people in short roles, it could be fun and great for marketing. You could try to speak with the team at The Defiant, they are good at creating movie-like narratives, they are likely to appreciate the idea and might be able to help in some way. Good luck, curious to see where this goes! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.625
                },
                {
                    "author_link": "https://gov.uniswap.org/u/wijuwiju",
                    "index": "5",
                    "likes": "0",
                    "time": "04/10/2021-21:44:06",
                    "content": "what’s ur favourite uniswap moment (potential scene)? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/sykhsharif",
                    "index": "6",
                    "likes": "0",
                    "time": "05/10/2021-02:00:02",
                    "content": "What to do  Uniswap again don’t give me airdrop  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/mrmcintosh",
                    "index": "7",
                    "likes": "0",
                    "time": "05/10/2021-03:20:57",
                    "content": "Hi Wijuwiju! I think the best potential scene would have to be an iconic one to really help set in the audience’s mind how powerful this all is. Like Indiana jones swapping the golden idol in raiders of the lost arc, or the lighting strike scene in back to the future, or dodging bullets in the matrix… The scene may not figuratively be like these scenes but would be something cool for audiences to have a memorable “ohhh cool aha!” moment and really connect with the story on screen. We can explore this together! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party or author wants to collaborate on proposal",
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 6.5625
                },
                {
                    "author_link": "https://gov.uniswap.org/u/mrmcintosh",
                    "index": "8",
                    "likes": "1",
                    "time": "05/10/2021-03:24:11",
                    "content": "Hi 3.1415r! Thank you for your thoughts  I am glad you see the benefit as a marketing tool for the industry and helping communicate the awesome opportunity of decentralisation. The Defiant guys do awesome stuff  Ill reach out to them and see if they are interested in getting involved! Cheers, will carry on!  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.390625
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Uniswap2",
                    "index": "9",
                    "likes": "1",
                    "time": "29/08/2022-07:24:33",
                    "content": "Any more ideas along this proposal ? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                }
            ]
        }
    ],
    "group_index": "136"
}