{
    "poll_list": [
        {
            "id": "0xbadf3b39b681c98ba8fb988d5b6c9454ebeb5aae88545a6a852d0734e9f7c957",
            "title": "Temperature Check: Create Accoutability Committee",
            "discussion": "https://gov.uniswap.org/t/temperature-check-accountability-committee-proposal/20579",
            "body": "By Other Internet & Accountability Working Group\n\n## Overview\nThis is a vote to elect 5 Committee Members for the Partnerships & Accountability Committee, first term (March - August 2023). For background and rationale, please see the [temperature check](https://gov.uniswap.org/t/temperature-check-accountability-committee-proposal/20579).\n\nElections are conducted by approval voting. Approval voting allows you to select all the nominees you support for the role of Committee Member.\n\nTo vote, select each candidate you approve for the role of steward.\n\nYou can select as many or as few candidates to approve as you like.\n\nAt the conclusion of voting, the 5 candidates ranked highest will be the committee members confirmed for the final on-chain governance proposal.\n\n- The vote will be considered valid if a minimum of 10m delegated UNI is reached, per the community governance process.\n- The committee will not be approved if less than 10m in delegated UNI total votes in the proposal.\n\nA list of nominees and qualifications is included below.\n\n## Nominees\nThe following individuals were nominated by Other Internet and Uniswap Foundation, or nominated themselves during the RFC phase. Proposed committee members Kydo, Cam O’Donnell, and Doo Wan Nam were participants in the accountability working group that created this proposal.\n\n-  **[Doo Wan Nam  / @Doo_Stablelab](https://gov.uniswap.org/u/doo_stablelab) (COO at StableLab)**\nExperience: Professional delegate at StableLab across major DeFi protocols, including MakerDAO, Optimism, Aave, 1inch, Balancer, Element, InstaDapp, Hop. Previously spent 3.5 years at the Maker Foundation.\n*Past Uniswap Activity:* Participation in an Accountability Working Group that shipped [Proposal Template 2.0 - Upgrade for Deployments & Agreements](https://gov.uniswap.org/t/proposal-template-2-0-upgrade-for-deployments-agreements/19936)\n    \n- **[Cam O’ Donnell / @DAOStrat.C](https://gov.uniswap.org/u/daostrat.c) (Web3 Ecosystem Strategy at Consensys)**\n**Experience:** Leads governance education efforts at Consensys, Delegate at Uniswap and MakerDAO, member of Uniswap-Optimism governance council, co-authored Uniswap \n**Relevant Uniswap Experience:** Participation in an Accountability Working Group that shipped [Proposal Template 2.0 - Upgrade for Deployments & Agreements](https://gov.uniswap.org/t/proposal-template-2-0-upgrade-for-deployments-agreements/19936). Co-authored Uniswap proposal 32: [Enable 1bp Fee Tier for UniswapV3 on Arbitrum](https://gov.uniswap.org/t/rfc-enable-a-1bp-fee-tier-for-uniswapv3-on-arbitrum/20116/5). Member of the Uniswap Optimism governance council.\n    \n\n- **[Jun Sun / @pennblockchain](https://gov.uniswap.org/u/pennblockchain/summary) (Governance lead at Pennblockchain/FranklinDAO)**\n**Experience**: Governance Lead at Penn Blockchain, Uniswap delegate for 2 years, Delegate at Compound, Aave, MakerDAO, etc.\n**Relevant Uniswap Experience:**  Helped draft, steward, and submit cross-chain deployment proposals on [Boba](https://gov.uniswap.org/t/deploy-uniswap-v3-to-boba-network/18018), [zkSync](https://gov.uniswap.org/t/deploy-uniswap-v3-to-zksync/17649), and Kava chains. Co-authored a research paper [Deep Diving into Uniswap's Governance](https://gov.uniswap.org/t/a-deep-dive-of-uniswaps-governance/19792/2) with recommendations on reinvigorating governance activity. Active participation in cross-chain governance forum discussions and proposals.\n    \n- **[Kendra Leong / @kendraleong](https://gov.uniswap.org/u/kendraleong/) (Governance at she256)**\n**Experience:** Professional delegate at Uniswap, Compound, ENS, Hop, and Optimism for crypto nonprofit She256. Prior experience as General Counsel. Familiarity with enterprise risk management structures and creating accountability within transactional proposal processes. Previously Legal Cybersecurity Liaison to the White House. \n**Relevant Uniswap Experience:** Participation in Uniswap [votes on behalf of She256](https://www.tally.xyz/profile/she256.eth?governanceId=eip155:1:0x408ED6354d4973f66138C91495F2f2FCbd8724C3) since 2022.\n    \n- **[Raf Solari - @rafaelsolari](https://gov.uniswap.org/u/rafaelsolari/) (Co-Founder & CTO at Tally)**\n**Experience:** Senior technical architect and cross-chain governance expert, CTO at Tally. High degree of understanding of different governance processes and accountability procedures across DAOs.\n**Relevant Uniswap Experience:** External technical advisor on UGM bridge evaluation process and cross-chain governance discussions.\n    \n- **[Kydo - @kydo](https://gov.uniswap.org/u/kydo) (Lead at Stanford Blockchain Club)**\n**Experience:** Vice President of Stanford Blockchain Club, programming committee member for [Stanford DAO Workshop](https://www.notion.so/ffdcc1e7ff7749a6afc1ee7b7bdc134c), co-organizer for [CEE246A class at Stanford](https://explorecourses.stanford.edu/search?view=catalog&filter-coursestatus-Active=on&page=0&catalog=&academicYear=&q=CEE+246A%3A+Web3+Entrepreneurship&collapse=) on crypto entrepreneurship.\n**Relevant Uniswap Experience:** Participation in an Accountability Working Group that shipped [Proposal Template 2.0 - Upgrade for Deployments & Agreements](https://gov.uniswap.org/t/proposal-template-2-0-upgrade-for-deployments-agreements/19936). Participation in cross-chain governance forum discussions and proposals.\n",
            "choices": [
                "Doo Wan Nam (StableLab)",
                "Cam O'Donnell (Consensys)",
                "Jun Sun (Penn Blockchain)",
                "Kendra Leong (She256)",
                "Rafael Solari (Tally)",
                "Kydo (Stanford Blockchain)"
            ],
            "scores": [
                15753061.87189508,
                12527800.199399147,
                14251748.974587996,
                9732773.717826327,
                8479977.353221742,
                13233161.141179334
            ],
            "start": 1677244800,
            "end": 1677874800,
            "snapshot": "16698761",
            "state": "closed",
            "author": "0x32b8B761C038b030A402AB7d5536b4cddA6dbA9f",
            "space": {
                "id": "uniswap",
                "name": "Uniswap"
            }
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/rfc-accountability-committee-proposal/20316",
            "title": "RFC \\xe2\\x80\\x94 Accountability Committee Proposal ",
            "index": 20316,
            "category": [
                "Proposal Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/lotti",
                    "index": "1",
                    "likes": "5",
                    "time": "06/02/2023-17:03:44",
                    "content": "We are soliciting feedback from the community to propose the formation of an Accountability Committee for Licensure and Deployments for Uniswap DAO, tasked with overseeing the operational development of partnerships and agreements involving Additional Use Grant requests and deployments of Uniswap V3 on other chains.  Proposal Overview We propose the creation of an Accountability Committee for Licensure and Deployments to support the performance of licensure and partnership agreements between Uniswap DAO and external parties and improve accountability toward the DAO. While the BSL expires on April 1, 2023, we decided to initially limit the scope of the Accountability Committee to licensure and deployments since these are the areas that have generated the most traction in the forum.  Overview Over the past year, several projects have requested Additional Use Grants to the Uniswap community and/or requested permission to deploy Uniswap protocol to alternative chains (including L2s and alternative L1s). Often such proposals offered financial incentives for Uniswap. However, the delivery of funds has been in some cases delayed or implemented according to mechanisms that weren’t part of the agreement terms. In order to mitigate this issue and facilitate stronger accountability practices in Uniswap, we propose the formation of an Accountability Committee tasked with the following functions:  Be responsible for the evaluation of proposals during first two phases of governance process (RFC and Temperature Check) Verify that proposals comply with the requirements of the Uniswap DAO Proposal Template. Implement and manage an on-chain commitment mechanism for Uniswap DAO (i.e. a multisig escrow): require that licensure and deployment proposals offering financial incentives to Uniswap (including but not limited to grants for Uniswap community, liquidity mining, or metagovernance incentives) may not go forward to the last stage of the governance process without depositing a % of the promised funds into the escrow. Provide last-mile QA and technical guidance for deployments Keeping track of commitments, disbursements, and project milestones Report quarterly to Uniswap DAO  For each proposal that advances to the on-chain Governance Proposal phase, the Committee will engage in the following activities:  Liaising with the proposer team and evaluating the quality of the project Onboarding the proposer team to the Uniswap ecosystem Evaluating the security of the chain Negotiating Scope of Work Providing legal review Co-editing the final proposal with the proposer team   Duration The initial Committee will have 5 members and a duration of 6 months. After the expiration of the BSL on April 1, 2023 the Committee will focus on deployments. At the end of the term the Committee will be subjected to review by the community to discuss areas of improvement and potential expansion of its scope to other kinds of partnerships beyond deployments.  Compensation We propose that Committee members are compensated with a retainer of $3,500 per 6-month term and a fee of $6,500 for each evaluated project, paid at the end of each 6-month period. We propose a minimum of 2 committee members’ involvement in each agreement proposal. Assuming the Committee will review 2 proposals each term, the maximum estimated budget for the first iteration of the Accountability committee is $82,500 for the first 6 months, and $165,000 for a year.  Motivation The need for an Accountability role in Uniswap DAO was crystalized in the first Uniswap Delegate Forum that Uniswap Foundation and Other Internet hosted in October 2022. The Forum followed the publication of OI’s accountability report for Uniswap, which explored at length the legal, social and on-chain accountability mechanisms available to Uniswap. As observed in the report, at present Uniswap’s strongest accountability measure in the context of licensing and partnership agreements is the Business Source License, which however has limited application toward enforcing the terms of an agreement and the delivery of promised funds after a proposal has been executed. Establishing and formalizing an accountability role within Uniswap, with a clear mandate and responsibilities, will greatly improve accountability toward the DAO, avoid repeating past episodes of missing or delayed funds, and overall facilitate the operational autonomy of the DAO going forward. We also plan to leverage work on the cross-chain bridge assessment group and liaise with them in security assessments.  Proposer details This proposal is put forward by Uniswap Agreements & Accountability working group — an initiative stewarded by Other Internet with the participation of Uniswap Delegates and Uniswap Foundation.  Point of Contact  Laura Lotti, laura@otherinter.net  Proposed initial signers We propose an initial committee formed by 5 delegates selected by Other Internet with guidance from the Uniswap Foundation. The proposed committee members were selected among the participants in the Agreements & Accountability working group and Uniswap community, with the goal of having a diverse representation of interests and expertises (including governance, technical and economic expertise). The proposed initial signers are:  Cam O’ Donnel (Web3 Ecosystem Strategy at Consensys) Doo Wan Nam (COO at StableLab) Kendra Leong (Governance at she256) Kydo (Lead at Stanford Blockchain Club) Raf Solari (CTO at Tally)   Next steps We are seeking feedback by Uniswap governance contributors on this proposal before proceeding to the Temperature Check. ",
                    "links": [
                        "https://otherinter.net/research/uniswap-accountability/"
                    ],
                    "GPT-summary": "The post proposes the formation of an Accountability Committee for Licensure and Deployments for Uniswap DAO, tasked with overseeing the operational development of partnerships and agreements involving Additional Use Grant requests and deployments of Uniswap V3 on other chains. The post explains the proposal in detail and seeks feedback from Uniswap governance contributors before proceeding to the Temperature Check. The proposal also suggests the compensation of committee members and provides details about the proposed initial signers.",
                    "GPT-proposal-categories": [
                        "Community and engagement",
                        "Grants, Funding and resource allocation",
                        "Law and regulations",
                        "Privacy, Security and risk management",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.235524891774892
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Doo_StableLab",
                    "index": "2",
                    "likes": "2",
                    "time": "08/02/2023-11:13:43",
                    "content": "We are honored to be part of the proposed initial signers and happy to answer any questions or concerns. For brief introduction, StableLab is a governance firm focused on professional delegation, DAO framework design and product development. We work with various projects, from the ones just starting their journey to decentralization to the most prominent DeFi protocols. Our systematic framework for DAOs covers governance methodologies, decentralized workforce, implementation, documentation, communication and community engagement. There is no one-size-fits-all approach, but we provide a framework of principles and tools we have developed throughout our experience. We scale DAOs sustainably. EXPERIENCE We are the leading professional delegate team with a track record across major DeFi protocols, including MakerDAO, Optimism, Aave, 1inch, Balancer, Element, InstaDapp, Hop and more. We pioneer delegation work through high governance standards, extensive research, hands-on expertise and the consistent use of a code of conduct. Pushing forward web3 and DeFi since 2018, StableLab’s co-founders previously spent 3.5 years at the Maker Foundation. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.815441176470588
                },
                {
                    "author_link": "https://gov.uniswap.org/u/pennblockchain",
                    "index": "3",
                    "likes": "3",
                    "time": "08/02/2023-16:18:58",
                    "content": "Thanks Laura and the Other Internet team for this. Over the last few months, we’ve seen the issue of cross chain deployment become more and more apparent. This problem is one that needs to be tackled, especially if v4 has an initial BSL as well. When looking at the proposed committee members, we’ve interacted with a few of the members quite heavily and can attest to their hard work and abilities. However, some other proposed committee members we were surprised at their nomination. We believe that due to our proximity to such a topic and recent work regarding deployment and proposals creation, we would like to apply for this committee as well. Further, we encourage some other community members who we have seen been active in this area, whether it’s through the small working group that the Other Internet established or through forum discussions (for ex: WH vs L0 vote), to take a look at this and consider nominating themselves/others to apply for this council as well. Some actors we’ve seen participate quite heavily regarding this topic and would encourage to submit/confirm their intent to participate are: @GFXlabs, @teemulau/@mhonkasalo, Gauntlet, @AbdullahUmar (Michigan), @Doo_Stablelab (initially proposed, intent confirmed on forums), @kydo (initially proposed), @DAOStrat.C (initially proposed), @tobyshorin Going forward, during the RFC period, we propose anyone interested to submit/confirm their intent to participate on this thread (groups like ourself should appoint one lead to take responsibility). Then, on a snapshot vote, everyone should be able to vote on up to 5 choices:  No: Do not move forward with this Yes: @kydo  Yes: @DAOStrat.C  Yes: @Doo_Stablelab ……: Anyone else who confirms/submits intent to participate.  Our nomination to participate: Name: Penn Blockchain (FranklinDAO), Lead: Juanbug, governance lead (tele: @juanbugsun) Summary: We have been involved with the topic of deploy Uniswap v3 onto “x-chain” for many months now. In addition to helping different prospective chains navigate the process, we have diligently helped teams with delegate connections and even draft and submit the proposals themselves at time. For example: Deploy to zkSync, Deploy to Boba. Further, when different discussions arise in the forums, we are diligent in offering our opinions and pride ourselves in a fast response time (Please feel free to reach out whenever!). In addition to this topic, we’ve contributed to the general Uniswap ecosystem with research on governance and recommendations as well as maintained an almost perfect voting record. ",
                    "links": [
                        "https://gov.uniswap.org/t/deploy-uniswap-v3-to-boba-network/18018",
                        "https://gov.uniswap.org/t/a-deep-dive-of-uniswaps-governance/19792",
                        "https://gov.uniswap.org/t/recommendations-for-uniswap-governance/20056"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.348684210526315
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Doo_StableLab",
                    "index": "4",
                    "likes": "1",
                    "time": "08/02/2023-16:45:01",
                    "content": "We believe that others who are interested in being part of the Accountability Committee should be able to nominate themselves or others. And we do think @pennblockchain will be an excellent candidate based on their engagement so far. However, in terms of onchain voting, there should be at least accepted norm that delegates shouldn’t vote for themselves as candidates. And anyone including delegates, while being part of Accountability Committee Proposal, they should refrain from writing proposals that can fall under the assessment of Accountability Committee nor voting on such. The issue is if you are a delegate or author writing proposals, and also part of committee that evaluates, implement, and report on such proposals. It’s a clear conflict of interest and also ineffective check and balance. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.03125
                },
                {
                    "author_link": "https://gov.uniswap.org/u/pennblockchain",
                    "index": "5",
                    "likes": "1",
                    "time": "08/02/2023-16:49:08",
                    "content": "Thanks for your comments here Doo. We agree, during the snapshot vote, delegates should not be allowed to vote for themselves if they are part of the candidate pool. As for the eventual proposal submissions, because many times, delegates are the only ones with enough power to submit the on chain vote itself, this is a bit tricky. Maybe if for example, for the proposals that one may submit in the future, they are just not one of the 2+ council members that evaluate that proposal (assuming delegates are voted in to the council)? Would this create an appropriate separation you think? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Doo_StableLab",
                    "index": "6",
                    "likes": "1",
                    "time": "08/02/2023-16:53:08",
                    "content": "    pennblockchain:  Maybe if for example, for the proposals that we may submit in the future, we are just not one of the two council members that evaluate the proposal (assuming we are voted in to the council)? Would this create an appropriate separation you think?   That’s a fair point. I think that can be a compromise. As it’s “a minimum of 2 committee members’ involvement in each agreement proposal”, it’s possible to for example, have others who don’t have such conflict of interest in proposal to assess, implement, and report on it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.2
                },
                {
                    "author_link": "https://gov.uniswap.org/u/DAOstrat.C",
                    "index": "7",
                    "likes": "3",
                    "time": "08/02/2023-18:56:33",
                    "content": "Welcome @Doo_StableLab. Great to see you in the Community! Love seeing constructive conversation here. First, thank you @lotti (OI) for the initiative. As always, very thorough. With the BSL expiry on April 1, it would be beneficial for this discussion if you could further illustrate how the committee can provide value through its responsibility. This committee could be an exciting opportunity for community members/delegates to facilitate specified governance activity within the DAO. This helps to legitimize processes and provide accountability for transactional agreements. As an organization, We love supporting the DAO in any way possible and look forward to the continued discussion around this committee and its scope.  Echoing some thoughts on the comments above from Penn (H/t).     pennblockchain:  Over the last few months, we’ve seen the issue of cross-chain deployment become more and more apparent. This problem is one that needs to be tackled, especially if v4 has an initial BSL as well.   Agreeing with this statement, As the DAO grows, the community could continue to play a critical role in facilitation.     pennblockchain:  Going forward, during the RFC period, we propose anyone interested to submit/confirm their intent to participate on this thread (groups like ourself should appoint one lead to take responsibility)   Full support of further community participation and consideration. With many qualified teams. This is a net positive to maximize impact! If a committee member is selected for a specialty skill or resource. This should be communicated.     Doo_StableLab:  That’s a fair point. I think that can be a compromise. As it’s “a minimum of 2 committee members’ involvement in each agreement proposal”, it’s possible to for example, have others who don’t have such conflict of interest in proposal to assess, implement, and report on it.   Looking forward to exploring mechanics here. We will want to ensure objectivity and may I say (accountability) within the process. Will follow up with some thoughts as the discussion continues. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.202516233766233
                },
                {
                    "author_link": "https://gov.uniswap.org/u/pennblockchain",
                    "index": "8",
                    "likes": "0",
                    "time": "08/02/2023-18:59:37",
                    "content": "Thanks for the color here Cameron! Appreciate your feedback and would like to second your thoughts re:     DAOstrat.C:  if you could further illustrate how the committee can provide value through its responsibility.   Thanks @lotti! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Kydo",
                    "index": "9",
                    "likes": "4",
                    "time": "09/02/2023-00:52:21",
                    "content": "Kydo from Stanford Blockchain Club here. We are honored to be part of the proposed signers and appreciate the work Other Internet and many other delegates spent on this proposal and previous workshops. We are also supportive of this proposal. Like @pennblockchain and @Doo_StableLab have mentioned, we also believe community members should be able to nominate themselves. The exact mechanism may differ but I think the proposer should adopt this mechanism into the proposal. The accountability committee could handle technical, social, and even legal matters. It could have a lot of power and the scope might be hard to define at first. Therefore, we believe the signer set should also be improved/changed at a later date (3 months is reasonable) to incorporate new learnings throughout the process. Lastly, I believe these signers should be measured by their individual competence and knowledge of the space instead of their organizational reputation. I am also happy to share more about my background. Background: I am currently the Vice President of Stanford Blockchain Club, leading research and governance. I am also on the programming committee for Stanford DAO Workshop and the co-organizer for CEE246A class at Stanford on crypto entrepreneurship. Previously, I was the cause round owner at Gitcoin, managing the largest Gitcoin cause round ($1m matching). Before Gitcoin, I was a contributor at Llama, working on different governance initiatives with Aave, Radicle, Gitcoin, and others. I have also developed strong technical knowledge of the entire tech stack through coursework and research (advised by Prof. Dan Boneh). Related directly to Uniswap, I spent more than 15 hours a week around Uniswap governance activities and am currently driving the community effort around multi-message aggregation. Previously, I have been involved with multiple proposals and voiced critical thoughts in the forum and in private. ",
                    "links": [
                        "https://explorecourses.stanford.edu/search?view=catalog&filter-coursestatus-Active=on&page=0&catalog=&academicYear=&q=CEE+246A%3A+Web3+Entrepreneurship&collapse="
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.4422846889952154
                },
                {
                    "author_link": "https://gov.uniswap.org/u/kendraleong",
                    "index": "10",
                    "likes": "2",
                    "time": "09/02/2023-20:27:49",
                    "content": "Hi all, Kendra here from she256. First, thank you to @lotti and Other Internet for spearheading this important proposal and for the work they have done to-date on governance within Uniswap. I think we are all in agreement with the need for a committee to do this important work and look forward to further engagement in this process. I wanted to take the opportunity to provide a bit more information about my background and the value I would bring to this committee and to the Uniswap community. I have almost two decades of experience providing accountability for transactional agreements on hundreds of millions of dollars worth of complex grant-funded projects around the world. I gained this experience while acting in numerous capacities - including General Counsel, Chief Ethics Officer, and Legal Cybersecurity Liaison to the White House. I have led Internal Control functions and created Enterprise Risk Management structures for organizations. In ethics, my work required me to formally advise on conflict-of-interest issues regularly. Over my career, I have reviewed hundreds of highly-technical proposals from a legal, technical, business and governance perspective. And I am an expert at ensuring and structuring accountability within transactional proposal processes - beginning at proposal stage, in transaction agreement and scope negotiations, through monitoring delivery, to close-outs and disputes when parties have not complied with requirements under their agreements. As a member of the Governance Team at she256 since December 2021, I have a wealth of experience acting on behalf of a delegate on governance issues across Uniswap, Compound, ENS, Hop, and Optimism. As a nonprofit, we are governance volunteers who are working professionals and wide contributors to the space - with a track record reflecting our core beliefs, values and advocacy. Through our weekly governance meetings, we use our vote to ensure proper governance over protocols in our ecosystem – including Uniswap, where we participated in the Uniswap Delegate Forum mentioned in the original post.  Through my efforts with she256, I spend hours every week reviewing, analyzing and recommending a vote on proposals for Uniswap and the other protocols across the she256 delegate portfolio. And, having been a Devcon Scholar in Bogota, and through additional studies in Blockchain Strategy, I have continued to develop my knowledge base in the space while maintaining my core focus on accountability and governance. At she256, we believe that protocol governance should represent all participants in an ecosystem. And having a wide representation in governance encourages a broader group of voices, identities, and opinion to come to the forefront of the decision-making. As a delegate, I am uniquely positioned to transparently, objectively, and neutrally support the work of the Accountability Committee. I look forward to the continued discussion around this committee and its scope. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.288461538461538
                },
                {
                    "author_link": "https://gov.uniswap.org/u/tobyshorin",
                    "index": "11",
                    "likes": "1",
                    "time": "10/02/2023-19:06:54",
                    "content": "Thanks everyone for the great discussion so far. Laura and Aaron from OI contributed to this response post. Here are our thoughts for how to move forward!   In response to @pennblockchain:  We support Uniswap DAO contributors nominating themselves for a position on the committee—however we plan to cap the committee at 5 members, at least for the duration of the trial period. The goal of the cap is to keep the costs in check, scale manageable, and committee members accountable. - We’ll accept further nominations for the next 7 days, and we support Penn Blockchain’s proposed mechanism for voting on the nominees.  We further suggest that upon approval, the final committee appoint a Chair to coordinate its meetings, governance, and assign members to proposal review.    In response to @DAOstrat.C:  There is plenty of scope for the committee to provide value to Uniswap community after the expiration of the BSL. Cross-chain governance will continue to be an issue, hardly solved after April 1 and the committee will be in a position to provide expert guidance and recommendations in the process, while gathering community feedback, guaranteeing compliance to the Cross-chain Assessment Bridge Process and overseeing its implementation. Partnerships (with integrators, educational initiatives, advocacy groups, other institutions) will play a crucial role as Uniswap keeps growing and the Accountability Committee will be in a position to bring accountability to the evaluation and execution of such partnerships. Lastly, we think it’s likely that there will be a BSL for future versions of Uniswap core protocol.    in response to @Kydo:  The duration of the committee has been scoped to 6 months since Uniswap governance activity is quite variable, in view of the governance minimized design principles of the protocol. So we think 3 months may be too short of a timespan to meaningfully assess the performance of the committee and to have a new election process. 3 months may also be too short for committee members to begin developing practices and processes that may meaningfully carry forward into future iterations of the commitee therefore we caution against too short of a timespan. We agree that the committee members should change periodically, and there should be a process for delegates to nominate themselves or others at different rounds. We recommend that (options: ) committee members are elected every 6 months, and cannot serve for more than 2 consecutive rounds. retiring committee members are responsible for nominating and educating their successors.    Before moving to an on-chain vote we’ll write up these suggested committee “bylaws.” Per above discussion, open to self-nominations for participation in the committee. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.516327063740857
                },
                {
                    "author_link": "https://gov.uniswap.org/u/pennblockchain",
                    "index": "12",
                    "likes": "0",
                    "time": "10/02/2023-20:55:31",
                    "content": "@tobyshorin, thanks for the follow up here! Appreciate the openness to having more players nominate themselves and given the timeliness of the situation, we believe that the 7-day timeline is appropriate. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving positive feedback on proposal"
                    ],
                    "Sentiment": 7.083333333333334
                },
                {
                    "author_link": "https://gov.uniswap.org/u/eek637",
                    "index": "13",
                    "likes": "2",
                    "time": "11/02/2023-20:16:03",
                    "content": "Hey all. We’re supportive of this in principal - there are certainly instances of proposals falling through the cracks. As an example, let’s take a quick trip down memory lane. We were vocal proponents of issuing Voltz an additional use grant early last year in exchange for a portion of any future tokens that they might issue. In the conversation around that vote, the topic of meta-governance was front and center. It was generally recognized (I think) that any future Voltz tokens that hit the Uniswap treasury would be valued for their power to govern the Voltz protocol rather than any financial gain they might provide the DAO. In the lead up to the vote and immediately following, I had a few conversations with @tobyshorin and @bryanlehrer from OI about how the DAO might manage those new votes when Voltz eventually issued a token. We had some initial thinking in place, but since Voltz hasn’t launched an ERC-20, we put any plans to mobilize the community on the back burner. Fast forward a year and Voltz recently executed a governance vote to deploy on Arbitrum using NFTs. Should Uniswap have had a say in that vote? There was no ERC-20 token distribution, so maybe not. On the other hand the spirit of the conversation around the proposal would lead me to believe that Uniswap’s voice should’ve been heard there. What I can say for sure is that I have a day job and had lost track of what was happening at Voltz, so hadn’t even done any cursory research from which to form a view on the topic. The above is all to illustrate that I (and Avantgarde) think building out a process to make sure that things we vote on actually get done is a good idea. That said, we are concerned that the structure proposed here could be sub-optimal for a couple of reasons.  The institutional memory of a body that churns every 6-12 months could be an impediment to effectively executing their tasks. While every proposal that the committee shepherds through the pipeline will be similar in some ways - the vetting process, the proposal prep and presentation, etc - they will be different in many technical and financial considerations, and touch different corners of the Uniswap stakeholder universe. Being able to navigate that social graph adeptly is a requirement for this committee to be effective, but a high expectation to place on a delegate. It’s impossible to say whether the proposed compensation will be adequate in retaining qualified committee members, and there’s no way to know whether it is enough until each term is over.  We’d also be concerned about the admin burden on the DAO (e.g. do we fund a multisig that’s responsible for evaluating the committee’s work then paying out every six months?) but that’s secondary. in conversations with @Getty about this proposal, he pointed out that it falls squarely within the UF’s remit to administer this type of solution. And in thinking about where we (Avantgarde) are concerned about the potential inefficiencies, it seems like there could be a hybrid solution whereby the community elects the committee’s members by Snapshot vote, and the UF manages the committee’s process and is ultimately responsible for their output. This does a couple of things. First, it provides a central, constant access point for teams looking to make proposals. Want to do something in Uniswap? Go to the Foundation. Second, it solves for any issues that could present given the planned 6-month terms of the committee members. The UF is positioned at the center of the ecosystem and presumably has the best, most granular understanding of who the stakeholders are. And as committees come and go, the UF will help to hone processes by which proposals go from amoeba in a brain puddle to onchain vote. This continued presence is really the only way process will improve from term to term. The UF can act as a resource, helping each term’s committee members do better than the last term’s. I’d also note that this will help to make committee members better delegates once their term is over; they’ll emerge with a better network and understanding of what goes into a good proposal. Finally, it holds the accountability committee… accountable. It’s a tighter feedback loop. If a proposal comes in and the UF chooses a committee member to be it’s sherpa and that member has ghosted, the UF can just choose a new committee member (and not pay the ghost when the term’s up). There’s also the administrative benefits at the margins. I recognize I’m speaking for the UF’s budget here and have no visibility into what that looks like or whether there’s room for this, but paying committee members off of the UF’s balance sheet rather than the DAOs is much easier operationally. So to sum up, very supportive of this proposal in principal, but think we need to tweak the implementation to make sure that it’s effective. And many apologies to the OI team for not surfacing this concern earlier in the process. ",
                    "links": [
                        "https://gov.uniswap.org/t/should-uniswap-provide-voltz-with-v3-additional-use-grant/15669/22",
                        "https://gov.uniswap.org/t/should-uniswap-provide-voltz-with-v3-additional-use-grant/15669/32",
                        "https://www.voltz.xyz/voltz-snapshot"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.912862936726572
                },
                {
                    "author_link": "https://gov.uniswap.org/u/pennblockchain",
                    "index": "14",
                    "likes": "0",
                    "time": "12/02/2023-06:52:43",
                    "content": "Hey @eek637, thanks for your input here and we agree with the logistics of this situation. We think a snapshot vote to determine the committee and then shifting the focus over to UF to manage funds/oversight is appropriate. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://gov.uniswap.org/u/tobyshorin",
                    "index": "15",
                    "likes": "4",
                    "time": "13/02/2023-18:55:50",
                    "content": "Thanks for your thoughts @eek637. We’ve talked about this extensively with @kenneth and @devinwalsh, and in the past they expressed a desire not to have UF administer this process and the committee directly. If UF was going to fully manage this process, I’d strongly prefer to have this committee be consolidated into a 1 person partnerships lead, directly employed at UF and supported by UF’s lawyers. Obviously this would solve all the committee rotation and membership issues you described. Governance does not control the Foundation so it’s important hear back from Ken and Devin about whether it’s on the table and within their budget to spin up this role. If so, I think we (delegates) would be making a collaborative decision with UF around who handles what parts of ecosystem development. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.546296296296296
                },
                {
                    "author_link": "https://gov.uniswap.org/u/inkymaze",
                    "index": "16",
                    "likes": "3",
                    "time": "16/02/2023-21:26:47",
                    "content": "    lotti:  However, the delivery of funds has been in some cases delayed or implemented according to mechanisms that weren’t part of the agreement terms.   What’s the worst example here?     Doo_StableLab:  However, in terms of onchain voting, there should be at least accepted norm that delegates shouldn’t vote for themselves as candidates.   Agreed.     tobyshorin:  We further suggest that upon approval, the final committee appoint a Chair to coordinate its meetings, governance, and assign members to proposal review.   Good call. @larry is the archetype     tobyshorin:  Cross-chain governance will continue to be an issue, hardly solved after April 1 and the committee will be in a position to provide expert guidance and recommendations in the process, while gathering community feedback, guaranteeing compliance to the Cross-chain Assessment Bridge Process  and overseeing its implementation.   The risk of a committee overseeing a new process yet to execute is understated despite good sounding intentions.     tobyshorin:  The duration of the committee has been scoped to 6 months since Uniswap governance activity is quite variable, in view of the governance minimized design principles of the protocol. So we think 3 months may be too short of a timespan to meaningfully assess the performance of the committee and to have a new election process.   Agree with 6 month starting duration. Other comments:   @pennblockchain should be considered Gauntlet will not nominate ourselves at this time Controlling costs will be important without more specifications from the mandate above. Notably:      lotti:   Onboarding the proposer team to the Uniswap ecosystem        lotti:   Provide last-mile QA and technical guidance for deployments    ",
                    "links": [
                        "https://gov.uniswap.org/t/temperature-check-accountability-committee-proposal/20579"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.515572390572391
                },
                {
                    "author_link": "https://gov.uniswap.org/u/alanalevin",
                    "index": "17",
                    "likes": "2",
                    "time": "17/02/2023-01:41:53",
                    "content": "Alana here, from Variant. First, want to echo much of the sentiment already expressed - thank you to Other Internet for spearheading this proposal. An accountability committee seems directionally good for the protocol. Looking at the list of proposed initial signers, it would be helpful to have a more standardized format for detail on their backgrounds, as well as the rationale for each selection (e.g. some set of criteria that we’d want to see in committee members, and each candidate’s response as to how they meet those criteria). This would be helpful not only for generally assessing the initial choices, but also as a guideline / reference for selecting future committee members. Absent this type of detail, it feels odd to move forward. I also like @pennblockchain’s suggestion of being able to vote for/against individual members – it feels aligned with the request for having rationales for each member proposed / a more robust selection process. Disclaimer: Variant is an investor in the UNI tokens. Disclosures – Variant ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.8601190476190474
                },
                {
                    "author_link": "https://gov.uniswap.org/u/kenneth",
                    "index": "18",
                    "likes": "5",
                    "time": "17/02/2023-20:25:24",
                    "content": "Thanks for everyone’s input thus far. The UF has worked with Other Internet in establishing this process and has every intention of helping ensure the success of the Accountability Committee. However, community members should always feel free and empowered to self-organize and take ownership of gaps within the community/governance process without needing the UF’s approval. The UF exists to facilitate the governance process, but we should not be viewed as “owning” governance. Instead, successful Uniswap governance will continue to depend upon the active engagement of the community and its delegates, so we welcome the establishment of a committee, comprised of individual stakeholders, wholly dedicated to supporting the creation and implementation of governance proposals. This first committee cohort should publicly share meeting notes, learnings, and internal discussions so that the following committee cohorts may leverage past learnings. The UF will continue to be stewards and provide support for all governance participants, which includes helping to hold the proposed committee accountable. However, we hope that this experimental committee tests how more grassroots functions, similar to workstreams of other communities, could coexist and thrive with other entities across the Uniswap ecosystem. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.722916666666666
                }
            ]
        },
        {
            "thread_link": "https://gov.uniswap.org/t/temperature-check-accountability-committee-proposal/20579",
            "title": "[Temperature Check] Accountability Committee Proposal ",
            "index": 20579,
            "category": [
                "Temperature Check"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/lotti",
                    "index": "1",
                    "likes": "3",
                    "time": "24/02/2023-13:02:14",
                    "content": "Following the productive discussion in the RFC, we’ve integrated the feedback from the community in this updated version of the proposal for the creation of an Accountability Committee for Licensure and Deployments for Uniswap DAO. The main changes from the previous proposal are:  clarified areas of possible scope expansion of the Accountability Committee after the expiration of the BSL; added a Selection Process section, outlining the process change discussed during the RFC, nomination criteria, and the candidates that nominated themselves during that phase; added an Operating Policies section where we list the norms that emerged from the conversations in the forum, that will guide the work of the Committee going forward; added a Vote Process section explaining how the Snapshot Poll will take place.   Proposal Overview We propose the creation of an Accountability Committee for Licensure and Deployments tasked with overseeing the operational development of partnerships and agreements involving Additional Use Grant requests and deployments of Uniswap V3 on other chains. While the BSL expires on April 1, 2023, we are limiting the initial scope of the Accountability Committee to licensure and deployments, as these are the areas that have generated the most traction in the forum. The continued launch of new chains and platforms will require ongoing oversight and attention.  Overview Over the past year, several projects have requested Additional Use Grants to the Uniswap community and/or requested permission to deploy Uniswap protocol to alternative chains (including L2s and alternative L1s). Often such proposals offered financial incentives for Uniswap. However, the delivery of funds has been in some cases delayed or implemented according to mechanisms that weren’t part of the agreement terms. In order to mitigate this issue and facilitate stronger accountability practices in Uniswap, we propose the formation of an Accountability Committee tasked with the following functions:  Be responsible for the evaluation of proposals during the first two phases of the governance process (RFC and Temperature Check). Verify that proposals comply with the requirements of the Uniswap DAO Proposal Template. Implement and manage an on-chain commitment mechanism for Uniswap DAO (i.e. a multisig escrow), and require that licensure and deployment proposals offering financial incentives to Uniswap (including but not limited to grants for Uniswap community, liquidity mining, or metagovernance incentives) may not go forward to the last stage of the governance process without depositing a % of the promised funds into the escrow. Provide last-mile QA and technical guidance for deployments. Keeping track of commitments, disbursements, and project milestones. Report quarterly to Uniswap DAO on activities.  For each proposal that advances to the on-chain Governance Proposal phase, the Committee will engage in the following activities:  Liaising with the proposer team and evaluating the quality of the project Onboarding the proposer team to the Uniswap ecosystem Evaluating the security of the chain Negotiating Scope of Work Providing legal review Co-editing the final proposal with the proposer team   Committee Duration The initial Committee will have 5 members and a duration of 6 months to allow committee members to begin developing practices and processes that may meaningfully carry forward into future iterations of the committee. After the expiration of the BSL on April 1, 2023 the Committee will focus on deployments. At the end of the term the Committee will be subjected to review by the community to discuss areas of improvement and potential expansion of its scope to other kinds of partnerships beyond deployments. We believe that there is plenty of scope for the committee to keep providing value to Uniswap community after the expiration of the BSL:  Cross-chain governance will continue to be an issue after April 1 and the committee will be in a position to provide expert guidance and recommendations in the process, while gathering community feedback, guaranteeing compliance to the Cross-chain Assessment Bridge Process, and overseeing its implementation. Partnerships (with integrators, educational initiatives, advocacy groups, other institutions) will play a crucial role as Uniswap keeps growing and the Accountability Committee will be in a position to bring accountability to the evaluation and execution of such partnerships. Lastly, we believe future versions of Uniswap core protocol are likely to launch with a BSL.   Compensation We propose that Committee members are compensated with a retainer of $3,500 per 6-month term and a fee of $6,500 for each evaluated project, paid at the end of each 6-month period. We propose a minimum of 2 committee members’ involvement in each agreement proposal. Assuming the Committee will review 2 proposals each term, the maximum estimated budget for the first iteration of the Accountability committee is $82,500 for the first 6 months, and $165,000 for a year.  Motivation The need for an Accountability role in Uniswap DAO was crystalized in the first Uniswap Delegate Forum that Uniswap Foundation and Other Internet hosted in October 2022, following the publication of OI’s accountability report for Uniswap, which explored at length the legal, social and on-chain accountability mechanisms available to Uniswap. The Forum led to the creation of a dedicated Agreements & Accountability Working Group to address Uniswap DAO’s accountability challenges. As observed in the report, at present Uniswap’s strongest accountability measure in the context of licensing and partnership agreements is the Business Source License, which however has limited application toward enforcing the terms of an agreement and the delivery of promised funds after a proposal has been executed. Establishing and formalizing an accountability role within Uniswap, with a clear mandate and responsibilities, will greatly improve accountability toward the DAO, avoid repeating past episodes of missing or delayed funds, and overall facilitate the operational autonomy of the DAO going forward. We also plan to leverage work on the cross-chain bridge assessment group and liaise with them in security assessments.  Selection Process Following the feedback from the community, we supported Uniswap DAO contributors and delegates nominating themselves for a position on the committee. The committee will be capped at 5 members, at least for the duration of the trial period. The goal of the cap is to keep the costs in check, scale manageable, and committee members accountable. Desired criteria for committee membership includes:  Context on the history of accountability challenges faced by Uniswap and DAOs in general. Demonstrated commitment and active participation in Uniswap governance decisions. Understanding and context on prior Uniswap deployment processes. Experience managing and negotiating partnerships and agreements. Clear understanding of technical architecture of Uniswap v3 and governance.   Proposed Members The following individuals were nominated by Other Internet and Uniswap Foundation, or nominated themselves during the RFC phase. Proposed committee members Kydo, Cam O’Donnel, and Doo Wan Nam were participants in the accountability working group.   Doo Wan Nam (COO at StableLab) @Doo_Stablelab Experience: Professional delegate at StableLab across major DeFi protocols, including MakerDAO, Optimism, Aave, 1inch, Balancer, Element, InstaDapp, Hop. Previously spent 3.5 years at the Maker Foundation. Past Uniswap Activity: Participation in an Accountability Working Group that shipped Proposal Template 2.0 - Upgrade for Deployments & Agreements   Cam O’ Donnell (Web3 Ecosystem Strategy at Consensys) @DAOStrat.C Experience: Leads governance education efforts at Consensys, Delegate at Uniswap and MakerDAO, member of Uniswap-Optimism governance council, co-authored Uniswap Relevant Uniswap Experience: Participation in an Accountability Working Group that shipped Proposal Template 2.0 - Upgrade for Deployments & Agreements. Co-authored Uniswap proposal 32: Enable 1bp Fee Tier for UniswapV3 on Arbitrum. Member of the Uniswap Optimism governance council.   Jun Sun (Governance lead at Pennblockchain/FranklinDAO) @pennblockchain Experience: Governance Lead at Penn Blockchain, Uniswap delegate for 2 years, Delegate at Compound, Aave, MakerDAO, etc. Relevant Uniswap Experience: Helped draft, steward, and submit cross-chain deployment proposals on Boba, zkSync, and Kava chains. Co-authored a research paper Deep Diving into Uniswap’s Governance with recommendations on reinvigorating governance activity. Active participation in cross-chain governance forum discussions and proposals.   Kendra Leong (Governance at she256) @kendraleong Experience: Professional delegate at Uniswap, Compound, ENS, Hop, and Optimism for crypto nonprofit She256. Prior experience as General Counsel. Familiarity with enterprise risk management structures and creating accountability within transactional proposal processes. Previously Legal Cybersecurity Liaison to the White House. Relevant Uniswap Experience: Participation in Uniswap votes on behalf of She256 since 2021.   Raf Solari (Co-Founder & CTO at Tally) @rafaelsolari Experience: Senior technical architect and cross-chain governance expert, CTO at Tally. High degree of understanding of different governance processes and accountability procedures across DAOs. Relevant Uniswap Experience: External technical advisor on UGM bridge evaluation process.   Kydo (Lead at Stanford Blockchain Club) @kydo Experience: Vice President of Stanford Blockchain Club, programming committee member for Stanford DAO Workshop, co-organizer for CEE246A class at Stanford on crypto entrepreneurship. Relevant Uniswap Experience: Participation in an Accountability Working Group that shipped Proposal Template 2.0 - Upgrade for Deployments & Agreements. Participation in cross-chain governance forum discussions and proposals.    Vote Process For this vote we will use Approval Voting in Snapshot to ratify the committee. There will be 6 options, one for each nominee. The top 5 nominees will be committee members when the proposal moves to an on-chain vote. During the vote, people will have the option to choose as many of the options as they please.   The vote will be considered valid if a minimum of 10m UNI is reached.  The committee will not be approved if less than 10m in delegated UNI total votes in the proposal. Those who do not wish the committee to proceed encouraged to abstain from voting.   During the snapshot poll, voters will be able to vote on up to 5 choices:  Yes: Cam O’ Donnell @DAOStrat.C  Yes: Doo Wan Nam @Doo_Stablelab  Yes: Jun Sun @pennblockchain  Yes: Kendra Leong @kendraleong  Yes: Kydo @kydo  Yes: Raf Solari @rafaelsolari   Please find the Snapshot poll here.  Committee Operating Policies We ask that delegates and community members participating in this vote and the activities of the committee abide by the following points emerged in the previous discussion, that form the normative touchstones of this first iteration of the committee, and may be ratified as part of the bylaws of the committee by future governance decisions.  Candidates cannot vote for themselves in snapshot and on-chain vote. Anyone part of Accountability Committee should not write proposals that can fall under the assessment of Accountability Committee or vote on such proposals, to mitigate conflicts of interests. Upon approval, the final committee will appoint a Chair. The Chair will coordinate meetings, governance, and assign members to proposal review. Committee members should be elected every 6 months and cannot serve for more than 2 consecutive rounds. Delegates may nominate themselves or others. Retiring committee members are responsible for nominating and educating their successors. Retainer compensation is paid at the beginning of the 6 month period, and evaluated project fees at the end of a 6 month term.   Proposer details This proposal is put forward by Uniswap Agreements & Accountability working group — an initiative stewarded by Other Internet with the participation of Uniswap Delegates and Uniswap Foundation.  Point of Contact  Laura Lotti, laura@otherinter.net  Next steps The Snapshot Poll will be active for 5 business days. Here is the link: Snapshot ",
                    "links": [
                        "https://gov.uniswap.org/t/proposal-template-2-0-upgrade-for-deployments-agreements/19936",
                        "https://gov.uniswap.org/t/cross-chain-bridge-assessment-process/20148",
                        "https://otherinter.net/research/uniswap-accountability/",
                        "https://gov.uniswap.org/u/doo_stablelab",
                        "https://gov.uniswap.org/t/proposal-template-2-0-upgrade-for-deployments-agreements/19936",
                        "https://gov.uniswap.org/u/daostrat.c",
                        "https://gov.uniswap.org/t/proposal-template-2-0-upgrade-for-deployments-agreements/19936",
                        "https://gov.uniswap.org/t/rfc-enable-a-1bp-fee-tier-for-uniswapv3-on-arbitrum/20116/5",
                        "https://gov.uniswap.org/u/pennblockchain/summary",
                        "https://gov.uniswap.org/t/deploy-uniswap-v3-to-boba-network/18018",
                        "https://gov.uniswap.org/t/deploy-uniswap-v3-to-zksync/17649",
                        "https://gov.uniswap.org/u/kendraleong/",
                        "https://www.tally.xyz/profile/she256.eth?governanceId=eip155:1:0x408ED6354d4973f66138C91495F2f2FCbd8724C3",
                        "https://gov.uniswap.org/u/rafaelsolari",
                        "https://gov.uniswap.org/u/kydo",
                        "https://www.notion.so/ffdcc1e7ff7749a6afc1ee7b7bdc134c",
                        "https://explorecourses.stanford.edu/search?view=catalog&filter-coursestatus-Active=on&page=0&catalog=&academicYear=&q=CEE+246A%3A+Web3+Entrepreneurship&collapse=",
                        "https://gov.uniswap.org/t/proposal-template-2-0-upgrade-for-deployments-agreements/19936",
                        "https://gov.uniswap.org/u/daostrat.c",
                        "https://gov.uniswap.org/u/doo_stablelab",
                        "https://gov.uniswap.org/u/pennblockchain/summary",
                        "https://gov.uniswap.org/u/kendraleong/",
                        "https://gov.uniswap.org/u/kydo",
                        "https://gov.uniswap.org/u/rafaelsolari",
                        "https://snapshot.org/#/uniswap/proposal/0xbadf3b39b681c98ba8fb988d5b6c9454ebeb5aae88545a6a852d0734e9f7c957",
                        "https://snapshot.org/#/uniswap/proposal/0xbadf3b39b681c98ba8fb988d5b6c9454ebeb5aae88545a6a852d0734e9f7c957"
                    ],
                    "GPT-summary": "The post is a proposal for the creation of an Accountability Committee for Licensure and Deployments for Uniswap DAO. The proposal explains the need for the committee, its functions, and the selection process for committee members. The post also includes a vote process and committee operating policies. The proposal has been updated based on feedback from the community. The post does not advertise the proposal, but it explains it in detail and invites feedback and questions.",
                    "GPT-proposal-categories": [
                        "Community and engagement",
                        "Grants, Funding and resource allocation",
                        "Law and regulations",
                        "Privacy, Security and risk management",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.271371179325724
                },
                {
                    "author_link": "https://gov.uniswap.org/u/pennblockchain",
                    "index": "2",
                    "likes": "0",
                    "time": "24/02/2023-14:09:24",
                    "content": "    lotti:  During the snapshot poll, voters will be able to vote on up to 5 choices:   Thanks @lotti for this post and best of luck to everyone! Can you resubmit the poll on snapshot, right now you can only vote for one person, and not up to 5. Thanks! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.863095238095238
                },
                {
                    "author_link": "https://gov.uniswap.org/u/lotti",
                    "index": "3",
                    "likes": "1",
                    "time": "24/02/2023-14:52:45",
                    "content": "The poll should be fixed now, sorry about that! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.6875
                },
                {
                    "author_link": "https://gov.uniswap.org/u/tobyshorin",
                    "index": "4",
                    "likes": "0",
                    "time": "08/03/2023-14:33:05",
                    "content": "Hi everyone, just dropping a note that the vote was concluded last Friday, and the Accountability Committee will be moving forward to an on-chain vote. Thanks to everyone who voted; please look forward to an updated Governance Proposal post in the coming days. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is updating on progress",
                        "3rd party giving positive feedback on proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/DAOstrat.C",
                    "index": "5",
                    "likes": "0",
                    "time": "08/03/2023-20:35:44",
                    "content": "Hi all, Excited to see the committee moving forward, we (Consensys) believe it is great to see the community come together to help drive standardization and accountability throughout the governance process. After further consideration, we will be stepping back from the committee for the following reason.  Having a more diverse set of actors join Uniswap governance is positive for the protocol (H/T Stablelab, Tally, She256, FranklinDAO, Stanford). We believe resources with broader technical experiences, like Raf from Tally, help to provide new viewpoints, thoroughness, and methodologies for us all to learn from.  We know all the committee members and are confident that this committee will be helpful for protocol governance. As discussed, procedures and groups like this are a great way to test different working methodologies for the DAO. As always, We are here to offer any help required from the group! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.391098484848485
                },
                {
                    "author_link": "https://gov.uniswap.org/u/rafaelsolari",
                    "index": "6",
                    "likes": "0",
                    "time": "09/03/2023-00:59:06",
                    "content": "Hi all, I’m also excited to see this committee come together! I am confident that Cam at Consensys would do an excellent job on the committee, but he makes a great point that the committee as a whole would be stronger with at least one technical member. As the member who 1) received the next-highest number of votes 2) has a deep understanding of the technicals of Solidity and governance tech, I’m happy to step in to help out. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.927083333333334
                }
            ]
        }
    ],
    "group_index": "269"
}