{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/create-a-community-managed-ui-for-uniswap/13581",
            "title": "Create a community managed ui for uniswap ",
            "index": 13581,
            "category": [],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/thinkDecade",
                    "index": "1",
                    "likes": "1",
                    "time": "24/07/2021-11:09:00",
                    "content": "I woke up today to a lot of rantings about a decision by Uniswap Lab to remove certain tokens from the UI.    cryptodaily.co.uk    Uniswap Labs Imposes Restrictions On Over 100 Tokens The announcement comes as a cautionary strategy, with Uniswap Labs citing “the evolving regulatory landscape      There are a lot of views from both angles as to whether it is good or bad. One of the key factors of uniswap success is its simple UI. The UI is a key part of the protocol. And yet it isn’t decentralized in the sense of the word.   twitter.com    Andre Cronje @AndreCronjeTech    My unsolicited opinion;  Uniswap, a company registered in the US https://t.co/qC63EcZHVi, a website owned by the US entity Uniswap smart contracts, decentralized code  The company should act in its best interest, including censoring the website where it is in their interest.   11:45 PM - 23 Jul 2021           348                30            So, my take is: maybe the community should build it’s own UI ?  One that is owned and controlled by the community? one that doesn’t have any particular party behind it for some powers that be to threaten it with regulatory weapons for it to bend a knee?  I don’t know this is just a rant but what do you think? ",
                    "links": [
                        "https://cryptodaily.co.uk/2021/07/Uniswap-Labs-Imposes-Restrictions-On-Over-100-Tokens?_source=Discord&utm_medium=App",
                        "https://twitter.com/AndreCronjeTech/status/1418824665347330049?s=20",
                        "https://twitter.com/AndreCronjeTech/status/1418824665347330049?s=20",
                        "https://twitter.com/AndreCronjeTech/status/1418824665347330049?s=20",
                        "https://twitter.com/AndreCronjeTech/status/1418824665347330049?s=20"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.8730158730158735
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Micah",
                    "index": "2",
                    "likes": "1",
                    "time": "24/07/2021-11:18:07",
                    "content": "Here is a fork of the official UI with censorship removed: Release Release v4.11.1-uncensored · MicahZoltu/uniswap-frontend · GitHub Currently, I have to poke a few things each time a new version comes out and I’ll probably be lazy about that but updating isn’t particularly hard.  I plan on making the ENS links uncensorable, but right now I do have the ability to redirect ENS so keep that in mind when using the ENS addresses. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.733676046176046
                }
            ]
        }
    ],
    "group_index": "113"
}