{
    "poll_list": [
        {
            "id": "0x255d43357e17858f8664ffaaeaf7660bfd8be5f7dabc414edf98d3fadb3f1588",
            "title": "Optimism-Uniswap Protocol LM Program: Pool selection",
            "discussion": "https://gov.uniswap.org/t/rfc-the-optimism-uniswap-protocol-liquidity-mining-program/17820/9",
            "body": "Which pools should be selected?\n\n1. WETH/USDC, WETH/DAI, WETH/OP\n2. WETH/USDC, WETH/DAI, USDC/DAI\n3. WETH/USDC, WETH/DAI",
            "choices": [
                "WETH/USDC, WETH/DAI, WETH/OP",
                "WETH/USDC, WETH/DAI, USDC/DAI",
                "WETH/USDC, WETH/DAI"
            ],
            "scores": [
                18803.893060015675,
                5502883.513433251,
                201603.4987347409
            ],
            "start": 1665754705,
            "end": 1666015200,
            "snapshot": "15746731",
            "state": "closed",
            "author": "0xf665F2eD351696817898fe0Ace20c5C1Bc3c5796",
            "space": {
                "id": "uniswap",
                "name": "Uniswap"
            }
        },
        {
            "id": "0x8db45283c71ed4f72e5834212a10963b1b4a53527a175472ba8cc4ecdeebc6a2",
            "title": "Optimism-Uniswap Protocol LM Program: Structure",
            "discussion": "https://gov.uniswap.org/t/rfc-the-optimism-uniswap-protocol-liquidity-mining-program/17820/9",
            "body": "How should the program be structured? \n\n1. 2 Phase Deployment, Option 1 [200 OP/ 2 weeks, 600 OP]\n2. 2 Phase Deployment, Option 2 [200 OP/ 4 weeks, 600 OP]\n3. 3 Phase Deployment [50k OP/ 2 weeks, 100k OP/ 3 weeks, 650k OP until funds are all used]",
            "choices": [
                "2 Phases - 1 [2 week Phase 1]",
                "2 Phases - 2 [4 week Phase 1]",
                "3 Phases [50k/2w, 100k/3w, 650k]"
            ],
            "scores": [
                215236.67350051948,
                3313.607480020391,
                5503771.501640622
            ],
            "start": 1665754705,
            "end": 1666015200,
            "snapshot": "15746711",
            "state": "closed",
            "author": "0xf665F2eD351696817898fe0Ace20c5C1Bc3c5796",
            "space": {
                "id": "uniswap",
                "name": "Uniswap"
            }
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/rfc-the-optimism-uniswap-protocol-liquidity-mining-program/17820",
            "title": "[RFC] The Optimism-Uniswap Protocol Liquidity Mining Program ",
            "index": 17820,
            "category": [
                "Proposal Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/devinwalsh",
                    "index": "1",
                    "likes": "12",
                    "time": "06/10/2022-12:36:24",
                    "content": "As part of Phase 0 of Optimism’s Governance Fund, the Uniswap Protocol received 1M $OP tokens to incentivize future growth within the Optimism ecosystem. On behalf of the Uniswap Grants Program, Ken Ng submitted a proposal to use 20% of the designated OP on grants to support Optimism-Uniswap Protocol builders (apply for a grant here!), and the remaining 80% to support liquidity mining initiatives. The Uniswap Foundation, which has since absorbed UGP, is now excited to launch the liquidity mining program to support the Uniswap-Optimism ecosystem. As mentioned in the original Optimism governance proposal, we are seeking community input to determine the specific details of the program. To kick off this discussion, we will propose initial parameters. We welcome feedback on these parameters in the comments below. We suggest breaking the liquidity mining program into two phases so we can adjust incentives if necessary based on learnings from Phase 1. Phase 1 would deploy 200k $OP tokens and, after a review of LP and protocol activity, Phase 2 would deploy the remaining 600k $OP tokens. We are looking for community feedback on the following:  The Program structure (the two phases, mentioned above) The timespan for the program. The UF proposes Phase 1 liquidity mining to occur over 2 weeks. Pools. We suggest the following pools:   WETH/USDC, 0.05% WETH/DAI, 0.3% WETH/OP, 0.3%  These pools have the largest TVL, which would help anchor the liquidity migration onto Optimism. Additionally, they are consistently the top trading volume by pair, helping to ensure liquidity depth and returns for LPs. If providing an alternative option to any of the parameters proposed above, please provide your rationale. If multiple options arise through community feedback, we will create a 3-day Snapshot poll with the most popular options next Thursday (October 13). Otherwise, if there is clear consensus, we will move forward to kick off the program without a vote. Once these details are finalized with your help, we will outline the final program details and publish them on the UF Mirror and on Twitter. Let us know your thoughts and questions in the replies! ",
                    "links": [
                        "https://twitter.com/nkennethk",
                        "https://gov.optimism.io/t/gf-phase-0-proposal-uniswap/2133",
                        "https://airtable.com/shrWrSFRs6t1q1s9v",
                        "https://gov.optimism.io/t/gf-phase-0-proposal-uniswap/2133",
                        "https://info.uniswap.org/#/optimism/pools",
                        "https://gov.uniswap.org/t/rfc-phase-2-optimism-uniswap-protocol-liquidity-mining-program/19803",
                        "https://gov.uniswap.org/t/governance-weekly-recap/17803/4",
                        "https://gov.uniswap.org/t/governance-weekly-recap/17803/6",
                        "https://gov.uniswap.org/t/rfc-ammended-deployment-proposal-process/20777"
                    ],
                    "GPT-summary": "The post is a proposal by the Uniswap Foundation to launch a liquidity mining program to support the Uniswap-Optimism ecosystem. The author is seeking community input on the specific details of the program, including the program structure, timespan, and pools. The author is asking for feedback, constructive criticism, and questions from the community.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Token economics",
                        "Community and engagement",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.726190476190476
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Buckerino",
                    "index": "2",
                    "likes": "1",
                    "time": "06/10/2022-12:59:04",
                    "content": "I think the approach outlined by Ken does make sense and would be a worthwhile use of the funds.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/BP333",
                    "index": "3",
                    "likes": "4",
                    "time": "06/10/2022-14:27:18",
                    "content": "I think this a great proposal!  One thing to keep in mind is that xToken and Gamma Strategies received 600K OP collectively to incentivize the WETH/OP 0.3% pair, so those incentives may be better placed for another pair. I think what may be strategic for Uniswap is to incentivize the DAI-USDC 0.01% pool on Optimism.  image1754×737 128 KB  It’s one of the more crucial trading pairs, and a 10K swap for DAI is mostly getting routed to Velodrome and Kyberswap on 1inch.  Both of those platforms are incentivizing that trade route.  I think we can win that route if we were to incentivize the USDC/DAI pair. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.749999999999999
                },
                {
                    "author_link": "https://gov.uniswap.org/u/OPuser",
                    "index": "4",
                    "likes": "3",
                    "time": "06/10/2022-18:57:42",
                    "content": "Coming from OP Gov. I would suggest to totally remove WETH<>OP 0.3% pool as Gamma and xToken has an ongoing incentives of 900K $OP Not sure about the complexity but would love to see a new $OP pair. On distribution, I would break it into three part. 50K - 2Week 100K - 3week use rest until fund last. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.386363636363636
                },
                {
                    "author_link": "https://gov.uniswap.org/u/devinwalsh",
                    "index": "5",
                    "likes": "1",
                    "time": "06/10/2022-22:39:33",
                    "content": "Really helpful comments - the rationale makes a lot of sense to me ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/barbarossa_Arrakis",
                    "index": "6",
                    "likes": "1",
                    "time": "07/10/2022-10:27:08",
                    "content": "Awesome initiative and strategic use of the $OP token received  I’d like to bring up an additional point, regarding how the incentive should be distributed so that it is best aligned with the purpose of the LM and the broader scope of LPs can be incentivized. In a discussion initiated by @litocoen almost a year ago - Consensus Check - Should Uniswap incentivize Liquidity on Optimism and Arbitrum, the idea of modifying the existing UniV3 existing LM experience was brought up again. Basically, two options were mentioned:  Using a third party contract on top, e.g. Arrakis (then G-UNI) Modifying the vanilla staker contract  Then the question here is, for this upcoming LM program, what mechanism of incentive distribution should be used so that  More LPs can easily participate and be rewarded Risks of whales hording bulk of the incentives, e.g. another Ribbon Incident, can be eliminated or at least reduced  A side reference, Polygon deployed on Arrakis to conduct an LM for UniV3 early this year, which basically transformed the LM experience to be virtually the same as in UniV2. It managed to attract over $40m during a period of market crashes. As a team member of Arrakis, my pov might be somewhat biased. Although, what’s much more important to me is the overall wellbeing and success of Uniswap, especially since Arrakis is being built on its backbone. It’s been roughly a year since last time third party protocols were recommended to Uni community for the ease and fairness of LM on UniV3. If there already exists a secure, battle tested and provenly fit-for-purpose way to conduct LM, perhaps it’s worth reconsidering. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.324561403508772
                },
                {
                    "author_link": "https://gov.uniswap.org/u/GabePZ",
                    "index": "7",
                    "likes": "5",
                    "time": "10/10/2022-15:56:24",
                    "content": "Love to see the Uniswap team thinking hard about liquidity mining incentives! Given the large amount of money that Uniswap is about to spend through these liquidity mining incentives 800K OP (~$700k) it makes sense to do some pre-work and analysis to decide on where and how the tokens should be spent! From my perspective there are 3 reasons to spend tokens on liquidity mining incentives:  Bootstrap liquidity to generate a long term fly wheel effect. Attract new active users (LPs) to the protocol in order to facilitate long term growth after incentives are shut off. Generate returns for the protocol in excess of the liquidity mining rewards spent.  Each of these should be individually evaluated for how incentive emissions impacts each of those metrics long term and how each goal fits into a global objective function for Uniswap. More practically, there are several dimensions with which to optimize incentive spend over, only some of which I see included in the current proposal. We can summarize these as: WHERE, HOW, WHEN, and WHY.  Which pool should incentives be spent on? (WHERE)   Big or small? Growing or shrinking? Should tokens be spent on all pools equally? Are similar pools active outside of Uniswap?   Should tokens be spent on active or passive liquidity? (HOW)   Tokens given to liquidity that gets a trade? Liquidity that sits for a given amount of time in an active price range? Liquidity that sits for a given time in any price range?   How much incentives should be spent per day over what time frame? (WHEN)   Is it better to spend lots of tokens for a short period or few tokens for a long period?   What is Uniswap’s goal with these incentives? (WHY)   Maximize short term liquidity and volume even if it disappears after incentives are turned off? Attract users to Uniswap over competitors / Uniswap ETH? Generate revenue for Uniswap? (Doubtful since protocol revenue is turned off)  Using a simple heuristic to incentivize only the largest and most active pools (which may be wasted as these are pools are already active and do not require new incentives) is likely not optimal versus considering these alternative dimensions/goals. Alternatively, I would propose using all tokens in a set of intentional experiments in order to answer the above questions by dynamically tuning emissions on a weekly or bi-weekly cadence to maximize impact until the budget is used up. This prevents tokens from being wasted in poorly performing emissions strategies using a bit more of a multi-armed bandit strategy. In addition to maximizing the utility of the tokens that Uniswap spends this generates compelling data to support external parties interested in incentivizing Uniswap v3 pools to bootstrap their own token’s liquidity to choose Uniswap over competing exchanges going forwards. This strategy would also provide Uniswap good data points to use if they want to consider emitting their own liquidity mining incentives at some point in the future. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.2140562190785396
                },
                {
                    "author_link": "https://gov.uniswap.org/u/jony",
                    "index": "8",
                    "likes": "9",
                    "time": "13/10/2022-16:16:41",
                    "content": "Hey guys, this is from UniBot, we are a leveraged liquidity provision platform for Uniswap V3. We think this proposal is great in general, but we would like to share our ideas about how this incentive program can be done and the perks of doing it in this way.  Incentivized Pools We suggest incentivizing 2 pools: WETH/USDC 0.05% and WETH/DAI 0.3%  Program Structure  How should the tokens be spent across different pools? We suggest the distribution of OP tokens can be determined by either N-day trailing TVL or N-day trailing fee income when the snapshot is taken. As the proposal is about deepened liquidity for Uniswap Optimism, we believe using one of the two metrics makes the program incentivizes different pools fairly, since LPs in these pools will get a similar % of OP tokens.  How should the tokens be spent within an incentivized pool? We suggest within an incentivized pool, tokens should be distributed based on each LP’s fee income. The rationale behind this is that fee income is a perfect indicator of an LP’s contribution to the liquidity of a pool, by doing so, we can incentivize LPs to:  Not provide far out-of-the-money liquidity, because there will no fee income so they will not get OP reward from doing so Provide more narrow liquidity in the pool because they will earn higher fee income and more OP reward, and therefore deepen the liquidity of pools   Timespan For The Program To decide on the timespan for the program, we believe there are two factors that matter:  The OP reward an LP can earn on average The incentive program should last longer as possible  We suggest having a phase 1 to test the program, and adjust the emission rate according to the phase 1 result in phase 2.  Our Proposal For us, we believe a ~10% average APR boost is enough to incentivize LPs, and can keep the incentive program last long enough. If this is the case, then we can do:  Phase 1 can be extended to a 4-week program, which gives ~11% average APR boost for LPs Phase 2 can be a 12-week program, which gives ~7.35% average APR boost for LPs  This forms a 4-month incentive program with a moderate APR boost for LPs. So here’s how we get these numbers:  Phase 1 Let’s say the 10-day trailing TVL for:  WETH/USDC 0.05% pool are 11M, the pool will receive 200K * 2/3 = 133.33K OP WETH/DAI 0.3% pool are 5.5M, the pool will receive 200K * 1/3 = 66.67K OP  If we assume the OP price is $0.7, the result will be:  In phase 1, WETH/USDC 0.05% pool will be incentivized with around $93.33K (133.33K * $0.7) worth of OP, that translates into $93.33K / 11M * 52 / 4 = 11.02% average APR boost  In phase 1, WETH/DAI 0.3% pool will be incentivized with around $46.66K (66.67K * $0.7) worth of OP, that translates into $46.66K / 5.5M * 52 / 4 = 11.02% average APR boost    Phase 2 Let’s say due to phase 1 incentives, TVL increases to 1.5X for both pools, and the remaining 600K OP will be distributed in 12 weeks. This means in phase 2, these two pools will have:  600K * 2/3 = 400K OP 600K * 1/3 = 200K OP  If we assume the OP price is $0.7, the result will be:  In phase 2, WETH/USDC 0.05% pool will be incentivized with around $280K (400K * $0.7) worth of OP, that translates into $280K / 16.5M * 52 / 12 = 7.35% average APR boost  In phase 2, WETH/DAI 0.3% pool will be incentivized with around $140K (200K * $0.7) worth of OP, that translates into $140K / 8.25M * 52 / 2 = 7.35% average APR boost   As you might see here, what matters here is what the community believes is a fair incentivized APR for LPs in general. We believe we can work on this proposal under a similar framework, to decide what’s best for LPs and the Optimism ecosystem. To wrap up, we hope to start a discussion with more numbers so that we can better picture how this incentive program will incentivize LPs and how to design it to reach the goal! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.7073170731707314
                },
                {
                    "author_link": "https://gov.uniswap.org/u/devinwalsh",
                    "index": "9",
                    "likes": "7",
                    "time": "14/10/2022-01:58:29",
                    "content": "Hi all, thank you for the great feedback over the last week! As a quick refresher here: as part of Phase 0 of the Optimism Governance Fund, Uniswap received 1M $OP tokens to incentivize future growth within the Optimism ecosystem. Ken’s proposal to receive the OP, made on behalf of UGP (now part of the UF), proposed using 80% of that OP (800k OP) to support liquidity mining initiatives. Above, the UF proposed initial parameters to the program. Below, we summarize community feedback. Because there are suggested changes to the selected pools and program structure, we will launch 3-day Snapshot polls to decide on the right approach tomorrow morning (10/14) at 9 am EST. We will also Tweet about the Snapshot polls to get broader distribution. Two community members (@GabePZ and @jony) also included more in-depth frameworks which we are excited to leverage in Phase 2 of the program - with additional community feedback, analysis, and the benefit of learnings from Phase 1. Comments were as follows: From @BP333, a suggestion on pools: replace the WETH/OP 0.3% pair with the DAI/USDC 0.01% pair. “… xToken and Gamma Strategies received 600K OP collectively to incentivize the WETH/OP 0.3% pair, so those incentives may be better placed for another pair. I think what may be strategic for Uniswap is to incentivize the DAI-USDC 0.01% pool on Optimism. It’s one of the more crucial trading pairs, and a 10K swap for DAI is mostly getting routed to Velodrome and Kyberswap on 1inch. Both of those platforms are incentivizing that trade route. I think we can win that route if we were to incentivize the USDC/DAI pair.” From @OPuser, suggestions on pools and program structure: remove the WETH/OP 0.3% pair for the reason @BP333 mentions above, and breaks the program into three parts. Specifically: 1) 2 weeks, 50k OP, 2) 3 weeks, 100k OP, 3) 650k OP until funds run out. From @barbarossa_Arrakis, a suggestion to ensure liquidity mining is easy to access and use for all LPs. We agree with the suggestion and are excited to highlight and work with three community projects which both provide a great UX and more expansive strategies to LPs. For Phase 1, we plan to deploy incentives with Arrakis, Gamma Strategies, and xToken Terminal to deploy incentives. “… the question here is, for this upcoming LM program, what mechanism of incentive distribution should be used so that 1. More LPs can easily participate and be rewarded 2. Risks of whales hording bulk of the incentives, e.g. another Ribbon Incident, can be eliminated or at least reduced” From @jony, suggestions on pools and program structure: remove the WETH/OP pool, and extend Phase 1 to 4 weeks. We will include the suggestion to extend Phase 2 to 12 weeks in a separate discussion on that Phase. Both @GabePZ and @jony include more in-depth frameworks for assessing how the community should approach liquidity mining. We are excited for these two, in addition to the broader community, to further flesh out these approaches and to incorporate Phase 1 information into our Phase 2 (and 3?) plans. Thanks again to everyone for their in-depth feedback. For the Snapshot Polls, we will post the following tomorrow morning (10/14) at 9 am EST. On LM program structure:  2 Phase Deployment, Option 1 [200 OP/ 2 weeks, 600 OP] 2 Phase Deployment, Option 2 [200 OP/ 4 weeks, 600 OP] 3 Phase Deployment [50k OP/ 2 weeks, 100k OP/ 3 weeks, 650k OP until funds are all used]  On LM pool selection:  WETH/USDC, WETH/DAI, WETH/OP WETH/USDC, WETH/DAI, USDC/DAI WETH/USDC, WETH/DAI  Please let us know if you have any additional thoughts for now. Though note we will not include any additional comments in the Phase 1 snapshot polls, unless there are corrections from the commenters above.    ",
                    "links": [
                        "https://gov.optimism.io/t/gf-phase-0-proposal-uniswap/2133",
                        "https://twitter.com/ArrakisFinance",
                        "https://twitter.com/GammaStrategies",
                        "https://twitter.com/xtokenterminal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.501913265306123
                },
                {
                    "author_link": "https://gov.uniswap.org/u/barbarossa_Arrakis",
                    "index": "10",
                    "likes": "1",
                    "time": "14/10/2022-08:46:23",
                    "content": "This is awesome! Glad to know that Uniswap is so inclusive and community projects will have the opportunity to contribute to the program as well! Congrats to our peers Gamma and xToken Terminal too  So I suppose the next step is to establish the proper communication channels between Uniswap and the said projects. Will we be contacted by Uniswap team through our social media or community? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.658333333333333
                },
                {
                    "author_link": "https://gov.uniswap.org/u/OPuser",
                    "index": "11",
                    "likes": "1",
                    "time": "14/10/2022-12:01:07",
                    "content": "This is super cool. Stable, eth and OP pair gonna boost liquidity on Optimism. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.708333333333334
                },
                {
                    "author_link": "https://gov.uniswap.org/u/devinwalsh",
                    "index": "12",
                    "likes": "0",
                    "time": "14/10/2022-13:56:59",
                    "content": "Links to Snapshot polls are below What program structure should be used? What pools should be selected? Polls just began and will end Monday 10/17 at 10 am EST ",
                    "links": [
                        "https://snapshot.org/#/uniswap/proposal/0x255d43357e17858f8664ffaaeaf7660bfd8be5f7dabc414edf98d3fadb3f1588"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/pennblockchain",
                    "index": "13",
                    "likes": "0",
                    "time": "15/10/2022-13:21:55",
                    "content": "Thanks Devin, Bringing a couple questions onto the forums that we had.  To clarify, for plan 1/2, is the remaining OP after the 2/4 weeks in allocated currently? And for plan 3, all rewards are emitted at the set times? Thanks! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://gov.uniswap.org/u/devinwalsh",
                    "index": "14",
                    "likes": "2",
                    "time": "15/10/2022-22:12:04",
                    "content": "Thanks for the question - happy to clarify! So this is for this poll here on program structure. This is what we mean. We have a total of 800k OP to deploy to these programs, and we propose splitting that OP across 2 (or 3) phases. Use a smaller portion for Phase 1, learn from that Phase, and then deploy more OP 1. 2 Phase Deployment, Option 1 [200k OP/ 2 weeks, 600k OP] 200k OP released as incentives over 2 weeks. Then take into account additional analysis/frameworks + learnings from Phase 1 for Phase 2. Length of time for Phase 2 will be determined in the future. 2. 2 Phase Deployment, Option 2 [200k OP/ 4 weeks, 600k OP] 200k OP released as incentives over 4 weeks. Then take into account additional analysis/frameworks + learnings from Phase 1 for Phase 2. Length of time for Phase 2 will be determined in the future. 3. 3 Phase Deployment [50k OP/ 2 weeks, 100k OP/ 3 weeks, 650k OP until funds are all used] 50k OP released as incentives over 2 weeks for Phase 1. Then take into account analysis/frameworks + learnings from Phase 1 for Phase 2 - 100k will be 3 weeks. More analysis + learnings from Phases 1 + 2 for Phase 3, which will release the remaining 650k OP. Length of time for Phase 3 will be determined in the future. ",
                    "links": [
                        "https://gov.uniswap.org/t/governance-weekly-recap/17803/5"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.94375
                },
                {
                    "author_link": "https://gov.uniswap.org/u/mjc716",
                    "index": "15",
                    "likes": "1",
                    "time": "19/10/2022-14:39:38",
                    "content": "We at xToken align with this approach. Assuming that WETH-USDC and/or WETH-DAI are a central part of this program, we’d like to split any allocation between several pools with several different liquidity ranges. Each program would have the same rate of incentives over a 2-3 week period. This will give us some basic comparative data on 1) $ of incentive demanded per $ of liquidity, 2) $ of fee generation per $ of liquidity, and 3) impermanent loss impairment relative to fee and incentive yield. We’d want to reassess after a few weeks and likely modify the program based on learnings. We’d want to run at least three of these program periods in order to collect enough data to build an informed data set. We’re also building a permissionless liquidity manager CLI that we hope to launch Q4 or Q1. This would allow us to empower more sophisticated managers with the tools to actively manage users’ liquidity in a trustless manner. So we could incentivize a group of pools for WETH-USDC with different managers and, over time, LPs would likely gravitate towards more effective managers. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.407407407407407
                },
                {
                    "author_link": "https://gov.uniswap.org/u/peibo0318",
                    "index": "16",
                    "likes": "0",
                    "time": "21/10/2022-15:27:50",
                    "content": "Good proposal. Let’s push forward. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/rodriguezmatid",
                    "index": "17",
                    "likes": "1",
                    "time": "17/11/2022-01:13:39",
                    "content": "Hey! where I can see the transaction hash of the 1st phase? Or there is any contract address to handle this? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/arabianhorses",
                    "index": "18",
                    "likes": "0",
                    "time": "20/11/2022-12:23:26",
                    "content": "I am preparing a dashboard about the Uniswap LM program phase 1 - But I couldn’t get 'how these incentivizes being used ’ for example, if I had deposited some amount to USDC/WETH 0.5 pool (directly on uniswap) am I eligible for some $OP rewards or do I have to deposit through Gamma,xToken or Arrakis ? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Fedeebasta",
                    "index": "19",
                    "likes": "1",
                    "time": "22/11/2022-17:03:36",
                    "content": "    arabianhorses:  But I couldn’t get 'how these incentivizes being used ’   The incentives are being distributed trough 3 partner projects(Gamma, xToken or Arrakis ) that are handling the OP distribution. So you need to check their contracts to see how the rewards are distributed. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/research",
                    "index": "20",
                    "likes": "1",
                    "time": "29/11/2022-23:33:58",
                    "content": "Hi all, LP here. Has the LM program already started, if not when will it start, if yes, when does it end? I have read the proposal and the comments. I am commenting here on the liquidity mining incentives. I would be interested to understand how we could help. See below a description of our current active LPs. Main net USDC/WETH 0.3% and 0.05% (around 10% of each pool) - I was wondering how we could help. We also provide large chunks of liquidity in pools such as LINK/ETH (around 20% of the pool), MATIC/ETH (around 20% of the pool), UNI/ETH (around 20% of the pool). We will also provide liquidity on USDC/WETH 0.05% on Arbitrum (around 20% of the pool). I think three phases are great. Regarding the pools, WETH/USDC 0.05% and WETH/OP 0.3% are interesting to us. We could go to a Maximum of around 20% share of the pool to each at current TVL (8.5 and 5.4Ms respectively), if that would make sense. If there is no incentive on the WETH/OP pool though, not sure if it makes sense to participate. Regarding third-party contracts on top, like Arrakis, we wouldn’t be inclined to do it, but we have a call with Arrakis soon, so we could discuss that. We are not looking to hord the incentives, but rather to be a long-term LP on both pools and enjoy some incentives. Uniswap V3 or any AMM for that matter are not well suited for the individual, unsophisticated investors, because they might not fully understand the shape of the risk/return function and might suffer more IL than they were ready to have. Hence, I would recommend having a few parties to provide long-term liquidity. By long-term, I mean nearly forever. As to where, how, when, why. Where: highest liquidity How: Passive liquidity and Active Liquidity to the same level. When: Long period, of course IMO. Why: Create long-term deep liquidity on major pools. The largest and deepest pool will automatically have more trading, because of better Arb opportunities. Trying to incentivize a losing pool doesn’t make sense IMO. The deeper ANY pool the better. The deeper the largest pool, the better. We wouldn’t go to a smaller pool as the risk would be too high. @devinwalsh thank you for posting the Snapshot polls, helped a lot. That would be it from my side. Looking forward to hear from you guys. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.7700460829493085
                },
                {
                    "author_link": "https://gov.uniswap.org/u/ilia_0x",
                    "index": "21",
                    "likes": "1",
                    "time": "11/12/2022-08:43:54",
                    "content": "Can we deploy a part of incentives to Quadrat Protocol - active liquidity manager for Uniswap v3 on Optimism?    plasma.finance    Quadrat Active Asset Management Protocol Uniswap v3 Permissionless, non-custodial and decentralized protocol for active liquidity management on Uniswap v3. Quadrat auto-rebalancing Strategies provide the highest APY on the market for ETH, BTC, Matic, USDC, USDT. The protocol is powered by 0xPlasma      ",
                    "links": [
                        "https://plasma.finance/quadrat"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.333333333333334
                },
                {
                    "author_link": "https://gov.uniswap.org/u/ilia_0x",
                    "index": "22",
                    "likes": "1",
                    "time": "11/12/2022-12:44:26",
                    "content": "0xPlasma can help make liquidity more capital efficient and concentrated in that pairs for routers’ swap with our Quadrat Protocol - permissionless active liquidate management protocol for Uniswap v3 ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.916666666666667
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Bettyrockergit",
                    "index": "23",
                    "likes": "1",
                    "time": "13/03/2023-00:22:00",
                    "content": "    [RFC] The Optimism-Uniswap Protocol Liquidity Mining Program Proposal Discussion       0xPlasma can help make liquidity more capital efficient and concentrated in that pairs for routers’ swap with our Quadrat Protocol - permissionless active liquidate management protocol for Uniswap v3     ",
                    "links": [
                        "https://plasma.finance/quadrat"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.916666666666667
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Bettyrockergit",
                    "index": "24",
                    "likes": "0",
                    "time": "20/03/2023-06:13:50",
                    "content": "    [RFC] The Optimism-Uniswap Protocol Liquidity Mining Program Proposal Discussion     ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "230"
}