{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/create-a-perpetual-hail-mary-uni-eth-pool/8472",
            "title": "Create a perpetual Hail Mary UNI/ETH Pool ",
            "index": 8472,
            "category": [
                "Temperature Check"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/twkaiser",
                    "index": "1",
                    "likes": "10",
                    "time": "13/11/2020-23:54:29",
                    "content": "So here’s the situation: On Tuesday 17/11, the liquidity mining period will end, which will likely cause a sell-off in both UNI and ETH, as well as a massive loss of liquidity. In order to prevent this, urgent action is required. Simply extending the liquidity mining period would just postpone the problem to a later date. Not to mention that it is now too late for a governance proposal. To avert this crisis, I propose the following: (1) Create a perpetual UNI/ETH Pool This move would be similar to Yearn Finance’s Backscratcher Vault. Users can provide liquidity to the pool at all times, but they will never be able to redeem their LP tokens (they may sell them on the secondary market though). This is to absorb at least some of the liquidity that will be lost on Tuesday. Futhermore, any liquidity provided to the Hail Mary Pool will stay on Uniswap indefinitely. (2) Incentivize users to provide Liquidity to the Hail Mary Pool Offer some form of incentive to holders of the Pool’s LP tokens. These could be UNI rewards, a share of all trading fees collected across all pools on Uniswap (say 0.05% from every trade), something completely else, or a mixture of these options. (3) Incentivize Liquidity Farmers to keep their Assets on Uniswap This is to reward those users who stay faithful to Uniswap, even without the added incentives of the Liquidity Mining Program. Any user who does not cash out after the program ends on Tuesday and then chooses to deposit their assets into the Hail Mary Pool will receive a bonus on their earned LP tokens (say twice the rate they would normally get). I arbitrarily made up these incentives since we’re in a hurry. Of course we can discuss the exact details in later stages of the governance process. For now, it is important to reassure LPs that their faith in Uniswap will be rewarded after Tuesday. Link to snapshot: https://snapshot.page/#/uniswap/proposal/QmVzKmMeu2BRvuU2ep37ebpo16h2Pbs5toCUiY7YzgVhGz ",
                    "links": [],
                    "GPT-summary": "The author proposes creating a perpetual UNI/ETH pool to prevent a liquidity crisis after the liquidity mining period ends. The proposal includes incentivizing users to provide liquidity to the pool and to keep their assets on Uniswap. A link to the proposal is provided. A third party could give constructive criticism of the proposal or ask questions about it.",
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Token economics",
                        "Grants, Funding and resource allocation",
                        "Community and engagement"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 4.930555555555555
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Joncatch",
                    "index": "2",
                    "likes": "3",
                    "time": "14/11/2020-00:24:57",
                    "content": "I like this with the one exception of permanently leaving liquidity there as this would also effect the governance voting issues currently had but leaving a small stream of uni to incentivize the pool on a permanent basis seems to me to be a good idea ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://gov.uniswap.org/u/twkaiser",
                    "index": "3",
                    "likes": "2",
                    "time": "14/11/2020-01:01:59",
                    "content": "That’s a valid point. It will require some fine-tuning to both prevent too many UNI being drawn away from governance, while both providing proper incentives to existing LPs. It doesn’t necessarily have to be a perpetual pool, it could also be one with a long staking/vesting period, or something else entirely. What is important is the third point. LPs should be able to qualify for bonuses if their liquidity never leaves the pools between 17/11 and the time the new incentive system is implemented. This will require a leap of faith, so we should make sure to offer them a proper reward. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.902892561983471
                },
                {
                    "author_link": "https://gov.uniswap.org/u/furiosu",
                    "index": "4",
                    "likes": "1",
                    "time": "14/11/2020-09:47:31",
                    "content": "Don’t like the fact that this is opened to avert a crysis and with rushed tone to it. Rushed decisions won’t bring us anywhere. As a note, the economics and impact of this is above my understanding though. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Ezzy",
                    "index": "5",
                    "likes": "1",
                    "time": "14/11/2020-12:07:52",
                    "content": "Taking hasty and aversive actions with respect to 17/11 interim closure of mining pool will do more harm than good to the ecosystem. The only course of action now is to announce a not-to-far date to open up another mining pool with an upwardly adjusted reward. LPools and fees rewards are the lifeblood of Unicorn ecosystem. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.3
                },
                {
                    "author_link": "https://gov.uniswap.org/u/WhataUniqueGuy",
                    "index": "6",
                    "likes": "0",
                    "time": "14/11/2020-12:40:26",
                    "content": "Hi there. Couple of Qs regarding 11/17: how long in adv did the community know about the farming halt? And if short-notice, what are some main reasons for the decision to stop? Thanks ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.527777777777779
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Joncatch",
                    "index": "7",
                    "likes": "0",
                    "time": "14/11/2020-20:35:54",
                    "content": "The pools were preset by uniswap dev team they were declared to last for 60 days so we need someone with 10 million votes delegates or otherwise to extend them or make new pools for liquidity farming ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.340909090909091
                },
                {
                    "author_link": "https://gov.uniswap.org/u/twkaiser",
                    "index": "8",
                    "likes": "2",
                    "time": "15/11/2020-00:50:45",
                    "content": "Endlessly inflating the UNI supply isn’t a solution either. Also, this is not a rushed decision. Remember that this is just a temperature check, which can actually pass before 11/17. Our goal should be to let LPs know that we are working on a solution to honor their loyalty. We’ll have enough time to figure out how this solution will look like specifically later. The proposal I am making is supposed to exactly NOT rush into another half-hearted attempt at liquidity mining, but to buy us time in order to come up with a solution. But if we can’t even agree that we need to come up with new incentives for loyalty, we cannot blame LPs if they withdraw their liquidity on Tuesday. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 4.90530303030303
                },
                {
                    "author_link": "https://gov.uniswap.org/u/heresjonny",
                    "index": "9",
                    "likes": "2",
                    "time": "15/11/2020-03:50:56",
                    "content": "they have known about it since inception, everyone and anyone who clicked the UNI tab had the ability to see the ticker counting down since the start as well as click a link that leads to a document where things are explained in depth. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.222222222222222
                },
                {
                    "author_link": "https://gov.uniswap.org/u/WhataUniqueGuy",
                    "index": "10",
                    "likes": "0",
                    "time": "15/11/2020-19:01:59",
                    "content": "Thanks. Looked around @ Uni site for that in-depth doc but didn’t see. Provide a link please. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/refri",
                    "index": "11",
                    "likes": "1",
                    "time": "15/11/2020-23:43:25",
                    "content": "I am curious if the drop in liquidity and sell off of uni token will be like you fear it will be. My liquidity has been there before and will stay there after the incentive ends, just because it gives me valid returns. And if others pull out liquidity it trading of the remaining share will be even more as will be the return. Regarding the UNI token I am not so sure but compared to the amount hitting the market after it was droped to all users the amout distributed now for lp seems not that a hugh and I would prefer to wait an see before taking any action. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.uniswap.org/u/PureSubstance",
                    "index": "12",
                    "likes": "0",
                    "time": "16/11/2020-04:37:52",
                    "content": "@twkaiser  I’d have to agree with this proposal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Chuck",
                    "index": "13",
                    "likes": "0",
                    "time": "21/11/2020-04:15:00",
                    "content": "unknown-12508×1244 574 KB Emmm, I’m a traitor, shame on me. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/PinkHorse",
                    "index": "14",
                    "likes": "1",
                    "time": "24/11/2020-19:02:52",
                    "content": "Is at least that proposal going somewhere? seems like governance is stuck ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/allo",
                    "index": "15",
                    "likes": "2",
                    "time": "24/11/2020-19:44:13",
                    "content": "No worries… Sushi is burning their matches at a fast pace. Just make sure to drip dump that artificially pumped SUSHI at the same pace  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.125
                }
            ]
        }
    ],
    "group_index": "480"
}