{
    "poll_list": [
        {
            "id": "0xd70b3e84db501c2633bc8189fcfc335726fce90584a3c37f6155580369f11023",
            "title": "[Consensus Check] Create the Uniswap Foundation",
            "discussion": "https://gov.uniswap.org/t/consensus-check-create-the-uniswap-foundation/17457",
            "body": "Read the full proposal here: https://gov.uniswap.org/t/consensus-check-create-the-uniswap-foundation/17457",
            "choices": [
                "Yes",
                "No"
            ],
            "scores": [
                16198749.081107626,
                408.95988583279023
            ],
            "start": 1660145958,
            "end": 1660579200,
            "snapshot": "15315164",
            "state": "closed",
            "author": "0xf665F2eD351696817898fe0Ace20c5C1Bc3c5796",
            "space": {
                "id": "uniswap",
                "name": "Uniswap"
            }
        },
        {
            "id": "0xee4851601143b1e9655be7168ca2d0f119fba31afadf2a7f808ea12b7bb4e9df",
            "title": "[Temperature Check] Create the Uniswap Foundation",
            "discussion": "https://gov.uniswap.org/t/temperature-check-create-the-uniswap-foundation/17358",
            "body": "[Read the full proposal here: https://gov.uniswap.org/t/temperature-check-create-the-uniswap-foundation/17358]\n\nUniswap Foundation: Preamble\nUniswap has already changed the world.\n\nIn only 3 years, the world’s first automated market maker has pioneered DeFi primitives, supported more than $1T 7 in cumulative volume, and served millions of users 4 worldwide. Its daily volume today is on par with Coinbase 10.\n\nOwnership of the protocol was transferred to the community 12 in 2020 and since then the Uniswap Grants Program (UGP) has demonstrated the potential for community-funded initiatives to make a positive impact. Over 1.5 years, UGP has funded 120+ grantees 22 improving governance, and developing new interfaces and developer tooling.\n\nHowever, there is still work to do to help Uniswap reach its full potential. The governance process has too much friction, the ecosystem is too difficult to navigate, and UGP in its current form is not able to fund the most ambitious and impactful projects.\n\nWe want to change that.\n\nToday, we are excited to propose the creation of the Uniswap Foundation, which has the mission to support the decentralized growth and sustainability of the Uniswap Protocol and its supporting ecosystem and community.\n\nIn other words, the goal of the Uniswap Foundation is to support you.\n\nUniswap’s community is expansive, encompassing the universe of individuals and organizations which build on and benefit from decentralized protocols. Your contributions have already made Uniswap a success, but we want to help you accomplish much more.\n\nThe Uniswap Foundation (UF) will provide grants to builders, researchers, organizers, academics, analysts, and more to grow the Protocol and plan for its future.\n\nIt will make it easier to govern the protocol and community treasury, and to navigate the broader ecosystem.\n\nIt will help you make an impact – to reduce friction, and amplify your efforts.\n\nWe believe that Uniswap will be the value exchange layer of the Internet.\n\nIt brought the automated market maker to the masses.\n\nIt has led the way in the evolution and growth of DeFi and web3.\n\nIt is censorship resistant, permissionless, decentralized, and secure – constituting a set of properties which we believe should define our world’s financial infrastructure.\n\nBut there is still a long way to go for Uniswap to reach its full potential.\n\nWe’re excited to work with all of you to make that happen.\n\nIf you’re excited too, please read our proposal, comment, reach out to chat (our DMs - @devinawalsh and @nkennethk are open!), and spread the word.\n\nUniswap Foundation Proposal\nThis proposal is being put forth by the Uniswap Foundation, a Delaware corporation formed by Uniswap community members Devin Walsh and Ken Ng to facilitate the steps outlined in this proposal.\n\nTL;DR\nToday, we are thrilled to propose the creation of the Uniswap Foundation (UF).\nScope: The UF, the first Foundation of a major protocol to go through the community governance process, will support the Protocol’s decentralized growth, reinvigorate governance, and serve as a Protocol advocate.\nTeam: Devin Walsh will serve as the Executive Director, Ken Ng will serve as Head of Operations, and they will build out a team of 12.\nBudget: To fund these efforts, we are requesting:\nA $14M Operating budget to cover a full team for 3 years\nA $60M expanded Uniswap Grants Program (UGP) budget to cover 3+ years\nWe are requesting $74M total, which will be broken into two disbursements, with a first disbursement of $20M.\nGovernance Participation: We are also requesting 2.5M UNI to participate in governance, primarily through delegation. Through usage of a new smart contract primitive The Franchiser 40, this UNI will be revocable by the DAO at any time, and cannot be used for any purpose outside of governance.\nUniswap Foundation\nMission\nIn pursuit of a more open and fair financial system, the Uniswap Foundation supports the decentralized growth and sustainability of the Uniswap Protocol and its supporting ecosystem.\n\nKey Activities and OKRs\nWe have listed our starting OKRs below. It’s possible these OKRs will have to change in the future. If they do change in a meaningful way, we will communicate that to the community.\n\nGrowth: Promoting Decentralization & Growth of the Protocol and Ecosystem\n \n![OKR 1.png](ipfs://bafkreibefwld5zfnkhfrilv7wiotjszoq3k6jyd6hmdv35dc3l56xgldtq)\n    \n\nGovernance: Reinvigorating the Uniswap Community Governance Process\n \n![OKR 2.png](ipfs://bafkreictfkmisbuahzumwmvlol4nl3sx4qnemfryeg4oc5fe36cqnhayoi)\n    \n\nAdvocacy: Advocating for the Protocol and amplifying its positive social impact\n \n![OKR 3.png](ipfs://bafkreiaoplgtuug6tkpthgnnzwn4a6gq6av4dvrqpfddajtjtdbmcexoby)\n    \n\nOptimism Phase 0 token distribution link here 6\n\nYear 1 Roadmap\nOur roadmap for the first year of operations includes but is not limited to the following activities:\n \n![Year 1.png](ipfs://bafkreigbddie5gfbetvp5lny5gvun7x3umpfqlqk7hhkcbtzz3mqj4itam)\n    \n\nOptimism Collective community Constitution link here \n\nTeam\nDevin Walsh 108, Executive Director (ED)\n\nAs ED, Devin will be responsible for setting UF’s strategic vision alongside the Board and driving execution to achieve that vision.\n\nDevin has been in crypto since 2016. She has conducted independent research for MIT’s Digital Currency Initiative, worked on decentralized identity at uPort (ConsenSys), and led protocol and venture investments at CoinFund. She has consulted with Edge & Node and cLabs, and led MIRA, a seed stage startup at the intersection of fine art and NFTs. She recently resigned as Chief of Staff at Uniswap Labs in order to propose the creation of the UF.\n\nKen Ng 69, Head of Operations\n\nAs Head of Operations, Ken will build and scale processes to maximize the UF’s impact.\n\nKen has served the Uniswap ecosystem as Lead of the Uniswap Grants Program 1 for the past 1.5 years. He has helped run the Ethereum Foundation Ecosystem Support Program, which gave Hayden his initial grant 7 to build Uniswap. He served as COO of Slingshot Finance and cofounder of his nonprofit eduDAO, which helps raise funds for students and teachers in the Bronx.\n\nThe needs, and thus the makeup, of our team may change over time. However, today we aim to hire for following roles, with a focus on filling the Grants and Governance roles first:\n\n \n![Team.png](ipfs://bafkreib2uwfespzdr3p2c4tdcpi3ndznqjig55edrigkrfcgq2zqjdtn6y)\n    \n\nApplications are open today! Check out job descriptions here.\n\nAs noted by Other Internet 4, there is also a need for new structures to “facilitate coordination across the complex web of stakeholders” within the Uniswap ecosystem. To provide this much needed coordination, the UF will be committed to working with a variety of independent parties (freelancers, development teams, research fellows, analysts, and more) to achieve many of its objectives.\n\nAdvisors\nThe Foundation’s initial advisory team will be made up of the following individuals:\n\nJesse Walden, Founder and GP, Variant\nJulia Rosenberg, Co-Founder, Orca Protocol\nAlexis Gauba, Co-Founder, Opyn; Co-Founder, she256\nHart Lambur, Co-Founder of UMA\nIn addition to advising UF on strategy and roadmap, this group will, alongside the Executive Director (ED) and Head of Operations,\n\nProvide input on UF’s initial hiring decisions. This may include interviewing potential candidates and sharing feedback with the Committee as it determines its first hires, including its third Board member and at least next three team members.\nBecome temporary signers of the UF multi-sig, which will hold UF funds if and when the proposal is passed, for the sole purpose of executing approved proposals as instructed. This responsibility will be transitioned to UF team members once they are hired.\nBoard\nDevin Walsh and Ken Ng will serve as the first two Board members of the UF. Alongside the UF’s Advisors, they will interview and target to hire a third Board member in the first 3 months of operations.\n\nBudget\nWe are requesting $74M in UNI. This funding would be broken down into the following buckets:\n\n$60M for Uniswap Grants Program\nGrants spending will be broken down into the below categories. We will revisit and readjust these categories as needed to ensure we continue to deploy resources where they are most impactful.\n\nWe are proud of the work done by UGP thus far (memorialized in this retrospective 22), and are incredibly excited to expand the scope of its work.\n\n \n![Grants.png](ipfs://bafkreibtxk4n6pjqrccg2weocvjnqpoeuceje2sagxbgokqucfjombefjy)\n    \n\nWe are already in the process of assessing several high impact grant proposals which UGP would be excited to fund, if and when this proposal is passed. Two examples are:\n\nA version of Uniswap v3 written in Cairo, to be deployed on Starknet\nA prototype of an MEV estimation tool leveraging machine learning techniques built by respected academics in the space\nWe are also excited to continue funding ongoing work by existing grantees funded by UGP v0.1, including governance experiments and analyses from Other Internet, customer support from Serv.eth, and ETHGlobal hackathons.\n\nTo ensure community alignment with larger grants disbursements, the UF will put forth an off-chain Snapshot to the community for proposed grants larger than $2M.\n\nWe believe that this Grants budget will last approximately 3 years but this is subject to change depending upon the number and quality of applicants. We plan to approach the Treasury for additional Grants funds when there are ~6 months of funds remaining.\n\n$14M operating budget to build out a full team of 12 over the next two years.\nIn order to provide stability to our employees and to sustain the Foundation, we may make a request to the community for additional funding for further out than 3 years when we return to the Treasury at 6-12 months of operations (read more below).\n\nBudget estimate looking forward three years is below.\n \n![Budget.png](ipfs://bafkreiel3fzdoeharssfyzclubtlyk667p5skcnwkfinrus7b6za5tiuwi)\n    \n\n*Inclusive of UNI vesting. In order to incentivize a highly qualified team, the UF will offer competitive compensation packages including both fiat and long-term vesting UNI. To provide full transparency, we will disclose UF financials later this year.\n\n**The UF will allocate an additional $2M in funds to cover legal fees in the case of unexpected future litigation.\n\nFund Disbursements\nAn approval of this proposal is an approval for the full $74M budget requested.\n\nWe are requesting the funds in two disbursements:\n\n$20M now to cover operating expenses for the next 2 years and grants for 1 year. Assuming a UNI price of $7.04*, this initial request totals to 2,840,909 UNI.\n$54M, to be disbursed by the Uniswap Treasury in 6-12 months once the UF has completed the establishment of its legal entity. The UF will publish a post on the forum notifying the community a week prior to putting forth a formal governance proposal for the remaining funds. In other words, because this proposal approves the full amount of funding, we will not go through an additional the Temperature Check and Consensus Check steps to receive this second disbursement.\n*To calculate our final UNI request we will use the 30 day TWAP on the day we put forth our Governance Proposal. $7.04 is approximately the 30 day TWAP as of 8/3/2022.\n\nGovernance Participation\nThe UF is also requesting 2.5M UNI to participate in governance.\n\nThese tokens will be delegated to the UF by the Uniswap DAO through a new smart contract design, The Franchiser, which ensures the tokens are only used for delegation, and allows the DAO to claw back the tokens at any time. The UF plans to use these tokens primarily for delegation to community members without the requisite 2.5M UNI to submit a governance proposal, however the UF may also self-delegate the UNI to vote, and to put up its own proposals.\n\nThe Franchiser was developed by Noah Zinsmeister and was audited by Trail of Bits.\n\nNext Steps\nWe are excited to discuss this proposal with the broader community as it passes through the Request for Comment phase. Should sentiment be positive, a Temperature Check Snapshot poll will be set up on Mon., August 8. If the Temperature Check poll passes, additional feedback will be incorporated before moving forward to the Consensus Check.\n\nAdditionally, to discuss the proposal and answer your questions, we plan to attend the Uniswap Community call at 4 PM EST on Wed., August 10, and to host a Twitter Spaces on @uniswapgrants at 11 AM EST on Mon., August 15.\n\n[Read the full Proposal and Addendum here: https://gov.uniswap.org/t/temperature-check-create-the-uniswap-foundation/17358]",
            "choices": [
                "Yes",
                "No"
            ],
            "scores": [
                35236231.9638499,
                1072.245292312057
            ],
            "start": 1659969467,
            "end": 1660143600,
            "snapshot": "15302134",
            "state": "closed",
            "author": "0xf665F2eD351696817898fe0Ace20c5C1Bc3c5796",
            "space": {
                "id": "uniswap",
                "name": "Uniswap"
            }
        },
        {
            "title": "Create the Uniswap Foundation",
            "date": "Proposed on: Aug 15th, 2022",
            "yes_votes": "86.3M",
            "no_votes": "770.71"
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/governance-proposal-create-the-uniswap-foundation/17499",
            "title": "[Governance Proposal] Create the Uniswap Foundation ",
            "index": 17499,
            "category": [
                "Proposal Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/devinwalsh",
                    "index": "1",
                    "likes": "3",
                    "time": "17/08/2022-17:51:13",
                    "content": "Vote on the Governance Proposal here: Create the Uniswap Foundation The Governance vote ends on Tuesday, August 23 at 3:22 PM EST. ~ Thank you to everyone who has read our proposal to create the Uniswap Foundation thus far! Our conversations with you have energized us even more about the opportunity for the UF to positively impact the Uniswap ecosystem. We have added additional information about the UGP and other topics discussed in the Temp Check forum to the addendum of the proposal. For the final governance proposal, we have also added the multisig addresses to the Addendum. Link to Temperature Check governance forum post: Temperature Check: Create the Uniswap Foundation  Link to Temperature Check snapshot poll: Temp Check Snapshot Link to Consensus Check governance forum post: Consensus Check: Create the Uniswap Foundation  Link to Consensus Check snapshot poll: Consensus Check Snapshot ~  Uniswap Foundation: Preamble Uniswap has already changed the world. In only 3 years, the world’s first automated market maker has pioneered DeFi primitives, supported more than $1T in cumulative volume, and served millions of users worldwide. Its daily volume today is on par with Coinbase . Ownership of the protocol was transferred to the community in 2020 and since then the Uniswap Grants Program (UGP) has demonstrated the potential for community-funded initiatives to make a positive impact. Over 1.5 years, UGP has funded 120+ grantees  improving governance, and developing new interfaces and developer tooling. However, there is still work to do to help Uniswap reach its full potential. The governance process has too much friction, the ecosystem is too difficult to navigate, and UGP in its current form is not able to fund the most ambitious and impactful projects. We want to change that. Today, we are excited to propose the creation of the Uniswap Foundation, which has the mission to support the decentralized growth and sustainability of the Uniswap Protocol and its supporting ecosystem and community. In other words, the goal of the Uniswap Foundation is to support you. Uniswap’s community is expansive, encompassing the universe of individuals and organizations which build on and benefit from decentralized protocols. Your contributions have already made Uniswap a success, but we want to help you accomplish much more. The Uniswap Foundation (UF) will provide grants to builders, researchers, organizers, academics, analysts, and more to grow the Protocol and plan for its future. It will make it easier to govern the protocol and community treasury, and to navigate the broader ecosystem. It will help you make an impact – to reduce friction, and amplify your efforts. We believe that Uniswap will be the value exchange layer of the Internet. It brought the automated market maker to the masses. It has led the way in the evolution and growth of DeFi and web3. It is censorship resistant, permissionless, decentralized, and secure – constituting a set of properties which we believe should define our world’s financial infrastructure. But there is still a long way to go for Uniswap to reach its full potential. We’re excited to work with all of you to make that happen. If you’re excited too, please read our proposal, comment, reach out to chat (our DMs - @devinawalsh  and @nkennethk  are open!), and spread the word.  Uniswap Foundation Proposal This proposal is being put forth by the Uniswap Foundation, a Delaware corporation formed by Uniswap community members Devin Walsh  and Ken Ng  to facilitate the steps outlined in this proposal.  TL;DR  Today, we are thrilled to propose the creation of the Uniswap Foundation (UF).  Scope: The UF, the first Foundation of a major protocol to go through the community governance process, will support the Protocol’s decentralized growth, reinvigorate governance, and serve as a Protocol advocate.  Team: Devin Walsh will serve as the Executive Director, Ken Ng will serve as Head of Operations, and they will build out a team of 12.  Budget: To fund these efforts, we are requesting:  A $14M Operating budget to cover a full team for 3 years A $60M expanded Uniswap Grants Program (UGP) budget to cover 3+ years We are requesting $74M total, which will be broken into two disbursements, with a first disbursement of $20M.    Governance Participation: We are also requesting 2.5M UNI to participate in governance, primarily through delegation. Through usage of a new smart contract primitive The Franchiser , this UNI will be revocable by the DAO at any time, and cannot be used for any purpose outside of governance.   Uniswap Foundation  Mission In pursuit of a more open and fair financial system, the Uniswap Foundation supports the decentralized growth and sustainability of the Uniswap Protocol and its supporting ecosystem.  Key Activities and OKRs We have listed our starting OKRs below. It’s possible these OKRs will have to change in the future. If they do change in a meaningful way, we will communicate that to the community. Growth: Promoting Decentralization & Growth of the Protocol and Ecosystem  OKR 11298×840 94.6 KB  Governance: Reinvigorating the Uniswap Community Governance Process  OKR 21282×342 36.5 KB  Advocacy: Advocating for the Protocol and amplifying its positive social impact  OKR 31306×328 52.9 KB  Optimism Phase 0 token distribution link here   Year 1 Roadmap Our roadmap for the first year of operations includes but is not limited to the following activities:  Year 1646×825 252 KB  Optimism Collective community Constitution link here   Team Devin Walsh , Executive Director (ED) As ED, Devin will be responsible for setting UF’s strategic vision alongside the Board and driving execution to achieve that vision. Devin has been in crypto since 2016. She has conducted independent research for MIT’s Digital Currency Initiative , worked on decentralized identity at uPort (ConsenSys), and led protocol and venture investments at CoinFund . She has consulted with Edge & Node and cLabs , and led MIRA , a seed stage startup at the intersection of fine art and NFTs. She recently resigned as Chief of Staff at Uniswap Labs in order to propose the creation of the UF. Ken Ng , Head of Operations As Head of Operations, Ken will build and scale processes to maximize the UF’s impact. Ken has served the Uniswap ecosystem as Lead of the Uniswap Grants Program for the past 1.5 years. He has helped run the Ethereum Foundation Ecosystem Support Program , which gave Hayden his initial grant to build Uniswap. He served as COO of Slingshot Finance and cofounder of his nonprofit eduDAO , which helps raise funds for students and teachers in the Bronx. The needs, and thus the makeup, of our team may change over time. However, today we aim to hire for following roles, with a focus on filling the Grants and Governance roles first:  Applications are open today! Check out job descriptions here . As noted by Other Internet , there is also a need for new structures to “facilitate coordination across the complex web of stakeholders” within the Uniswap ecosystem. To provide this much needed coordination, the UF will be committed to working with a variety of independent parties (freelancers, development teams, research fellows, analysts, and more) to achieve many of its objectives.  Advisors The Foundation’s initial advisory team will be made up of the following individuals:   Jesse Walden , Founder and GP, Variant    Julia Rosenberg , Co-Founder, Orca Protocol    Alexis Gauba , Co-Founder, Opyn ; Co-Founder, she256    Hart Lambur , Co-Founder of UMA    In addition to advising UF on strategy and roadmap, this group will, alongside the Executive Director (ED) and Head of Operations,  Provide input on UF’s initial hiring decisions. This may include interviewing potential candidates and sharing feedback with the Committee as it determines its first hires, including its third Board member and at least next three team members. Become temporary signers of the UF multi-sig, which will hold UF funds if and when the proposal is passed, for the sole purpose of executing approved proposals as instructed. This responsibility will be transitioned to UF team members once they are hired.   Board Devin Walsh and Ken Ng will serve as the first two Board members of the UF. Alongside the UF’s Advisors, they will interview and target to hire a third Board member in the first 3 months of operations.  Budget We are requesting $74M in UNI. This funding would be broken down into the following buckets:  $60M for Uniswap Grants Program  Grants spending will be broken down into the below categories. We will revisit and readjust these categories as needed to ensure we continue to deploy resources where they are most impactful. We are proud of the work done by UGP thus far (memorialized in this retrospective ), and are incredibly excited to expand the scope of its work.  We are already in the process of assessing several high impact grant proposals which UGP would be excited to fund, if and when this proposal is passed. Two examples are:  A version of Uniswap v3 written in Cairo, to be deployed on Starknet A prototype of an MEV estimation tool leveraging machine learning techniques built by respected academics in the space  We are also excited to continue funding ongoing work by existing grantees funded by UGP v0.1, including governance experiments and analyses from Other Internet, customer support from Serv.eth, and ETHGlobal hackathons. To ensure community alignment with larger grants disbursements, the UF will put forth an off-chain Snapshot to the community for proposed grants larger than $2M. We believe that this Grants budget will last approximately 3 years but this is subject to change depending upon the number and quality of applicants. We plan to approach the Treasury for additional Grants funds when there are ~6 months of funds remaining.   $14M operating budget to build out a full team of 12 over the next two years.  In order to provide stability to our employees and to sustain the Foundation, we may make a request to the community for additional funding for further out than 3 years when we return to the Treasury at 6-12 months of operations (read more below). Budget estimate looking forward three years is below.  *Inclusive of UNI vesting. In order to incentivize a highly qualified team, the UF will offer competitive compensation packages including both fiat and long-term vesting UNI. To provide full transparency, we will disclose UF financials later this year. **The UF will allocate an additional $2M in funds to cover legal fees in the case of unexpected future litigation.  Fund Disbursements An approval of this proposal is an approval for the full $74M budget requested. We are requesting the funds in two disbursements:   $20M now to cover operating expenses for the next 2 years and grants for 1 year. Assuming a UNI price of $8.14*, this initial request totals to 2,457,002 UNI.   $54M, to be disbursed by the Uniswap Treasury in 6-12 months once the UF has completed the establishment of its legal entity. The UF will publish a post on the forum notifying the community a week prior to putting forth a formal governance proposal for the remaining funds. In other words, because this proposal approves the full amount of funding, we will not go through an additional the Temperature Check and Consensus Check steps to receive this second disbursement.  *To calculate our final UNI request we will use the 30 day TWAP on the day we put forth our Governance Proposal. $8.14 is approximately the 30 day TWAP as of 8/15/2022.  Governance Participation The UF is also requesting 2.5M UNI to participate in governance. These tokens will be delegated to the UF by the Uniswap DAO through a new smart contract design, The Franchiser , which ensures the tokens are only used for delegation, and allows the DAO to claw back the tokens at any time. The UF plans to use these tokens primarily for delegation to community members without the requisite 2.5M UNI to submit a governance proposal, however the UF may also self-delegate the UNI to vote, and to put up its own proposals. The Franchiser was developed by Noah Zinsmeister and was audited by Trail of Bits .  Next Steps We are excited to discuss this proposal with the broader community as it passes through the Request for Comment phase. Should sentiment be positive, a Temperature Check Snapshot poll will be set up on Mon., August 8. If the Temperature Check poll passes, additional feedback will be incorporated before moving forward to the Consensus Check. Additionally, to discuss the proposal and answer your questions, we plan to attend the Uniswap Community call at 4 PM EST on Wed., August 10, and to host a Twitter Spaces on @uniswapgrants at 11 AM EST on Tues., August 16.  Addendum  What is UF’s relationship with other ecosystem entities? The goal of the UF is to be one of many organizations supporting the Protocol. UF’s overarching focus will be on seeding and growing an ecosystem of entities supporting the Protocol.  What is UF’s relationship with Uniswap Labs? The UF is an independent entity whose mandate will be to grow Uniswap’s usage, reinvigorate the governance process, and advocate for the protocol and community. To achieve those goals, it will build its own lean team, and provide grants to, support, and/or work alongside a number of existing and new values- and mission-aligned organizations. Uniswap Labs is one of many organizations in the Uniswap ecosystem. It built, deployed, and, alongside many other teams, will continue to contribute to and build on the Protocol in the future. As a commitment to the proper decentralization of the protocol, Uniswap Labs had previously provided a royalty free perpetual license for V3 and related trademarks to the Uniswap Grants Program and selected grantees at UGP’s discretion. To succeed, the UF will require the ability to grant v3 BSL license exemptions, to maintain the governance forum, Sybil.org , and Protocol-related developer docs, and to help facilitate protocol development across many teams. Labs has given their blessing to this preliminary proposal for asset transition.  What kind of legal entity will UF be? Currently, this proposal is being made by the Uniswap Foundation, a pre-existing Delaware corporation formed by Uniswap community members Devin Walsh and Ken Ng. However, the UF team is conducting extensive research to determine the type of legal entity which best matches our ambitions, including our mission to make a positive social impact. The entity should also give the UF the ability to enter into contracts, open a bank account, and hire employees. Given these requirements, we are contemplating a US-based entity that would seek tax-exempt status. As there is no guarantee that tax-exempt status will be secured, we may make modifications to UF’s structure and operations in the future. We will share more about our path forward with the community as soon as we are able to.  What will happen to the $UNI after it’s sent to the UF? If the proposal passes, funds will be sent to the UF multi-sig, which is custodied by the ED, Head of Operations, and UF Advisors. To provide runway for our team and grantees, we intend to convert all $20M of the initial UNI disbursement to stablecoins and fiat over the first month of operation. We have established relationships with multiple brokers, are also exploring private sale options, and plan to pursue an approach which will minimize UNI price impact. We similarly plan to diversify the remainder of funds in the second disbursement. At least one month prior to transfer, the UF will publish a Foundation Treasury Diversification report for this UNI. In the report, we will detail the amount we plan to diversify, which broker we plan to use, and how we plan to price the UNI sold.  How does UF’s Budget compare with the budgets of similar organizations across web3? The $74M budget represents ~1.05% of the total UNI supply. This is a relatively small percentage of UNI supply compared to the percentage of tokens allocated to Foundation and Grant programs by other protocol teams.  45% of OP tokens have been allocated to an Optimism Ecosystem Fund (25%) and Retroactive public goods funding (20%) (here ) An unpublished portion of ~22% of dYdX were allocated to current and future employees and consultants of the Foundation (here ) ~26% of GRT was allocated to The Graph Foundation, educational programs, and grants (here ) 25% of CELO was allocated to Community and Operational Grants (here ) 12.5% of SOL was allocated to the Solana Foundation (here ) The Ethereum Foundation holds a treasury of $1.6B (here )   What happens to UGP and the UGP Subcommittees? To start, UGP will continue operations as it exists today with the existing Allocation Committee. Once the Grants Lead is hired, they will lead all grants funding decisions and require final approval from either Devin or Ken (⅔ approval required from Grants Lead, Ken, and Devin). UF plans to continue to fund the existing UGP subcommittees as separate, supportive entities. The Stable subcommittee will continue to be made up of Ken and Boris . The UGP Community Analytics subcommittees will continue to be made up of Yj , Fede, RantumBits , Annamira , TZM, and Trea Qura.  How does the UF plan on being sustainable over time? This proposal would fund UF operations for at least 3 years. In the future, we plan to return to the community to increase our operating budget when we approach 18 months of runway. We also predict our grants budget will last approximately 3 years. In the future, we plan to return to the community to increase our grants budget when we approach 6 months of funds remaining.  What is UGP, and how do I find out more about it? The Uniswap Grants Program started after going through a governance vote in December 2020 for an allocation of $1.5M in UNI intended to last 6 months. While the initial set of priorities for UGP was narrowly scoped as an MVP to seed the ecosystem of developers, it has since grown to encompass more, including governance research, community building and education, and core protocol work. Due to the crypto market bull run we were able to give $7M in grants over 18 months. Grants researcher @sovereignsignal also recently put together a fantastic (independent) write-up on the history of the UGP here. For more information on UGP’s past work and grantees check out the following links:   UGP Homepage  (still accepting applications!) UGP Twitter UGP Process Outline UGP RFPs & Challenges  UGP Grantees (h/t @sovereignsignal ) UGP Subcommittees (delegated resource allocators for targeted grants focused within a specific category)   The Stable led by b0r4   UGP Community Analytics led by Yj, Fede, RantumBits, Annamira , TZM, and Trea Qura      What does a successful UGP grant look like? What are some UGP success stories? Grantees have done some incredible work over the past 1.5 years - for more information, check out our recent retrospective  on UGP v0.1. However, most UGP grantees are less than a year old. Just like with any product, it may take some time and several iterations for grant projects to develop traction and see adoption. The first version of Uniswap only worked for a single LP and ETH/ERC20 pair, and looked much different than the Uniswap we know and love today (still live here !). Hardat , too, took time to become what it is today - Nomic Labs received its first grant in 2018. With that being said, not every grant will have the same outcome as a Uniswap or Hardhat. Not every grant will have runaway adoption, just like with any startup. Even when a project does not have the expected or intended impact, it can still have a positive impact on the ecosystem, bringing in new developers, users, and ideas. Grantee success can be a range of impactful outcomes and, although we can’t pick favorites, some notable highlights are:   Serv.eth Discord support - a globally distributed team of 10 supporting the Uniswap Discord server all hours of every day. They have resolved over 15,000 community support tickets (and counting!), from helping users set up their first wallet and making their first trades, to identifying scammers and helping others retrieve funds.  GFX labs cross-chain governance research - The GFX team have been active Uniswap contributors since the beginning — they were one of the first LPs on v3! Their UGP-funded research led to the the Protocol’s first cross-chain governance proposal, the deployment of the 1bps fee tier on Polygon.  Chaos Labs TWAP hardhat plugin - One of Uniswap’s most under-appreciated innovations is the TWAP oracle, a core but admittedly complex DeFi primitive. Chaos Labs recognized the need for more robust tooling and documentation to make integrating TWAPs more accessible. They created a Hardhat plugin so anyone can leverage its robust security and accurate price reporting.  Scopelift Seatbelt & Flexible Voting- Scopelift productionised Seatbelt for governance testing. This test suite not only protects against unverified contracts, but also simulates proposals locally to ensure they deploy results properly. Additionally, their initial work on Flexible Voting would enable governance tokens locked in other protocols (for example, cUNI) to be leveraged for cross-protocol governance voting.  OmniAnalytics uniswappeR - The first R package created to interact with, quickly query, and trade on Uniswap, opening the door for more advanced data analyses. The Omni team went above and beyond their grant scope to deliver video tutorials, extensive documentation, and an easy dashboard generator for in-depth exploration of trade history, LP and price simulations under infinitely customizable conditions including slippage and liquidity depth.  TechEducators Solidity Bootcamp - As an established web2 bootcamp, the team behind ETHAnglia have built an open source Solidity Bootcamp to better usher web2 developers into web3 with a focus on building secure Ethereum dApps. Their target demographic reaches to underserved populations in the UK, offering scholarships and free mentorships. Through this work, they have received recognition and further support from the UK government through the Department for Works and Pensions.   How will UGP be improved within the UF? Even with the success cases listed above, there are a number of ways that we’re excited to improve UGP for the benefit of the ecosystem.   Provide grants to universities and research institutions: Today, UGP is a multisig without a legal entity so we are unable sign contracts with or award grants to universities and academic research institutions, among others. As a legal entity, the UF would allow us to work with these organizations.  Diversify assets: No legal entity also means UGP could not diversify its assets out of UNI due to a lack of clarity around tax liability. This has made it impossible to scope out and provide larger and longer-term grants due to UNI price risk. The ability to diversify our assets will allow us to award these kinds of grants, for more ambitious and impactful projects.  Full-time well-compensated team: UGP v0.1 was able to pay its small group of contributors part-time (≤30 hours per week). With an entity and full budget, the UF will be able to hire a full-time and well-compensated team. We also want to recognize the fact that a few UGP team members would still work 40+ hour weeks and weekends, uncompensated, due to a love for this work!  Upscale all of UGP: With a formal entity, larger budget, and a full-time team, we would be able to improve our internal processes, from the applicant pipeline through feedback cycles, decisions, disbursements, and ongoing grantee management. We can do more in proactive outreach to fill our pipeline with fresh ideas and new teams. We could shine more of a spotlight on the impact grantees have had on the community. We will also be able to scale up our legal and accounting capabilities required for a more comprehensive grants program.  More communication: With a larger team and a Comms/Social Media Lead, the UF would be able to more frequently highlight the work of grantees, as well as its own processes, decision-making frameworks, and operations to the community.   What are the UF’s multisig addresses? The UF Custody multisig is: 0xe571dC7A558bb6D68FfE264c3d7BB98B0C6C73fC The UF Governance multisig is: 0xA37131410A76791f4A0210e91EDD554d85aFb4d4 Linking to comments in Temp check for outstanding questions, we hit the character limit!  What kinds of Grants would an expanded UGP be able to provide?     [Temperature Check] Create the Uniswap Foundation Temperature Check       Hey Dan - Ken just added a lot more info about UGP and how we want to improve it as a comment below, and I’m about to add that to the Addendum of the Proposal as well for the Consensus Check. UGP won’t be sunset, it will operate under the UF and scale up its resources and team.  As for the kinds of ambitious projects we would now be excited to fund? Listing many below, but we’re just as excited to be blown away by new ideas the community dreams up.   Novel incentive programs, like a developer mi…      What types of candidates are you seeking for 3rd board member?     [Temperature Check] Create the Uniswap Foundation Temperature Check       Re: UGP. Thank you for the comments here! (For others: Ken and I are also writing up some additional history and information about UGP to add as a comment in the forum later today and to the addendum in the next version of the proposal!)  Re: governance. Agree! And a proposed governance process revamp is definitely in scope for our first 3 months (inspired by this post, with additional community feedback)  I’ll publish answers to the rest of your questions in line:   The biggest thing that stood…      Can you provide more information about the Grants funding allocation for novel incentive mechanisms?     [Temperature Check] Create the Uniswap Foundation Temperature Check       Re: UGP. Thank you for the comments here! (For others: Ken and I are also writing up some additional history and information about UGP to add as a comment in the forum later today and to the addendum in the next version of the proposal!)  Re: governance. Agree! And a proposed governance process revamp is definitely in scope for our first 3 months (inspired by this post, with additional community feedback)  I’ll publish answers to the rest of your questions in line:   The biggest thing that stood…      How did you decide to set OKRs the way they are set in this proposal?     [Temperature Check] Create the Uniswap Foundation Temperature Check       This is a fair point. Ken and I have went back and forth a lot on the best way to set OKRs. The first set of OKRs we wrote for the UF focused on increased volume, number of new users and developers in the space, number of “high impact, high engagement” governance proposals, etc. These are the results which all of our work would aim to have.  However, we got stuck is defining the “right” numbers to tie to those results- how much volume might increase, when (it might take a talented dev team time …      How does the fee switch play into the UF’s roadmap?     [Temperature Check] Create the Uniswap Foundation Temperature Check       It would be well within the scope of the UF to welcome, encourage, and provide grants to research and analysis on the fee switch, and to promote better education around the mechanics of fee switch implementation.  It would also be well within the scope of the UF to assist the community in decision-making regarding the fee switch, including putting out information regarding any polls or governance proposals regarding the fee switch (just as we intend to for all other governance proposals). It’s b…     If this proposal is passed, we and the Foundation shall undertake our work abiding by the covenant of good faith and fair dealing. It is the Foundation’s current intent to use the disbursement in accordance with the terms of, and achieve the results described in, this Proposal. However, it is not possible to predict the course of future events, and thus actual uses and results may vary. If material changes to the operations of the Uniswap Foundation are required, we intend to put forth a subsequent vote to the community prior to making those changes. Subject to any future agreement by the DAO to the contrary, the Foundation will hold the DAO and its members harmless with respect to any liabilities or damages assessed against the Foundation or its personnel based upon the making of the disbursement, the Foundation’s or its personnel’s use of the disbursed tokens or any other activities undertaken by the Foundation or its personnel in furtherance of the foregoing, other than liabilities or damages arising out of the DAO’s fraud, willful misconduct or criminal activity. Disclosure: Devin and Ken both hold UNI tokens. To the extent that readers find it relevant, Devin also holds a small amount of Uniswap Labs equity. ",
                    "links": [
                        "https://gov.uniswap.org/t/temperature-check-create-the-uniswap-foundation/17358",
                        "https://snapshot.org/#/uniswap/proposal/0xee4851601143b1e9655be7168ca2d0f119fba31afadf2a7f808ea12b7bb4e9df",
                        "https://gov.uniswap.org/t/consensus-check-create-the-uniswap-foundation/17457",
                        "https://snapshot.org/#/uniswap/proposal/0xd70b3e84db501c2633bc8189fcfc335726fce90584a3c37f6155580369f11023",
                        "https://twitter.com/Uniswap/status/1529102980296867842",
                        "https://dune.com/rchen8/defi-users-over-time",
                        "https://twitter.com/Clara_Medalie/status/1549048362489741313",
                        "https://uniswap.org/blog/uni",
                        "https://mirror.xyz/kennethng.eth/0WHWvyE4Fzz50aORNg3ixZMlvFjZ7frkqxnY4UIfZxo",
                        "https://twitter.com/devinawalsh",
                        "https://twitter.com/nkennethk",
                        "https://twitter.com/devinawalsh",
                        "https://twitter.com/nkennethk",
                        "https://github.com/NoahZinsmeister/franchiser",
                        "https://global.discourse-cdn.com/business6/uploads/uniswap1/original/2X/6/619bc0745412b267da6d9b54787fc42bbd325493.png",
                        "https://global.discourse-cdn.com/business6/uploads/uniswap1/original/2X/c/c8b88b9477f9c2c81ab5457cca4e9552781b3bf6.png",
                        "https://global.discourse-cdn.com/business6/uploads/uniswap1/original/2X/1/140c46d1c2e79f9e6dab44fbfb65826e578e3a59.png",
                        "https://community.optimism.io/docs/governance/gov-fund/",
                        "https://global.discourse-cdn.com/business6/uploads/uniswap1/original/2X/0/0b9a3fb2b8ad0bb2eb400d0cdb1d391ee5ef9f06.png",
                        "https://gov.optimism.io/t/working-constitution-of-the-optimism-collective/55",
                        "https://twitter.com/devinawalsh",
                        "https://dci.mit.edu/",
                        "https://www.uport.me/",
                        "https://www.coinfund.io/",
                        "https://edgeandnode.com/",
                        "https://clabs.co/",
                        "https://miraimaging.com/",
                        "https://twitter.com/nkennethk",
                        "https://www.unigrants.org/",
                        "https://esp.ethereum.foundation/",
                        "https://blog.ethereum.org/2018/08/17/ethereum-foundation-grants-update-wave-3/",
                        "https://slingshot.finance/",
                        "https://www.edudao.org/",
                        "https://jobs.lever.co/uniswapfoundation",
                        "https://otherinter.net/research/uniswap-governance-findings/",
                        "https://twitter.com/jessewldn",
                        "https://variant.fund/",
                        "https://twitter.com/JulzRoze",
                        "https://www.orcaprotocol.org/",
                        "https://twitter.com/AlexisGauba",
                        "https://www.opyn.co/",
                        "https://she256.org/",
                        "https://twitter.com/hal2001",
                        "https://umaproject.org/",
                        "https://mirror.xyz/kennethng.eth/0WHWvyE4Fzz50aORNg3ixZMlvFjZ7frkqxnY4UIfZxo",
                        "https://github.com/NoahZinsmeister/franchiser",
                        "https://twitter.com/NoahZinsmeister",
                        "https://www.trailofbits.com/",
                        "http://sybil.org/",
                        "https://community.optimism.io/docs/governance/allocations/#allocations-at-a-glance",
                        "https://docs.dydx.community/dydx-governance/start-here/dydx-allocations",
                        "https://thegraph.com/blog/announcing-the-graphs-grt-sale",
                        "https://medium.com/celoorg/understanding-cgld-allocation-estimated-circulating-supply-over-time-f08a063a23ad",
                        "https://messari.io/asset/solana/profile/launch-and-initial-token-distribution",
                        "https://ethereum.foundation/report-2022-04.pdf",
                        "https://www.notion.so/3430a00270ea4d79be5c70d4ca99680a?v=b7b7697e1ff44055b87a6bd3480a3b2d&p=ed5d138f443d4c13997bf1572cfbd2e7",
                        "https://twitter.com/B0R444",
                        "https://twitter.com/uniyj1",
                        "https://twitter.com/Fly_Ams",
                        "https://twitter.com/RantumBits",
                        "https://twitter.com/annamirajo",
                        "https://twitter.com/Treaqura",
                        "https://gov.uniswap.org/t/rfc-uniswap-grants-program-v0-1/9081",
                        "https://twitter.com/sovereignsignal",
                        "https://sovereignsignal.substack.com/p/breaking-down-the-uniswap-grants",
                        "https://www.notion.so/Welcome-to-UNI-Grants-6e3e84967a984a5fb127ae749649ddc9",
                        "https://twitter.com/uniswapgrants",
                        "https://www.notion.so/5b34ef6b77964960844a86daeb4d9a26",
                        "https://www.notion.so/RFPs-Challenges-3be614ba4e504b5caeee7b0159e64a42",
                        "https://www.notion.so/8e8ba8344967488a85106309d48a4a3a",
                        "https://twitter.com/sovereignsignal",
                        "https://www.notion.so/The-Stable-the-first-30-days-b3826f0cae964b1aa3a02e3188e2cd4f",
                        "https://twitter.com/B0R444",
                        "https://www.notion.so/b09bbb16579d4a569b7e2d393afc4459",
                        "https://twitter.com/uniyj1",
                        "https://twitter.com/Fly_Ams",
                        "https://twitter.com/RantumBits",
                        "https://twitter.com/annamirajo",
                        "https://twitter.com/Treaqura",
                        "https://mirror.xyz/kennethng.eth/0WHWvyE4Fzz50aORNg3ixZMlvFjZ7frkqxnY4UIfZxo",
                        "https://haydenadams.github.io/uniswap-retro/",
                        "https://hardhat.org/",
                        "https://serveth.support/",
                        "https://gfx.xyz/",
                        "https://app.uniswap.org/#/vote/2/14?chain=mainnet",
                        "https://chaoslabs.xyz/",
                        "https://github.com/ChaosLabsInc/uniswap-v3-oracle-cli",
                        "https://chaoslabs.xyz/posts/chaos-labs-uniswap-v3-twap-deep-dive-pt-1",
                        "https://www.scopelift.co/",
                        "https://github.com/Uniswap/governance-seatbelt",
                        "https://gov.uniswap.org/t/temperature-check-upgrading-to-a-flexible-voting-enabled-governor/17098",
                        "https://omnianalytics.org/",
                        "https://github.com/Omni-Analytics-Group/uniswappeR",
                        "https://m.youtube.com/watch?v=GpWZLMB2lvM",
                        "https://github.com/Omni-Analytics-Group/uniswappeR",
                        "https://github.com/Omni-Analytics-Group/uniswappeR-dashboarding",
                        "https://techeducators.co.uk/",
                        "https://gov.uniswap.org/t/temperature-check-create-the-uniswap-foundation/17358/37",
                        "https://gov.uniswap.org/t/temperature-check-create-the-uniswap-foundation/17358/33",
                        "https://gov.uniswap.org/t/proposed-simplifications-to-the-uniswap-governance-process/15906",
                        "https://gov.uniswap.org/t/temperature-check-create-the-uniswap-foundation/17358/33",
                        "https://gov.uniswap.org/t/proposed-simplifications-to-the-uniswap-governance-process/15906",
                        "https://gov.uniswap.org/t/temperature-check-create-the-uniswap-foundation/17358/23",
                        "https://gov.uniswap.org/t/temperature-check-create-the-uniswap-foundation/17358/16",
                        "https://gov.uniswap.org/t/rfc-update-community-governance-process-changes/19718",
                        "https://gov.uniswap.org/t/rfc-community-governance-process-changes/18060"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.770009637641602
                }
            ]
        },
        {
            "thread_link": "https://gov.uniswap.org/t/temperature-check-create-the-uniswap-foundation/17358",
            "title": "[Temperature Check] Create the Uniswap Foundation ",
            "index": 17358,
            "category": [
                "Temperature Check"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/devinwalsh",
                    "index": "1",
                    "likes": "19",
                    "time": "04/08/2022-15:00:35",
                    "content": " Uniswap Foundation: Preamble Uniswap has already changed the world. In only 3 years, the world’s first automated market maker has pioneered DeFi primitives, supported more than $1T in cumulative volume, and served millions of users worldwide. Its daily volume today is on par with Coinbase. Ownership of the protocol was transferred to the community in 2020 and since then the Uniswap Grants Program (UGP) has demonstrated the potential for community-funded initiatives to make a positive impact. Over 1.5 years, UGP has funded 120+ grantees improving governance, and developing new interfaces and developer tooling. However, there is still work to do to help Uniswap reach its full potential. The governance process has too much friction, the ecosystem is too difficult to navigate, and UGP in its current form is not able to fund the most ambitious and impactful projects. We want to change that. Today, we are excited to propose the creation of the Uniswap Foundation, which has the mission to support the decentralized growth and sustainability of the Uniswap Protocol and its supporting ecosystem and community. In other words, the goal of the Uniswap Foundation is to support you. Uniswap’s community is expansive, encompassing the universe of individuals and organizations which build on and benefit from decentralized protocols. Your contributions have already made Uniswap a success, but we want to help you accomplish much more. The Uniswap Foundation (UF) will provide grants to builders, researchers, organizers, academics, analysts, and more to grow the Protocol and plan for its future. It will make it easier to govern the protocol and community treasury, and to navigate the broader ecosystem. It will help you make an impact – to reduce friction, and amplify your efforts. We believe that Uniswap will be the value exchange layer of the Internet. It brought the automated market maker to the masses. It has led the way in the evolution and growth of DeFi and web3. It is censorship resistant, permissionless, decentralized, and secure – constituting a set of properties which we believe should define our world’s financial infrastructure. But there is still a long way to go for Uniswap to reach its full potential. We’re excited to work with all of you to make that happen. If you’re excited too, please read our proposal, comment, reach out to chat (our DMs - @devinawalsh and @nkennethk are open!), and spread the word.  Uniswap Foundation Proposal This proposal is being put forth by the Uniswap Foundation, a Delaware corporation formed by Uniswap community members Devin Walsh and Ken Ng to facilitate the steps outlined in this proposal.  TL;DR  Today, we are thrilled to propose the creation of the Uniswap Foundation (UF).  Scope: The UF, the first Foundation of a major protocol to go through the community governance process, will support the Protocol’s decentralized growth, reinvigorate governance, and serve as a Protocol advocate.  Team: Devin Walsh will serve as the Executive Director, Ken Ng will serve as Head of Operations, and they will build out a team of 12.  Budget: To fund these efforts, we are requesting:  A $14M Operating budget to cover a full team for 3 years A $60M expanded Uniswap Grants Program (UGP) budget to cover 3+ years We are requesting $74M total, which will be broken into two disbursements, with a first disbursement of $20M.    Governance Participation: We are also requesting 2.5M UNI to participate in governance, primarily through delegation. Through usage of a new smart contract primitive The Franchiser, this UNI will be revocable by the DAO at any time, and cannot be used for any purpose outside of governance.   Uniswap Foundation  Mission In pursuit of a more open and fair financial system, the Uniswap Foundation supports the decentralized growth and sustainability of the Uniswap Protocol and its supporting ecosystem.  Key Activities and OKRs We have listed our starting OKRs below. It’s possible these OKRs will have to change in the future. If they do change in a meaningful way, we will communicate that to the community. Growth: Promoting Decentralization & Growth of the Protocol and Ecosystem  OKR 11298×840 94.6 KB  Governance: Reinvigorating the Uniswap Community Governance Process  OKR 21282×342 36.5 KB  Advocacy: Advocating for the Protocol and amplifying its positive social impact  OKR 31306×328 52.9 KB  Optimism Phase 0 token distribution link here  Year 1 Roadmap Our roadmap for the first year of operations includes but is not limited to the following activities:  Year 1646×825 252 KB  Optimism Collective community Constitution link here  Team Devin Walsh, Executive Director (ED) As ED, Devin will be responsible for setting UF’s strategic vision alongside the Board and driving execution to achieve that vision. Devin has been in crypto since 2016. She has conducted independent research for MIT’s Digital Currency Initiative, worked on decentralized identity at uPort (ConsenSys), and led protocol and venture investments at CoinFund. She has consulted with Edge & Node and cLabs, and led MIRA, a seed stage startup at the intersection of fine art and NFTs. She recently resigned as Chief of Staff at Uniswap Labs in order to propose the creation of the UF. Ken Ng, Head of Operations As Head of Operations, Ken will build and scale processes to maximize the UF’s impact. Ken has served the Uniswap ecosystem as Lead of the Uniswap Grants Program for the past 1.5 years. He has helped run the Ethereum Foundation Ecosystem Support Program, which gave Hayden his initial grant to build Uniswap. He served as COO of Slingshot Finance and cofounder of his nonprofit eduDAO, which helps raise funds for students and teachers in the Bronx. The needs, and thus the makeup, of our team may change over time. However, today we aim to hire for following roles, with a focus on filling the Grants and Governance roles first:  Applications are open today! Check out job descriptions here. As noted by Other Internet, there is also a need for new structures to “facilitate coordination across the complex web of stakeholders” within the Uniswap ecosystem. To provide this much needed coordination, the UF will be committed to working with a variety of independent parties (freelancers, development teams, research fellows, analysts, and more) to achieve many of its objectives.  Advisors The Foundation’s initial advisory team will be made up of the following individuals:   Jesse Walden, Founder and GP, Variant   Julia Rosenberg, Co-Founder, Orca Protocol   Alexis Gauba, Co-Founder, Opyn; Co-Founder, she256   Hart Lambur, Co-Founder of UMA   In addition to advising UF on strategy and roadmap, this group will, alongside the Executive Director (ED) and Head of Operations,  Provide input on UF’s initial hiring decisions. This may include interviewing potential candidates and sharing feedback with the Committee as it determines its first hires, including its third Board member and at least next three team members. Become temporary signers of the UF multi-sig, which will hold UF funds if and when the proposal is passed, for the sole purpose of executing approved proposals as instructed. This responsibility will be transitioned to UF team members once they are hired.   Board Devin Walsh and Ken Ng will serve as the first two Board members of the UF. Alongside the UF’s Advisors, they will interview and target to hire a third Board member in the first 3 months of operations.  Budget We are requesting $74M in UNI. This funding would be broken down into the following buckets:  $60M for Uniswap Grants Program  Grants spending will be broken down into the below categories. We will revisit and readjust these categories as needed to ensure we continue to deploy resources where they are most impactful. We are proud of the work done by UGP thus far (memorialized in this retrospective), and are incredibly excited to expand the scope of its work.  We are already in the process of assessing several high impact grant proposals which UGP would be excited to fund, if and when this proposal is passed. Two examples are:  A version of Uniswap v3 written in Cairo, to be deployed on Starknet A prototype of an MEV estimation tool leveraging machine learning techniques built by respected academics in the space  We are also excited to continue funding ongoing work by existing grantees funded by UGP v0.1, including governance experiments and analyses from Other Internet, customer support from Serv.eth, and ETHGlobal hackathons. To ensure community alignment with larger grants disbursements, the UF will put forth an off-chain Snapshot to the community for proposed grants larger than $2M. We believe that this Grants budget will last approximately 3 years but this is subject to change depending upon the number and quality of applicants. We plan to approach the Treasury for additional Grants funds when there are ~6 months of funds remaining.   $14M operating budget to build out a full team of 12 over the next two years.  In order to provide stability to our employees and to sustain the Foundation, we may make a request to the community for additional funding for further out than 3 years when we return to the Treasury at 6-12 months of operations (read more below). Budget estimate looking forward three years is below.  *Inclusive of UNI vesting. In order to incentivize a highly qualified team, the UF will offer competitive compensation packages including both fiat and long-term vesting UNI. To provide full transparency, we will disclose UF financials later this year. **The UF will allocate an additional $2M in funds to cover legal fees in the case of unexpected future litigation.  Fund Disbursements An approval of this proposal is an approval for the full $74M budget requested. We are requesting the funds in two disbursements:   $20M now to cover operating expenses for the next 2 years and grants for 1 year. Assuming a UNI price of $7.04*, this initial request totals to 2,840,909 UNI.   $54M, to be disbursed by the Uniswap Treasury in 6-12 months once the UF has completed the establishment of its legal entity. The UF will publish a post on the forum notifying the community a week prior to putting forth a formal governance proposal for the remaining funds. In other words, because this proposal approves the full amount of funding, we will not go through an additional the Temperature Check and Consensus Check steps to receive this second disbursement.  *To calculate our final UNI request we will use the 30 day TWAP on the day we put forth our Governance Proposal. $7.04 is approximately the 30 day TWAP as of 8/3/2022.  Governance Participation The UF is also requesting 2.5M UNI to participate in governance. These tokens will be delegated to the UF by the Uniswap DAO through a new smart contract design, The Franchiser, which ensures the tokens are only used for delegation, and allows the DAO to claw back the tokens at any time. The UF plans to use these tokens primarily for delegation to community members without the requisite 2.5M UNI to submit a governance proposal, however the UF may also self-delegate the UNI to vote, and to put up its own proposals. The Franchiser was developed by Noah Zinsmeister and was audited by Trail of Bits.  Next Steps We are excited to discuss this proposal with the broader community as it passes through the Request for Comment phase. Should sentiment be positive, a Temperature Check Snapshot poll will be set up on Mon., August 8. If the Temperature Check poll passes, additional feedback will be incorporated before moving forward to the Consensus Check. Additionally, to discuss the proposal and answer your questions, we plan to attend the Uniswap Community call at 4 PM EST on Wed., August 10, and to host a Twitter Spaces on @uniswapgrants at 11 AM EST on Mon., August 15.  Addendum  What is UF’s relationship with other ecosystem entities? The goal of the UF is to be one of many organizations supporting the Protocol. UF’s overarching focus will be on seeding and growing an ecosystem of entities supporting the Protocol.  What is UF’s relationship with Uniswap Labs? The UF is an independent entity whose mandate will be to grow Uniswap’s usage, reinvigorate the governance process, and advocate for the protocol and community. To achieve those goals, it will build its own lean team, and provide grants to, support, and/or work alongside a number of existing and new values- and mission-aligned organizations. Uniswap Labs is one of many organizations in the Uniswap ecosystem. It built, deployed, and, alongside many other teams, will continue to contribute to and build on the Protocol in the future. As a commitment to the proper decentralization of the protocol, Uniswap Labs had previously provided a royalty free perpetual license for V3 and related trademarks to the Uniswap Grants Program and selected grantees at UGP’s discretion. To succeed, the UF will require the ability to grant v3 BSL license exemptions, to maintain the governance forum, Sybil.org, and Protocol-related developer docs, and to help facilitate protocol development across many teams. Labs has given their blessing to this preliminary proposal for asset transition.  What kind of legal entity will UF be? Currently, this proposal is being made by the Uniswap Foundation, a pre-existing Delaware corporation formed by Uniswap community members Devin Walsh and Ken Ng. However, the UF team is conducting extensive research to determine the type of legal entity which best matches our ambitions, including our mission to make a positive social impact. The entity should also give the UF the ability to enter into contracts, open a bank account, and hire employees. Given these requirements, we are contemplating a US-based entity that would seek tax-exempt status. As there is no guarantee that tax-exempt status will be secured, we may make modifications to UF’s structure and operations in the future. We will share more about our path forward with the community as soon as we are able to.  What will happen to the $UNI after it’s sent to the UF? If the proposal passes, funds will be sent to the UF multi-sig, which is custodied by the ED, Head of Operations, and UF Advisors. To provide runway for our team and grantees, we intend to convert all $20M of the initial UNI disbursement to stablecoins and fiat over the first month of operation. We have established relationships with multiple brokers, are also exploring private sale options, and plan to pursue an approach which will minimize UNI price impact. We similarly plan to diversify the remainder of funds in the second disbursement. At least one month prior to transfer, the UF will publish a Foundation Treasury Diversification report for this UNI. In the report, we will detail the amount we plan to diversify, which broker we plan to use, and how we plan to price the UNI sold.  How does UF’s Budget compare with the budgets of similar organizations across web3? The $74M budget represents ~1.05% of the total UNI supply. This is a relatively small percentage of UNI supply compared to the percentage of tokens allocated to Foundation and Grant programs by other protocol teams.  45% of OP tokens have been allocated to an Optimism Ecosystem Fund (25%) and Retroactive public goods funding (20%) (here) An unpublished portion of ~22% of dYdX were allocated to current and future employees and consultants of the Foundation (here) ~26% of GRT was allocated to The Graph Foundation, educational programs, and grants (here) 25% of CELO was allocated to Community and Operational Grants (here) 12.5% of SOL was allocated to the Solana Foundation (here) The Ethereum Foundation holds a treasury of $1.6B (here)   What happens to UGP and the UGP Subcommittees? To start, UGP will continue operations as it exists today with the existing Allocation Committee. Once the Grants Lead is hired, they will lead all grants funding decisions and require final approval from either Devin or Ken (⅔ approval required from Grants Lead, Ken, and Devin). UF plans to continue to fund the existing UGP subcommittees as separate, supportive entities. The Stable subcommittee will continue to be made up of Ken and Boris. The UGP Community Analytics subcommittees will continue to be made up of Yj, Fede, RantumBits, Annamira, TZM, and Trea Qura.  How does the UF plan on being sustainable over time? This proposal would fund UF operations for at least 3 years. In the future, we plan to return to the community to increase our operating budget when we approach 18 months of runway. We also predict our grants budget will last approximately 3 years. In the future, we plan to return to the community to increase our grants budget when we approach 6 months of funds remaining. If this proposal is passed, we and the Foundation shall undertake our work abiding by the covenant of good faith and fair dealing. It is the Foundation’s current intent to use the disbursement in accordance with the terms of, and achieve the results described in, this Proposal. However, it is not possible to predict the course of future events, and thus actual uses and results may vary. If material changes to the operations of the Uniswap Foundation are required, we intend to put forth a subsequent vote to the community prior to making those changes. Subject to any future agreement by the DAO to the contrary, the Foundation will hold the DAO and its members harmless with respect to any liabilities or damages assessed against the Foundation or its personnel based upon the making of the disbursement, the Foundation’s or its personnel’s use of the disbursed tokens or any other activities undertaken by the Foundation or its personnel in furtherance of the foregoing, other than liabilities or damages arising out of the DAO’s fraud, willful misconduct or criminal activity. Disclosure: Devin and Ken both hold UNI tokens. To the extent that readers find it relevant, Devin also holds a small amount of Uniswap Labs equity. ",
                    "links": [
                        "https://dune.com/rchen8/defi-users-over-time",
                        "https://twitter.com/Clara_Medalie/status/1549048362489741313",
                        "https://uniswap.org/blog/uni",
                        "https://mirror.xyz/kennethng.eth/0WHWvyE4Fzz50aORNg3ixZMlvFjZ7frkqxnY4UIfZxo",
                        "https://twitter.com/devinawalsh",
                        "https://twitter.com/nkennethk",
                        "https://twitter.com/devinawalsh",
                        "https://twitter.com/nkennethk",
                        "https://github.com/NoahZinsmeister/franchiser",
                        "https://global.discourse-cdn.com/business6/uploads/uniswap1/original/2X/6/619bc0745412b267da6d9b54787fc42bbd325493.png",
                        "https://global.discourse-cdn.com/business6/uploads/uniswap1/original/2X/c/c8b88b9477f9c2c81ab5457cca4e9552781b3bf6.png",
                        "https://global.discourse-cdn.com/business6/uploads/uniswap1/original/2X/1/140c46d1c2e79f9e6dab44fbfb65826e578e3a59.png",
                        "https://community.optimism.io/docs/governance/gov-fund/",
                        "https://global.discourse-cdn.com/business6/uploads/uniswap1/original/2X/0/0b9a3fb2b8ad0bb2eb400d0cdb1d391ee5ef9f06.png",
                        "https://gov.optimism.io/t/working-constitution-of-the-optimism-collective/55",
                        "https://twitter.com/devinawalsh",
                        "https://dci.mit.edu/",
                        "https://www.uport.me/",
                        "https://www.coinfund.io/",
                        "https://edgeandnode.com/",
                        "https://clabs.co/",
                        "https://miraimaging.com/",
                        "https://twitter.com/nkennethk",
                        "https://www.unigrants.org/",
                        "https://esp.ethereum.foundation/",
                        "https://blog.ethereum.org/2018/08/17/ethereum-foundation-grants-update-wave-3/",
                        "https://slingshot.finance/",
                        "https://www.edudao.org/",
                        "https://jobs.lever.co/uniswapfoundation",
                        "https://otherinter.net/research/uniswap-governance-findings/",
                        "https://twitter.com/jessewldn",
                        "https://variant.fund/",
                        "https://twitter.com/JulzRoze",
                        "https://www.orcaprotocol.org/",
                        "https://twitter.com/AlexisGauba",
                        "https://www.opyn.co/",
                        "https://she256.org/",
                        "https://twitter.com/hal2001",
                        "https://umaproject.org/",
                        "https://mirror.xyz/kennethng.eth/0WHWvyE4Fzz50aORNg3ixZMlvFjZ7frkqxnY4UIfZxo",
                        "https://github.com/NoahZinsmeister/franchiser",
                        "https://twitter.com/NoahZinsmeister",
                        "https://www.trailofbits.com/",
                        "http://Sybil.org",
                        "https://community.optimism.io/docs/governance/allocations/#allocations-at-a-glance",
                        "https://docs.dydx.community/dydx-governance/start-here/dydx-allocations",
                        "https://thegraph.com/blog/announcing-the-graphs-grt-sale",
                        "https://medium.com/celoorg/understanding-cgld-allocation-estimated-circulating-supply-over-time-f08a063a23ad",
                        "https://messari.io/asset/solana/profile/launch-and-initial-token-distribution",
                        "https://ethereum.foundation/report-2022-04.pdf",
                        "https://www.notion.so/3430a00270ea4d79be5c70d4ca99680a?v=b7b7697e1ff44055b87a6bd3480a3b2d&p=ed5d138f443d4c13997bf1572cfbd2e7",
                        "https://twitter.com/B0R444",
                        "https://twitter.com/uniyj1",
                        "https://twitter.com/Fly_Ams",
                        "https://twitter.com/RantumBits",
                        "https://twitter.com/annamirajo",
                        "https://twitter.com/Treaqura",
                        "https://gov.uniswap.org/t/consensus-check-create-the-uniswap-foundation/17457",
                        "https://gov.uniswap.org/t/governance-proposal-create-the-uniswap-foundation/17499",
                        "https://gov.uniswap.org/t/consensus-check-fee-switch-pilot/17384/13"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.576497925685425
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Buckerino",
                    "index": "2",
                    "likes": "7",
                    "time": "04/08/2022-15:42:45",
                    "content": "I think this proposal represents much needed progress of our journey as a community going forward. The budget is not an overarching issue as the post has stated multiple other foundations have asked for a lot more. Overall, I do think this proposal is a huge plus going forward mainly with the open call for the community regarding open positions. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6342592592592595
                },
                {
                    "author_link": "https://gov.uniswap.org/u/pennblockchain",
                    "index": "3",
                    "likes": "8",
                    "time": "04/08/2022-15:53:48",
                    "content": "Hello Uniswap Foundation! We have really enjoyed seeing this proposal being fleshed out and are incredibly satisfied with the final proposal/temp check! We are very confident in the team and are also incredibly optimistic for the future specifically with respect to governance. We look forward to getting more involved on this front and would love to contribute!  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.296875
                },
                {
                    "author_link": "https://gov.uniswap.org/u/peko",
                    "index": "4",
                    "likes": "2",
                    "time": "04/08/2022-16:01:10",
                    "content": "A decentralised smart contract does not require a centralised team to thrive or function. Uniswap’s goal should be 0 fees and to act as a public good. Middle man fee skimming and  nepotism is what brought the economy and socioeconomic to its current state. Let’s not repeat the mistakes and greed of the past and add value to ethereum as a whole instead which is to be the ultimate decentralised money and not a fee skimming machine. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.540178571428571
                },
                {
                    "author_link": "https://gov.uniswap.org/u/happyending",
                    "index": "5",
                    "likes": "0",
                    "time": "04/08/2022-16:02:43",
                    "content": "The proposal looks thorough and I am largely in favor of the Uni community having a separate, community-elected team to supercharge its future growth. However, given that there have been a lot of discussions around fee switch, I am wondering whether experimenting with fee switch and doing research around how to best implement fee switch is a part of your roadmap? And if yes, what’s the plan around it? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.023809523809524
                },
                {
                    "author_link": "https://gov.uniswap.org/u/UniScott",
                    "index": "6",
                    "likes": "1",
                    "time": "04/08/2022-16:08:42",
                    "content": "Uniswap does not need a Foundation. The grant process is already opaque and lopsided. The budget drains treasury funds that should be attributable to token holders. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Buckerino",
                    "index": "7",
                    "likes": "3",
                    "time": "04/08/2022-16:11:36",
                    "content": "Do you remember the situation with Optimism? Uniswap Treasury had one million OP tokens left unclaimed. Who was the person responsible to make the claim? Nobody knew. Was it the Labs? They should not be representing the DAO. Was it the UGP? Is it in their scope of responsibility to be doing such things? That´s what I´d call opaque…and we are talking about 1M USD just left there. The Uniswap Community absolutely requires someone to work in its interest. This should bring overall long term value to the token holders as well. Otherwise, situations akin to the OP one will only snowball further. Another notable mentions: Polygon liquidity mining rewards… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.425
                },
                {
                    "author_link": "https://gov.uniswap.org/u/happyending",
                    "index": "8",
                    "likes": "1",
                    "time": "04/08/2022-16:24:35",
                    "content": "One more thing: It seems that the proposed foundation is overlapping with the Uniswap labs team on a lot of tasks (protocol R&D, implementation, interfaces, etc). What’s the relationship between the Uniswap labs team and the foundation? Wouldn’t these tasks be best completed by the Uniswap team rather than the foundation given that they have more experience on this as the founding members of the protocol? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.333333333333332
                },
                {
                    "author_link": "https://gov.uniswap.org/u/eek637",
                    "index": "9",
                    "likes": "3",
                    "time": "04/08/2022-16:43:35",
                    "content": "There’s a whole section titled “What is UF’s relationship with Uniswap Labs”. I’m not a Labs employee or shareholder, but in general, it is a private company whose roadmap can vary based on how they best see fit to allocate their resources with no obligation to continue working on Uniswap. The UF’s roadmap will vary on how they best see fit to allocate their resources in the service of the Uniswap protocol. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.178571428571429
                },
                {
                    "author_link": "https://gov.uniswap.org/u/UniScott",
                    "index": "10",
                    "likes": "0",
                    "time": "04/08/2022-16:48:18",
                    "content": "That’s a good point. So, 1M definitely accounted for with a Foundation. That’s great. If you noticed, they are asking for over 70M dollars. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/devinwalsh",
                    "index": "11",
                    "likes": "2",
                    "time": "04/08/2022-17:24:36",
                    "content": "Thank you! Yes, we’ve very excited to bring on current community members onto the team, if the proposal passes. Anyone can take a look at open roles and apply today - Uniswap Foundation ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.8125
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Buckerino",
                    "index": "12",
                    "likes": "3",
                    "time": "04/08/2022-17:30:00",
                    "content": "Polygons liquidity mining campaign was worth 20M USD. Initially, no liq. mining campaign happened until community members started urging Mihaylo to live up to his promises. There are bound to be other examples down the road and if nobody is responsible to take care of these things then the loss will snowball harder than the budget of the UF. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.182720057720058
                },
                {
                    "author_link": "https://gov.uniswap.org/u/mgomes",
                    "index": "13",
                    "likes": "2",
                    "time": "04/08/2022-18:34:24",
                    "content": "Nice proposal. It is interesting to have another entity that contributes to Uniswap and helps to shift the balance of power which imo leans too much towards uniswap labs. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.166666666666667
                },
                {
                    "author_link": "https://gov.uniswap.org/u/UniswapConcern",
                    "index": "14",
                    "likes": "1",
                    "time": "04/08/2022-18:53:20",
                    "content": "What I don’t understand is who owns the equity in this newly formed foundation? Is it Labs, Devin or someone else? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.681818181818182
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Cortina",
                    "index": "15",
                    "likes": "1",
                    "time": "04/08/2022-19:22:32",
                    "content": "I think the OKR’s need to be rewritten both to ensure accountability to token holders and for the foundation to eventually defend itself against skeptical token holders. The primary key result metrics, as I read them, are % allocation of the budget. These could be achieved with the stroke of a pen regardless of the effectiveness of resource allocation. While the proportions are useful to communicate, they are not helpful for evaluation. It is a bit concerning that they were written this way because it implies that the spending of funds is primary rather than return on investment. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6000000000000005
                },
                {
                    "author_link": "https://gov.uniswap.org/u/devinwalsh",
                    "index": "16",
                    "likes": "2",
                    "time": "04/08/2022-19:37:10",
                    "content": "It would be well within the scope of the UF to welcome, encourage, and provide grants to research and analysis on the fee switch, and to promote better education around the mechanics of fee switch implementation.  It would also be well within the scope of the UF to assist the community in decision-making regarding the fee switch, including putting out information regarding any polls or governance proposals regarding the fee switch (just as we intend to for all other governance proposals). It’s been awesome to see all the enthusiasm and debate in the forums on this topic and would be excited to do all of the above if and when the proposal passes. ",
                    "links": [
                        "https://gov.uniswap.org/t/consensus-check-create-the-uniswap-foundation/17457"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.125
                },
                {
                    "author_link": "https://gov.uniswap.org/u/laktek",
                    "index": "17",
                    "likes": "5",
                    "time": "04/08/2022-19:53:13",
                    "content": "Great proposal! As a builder in the Uniswap Ecosystem, I believe the foundation is the right approach to grow Uniswap. I hope you will build a distributed and diverse team so the foundation’s impact can be widespread. Also, curious going forward about how much visibility the foundation will have on Labs’ roadmap and development. Would that impact on voting and grant decisions (eg: will foundation would vote against a proposal if it knows it impacts Labs’ roadmap?) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.732142857142857
                },
                {
                    "author_link": "https://gov.uniswap.org/u/tobyshorin",
                    "index": "18",
                    "likes": "9",
                    "time": "04/08/2022-19:55:11",
                    "content": "Speaking for Other Internet, we are very enthusiastic about this proposal. Since last year, we’ve put released 3 comprehensive deep dives into the governance challenges facing the Uniswap community, and are about to release a 4th. In all of our work we’ve consistently identified one issue common to all of Uniswap governance’s various problems. That issue is the lack of a clear center of authority and source of legitimacy. The outcomes such a party’s absence include:  high levels of politicking needed to get anything done voter apathy and delegate fatigue slow operational decentralization lack of accountability in partnerships (more on this in our forthcoming paper) difficulty in improving the governance process  We are supportive of the proposed foundation because we believe it will address these problems, not only through various initiatives, but also by simply being an actor with the mandate to be a channel for various stakeholders to connect and get things done. That there are dev relations, delegate relations, and partnership leads roles listed (with job postings already!) is a hugely positive sign for the type of operational capacity and speed that the foundation should unlock for Uniswap governance. As a side note, I hope this proposal makes clear what I’ve been advocating for in the fee switch conversation. There are a lot of things that need to happen for Uniswap protocol to continue to grow; with or without protocol revenue, the Foundation is the best bet to make those things happen. TL;DR - Uniswap Foundation is an entity that can represent the interests of the protocol and its various stakeholders. It can scope projects, be a legal counterparty, liaise with delegates and get things done. We simply haven’t had haven’t had this before, and it’s the biggest step we can take toward more efficiency here. Devin and Ken are excellent and have a proven track record, and we are looking forward to working with them on new governance initiatives. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.824310064935066
                },
                {
                    "author_link": "https://gov.uniswap.org/u/devinwalsh",
                    "index": "19",
                    "likes": "1",
                    "time": "04/08/2022-20:01:31",
                    "content": "This is a good question. In order for Uniswap Protocol to become the value exchange layer of the Internet (which we believe it should be), we believe there should be many diverse and talented teams building on it. There are many teams outside of Labs building on the Protocol today (many are listed in the UGP retrospective) however we believe there is a massive opportunity for grants to fund additional ambitious and impactful projects. The governance of the protocol is another key to long term Protocol sustainability that in our opinion requires some reinvigoration - we are excited to work with the community to ensure the governance process is efficient and effective. The UF will build a lean team and have a grants budget focused on exactly these things: Protocol growth, decentralization, and sustainability. Uniswap Labs is one of many organizations in the Uniswap ecosystem. It built, deployed, and, alongside many other teams, will continue to contribute to and build on the Protocol in the future. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.529411764705882
                },
                {
                    "author_link": "https://gov.uniswap.org/u/UniScott",
                    "index": "20",
                    "likes": "0",
                    "time": "04/08/2022-20:53:46",
                    "content": "I don’t disagree. I’m not asking for people to work out of the kindness of their hearts. I am going to question why if that’s the sole goal (which requires a legal analysis) do we need to fork over 14M in operating dollars to build a team of 12. That’s pork and spending for other things. Size it all down and work provisionally. You can come back in 6mo to ask for more. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.349537037037036
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Buckerino",
                    "index": "21",
                    "likes": "0",
                    "time": "04/08/2022-20:58:38",
                    "content": "14M for 3 years for 12-15 people? I dont think its unreasonable. If it were 140M, then yea, but I do not see how this is unfair compensation. The UGP has already done what you mentioned here with the smaller spending. You can check their retrospective out in the post itself. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.75
                },
                {
                    "author_link": "https://gov.uniswap.org/u/UniScott",
                    "index": "22",
                    "likes": "0",
                    "time": "04/08/2022-21:24:57",
                    "content": "We aren’t impressed. UGP has been a porky failure. I can’t post links but please see @adamscochran’s Twitter thread on the issue posted a few hours ago. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.805555555555556
                },
                {
                    "author_link": "https://gov.uniswap.org/u/devinwalsh",
                    "index": "23",
                    "likes": "3",
                    "time": "04/08/2022-22:20:25",
                    "content": "This is a fair point. Ken and I have went back and forth a lot on the best way to set OKRs. The first set of OKRs we wrote for the UF focused on increased volume, number of new users and developers in the space, number of “high impact, high engagement” governance proposals, etc. These are the results which all of our work would aim to have. However, we got stuck is defining the “right” numbers to tie to those results- how much volume might increase, when (it might take a talented dev team time to build a high impact new interface), by a % or total cumulative volume, and so on and so forth. Volume is going to be highly influenced by market conditions - how do we know what to attribute to the UF vs the market? New developers and interfaces - does it make sense to measure the number of new interfaces? One interface that stems from a larger grant might have a more positive impact than 5 interfaces stemming from smaller grants. We ultimately decided to set OKRs based on grant allocation % and team focus, and the metrics we will measure grantee success by, because those are the clear inputs to the results above which are within our control. We also think we might learn more about what numbers tied to those results (volume, # interfaces, etc.) make sense once the UF is up and running for some time (if the proposal passes!). If we do, then it could make sense to adjust OKRs in the future. That was our thinking in setting the OKRs this way. But, if community members have suggestions on how we might be able to better measure ourselves, we do want to hear them. ",
                    "links": [
                        "https://gov.uniswap.org/t/consensus-check-create-the-uniswap-foundation/17457"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.263114564007422
                },
                {
                    "author_link": "https://gov.uniswap.org/u/mjc716",
                    "index": "24",
                    "likes": "4",
                    "time": "04/08/2022-22:55:21",
                    "content": "Hi all - Michael from xToken here. I think this proposal is aligned with the best interests of the Uniswap community, and I also think that this sort of initiative is (directionally) an appropriate use of the protocol’s treasury. That said, having been through the UGP process, it would be beneficial to hear more about the process and methodology for the grants program under the new umbrella. I found the members of the committee to be kind and well-intentioned, but overall the process was vague and lacking in transparency. I’ve spoken with other applicants who have had similar experiences. A few notes:  I had to backchannel through an investor to get time on the calendar to present our proposal in front of the committee We didn’t receive feedback or any communication on the proposal until about 2 months later The feedback provided for why the committee was passing was plainly inconsistent with the decision to fund other grants in that wave  Because the committee declined to fund our proposal, it’s difficult to write this post without sounding like sour grapes. However, the grant request was really quite small, so I hope I can present this perspective neutrally. Looking at the list of funded grants over the history of the UGP, the committee has done great work supporting projects around tooling, analytics and ETH public goods. The media and hackathon sponsorships make legitimate sense for the protocol, even if some people object to the price tags. However, it’s hard not to look at the grants list and notice a subset of very generously funded projects with ambiguous goals. In many cases, these projects are led by folks with strong ties to the committee and team. In some cases, these are projects led by committee members (to be absolutely fair, the committee members are not always the beneficiaries of these grants). And, in some cases, these projects have not been shipped or maintained. I really don’t think there is any ill intent here, and I don’t want to empower any of the trolls on this forum. I also think it’s completely justifiable to run a grants and development program driven by the committee’s network and priorities. However, this approach would seem to be in conflict with the stated ethos of the project and community. And the optics are apparent to everyone except a few insiders. We’ll still be building on top of Uniswap V3 everyday, and we will definitely apply to the grants program again in the future. But I think the community and protocol – and the foundation -– would benefit deeply from a clear statement of process, methodology and standards. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.444069819069819
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Buckerino",
                    "index": "25",
                    "likes": "1",
                    "time": "04/08/2022-23:10:07",
                    "content": "Adam´s thread completely disregards facts such as the OP situation or the Polygon liquidity mining campaign which are vital reasons why the Uniswap Foundation should exist to handle such events specifically for the tokenholders. Representing it as a “porky failure” is a misrepresentation. Is it perfect? No. Did it do more good than harm? Yes. Even Adam said there were worthwhile projects being funded by the UGP.  I think the measuring stick is too harsh here as the Uniswap Foundation aspires to be more than what UGP was/is. The UGP was run part-time by only a handful of people who were working upwards of 40 hours per week+. When a DAO promises the Uniswap DAO a reward, whose responsibility is it to collect it? Is it you or me? Is it the Uniswap Labs? Whose job is it to handle such things on behalf of the tokenholders? Nobody knows and everybody assumes, “Well, somebody is assigned to do it.” No. There are very few people who are watching these things and its to the cost of the tokenholders. We are not talking paltry sums either. These situations are going to pop up more frequently in the future and are going to be more costly each time they happen. Major major sticking point in my honest opinion. Another good reason why the UF should exist is whiteglow support for users when it comes to user generated governance proposals. People are not really familiar with the process of how to implement their ideas into a concrete governance on-chain proposal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.064756944444445
                },
                {
                    "author_link": "https://gov.uniswap.org/u/one",
                    "index": "26",
                    "likes": "1",
                    "time": "04/08/2022-23:40:01",
                    "content": "I do not support this proposal.     Reading through the article, I don’t see a proposal describing how to empower uni tokens and increase the value of uni tokens. As a uni holder, I can’t support this proposal to set up a centralized company purely by selling coins. We call for the commission switch to be turned on.     I remember donating 1 million uni tokens to a defi education group, and honestly, I didn’t see any educational results from the group, but rather like a transfer of benefits. The proposal to set up a foundation this time seems to me to be the same.     Even if a foundation is set up, asking for $70 million is too much now, and the uni token market can’t afford such a dump in the short term. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.903061224489797
                },
                {
                    "author_link": "https://gov.uniswap.org/u/danhsiu",
                    "index": "27",
                    "likes": "0",
                    "time": "04/08/2022-23:47:41",
                    "content": "    devinwalsh:  The governance process has too much friction, the ecosystem is too difficult to navigate, and UGP in its current form is not able to fund the most ambitious and impactful projects.   Can we get @kenneth to comment on such projects that UGP is failing to budget? I’m genuinely curious to hear what projects are out there to help justify this temperature check! Is the plan to sunset the UGP program eventually? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.046875
                },
                {
                    "author_link": "https://gov.uniswap.org/u/ashleigh",
                    "index": "28",
                    "likes": "3",
                    "time": "05/08/2022-00:06:06",
                    "content": "This is extremely exciting and in my opinion represents a really ambitious step in the direction of further decentralization of the whole Uniswap ecosystem. Kudos to Ken & Devin for creating this proposal. Some comments: I think this funding amount is totally within reason. Attracting top talent is key, this work is hard, and the operational budget looks acceptable to me. I saw some comments below about UGP application times, communication holes, etc and I would just like to remind everyone here that the UGP has been a resource constrained and very grassroots effort up until (hopefully) now. I have worked with Ken on UGP and he is exceedingly competent, and I have every confidence that most of the issues described will resolve with more resources and the ability to hire help. I am especially excited about the plans to invest in governance stewardship. Creating proposals and passing them is too difficult and I think a dedicated team to provide assistance to would-be proposers will lead to a huge increase in viable governance activity. (ps. Please overhaul the current governance process! I wrote it but now I’m embarrassed by it lol) Some questions:  The biggest thing that stood out to me was 35% for research on incentive mechanisms.    Can you guys go into more detail on what you hope to achieve there and maybe give some more detailed examples of the types of things you want to explore using this funding?   Will UF be using funding to provide actual incentives (i.e. some types of liquidity mining programs)?   If the answer to the above is yes, what kinds of modeling will you be doing to before funding a given incentive mechanism MVP and will you plan to share the results of modeling with the community?   Given that this is the largest part of grants budget, would it be fair to say that the UF thinks incentive scheme development is the largest factor in the future growth of the Uniswap protocol?     What types of candidates are you seeking for 3rd board member?   Is the advisory team permanent or will it roll over periodically as in the current UGP?   Now that Uniswap labs has entered the NFT space via acquisition, will NFT focused tech be eligible for UF grants?   A suggestion: I think the marketing and events budget looks low. I would like to see the Uniswap protocol begin to market itself in a big way. FTX is out here naming stadiums, but Uniswap logo, branding, mission and ethos is cooler in every way and I think has the potential to resonate with retail. Superbowl commercials. Official sponsor of Paris Fashion week. Headline sponsor of US womens soccer. The olympics. More e-sports partnerships. I would add another $10M to the first year’s budget to test out large scale sponsorships and see if they work for us. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.120721726190476
                },
                {
                    "author_link": "https://gov.uniswap.org/u/devinwalsh",
                    "index": "29",
                    "likes": "1",
                    "time": "05/08/2022-00:30:47",
                    "content": "UniScott - may not be able to come to an agreement here, but I do want to acknowledge and respond to a few of your concerns. On UGP v0.1, Ken just wrote a response to Adam’s comments here - we’re proud of the success of UGP v0.1, and believe some awesome grant projects came out of it, (some covered here). The UGP team has definitely learned a ton to apply to the next round, if the proposal passes. And, we’re excited about what we’d be able to achieve with a full-time team (v0.1 only had funds to pay a small team part-time salaries, tho many of them still worked 40+ hour weeks). We think it’s in Uniswap’s best interest to have a full-time team and resources devoted towards 1) funding teams to support Protocol growth, 2) reinvigorating governance, and 3) being an advocate for the Protocol. A larger grants program and full-time team is more capable of building strong relationships with the most talented development teams, and scoping out the most impactful, ambitious projects which take more time and funds to build. A budget limited by a 6 month timeframe would be limited in its ability to support those kinds of projects, which we see as being integral to Uniswap’s long term success. The UF would also have a team focused on developer relations, community building, delegate relations, improving governance, and more. Also happy to hop on a call to discuss further - feel free to DM me https://twitter.com/devinawalsh ",
                    "links": [
                        "https://mirror.xyz/kennethng.eth/0WHWvyE4Fzz50aORNg3ixZMlvFjZ7frkqxnY4UIfZxo",
                        "https://twitter.com/devinawalsh"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.567012288786483
                },
                {
                    "author_link": "https://gov.uniswap.org/u/lpuniswap",
                    "index": "30",
                    "likes": "2",
                    "time": "05/08/2022-01:19:29",
                    "content": "This should happen way before. I really agree with this. Let do this fam ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/web3_lord",
                    "index": "31",
                    "likes": "1",
                    "time": "05/08/2022-06:44:00",
                    "content": "Loved the initiative to further decentralize Uniswap Also, imo the budget is pretty modest for the experienced crypto-native team. Highly excited for the Uniswap’s journey to achieve peak decentralization ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.854166666666667
                },
                {
                    "author_link": "https://gov.uniswap.org/u/metaverbal",
                    "index": "32",
                    "likes": "0",
                    "time": "05/08/2022-10:47:22",
                    "content": "The team structure being proposed is a step forward. Having a dedicated grants lead is definitely a step forward. The proposal misses an answer to - What were the problems and learnings from the UGP? How is the Uniswap Foundation addressing them? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/devinwalsh",
                    "index": "33",
                    "likes": "0",
                    "time": "05/08/2022-18:46:25",
                    "content": "Re: UGP. Thank you for the comments here! (For others: Ken and I are also writing up some additional history and information about UGP to add as a comment in the forum later today and to the addendum in the next version of the proposal!) Re: governance. Agree! And a proposed governance process revamp is definitely in scope for our first 3 months (inspired by this post, with additional community feedback) I’ll publish answers to the rest of your questions in line:  The biggest thing that stood out to me was 35% for research on incentive mechanisms.    Can you guys go into more detail on what you hope to achieve there and maybe give some more detailed examples of the types of things you want to explore using this funding?  Yes! The goal here is to fund MVPs of incentive mechanisms which work to achieve one or all of the goals of growth, sustainability, and decentralization of the Uniswap Protocol - primarily by increasing engagement and retention across a variety of stakeholder groups. Many protocols have experimented with liquidity mining and that could be in scope here, but there are also opportunities to explore other kinds of incentive programs. One example is a developer mining program, which would incentivize third-party integrations with the protocol to strengthen its network effects.    Will UF be using funding to provide actual incentives (i.e. some types of liquidity mining programs)?  Yes. That’s one of the reasons this is the largest bucket. The $21M (35% * $60M) would fund MVPs. If the MVPs are successful, grantees could take their learnings and propose a larger scale initiative to the community to be funded by the Treasury.    If the answer to the above is yes, what kinds of modeling will you be doing to before funding a given incentive mechanism MVP and will you plan to share the results of modeling with the community?  We have a 5% Incentive Program R&D grantee budget that would fund this kind of research and modeling. While we will work with grantees to determine the best modeling for a specific program, one example might include an estimation of marginal swapper, or marginal $1M of volume, benefit to Protocol network effects. In other words, how much additional TVL does one additional swapper prompt, what is that TVL’s impact on reduced slippage, how many additional swappers does that attract? This research, like all other research funded by grants, would be open sourced to the community.    Given that this is the largest part of grants budget, would it be fair to say that the UF thinks incentive scheme development is the largest factor in the future growth of the Uniswap protocol?  The most important input to the future growth and sustainability of the protocol is stakeholder growth, usage, and engagement — essentially, making it easier for the community to get involved. Incentive programs which reward Protocol contributors with UNI might not only bring new integrations, but also turn contributors into governors of the Protocol (a lockup could be a component of these programs). Because the success of one or multiple programs like this would potentially provide long term sustainability and growth for the Protocol outside of any one or set of external actors or interfaces, we believe it is an integral component of our budget and key to Protocol success.      What types of candidates are you seeking for 3rd board member?  Based on our experiences over the past few weeks, we’re seeking out an individual with a few characteristics. Most importantly, they should have 1) significant experience in crypto, and 2) a Founder mindset. Based on what we have seen thus far, we also would look for someone with 3) a law degree and experience working as a lawyer, to provide guidance to the Foundation on the evolving legal and regulatory landscape, and 4) previous Board experience particularly for an organization focused on open source software, technological infrastructure, and/or financial services.  However, we believe we will learn a lot if and when the UF gets fully up and running and we begin to conduct Board interviews, and these criteria may change as a result.    Is the advisory team permanent or will it roll over periodically as in the current UGP?  Intend to keep working with the advisory team for as long as their contributions are valuable to the UF - which we forsee as being a long time! In the event of unexpected circumstances or advisors no longer being able to make a time commitment, we would seek to replace them with someone of equally high caliber. Also worth mentioning that we are not necessarily capping advisors at 4 and may add more over time as is helpful.    Now that Uniswap labs has entered the NFT space via acquisition, will NFT focused tech be eligible for UF grants?  UGP is open to any grantee project which benefits the Uniswap Protocol or ecosystem. If an NFT focused grant falls into that category, then definitely! Caravan is one cool example that came out of the Unicode Hackathon, it allows users to rent Uniswap v3 liquidity (NFTs) from one another. Also worth noting that the Uniswap Labs acquisition of Genie has no impact on the Uniswap Protocol, governance, or UNI token (covered in their blog post).    A suggestion: I think the marketing and events budget looks low. I would like to see the Uniswap protocol begin to market itself in a big way. FTX is out here naming stadiums, but Uniswap logo, branding, mission and ethos is cooler in every way and I think has the potential to resonate with retail. Superbowl commercials. Official sponsor of Paris Fashion week. Headline sponsor of US womens soccer. The olympics. More e-sports partnerships. I would add another $10M to the first year’s budget to test out large scale sponsorships and see if they work for us.  I like this! We do have a 10% grants allocation for community growth ($6M with current budget) which will include sponsorships. Community - what do you think?  ",
                    "links": [
                        "https://showcase.ethglobal.com/unicode/caravan",
                        "https://uniswap.org/blog/genie",
                        "https://gov.uniswap.org/t/governance-proposal-create-the-uniswap-foundation/17499",
                        "https://gov.uniswap.org/t/consensus-check-create-the-uniswap-foundation/17457",
                        "https://gov.uniswap.org/t/fees-switch-follow-up-supporting-the-evolution-of-uniswap-protocol-design/20751"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.809147276334777
                },
                {
                    "author_link": "https://gov.uniswap.org/u/devinwalsh",
                    "index": "34",
                    "likes": "0",
                    "time": "05/08/2022-20:46:06",
                    "content": "The UF team is conducting extensive research to determine the type of legal entity which best matches our ambitions, including our mission to make a positive social impact, and other operational needs (covered in the proposal above). Given these requirements, we are contemplating a US-based entity that would seek tax-exempt status. If we go down this path, the entity would be a non-stock corporation, with no owners or equity. There has been no stock issuance, and we have no plans to do a stock issuance in the future. That being said we should note there is no guarantee that tax-exempt status will be secured, and we may make modifications to UF’s structure and operations in the future. We will share more about our path forward with the community as soon as we are able to. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.908354377104377
                },
                {
                    "author_link": "https://gov.uniswap.org/u/devinwalsh",
                    "index": "35",
                    "likes": "2",
                    "time": "05/08/2022-21:32:32",
                    "content": "Thank you! Re: the team - we agree with that sentiment. We’re already very excited about the awesome applications which have been coming through Lever - and we’re very excited to empower, support, and work with Uniswap community members all over the world. All UF decisions will be made with the best long-term interests of the Uniswap ecosystem — of the Protocol and all stakeholders — in mind. The individual interests of a single stakeholder in the ecosystem, such as Uniswap Labs (or any other entity or individual), will not sway these decisions. We do want to highlight the fact that we plan to work with stakeholders in the ecosystem to publish a biannual State of the Ecosystem report, which will highlight developer tooling, libraries, and interfaces that exist for the Uniswap Protocol, as well as the high-level roadmaps of what teams contributing to the report are planning to build in the future. Our intention with this report is to make it easier for developers to navigate the ecosystem and to also discern what new tools they can build (without doing redundant work). We would welcome contributions to this report from all builders in the ecosystem. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.351898101898101
                },
                {
                    "author_link": "https://gov.uniswap.org/u/kenneth",
                    "index": "36",
                    "likes": "7",
                    "time": "06/08/2022-22:42:22",
                    "content": "To respond to a few questions in the forum (@metaverbal) and on Twitter, we wanted to provide more information on the Uniswap Grants Program (UGP). We are also adding this information to the Addendum of the Proposal at the Consensus Check. What is UGP, and how do I find out more about it? The Uniswap Grants Program started after going through a governance vote in December 2020 for an allocation of $1.5M in UNI intended to last 6 months. While the initial set of priorities for UGP was narrowly scoped as an MVP to seed the ecosystem of developers, it has since grown to encompass more, including governance research, community building and education, and core protocol work. Due to the crypto market bull run we were able to give $7M in grants over 18 months. Grants researcher @sovereignsignal also recently put together a fantastic (independent) write-up on the history of the UGP here. For more information on UGP’s past work and grantees check out the following links:   UGP Homepage (still accepting applications!) UGP Twitter UGP Process Outline UGP RFPs & Challenges  UGP Grantees (h/t @sovereignsignal) UGP Subcommittees (delegated resource allocators for targeted grants focused within a specific category)   The Stable led by b0r4   UGP Community Analytics led by Yj, Fede, RantumBits, Annamira, TZM, and Trea Qura     What does a successful UGP grant look like? What are some UGP success stories? Grantees have done some incredible work over the past 1.5 years - for more information, check out our recent retrospective on UGP v0.1. However, most UGP grantees are less than a year old. Just like with any product, it may take some time and several iterations for grant projects to develop traction and see adoption. The first version of Uniswap only worked for a single LP and ETH/ERC20 pair, and looked much different than the Uniswap we know and love today (still live here!). Hardat, too, took time to become what it is today - Nomic Labs received its first grant in 2018. With that being said, not every grant will have the same outcome as a Uniswap or Hardhat. Not every grant will have runaway adoption, just like with any startup. Even when a project does not have the expected or intended impact, it can still have a positive impact on the ecosystem, bringing in new developers, users, and ideas. Grantee success can be a range of impactful outcomes and, although we can’t pick favorites, some notable highlights are:   Serv.eth Discord support -  a globally distributed team of 10 supporting the Uniswap Discord server all hours of every day. They have resolved over 15,000 community support tickets (and counting!), from helping users set up their first wallet and making their first trades, to identifying scammers and helping others retrieve funds.  GFX labs cross-chain governance research - The GFX team have been active Uniswap contributors since the beginning — they were one of the first LPs on v3! Their UGP-funded research led to the the Protocol’s first cross-chain governance proposal, the deployment of the 1bps fee tier on Polygon.  Chaos Labs TWAP hardhat plugin - One of Uniswap’s most under-appreciated innovations is the TWAP oracle, a core but admittedly complex DeFi primitive. Chaos Labs recognized the need for more robust tooling and documentation to make integrating TWAPs more accessible. They created a Hardhat plugin so anyone can leverage its robust security and accurate price reporting.  Scopelift Seatbelt & Flexible Voting- Scopelift productionised Seatbelt for governance testing. This test suite not only protects against unverified contracts, but also simulates proposals locally to ensure they deploy results properly. Additionally, their initial work on Flexible Voting would enable governance tokens locked in other protocols (for example, cUNI) to be leveraged for cross-protocol governance voting.  OmniAnalytics uniswappeR - The first R package created to interact with, quickly query, and trade on Uniswap, opening the door for more advanced data analyses. The Omni team went above and beyond their grant scope to deliver video tutorials, extensive documentation, and an easy dashboard generator for in-depth exploration of trade history, LP and price simulations under infinitely customizable conditions including slippage and liquidity depth.  TechEducators Solidity Bootcamp - As an established web2 bootcamp, the team behind ETHAnglia have built an open source Solidity Bootcamp to better usher web2 developers into web3 with a focus on building secure Ethereum dApps. Their target demographic reaches to underserved populations in the UK, offering scholarships and free mentorships. Through this work, they have received recognition and further support from the UK government through the Department for Works and Pensions.  How will UGP be improved within the UF? Even with the success cases listed above, there are a number of ways that we’re excited to improve UGP for the benefit of the ecosystem.   Provide grants to universities and research institutions: Today, UGP is a multisig without a legal entity so we are unable sign contracts with or award grants to universities and academic research institutions, among others. As a legal entity, the UF would allow us to work with these organizations.  Diversify assets: No legal entity also means UGP could not diversify its assets out of UNI due to a lack of clarity around tax liability. This has made it impossible to scope out and provide larger and longer-term grants due to UNI price risk. The ability to diversify our assets will allow us to award these kinds of grants, for more ambitious and impactful projects.  Full-time well-compensated team: UGP v0.1 was able to pay its small group of contributors part-time (≤30 hours per week). With an entity and full budget, the UF will be able to hire a full-time and well-compensated team. We also want to recognize the fact that a few UGP team members would still work 40+ hour weeks and weekends, uncompensated, due to a love for this work!  Upscale all of UGP: With a formal entity, larger budget, and a full-time team, we would be able to improve our internal processes, from the applicant pipeline through feedback cycles, decisions, disbursements, and ongoing grantee management. We can do more in proactive outreach to fill our pipeline with fresh ideas and new teams. We could shine more of a spotlight on the impact grantees have had on the community. We will also be able to scale up our legal and accounting capabilities required for a more comprehensive grants program.  ",
                    "links": [
                        "https://twitter.com/sovereignsignal",
                        "https://sovereignsignal.substack.com/p/breaking-down-the-uniswap-grants",
                        "https://www.notion.so/Welcome-to-UNI-Grants-6e3e84967a984a5fb127ae749649ddc9",
                        "https://twitter.com/uniswapgrants",
                        "https://www.notion.so/5b34ef6b77964960844a86daeb4d9a26",
                        "https://www.notion.so/RFPs-Challenges-3be614ba4e504b5caeee7b0159e64a42",
                        "https://www.notion.so/8e8ba8344967488a85106309d48a4a3a",
                        "https://twitter.com/sovereignsignal",
                        "https://www.notion.so/The-Stable-the-first-30-days-b3826f0cae964b1aa3a02e3188e2cd4f",
                        "https://twitter.com/B0R444",
                        "https://www.notion.so/b09bbb16579d4a569b7e2d393afc4459",
                        "https://twitter.com/uniyj1",
                        "https://twitter.com/Fly_Ams",
                        "https://twitter.com/RantumBits",
                        "https://twitter.com/annamirajo",
                        "https://twitter.com/Treaqura",
                        "https://mirror.xyz/kennethng.eth/0WHWvyE4Fzz50aORNg3ixZMlvFjZ7frkqxnY4UIfZxo",
                        "https://haydenadams.github.io/uniswap-retro/",
                        "https://hardhat.org/",
                        "https://serveth.support/",
                        "https://gfx.xyz/",
                        "https://app.uniswap.org/#/vote/2/14?chain=mainnet",
                        "https://chaoslabs.xyz/",
                        "https://github.com/ChaosLabsInc/uniswap-v3-oracle-cli",
                        "https://chaoslabs.xyz/posts/chaos-labs-uniswap-v3-twap-deep-dive-pt-1",
                        "https://www.scopelift.co/",
                        "https://github.com/Uniswap/governance-seatbelt",
                        "https://gov.uniswap.org/t/temperature-check-upgrading-to-a-flexible-voting-enabled-governor/17098",
                        "https://omnianalytics.org/",
                        "https://github.com/Omni-Analytics-Group/uniswappeR",
                        "https://m.youtube.com/watch?v=GpWZLMB2lvM",
                        "https://github.com/Omni-Analytics-Group/uniswappeR",
                        "https://github.com/Omni-Analytics-Group/uniswappeR-dashboarding",
                        "https://techeducators.co.uk/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.874951780892374
                },
                {
                    "author_link": "https://gov.uniswap.org/u/devinwalsh",
                    "index": "37",
                    "likes": "4",
                    "time": "06/08/2022-22:48:30",
                    "content": "Hey Dan - Ken just added a lot more info about UGP and how we want to improve it as a comment below, and I’m about to add that to the Addendum of the Proposal as well for the Consensus Check. UGP won’t be sunset, it will operate under the UF and scale up its resources and team. As for the kinds of ambitious projects we would now be excited to fund? Listing many below, but we’re just as excited to be blown away by new ideas the community dreams up.  Novel incentive programs, like a developer mining program to incentivize third-party integrations with the protocol to strengthen its network effects (spoke about this a bit in my reply to Ashleigh) The extensive R&D and engineering work required to design, build, test, and deploy future versions of Uniswap. And of course, associated developer documentation, tooling, and support. New smart contract primitives improving Uniswap stakeholder experience. A recent example of this would be The Franchiser, whose audit was coordinated by UGP. The Franchiser for the first time allows for partial delegation and re-delegation of Compound-style voting tokens like UNI. New independent grant-making organizations, for instance, managed by University blockchain clubs, and focused on regions around the world like South America, Southeast Asia, Africa, and more. Grants to write versions of Uniswap in new languages to deploy on other chains (I.e. in Cairo for Starknet, in Rust for Solana, etc.) More middleware, including an open source streaming data platform for Uniswap pricing, trading, pool, and other data. More advanced tooling (ie 1-click position changes and fee collection), improved UI/UX, and more education for liquidity providers. Ditto for liquidity mining. An pro trader interface that offers a familiar UI/UX to the most popular centralized exchanges, like FTX and Binance On-site hackathon support at events around the world to work hand in hand with hacker teams  ",
                    "links": [
                        "https://gov.uniswap.org/t/consensus-check-create-the-uniswap-foundation/17457",
                        "https://gov.uniswap.org/t/governance-proposal-create-the-uniswap-foundation/17499"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.184775046382189
                },
                {
                    "author_link": "https://gov.uniswap.org/u/devinwalsh",
                    "index": "38",
                    "likes": "0",
                    "time": "07/08/2022-17:14:41",
                    "content": "Thank you! Appreciate it. We’re excited too ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://gov.uniswap.org/u/devinwalsh",
                    "index": "39",
                    "likes": "0",
                    "time": "07/08/2022-17:15:08",
                    "content": " thank you!! appreciate it. we’re psyched ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/devinwalsh",
                    "index": "40",
                    "likes": "0",
                    "time": "07/08/2022-17:24:33",
                    "content": "Hi @one, thanks for your comments and thoughts   It would be well within the scope of the UF to welcome, encourage, and provide grants to research and analysis on the fee switch, and to promote better education around the mechanics of fee switch implementation. It would also be well within the scope of the UF to assist the community in decision-making regarding the fee switch, including putting out information regarding any polls or governance proposals regarding the fee switch (just as we intend to for all other governance proposals).   The DEF is an unrelated independent organization from the UF. However I’ll send along two threads that Miller recently posted on their work, as they seem to be making nice progress on their stated goals: https://twitter.com/millercwl/status/1555542973215113217 https://twitter.com/millercwl/status/1555541678336970752   Ken and I wrote a bit in comments yesterday (will add to Addendum for Consensus Check) on why we believe this investment into UGP is required and how it will benefit Uniswap - the current size and setup of UGP does have limits and more capital would allow the team to build long-term relationships w dev shops including more ambitious multi-milestone grant projects. In our treasury diversification, we plan to pursue an approach which would minimize UNI price impact (we will publish a Foundation Treasury Diversification report for the second disbursement for community review prior to diversifying that UNI).   ",
                    "links": [
                        "https://twitter.com/millercwl/status/1555541678336970752"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.240384615384615
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Naught",
                    "index": "41",
                    "likes": "0",
                    "time": "08/08/2022-13:23:05",
                    "content": "  Full-time well-compensated team: UGP v0.1 was able to pay its small group of contributors part-time (≤30 hours per week). With an entity and full budget, the UF will be able to hire a full-time and well-compensated team. We also want to recognize the fact that a few UGP team members would still work 40+ hour weeks and weekends, uncompensated, due to a love for this work!  If I recall correctly from the initial UGP v.01 and renewal. The lead (you) is/was compensated 25/uni per hour ($360k a year at average sell price of $15), while the other members were compensated $150 a hour; 216k a year  (both max capped at 30 hours per week). Would these pay rates be increasing under the Uniswap Foundation? Also, with the Uniswap foundation would a more official and regularly updated website be formed (not dependent on notion)? A quick look at the UGP page it only has wave 5 (current application is asking for wave 9?) What is your stance on an oversight committee as part of the foundation? Or atleast making it easier to see how funds are moved to recipients (i.e. when list of awarded wave recipients is announced and posted, a link on each award amount to an etherscan movement of funds, so the community can see the actions of the funding.) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.652777777777778
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Buckerino",
                    "index": "42",
                    "likes": "0",
                    "time": "08/08/2022-18:20:13",
                    "content": "I highly doubt anyone in the UGP team was being compensated either 360k or 216k a year… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.8
                },
                {
                    "author_link": "https://gov.uniswap.org/u/DAOstrat.C",
                    "index": "43",
                    "likes": "3",
                    "time": "08/08/2022-19:49:50",
                    "content": "Cameron, on behalf of ConsenSys. Establishing the Uniswap Foundation is a logical (and long overdue) step forward for the protocol and community. The proposal is led by some of Uniswap Labs’ best – Devin & Ken. As broken out above in the proposal, capital allocation is within reason. Foundation funding of this size does require active management, reporting, and reassessment. We also believe the team understands and is capable of this. Transparency & objectivity will be key factors for success. We are excited to help and support the foundation in any way possible! C ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.700757575757576
                },
                {
                    "author_link": "https://gov.uniswap.org/u/BOR4",
                    "index": "44",
                    "likes": "1",
                    "time": "08/08/2022-20:09:02",
                    "content": "Hey everyone! @devinwalsh will join us for the Uniswap Community Call this Wednesday (August 10th) at 16:00 EST. Community call will be held in the Uniswap Discord. event link: Uniswap If someone can’t make it to the call but has something you would like to get more info, please send me questions via DM. Notes from the call will be shared after the call. Looking forward on having a great discussion about this proposal! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.75
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Naught",
                    "index": "45",
                    "likes": "0",
                    "time": "08/08/2022-22:41:21",
                    "content": "Those number’s are straight from the compensation outlay’s of the UGP .01v and renewal forum discussions here:     [RFC] Uniswap Grants Program v0.1 Proposal Discussion       co-authored with Ken Ng   UPDATE — December 19, 2020 Voting is now live for Uniswap Governance Proposal #003.  You can vote here: https://app.uniswap.org/#/vote/3    UPDATE — December 16, 2020 Based on positive feedback from this post and the snapshot poll, we’re going to move forward with a formal proposal. To support the project please delegate your votes to the “autonomous proposal contract” (a fork from Compound) deployed for this proposal here:  0x76f54Eeb0D33a2A2c5CCb72FE12542A56f35d67C  W…     We propose the lead be compensated 25 UNI/hr (approximately $100 USD at time of this writing) capped at 30 hours/week. This compensation, along with the quarterly budget, will be allocated to the UGP multisig from the UNI treasury . In keeping with the committee’s commitment to the community, hours and duties will be logged publicly and transparently .     [Temperature Check] Reinstating UGP v0.2 with existing funds Temperature Check       tl;dr - Over the last 6 months, UGP has successfully deployed $1.75M to 52 grantees. While UGP was initially funded to deploy $750k per quarter, UNI price has appreciated and the multisig now custodies an additional $8.5m.  This proposal seeks approval for the following changes:   Extend the UNI Grants Program for an additional 6 months Utilizing the remaining funds, scaling the grants program up to $8.5M in grants All committee members to be compensated at $150USD/hr as needed for no more than …      Extend the UNI Grants Program for an additional 6 months Utilizing the remaining funds, scaling the grants program up to $8.5M in grants All committee members to be compensated at $150USD/hr as needed for no more than 30 hours/week Due to time constraints, Robert Leshner, Kain Warwick, and Ashleigh Schap are stepping down from the committee, to be replaced by John Palmer, Ariana Fowler, and Callil Capuozzo  I do think the compensation numbers are resonable if these were full time individuals working for the future foundation. It is very likey that the member’s did not max out hours every week, so I understand your doubtfulness of the annualized number’s ($150/h x 30 a week x 4 weeks x 12 months) I gave. I am supportive of this foundation proposal. As setting up an offical company would increase the amount of transparency in reporting requirements. ",
                    "links": [
                        "https://twitter.com/nkennethk?lang=en",
                        "https://app.uniswap.org/#/vote/3",
                        "https://app.boardroom.info/voters/uniswap/0x76f54Eeb0D33a2A2c5CCb72FE12542A56f35d67C",
                        "https://gov.uniswap.org/t/temperature-check-reinstating-ugp-v0-2-with-existing-funds/13310"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.258270202020202
                },
                {
                    "author_link": "https://gov.uniswap.org/u/kenneth",
                    "index": "46",
                    "likes": "0",
                    "time": "08/08/2022-23:40:09",
                    "content": "To the forum - in full transparency, Michael and I had a follow up conversation late last week about his experience with UGP. Although we’re saddened that Michael did not have a good UGP experience, we still do genuinely appreciate receiving such honest feedback on our processes. We plan to keep improving as UGP matures under the UF. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.uniswap.org/u/kenneth",
                    "index": "47",
                    "likes": "2",
                    "time": "08/08/2022-23:54:04",
                    "content": "Thanks for the questions @naught, adding some clarifying details below.     Naught:  If I recall correctly from the initial UGP v.01 and renewal. The lead (you) is/was compensated 25/uni per hour ($360k a year at average sell price of $15), while the other members were compensated $150 a hour; 216k a year (both max capped at 30 hours per week).   I was compensated at 25 UNI/hr for the first 6 months with UNI at $4. After the first 6 months, my compensation, as well as all other contributor’s, was updated to $150/hr (reconciled in UNI) with a cap of 30 hours per week. This was market rate for Grants contributors at the time. You’re correct that at this rate, my annualized salary is $216k. (One note I’ll add though is that because of the UNI price decline over the past few months, I have deferred pay in order to ensure UGP could continue funding grants.) Regarding other UGP multisig signers: these 5 individuals were cumulatively paid $20k for their efforts over the past 1.5 years (at $150 per hour, with some choosing not to be paid). Regarding Grants subcommittee members: these members are compensated at $150/hour or less by the subcommittees they work for, based on appropriate market rates.     Naught:  Would these pay rates be increasing under the Uniswap Foundation?   The UF, as a legal entity, will aim to offer competitive full-time compensation packages including fiat salary, health care benefits, and long-term vested UNI to our employees. Being able to offer full-time work with competitive packages will open up our talent pipeline considerably, and allow us to build the high caliber, talented team needed to achieve the UF’s ambitious goals. We plan to take into account market rates for an individual’s role and experience while putting together comp packages.     Naught:  Also, with the Uniswap foundation would a more official and regularly updated website be formed (not dependent on notion)? A quick look at the UGP page it only has wave 5 (current application is asking for wave 9?)   Yes! Most of the information on Waves is located in our Notion page. With more resources and a larger team, we will be able to to build a more robust website including a UGP Dashboard, and to make more frequent and detailed social media updates including grantee highlights and program updates.     Naught:  What is your stance on an oversight committee as part of the foundation? Or atleast making it easier to see how funds are moved to recipients (i.e. when list of awarded wave recipients is announced and posted, a link on each award amount to an etherscan movement of funds, so the community can see the actions of the funding.)   We have published regular updates on Grants Waves from the @uniswapgrants Twitter account account in the past. However we are excited to do much more to keep the community up to date on our work in the future. As for oversight, we look forward to receiving regular input and feedback from our Advisors, and of course from the community. We intend to regularly attend existing Community Calls and to plan our own regular events (online and IRL) to field questions and input from the community, and to keep our Twitter DMs open for 1:1 discussion. We will also get community approval via Snapshot poll for any grant over $2M. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.756666666666667
                },
                {
                    "author_link": "https://gov.uniswap.org/u/BP333",
                    "index": "48",
                    "likes": "1",
                    "time": "09/08/2022-17:01:19",
                    "content": "I love the idea behind the Uniswap Foundation.  I think the Uniswap Grants Program had too broad of a mandate in that it helped fund things that were only tangentially related to the actual Uniswap protocol (i.e. DeFi Education Fund). I think we desperately need something that focuses solely on improving the Uniswap protocol and ecosystem specifically.  It will help make the Uniswap ecosystem less forkable in my opinion. I’ll let the others who are more knowledgeable debate the numbers, but I love the idea of funding things directly related to the Uniswap protocol. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.179924242424242
                },
                {
                    "author_link": "https://gov.uniswap.org/u/tomlombardi",
                    "index": "49",
                    "likes": "3",
                    "time": "10/08/2022-01:06:23",
                    "content": "The creation of the Uniswap Foundation is the natural progression of 1) further decentralization of the protocol and 2) formalization of an effective grant issuing entity to benefit the community. DAO treasuries should not sit idle in a native token balance. The development of professional foundation to put assets to work to improve the experience and grow the user base is essential to the long term future of Uniswap. Uniswap is the most profound and innovative financial application of our lifetime! Now is the time to grow the ecosystem with more tooling, interfaces, and easy to manage documentation so we can onboard the next billion people into DeFi. As a supporter of Ethereum (former Head of Growth, EEA) and long time Uniswap LP, I support @devinwalsh and @kenneth in this proposal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.563725490196079
                },
                {
                    "author_link": "https://gov.uniswap.org/u/mhonkasalo",
                    "index": "50",
                    "likes": "3",
                    "time": "10/08/2022-11:25:49",
                    "content": "We support the proposal to form the Uniswap Foundation. Having a foundation that has the necessary resources to attract top talent and build out a growing ecosystem of Uniswap products is key to the decentralization of the protocol and its continued growth. We know Devin and the advisors/team members here, and believe they are the right people to take this initiative forward. This is a step that aligns with our Delegation Platform pitch and is a good next step in UNI token holders becoming more active in the ecosystem. It will take a lot of work and motivated UNI holders/delegates to make the best of these resources and we are excited to contribute. ",
                    "links": [
                        "https://gov.uniswap.org/t/mhonkasalo-teemulau-delegate-platform/17064"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.671536796536797
                },
                {
                    "author_link": "https://gov.uniswap.org/u/devinwalsh",
                    "index": "51",
                    "likes": "2",
                    "time": "10/08/2022-13:00:05",
                    "content": "Thanks @BP333, we’re very excited about the Foundation as well, and think there is a huge opportunity for it to support the Uniswap protocol and broader ecosystem! As a small note, I do want to clear up the point about the Defi Education Fund (DEF). The Uniswap Grants Program did not fund the DEF, it went through the Uniswap community governance process. Final governance vote is here: Uniswap Interface Thank you so much for your support and we’re excited to work with you and others in the community if the final vote for the UF passes. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.895833333333334
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Brenner",
                    "index": "52",
                    "likes": "1",
                    "time": "11/08/2022-16:12:59",
                    "content": "The ask is $14M to manage $60m over 3 years. 19% of total funds going toward management over 3 years. VCs charge 2%/year management fees (6% for 3 years). Why does UF need to charge a higher percent for capital management than VCs do? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Kingofgold",
                    "index": "53",
                    "likes": "0",
                    "time": "11/08/2022-16:34:08",
                    "content": "nice piece, putting it the way they are, please drop more to educate who wants to learn ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.166666666666667
                },
                {
                    "author_link": "https://gov.uniswap.org/u/enti",
                    "index": "54",
                    "likes": "0",
                    "time": "12/08/2022-15:53:08",
                    "content": "You can’t compare a Foundation with VCs, it’s just not the same type and amount of work. The UF, if I understood this post correctly, will help steward the Uniswap Protocol with monetary and non-monetary support to whoever may need it as well as identify other areas with potential and make recommendations. All of that without necessarily taking a stake in those investments. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.84375
                },
                {
                    "author_link": "https://gov.uniswap.org/u/devinwalsh",
                    "index": "55",
                    "likes": "1",
                    "time": "12/08/2022-16:31:13",
                    "content": "Thanks Brenner. @enti is correct. The Uniswap Foundation would not be a venture fund. It will be focused on not only building a best-in-class grant making organization (not taking an equity stake in the projects it supports) but also on reinvigorating the Uniswap governance process and building, supporting and maintaining the ecosystem and protocol to be sustainable and successful for the long term. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.15
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Brenner",
                    "index": "56",
                    "likes": "1",
                    "time": "12/08/2022-19:29:53",
                    "content": "That’s a notable difference, thank you @enti for calling that out. I don’t know much about what a typical Foundation’s operating expenses are relative to the amount of capital they’re overseeing, but would be curious to see the comparisons (I do understand there would be differences) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.433333333333334
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Fishbiscuit",
                    "index": "57",
                    "likes": "5",
                    "time": "17/08/2022-19:22:33",
                    "content": "Heya @Brenner sharing a perspective - 1. The Foundation does more than just disburse grants Looking at the jobs posted, there are also roles involved that do not only manage the ‘fund’ such as governance, community, devrel. About 3 roles (1/4) are directly managing the grants disbursement which if we simply take that as a guidance would be about $3.5M of the operating budget. 6% of $60M is $3.6M. As @devinwalsh pointed out in this reply here, there’s a lot more than goes on in a Foundation than just disbursing grants. 2. The pay is reasonable when looking at existing nonprofits Just very quickly, searching up a report on salaries for nonprofits - the level of pay for a disbursement > $50M is about 280k annually for VP-level staff. 280k * 12 staff * 3 years leads us to $10.08M. The budget allocated for salaries is $10.3M which is very close. Considering that running a foundation in Web3 requires specialised skillsets, I’d say that the foundation could definitely afford to pay more. ",
                    "links": [
                        "https://gov.uniswap.org/t/temperature-check-create-the-uniswap-foundation/17358/55",
                        "https://static1.squarespace.com/static/57646c9ee3df2833602e2027/t/60410291588f4c4f2ca0df4b/1614873235835/PNP-Staffing-Group_Nonprofit-Salary-Report_2021-NYC_F.pdf"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.1060606060606055
                },
                {
                    "author_link": "https://gov.uniswap.org/u/vgk",
                    "index": "58",
                    "likes": "3",
                    "time": "18/08/2022-05:01:48",
                    "content": "Hey @Brenner - great to see you here! One quick bit of additional context that I’ll surface here - VCs also see personal upside from their deployment of capital through carry. This usually serves as a significant source of compensation, in addition to the management fee. Uniswap Foundation members wouldn’t have access to this - as they deploy non-dilutive capital to projects in the ecosystem. In order to make sure that the Foundation is able to retain specialized talent and isn’t plagued by the turnover and instability other projects in the space are facing, $10.3M for 12 staff over 3 years is very reasonable. In fact - it’s not uncommon for other projects in the space to allocate more to their founding team members. Also, as @Fishbiscuit mentioned, the roles UF is hiring for aren’t all in capital deployment - with roles in governance, community, partnerships, and devrel. Considering Uniswap’s position in the ecosystem and the sheer extensibility of a DEX, the Uniswap Foundation has an incredible opportunity to drive decentralized growth, advocate for the protocol, and reinvigorate governance - creating massive additional value for all of Uniswap’s stakeholders in the process. The sky is truly the limit when it comes to Uniswap’s future. That being said - I fully trust @devinwalsh and @kenneth that these 12 roles will help the Uniswap Foundation propel the Uniswap ecosystem forward. Thank you both for the months of intentionality and preparation that came before this proposal. It was a joy to read and I’m excited to share my support for the Uniswap Foundation. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.2898148148148145
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Kades",
                    "index": "59",
                    "likes": "0",
                    "time": "09/09/2022-21:08:55",
                    "content": "What if the biannual report turns into a trimestral report? For me it would provide more expectative allignment with the community. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Kades",
                    "index": "60",
                    "likes": "0",
                    "time": "09/09/2022-21:33:14",
                    "content": "Let me divague here and suppose that UF won’t deliver any of those OKRs… Does the protocol would suffer any kind of impact? I mean, 74M doesn’t seem to be an expressive amount of capital to Uniswap. Wouldthe protocol losses its credibility with the community if something like that happen? And if it’s yes, why would it lose if UF have nothing to do with Uni Labs? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.8125
                }
            ]
        },
        {
            "thread_link": "https://gov.uniswap.org/t/consensus-check-create-the-uniswap-foundation/17457",
            "title": "[Consensus Check] Create the Uniswap Foundation ",
            "index": 17457,
            "category": [
                "Consensus Check"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/devinwalsh",
                    "index": "1",
                    "likes": "6",
                    "time": "10/08/2022-15:25:38",
                    "content": "Vote on the Consensus Check here: Snapshot The Consensus Check vote ends on Monday, August 15 at 12PM noon EST. ~ Thank you to everyone who has read our proposal to create the Uniswap Foundation thus far! Our conversations with you have energized us even more about the opportunity for the UF to positively impact the Uniswap ecosystem. We have added additional information about the UGP and other topics discussed in the Temp Check forum to the addendum of the proposal. Link to temperature check governance forum post: [Temperature Check] Create the Uniswap Foundation Link to snapshot poll: Snapshot  Uniswap Foundation: Preamble Uniswap has already changed the world. In only 3 years, the world’s first automated market maker has pioneered DeFi primitives, supported more than $1T  in cumulative volume, and served millions of users  worldwide. Its daily volume today is on par with Coinbase . Ownership of the protocol was transferred to the community  in 2020 and since then the Uniswap Grants Program (UGP) has demonstrated the potential for community-funded initiatives to make a positive impact. Over 1.5 years, UGP has funded 120+ grantees  improving governance, and developing new interfaces and developer tooling. However, there is still work to do to help Uniswap reach its full potential. The governance process has too much friction, the ecosystem is too difficult to navigate, and UGP in its current form is not able to fund the most ambitious and impactful projects. We want to change that. Today, we are excited to propose the creation of the Uniswap Foundation, which has the mission to support the decentralized growth and sustainability of the Uniswap Protocol and its supporting ecosystem and community. In other words, the goal of the Uniswap Foundation is to support you. Uniswap’s community is expansive, encompassing the universe of individuals and organizations which build on and benefit from decentralized protocols. Your contributions have already made Uniswap a success, but we want to help you accomplish much more. The Uniswap Foundation (UF) will provide grants to builders, researchers, organizers, academics, analysts, and more to grow the Protocol and plan for its future. It will make it easier to govern the protocol and community treasury, and to navigate the broader ecosystem. It will help you make an impact – to reduce friction, and amplify your efforts. We believe that Uniswap will be the value exchange layer of the Internet. It brought the automated market maker to the masses. It has led the way in the evolution and growth of DeFi and web3. It is censorship resistant, permissionless, decentralized, and secure – constituting a set of properties which we believe should define our world’s financial infrastructure. But there is still a long way to go for Uniswap to reach its full potential. We’re excited to work with all of you to make that happen. If you’re excited too, please read our proposal, comment, reach out to chat (our DMs - @devinawalsh  and @nkennethk  are open!), and spread the word.  Uniswap Foundation Proposal This proposal is being put forth by the Uniswap Foundation, a Delaware corporation formed by Uniswap community members Devin Walsh  and Ken Ng  to facilitate the steps outlined in this proposal.  TL;DR  Today, we are thrilled to propose the creation of the Uniswap Foundation (UF).  Scope: The UF, the first Foundation of a major protocol to go through the community governance process, will support the Protocol’s decentralized growth, reinvigorate governance, and serve as a Protocol advocate.  Team: Devin Walsh will serve as the Executive Director, Ken Ng will serve as Head of Operations, and they will build out a team of 12.  Budget: To fund these efforts, we are requesting:  A $14M Operating budget to cover a full team for 3 years A $60M expanded Uniswap Grants Program (UGP) budget to cover 3+ years We are requesting $74M total, which will be broken into two disbursements, with a first disbursement of $20M.    Governance Participation: We are also requesting 2.5M UNI to participate in governance, primarily through delegation. Through usage of a new smart contract primitive The Franchiser , this UNI will be revocable by the DAO at any time, and cannot be used for any purpose outside of governance.   Uniswap Foundation  Mission In pursuit of a more open and fair financial system, the Uniswap Foundation supports the decentralized growth and sustainability of the Uniswap Protocol and its supporting ecosystem.  Key Activities and OKRs We have listed our starting OKRs below. It’s possible these OKRs will have to change in the future. If they do change in a meaningful way, we will communicate that to the community. Growth: Promoting Decentralization & Growth of the Protocol and Ecosystem  OKR 11298×840 94.6 KB  Governance: Reinvigorating the Uniswap Community Governance Process  OKR 21282×342 36.5 KB  Advocacy: Advocating for the Protocol and amplifying its positive social impact  OKR 31306×328 52.9 KB  Optimism Phase 0 token distribution link here   Year 1 Roadmap Our roadmap for the first year of operations includes but is not limited to the following activities:  Year 1646×825 252 KB  Optimism Collective community Constitution link here   Team Devin Walsh , Executive Director (ED) As ED, Devin will be responsible for setting UF’s strategic vision alongside the Board and driving execution to achieve that vision. Devin has been in crypto since 2016. She has conducted independent research for MIT’s Digital Currency Initiative , worked on decentralized identity at uPort (ConsenSys), and led protocol and venture investments at CoinFund. She has consulted with Edge & Node and cLabs , and led MIRA , a seed stage startup at the intersection of fine art and NFTs. She recently resigned as Chief of Staff at Uniswap Labs in order to propose the creation of the UF. Ken Ng , Head of Operations As Head of Operations, Ken will build and scale processes to maximize the UF’s impact. Ken has served the Uniswap ecosystem as Lead of the Uniswap Grants Program  for the past 1.5 years. He has helped run the Ethereum Foundation Ecosystem Support Program , which gave Hayden his initial grant  to build Uniswap. He served as COO of Slingshot Finance  and cofounder of his nonprofit eduDAO , which helps raise funds for students and teachers in the Bronx. The needs, and thus the makeup, of our team may change over time. However, today we aim to hire for following roles, with a focus on filling the Grants and Governance roles first:  Applications are open today! Check out job descriptions here . As noted by Other Internet , there is also a need for new structures to “facilitate coordination across the complex web of stakeholders” within the Uniswap ecosystem. To provide this much needed coordination, the UF will be committed to working with a variety of independent parties (freelancers, development teams, research fellows, analysts, and more) to achieve many of its objectives.  Advisors The Foundation’s initial advisory team will be made up of the following individuals:   Jesse Walden , Founder and GP, Variant   Julia Rosenberg , Co-Founder, Orca Protocol    Alexis Gauba , Co-Founder, Opyn ; Co-Founder, she256    Hart Lambur , Co-Founder of UMA    In addition to advising UF on strategy and roadmap, this group will, alongside the Executive Director (ED) and Head of Operations,  Provide input on UF’s initial hiring decisions. This may include interviewing potential candidates and sharing feedback with the Committee as it determines its first hires, including its third Board member and at least next three team members. Become temporary signers of the UF multi-sig, which will hold UF funds if and when the proposal is passed, for the sole purpose of executing approved proposals as instructed. This responsibility will be transitioned to UF team members once they are hired.   Board Devin Walsh and Ken Ng will serve as the first two Board members of the UF. Alongside the UF’s Advisors, they will interview and target to hire a third Board member in the first 3 months of operations.  Budget We are requesting $74M in UNI. This funding would be broken down into the following buckets:  $60M for Uniswap Grants Program  Grants spending will be broken down into the below categories. We will revisit and readjust these categories as needed to ensure we continue to deploy resources where they are most impactful. We are proud of the work done by UGP thus far (memorialized in this retrospective ), and are incredibly excited to expand the scope of its work.  We are already in the process of assessing several high impact grant proposals which UGP would be excited to fund, if and when this proposal is passed. Two examples are:  A version of Uniswap v3 written in Cairo, to be deployed on Starknet A prototype of an MEV estimation tool leveraging machine learning techniques built by respected academics in the space  We are also excited to continue funding ongoing work by existing grantees funded by UGP v0.1, including governance experiments and analyses from Other Internet, customer support from Serv.eth, and ETHGlobal hackathons. To ensure community alignment with larger grants disbursements, the UF will put forth an off-chain Snapshot to the community for proposed grants larger than $2M. We believe that this Grants budget will last approximately 3 years but this is subject to change depending upon the number and quality of applicants. We plan to approach the Treasury for additional Grants funds when there are ~6 months of funds remaining.   $14M operating budget to build out a full team of 12 over the next two years.  In order to provide stability to our employees and to sustain the Foundation, we may make a request to the community for additional funding for further out than 3 years when we return to the Treasury at 6-12 months of operations (read more below). Budget estimate looking forward three years is below.  *Inclusive of UNI vesting. In order to incentivize a highly qualified team, the UF will offer competitive compensation packages including both fiat and long-term vesting UNI. To provide full transparency, we will disclose UF financials later this year. **The UF will allocate an additional $2M in funds to cover legal fees in the case of unexpected future litigation.  Fund Disbursements An approval of this proposal is an approval for the full $74M budget requested. We are requesting the funds in two disbursements:   $20M now to cover operating expenses for the next 2 years and grants for 1 year. Assuming a UNI price of $7.04*, this initial request totals to 2,840,909 UNI.   $54M, to be disbursed by the Uniswap Treasury in 6-12 months once the UF has completed the establishment of its legal entity. The UF will publish a post on the forum notifying the community a week prior to putting forth a formal governance proposal for the remaining funds. In other words, because this proposal approves the full amount of funding, we will not go through an additional the Temperature Check and Consensus Check steps to receive this second disbursement.  *To calculate our final UNI request we will use the 30 day TWAP on the day we put forth our Governance Proposal. $7.04 is approximately the 30 day TWAP as of 8/3/2022.  Governance Participation The UF is also requesting 2.5M UNI to participate in governance. These tokens will be delegated to the UF by the Uniswap DAO through a new smart contract design, The Franchiser , which ensures the tokens are only used for delegation, and allows the DAO to claw back the tokens at any time. The UF plans to use these tokens primarily for delegation to community members without the requisite 2.5M UNI to submit a governance proposal, however the UF may also self-delegate the UNI to vote, and to put up its own proposals. The Franchiser was developed by Noah Zinsmeister  and was audited by Trail of Bits .  Next Steps We are excited to discuss this proposal with the broader community as it passes through the Request for Comment phase. Should sentiment be positive, a Temperature Check Snapshot poll will be set up on Mon., August 8. If the Temperature Check poll passes, additional feedback will be incorporated before moving forward to the Consensus Check. Additionally, to discuss the proposal and answer your questions, we plan to attend the Uniswap Community call at 4 PM EST on Wed., August 10, and to host a Twitter Spaces on @uniswapgrants at 11 AM EST on Mon., August 15.  Addendum  What is UF’s relationship with other ecosystem entities? The goal of the UF is to be one of many organizations supporting the Protocol. UF’s overarching focus will be on seeding and growing an ecosystem of entities supporting the Protocol.  What is UF’s relationship with Uniswap Labs? The UF is an independent entity whose mandate will be to grow Uniswap’s usage, reinvigorate the governance process, and advocate for the protocol and community. To achieve those goals, it will build its own lean team, and provide grants to, support, and/or work alongside a number of existing and new values- and mission-aligned organizations. Uniswap Labs is one of many organizations in the Uniswap ecosystem. It built, deployed, and, alongside many other teams, will continue to contribute to and build on the Protocol in the future. As a commitment to the proper decentralization of the protocol, Uniswap Labs had previously provided a royalty free perpetual license for V3 and related trademarks to the Uniswap Grants Program and selected grantees at UGP’s discretion. To succeed, the UF will require the ability to grant v3 BSL license exemptions, to maintain the governance forum, Sybil.org , and Protocol-related developer docs, and to help facilitate protocol development across many teams. Labs has given their blessing to this preliminary proposal for asset transition.  What kind of legal entity will UF be? Currently, this proposal is being made by the Uniswap Foundation, a pre-existing Delaware corporation formed by Uniswap community members Devin Walsh and Ken Ng. However, the UF team is conducting extensive research to determine the type of legal entity which best matches our ambitions, including our mission to make a positive social impact. The entity should also give the UF the ability to enter into contracts, open a bank account, and hire employees. Given these requirements, we are contemplating a US-based entity that would seek tax-exempt status. As there is no guarantee that tax-exempt status will be secured, we may make modifications to UF’s structure and operations in the future. We will share more about our path forward with the community as soon as we are able to.  What will happen to the $UNI after it’s sent to the UF? If the proposal passes, funds will be sent to the UF multi-sig, which is custodied by the ED, Head of Operations, and UF Advisors. To provide runway for our team and grantees, we intend to convert all $20M of the initial UNI disbursement to stablecoins and fiat over the first month of operation. We have established relationships with multiple brokers, are also exploring private sale options, and plan to pursue an approach which will minimize UNI price impact. We similarly plan to diversify the remainder of funds in the second disbursement. At least one month prior to transfer, the UF will publish a Foundation Treasury Diversification report for this UNI. In the report, we will detail the amount we plan to diversify, which broker we plan to use, and how we plan to price the UNI sold.  How does UF’s Budget compare with the budgets of similar organizations across web3? The $74M budget represents ~1.05% of the total UNI supply. This is a relatively small percentage of UNI supply compared to the percentage of tokens allocated to Foundation and Grant programs by other protocol teams.  45% of OP tokens have been allocated to an Optimism Ecosystem Fund (25%) and Retroactive public goods funding (20%) (here ) An unpublished portion of ~22% of dYdX were allocated to current and future employees and consultants of the Foundation (here ) ~26% of GRT was allocated to The Graph Foundation, educational programs, and grants (here ) 25% of CELO was allocated to Community and Operational Grants (here ) 12.5% of SOL was allocated to the Solana Foundation (here ) The Ethereum Foundation holds a treasury of $1.6B (here )   What happens to UGP and the UGP Subcommittees? To start, UGP will continue operations as it exists today with the existing Allocation Committee. Once the Grants Lead is hired, they will lead all grants funding decisions and require final approval from either Devin or Ken (⅔ approval required from Grants Lead, Ken, and Devin). UF plans to continue to fund the existing UGP subcommittees as separate, supportive entities. The Stable  subcommittee will continue to be made up of Ken and Boris . The UGP Community Analytics subcommittees will continue to be made up of Yj , Fede, RantumBits , Annamira , TZM, and Trea Qura.  How does the UF plan on being sustainable over time? This proposal would fund UF operations for at least 3 years. In the future, we plan to return to the community to increase our operating budget when we approach 18 months of runway. We also predict our grants budget will last approximately 3 years. In the future, we plan to return to the community to increase our grants budget when we approach 6 months of funds remaining.  What is UGP, and how do I find out more about it? The Uniswap Grants Program started after going through a governance vote in December 2020 for an allocation of $1.5M in UNI intended to last 6 months. While the initial set of priorities for UGP was narrowly scoped as an MVP to seed the ecosystem of developers, it has since grown to encompass more, including governance research, community building and education, and core protocol work. Due to the crypto market bull run we were able to give $7M in grants over 18 months. Grants researcher @sovereignsignal  also recently put together a fantastic (independent) write-up on the history of the UGP here. For more information on UGP’s past work and grantees check out the following links:   UGP Homepage  (still accepting applications!) UGP Twitter UGP Process Outline  UGP RFPs & Challenges  UGP Grantees  (h/t @sovereignsignal ) UGP Subcommittees (delegated resource allocators for targeted grants focused within a specific category)   The Stable led by b0r4   UGP Community Analytics led by Yj, Fede, RantumBits, Annamira, TZM, and Trea Qura      What does a successful UGP grant look like? What are some UGP success stories? Grantees have done some incredible work over the past 1.5 years - for more information, check out our recent retrospective on UGP v0.1. However, most UGP grantees are less than a year old. Just like with any product, it may take some time and several iterations for grant projects to develop traction and see adoption. The first version of Uniswap only worked for a single LP and ETH/ERC20 pair, and looked much different than the Uniswap we know and love today (still live here !). Hardat, too, took time to become what it is today - Nomic Labs received its first grant in 2018. With that being said, not every grant will have the same outcome as a Uniswap or Hardhat. Not every grant will have runaway adoption, just like with any startup. Even when a project does not have the expected or intended impact, it can still have a positive impact on the ecosystem, bringing in new developers, users, and ideas. Grantee success can be a range of impactful outcomes and, although we can’t pick favorites, some notable highlights are:   Serv.eth Discord support - a globally distributed team of 10 supporting the Uniswap Discord server all hours of every day. They have resolved over 15,000 community support tickets (and counting!), from helping users set up their first wallet and making their first trades, to identifying scammers and helping others retrieve funds.  GFX labs cross-chain governance research - The GFX team have been active Uniswap contributors since the beginning — they were one of the first LPs on v3! Their UGP-funded research led to the the Protocol’s first cross-chain governance proposal, the deployment of the 1bps fee tier on Polygon.  Chaos Labs TWAP hardhat plugin - One of Uniswap’s most under-appreciated innovations is the TWAP oracle, a core but admittedly complex DeFi primitive. Chaos Labs recognized the need for more robust tooling and documentation to make integrating TWAPs more accessible. They created a Hardhat plugin so anyone can leverage its robust security and accurate price reporting.  Scopelift Seatbelt & Flexible Voting- Scopelift productionised Seatbelt for governance testing. This test suite not only protects against unverified contracts, but also simulates proposals locally to ensure they deploy results properly. Additionally, their initial work on Flexible Voting would enable governance tokens locked in other protocols (for example, cUNI) to be leveraged for cross-protocol governance voting.  OmniAnalytics uniswappeR - The first R package created to interact with, quickly query, and trade on Uniswap, opening the door for more advanced data analyses. The Omni team went above and beyond their grant scope to deliver video tutorials, extensive documentation, and an easy dashboard generator  for in-depth exploration of trade history, LP and price simulations under infinitely customizable conditions including slippage and liquidity depth.  TechEducators Solidity Bootcamp - As an established web2 bootcamp, the team behind ETHAnglia have built an open source Solidity Bootcamp to better usher web2 developers into web3 with a focus on building secure Ethereum dApps. Their target demographic reaches to underserved populations in the UK, offering scholarships and free mentorships. Through this work, they have received recognition and further support from the UK government through the Department for Works and Pensions.   How will UGP be improved within the UF? Even with the success cases listed above, there are a number of ways that we’re excited to improve UGP for the benefit of the ecosystem.   Provide grants to universities and research institutions: Today, UGP is a multisig without a legal entity so we are unable sign contracts with or award grants to universities and academic research institutions, among others. As a legal entity, the UF would allow us to work with these organizations.  Diversify assets: No legal entity also means UGP could not diversify its assets out of UNI due to a lack of clarity around tax liability. This has made it impossible to scope out and provide larger and longer-term grants due to UNI price risk. The ability to diversify our assets will allow us to award these kinds of grants, for more ambitious and impactful projects.  Full-time well-compensated team: UGP v0.1 was able to pay its small group of contributors part-time (≤30 hours per week). With an entity and full budget, the UF will be able to hire a full-time and well-compensated team. We also want to recognize the fact that a few UGP team members would still work 40+ hour weeks and weekends, uncompensated, due to a love for this work!  Upscale all of UGP: With a formal entity, larger budget, and a full-time team, we would be able to improve our internal processes, from the applicant pipeline through feedback cycles, decisions, disbursements, and ongoing grantee management. We can do more in proactive outreach to fill our pipeline with fresh ideas and new teams. We could shine more of a spotlight on the impact grantees have had on the community. We will also be able to scale up our legal and accounting capabilities required for a more comprehensive grants program.  More communication: With a larger team and a Comms/Social Media Lead, the UF would be able to more frequently highlight the work of grantees, as well as its own processes, decision-making frameworks, and operations to the community.  Linking to comments in Temp check for outstanding questions, we hit the character limit!  What kinds of Grants would an expanded UGP be able to provide?     [Temperature Check] Create the Uniswap Foundation Temperature Check       Hey Dan - Ken just added a lot more info about UGP and how we want to improve it as a comment below, and I’m about to add that to the Addendum of the Proposal as well for the Consensus Check. UGP won’t be sunset, it will operate under the UF and scale up its resources and team.  As for the kinds of ambitious projects we would now be excited to fund? Listing many below, but we’re just as excited to be blown away by new ideas the community dreams up.   Novel incentive programs, like a developer mi…      What types of candidates are you seeking for 3rd board member?     [Temperature Check] Create the Uniswap Foundation Temperature Check       Re: UGP. Thank you for the comments here! (For others: Ken and I are also writing up some additional history and information about UGP to add as a comment in the forum later today and to the addendum in the next version of the proposal!)  Re: governance. Agree! And a proposed governance process revamp is definitely in scope for our first 3 months (inspired by this post, with additional community feedback)  I’ll publish answers to the rest of your questions in line:   The biggest thing that stood…      Can you provide more information about the Grants funding allocation for novel incentive mechanisms?     [Temperature Check] Create the Uniswap Foundation Temperature Check       Re: UGP. Thank you for the comments here! (For others: Ken and I are also writing up some additional history and information about UGP to add as a comment in the forum later today and to the addendum in the next version of the proposal!)  Re: governance. Agree! And a proposed governance process revamp is definitely in scope for our first 3 months (inspired by this post, with additional community feedback)  I’ll publish answers to the rest of your questions in line:   The biggest thing that stood…      How did you decide to set OKRs the way they are set in this proposal?     [Temperature Check] Create the Uniswap Foundation Temperature Check       This is a fair point. Ken and I have went back and forth a lot on the best way to set OKRs. The first set of OKRs we wrote for the UF focused on increased volume, number of new users and developers in the space, number of “high impact, high engagement” governance proposals, etc. These are the results which all of our work would aim to have.  However, we got stuck is defining the “right” numbers to tie to those results- how much volume might increase, when (it might take a talented dev team time …      How does the fee switch play into the UF’s roadmap?     [Temperature Check] Create the Uniswap Foundation Temperature Check       It would be well within the scope of the UF to welcome, encourage, and provide grants to research and analysis on the fee switch, and to promote better education around the mechanics of fee switch implementation.  It would also be well within the scope of the UF to assist the community in decision-making regarding the fee switch, including putting out information regarding any polls or governance proposals regarding the fee switch (just as we intend to for all other governance proposals). It’s b…     If this proposal is passed, we and the Foundation shall undertake our work abiding by the covenant of good faith and fair dealing. It is the Foundation’s current intent to use the disbursement in accordance with the terms of, and achieve the results described in, this Proposal. However, it is not possible to predict the course of future events, and thus actual uses and results may vary. If material changes to the operations of the Uniswap Foundation are required, we intend to put forth a subsequent vote to the community prior to making those changes. Subject to any future agreement by the DAO to the contrary, the Foundation will hold the DAO and its members harmless with respect to any liabilities or damages assessed against the Foundation or its personnel based upon the making of the disbursement, the Foundation’s or its personnel’s use of the disbursed tokens or any other activities undertaken by the Foundation or its personnel in furtherance of the foregoing, other than liabilities or damages arising out of the DAO’s fraud, willful misconduct or criminal activity. Disclosure: Devin and Ken both hold UNI tokens. To the extent that readers find it relevant, Devin also holds a small amount of Uniswap Labs equity. ",
                    "links": [
                        "https://gov.uniswap.org/t/temperature-check-create-the-uniswap-foundation/17358",
                        "https://snapshot.org/#/uniswap/proposal/0xee4851601143b1e9655be7168ca2d0f119fba31afadf2a7f808ea12b7bb4e9df",
                        "https://twitter.com/Uniswap/status/1529102980296867842",
                        "https://dune.com/rchen8/defi-users-over-time",
                        "https://twitter.com/Clara_Medalie/status/1549048362489741313",
                        "https://uniswap.org/blog/uni",
                        "https://mirror.xyz/kennethng.eth/0WHWvyE4Fzz50aORNg3ixZMlvFjZ7frkqxnY4UIfZxo",
                        "https://twitter.com/devinawalsh",
                        "https://twitter.com/nkennethk",
                        "https://twitter.com/devinawalsh",
                        "https://twitter.com/nkennethk",
                        "https://github.com/NoahZinsmeister/franchiser",
                        "https://global.discourse-cdn.com/business6/uploads/uniswap1/original/2X/6/619bc0745412b267da6d9b54787fc42bbd325493.png",
                        "https://global.discourse-cdn.com/business6/uploads/uniswap1/original/2X/c/c8b88b9477f9c2c81ab5457cca4e9552781b3bf6.png",
                        "https://global.discourse-cdn.com/business6/uploads/uniswap1/original/2X/1/140c46d1c2e79f9e6dab44fbfb65826e578e3a59.png",
                        "https://community.optimism.io/docs/governance/gov-fund/",
                        "https://global.discourse-cdn.com/business6/uploads/uniswap1/original/2X/0/0b9a3fb2b8ad0bb2eb400d0cdb1d391ee5ef9f06.png",
                        "https://gov.optimism.io/t/working-constitution-of-the-optimism-collective/55",
                        "https://twitter.com/devinawalsh",
                        "https://dci.mit.edu/",
                        "https://www.uport.me/",
                        "https://www.coinfund.io/",
                        "https://edgeandnode.com/",
                        "https://clabs.co/",
                        "https://miraimaging.com/",
                        "https://twitter.com/nkennethk",
                        "https://www.unigrants.org/",
                        "https://esp.ethereum.foundation/",
                        "https://blog.ethereum.org/2018/08/17/ethereum-foundation-grants-update-wave-3/",
                        "https://slingshot.finance/",
                        "https://www.edudao.org/",
                        "https://jobs.lever.co/uniswapfoundation",
                        "https://otherinter.net/research/uniswap-governance-findings/",
                        "https://twitter.com/jessewldn",
                        "https://variant.fund/",
                        "https://twitter.com/JulzRoze",
                        "https://www.orcaprotocol.org/",
                        "https://twitter.com/AlexisGauba",
                        "https://www.opyn.co/",
                        "https://she256.org/",
                        "https://twitter.com/hal2001",
                        "https://umaproject.org/",
                        "https://mirror.xyz/kennethng.eth/0WHWvyE4Fzz50aORNg3ixZMlvFjZ7frkqxnY4UIfZxo",
                        "https://github.com/NoahZinsmeister/franchiser",
                        "https://twitter.com/NoahZinsmeister",
                        "https://www.trailofbits.com/",
                        "http://sybil.org/",
                        "https://community.optimism.io/docs/governance/allocations/#allocations-at-a-glance",
                        "https://docs.dydx.community/dydx-governance/start-here/dydx-allocations",
                        "https://thegraph.com/blog/announcing-the-graphs-grt-sale",
                        "https://medium.com/celoorg/understanding-cgld-allocation-estimated-circulating-supply-over-time-f08a063a23ad",
                        "https://messari.io/asset/solana/profile/launch-and-initial-token-distribution",
                        "https://ethereum.foundation/report-2022-04.pdf",
                        "https://www.notion.so/3430a00270ea4d79be5c70d4ca99680a?v=b7b7697e1ff44055b87a6bd3480a3b2d&p=ed5d138f443d4c13997bf1572cfbd2e7",
                        "https://twitter.com/B0R444",
                        "https://twitter.com/uniyj1",
                        "https://twitter.com/Fly_Ams",
                        "https://twitter.com/RantumBits",
                        "https://twitter.com/annamirajo",
                        "https://twitter.com/Treaqura",
                        "https://gov.uniswap.org/t/rfc-uniswap-grants-program-v0-1/9081",
                        "https://twitter.com/sovereignsignal",
                        "https://sovereignsignal.substack.com/p/breaking-down-the-uniswap-grants",
                        "https://www.notion.so/Welcome-to-UNI-Grants-6e3e84967a984a5fb127ae749649ddc9",
                        "https://twitter.com/uniswapgrants",
                        "https://www.notion.so/5b34ef6b77964960844a86daeb4d9a26",
                        "https://www.notion.so/RFPs-Challenges-3be614ba4e504b5caeee7b0159e64a42",
                        "https://www.notion.so/8e8ba8344967488a85106309d48a4a3a",
                        "https://twitter.com/sovereignsignal",
                        "https://www.notion.so/The-Stable-the-first-30-days-b3826f0cae964b1aa3a02e3188e2cd4f",
                        "https://twitter.com/B0R444",
                        "https://www.notion.so/b09bbb16579d4a569b7e2d393afc4459",
                        "https://twitter.com/uniyj1",
                        "https://twitter.com/Fly_Ams",
                        "https://twitter.com/RantumBits",
                        "https://twitter.com/annamirajo",
                        "https://twitter.com/Treaqura",
                        "https://mirror.xyz/kennethng.eth/0WHWvyE4Fzz50aORNg3ixZMlvFjZ7frkqxnY4UIfZxo",
                        "https://haydenadams.github.io/uniswap-retro/",
                        "https://hardhat.org/",
                        "https://serveth.support/",
                        "https://gfx.xyz/",
                        "https://app.uniswap.org/#/vote/2/14?chain=mainnet",
                        "https://chaoslabs.xyz/",
                        "https://github.com/ChaosLabsInc/uniswap-v3-oracle-cli",
                        "https://chaoslabs.xyz/posts/chaos-labs-uniswap-v3-twap-deep-dive-pt-1",
                        "https://www.scopelift.co/",
                        "https://github.com/Uniswap/governance-seatbelt",
                        "https://gov.uniswap.org/t/temperature-check-upgrading-to-a-flexible-voting-enabled-governor/17098",
                        "https://omnianalytics.org/",
                        "https://github.com/Omni-Analytics-Group/uniswappeR",
                        "https://m.youtube.com/watch?v=GpWZLMB2lvM",
                        "https://github.com/Omni-Analytics-Group/uniswappeR",
                        "https://github.com/Omni-Analytics-Group/uniswappeR-dashboarding",
                        "https://techeducators.co.uk/",
                        "https://gov.uniswap.org/t/temperature-check-create-the-uniswap-foundation/17358/37",
                        "https://gov.uniswap.org/t/temperature-check-create-the-uniswap-foundation/17358/33",
                        "https://gov.uniswap.org/t/proposed-simplifications-to-the-uniswap-governance-process/15906",
                        "https://gov.uniswap.org/t/temperature-check-create-the-uniswap-foundation/17358/33",
                        "https://gov.uniswap.org/t/proposed-simplifications-to-the-uniswap-governance-process/15906",
                        "https://gov.uniswap.org/t/temperature-check-create-the-uniswap-foundation/17358/23",
                        "https://gov.uniswap.org/t/temperature-check-create-the-uniswap-foundation/17358/16",
                        "https://gov.uniswap.org/t/governance-proposal-create-the-uniswap-foundation/17499"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.759012570192922
                }
            ]
        }
    ],
    "group_index": "211"
}