{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/why-delegate-your-votes-to-me/4061",
            "title": "Why delegate your votes to me ",
            "index": 4061,
            "category": [
                "Delegation Pitch"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/Portuno",
                    "index": "1",
                    "likes": "4",
                    "time": "19/09/2020-21:05:55",
                    "content": "1- I will vote no to any proposal on making new airdrop, keeping your money away of unnecessary inflation. 2- I see a potential on smart contracts that goes far beyond their economic and financial growth (that is currently a lot), but as a resource to actually built an entire society based on blockchain system. 3- This is chaos, and it was beautiful, but at some point, if we want to become mainstream (and rich) we need order. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.614853896103896
                },
                {
                    "author_link": "https://gov.uniswap.org/u/RodAthens",
                    "index": "2",
                    "likes": "0",
                    "time": "19/09/2020-21:09:35",
                    "content": "can you elaborate on point 3? what kind of order are you talking about and how are you planing to ensure that it happens? Democracy is chaotic imo ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.75
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Portuno",
                    "index": "3",
                    "likes": "1",
                    "time": "19/09/2020-21:15:49",
                    "content": "I have thinking on this for a while, but the idea of order in a sense of: “Creating a whole constitution on smart contracts”. At least here in Argentina (US has a different form of constitution, but every country has its own), there is two parts: 1- A dogmatic one (in the us this are the ammends) in which people talks about their rights and yada yada, thats the part if which we declare our descentralization and let the chaos embrace the beuty. 2- A organic. This is the part formed in “contracts” in the constitutions, and is what could be easily replaced by smart contracts. I have already made a post on the proposal discussion about the creation of something based on the legislative power. Before this, i was working on a tecnocrat constitution as a thesis work, irl im a lawyer in Argentina but im planning on emigrating and working on it on international universities once this COVID thing normalizes a bit jajajajaja0 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.851190476190476
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Tim",
                    "index": "4",
                    "likes": "0",
                    "time": "20/09/2020-18:44:14",
                    "content": "Politics from day one!!! Vote for me and i make you money GREAT AGAIN! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Portuno",
                    "index": "5",
                    "likes": "1",
                    "time": "20/09/2020-21:41:48",
                    "content": "I mean, yes. I came here for the money, but stayed because of the politics jajajaja.  And for more money  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.46875
                },
                {
                    "author_link": "https://gov.uniswap.org/u/kbridge",
                    "index": "6",
                    "likes": "0",
                    "time": "22/09/2020-15:04:15",
                    "content": "Do you know how to create smart contracts? Or how would you go about that? I really like the idea of voting no to more Airdrops. Also the smart contract part. I really like it. If you could give us more details of how we would go about it, you definitely got my votes. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.3061224489795915
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Portuno",
                    "index": "7",
                    "likes": "0",
                    "time": "22/09/2020-16:29:04",
                    "content": "Im a lawyer, so i have my experience around all kind of contracts. Im not a programmer but I know my way around Python, and i´m currently reading the documentation on Uniswap. I´m not confident enough to write smart contracts tho, lets say that I can read but not write them yet. EDIT: I Know how to write and read contracts, and im learning how to write and read smart contracts. My reading level are ahead of my writing ones, but i´m dedicating my spare time to this, i have a job and responsabilities IRL. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.648809523809524
                }
            ]
        }
    ],
    "group_index": "331"
}