{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/boris-stanic-bor4-community-first/12667",
            "title": "Boris Stanic (\"BOR4\") - Community first ",
            "index": 12667,
            "category": [
                "Delegation Pitch"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/BOR4",
                    "index": "1",
                    "likes": "1",
                    "time": "30/05/2021-09:55:02",
                    "content": "Hello Uniswap governance. My name is Boris Stanic but you might know me under my handle “BOR4”. I’ve been with Uniswap project since September 2020 and recently I’ve joined Uniswap Grant Program as the leader of The Stable subcommittee. Since the first day I’ve joined Uniswap project, I’ve always had Uniswap community in focus. I believe the most important metric for a project is strength of it’s community.  Through my work I try to strengthen the community, help them with their needs, onboard new users and in the end make sure everyone enjoys being part of Uniswap project. When making decisions I am very careful and always pessimistic. My favorite question to ask myself when there is decision to be made is: “How would this decision affect project 2 years into the future if 2 years from now we are again very deep into the bear market?”. I believe crypto projects development should be approached in 2 phases. During the bear market you prepare for bull market and during the bull market you prepare for the bear market. I am always open to answering questions or discussing interesting topics. You can find me in Uniswap Discord or just leave a comment here. If you like my approach to Uniswap governance and project, my address is: 0xA7F63376169ccC087EB1160E62ceCcB146C1d555 Thanks! ",
                    "links": [
                        "https://sybil.org/#/delegates/uniswap/0xA7F63376169ccC087EB1160E62ceCcB146C1d555",
                        "https://gov.uniswap.org/t/governance-proposal-up1-2-community-enabled-analytics/13760"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.117832167832168
                }
            ]
        }
    ],
    "group_index": "77"
}