{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/temperature-check-should-the-0-1-or-0-15-fee-tier-be-introduced/13031",
            "title": "Temperature Check \\xe2\\x80\\x93 Should the 0.1% or 0.15% fee tier be introduced ",
            "index": 13031,
            "category": [
                "Temperature Check"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/reuptaken",
                    "index": "1",
                    "likes": "5",
                    "time": "17/06/2021-09:52:59",
                    "content": "To quote Uniswap blog:  Uniswap v3 offers LPs three separate fee tiers per pair — 0.05%, 0.30%, and 1.00%. This array of options ensures that LPs tailor their margins according to expected pair volatility: LPs take on more risk in non-correlated pairs like ETH/DAI and, conversely, take on minimal risk in correlated pairs like USDC/DAI. Although distinct fee tiers may lead to some degree of liquidity fragmentation, we believe that most pairs will calibrate to an ’obvious’ fee tier, which then serves as the canonical market. We expect like-kind asset pairs to congregate around the 0.05% fee tier and pairs like ETH/DAI to use 0.30%, while exotic assets might find 1.00% swap fees more appropriate. governance can add additional fee tiers as needed.  After 6 weeks those important assumptions (emphasis mine) proved not quite correct. For some very important pairs like ETH/USDT, ETH/USDC and ETH/DAI, lot of liquidity (and even more volume) ended up in the lowest, 0.05% tier, dedicated to low risk pairs like USDC/DAI. Uniswap router sends vast majority of retail trades there, while 0.3% price tiers get just arbitrage trades (for more about arbitrage trades read here). Volumes in 0.05% on those pairs match or even exceed those in 0.3% pools. There is no “obvious” fee tier for those important pairs. One can argue that this is how free market works and if liquidity providers (LP) are happy with earning 6x lower fee then let it be this way. Lower fees mean better price for end users, and in the end this may be also beneficial to the LP. I have a different opinion and I think for the long term health of the protocol, additional fee level between 0.3% and 0.05% should be introduced. 6x gap is just too big, and both 0.3% and 0.05% are not appropriate choices for those pairs. Uniswap has to be competitive, there’s no doubt about it. But the question is should it compete so aggressively on fees? Even if we assume direct competition with CEXes (which is a big assumption, I believe CEXes are offering a product that’s not directly competing with DEXes), fees on those exchanges range from 2x higher (Binance) to 50x higher (Coinbase Pro). There are some lower price tiers of course, and if one trades billions/month, she can get 0.05% fee even on Coinbase, but this is far beyond the reach of 99.9% of users. It’s also important to ask if 0.05% vs 0.10% fee on volatile pairs is a big difference for the average user, given that price of ETH can change much more than this in a second. Default slippage (or “price change tolerance”) is much higher. The bottom line is that volumes won’t drop significantly if most trades for ETH/stable (and probably ETH/WBTC) end up in 0.1% tier. Now, why should we care about LPs. It’s their choice to provide liquidity in any fee tier they want. Well, that may be true, but in reality their choice is limited to just 3 tiers. Uniswap v3 introduced competition between LPs. LPs compete by taking more IL risk and getting less fees. Those risks depend on price action which is hard to predict. Overall, the level of risk taken by LPs in v3 is way higher than in v2. It’s quite insane that lot of people are getting the same or lower yield in v3 as in v2 but have 10x higher IL risk.This is the “race to the bottom” situation. Now, when market is sideways, it looks like a good deal, but this can change anytime and liquidity can drop dramatically. While trader swapping tokens on Uniswap can quite easily and instantly compare offers (eg. how much ETH he can buy for 1000 DAI), effects of LP decisions are neither immediate nor easy to understand. Eg. LP getting 0.5 DAI out of 1000 DAI → ETH swap. Is it a good amount? Enough to balance IL in the long run? It’s hard to say. Even after recent drops from $4300 ATH, fees on v2 ETH/USDT pool since its inception are not enough to cover the impermanent loss. This “balance” we see now (lot of trading in 0.05% ETH/stablecoin tier) will not be sustainable in the long run. It can only be sustainable like Forex market is: 80% or so traders lose money there, but extremely aggressive marketing efforts keep new users coming. While on (white)paper we had this quite convincing classification of pairs (exotic, regular, stable) it looks like some “regular” pairs are different. ETH/stable or ETH/WBTC are characterised by high “natural” volume (+ some extra volume from being used as “middleman” pair in some swaps). So one can (very optimistically) say that those pairs are of lower risk and can be traded in lower fee tier. On the other hand, 6x lower 0.05% fee tier, dedicated to stablecoin pairs and to compete with Curve, is too low. That’s why I’d recommend introducing intermediary 0.1% (or 0.15%) fee tier.     0.1% (or 0.15%) fee tier should be introduced 0.1% (or 0.15%) fee tier should not be introduced     0 voters     ",
                    "links": [
                        "https://reuptake.medium.com/liquidity-providing-in-uniswap-v3-3-c82fb9a5f545"
                    ],
                    "GPT-summary": "The author of the post is proposing the introduction of an intermediary fee tier between 0.05% and 0.3% for certain pairs on Uniswap v3. The post explains the current situation with liquidity providers and fee tiers, and argues that the current options are not appropriate for some important pairs. The post also raises concerns about the risks taken by liquidity providers in v3 and the sustainability of the current fee structure. The post ends with a recommendation to introduce an intermediary fee tier.",
                    "GPT-proposal-categories": [
                        "Token economics",
                        "Interoperability and scalability",
                        "Privacy, security, and risk management",
                        "Community and engagement",
                        "Law and regulations"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.759681930623489
                },
                {
                    "author_link": "https://gov.uniswap.org/u/heyJonBray",
                    "index": "2",
                    "likes": "1",
                    "time": "02/07/2021-16:48:20",
                    "content": "I’d like to see dynamic % fee pools that users can set. Minimum, maximum, and you can set it to anything in between. This would be a major upgrade but provide lower gas fees and less gaps between where liquidity is held. For example if liquidity is such that a transaction causes huge slippage in price, liquidity is pulled from other tiers. It would involve essentially wrapping ALL fee pools for a pair into one contract that distributed the position tokens and dynamically pulls from positions people have set in order to reduce the volatility impact on a trade and spread out trades across potentially multiple tiers of pools. Right now were not competitive. No UNI rewards for staking, higher fees, more gas to create a position that cannot be adjusted dynamically. We have the advantage of more liquidity in many pairs but the offerings of SushiSwap and Curve are above and beyond at the moment. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.788052721088436
                }
            ]
        }
    ],
    "group_index": "86"
}