{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/claim-uni-for-contract-address-not-wallet/2337",
            "title": "Claim UNI for contract address, not wallet ",
            "index": 2337,
            "category": [
                "Proposal Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/neshala",
                    "index": "1",
                    "likes": "24",
                    "time": "18/09/2020-07:36:47",
                    "content": "Hi, We have used a few smart contracts to interact with the Uniswap v2 router instead of a wallet, and those addresses can claim 400 UNI per contract. However, once when 400 UNI has been sent to the contract, we don’t have the option to move that tokens, so they will stay locked in the contract. Can you please pass those claimable UNI tokens to the contract owners instead if we provide contract addresses that are eligible to claim UNI? Thanks, Nenad ",
                    "links": [],
                    "GPT-summary": "The author of the post is asking for feedback on a proposal related to claiming UNI tokens for a contract address instead of a wallet. They are also asking a question about the possibility of passing the claimable UNI tokens to the contract owners.",
                    "GPT-proposal-categories": [
                        "Smart contract updates",
                        "Token economics",
                        "Privacy, Security and risk management",
                        "None",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.357142857142857
                },
                {
                    "author_link": "https://gov.uniswap.org/u/jaytee213",
                    "index": "2",
                    "likes": "8",
                    "time": "18/09/2020-18:25:25",
                    "content": "Hi. We will talk about this issue and come up with a plan. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/jogiesim",
                    "index": "3",
                    "likes": "3",
                    "time": "18/09/2020-18:38:23",
                    "content": "I will be interested to know this as well . can we use ethercan to interact with contract? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.uniswap.org/u/jaytee213",
                    "index": "4",
                    "likes": "4",
                    "time": "19/09/2020-02:51:17",
                    "content": "All Questions will be answered asap. Thank you ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Allansimons",
                    "index": "5",
                    "likes": "3",
                    "time": "19/09/2020-05:23:47",
                    "content": "Im appreciate man me too ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/yippee-ki-yay",
                    "index": "6",
                    "likes": "3",
                    "time": "19/09/2020-08:02:04",
                    "content": "This is somewhat of a funny coincidence but I also have UNI stuck on a few personal contracts I used for trading and I’m also named Nenad. Sending tokens that are on a smart contract to the deployer address would be great, not quite sure how to do that in a decentralized manner. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.303571428571429
                },
                {
                    "author_link": "https://gov.uniswap.org/u/jogiesim",
                    "index": "7",
                    "likes": "6",
                    "time": "19/09/2020-14:50:59",
                    "content": "So i have been able to withdraw using my multisig wallet contract address. Just go to https://app.uniswap.org/#/swap click the 3 dots and claim.  enter the multisig address. You will be able to claim tokens using any address to pay eth gas fees but tokens will be claimed into multisig where you can the withdraw. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/AlexVN74",
                    "index": "8",
                    "likes": "5",
                    "time": "20/09/2020-20:50:41",
                    "content": "it would be great to make an option to claim token not to contract address but to contract’s deployer address ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Ben",
                    "index": "9",
                    "likes": "7",
                    "time": "21/09/2020-21:12:57",
                    "content": "I have the same issue for personal contracts as well as contracts that have other peoples tokens staked in them… It would be fantastic to be able to claim and rightfully distribute these UNI. +1 for the claim to deployer address! Thanks for your Consideration  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.916666666666667
                },
                {
                    "author_link": "https://gov.uniswap.org/u/wintermute",
                    "index": "10",
                    "likes": "4",
                    "time": "27/09/2020-15:20:22",
                    "content": "Bumping for visibility, I also have a few contracts (just two actually) that are eligible for rewards, but as I did not anticipate these contracts to be airdropped, there is no way to get the UNIs out of my contracts. One solution could be to upgrade the claim contract such that if the eligible address is a contract, then the deployer address would be the one receiving the reward. In any case, I think addressing these unclaimable rewards is important, whether they end up being rolled into the treasury, burned, or distributed with another reward scheme. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://gov.uniswap.org/u/AlexVN74",
                    "index": "11",
                    "likes": "4",
                    "time": "30/09/2020-15:44:59",
                    "content": "proposal add ability to claim UNI token to contract creator address  add the ability to the claims policy for all contracts in list, extract creator address from blockchain for each line(contract), generate new proof with creator address and the SAME index(and other params) that’s all now you have choice: to claim UNI tokens to creator address or to contract address without UI and smartcontract changes  it would be useful for non upgradable contract with no withdraw functionality ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.389204545454546
                },
                {
                    "author_link": "https://gov.uniswap.org/u/QuickQuests",
                    "index": "13",
                    "likes": "3",
                    "time": "05/10/2020-01:04:45",
                    "content": "    AlexVN74:  it would be great to claim… …contract’s deployer address       Ben:  +1 for the claim to deployer address!   I would like to add a +1 to @Ben’s  above as well.     wintermute:  I think addressing these unclaimable rewards is important, whether they end up being rolled into the treasury, burned, or distributed with another reward scheme.   I also feel the unclaimable rewards should be addressed as well. I like the idea of said rewards being distributed with another reward scheme. Could a claim time limit be introduced? After X time the “unclaimed” could be re-issued or sent to active members of the forum. Another reward in away. It would only happen once otherwise the forum would be filled with useless posts and general garbage just to meet the parameters. It could be measured like the other badges we users receive for earning their first “LIKE”  or “Quote”. The reward should go to those that have given part of themselves for Uni. I do not know how it could or should be done but I do like the thought of knowing the people who have helped me in the past without thought of a reward will actually be rewarded. For example Moderators, or Admins. or simply Individuals that have given a lot of their own time to propel UNI forward. The user that helps other users by answering questions or creating topics / posts that have guided, informed, and broadened the pathway forward by keeping current the information of topic and thus also the readers. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.489583333333333
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Uniguy772",
                    "index": "14",
                    "likes": "7",
                    "time": "05/10/2020-02:24:07",
                    "content": "    QuickQuests:  I also feel the unclaimable rewards should be addressed as well. I like the idea of said rewards being distributed with another reward scheme. Could a claim time limit be introduced? After X time the “unclaimed” could be re-issued or sent to active members of the forum   They cant, as outlined to me and others before at the end of a locked post by admin and Unicorn Noah.The 15% of the total supply set aside at the beginning of the process and sent to the merkle tree for distribution for the airdrop is locked away in the distributor smart contract and cannot ever be accessed or clawed back again if left unclaimed (great in some sense as it will reduce the overall supply/number of tokens in circulation and probably explains why they have an unlimited claim time). image692×232 11.1 KB Situations like the Dharma proposal [Proposal] Excluded Proxy Contract Airdrop — Phase 1 being the only current exception to another airdrop that I’ve seen that a lot of the community and UNI holders say is acceptable and that they would vote for. If voted for the tokens for this would thus be coming out of Community Funds due to the above lock preventing the original 15% being accessible to compensate those who originally missed out on the original airdrop due to their use of other named and accepted platforms, DEX aggregators and other means of calling Uniswap smart contracts. ",
                    "links": [
                        "https://gov.uniswap.org/t/proposal-excluded-proxy-contract-airdrop-phase-1/5811"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.551378446115288
                },
                {
                    "author_link": "https://gov.uniswap.org/u/QuickQuests",
                    "index": "15",
                    "likes": "2",
                    "time": "05/10/2020-12:16:59",
                    "content": "Thank you for taking the time to write this all out… you would be one of the people to which I refer in my post.  I appreciate it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/neshala",
                    "index": "16",
                    "likes": "1",
                    "time": "20/10/2020-14:18:36",
                    "content": "1 month later, any official update? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Dontworry",
                    "index": "17",
                    "likes": "0",
                    "time": "07/11/2020-01:22:55",
                    "content": "I also have used uni thru a smart contract and I have been unable to collect my uni. I have all of the information I need to collect who can I contact about this? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.2857142857142865
                },
                {
                    "author_link": "https://gov.uniswap.org/u/wong",
                    "index": "18",
                    "likes": "2",
                    "time": "05/01/2021-11:00:46",
                    "content": "I redeemed UNI to a smart wallet from my old Maker Dao CDP. (Zerion told me it was possible). But now it’s in that smart wallet and I don’t know how to get it my personal wallet. Is it stuck there? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.5285714285714285
                },
                {
                    "author_link": "https://gov.uniswap.org/u/yannsolol",
                    "index": "19",
                    "likes": "2",
                    "time": "07/01/2021-13:36:11",
                    "content": "I had exactly same issue ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/otaionline",
                    "index": "20",
                    "likes": "0",
                    "time": "14/01/2021-15:31:53",
                    "content": "0xd35A171272E87422553c41C47b0E2Cf8f998088F. how to ckaim ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Pirach25",
                    "index": "21",
                    "likes": "0",
                    "time": "20/01/2021-03:29:03",
                    "content": "Hi how can I got lock how lock in my liquidity in the system with cub-usdt coin how can I get my liquidity? And my ratio is different and how can I get Lp points ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Cholocon",
                    "index": "22",
                    "likes": "1",
                    "time": "27/01/2021-23:46:12",
                    "content": "I traded in UNI for a smart wallet from my old Maker Dao CDP. (Zerion told me it was possible). But now it’s in that smart wallet and I don’t know how to get it in my personal wallet, is there any possibility to transfer the UNIs to my wallet) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.5285714285714285
                },
                {
                    "author_link": "https://gov.uniswap.org/u/phamvandung375",
                    "index": "23",
                    "likes": "0",
                    "time": "01/02/2021-10:57:06",
                    "content": "0xc426cea649f3555428e3583311e8933de18aca95 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/nickharrison2002000",
                    "index": "24",
                    "likes": "0",
                    "time": "13/02/2021-03:58:11",
                    "content": "Hello! IDK if this would be even close to the right area to ask this, but it’s a hail mary I think anyone would take  my address was compromised, I tried getting anyone to help with my 400 tokens to go to a new address but I was told to just get my airdropped coins and send them to my newer address. I tried that, but whoever has my account info got it done before I ever had a chance. Anyone able to help or send me in the right direction to hopefully recover the funds? Also FYI the hacker I believe is getting my coins threw interacting with your contract on etherscan ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.50974025974026
                },
                {
                    "author_link": "https://gov.uniswap.org/u/jonnycrypto727",
                    "index": "25",
                    "likes": "1",
                    "time": "14/02/2021-18:26:45",
                    "content": "this is also where I qam a little lost , i made 100s of txs on my wallet and then i bought xdai and created xdai in uniswap 148 days ago which should fall in the new governance protocol for september 1st to announcement can anyone tell me how I can claim or make sure I am eligable for these 400 coins? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.7481060606060606
                },
                {
                    "author_link": "https://gov.uniswap.org/u/astbb",
                    "index": "27",
                    "likes": "0",
                    "time": "15/02/2021-11:37:10",
                    "content": "To reiterate this suggestion, in the early days, I personally created 12 contracts on Ethereum to interact with unexchanged contracts, and provided liquidity, and the snapshot time was reasonable! I think it is necessary to upgrade the contract claim! It’s like we support each other. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.225
                },
                {
                    "author_link": "https://gov.uniswap.org/u/astbb",
                    "index": "28",
                    "likes": "0",
                    "time": "15/02/2021-18:16:51",
                    "content": "Hello, has the plan been made? Are you a team representative? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Salmawati1",
                    "index": "29",
                    "likes": "0",
                    "time": "07/03/2021-19:08:15",
                    "content": "How to claim? 0x869615d3B96BE9Eb6C83FD17F05D4053E27BBda3 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "289"
}