{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/temperature-check-how-to-10x-lp-earnings-tvl-a-proposal-for-uniswap-v4/20069",
            "title": "Temperature Check - How to 10x LP earnings & TVL. A proposal for Uniswap v4 ",
            "index": 20069,
            "category": [
                "Temperature Check"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/AiSanta",
                    "index": "1",
                    "likes": "0",
                    "time": "19/01/2023-15:52:55",
                    "content": "What is the main problem Liquidity providers (LPs) have today and why is it hard to get new users to provide liquidity? Simple, its crypto volatility and the fear of losing money. So how do you get people to LP without the fear of losing money? Uniswap v4 should have a DeFi model that helps LPs increase their earnings while minimizing loss of capital! This model for Uni v4 should automaticaly adjust the LPs position in the pool based on real time data. For example, in the ETH/USDC pair, if the price of ETH increases ABOVE the pool range, the algorithm could automatically switch the LPs position from USDC to ETH. This would allow the liquidity provider to earn aditional earnings from the increased value of ETH!  Screenshot_20230118-215331_Gallery1440×2559 364 KB  On the other hand, if the price of ETH decreases BELOW the pool range, the algorithm could automatically switch the LPs position from ETH to USDC, reducing the potential losses from holding a declining assest!  Screenshot_20230118-215901_Gallery1440×2580 390 KB  This automatic switch is done today every second in v3 thanks to concentrated liquidity! But it is done in the opposite direction… When the price of ETH decreases BELOW the pool range, the algorithm switches the LPs position from USDC to ETH, increasing the potential losses from holding a declining assest! And when the price of ETH increases above the pool range, the algorithm switches the LPs position from ETH to USDC, NOT allowing the LPs to earn aditional earnings from the increased value of ETH! This is not how DeFi should work…  Screenshot_20230119-184636_TradingView1440×2558 417 KB  If you are still reading this, then you should have figured out by now that the solution to this is very simple! Just change the direction of the switches in the LPs position in the pools! You already have the system and the leading algorithm! You just need to make this change! We know its imposible to change the code for v3 so this has to be done for a future v4. And I suggest you do this before your many competitors make this change when they are allowed to use the code for concentrated liquidity… Im poor, so can a UNI delegate or whale please copy & paste this into a new proposal with a snapshot so people can vote? I dont care if you take credit for it, I just want this to be done, thanks! ",
                    "links": [
                        "https://global.discourse-cdn.com/business6/uploads/uniswap1/original/2X/c/cc3434077107c11a59dc908bd435f9b3aff04268.jpeg",
                        "https://global.discourse-cdn.com/business6/uploads/uniswap1/original/2X/5/5dd71dbdf3f47271afcb11cc55fce8449f6c5acd.jpeg"
                    ],
                    "GPT-summary": "The author proposes a solution to the problem of liquidity providers losing money due to crypto volatility. The proposal suggests that Uniswap v4 should have a DeFi model that helps LPs increase their earnings while minimizing loss of capital by automatically adjusting the LPs position in the pool based on real-time data. The post also asks for a UNI delegate or whale to copy and paste the proposal into a new proposal with a snapshot so people can vote.",
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Token economics",
                        "Smart contract updates",
                        "Interoperability and Scalability",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.216507177033493
                },
                {
                    "author_link": "https://gov.uniswap.org/u/AiSanta",
                    "index": "2",
                    "likes": "0",
                    "time": "06/02/2023-11:23:40",
                    "content": "Bump to get delegate or whale support! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/0xtj",
                    "index": "3",
                    "likes": "0",
                    "time": "10/02/2023-04:37:02",
                    "content": "UniV3 is a native implementation of order book on blockchain and I have yet to see a perfect algo like this work. Also I don’t think there will be a v4  just see the amount of ecosystem getting build on the current core contracts ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.5
                }
            ]
        }
    ],
    "group_index": "259"
}