{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/a-community-analytics-program-for-uniswap/14057",
            "title": "A community analytics program for Uniswap ",
            "index": 14057,
            "category": [],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/hugo",
                    "index": "1",
                    "likes": "13",
                    "time": "07/09/2021-16:07:01",
                    "content": "After thoughtful consideration and conversations with many different community members, here’s how we at Dune imagine a community analytics program for Uniswap. We are sharing this here with the intention to kickstart a broad community discussion on this subject and would love this to become a collaborative community effort where Dune is just one of many contributors. Goals The goal is to establish a neutral, effective and sustainable way for the Uniswap community to crowd-source the information it needs, as well as engage and onboard new community members. Quality insights and analysis are a growing need for DAOs. Properly executed, the program we outline here should provide a steady stream of relevant data and information to be used at the community discretion and accessible to anyone. Introduction to the program Having effectiveness and sustainability in mind we’ve made our best effort to come up with a system that is both simple and straightforward but also provides the necessary structure and oversight. The program consists of:   A bi-weekly recurring bounty competition as the main mechanism to crowd-source data and analysis.   A neutral committee with executive power over the bounty competition including capital deployment for grants/bounties.   The main oversight mechanism is a yearly community vote to either revoke the program, make changes to its structure, or continue funding it.   Committee composition and duties We propose forming an executive committee, which will be responsible for:  Setting up and running the bounty competition (program execution). Gathering analytics needs and requirements from the community. Funds custody and deployment (using a multi-sig).  In order to speed up execution we are proposing a committee no larger than 3 or 5 community members. Who these members should be is open for discussion and should be proposed based on community feedback. These members should ideally be unbiased members of the community with no affiliation towards data providers. Running the program will be a time-consuming task that will require significant commitment by at least one of the committee members. For that reason, we are proposing a monthly stipend of $2,500 per committee member that commits more than 20h/week but again, we’d appreciate community feedback on this issue too. The bounty competition We imagine the core of the program being run roughly like this: On a bi-weekly basis, committee members meet and  Discuss Uniswap’s community analytics needs Post requirements for new bounties based on these needs Review past submissions and decide which ones deserve to be granted the prizes  Committee members have executive power to decide which tools and interfaces to use to manage the program, how many bounties should be posted each time and how much to pay for each bounty. Which tool each participant uses to do the actual work is up to them. The only requirement is for the analysis to meet the criteria and be publicly available to the UNI community. Funding mechanism & oversight We believe that the funding mechanism should be simple and straightforward. Upon approval of this proposal, the Uniswap DAO will transfer the funds from its treasury to a dedicated multi-sig wallet controlled by the executive committee. Once a year, Uniswap token holders and delegates get to vote whether or not to continue with the program or if changes should be made, thus providing the necessary oversight. The committee can choose not to deploy the entirety of the funds. In that case, funds that have not been spent or deployed during that time period should return to Uniswap DAO’s treasury before the yearly vote takes place. Budget For the first year, we are proposing a budget of $1M for bounties which, as a reference, would allow for 200 submissions earning $5000 each. Committee member’s salary should be added to this and treated separately. We don’t think it’s possible to know at this point if 200 submissions are too many or too few but it’s important to remember that the committee would have the right not to spend all the funds. On the other hand, we think $5000 is a good reference/anchor point to have for bounties given that committee members could also decide to adjust accordingly. Also, creators/analysts deserve to be fairly compensated for their work so bigger bounties concentrated in a couple of submissions are more likely to attract the best analysts and yield the best results. All in all, while the exact amounts can be discussed we think this would be a relatively low risk for Uniswap DAO, while heavily incentivising great analytics dashboard creation. Closing remarks We believe that analytics are key for the ecosystem to continue to grow and flourish as they provide the necessary context and understanding for what is going on and we are doing our best to come up with a program that is both fair and effective. We are ready to shape this proposal together with the community’s feedback and bring it forward. Looking forward to reading your thoughts. The data must flow. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.320909265465717
                },
                {
                    "author_link": "https://gov.uniswap.org/u/wijuwiju",
                    "index": "2",
                    "likes": "2",
                    "time": "08/09/2021-08:41:00",
                    "content": "    hugo:  The data must flow.   Amen Thank you, @Hugo for putting this together! I’m 110% in for this, Just some of my thoughts on this   First of all I totally agree with proposed funding mechanism, although I initially liked the one proposed by flipside crypto, to fund thru yield generating mechanism, I came to believe that it is not fair to use treasury funds to compete and dilute liquidity providers of the protocol, even for such good cause as data  Simplicity is key   I think the time to start splitting grant/fund programs along the specialities/industry is very ripe, as there are many core capabilities in various fields (data, community, infrastructure, etc) that could really benefit the distribution of funds if over sought by people focusing on given area. Data sector with all the providers and talent in it could be a great starting point for narrowing scopes of such programs   On the structure of committee, I’m no expect, but intuitively compact compensated team with no affiliations and biweekly meetings should work really well, plus I like how UGP runs, so think lots of expertise and knowledge could be taken from them, to avoid inventing the bicycle   Also speaking from personal experience of starting up a biweekly newsletter the other day, and writing up some queries on dune to get insights for prior two weeks on UNI and protocol metrics, I think it would be very cool to have some ability for grantees to leverage expertise, funds, etc between these programs and I envision this could naturally evolve into a healthy symbiotic relationship.   Final thought, imho this would also decentralise the fundings themselves, for example, lets assume UGP decides that certain grantee doesn’t fit their requirement or current needs, and this grantee overlaps with other program (i.e data analytics), it could then apply to them and maybe if does fit their requirements and could obtain funding from them, or not (if rejected by various committees, than in case of dispute or lack of transparency or communications, community would have multiple independent  sources of rejection decision)   Final, final thought, various committees would also evolve differently, generate various practices and thus this would allow other committee programs to leverage them, if are thought to be successful by the community. Let the markets thrive. Thanks again, super exited about this! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.770119047619048
                },
                {
                    "author_link": "https://gov.uniswap.org/u/BOR4",
                    "index": "3",
                    "likes": "2",
                    "time": "08/09/2021-10:21:06",
                    "content": "post got caught by filters … I approved it so now all good. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/massnomis",
                    "index": "4",
                    "likes": "3",
                    "time": "08/09/2021-16:20:48",
                    "content": "Hi, this is the platform that charges 400/month to download as csv, didn’t respond to comment on the flipside community proposal? You guys are asking for bi weekly meetings, but what about past reputations? Why don’t you actually canvas community members and see what they prefer to use for data analytics, a platform that costs 10-15 UNI a Month with paywalls? This time please check urself before you rek urself. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.375
                },
                {
                    "author_link": "https://gov.uniswap.org/u/WellDone",
                    "index": "5",
                    "likes": "2",
                    "time": "08/09/2021-16:40:20",
                    "content": "I wasn’t too keen on Flipside’s funding model, but I believe their proposal was much more clear on the result. Flipside showed their impressive, FREE tooling and a vision for how community members would build future tools / dashboards. Without this clear vision, this seems like a bureaucratic waste of time/funding. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.357142857142857
                },
                {
                    "author_link": "https://gov.uniswap.org/u/massnomis",
                    "index": "6",
                    "likes": "0",
                    "time": "08/09/2021-16:43:10",
                    "content": "Yeah, their funding model was confusing, but they had everything written down. they had everything ready to go and got rug pulled . Free data is the way, lmk when yalls are web3 native. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.180555555555556
                },
                {
                    "author_link": "https://gov.uniswap.org/u/wario",
                    "index": "7",
                    "likes": "1",
                    "time": "08/09/2021-18:51:30",
                    "content": "Hi @hugo, thanks for putting this together, funding analytics is a worthwhile use of treasury funds and it’s important to work together towards a proposal that the community is ready to support. I like what is being proposed a lot, here are the salient points for me  Committee will only propose spec for bounties and reward projects that meet the specs. This removes discretionality and enables more transparency and accountability from a centralized committee. Neutrality with regards to data providers and tools used in submissions. Reasonable budget for a trial run Separates the structure of the program from the selection of the committee who will at first run it.  One point where I think it could be improved:  The process of reviewing and deciding which submissions meet the spec should be completely transparent, perhaps the committee should be obliged to publish a simple table with the reviewed submissions and short reasoning for the cases in which they don’t meed the spec.  Overall I support the proposal and as a community member would be happy to help in shaping it along. The data must flow. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.211538461538462
                },
                {
                    "author_link": "https://gov.uniswap.org/u/hugo",
                    "index": "8",
                    "likes": "0",
                    "time": "09/09/2021-10:10:28",
                    "content": "Thank you @wario I appreciate your thoughts here. Having a clearer, more transparent way to review and decide which submissions meet the spec is a fair point imo and something we probably need to develop further. Looking forward to having you involved with this. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/hugo",
                    "index": "9",
                    "likes": "0",
                    "time": "09/09/2021-10:25:42",
                    "content": "Thank you for your thoughts @wijuwiju. Yes, I think there is still many things that we will need to figure out as a community, one of them being committee best practices as you say. This is probably why having a small dedicated committee with a relatively low-risk budget could be a very good way to start experimenting with this. Thanks again! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.008333333333333
                },
                {
                    "author_link": "https://gov.uniswap.org/u/3.1415r",
                    "index": "10",
                    "likes": "3",
                    "time": "09/09/2021-14:29:21",
                    "content": "    wario:  The process of reviewing and deciding which submissions meet the spec should be completely transparent, perhaps the committee should be obliged to publish a simple table with the reviewed submissions and short reasoning for the cases in which they don’t meed the spec.   Echoing that, if the committee has full control over funding, it should be key to have a transparent and well documented submission review process. In addition, I would add a step where each submission review from the committee (including proposed decision to fund or not) should be published on the governance forum [10] days ahead of the final approval. This would give a chance to the community to react and confirm their support or not of the proposed decision. This could be done with a pool, which won’t be binding (i.e. final decision stay with the committee) but at least the committee will know if they have the support of the community or not and get a chance to modify their decision accordingly. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.09375
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Buckerino",
                    "index": "11",
                    "likes": "0",
                    "time": "10/09/2021-10:12:24",
                    "content": "I dont know if there is a true, unbiased, necessary need to allocate so many resources towards a bountry program. I´d say voting once a year to reassess the program should be changed to at least 3 times a year. Once a year is not acceptable. It would make sense to allocate a smaller bounty first (250k) and do a pilot program to see how it works out and then have a vote to increase the funds. Why do we have to go full out? I dont understand…It seems a lot of people want to get huge chunks of UNI first and then sort out whether it was worthwhile later. Why? Lets go small, see if it works, if yes, lets go big. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.788461538461538
                },
                {
                    "author_link": "https://gov.uniswap.org/u/davebalter",
                    "index": "12",
                    "likes": "2",
                    "time": "10/09/2021-11:55:47",
                    "content": "@hugo, We appreciate you taking the time to work through an alternative mechanism to Uniswap Proposal 1.2. The model presented here represents a small slice of Uniswap Proposal 1.2, misunderstood and targeted by Dune Analytics’ Twitter thread last month. The results weren’t simply $5k super dashboards (we have found bounties, btw, do not need to be nearly that high for effective on-demand outcomes). Uniswap Proposal 1.2 articulates analytics as a mechanism to educate and motivate new, well-equipped users to enter and become active participants in the Uniswap ecosystem. Putting apples and oranges aside for a moment: We recognize your recommendation as something that will feel native and comfortable to the crypto community. It mimics well the structure of a now-standard grants program; similar to ones run by Uniswap (@kenneth manages an amazing program) as well as by AAVE, Compound, and many others. To that end, many parts of the program will feel neutral and community-friendly. While this ‘pilot-grant’ structure is recognizable, replicating it here is a misguided effort. Your proposal notes that “running the program will be a time-consuming task that will require significant commitment by at least one of the committee members.” This underestimates the complexity and demands of running an effective on-demand analytics program at scale, and thus is likely to fail as currently framed. An effective program consists of a number of variables:     Variable Details     Sourcing questions A strategy for culling questions from the protocol and community members.   Framing Questions Taking unstructured asks and turning them into effective bounty-able questions   Setting Bounty Fee Structures Evaluating question difficulty and assigning fee structure to the bounties   Evaluating Results & Quality Control* Reviewing and analyzing outputs for conclusiveness, quality control, and data clarity.   Payment Processing Fee distribution, accounting, tracking, and auditing. Also, enabling tax treatment processes.   Community Management There will be countless questions and commentary along the way that will require technical and social know-how    *Critically, evaluating results across platforms and data sets would require someone who is incredibly sophisticated in data, is operationally capable, can remain unbiased - and who will be able to dedicate an incredible amount of time each week to this service. At scale, the time required will require multiple full-time individuals. We appreciate the effort here and commend Dune for drafting up this loose framework based on existing grant programs. Unfortunately, this vastly under-estimates and under-represents the effort and processes required to deliver a positive outcome. The operational gaps it leaves are exactly what Flipside’s programs are designed to solve, and thus why we were compelled to introduce Community-Enabled Analytics to the community in the first place. In a perfect world, Dune would have reached out to us to discuss, certainly to understand Proposal 1.2 before they went on the offensive and tweet-attacked it, and subsequently before they made this recommendation here. As such, we look forward to integrating this general framework and feedback into our potential resubmission of proposal 1.2. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.944108410968876
                },
                {
                    "author_link": "https://gov.uniswap.org/u/wario",
                    "index": "13",
                    "likes": "1",
                    "time": "10/09/2021-14:44:41",
                    "content": "Love this suggested step, it will further increase transparency and accountability from the committee, and can serve as example for other programs where a centralized committee may also be required. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://gov.uniswap.org/u/wario",
                    "index": "14",
                    "likes": "3",
                    "time": "10/09/2021-14:59:04",
                    "content": "Hi @davebalter, I’m sorry to say that IMHO you seem to not have taken the lessons from the community feedback to your previous proposal:  Asking around 100k per month for Flipside to run this program is ridiculous, half of the budget would go to operational costs. Some of the “variables” you mention seem like intentionally complicating a simple process. “payment processing”? The program should not be run by people with obvious conflict of interests (e.g. Flipside) Discretionality in distributing funds should be minimized, and accountability maximized. Your original proposal leaves a lot of room for discretionality No credible neutrality even beyond the committee selection, just by mentioning bounties to specific data platforms.   In a perfect world, Dune would have reached out to us to discuss, certainly to understand Proposal 1.2 before they went on the offensive and tweet-attacked it, and subsequently before they made this recommendation here.  Frankly this is embarrassing. The proposal “in a perfect world” should not have been discussed privately between two companies but openly here in the forum. Please restrain the company A  vs company B mentality and lets work together towards a proposal the whole community can get behind. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.30077030812325
                },
                {
                    "author_link": "https://gov.uniswap.org/u/cryptocat1",
                    "index": "15",
                    "likes": "2",
                    "time": "10/09/2021-16:11:22",
                    "content": "@hugo Just a couple comments / questions:   Given that all analytics will be crowd-sourced by Uniswap, will the analytics provided by all of the providers be fully open-sourced and free to the community?  i.e. no paywalls or costs to download CSV files?   Why not use the funding mechanism provided by Flipside Crypto as it does not involve immediately dumping UNI on the community?  Using Visor Finance to generate yield on the UNI grant was part of the proposal that was widely praised even by detractors.   Quote from John C Palmer:  \" We do need to take seriously the idea of putting treasury funds to use in a more aggressive way, so I hope to see more proposals like this one in the future. In that sense, this is a model proposal! Thanks @flipsidecrypto for proposing!\" ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.8690476190476195
                },
                {
                    "author_link": "https://gov.uniswap.org/u/wario",
                    "index": "16",
                    "likes": "0",
                    "time": "10/09/2021-16:33:57",
                    "content": " Why not use the funding mechanism provided by Flipside Crypto as it does not involve immediately dumping UNI on the community? Using Visor Finance to generate yield on the UNI grant was part of the proposal that was widely praised even by detractors.  The funding mechanism was for sure one of the many issues with the previous proposal. The proposal assured a “conservative” 30% yield, which seems wildly high, without backing this up with any sort of methodology. If some model was used to arrive at that estimate it should have been published or at least described so as to be reproducible. It was not even clear if the 30% yield target was taking impermanent loss into account. A separate proposal could be made to put the treasury funds to use in generating yield, perhaps with a transparent and reproducible methodology for any estimates made, but there is no need to bundle this with any other proposal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.355208333333334
                },
                {
                    "author_link": "https://gov.uniswap.org/u/hugo",
                    "index": "17",
                    "likes": "0",
                    "time": "13/09/2021-10:30:02",
                    "content": "I hear what you’re saying @Buckerino and we do agree. I’m not sure it makes sense to have a vote every quarter since it probably will take some time to get the program up and running and just get results, but probably having a vote halfway through as a checkpoint is a good way to give the UNI community more control. Generally speaking I agree that starting small, iterating and growing it from there is the right way to go. @davebalter, thank you for taking the time to comment on this proposal, we appreciate it. I understand what you’re saying regarding the actual effort and cost of running such a program, I think it’s a valid point/concern and I appreciate that you pointed that out. Committee structure and compensation is key for the program to work and underestimating the amount of effort that would be required could definitely put the program at risk. This is an area where we need to put more focus and we’re eager to get more feedback from the community on this. @cryptocat1 we do agree with the idea that Uniswap’s community should find ways to put it’s treasury funds to work in more aggressive ways, and we do appreciate Flipside’s innovative approach for this. We just think these are separate needs (the need for a community analytics program and the need to find innovative ways to fund programs) that should be discussed independently, that’s all. ",
                    "links": [
                        "https://gov.uniswap.org/u/davebalter",
                        "https://gov.uniswap.org/u/cryptocat1"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0399159663865545
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Naught",
                    "index": "18",
                    "likes": "2",
                    "time": "13/09/2021-17:17:44",
                    "content": "What is an analytics Program? It is not quite clear to me what an “analytics program” is. Does a person who creates analytics need to be a programmer to develop analytic tools, such as calculating impermant loss for a LP pool? Or is an analytics person someone who creates useful graphs and intresting insights using exsiting software such as dune analytics? Do Analytics needed to be incentivised? As for commitee members, I do not have any immediate names that come to my head. The twitter space is an intresting place for NFT talk, but I rarely see anyone passionately talking about or sharing analytics; other than a retweet of an intresting analysis. Which brings me to my question of, are analytic bounties needed right now? Committe member search: A good area to look for a commitee member could possible be in the academic realm. I could see a professor in financial or computer science taking on the responsibilities in creating analytic tools/observations with students, and bounties becoming scholarship. Would also be important to target outside of that, but it would be good to have someone in the academic arena to do outreach. It is very important that this program starts small and with low cost, while figuring out the territory. No need for expensive overhead and exotic funding mechanisms. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.7569805194805195
                },
                {
                    "author_link": "https://gov.uniswap.org/u/msilb7",
                    "index": "19",
                    "likes": "5",
                    "time": "13/09/2021-20:29:04",
                    "content": "Hi everyone, coming in late to the conversation, but I’m super excited to see analytics proposals being worked on. For background, I’ve done work using both Dune and Flipside to contribute to various projects. A few thoughts to keep building on the idea: On Goals: I definitely think there’s huge value in having a strong analytics arm to help guide a project’s governance proposals, product upgrades, etc. But, it’s hard as an analyst to commit to a project when it’s unclear what the needs are and if there’s any possibility of being compensated for your time. So, I think having a team that helps bridge the business questions and needs of Uniswap with analysts looking to contribute and get in with communities could be a worthwhile experiment to solve that problem. I’m thinking of it like an analytics management team, but rather than employees to assign work to, we have freelance/community contributors. On Structure: So with that, my initial thoughts are that this program could be structured similar to an RFP, where analysts can apply for and be accepted/rejected to take on various questions/needs. There’s of course some bias there, so maybe there could also some type of reputation that gets involved, where newer/lesser-known analysts can build their way up. I’d caution against a “many analysts answer the same question” model since that could cause duplicative work. I’d rather prioritize being efficient with everyone’s time and covering as much ground as possible. On Budget/Submissions: The budget per analysis seems fair, but I wonder if 200 submissions/year (~4/week) is an overestimate? But that could depend on what qualifies as a submission (i.e. does submission = a new dashboard, or could submission = new value-add written analysis of a previously built dashboard?) I’m curious how you all are thinking about that. Just some initial thoughts, I’ll be following the thread! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.55334595959596
                },
                {
                    "author_link": "https://gov.uniswap.org/u/wijuwiju",
                    "index": "20",
                    "likes": "3",
                    "time": "13/09/2021-20:47:40",
                    "content": "imho the core value of this grant program could be the team/committee itself, if members are specialised on given area of expertise, many of concerns raised by @davebalter could be addressed.   Evaluating results and quality control is easily mitigated by community or could be done in a form of a giving out a grant to bootstrap any such initiative to monitor and evaluate the results of other grantees   Concern of framing is no concern, as its probably the applicants themselves who would raise and formulate the best ones, and committee here would be just need to recognise its necessity and value   Full time individuals, I probably agree that maybe such work would require more hands and time allocation, thus maybe a possible solution would be to increase amount reserved for committee? Or another possible solution for example, if we can start with a similar payment scheme that of UGP, but if team would need extra hands, they could tap into talent from community in form of granting them some funding to help facilitate/outsource partially their work?   As @Naught has correctly questioned the scope of such initiative, I think there are almost infinite use cases for “analytical program” and thats is the beauty of it. Grantees could range from anywhere a simple query writer on dune or an entire storyteller with visualised data on flipside, to a tooling or trackers of pool positions, swap flows, liquidity changes over time, and all the way to research of user behaviour, their gas usage habits and reasoning, compilation of data sets, MEV extraction aggregations, and much much more, I’m sure community would bring lots of cool new toys, contracts, tools, papers, value to the table. Key is to have a group of people who are interested in data and have such expertise, thus would have better capability to organise and guide such initiatives for the benefit of the community, protocol and network in general. P.S @wario you are behind the revert finance, which is pretty much pure analytics, plus you have raised valid soft transparency discussions, so maybe we could start with u  P.S.S would be nice if such initiative will have more qualities of chain 1 ethos, elaborated to the next level by projects like LOOT or uniswap itself, not sure thou how it could be achieved? while having centralised governing body choosing who to fund or not, but definitely in this discussion it is a step forward, when compared to previous proposal, keen to see new mechanisms of releasing and directing funds, maybe have partial investments or longterm incubating with ability to knowledge sharing with some of the labs core team members or the analytical providers in the space and this thread! ",
                    "links": [
                        "https://gov.uniswap.org/t/governance-proposal-up1-2-community-enabled-analytics/13760"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.7312409812409815
                },
                {
                    "author_link": "https://gov.uniswap.org/u/wario",
                    "index": "21",
                    "likes": "1",
                    "time": "14/09/2021-15:00:30",
                    "content": "Hi @wijuwiju, thanks and happy to contribute. Being mindful of conflict of interests, I should say we (Revert) do hope to go after some of the analytics grants/bounties, which seems a good fit for what we do. Our experience with Uniswap Grants Program has not been great, as we have not even gotten feedback with regards to our applications, even after repeated requests.  One of my goals in contributing to this initiative would be in looking to making it more transparent, accountable, and to minimize discretionality in assigning treasury funds. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.833333333333334
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Buckerino",
                    "index": "22",
                    "likes": "1",
                    "time": "14/09/2021-18:51:12",
                    "content": "Im glad you took the points into considerations. If you are able to reduce the proposal to a smaller amount…lets call it a pilot program and have it up for reevaluation, then you have my vote. I think its fair to call for a more cautious initial approach after the last few votes. But until then, I remain highly skeptical. I think it would also be more efficient not to dump the UNI, but try to find a way how to generate yield with it…but the part with the yield financing is just a huge plus. I´d not call it a necessity compared to the earlier points. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/hugo",
                    "index": "23",
                    "likes": "1",
                    "time": "15/09/2021-17:13:31",
                    "content": "Thank you @msilb7 for chiming in, given your personal experience as an analyst I really appreciate your thoughts here. Some quick comments/questions: On goals: I like the way you frame the program and we obviously agree about the need for more experiments in that direction. On Structure: I see what you mean regarding structuring it as an RFP where analysts apply and wait to be approved/rejected before they begin to work as a way of avoiding duplicated work. My question here would be how does the selection process work so that it’s fair and transparent? Some community members have already raised their concerns in that direction and I think it’s a valid one. For instance, with such a system, how do we make sure that the selection process is transparent? And how do we make sure new analysts have as much of a chance to contribute as more experienced ones? On Budget/Submissions: we can probably think of a submission as the answer to a committee request, broadly speaking. This way the system is flexible enough such that a value-add written analysis of an already existing dashboard is also a valid submission if it’s in line with what the committee is asking. Regarding the number of submissions, we’re also not sure if 200 is too much but bear in mind that here we’re expecting for duplicated work to happen and for several submissions to receive a bounty for the same committee request, if that makes sense. Looking forward to your comments! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9689754689754695
                },
                {
                    "author_link": "https://gov.uniswap.org/u/alex_kroeger",
                    "index": "24",
                    "likes": "2",
                    "time": "23/09/2021-22:26:18",
                    "content": "Very late to the party, but thank you @hugo for bringing this idea to the community. I wanted to highlight just one point brought up on the community call yesterday–since this is a bit experimental, I think it could make sense to shorten the duration of the oversight vote to a period that is less than a year to start, so the community has a chance to evaluate its effectiveness, structure, etc. sooner. Something like 3 or 4 months to start could make sense. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.238888888888889
                },
                {
                    "author_link": "https://gov.uniswap.org/u/hugo",
                    "index": "25",
                    "likes": "0",
                    "time": "27/09/2021-13:38:44",
                    "content": "Hey @alex_kroeger thank you for chiming in, we totally agree with this. This is something that was brought up by several community members in this forum and we think it makes a lot of sense. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/L.Temir88",
                    "index": "26",
                    "likes": "0",
                    "time": "02/12/2021-14:11:00",
                    "content": "I like your article This program can spur growth. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Athayde3586",
                    "index": "27",
                    "likes": "0",
                    "time": "22/06/2022-20:35:52",
                    "content": "Let me ask u this y’all r distributing my funds or what is the deal here ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "129"
}