{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/introducing-the-union-a-blog-dedicated-to-uniswap-data/9299",
            "title": "Introducing The UNIon, a blog dedicated to Uniswap data ",
            "index": 9299,
            "category": [
                "Governance-Meta"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/Figu3",
                    "index": "1",
                    "likes": "4",
                    "time": "17/12/2020-20:33:45",
                    "content": "Hey everyone, At Constellation we are trying to help create a more scalable and viable on-chain governance. One of the key challenges we have identified is information asymetry. For this reason we have decided to build a one stop shop website for Uniswap information. On theunion.finance you will find articles helping you follow the latest news about our favorite AMM, data analytics to guide you on the current health of the protocol and summaries of major debates on the forum. This blog is for the users who don’t have the time to dedicate themselves to deep research on Uniswap. If you do and feel the blog is lacking, feel free to contribute. In this article you will find our reasoning behind the creation of this blog, along our position on the current state of the protocol. This is a freely curated webiste by our governance venture. As always, feedback and comments our welcome ! Cheers, Figue - Constellation Delegate PS : It’s the last day of our Gitcoin Grant, if you like the initiative, feel free to contribute. ",
                    "links": [
                        "https://medium.com/contellation-finance/the-union-a-uniswap-community-blog-e004e3a36c57",
                        "https://www.constellation.finance/",
                        "https://gitcoin.co/grants/1589/constellation"
                    ],
                    "GPT-summary": "The author of the post is introducing a new blog called The UNIon, which is dedicated to providing information about Uniswap. The post explains the purpose of the blog and invites users to contribute. The author also mentions a Gitcoin Grant and encourages readers to contribute. Positive feedback is given by the author, while constructive criticism and questions are invited from third parties.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 6.200892857142857
                }
            ]
        }
    ],
    "group_index": "522"
}