{
    "poll_list": [
        {
            "id": "QmbVVJ57NFq9ipgt3YY9S1NyN5s5ziswgHSPWfXNvuzwgx",
            "title": "Consensus Check: Community-Enabled Analytics via Yield-Generating Investment Strategies",
            "discussion": "",
            "body": "Should Uniswap governance grant $25M to fund Community-Enabled Analytics via a sustainable yield-generating investment strategy that:\n1. Produces analytics that educate the community and drive growth\n2. Allocates UNI to participants through bounties\n3. Uses Uniswap’s own yield mechanisms to sustainably self-fund the program\n\nForum Post >> [https://gov.uniswap.org/t/consensus-check-uniswap-funds-community-enabled-analytics-via-yield-generating-investment-strategies/13220](https://gov.uniswap.org/t/consensus-check-uniswap-funds-community-enabled-analytics-via-yield-generating-investment-strategies/13220)",
            "choices": [
                "Yes, Approve the Grant",
                "No, Make No Change"
            ],
            "scores": [
                2513681.053711709,
                1275.5088457712693
            ],
            "start": 1625440500,
            "end": 1625872500,
            "snapshot": "12763968",
            "state": "closed",
            "author": "0xd957a7Fc541fc4b3104ef891A975ae967D4c9057",
            "space": {
                "id": "uniswap",
                "name": "Uniswap"
            }
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/consensus-check-uniswap-funds-community-enabled-analytics-via-yield-generating-investment-strategies/13220",
            "title": "Consensus Check: Uniswap Funds Community-Enabled Analytics via Yield-Generating Investment Strategies ",
            "index": 13220,
            "category": [
                "Proposal Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/davebalter",
                    "index": "1",
                    "likes": "4",
                    "time": "04/07/2021-23:10:41",
                    "content": " TL;DR A grant that provides liquidity via Uniswap liquidity pools, to generate yield that continuously funds free sophisticated analytics resources, as well as the education and onboarding of new analysts into the Uniswap ecosystem.  Summary: A recommendation to grant $25M to enable a self-funding Community-Enabled Analytics program that:  Produces analytics that educate the community and drive growth Allocates UNI to participants through bounties Uses Uniswap’s own yield mechanisms to sustainably self-fund the program  Flipside will implement a management strategy for the grant that follows 3 basic tenets, intended to enable our goal of buying UNI from those who want to sell it, and putting it into the hands of engaged users, builders, and analysts:  Minimize risk of the grant decreasing in value Minimize short-medium term negative price impacts to UNI, while setting up for long term net positive impact Maximize yield under the first two tenets, specifically using Uniswap V3 to generate it  Flipside will leverage all gold-standard technical solutions to achieve each of these 3, including multisig wallets and automated position management wherever possible. Further details on the CEA program and framework for larger grant constructs can be found in our ORIGINAL TEMPERATURE CHECK which we are thrilled passed snapshot with overwhelming approval [99.96% support] on June 25, 2021.  Oversight [Update From Temperature Check] This grant will be utilized to generate yield to power Community-Enabled Analytics. It is critical to us and the community that the assets are managed effectively and are delivering value to the ecosystem. In the event the assets are not delivering value, they should be repurposed for other initiatives to enable ecosystem stability and growth. Thus, as a build on the previous proposal, we recommend the following:   For full transparency, fund performance and transaction activities will be broadcast live via a custom dashboard for the Uniswap community.   An Allocation Committee, whose purpose is to oversee fund execution strategy utilizing a multi-sig process to ensure both effective management and protection/safety of funds - we are exploring Tally’s Failsafe to facilitate this process. The Allocation Committee will be composed of 7 members; 3 from Flipside, 4 Community members [key is to have a community majority, with enough Flipside individuals to execute essential program efforts]   An Oversight Committee, whose purpose is to ensure that the grant proceeds are applied in a manner consistent with its design. Serves as “guardrails” for the Allocation Committee. The Oversight Committee will be composed of 3 members; 1 from Flipside, 1 representing Uniswap, and 1 independent (community) who may be recommended by either party and agreed to together.   3-year term with end of cycle performance review. If utilization of funds are not achieving stated intents and goals of the Proposal, the Allocation Committee may vote [each member gets 1 vote] to resubmit the grant to the governance grant process, with an intent of redirecting funds toward other uses.    Topics of Discussion Following are answers to topics raised during the Temperature Check:  Q: [Private Feedback] Liquidity providers to the UNI-ETH pool may be negatively impacted, and the UNI token could face constant sell pressure due to rebalancing needs: As a refresher, here is the proposed strategy that uses only Uniswap-V3 liquidity as the means of yield generation:   100% of the grant will be deposited into the WETH-UNI .3% pool, which will be actively managed to an 80%-20% UNI:ETH ratio.   In simulations, if an 80:20 ratio is maintained each time we rebalance our position, the impact to UNI would be net 0 within 1 year. These simulations estimate a yield of 30% from this position.   Yield management and bounty distributions will be reported via a regularly updating dashboard - and Flipside will disclose to the wallet address used to manage the liquidity for WETH-UNI.   Related to the feedback, indeed, these are keen observations, and we’ve debated them vigorously as well. As of this writing, Liquidity Providers in the UNI-ETH pool would certainly experience some dilution with $25m of funds allocated. While acknowledging this concern, the CEA program will provide tremendous benefits to the Uniswap community and its members. For example, the creation of additional tools and deep analytics will foster community growth, incentivize protocol usage, and increase both trading volumes and fees to ALL liquidity providers. The ecosystem benefits on the whole would far outweigh the near-term dilutive impacts to UNI-ETH LPs. And, the need to perpetually convert most ETH denominated fees into UNI should create a systematic buy pressure that helps to offset rebalancing activity. With respect to the potential for unabated UNI price pressure, much debate can and should be had over the specifics of our intended LP strategy. However, it is our belief that this approach is a straightforward one that uses V3’s own unique properties to generate capital, while mitigating, and eventually eliminating, the position’s negative impact on UNI. Alternative strategies to be used with this grant, such as leveraging the position via Compound or Maker, come with liquidation risks and capital inefficiency (due to collateralization requirements) that we believe could dilute the prospective net benefit of the program. Specifically, choices about which investment strategies will be most effective for the ecosystem will be ensured by the Allocation and Oversight Committees.  Q: Is Flipside’s fee structure too high for an actively managed investment strategy? Valid question, and one we’ve been asked in both public and private conversations. We first want to stress that the core purpose of this program is not about earning a return on investment. Rather, we propose market-making on Uniswap V3 to generate yield that will be used to continuously fund free analytics resources, as well as the education and onboarding of new analysts into the Uniswap ecosystem. The yield is split 50% to fund the bounties, and 50% for Flipside to operate and manage all of the services, including data pipelines, transformation for analytics-ready data, sourcing of questions, bounty payouts, custody, yield investment process, fully-staffed support analytics and community teams. Flipside has spent the past four years developing proprietary software and intellectual property for blockchain analytics and, like most other businesses, our compensation is tied to both the technology and community services that we will be providing to the Uniswap ecosystem. This is structured as a win-win-win. The protocol utilizes treasury assets to fund the program (win); the yield delivers Uniswap bounties into the hands of ecosystem participants (win); and Flipside is compensated to provide infrastructure to make it possible (win). Uniswap bounties drive positive user behaviors, increase customer acquisition and retention, and distribute UNI directly to engaged users. This is what Flipside refers to as Native Token Recycling, where yield delivers a return to the broader Uniswap ecosystem, rather than being spent immediately or remaining out of circulation. The simplicity of the 1:1 bounty:fee ratio ensures that for every UNI Flipside earns, there is an additional UNI distributed to the community.  Q: It’s unclear if Flipside has the expertise or is capable of managing these funds: Flipside was originally formed in 2017 as a registered investment fund, utilizing data science and sophisticated algorithms to inform digital asset allocation strategies. While we transitioned the business into a blockchain analytics company in 2019, we continue to manage a significant balance sheet of digital assets consisting of both active and passive investment strategies. Our investments span multiple DeFi protocols (11) and blockchains (4), and are supported by institutional-grade custody and security practices (cold storage, multi-sig, etc). As a venture-backed startup, we have best-in-class legal, tax and accounting support, as well as a Treasury Committee to help inform our decision-making processes and strategies. Our leadership has built and exited a number of startups and has delivered shareholder value across multiple organizations. We are more than adequately positioned to manage the contemplated funds, and have proposed an Allocation and Oversight Governance Construct to provide the additional oversight appropriate for a grant of this magnitude.  Consensus check proposal summary:  A $25M grant will utilize Uniswap v3’s own yield mechanisms to fund bounties that will deliver perpetual onboarding, education and analytics for the Uniswap ecosystem The Grant will ultimately deliver no negative net UNI; maintaining assets in the ecosystem while delivering critical services Build: The yield investment strategy will aim to be automated, and guided by a 7-member Allocation Committee; and a 3-member Oversight Committee will provide a check-and-balance to ensure the Grant is being used effectively, who will have the capability to resubmit it to Governance for other services  The previous temperature check process passed with sufficient support of UNI voters. The following consensus check poll is the second phase of Uniswap’s governance process: The snapshot poll will be live for 5 days, from 23:15 UTC on 04 JUL to 23:15 UTC on 09 JUL. If the poll passes with a minimum of 50,000 UNI in support, this initiative will move forward as a formal governance proposal. ",
                    "links": [
                        "https://gov.uniswap.org/t/consensus-check-uni-should-fund-a-political-defense-organization-for-decentralized-finance/12700/67",
                        "https://gov.uniswap.org/t/temperature-check-larger-grant-program-construct-community-enabled-analytics-no-negative-net-uni/13044",
                        "https://snapshot.org/#/uniswap/proposal/QmbVVJ57NFq9ipgt3YY9S1NyN5s5ziswgHSPWfXNvuzwgx",
                        "https://gov.uniswap.org/t/governance-proposal-up1-2-community-enabled-analytics/13760"
                    ],
                    "GPT-summary": "The post is a proposal for a $25M grant to fund a self-funding Community-Enabled Analytics program that produces analytics, allocates UNI to participants through bounties, and uses Uniswap’s own yield mechanisms to sustainably self-fund the program. The proposal addresses concerns about the impact on liquidity providers and the fee structure, and outlines the governance structure for the grant. The post also includes answers to questions and feedback from the community.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Token economics",
                        "Privacy, Security and risk management",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.681856684981685
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Pinotio.com",
                    "index": "2",
                    "likes": "0",
                    "time": "05/07/2021-15:48:09",
                    "content": "So it would be 50% of the yield (30% x $25M x 50%), which is $3.75M (plus or minus UNI appreciation/depreciation) per year that would go, indefinitely, to Flipside? This seems like very high weighting towards management and away from community disbursements. Intuitively, I’m thinking of a benchmark of 1-2% management fee as a % of AUM ($25M), which would be $250k-$500k/yr. Translating this to % of yield gives 3-6% share of yield. So, I would think that maybe 5% of the yield going to Flipside would be reasonable. I would imagine there will be quite some upfront cost, so I would think that maybe some upfront payment would also be appropriate. I think this payment should be based on a more clearly laid out scope of work for which we can lay down some benchmarks. EDIT: I guess VC firms will have a profit take of 20%, which is higher than the 5% I suggest above. Still, 20% is a lot lower than 50%. Plus, the management strategy for the investment of the $25M here is pretty passive, which would take the management fee to much below a 20% share. Counteracting that is the work to manage disbursements. Still, any fund that requires 50% of monies to disburse the other 50% seems highly inefficient. I would like to see overhead kept down towards 10-20% (maybe higher short term and then lower). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.650590277777779
                },
                {
                    "author_link": "https://gov.uniswap.org/u/davebalter",
                    "index": "3",
                    "likes": "0",
                    "time": "05/07/2021-19:55:32",
                    "content": "Excellent feedback, @Pinotio.com, thanks for offering. Many years ago someone told me, ‘if you pay peanuts you get monkeys’.  I always wondered if monkeys ate peanuts (shouldn’t it be elephants?), but…well…you get the idea.  Ultimately, value-add service requires fees.  Here’s what ours are comprised of: Data Management and Transformation: This includes pipelining, node management, and enabling the data to be analytics-ready.  There is a significant amount of IP here, which has been honed across 40 blockchains over the last 3 years.  It enables the ability to make the data clean and easy-to-query (and read-ready, in essence simplifying code to be able to access any historical data at any time); it includes extensive labeling, proprietary algorithms, a fully-developed API and product tooling, which makes it accessible to analysts in training, while also robust enough for DeFi natives and data wizards. Community Education and Management: In order to deliver Community-Enabled Analytics, it’s critical to have active, inspired analysts, as well as a structure to motivate them to deliver effectively.  This includes traditional community management frameworks - ie: SLA for response times in discord - but also solutions to grow analysts to become better and more effective at understanding the data and creating powerful outcomes with it.  A critical part of the process is growing active community members, educating them, and inspiring them to maintain activity within the ecosystem. Query Sourcing, Analytics Validation and Bounty Delivery: This is the dark horse:  surprisingly complex and very time consuming, but delivers huge dividends.  Includes gathering analytical needs from the protocol itself (Uniswap Labs and others who maintain the technology) as well as from the community - identifying opportunities called out in social forums.  One very difficult component is then transforming asks into clear bounty-structures (some questions require PHD-level inspiration to ask effectively) and then a magnified task is to QA the outcomes.  We pride ourselves on ensuring the data, whether visualized or API, meets quality standards.   Finally, we need to deliver the bounties themselves.  There is considerable data tracking, wallet management and accounting here. Interactive [Premium] Analytics: In addition to managing analysts to deliver via queries and bounties, the program includes special programs for premium analytics.  The Uniswap v3 Calculator is part of this.  It requires our team of data scientists plus the top 1% of the analyst community to focus on special cases.  Ultimately we scope interactive modules (like the Calculator) and will keep delivering these. Investment Management: As called out in the question, yes a portion of this is managing the assets in the liquidity pools, or other effective structure to create yield.  We have a team that works on this specifically - in addition to the actual monitoring of this, there is asset custody and tracking, and other technical issues to ensure there are checks and balances on the assets we maintain.   Your question seems to call out these fees specifically, aligning them with a venture fund structure or otherwise.  We actually don’t consider this a critical part of the fee structure > it’s all of the details above that make the program incredibly special. A final note on the recommendation of an up front fee or fees that decline over time.  We actually performed the up front work for this program pro bono, to enable early analytics access to v3 when it launched.  We then received a small grant from the Uniswap Grant Program to run a few bounties [we self funded close to $100k in bounties ourselves to prove the model].   We wish our costs declined over time, but as you can see from the above, the fees are all linear.  We can’t reduce the time on query sourcing (which actually becomes more difficult as more questions get answered) or data management or any of the others. In a nutshell our fees consist of technical requirements (plus IP), program delivery and management and, yes, investment management.  Believe us, we wish there were days it was simpler to deliver a premium service — but we believe strongly in enabling blockchains to live up to their full potential, and this is the way to do that. We have structured this as a 1:1 strategy, whereby every time we get paid UNI it is put into the hands of the community.  That feels appropriate and aligned to continue to build a great ecosystem together. ",
                    "links": [
                        "https://uniswapv3.flipsidecrypto.com"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.847179275750705
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Pinotio.com",
                    "index": "4",
                    "likes": "1",
                    "time": "05/07/2021-21:35:26",
                    "content": "Thanks @davebalter. I certainly think your post is helpful in outlining the scope of the work proposed. Indeed,  if the value Flipside can provide to the Uniswap protocol is big and there are no other comparable providers of such a service, such a high fee could be warranted, particularly in the short term until other providers emerge. My question for Uniswap governance is:  Are there other companies/partners that could bid on providing a similar service? How can we encourage other bidders? The net present value of the payment to Flipside here is $12.5M*, which is a big enough ticket size that we should be able to get bidders (if not now, then next year or soon thereafter).  My recommendation to Uniswap governance is:  Adjust this vote so that the program is limited to one year in duration. After one year, Uniswap can go out and tender for other applicants to perform the same service. Over time, if crypto does well, there should be more crypto service providers and Uniswap should get a better deal (hopefully getting yield share down towards 10-20%, or maybe lower if we made the program bigger).  My recc for flipside:  If Flipside is the only real option this year, then Flipside would get a head start with the above proposal and will be at the advantage of having a track record when it comes to tendering next year. For Flipside, I appreciate the appeal of high yield share, but I think it is important for reputation that Flipside work in a model where service providers are not seen to be juicing the reserves of DAOs. As a UNI token holder, I would be concerned at having substantial amounts (and this amount is substantial) of the reserve attributed to projects where 50% of yields are signed away indefinitely.  In summary: My position is that I could support this proposal for one year, and the service is reopened to bidding companies for the next year. *Uniswap indefinitely providing 50% of yields to Flipside is financially equivalent (in net present value terms) to paying a one-off lump sum payment of 50% x $25,000,000 = $12.5M. An asset equals the value of its future cash flows. So if you sell half of the future cash flows (to infinity), it’s equivalent to selling half the asset. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.250391865079365
                },
                {
                    "author_link": "https://gov.uniswap.org/u/davebalter",
                    "index": "5",
                    "likes": "2",
                    "time": "06/07/2021-14:41:56",
                    "content": "Thanks @Pinotio.com, helpful to understand your logic here. I’m a big fan of clean presentation of thought, so this was really useful. On the cost analysis, I believe you’re suggesting the “cost” to fund the program is $12.5M which is the present value of all future annual cash flows of $3.75M, discounted at a rate of 30%? Correct me if I have that wrong. Assuming so, a few quick thoughts:   There is actually no “cost” to Uniswap.  We don’t sell any underlying UNI, so it feels inappropriate to classify it as a “cost” [especially when the rest of the treasury is earning zero currently].  This could just be semantics…so onto the second bullet….   The NPV perspective is assessing a “cost” on a notional dollar basis, classifying it as expensive - without comparing it to some level of return.  Please realize the program does provide actual measurable return:  liquidity to community members and onboarding new users into the Uniswap ecosystem [not to mention unquantifiable return such as analytics insights, information-awareness, product solutions, etc].   We measure all of this and will provide as part of publicly available data related to program return.   Frankly, we love the idea of identifying other participants who would provide this service, or something similar with equal value.  The more quality analytics and community growth for Uniswap the better! As a solution:  we have recommended an Oversight Board who is set to automatically re-evaluate this program at 36 months.   With the effort we’d need to develop a great program, the staffing requirements, the opportunity cost of NOT working on other protocols; this feels an appropriate watermark. Additionally, the nature of our programs (particularly interactive, premier analytics) lend themselves to multi-year terms to drive adoption & value, and can be greatly diminished if development is time-boxed. To your recc:  the Oversight Board can trigger a re-evaluation at any time - even before 1 year if they so choose. They would enforce a resubmission to the governance process. We hope that is helpful in acknowledging the right check-and-balance without overly constricting our planning for a successful program. Looking forward to continued thoughts, and thanks for taking the time to lay out your recommendations so far. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.81084479246244
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Pinotio.com",
                    "index": "6",
                    "likes": "2",
                    "time": "06/07/2021-15:02:19",
                    "content": "Thanks @davebalter , that’s good to know there is at least the check of an oversight board. My view is that it would be better that it be a resubmission to governance, as this gives more leverage to governance to find a better value option. I think this is warranted for the large contract size involved ($12.5M in NPV to the protocol). I do look at the $12.5M as a real cost because Uniswap is indeed giving up 50% of the yield on $12.5M worth of Uniswap in today’s value. Indefinitely allocating yield from a minted asset is indifferent economically from minting an asset and allocating a share of ownership. Minting and allocating an asset is not free for the protocol (despite the fact that many protocols mint tokens as though minting is free). I would be supportive of the following two approaches: i. A one year deal where Flipside gets 50% of yield. Governance then votes to renew or give the contract to another firm after one year. ii. A three year deal where Flipside gets 30% of yield. Governance then votes to renew or give the contract to another firm after three years. I think the two above options are great deals for Flipside (although I’m still not sure they would pass a UNI governance vote). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.116071428571428
                },
                {
                    "author_link": "https://gov.uniswap.org/u/uniyj",
                    "index": "7",
                    "likes": "0",
                    "time": "17/08/2021-10:15:37",
                    "content": "Late to this. Apologies if this has been raised and discussed elsewhere. What’s the contingency plan if the actual yield is not as high as the targeted yield (30%?!) needed to fund the estimated budget? Would the “no negative net UNI” ethos always take precedence, and if so, how then would the budget shortfall (per estimated budget necessary) be funded? Thanks. yj ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.857142857142857
                },
                {
                    "author_link": "https://gov.uniswap.org/u/davebalter",
                    "index": "8",
                    "likes": "0",
                    "time": "17/08/2021-11:51:24",
                    "content": "See response here: Governance Proposal UP1.2: Community-Enabled Analytics - #14 by davebalter ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "94"
}