{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/add-the-coingecko-tokens-list-in-the-manage-lists-section/6205",
            "title": "Add the CoinGecko tokens list in the \"Manage Lists\" section ",
            "index": 6205,
            "category": [
                "Proposal Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/tmlee",
                    "index": "1",
                    "likes": "9",
                    "time": "28/09/2020-05:40:28",
                    "content": "Hey everyone, co-founder at CoinGecko here; with the recent exploit of Kucoin hack, I wanted to share a little thought on some of the issue that may impact Uniswap users. We are already seeing projects that were impacted by the exploit and they responded by initiating a contract upgrade. This has led to new contract addresses generated for these tokens. See https://blog.orionprotocol.io/tokenswap , https://www.kucoin.com/news/en-kai-has-completed-the-token-swap, and there could be more. What this means… Contract address for a given token may have changed, and users may be in danger of trading the wrong token or an outdated contract. On tokens list I am a fan of the idea of tokens list when it was proposed by Uniswap, its a great idea to decentralized the curation of tokens that are trading on Uniswap. However at this moment there might be something we need to address. Token list maintainers need to be quick at making sure the contract address are updated as soon as possible to prevent people from trading the wrong token using the wrong contract address. Screen Shot 2020-09-28 at 1.13.55 PM1586×744 146 KB We at CoinGecko receive updates like this with regards to contract address change, and we make the update as soon as possible, and its our goal to have that reflected throughout our website/app and also tokens list. At the moment, that latest update is only reflected in our complete tokens list https://tokenlists.org/token-list?url=https://tokens.coingecko.com/uniswap/all.json This list pulls the latest changes and creates a new version every hour to reflect the latest update. What this means is that users using this list will get any update that are reflected on CoinGecko as soon as possible. For example, the contract upgrade scenario, we will reflect the latest address to a given token as quickly as possible so Uniswap users will trade the correct new token when they are ready. Screen Shot 2020-09-28 at 1.13.43 PM570×782 61.2 KB I would like to propose to have that CoinGecko tokens list to be in the default “Manage List” section replacing the CoinGecko DeFi 100 for the following reasons:-  CoinGecko tokens list updates every hour with all the latest updates/changes (new tokens, contract address change, etc…) CoinGecko DeFi 100 list was our first attempt, and we noticed that a list with all tokens is a better user experience as Uniswap traders don’t have to switch in/out to find the address they are looking for We did not implement DeFi 100 in the best way; which makes it difficult for us to get it updated with any changes in token details in our backend, and we should deprecate it  In conclusion by making it easier for general Uniswap users to access the CoinGecko token lists  Users will get the latest changes to the token as timely as possible (contract address, decimals, any metadata related) in order to trade the correct token Users get to find all the tokens that are curated on CoinGecko.com  Users can look up in the list using symbols  Let me know what you all think about this suggestions. Cheers! ",
                    "links": [
                        "https://www.kucoin.com/news/en-kai-has-completed-the-token-swap",
                        "https://global.discourse-cdn.com/business6/uploads/uniswap1/original/2X/6/6963c0612dbab6ac788ea0c9c63aed7f169f1e12.png",
                        "https://tokenlists.org/token-list?url=https://tokens.coingecko.com/uniswap/all.json",
                        "https://global.discourse-cdn.com/business6/uploads/uniswap1/original/2X/4/4ccc15f88307cce763cee51dab5d208199dd58d0.png",
                        "http://CoinGecko.com"
                    ],
                    "GPT-summary": "The co-founder of CoinGecko proposes to add the CoinGecko tokens list to the default \"Manage List\" section on Uniswap. The proposal is explained in detail, highlighting the benefits of the CoinGecko tokens list, such as hourly updates and timely reflection of changes in contract addresses. The author invites feedback and suggestions from the community.",
                    "GPT-proposal-categories": [
                        "Smart contract updates",
                        "Privacy, Security and risk management",
                        "Interoperability and Scaleability",
                        "Community and engagement",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.741612554112554
                },
                {
                    "author_link": "https://gov.uniswap.org/u/TMod_Marco",
                    "index": "2",
                    "likes": "2",
                    "time": "01/10/2020-06:51:27",
                    "content": "This is a proposal I ('d) definitely support. Thank you for sharing this with us. I’ve just shared it on the Uniswap Github under ‘Token-Lists’.   github.com/Uniswap/token-lists     \t      Coingecko Token List [replace DeFi 100]            opened 06:50AM - 01 Oct 20 UTC               TModMarco               Hoping this is the right place to share this, wasn't sure if it should be here or in the other token-list...         It feels like it’s more a ‘replace with’ than a governance situation. I might be mistaken there, but that’d probably be made clear by replies on the GitHub. Hope to have been helpful as I’d love to see this. ",
                    "links": [
                        "https://github.com/Uniswap/token-lists/issues/17",
                        "https://github.com/TModMarco"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 6.25765306122449
                },
                {
                    "author_link": "https://gov.uniswap.org/u/tmlee",
                    "index": "3",
                    "likes": "0",
                    "time": "02/10/2020-02:41:48",
                    "content": "Thank you for helping to see this through! Appreciate it! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/TMod_Marco",
                    "index": "4",
                    "likes": "0",
                    "time": "02/10/2020-08:54:31",
                    "content": "No problem, I’ll close this thread as an answer on how to change this was provided  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/TMod_Marco",
                    "index": "5",
                    "likes": "0",
                    "time": "02/10/2020-08:54:34",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "395"
}