{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/uni-default-list/14407",
            "title": "UNI Default list ",
            "index": 14407,
            "category": [
                "Proposal Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/wijuwiju",
                    "index": "1",
                    "likes": "4",
                    "time": "07/10/2021-00:57:26",
                    "content": "Hello guys! I was reading this proposal discussion to update $ANT’s address, and made me research a bit how default token list works. Currently uniswap uses gemini token list instead, that hasn’t been updated for half a year, nor gov have direct control over it, unlike with default one. I got nothing against it, I just think its time for community to provide the protocol with an awesome token list it deserves that is curated in a decentralised and fair manner. Also Optimism and Arbitrum network lists are maintained by optimism ethereum and offchain labs accordingly.  Screenshot 2021-10-07 at 01.02.26820×982 79.1 KB  Deprecated default token list is on github What this discussion aims to achieve?  Discuss potential mechanics to govern the token list (committee, off-chain vote, etc)  Imho this is super important:  as it posses enormous power on people’s decision making affects listed token and platform credibility  It would be governing body’s responsibility to make it as neutral, transparent, inclusive, decentralised and prone to attacks as possible as well as it should aspire to meet core values of ethereum ethos.  Define token requirements for the list inclusion (background, cap, ecosystem, team, tvl, volume, etc)  This should be as clear as possible to avoid any controversy, since everyone would want to get into it  Outline technical aspects   Wether current schema needs an update. i.e improved chain support? Migrate repo to radicle and connect to gnosis safe in case of committee control? Would it be possible to create a permissionless direct governance to update and control the list when certain rules are met? Maybe something like ceramic.network stream update by offchain verifiable vote results Interface to control, vote, submit tokens, etc?   Formulate potential steps of execution   Initial goal UNI governance MVP (v0.1) token list to be used at app.uniswap.org as a basis and iterate from there. (In the future it could also split into multiple lists i.e Uniswap ecosystem ones, upcoming tokens, grouped by segment/industry, dynamically created, hot/sponsored etc) Would love to hear feedback and wether this all makes sense ",
                    "links": [
                        "https://tokenlists.org/token-list?url=https://www.gemini.com/uniswap/manifest.json",
                        "https://global.discourse-cdn.com/business6/uploads/uniswap1/original/2X/1/14ded6dc799ec394fa7007f823e2eec4ca2792ad.jpeg",
                        "https://github.com/Uniswap/default-token-list/blob/master/src/tokens/mainnet.json",
                        "https://github.com/Uniswap/default-token-list/issues",
                        "https://uniswap.org/tokenlist.schema.json",
                        "https://docs.radicle.xyz/docs/connecting-to-ethereum/creating-an-org",
                        "http://app.uniswap.org"
                    ],
                    "GPT-summary": "The author of the post is proposing to update the default token list used by Uniswap and is seeking feedback on potential mechanics to govern the token list, define token requirements for inclusion, outline technical aspects, and formulate potential steps of execution. The post also invites feedback and collaboration on the proposal.",
                    "GPT-proposal-categories": [
                        "Community and engagement",
                        "Token economics",
                        "Privacy, Security and risk management",
                        "Interoperability and Scaleability",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.821946169772256
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Buckerino",
                    "index": "2",
                    "likes": "2",
                    "time": "07/10/2021-09:05:36",
                    "content": "I think this is an awesome idea! It does make sense and I like the structural approach. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Naught",
                    "index": "3",
                    "likes": "1",
                    "time": "11/10/2021-18:48:38",
                    "content": "Great idea! This would be a good way to get more involved in Uniswap Governance. Current methods to accessible tokens with low barriers to entry:  CoinGecko token list Inputting Token Address  The risk of having a token list that is too open is it becomes a way to legitimize sketchy projects. Mechanics to govern the token list:   UGP Token List: Tokens on this list have recieved a UGP grant in the past. This allows a showcasing of projects that have passed screening criteria of the UGP comitee as being worthy of a grant in the past/future. (easiest to impliment, commitee already in place)   Uniswap Community Token List: Snapshot vote/off chain vote to include a project to this token list. Requires a minimum of UNI to pass by consensus, i.e. 30k threshold UNI to pass with majority of yes, minimum raised as intrest gains/or issues with bad actor delegates. This list would start with a replication of the Gemini List. (requires more engagement with UNI holders)   Uniswap Token Commitee List: Multisig is created with an initial commitee of 10 people. To list a token it costs ~300 USD to be payed in UNI and sent to the Multisig. The commitee is an oversight panel and is payed a % of the funds recieved. The rest of the funds effectively burned or can be used as an insurance etc. (requires a new commitee formation and structure)     The job of the oversight panel is to: screen blatant scams/code of those who applied. Tokens who applied and do not pass the oversight committee lose the deposited listing cost.   To apply for this token list. 1) a github introduction to project 2) how token is used (community token, payments, etc) 3) and a link to project’s repository 4) $300 (in UNI) deposit to multisig with tx hash.   Github introduction will serve two purposes, a public declaration of intent of good faith, and also a way for people to have dialogue for the specific project (i.e. grievances)   It may be beneficial to launch different lists models at the same time inorder to gauge which is a better approach overtime. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.9273088023088025
                },
                {
                    "author_link": "https://gov.uniswap.org/u/PatrickOD",
                    "index": "4",
                    "likes": "0",
                    "time": "09/08/2022-18:15:32",
                    "content": "Love this idea.  Has there been any progress made? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                }
            ]
        }
    ],
    "group_index": "140"
}