{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/buyback-burn-is-the-winner/9738",
            "title": "Buyback & Burn is the winner ",
            "index": 9738,
            "category": [
                "Proposal Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/sommi",
                    "index": "1",
                    "likes": "6",
                    "time": "14/01/2021-07:01:20",
                    "content": "If you read the messages carefully and research the users individually you can see that the majority of people prefer a Buyback & Burn.  Who are the people that are against the obvious winner of “Buyback & Burn” which will push UNI to a price above $100? Let’s find out. It’s members from VC’s and also Liquidity Miners.   VC’s are vultures  and aren’t here for the long-term anyway because they have performance results every quarter and want to dump their tokens immediately for their balance sheet. Liquidity Miners are scared  of holding a token longer than 17 hours. They want to constantly dump their rewards, hence why they only vote for more rewards and are short-sighted. Uniswap hodlers are all here and we are the majority. We don’t need these short-sighted and ignorant participants to weigh down on the future of Uniswap.  It’s clear, use the 0.05% protocol fee switch to buy back and burn the token. Uniswap is a long-term hodl. Do not listen to VC’s and Liquidity miners as they are only looking out for their selfish interests. Also, Dividend payment is inferior because it has tax implications for everyone. If you are receiving “Uni dividends” into an account, it makes it a lot more messy. Instead, doing the buyback & burn is extremely superior. Reward the Hodlers. Punish the speculators.  Uni power, $100 here we come ",
                    "links": [],
                    "GPT-summary": "The post argues for the implementation of a \"Buyback & Burn\" strategy for the Uniswap token, and criticizes VC's and Liquidity Miners for being short-sighted and not looking out for the long-term interests of Uniswap hodlers. The author argues that the proposed strategy is superior to dividend payments, which have tax implications.",
                    "GPT-proposal-categories": [
                        "Token economics",
                        "Community and engagement",
                        "Privacy, Security and risk management",
                        "None",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.263888888888889
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Danpi314",
                    "index": "2",
                    "likes": "8",
                    "time": "14/01/2021-11:36:47",
                    "content": "Firstly, this cannot be switched on for 180 days post lanuch, that’s written in code. Secondly, buy and burn gives the VC’s you hate so much more power as it leaves less Uni on the open market for us, and their proportion of the total will increase and eventually could exceed 50%. Sure, I’d like the price to go up but never at the cost of ruining decentralisation, allowing the public to have less than a 50% share of the tokens. In terms of taxes, while I pay mine it’s safe to assume a lot in DeFi are less willing to generally and we shouldn’t be creating a structure based on what’s gives you in your country the most post tax gain, it needs to be what’s good for the protocol as a whole. I have more reasons posted on the channel linked below, I’m not sure why you’ve created a new one, and I’ll only respond there in future for related questions so we don’t have 100’s of duplicated channels.     [POLL] How Would We Structure a Fee Reward? Proposal Discussion       Very interesting discussion, the option to switch on the fee should be available from mid march according to the 180 day time lock.  After reading through all these messages, I see the reasons not to buy and burn but to instead distribute X to all those that stake in the UNI voting contract for the following reasons;    Incentivises staking in the voting mechanism rather than just passive holding (As only those that register to vote get the benefits from fee distribution, encouraging more to vot…     ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.704545454545454
                }
            ]
        }
    ],
    "group_index": "530"
}