{
    "poll_list": [
        {
            "id": "0x7f196c3444623a33ac147d1676d84e45d3c4c56a94baa85547b77d6fab82faab",
            "title": "[Temperature Check] Should the Uniswap community participate in the Protocol Guild Pilot?",
            "discussion": "https://gov.uniswap.org/t/temperature-check-should-the-uniswap-community-participate-in-the-protocol-guild-pilot/16904",
            "body": "Authors: [Trent](https://twitter.com/trent_vanepps) (PG Member), [Tim](https://twitter.com/TimBeiko) (PG Member)\n\n### Abstract\n\nThis is a proposal for the Uniswap community to support important Ethereum Public Goods through the Protocol Guild: a vested split contract which goes to 110 core protocol contributors.\n\nWe propose that 500k UNI (~$2.5mm @ $5.19 UNI) be allocated to support the ongoing work of these core contributors in the initial Protocol Guild Pilot.\n\nParticipating in the 1 year Pilot allows guild members to engage with Uniswap in a way that is values- and incentive-aligned. Simultaneously, it will allow them to continue the important work of scaling our shared infrastructure and making it as resilient as possible for the applications on top of it.\n\n### Useful links\n\n* [Protocol Guild Docs](https://protocol-guild.readthedocs.io/en/latest/index.html#)\n* [1 Year Vesting Contract](https://app.0xsplits.xyz/accounts/0xF29Ff96aaEa6C9A1fBa851f74737f3c069d4f1a9/)\n* [Initial Announcement - Dec 2021](https://stateful.mirror.xyz/mEDvFXGCKdDhR-N320KRtsq60Y2OPk8rHcHBCFVryXY)\n* [List of Members](https://protocol-guild.readthedocs.io/en/latest/9-membership.html)\n* [PG twitter account](https://twitter.com/ProtocolGuild)\n\n### Context\n\n1. As a credibly neutral, maximally uncapturable infrastructure with no block reward, the Ethereum base protocol doesn’t offer the same token incentives to contributors as applications or L2s can. However, the protocol still needs to attract and retain talent to continue to evolve. As the broader ecosystem continues to grow, competition for talented individuals will only increase. This isn’t to fault individuals for rationally weighting financial incentives, or protocols for leveraging the power of tokens - this is just the reality of the current context. We also acknowledge that financial motivations aren’t the only or best motivator for people, it’s just one tool in our toolset that is currently underleveraged.\n2. Existing public goods funding solutions tend to be either too narrow or broad in scope, fail to exclusively target core protocol contributors, or depend on an intermediating institution, which often leads to organizations, and not individuals, being recipients of funds.\n3. The Protocol benefits from contributor continuity. Transferring institutional knowledge between cohorts is more likely to happen successfully the more overlap there is.\n\nHere’s a longer exploration of the [project rationale](https://protocol-guild.readthedocs.io/en/latest/1-proposal-rationale.html).\n\nIf we believe what we are building is important, then we should structure the incentives to attract more smart people to work on it. After all - “Ethereum is an unprecedented arena for playing cooperative games”; we should try to manifest the novel possibilities made possible by this arena. ([Griffith, 2019](https://medium.com/@virgilgr/ethereum-is-game-changing-technology-literally-d67e01a01cf8))\n\n### What is the Protocol Guild?\n\nThe Protocol Guild aims to address the challenges mentioned above with a simple tool: a weighted split contract that includes vesting. Members will solicit sponsorships in the form of tokens from applications & protocols that build on Ethereum, which gives core contributors exposure to success at the application layer:\n\n* current contributors are rewarded for past work through [time-based weighting](https://protocol-guild.readthedocs.io/en/latest/6-guidelines-for-regular-operation.html#weighting)\n* current contributors contribute for longer periods, resulting in less contributor churn, better institutional knowledge transfer, and more stable core infrastructure\n* new contributors are incentivized to join core protocol work, protocol evolution and maintenance is more robust\n\nTo date, the membership includes over 110 Ethereum protocol contributors, including researchers, client maintainers, upgrade coordinators, and more, all self-curated (member list [here](https://protocol-guild.readthedocs.io/en/latest/9-membership.html)). This is a broad-based ecosystem effort: members come from 22 different teams and 9 organizations. Only 30% of members are directly employed by the EF. The membership is continuously curated and there are quarterly updates to the split contract.\n\nThe Guild contracts will act as an autonomous value routing mechanism, operated independently from any existing institution, purpose-built for incentivizing long-term core protocol work. At no point does PG take custody of funds on behalf of members, it is all handled trustlessly. The diagram below and the [docs](https://protocol-guild.readthedocs.io/en/latest/3-smart-contract.html) have more information.\n\n \n![0xsplits horizontal.png](ipfs://QmdpmizBcNGuVV5FZR4zLUz3wsYTTdfNpVZsywMC7Utpdo)\n    \n\n### PG Pilot\n\nSince starting the project in Nov 2021, we’ve built norms around member onboarding, refined the splitting and vesting mechanisms, and have created extensive documentation on how PG operates. At this point, we’re ready to test the mechanism’s efficacy with a 1 year / $10-20mm Pilot. We want to make sure the mechanism operates smoothly before graduating to a larger round with longer vesting periods. We are currently outreaching to 5-10 prominent Ethereum-based projects to get commitments for this important first milestone. We want to ensure there is a healthy diversity of contributing protocols both in terms of USD value as well as domain (eg. DeFi, staking, etc). The first commitment is from Lido to contribute [2,000,000 LDO](https://research.lido.fi/t/proposal-to-fund-the-protocol-guild-pilot-via-a-lido-grant/2016/1), and the [vote](https://snapshot.org/#/ens.eth/proposal/0xe07284156fb063d5fba6b9fed50cc74fad36ea02c2ede0207434db476884104b) ([forum post](https://discuss.ens.domains/t/ep13-executable-support-the-protocol-guild-pilot/12877/50)) to contribute 200k ENS will conclude in the next few days.\n\nThe funds for the Pilot would be vested directly to Guild members over one year: see the [Pilot vesting contract here](https://app.0xsplits.xyz/accounts/0xF29Ff96aaEa6C9A1fBa851f74737f3c069d4f1a9/). Note that funds would not replace salaries for core contributors, and each recipient would be making an independent decision about how to use their tokens once vested.\n\n### Proposal\n\nWe are inviting the Uniswap community to be part of this inaugural Pilot in the form of a 500k UNI transfer to the Protocol Guild’s vesting contract. We think this is an appropriate amount which balances between the current size of the treasury ([$1.2b as of May 16, 2022](https://openorgs.info/)), the number of beneficiaries, and the scope and intent of the Pilot.\n\nThere are a few reasons why supporting the Protocol Guild benefits the Uniswap community:\n\n* Uniswap’s long-term success is tightly coupled with the continued evolution and maintenance of the Ethereum protocol. These are projects that often have multi-year timelines. Contributing to the Pilot meaningfully increases the incentive to contribute to the core protocol, including:\n  * [The Merge](https://github.com/ethereum/pm/blob/master/Merge/mainnet-readiness.md): moving from PoW to PoS, increasing security and sustainability\n  * EVM improvements: new functionality for developers like [EOF](https://notes.ethereum.org/@ipsilon/evm-object-format-overview)\n  * [Statelessness](https://notes.ethereum.org/@gballet/Sy-a6T5St): sustainable management for state growth\n  * Supporting L2 scaling: [EIP-4844](https://eips.ethereum.org/EIPS/eip-4844), [EIP-4488](https://eips.ethereum.org/EIPS/eip-4488)\n  * [Proposer Builder Separation](https://notes.ethereum.org/@vbuterin/pbs_censorship_resistance): reducing centralizing incentives for consensus participants\n  * Continuous client maintenance: improving sync, exploring new database types, researching modular clients\n  * Coordinating network upgrades: making sure the community helps to shape and is aware of network upgrades\n* Having exposure to UNI allows protocol contributors to engage more with Uniswap governance. Members will be encouraged (but not obligated) to use the vested tokens in their respective governance framework.\n* Uniswap should be among the protocols maximally aligned with the Public Goods of the largest ecosystem it operates in. Pilot participation maintains and expands the Uniswap community’s existing reputation for funding Public Goods.\n* Diverse funding sources from the community further decentralizes protocol governance and prevents influence from pooling with any single entity.\n\n### Next Steps\n\nIf this Temp Check Snapshot vote has a positive outcome, we will move to a consensus check, and then an onchain vote.",
            "choices": [
                "Yes ",
                "No"
            ],
            "scores": [
                13703636.565145386,
                44.50228195936072
            ],
            "start": 1654183625,
            "end": 1654444800,
            "snapshot": "14891786",
            "state": "closed",
            "author": "0x4C0a466DF0628FE8699051b3Ac6506653191cc21",
            "space": {
                "id": "uniswap",
                "name": "Uniswap"
            }
        },
        {
            "title": "Should the Uniswap community participate in the Pr…",
            "date": "Proposed on: Jun 15th, 2022",
            "yes_votes": "70.4M",
            "no_votes": "1.06K"
        },
        {
            "title": "Should the Uniswap community participate in the Pr…",
            "date": "Proposed on: Jun 14th, 2022",
            "yes_votes": "0",
            "no_votes": "0"
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/temperature-check-should-the-uniswap-community-participate-in-the-protocol-guild-pilot/16904",
            "title": "[Temperature Check] Should the Uniswap community participate in the Protocol Guild Pilot? ",
            "index": 16904,
            "category": [
                "Temperature Check"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/trent",
                    "index": "1",
                    "likes": "2",
                    "time": "02/06/2022-15:25:51",
                    "content": "- This post follows the initial Proposal Discussion - UNI delegates can express their preference on this Temp Check Snapshot Vote  Authors: Trent (PG Member), Tim (PG Member)  Abstract This is a proposal for the Uniswap community to support important Ethereum Public Goods through the Protocol Guild: a vested split contract which goes to 110 core protocol contributors. We propose that 500k UNI (~$2.5mm @ $5.19 UNI) be allocated to support the ongoing work of these core contributors in the initial Protocol Guild Pilot. Participating in the 1 year Pilot allows guild members to engage with Uniswap in a way that is values- and incentive-aligned. Simultaneously, it will allow them to continue the important work of scaling our shared infrastructure and making it as resilient as possible for the applications on top of it.  Useful links  Protocol Guild Docs 1 Year Vesting Contract Initial Announcement - Dec 2021 List of Members PG twitter account   Context  As a credibly neutral, maximally uncapturable infrastructure with no block reward, the Ethereum base protocol doesn’t offer the same token incentives to contributors as applications or L2s can. However, the protocol still needs to attract and retain talent to continue to evolve. As the broader ecosystem continues to grow, competition for talented individuals will only increase. This isn’t to fault individuals for rationally weighting financial incentives, or protocols for leveraging the power of tokens - this is just the reality of the current context. We also acknowledge that financial motivations aren’t the only or best motivator for people, it’s just one tool in our toolset that is currently underleveraged. Existing public goods funding solutions tend to be either too narrow or broad in scope, fail to exclusively target core protocol contributors, or depend on an intermediating institution, which often leads to organizations, and not individuals, being recipients of funds. The Protocol benefits from contributor continuity. Transferring institutional knowledge between cohorts is more likely to happen successfully the more overlap there is.  Here’s a longer exploration of the project rationale. If we believe what we are building is important, then we should structure the incentives to attract more smart people to work on it. After all - “Ethereum is an unprecedented arena for playing cooperative games”; we should try to manifest the novel possibilities made possible by this arena. (Griffith, 2019)  What is the Protocol Guild? The Protocol Guild aims to address the challenges mentioned above with a simple tool: a weighted split contract that includes vesting. Members will solicit sponsorships in the form of tokens from applications & protocols that build on Ethereum, which gives core contributors exposure to success at the application layer:  current contributors are rewarded for past work through time-based weighting  current contributors contribute for longer periods, resulting in less contributor churn, better institutional knowledge transfer, and more stable core infrastructure new contributors are incentivized to join core protocol work, protocol evolution and maintenance is more robust  To date, the membership includes over 110 Ethereum protocol contributors, including researchers, client maintainers, upgrade coordinators, and more, all self-curated (member list here). This is a broad-based ecosystem effort: members come from 22 different teams and 9 organizations. Only 30% of members are directly employed by the EF. The membership is continuously curated and there are quarterly updates to the split contract. The Guild contracts will act as an autonomous value routing mechanism, operated independently from any existing institution, purpose-built for incentivizing long-term core protocol work. At no point does PG take custody of funds on behalf of members, it is all handled trustlessly. The diagram below and the docs have more information.  0xsplits horizontal3144×2024 413 KB   PG Pilot Since starting the project in Nov 2021, we’ve built norms around member onboarding, refined the splitting and vesting mechanisms, and have created extensive documentation on how PG operates. At this point, we’re ready to test the mechanism’s efficacy with a 1 year / $10-20mm Pilot. We want to make sure the mechanism operates smoothly before graduating to a larger round with longer vesting periods. We are currently outreaching to 5-10 prominent Ethereum-based projects to get commitments for this important first milestone. We want to ensure there is a healthy diversity of contributing protocols both in terms of USD value as well as domain (eg. DeFi, staking, etc). The first commitment is from Lido to contribute 2,000,000 LDO, and the vote (forum post) to contribute 200k ENS will conclude in the next few days. The funds for the Pilot would be vested directly to Guild members over one year: see the Pilot vesting contract here. Note that funds would not replace salaries for core contributors, and each recipient would be making an independent decision about how to use their tokens once vested.  Proposal We are inviting the Uniswap community to be part of this inaugural Pilot in the form of a 500k UNI transfer to the Protocol Guild’s vesting contract. We think this is an appropriate amount which balances between the current size of the treasury ($1.2b as of May 16, 2022), the number of beneficiaries, and the scope and intent of the Pilot. There are a few reasons why supporting the Protocol Guild benefits the Uniswap community:  Uniswap’s long-term success is tightly coupled with the continued evolution and maintenance of the Ethereum protocol. These are projects that often have multi-year timelines. Contributing to the Pilot meaningfully increases the incentive to contribute to the core protocol, including:   The Merge: moving from PoW to PoS, increasing security and sustainability EVM improvements: new functionality for developers like EOF   Statelessness: sustainable management for state growth Supporting L2 scaling: EIP-4844, EIP-4488   Proposer Builder Separation: reducing centralizing incentives for consensus participants Continuous client maintenance: improving sync, exploring new database types, researching modular clients Coordinating network upgrades: making sure the community helps to shape and is aware of network upgrades   Having exposure to UNI allows protocol contributors to engage more with Uniswap governance. Members will be encouraged (but not obligated) to use the vested tokens in their respective governance framework. Uniswap should be among the protocols maximally aligned with the Public Goods of the largest ecosystem it operates in. Pilot participation maintains and expands the Uniswap community’s existing reputation for funding Public Goods. Diverse funding sources from the community further decentralizes protocol governance and prevents influence from pooling with any single entity.   Next Steps If the Temp Check Snapshot vote has a positive outcome, we will move to a consensus check, and then an onchain vote. ",
                    "links": [
                        "https://snapshot.org/#/uniswap/proposal/0x7f196c3444623a33ac147d1676d84e45d3c4c56a94baa85547b77d6fab82faab",
                        "https://twitter.com/trent_vanepps",
                        "https://twitter.com/TimBeiko",
                        "https://protocol-guild.readthedocs.io/en/latest/index.html#",
                        "https://app.0xsplits.xyz/accounts/0xF29Ff96aaEa6C9A1fBa851f74737f3c069d4f1a9/",
                        "https://stateful.mirror.xyz/mEDvFXGCKdDhR-N320KRtsq60Y2OPk8rHcHBCFVryXY",
                        "https://protocol-guild.readthedocs.io/en/latest/9-membership.html",
                        "https://twitter.com/ProtocolGuild",
                        "https://protocol-guild.readthedocs.io/en/latest/1-proposal-rationale.html",
                        "https://medium.com/@virgilgr/ethereum-is-game-changing-technology-literally-d67e01a01cf8",
                        "https://protocol-guild.readthedocs.io/en/latest/6-guidelines-for-regular-operation.html#weighting",
                        "https://protocol-guild.readthedocs.io/en/latest/9-membership.html",
                        "https://protocol-guild.readthedocs.io/en/latest/3-smart-contract.html",
                        "https://global.discourse-cdn.com/business6/uploads/uniswap1/original/2X/1/1ce63fdd13884237d4b5ce30299ce8c0239240f4.png",
                        "https://research.lido.fi/t/proposal-to-fund-the-protocol-guild-pilot-via-a-lido-grant/2016/1",
                        "https://snapshot.org/#/ens.eth/proposal/0xe07284156fb063d5fba6b9fed50cc74fad36ea02c2ede0207434db476884104b",
                        "https://discuss.ens.domains/t/ep13-executable-support-the-protocol-guild-pilot/12877/50",
                        "https://app.0xsplits.xyz/accounts/0xF29Ff96aaEa6C9A1fBa851f74737f3c069d4f1a9/",
                        "https://openorgs.info/",
                        "https://github.com/ethereum/pm/blob/master/Merge/mainnet-readiness.md",
                        "https://notes.ethereum.org/@ipsilon/evm-object-format-overview",
                        "https://notes.ethereum.org/@gballet/Sy-a6T5St",
                        "https://eips.ethereum.org/EIPS/eip-4844",
                        "https://eips.ethereum.org/EIPS/eip-4488",
                        "https://notes.ethereum.org/@vbuterin/pbs_censorship_resistance",
                        "https://snapshot.org/#/uniswap/proposal/0x7f196c3444623a33ac147d1676d84e45d3c4c56a94baa85547b77d6fab82faab",
                        "https://gov.uniswap.org/t/governance-proposal-should-the-uniswap-community-participate-in-the-protocol-guild-pilot/16824/19"
                    ],
                    "GPT-summary": "The post proposes that the Uniswap community support the Protocol Guild, a vested split contract that goes to 110 core protocol contributors, with a transfer of 500k UNI. The Protocol Guild aims to incentivize long-term core protocol work and address the challenges of attracting and retaining talent to continue to evolve the Ethereum base protocol. The post explains the benefits of supporting the Protocol Guild for the Uniswap community and invites the community to participate in the inaugural Pilot. The post also provides useful links and context about the Protocol Guild and its members.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Token economics",
                        "Interoperability and Scalability",
                        "Law and regulations"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.7750832968529595
                },
                {
                    "author_link": "https://gov.uniswap.org/u/BOR4",
                    "index": "2",
                    "likes": "3",
                    "time": "06/06/2022-20:19:02",
                    "content": "congratz on a successful Temp check! Considering this proposal met the requirement of a Consensus check during the Temperature check and there was no feedback or discussion from the community during the process, I feel you guys can skip the Consensus check phase and go straight for the on-chain vote as it seems just as an unnecessary step at this point. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.229166666666667
                }
            ]
        },
        {
            "thread_link": "https://gov.uniswap.org/t/governance-proposal-should-the-uniswap-community-participate-in-the-protocol-guild-pilot/16824",
            "title": "[Governance Proposal] Should the Uniswap community participate in the Protocol Guild Pilot? ",
            "index": 16824,
            "category": [
                "Proposal Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/trent",
                    "index": "1",
                    "likes": "7",
                    "time": "17/05/2022-21:45:59",
                    "content": "Authors: Trent (PG Member), Tim (PG Member)  Abstract This is a proposal for the Uniswap community to support important Ethereum Public Goods through the Protocol Guild: a vested split contract which goes to 110 core protocol contributors. We propose that 500k UNI (~$2.5mm) be allocated to support the ongoing work of these core contributors in the initial Protocol Guild Pilot. Participating in the 1 year Pilot allows guild members to engage with Uniswap in a way that is values- and incentive-aligned. Simultaneously, it will allow them to continue the important work of scaling our shared infrastructure and making it as resilient as possible for the applications on top of it.  Useful links  Protocol Guild Docs 1 Year Vesting Contract Initial Announcement - Dec 2021 List of Members   Context  As a credibly neutral, maximally uncapturable infrastructure with no block reward, the Ethereum base protocol doesn’t offer the same token incentives to contributors as applications or L2s can. However, the protocol still needs to attract and retain talent to continue to evolve. As the broader ecosystem continues to grow, competition for talented individuals will only increase. This isn’t to fault individuals for rationally weighting financial incentives, or protocols for leveraging the power of tokens - this is just the reality of the current context. We also acknowledge that financial motivations aren’t the only or best motivator for people, it’s just one tool in our toolset that is currently underleveraged. Existing public goods funding solutions tend to be either too narrow or broad in scope, fail to exclusively target core protocol contributors, or depend on an intermediating institution, which often leads to organizations, and not individuals, being recipients of funds. The Protocol benefits from contributor continuity. Transferring institutional knowledge between cohorts is more likely to happen successfully the more overlap there is.  Here’s a longer exploration of the project rationale. If we believe what we are building is important, then we should structure the incentives to attract more smart people to work on it. After all - “Ethereum is an unprecedented arena for playing cooperative games”; we should try to manifest the novel possibilities made possible by this arena. (Griffith, 2019)  What is the Protocol Guild? The Protocol Guild aims to address the challenges mentioned above with a simple tool: a weighted split contract that includes vesting. Members will solicit sponsorships in the form of tokens from applications & protocols that build on Ethereum, which gives core contributors exposure to success at the application layer:  current contributors are rewarded for past work through time-based weighting  current contributors contribute for longer periods, resulting in less contributor churn, better institutional knowledge transfer, and more stable core infrastructure new contributors are incentivized to join core protocol work, protocol evolution and maintenance is more robust  To date, the membership includes over 110 Ethereum protocol contributors, including researchers, client maintainers, upgrade coordinators, and more, all self-curated (member list here). This is a broad-based ecosystem effort: members come from 22 different teams and 9 organizations. Only 30% of members are directly employed by the EF. The membership is continuously curated and there are quarterly updates to the split contract. The Guild contracts will act as an autonomous value routing mechanism, operated independently from any existing institution, purpose-built for incentivizing long-term core protocol work. At no point does PG take custody of funds on behalf of members, it is all handled trustlessly. The diagram below and the docs have more information.  0xsplits horizontal3144×2024 413 KB   PG Pilot Since starting the project in Nov 2021, we’ve built norms around member onboarding, refined the splitting and vesting mechanisms, and have created extensive documentation on how PG operates. At this point, we’re ready to test the mechanism’s efficacy with a 1 year / $10-20mm Pilot. We want to make sure the mechanism operates smoothly before graduating to a larger round with longer vesting periods. We are currently outreaching to 5-10 prominent Ethereum-based projects to get commitments for this important first milestone. We want to ensure there is a healthy diversity of contributing protocols both in terms of USD value as well as domain (eg. DeFi, staking, etc). The first commitment is from Lido to contribute 2,000,000 LDO. The funds for the Pilot would be vested directly to Guild members over one year: see the Pilot vesting contract here. Note that funds would not replace salaries for core contributors, and each recipient would be making an independent decision about how to use their tokens once vested.  Proposal We are inviting the Uniswap community to be part of this inaugural Pilot in the form of a 500k UNI transfer to the Protocol Guild’s vesting contract. We think this is an appropriate amount which balances between the current size of the treasury ($1.2b as of May 16, 2022), the number of beneficiaries, and the scope and intent of the Pilot. There are a few reasons why supporting the Protocol Guild benefits the Uniswap community:  Uniswap’s long-term success is tightly coupled with the continued evolution and maintenance of the Ethereum protocol. These are projects that often have multi-year timelines. Contributing to the Pilot meaningfully increases the incentive to contribute to the core protocol, including:   The Merge: moving from PoW to PoS, increasing security and sustainability EVM improvements: new functionality for developers like EOF   Statelessness: sustainable management for state growth Supporting L2 scaling: EIP-4844, EIP-4488   Proposer Builder Separation: reducing centralizing incentives for consensus participants Continuous client maintenance: improving sync, exploring new database types, researching modular clients Coordinating network upgrades: making sure the community helps to shape and is aware of network upgrades   Having exposure to UNI allows protocol contributors to engage more with Uniswap governance. Members will be encouraged (but not obligated) to use the vested tokens in their respective governance framework. Uniswap should be among the protocols maximally aligned with the Public Goods of the largest ecosystem it operates in. Pilot participation maintains and expands the Uniswap community’s existing reputation for funding Public Goods. Diverse funding sources from the community further decentralizes protocol governance and prevents influence from pooling with any single entity.   Next Steps Discussion on this forum post - we’re very interested in feedback on how to adapt this to best fit the goals of the Uniswap community. ",
                    "links": [
                        "https://twitter.com/TimBeiko",
                        "https://protocol-guild.readthedocs.io/en/latest/index.html#",
                        "https://app.0xsplits.xyz/accounts/0xF29Ff96aaEa6C9A1fBa851f74737f3c069d4f1a9/",
                        "https://stateful.mirror.xyz/mEDvFXGCKdDhR-N320KRtsq60Y2OPk8rHcHBCFVryXY",
                        "https://protocol-guild.readthedocs.io/en/latest/9-membership.html",
                        "https://protocol-guild.readthedocs.io/en/latest/1-proposal-rationale.html",
                        "https://medium.com/@virgilgr/ethereum-is-game-changing-technology-literally-d67e01a01cf8",
                        "https://protocol-guild.readthedocs.io/en/latest/6-guidelines-for-regular-operation.html#weighting",
                        "https://protocol-guild.readthedocs.io/en/latest/9-membership.html",
                        "https://protocol-guild.readthedocs.io/en/latest/3-smart-contract.html",
                        "https://global.discourse-cdn.com/business6/uploads/uniswap1/original/2X/1/1ce63fdd13884237d4b5ce30299ce8c0239240f4.png",
                        "https://research.lido.fi/t/proposal-to-fund-the-protocol-guild-pilot-via-a-lido-grant/2016/1",
                        "https://app.0xsplits.xyz/accounts/0xF29Ff96aaEa6C9A1fBa851f74737f3c069d4f1a9/",
                        "https://openorgs.info/",
                        "https://github.com/ethereum/pm/blob/master/Merge/mainnet-readiness.md",
                        "https://notes.ethereum.org/@ipsilon/evm-object-format-overview",
                        "https://notes.ethereum.org/@gballet/Sy-a6T5St",
                        "https://eips.ethereum.org/EIPS/eip-4844",
                        "https://eips.ethereum.org/EIPS/eip-4488",
                        "https://notes.ethereum.org/@vbuterin/pbs_censorship_resistance",
                        "https://gov.uniswap.org/t/temperature-check-should-the-uniswap-community-participate-in-the-protocol-guild-pilot/16904"
                    ],
                    "GPT-summary": "The post is a proposal for the Uniswap community to support Ethereum Public Goods through the Protocol Guild. The authors propose that 500k UNI be allocated to support the ongoing work of core contributors in the initial Protocol Guild Pilot. The post explains the challenges faced by the Ethereum base protocol in attracting and retaining talent and how the Protocol Guild aims to address these challenges. The authors invite the Uniswap community to participate in the inaugural Pilot and provide reasons why supporting the Protocol Guild benefits the Uniswap community. The post also invites feedback on how to adapt the proposal to best fit the goals of the Uniswap community.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Interoperability and Scaleability",
                        "Token economics",
                        "Community and engagement",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.880352838449429
                },
                {
                    "author_link": "https://gov.uniswap.org/u/BOR4",
                    "index": "2",
                    "likes": "2",
                    "time": "18/05/2022-16:44:03",
                    "content": "PROS:  Uniswap is as strong as Ethereum is and should participate in funding further development of Ethereum Gulid includes really wide range of contributors (110+) Amount doesn’t seem too unreasonable  CONS:  incentives are completely automated. There isn’t incentive for reaching a certain goal. Maybe a combination of automated + goal incentives would be something to consider 1 year isn’t really vesting it is more EOY bonus  This is just my opinion. Generally I am in favor of the proposal and thing Uniswap should contribute to the development of core infrastructure. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.873511904761904
                },
                {
                    "author_link": "https://gov.uniswap.org/u/klinko",
                    "index": "3",
                    "likes": "0",
                    "time": "18/05/2022-17:12:06",
                    "content": "In favor but some other suggestions: KPI based incentives No vesting - what’s the point of forcing UNI to be held for something like this? If they were Uniswap contributors, that would make sense to incentivize longer term value accrual, but seeing as this is paid to Ethereum core dev contributors, just kill the vesting structure. It’s just forced annoyance that is becoming too commonplace where it doesn’t necessarily make sense. Somewhat related: The Uniswap community needs to see items like this as mechanisms to support the fee switch. Value accrual to UNI via fees, which will largely be ETH denominated, can then be used for contributions like this - better aligning incentives by paying in ETH. Would also make it such that the fees are not purely value extractive from LPs, as it goes to broader contributions like this. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.351190476190476
                },
                {
                    "author_link": "https://gov.uniswap.org/u/yitong",
                    "index": "4",
                    "likes": "3",
                    "time": "18/05/2022-23:03:16",
                    "content": "Hello! Thanks for writing this proposal. I’m generally in favor of the idea of funding infrastructure that Uniswap depends on and 500k UNI seems like a reasonable sum. However, I’d love to see what detail on what Protocol Guild expects to accomplish using this grant. While I don’t think committing to specific KPI is necessary, as @klinko suggested, as measuring research and engineering output can be difficult , having a set of goals outlined will help the Uniswap DAO assess whether this grant was well-spent later, and make further funding down the line easier as there will be a track record of execution. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.147222222222222
                },
                {
                    "author_link": "https://gov.uniswap.org/u/timbeiko",
                    "index": "5",
                    "likes": "2",
                    "time": "18/05/2022-23:14:32",
                    "content": "Thanks for sharing your thoughts! Will share mine on some of the pushbacks:     BOR4:  CONS:  incentives are completely automated. There isn’t incentive for reaching a certain goal. Maybe a combination of automated + goal incentives would be something to consider    I don’t think it’s right for Protocol Guild to have specific incentives tied into funding, otherwise it can very quickly turn into the “Protocol Bribe Guild”, which we definitely want to avoid  ! I think the “deliverable” you can expect is that client developers and researchers keep focusing on having Ethereum be the best base layer possible for Uniswap and other applications.     BOR4:   1 year isn’t really vesting it is more EOY bonus    Agreed 1Y isn’t a huge vesting period. That said, we do want to start with a shorter trial  because the Guild is new and we want to dry-run things like adding/removing folks, testing smart contract infrastructure, etc. over a long-but-not-super-long period. Hopefully that informs a V2 version of PG which can target longer duration (and hopefully larger/recurring) donations.     klinko:  No vesting - what’s the point of forcing UNI to be held for something like this? If they were Uniswap contributors, that would make sense to incentivize longer term value accrual, but seeing as this is paid to Ethereum core dev contributors, just kill the vesting structure. It’s just forced annoyance that is becoming too commonplace where it doesn’t necessarily make sense.   I think this also goes back to trialing the mechanism: if the next iteration of the Guild had, say, 4Y vesting, we want to make sure the process works as expected with just a 1Y vest. Similarly, a vesting structure allows PG to get the funds from DAOs up front rather than, say, coming back every N months with another governance proposal.     yitong:  However, I’d love to see what detail on what Protocol Guild expects to accomplish using this grant. While I don’t think committing to specific KPI is necessary, as @klinko suggested, as measuring research and engineering output can be difficult , having a set of goals outlined will help the Uniswap DAO assess whether this grant was well-spent later, and make further funding down the line easier as there will be a track record of execution   Very fair, you can see what we aim to accomplish with the Guild pilot in the docs (linked in the original post, can’t include links in my reply, sorry!) under 5.3 Documenting Outcomes. As for “what will members of the guild deliver”, I’ll repeat myself from above:  I think the “deliverable” you can expect is that client developers and researchers keep focusing on having Ethereum be the best base layer possible for Uniswap and other applications.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.492303391053391
                },
                {
                    "author_link": "https://gov.uniswap.org/u/klinko",
                    "index": "6",
                    "likes": "1",
                    "time": "19/05/2022-01:14:34",
                    "content": "Good points. @yitong I think you’re right in the difficulty to measure research and engineering, making KPI based incentives difficult. @timbeiko as it relates to vesting, I think an eventual 4y schedule may be difficult if denominated in the initial token - UNI in this case. I think a quicker conversion to either ETH or stables - or a mix - would still be fair, with then PG handling distribution over those 4 years. Perhaps a minor nuance but volatility should ideally be minimized while also targeting upside incentives, say via a 50/50 ETH & USD split. IMO, liquidity is deep enough and volume is high enough where even as a UNI holder I feel this would be fair ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.921428571428571
                },
                {
                    "author_link": "https://gov.uniswap.org/u/timbeiko",
                    "index": "7",
                    "likes": "3",
                    "time": "19/05/2022-20:15:38",
                    "content": "    klinko:  volatility should ideally be minimized while also targeting upside incentives, say via a 50/50 ETH & USD split   One thing I’d like to clarify: a design goal of the Protocol Guild is to provide protocol contributors with exposure to a basked of tokens from Ethereum projects. In this case, volatility is a feature and not a bug  The reason is that “base compensation” isn’t the thing we are trying to fix with PG. What we want to provide to guild members is “potential upside in the best Ethereum projects”, because that is what individuals forgo by working on the protocol instead of application layer. So, unless there is a reason for why a non-UNI grant is better for the Uniswap treasury, UNI-denominated works best for us  ! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 9.25
                },
                {
                    "author_link": "https://gov.uniswap.org/u/tobyshorin",
                    "index": "9",
                    "likes": "1",
                    "time": "25/05/2022-03:26:29",
                    "content": "Hi Tim and Trent, As you know, Uniswap has supported similar initiatives in the past. Other Internet is happy to endorse this initiative and we’d be pleased to see other protocols share upside with the Protocol Guild. You mention that this is a “trial” and that further iterations will have a longer vesting period. Can you maybe just say more about how you evaluate success or failure of the trial? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.6416666666666675
                },
                {
                    "author_link": "https://gov.uniswap.org/u/trent",
                    "index": "11",
                    "likes": "0",
                    "time": "25/05/2022-14:49:39",
                    "content": "PG members take a similar approach to designing and operating this project as we do with the core Ethereum protocol: long-term thinking, adversarial frameworks, and adaptivity (more here on Anticipated Concerns). We want PG to be around as long as it’s producing useful outcomes for the Ethereum protocol: a key part of that process is actively listening for and digesting feedback inputs. We’ve started with the collective perspective that this first Pilot design will need some tuning. This can be related to a changing external context: eg. should vesting timelines take broader market dynamics into account? Or internal to the mechanism: what ways have we misunderstood the effects of incentives, what do sponsors need, how should members better curate? In the near term, we have adopted an active stance of continuous adjustments to improve PG while we move deeper into the Pilot: improving documentation, resources for members, and better transparency. Longer term, we’ve committed to publicly evaluating Pilot outcomes here. These prompts will be updated over time as we start to hear back from participants - both members and sponsors. We’re happy to take additional suggestions for what to track! Our learnings will be published and incorporated into PG before the launch of the next iteration of the project. Thanks for the support, we are honored by the thoughtful consideration the Uniswap community has given us so far  ",
                    "links": [
                        "https://protocol-guild.readthedocs.io/en/latest/5-initial-pilot.html"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.841269841269842
                },
                {
                    "author_link": "https://gov.uniswap.org/u/uniyj",
                    "index": "12",
                    "likes": "0",
                    "time": "30/05/2022-11:08:17",
                    "content": "I am supportive of this, as I think it is indeed for long-term Ethereum common/public good, on which Uniswap has been built initially and will continue to benefit from. One thing that would help me (and hopefully others) to somewhat quantitatively contextualise the funding amount would be some estimated stats of how much (USD $ equiv) Guild members will get, from this ~$2.5M? For example, assuming ~110 members remain unchanged within the year, and they all continue with their current contribution trajectory, what does the estimated cumulative distribution plot (from $0 at contributor 0, up to cumulative $2.5M at contributor 110) look like, what are the quantile reward $ values, etc.? Thank you for this, and thank you all for your contributions!  yj ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.4
                },
                {
                    "author_link": "https://gov.uniswap.org/u/caideguang",
                    "index": "13",
                    "likes": "0",
                    "time": "30/05/2022-11:27:18",
                    "content": "At present, uniswap has made great contributions to the ETH community, but the holders of uni tokens have not received any return ~! Even the agreement income of uniswap itself can not be enjoyed! Any attempt to claim the uni token again at this time is an injury to the uni HOLDER ~! A large number of projects in the airdrop have given CRV and AAVE more benefits and authority. Uni has not enjoyed any benefits. It is meaningless to make such donations now! I will oppose any dilution now ~! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.090959821428572
                },
                {
                    "author_link": "https://gov.uniswap.org/u/mgomes",
                    "index": "14",
                    "likes": "1",
                    "time": "31/05/2022-03:48:19",
                    "content": "I support this proposal as Uniswaps ongoing ability to be a censorship-resistant and open to all application depends on the ethereum base layer to have and maintain these same properties. A large and varied group of core contributors (which should ideally be funded in part by a diverse community and not only a limited number of institutions) is essential for that. It seems like the protocol guild is trying to accomplish that. Some questions: Have the multisig-owners been chosen yet (from what I understand they will be trusted community members)? Why isn’t the nimbus team part of the Members List? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.1517857142857135
                },
                {
                    "author_link": "https://gov.uniswap.org/u/trent",
                    "index": "15",
                    "likes": "1",
                    "time": "31/05/2022-19:41:54",
                    "content": "Great question! We compute Split Weight as SQRT(( eligibleMonths - monthsOnBreak ) * timeWeighting ). Read more about weighting in the Protocol Guild here. As for the rest of your question, see images below and data here: Comparing UNI allocations at the beginning and the end of the PG Pilot. One of the nice aspects I’ve highlighted in the graphs re: retroactive time-based weighting is that even over a relatively short period of 12 months, we can already start to see the distribution start to normalize across contributors. Let me know if these answer your questions! (wasn’t sure how you meant to visualize quantiles feel free to DM on twitter or tg and we can discuss). As you noted, this will be updated quarterly, so members will see the benefits of rebalancing occuring after 3 months instead of 12.   ",
                    "links": [
                        "https://docs.google.com/spreadsheets/d/16HIN6muW3OPd7SGG1astkQaCvboVVQqEPQlZGFTJI_k/edit?usp=sharing"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/trent",
                    "index": "16",
                    "likes": "0",
                    "time": "31/05/2022-19:47:31",
                    "content": "Appreciate the comment, but we’re not comfortable bundling an orthogonal proposal with this one. If in the future the community decides to implement a fee switch to realize returns to UNI holders, we would be more than happy to revisit this discussion to continue this budding collaboration. Further, this doesn’t introduce any new supply of UNI, only distributes a very small % of the existing treasury. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.561868686868687
                },
                {
                    "author_link": "https://gov.uniswap.org/u/trent",
                    "index": "17",
                    "likes": "1",
                    "time": "31/05/2022-19:52:53",
                    "content": "Thanks for taking time to respond - we’re on the same page regarding core protocol Public Goods and the community funding them! The 6/10 multisig we are using has already been deployed, read more about the assumptions associated with it here. For privacy and security reasons the signers are not publicly shared. In the future, we’d like to move to a more trustless and transparent model that can take membership inputs (addresses & weights) from any Guild member. Nimbus is under Status  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.857142857142858
                },
                {
                    "author_link": "https://gov.uniswap.org/u/uniyj",
                    "index": "18",
                    "likes": "1",
                    "time": "01/06/2022-09:23:45",
                    "content": "This is great, thank you very much! The distribution seems reasonably well-spread to me, with just a small uptick for the four longest-serving contributors (towards the right of the plot). For quick reference, from your spreadsheet, the quantile values (at “end of 12-month”, $UNI @ $5.7) are approx. :  25th percentile = $19.7k 50th percentile (median) = $25.5k 75th percentile = $31.7k  Also, a few other stats are:  Min = $13.3k Mean = $26.1k Max = $42.2k  I think these numbers provide informative, quantitative context. Thanks again. yj ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.62827380952381
                },
                {
                    "author_link": "https://gov.uniswap.org/u/trent",
                    "index": "19",
                    "likes": "0",
                    "time": "02/06/2022-15:34:24",
                    "content": "Thank you everyone for the questions and discussion. We’ve moved this proposal to the next steps:  [Temperature Check] Should the Uniswap community participate in the Protocol Guild Pilot? Temp Check Snapshot vote  ",
                    "links": [
                        "https://snapshot.org/#/uniswap/proposal/0x7f196c3444623a33ac147d1676d84e45d3c4c56a94baa85547b77d6fab82faab"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 3.125
                },
                {
                    "author_link": "https://gov.uniswap.org/u/blockchaincolumbia",
                    "index": "20",
                    "likes": "1",
                    "time": "09/06/2022-16:55:38",
                    "content": "Blockchain@Columbia voted yes to the recent temperature check for the Protocol Guild Pilot Program.  We think it’s a significant initiative, and, as it 's a pilot, we wanted to offer further discussion from our Uniswap Protocol lead @jason_of_cs. Looking forward to any commentary! We believe that the PG proposal offers the potential to support –and further incentivize– essential Public Goods’ development, in the form of providing funding for the base protocol development of Ethereum. In this regard, and particularly due to the apparent reduction of the upside intertwined with the decreasing block reward, economically incentivizing the development of the core Ethereum development in a decentralized way is a particularly good idea. We would, however, like to emphasize that some further thought into the funding methodology for that purpose is necessary; in particular, we think that providing Protocol Guild with a diversified portfolio of application-layer assets –and more so, specifically used for governance– might not be the right way to fund such an initiative in the long term. First, having a diverse pool of governance tokens from more than some very small number of protocols may denigrate the quality of governance on those individual protocols (of which Uniswap is the example in point) since any one single contributor cannot possibly keep track of and meaningfully participate in a lot of governance forums at once. The meaning of providing governance tokens is exactly to primarily exercise governance (and not to be utilized as a financial incentive), therefore we think that there is little point to providing a diversified pool of governance tokens. Secondly, with a diversified pool providing upside to “a lot of” application-level assets, it may be the case that the provided upside is too much of a financial incentive in the long run; the parallel drawn to the financial motives being higher to contribute in an application-layer project is countered by the fact that it is objectively not possible to join/contribute to, say, 10 projects at the same time: one has to choose at most 1-2 desirable projects. At the same time, with a diversified pool providing diversified access to application-layer protocols, it is possible to get significant upside on all/most/many of them, something that as shown above, would be impossible to get through dev contribution alone. Thus, it is a realistic long-term risk that having more than a handful of application-layer sponsors participating on PG would over-incentivize; and one of the core reasons that someone might imagine this being undesirable is that it is reasonable to assume that some large percentage of the innovation for which economic upside on application-layer development is provided for (say, 75%? more? quantifying this is not really the point) is specific to application-layer innovation, and does not have to do in any –indirect, of course– way with the core/base development that we are trying to incentivize. All in all, we would really like the protocol’s participants, the application-layer sponsors, and other involved actors to carefully deliberate the related points further, since it is of significance to the long-term success of this greatly beneficial for the community initiative. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None"
                    ],
                    "Sentiment": 5.485825262308314
                },
                {
                    "author_link": "https://gov.uniswap.org/u/trent",
                    "index": "21",
                    "likes": "1",
                    "time": "15/06/2022-22:24:34",
                    "content": "    blockchaincolumbia:  In this regard, and particularly due to the apparent reduction of the upside intertwined with the decreasing block reward   Small clarification, there has never been a block reward that funds core protocol development. The Ethereum Foundation was funded through a premine of Ether as part of the genesis block.  Secondly, with a diversified pool providing upside to “a lot of” application-level assets, it may be the case that the provided upside is too much of a financial incentive in the long run  This is certainly something to keep track of over the long term, but we do not think it will become a significant concern in the immediate future. Thanks for the additional feedback! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.188311688311689
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Hacker24CCU",
                    "index": "22",
                    "likes": "1",
                    "time": "26/06/2022-22:59:39",
                    "content": "I am generally in favor of the proposal but suggest that there are specific outcomes from the infusion of UNI tokens. While this is the initial announcement, further discussion around details of PG product road map are necessary to work out the granular details of development. Overall, excited about the project and see merit in what they are working to accomplish. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.303571428571429
                },
                {
                    "author_link": "https://gov.uniswap.org/u/trent",
                    "index": "23",
                    "likes": "1",
                    "time": "15/12/2022-16:38:44",
                    "content": "Hey Uniswap community! Stopping by to provide a quick update on the Protocol Guild, a new public goods funding mechanism that was launched with your backing, as we’re currently 6 months into our 1-year pilot. In case you need a reminder, the Protocol Guild aims to enable a decentralized and sustainable funding mechanism for Ethereum’s core protocol development. It creates an easy and effective way for anyone to donate funds to a single address, which gets vested over time to active core protocol contributors. Over the long term we hope to see Ethereum’s ecosystem and community band together to normalize donating a portion of treasuries / revenues to this mechanism, to secure the future of Ethereum’s core development work. Uniswap was a trailblazer in this regard, generously donating 500k UNI tokens, worth $2.7m a the time, back in July. Thank you again for your support! Here’s where we’re at since launching:  $10 million raised to date from 3.8k donations (185 unique donors) $5m has been distributed to 128 members (up from 90 to start), on average $39k per member Work is currently underway for the Guild to adopt Moloch v3 tooling and allow consolidation of L2 donations Our next fundraising push will target raising $100m over four years, from the end of the pilot (May ‘23)  I’ve shared a few links below if you’d like to read more about this, and of course happy to also field any questions here - wishing everyone a happy holidays  Mid-pilot update Mid-pilot update Tweet thread  Tim’s recap see section “Protocol Guild Update” Member list Documentation  ",
                    "links": [
                        "https://protocol-guild.readthedocs.io/en/latest/5-initial-pilot.html#mid-pilot-update-dec-7-2022",
                        "https://twitter.com/ProtocolGuild/status/1600912258694930432",
                        "https://tim.mirror.xyz/zLdl8bEiDmobHZ5RlvG2LrlZLWV9c2XvkuKQ-vpljSU",
                        "https://protocol-guild.readthedocs.io/en/latest/9-membership.html",
                        "https://protocol-guild.readthedocs.io/en/latest/index.html",
                        "https://gov.uniswap.org/t/governance-weekly-recap/17803/18"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.969825809111523
                }
            ]
        }
    ],
    "group_index": "188"
}