{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/proposal-for-all-crypto-projects-listed-on-uniswap-to-have-a-category/1649",
            "title": "Proposal for all crypto projects listed on Uniswap to have a category ",
            "index": 1649,
            "category": [
                "Proposal Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/onlinedollars",
                    "index": "1",
                    "likes": "1",
                    "time": "17/09/2020-20:22:29",
                    "content": "The growing number of tokens listed in Uniswap has made it important that a category is created for each of the tokens listed in the exchange to have a group in here where new users can easily read up reviews about them. This would also give the liquidity providers in the projects the ability to discuss on how to join the team to move the project forward since Uniswap has been a major supplier of quick liquidity for new projects in the Ethereum blockchain. Scam projects can also be known by reports from the investors to save newer users from been victim. With this, Uniswap will contribute it’s quota in promoting a clean crypto world. ",
                    "links": [],
                    "GPT-summary": "The author proposes that a category be created for each token listed on Uniswap to allow for easy access to reviews and discussions about the projects. The proposal aims to promote a clean crypto world by allowing investors to report scam projects and for liquidity providers to discuss how to move the project forward.",
                    "GPT-proposal-categories": [
                        "Community and engagement",
                        "Privacy, Security and risk management",
                        "Token economics",
                        "Law and regulations",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal",
                        "None"
                    ],
                    "Sentiment": 6.120975378787879
                },
                {
                    "author_link": "https://gov.uniswap.org/u/monet-supply",
                    "index": "2",
                    "likes": "4",
                    "time": "17/09/2020-20:46:51",
                    "content": "Strongly disagree. Uniswap does not endorse or govern which tokens are listed (this is permissionless). Token issuers/communities should create their own discourse forum, and use this forum to discuss matters concerning Uniswap only. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.722222222222221
                },
                {
                    "author_link": "https://gov.uniswap.org/u/onlinedollars",
                    "index": "3",
                    "likes": "0",
                    "time": "18/09/2020-07:24:32",
                    "content": "This has nothing to do with what the project does in their groups since a member that tries to expose users to their activities that are wrong could easily be banned. We understand that both Coingecko and Uniswap warns any user before any trade, however, this could serve as a review point for projects that are traded mostly in Uniswap when compared to the ratio of trades in other exchanges they were listed. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.208333333333334
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Silent",
                    "index": "4",
                    "likes": "1",
                    "time": "18/09/2020-08:00:59",
                    "content": "I agree with onlinedollars that we should at least try to limit the times that scams succeed since warning the trader may not be enough all the time. I like the idea of using the badges from Trustswap as an example to verify certain projects/coins as legit. We still allow any project to come onto the platform however, we should do something at least with the uniswap List and perhaps show a way how to get verified Uni badges and other badges to elevate trust. Of course, they can verify all they want and we can supply some tools to help. We have the power lets do something about it and try to show everyone the first step, instead of just reacting. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.782738095238096
                },
                {
                    "author_link": "https://gov.uniswap.org/u/monet-supply",
                    "index": "5",
                    "likes": "0",
                    "time": "18/09/2020-18:40:13",
                    "content": "Information about Token Lists can be found here. Most of these are maintained by other projects or communities independent of Uniswap. Uniswap does have 1 token list that it controls itself (tokens.uniswap.eth), so perhaps there could be a section of the forum specifically for people to propose additions and removals from this list. We should try to avoid a situation where a bunch of people post on the Uniswap forum to shill their project tokens - this would be a huge distraction and waste of energy, and would likely increase rather than reduce scam attempts. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.479166666666667
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Silent",
                    "index": "6",
                    "likes": "0",
                    "time": "19/09/2020-05:35:42",
                    "content": "I agree that the Uniswap forum is not to be used to shill other project tokens. It should be taken off or closed immediately in my opinion. But yes we should perhaps try something with the list that we do control. I don’t want to be gatekeepers but instead just provide a bit more information about what the community has found to be trusted and what has not without impeding anyone to list onto uniswap. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.458333333333334
                },
                {
                    "author_link": "https://gov.uniswap.org/u/onlinedollars",
                    "index": "7",
                    "likes": "0",
                    "time": "19/09/2020-11:10:54",
                    "content": "Irrespective of the number of forums that are created by the token issuer. The higher the number of review places, the stronger an investor is in making a decision. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Noah",
                    "index": "8",
                    "likes": "0",
                    "time": "26/09/2020-22:00:13",
                    "content": "This topic was automatically closed after 3 days. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.09090909090909
                }
            ]
        }
    ],
    "group_index": "179"
}