{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/change-the-ipfs-resolution-of-uniswap-eth-from-app-uniswap-org-to-uniswap-uncensored-eth/13586",
            "title": "Change the IPFS resolution of uniswap.eth from app.uniswap.org to uniswap-uncensored.eth ",
            "index": 13586,
            "category": [
                "Temperature Check"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/Jorropo",
                    "index": "1",
                    "likes": "7",
                    "time": "24/07/2021-18:47:36",
                    "content": " TL;DR We have people creating uncensored builds of the UI which are just following Uniswap Labs ones but without the block list. Let’s use this for uniswap.eth instead of app.uniswap.org. To do so create a multisig validating uncensored builds of uniswap made by peoples like @Micah and point uniswap.eth to an ENS that this multisig control. Then when a new version is made, someone publish it, the multisig review it, and it if it’s fine then the multisig approve the change updating uniswap.eth.  Details Recently uniswap labs updated the UI to stop supporting lots of tokens, some obviously makes sense like Tether Gold which is bugged and lock liquidity forever. But most tokens are just what the US regulator would likely classify as securities such as :  mAssets (mTSLA, mGOOGL, … thoses are synthetixs of shares) Synths.  There for me multiple issues with this:  This applies to everyone, even outside of the US juridiction. (there might be some legal ground about that, maybe since Uniswap Labs is in the US they must apply thoses regulations even to non US “customers”) The message is a missleading “unsupported token” instead of “This is not supported on this gateway, pls use an other gateway”.  So ok the uniswap labs team doesn’t want or can’t deal with the legal implications of this. Then let just find someone else who does.    GitHub    Release Release v4.11.1-uncensored · MicahZoltu/uniswap-frontend IPFS hash of the deployment:  CIDv0: QmRoaxLP3DZv2srDQXLXxsGQzfgkFpnFwyrN9Z6PEACJSD CIDv1: bafybeibtpf7upsc66ojaaem657k67qzp6fwhqg3zfnhia5sjn5nwrqk5qi  https://uniswap-uncensored.eth.link/ You can ...      Well @Micah is willing to do it. This is just a fork of the Uniswap Lab’s UI but with the list removed. Technically, we just update the IPFS field of uniswap.eth to ipns://uniswap-UI-multisig.eth, instead of ipns://app.uniswap.org. That would change the resolution of:   uniswap.eth (for thoses who use IPFS) uniswap.eth.link  We would also need to have a multisig checking releases, because for example if we just point it to ipns://uniswap-uncensored.eth well that would work, but @Micah would have full control over the code that is distributed, which isn’t very decentralised. Sadly app.uniswap.org wouldn’t get updated as it’s uniswap.eth redirecting to app.uniswap.org not the reverse. That pretty much it. As is this wouldn’t have much impact, because very few people uses uniswap.eth, but it would be simple to advertise https://uniswap.eth.link instead, it’s from the governance and should be as safe. ",
                    "links": [
                        "https://github.com/MicahZoltu/uniswap-frontend/releases/tag/v4.11.1-uncensored",
                        "https://uniswap.eth.link",
                        "https://uniswap.eth.link"
                    ],
                    "GPT-summary": "The author proposes changing the IPFS resolution of uniswap.eth from app.uniswap.org to uniswap-uncensored.eth. The proposal suggests creating a multisig validating uncensored builds of Uniswap made by people like @Micah and pointing uniswap.eth to an ENS that this multisig controls. The proposal also highlights issues with Uniswap Labs' updated UI and suggests finding someone else who can deal with the legal implications of the updated UI. The author also suggests advertising https://uniswap.eth.link instead of uniswap.eth.",
                    "GPT-proposal-categories": [
                        "Interoperability and Scalability",
                        "Privacy, Security and Risk Management",
                        "Token Economics",
                        "Community and Engagement",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.628467365967365
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Naught",
                    "index": "2",
                    "likes": "1",
                    "time": "25/07/2021-02:57:10",
                    "content": "Having a multi-sig of names sounds a little risky for those individuals, if this is for a non-regulatory compliant version of a UI. I think there could be an interesting application built that would create a unique fork for every user who is looking to use Uniswap protocol. i.e. everyone can launch their own IPFS attestation of uniswap UI (user A pushes button that launches a IPFS of latest UI that can be used and reused; bonus if the user can also customize the UI background logo etc to their own personalization). Just an idea. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.989583333333334
                },
                {
                    "author_link": "https://gov.uniswap.org/u/ChrisSiegenthaler",
                    "index": "3",
                    "likes": "3",
                    "time": "26/07/2021-11:13:04",
                    "content": "I like the idea. Even if it’s mostly symbolic I also welcome an official IPFS build with the country and token blocklists disabled. I host a frontend mirror on uniswap.ch (which I’ll need to update, last update from 13 days ago) where I remove the blocklists but as already written by @Jorropo , having a multisig “verified” build on IPFS would be a lot more decentralized then having a single user host the build. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.273809523809524
                }
            ]
        }
    ],
    "group_index": "114"
}