{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/to-go-to-the-moon-weve-got-to-build-a-spaceship/6964",
            "title": "To go to the moon we've got to build a spaceship ",
            "index": 6964,
            "category": [
                "Proposal Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/Dmills",
                    "index": "1",
                    "likes": "1",
                    "time": "10/10/2020-05:55:33",
                    "content": "Hi everyone. I been on here quit a bit in the last 2 weeks. I wasn’t airdropped uni instead bought and just holding them. Kind of conservative. Never the less I wanted to write something and maybe this could spark something for someone that knows more about computers and liquidy pools and so on so forth than I do. I think first of all, reading through everyone’s writing can be kind of confusing, people are just commenting back n fourth. I’ve seen some decent proposals but I think some of are kind of missing the point. Uniswap being a governance token it is our job to write valid proposals to be voted in on, all of which will build uniswap, make uniswap more attractive for everyone if we can, profit from uniswap, and basically try to build something that eventually could be stable in price. At the moment with the big dump our token took, and now barley being able to climp out of the hole we sunk to, is very un appeasing to a new investor, creating not so good talk amoung the rest of the crypto community and more or less they think this will fail and or be shut down?? Not all but I’m reading that, it’s around.  That’s sad, I literally have a little over 1,000 uni, bought alittle here and there at different prices, been holding since the night binance listed it. I didn’t plan on selling short term, I’m not a sell out, but also was hoping that others would also do the same, and there for spreading crazy news for all to hear how we just came out, it’s up 200% no one’s selling what the hay. Yeah, that’s because we believe in our token. I propose for the real uni holders to try and hold for a month solid, hold longer, maybe we can implement this, you have to hold the token for certain amount of time before you are first rewarded something, say 50 extra uni, then we turn the switch on, uni token holders now earn .005? Of all transaction fees in all pools, and transaction fees in the token it self. That’s right your gonna want to hold. Every token you own will earn this percentage. But just because we are fair and don’t really like whales, we can negotiate a cap on how many uni can collect fees. I haven’t don’t any numbers I just know I have maybe $5,000 in uni, or around 1,000 uni it’s selves, it’s definitely the largest of my investments, a whale could probably have say well over 100,000 uni tokens. I don’t think 100,000 uni tokens should be allowed to collect that reward, maybe let’s say 10,000 could collect, and that might be too high not sure. But the point is to set a number of tokens each holder could earn on after they have held on to their uni for a certain amount of time, this number would be the same across the board. 10,000 uni, then all 1,000 of my uni would earn, and I could buy more up to 10,000 and earn on them. If I had 10,001 then someone would be alone. This would be an incentive to hold, you also earn, and we can all buy up the uni token we love so much. This would also be appealing to others to buy the token, new ideas and a better price. As far as the pools go, we really need to come up with a solid reach for the stars idea of what to do with uniswap. I think that the best best would be to slowly but surely add more.and more pools, I don’t do this nor understand completely but see that people like this. The liquidity providers can make .25 or whatever, thats pretty decent money, or uniswap can add other tokens pools as well? Not sure someone posted that I thought it would be kind of neat. basically uniswap be the front door to defi and we pretty much have any slide you want to ride. lets just make it the one stop shop, you can basically buy any token, mint any token burn any token from any token. The other platforms are going to try and take our dominance from us, uniswap could be very intimadating, if we let it. Make it appealing to almost everyone. Maybe add something about not being able to sell off all your uni on one transaction, be as it is nice of it hit 100 bucks, to sell all you have, everyone else would as well and we would be were we are today. If you couldn’t sell but a percentage of what you hold everyday. That would help a rug pull/the price from having is ass fall out of it. Sorry this was so long hopefully you read and let’s all be nice and get to work!!! ",
                    "links": [],
                    "GPT-summary": "The author proposes a plan to incentivize holding UNI tokens by rewarding holders with a percentage of transaction fees in all pools and transaction fees in the token itself. The author also suggests adding more pools and making Uniswap the one-stop-shop for buying, minting, and burning any token. The post includes constructive criticism and questions from third parties, and the author invites collaboration to improve the proposal.",
                    "GPT-proposal-categories": [
                        "Token economics",
                        "Community and engagement",
                        "Privacy, Security and risk management",
                        "Smart contract updates",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.986930495430496
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Dmills",
                    "index": "2",
                    "likes": "1",
                    "time": "10/10/2020-06:04:16",
                    "content": "Kinda also thinking that you should have to hold a certain amount of uni to even be in governance because I can definitely see some people having 2 uni tokens and only saying they need more uni, add more fees. It could knock down alot of un needed comments or proposals, and if you want to be in here so bad, then it’s going to cost you a little bit. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.10701884920635
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Naught",
                    "index": "3",
                    "likes": "1",
                    "time": "10/10/2020-12:10:54",
                    "content": "Having a Uni limit to receive the fee is an interesting idea as it distributes wealth to the bottom, then back up. A bypass though is large wallets can split funds into many different accounts. Identity would become important for this model…or see how many accounts split into different accounts if, lets say a 1k uni cap to receive the .05% fee, then a whale with 1 million tokens may not bother with the logistics of splitting into so many accounts. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.4523809523809526
                },
                {
                    "author_link": "https://gov.uniswap.org/u/kolten",
                    "index": "4",
                    "likes": "0",
                    "time": "10/10/2020-14:39:36",
                    "content": "@Dmills This forum is for making proposals with a clear purpose and outline for achieving said purpose. Unfortunately it’s hard to come to any conclusions or definitive action based on the content of this post — so I have to close it. Please refer to the rules in the future: Uniswap Governance Forum Rules ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.408333333333333
                },
                {
                    "author_link": "https://gov.uniswap.org/u/kolten",
                    "index": "5",
                    "likes": "0",
                    "time": "10/10/2020-14:39:39",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "417"
}