{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/add-a-agree-and-d-disagree-button-on-all-proposals-and-comments/5237",
            "title": "Add \"A/ agree\" and \"D/ disagree\" button on all proposals and comments ",
            "index": 5237,
            "category": [
                "Site Feedback"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/TaAs",
                    "index": "1",
                    "likes": "22",
                    "time": "22/09/2020-00:43:27",
                    "content": "It should function as an inside community poll before any proposals comes out to public. Also, it helps for some members to express their thoughts without leaving any comment. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Cryptoseaman",
                    "index": "2",
                    "likes": "5",
                    "time": "22/09/2020-00:49:13",
                    "content": "I think this is superfluous! But it would not be bad to make Ranks on the forum ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 1.5000000000000009
                },
                {
                    "author_link": "https://gov.uniswap.org/u/jaytee213",
                    "index": "3",
                    "likes": "3",
                    "time": "22/09/2020-00:52:10",
                    "content": "I guess your right but im here for the long run? The future? I dis agree the public should see every comment or proposal! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.294642857142858
                },
                {
                    "author_link": "https://gov.uniswap.org/u/kolten",
                    "index": "4",
                    "likes": "5",
                    "time": "22/09/2020-00:52:34",
                    "content": "Good practice is to add a poll to your proposal. Perhaps we can start encouraging this going forward to make it easier to gauge interest. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Cryptoseaman",
                    "index": "5",
                    "likes": "2",
                    "time": "22/09/2020-01:01:44",
                    "content": "I think it’s also worth limiting the number of messages per person per day for a while! Then it will be easier for you! And the community will write more meaningful and informative posts. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.447916666666666
                },
                {
                    "author_link": "https://gov.uniswap.org/u/TaAs",
                    "index": "6",
                    "likes": "2",
                    "time": "22/09/2020-02:06:21",
                    "content": "The word “dislike” may be too negative. Changing it to “agree” and “oppose” would be clean. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.166666666666667
                },
                {
                    "author_link": "https://gov.uniswap.org/u/huntercoin",
                    "index": "7",
                    "likes": "2",
                    "time": "22/09/2020-03:16:36",
                    "content": "Yes, you are right mate  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.428571428571428
                },
                {
                    "author_link": "https://gov.uniswap.org/u/heyJonBray",
                    "index": "8",
                    "likes": "6",
                    "time": "22/09/2020-04:15:21",
                    "content": "Absolutely there should be a dislike button on everything. For those of you who are new to communities, or even if you’ve been part of communities before, here is a great article about the benefit of the “dislike” button and why remaining passive in a growing community is ultimately bad for the community’s health. I was looking for a good place to share this, and this article seemed like a good opportunity. Highly recommend giving it a read, particularly for those who plan on sticking around for a while and/or are seeking moderation roles.    lesswrong.com    Well-Kept Gardens Die By Pacifism - LessWrong Previously in series: My Way Followup to: The Sin of Underconfidence  Good online communities die primarily by refusing to defend themselves.  Somewhere in the vastness of the Internet, it is happening even now. It was once a well-kept garden of...      ",
                    "links": [
                        "https://www.lesswrong.com/posts/tscc3e5eujrsEeFN4/well-kept-gardens-die-by-pacifism"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.407438016528926
                },
                {
                    "author_link": "https://gov.uniswap.org/u/zhenegr",
                    "index": "9",
                    "likes": "2",
                    "time": "22/09/2020-10:40:24",
                    "content": "I completely agree with you!!  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.78125
                },
                {
                    "author_link": "https://gov.uniswap.org/u/heyJonBray",
                    "index": "10",
                    "likes": "3",
                    "time": "22/09/2020-10:47:29",
                    "content": "I really don’t think as adults the verbiage of the button should be an issue… “dislike” is concise and gets the point across. “I dislike this” is the opposite of the current upvote: “I like this”. Actually, it’s a heart, saying “I love this”, so if we’re going to go that extreme in one direction, the opposite it should be the “hate” button. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.930555555555555
                },
                {
                    "author_link": "https://gov.uniswap.org/u/N1hal",
                    "index": "11",
                    "likes": "3",
                    "time": "22/09/2020-13:29:42",
                    "content": "Ya this is a good one and can help in decluttering long threads but I fear the silence. People may not prefer to comment on anything at all and the community might become passive with just yes and nos. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.625
                },
                {
                    "author_link": "https://gov.uniswap.org/u/rezwile",
                    "index": "12",
                    "likes": "3",
                    "time": "22/09/2020-15:11:54",
                    "content": "To form a welcoming community, it might be better to have only the like/heart button. Disliked proposals should not be “down” voted. If moderators eliminate double posts/trash posts it should be fine. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.467592592592593
                },
                {
                    "author_link": "https://gov.uniswap.org/u/moody",
                    "index": "13",
                    "likes": "2",
                    "time": "22/09/2020-17:02:42",
                    "content": "Feel free to use https://snapshot.page/#/uniswap to understand community support for your proposal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Json101",
                    "index": "14",
                    "likes": "2",
                    "time": "23/09/2020-20:19:16",
                    "content": "Yeah, if the forum to to develop governance it needs a means of aggregating opinion. Moreover, a generative procedure to develop a proposal by integrating the most popular comments and suggestions into a formal proposal for voting into practise would be desireable. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.75
                },
                {
                    "author_link": "https://gov.uniswap.org/u/TMod_Marco",
                    "index": "15",
                    "likes": "2",
                    "time": "23/09/2020-20:54:58",
                    "content": "Isn’t this exactly what a poll within a topic can be used for?  Simply put a poll in the initial post and have people vote on it (Agree / Disagree). And preferably, have them elaborate on their choices in the comments. As @kolten also mentioned. @moody also offered an amazing link right there. That being said, personally I think we could lock this thread. However, I’ll leave that up to one of the other moderators and let the discussion continue for now  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.944196428571429
                },
                {
                    "author_link": "https://gov.uniswap.org/u/heyJonBray",
                    "index": "17",
                    "likes": "1",
                    "time": "16/10/2020-13:51:07",
                    "content": "While you might think that is the best way to have an inclusive, welcoming community, a dislike button or way to quickly show that someone disagrees is integral. I posted an article about it that has been proven time and time again since early usenet days, I thought in this forum but cannot find it. Will repost if I can’t find. We’re tasked with governing a DeFi system with billions of dollars of assets locked in it… There is no room to be coy or cater to anyone’s capacity for offense. That doesn’t mean be rude, but it can’t be all hearts and hugs. If someone chooses to take disagreement or a dislike personally they are hindering growth, and their reaction is on them. I am 100% in favor of a dislike button and think it should show who disliked (and liked) each post. This will allow moderators to filter out people spamming or abusing the dislike button. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.763020833333333
                },
                {
                    "author_link": "https://gov.uniswap.org/u/nsinalis11",
                    "index": "18",
                    "likes": "2",
                    "time": "22/10/2020-06:20:44",
                    "content": "i think yes must ad those buttons so it easy to react on them ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.166666666666667
                },
                {
                    "author_link": "https://gov.uniswap.org/u/sezay16",
                    "index": "19",
                    "likes": "1",
                    "time": "22/10/2020-14:17:11",
                    "content": "A   katılıyorum ben de ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/MarkOSullivan94",
                    "index": "20",
                    "likes": "1",
                    "time": "22/10/2020-15:57:11",
                    "content": "I agree with this suggestion! Although should people who disagree not be forced to explain why? Otherwise you could see a proposal received an overwhelming amount of disagrees and zero explanation ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/nsinalis11",
                    "index": "21",
                    "likes": "0",
                    "time": "29/10/2020-15:21:32",
                    "content": "i total agree , donate here  0xbb76539b3a02F51170BF4b8bc251F153098cEB4E ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/heyJonBray",
                    "index": "22",
                    "likes": "2",
                    "time": "31/10/2020-06:21:01",
                    "content": "    N1hal:  Ya this is a good one and can help in decluttering long threads but I fear the silence. People may not prefer to comment on anything at all and the community might become passive with just yes and nos.   I really don’t see this playing out like this for a few reasons. First off, there is a huge amount of grey area between adding a DISLIKE button and ceasing commenting.  People generally like to voice their opinions. Topics here are nuanced, and will always require discourse. The presence of a LIKE button We are a community tasked with billions of dollars worth of assets, enough people grasp this and understand that discourse is still necessary. In the event someone does not grasp the gravity of our responsibility, I would prefer a dislike to a comment.  There are some specific reasons why I believe a DISLIKE button is necessary on the Uni GOV forum:  It would provide a quick and concise visual of the LIKE:DISLIKE ratio of any particular post. We are a collective governance mechanism that has the potential to set a standard for decentralized forms of government. If we do this right, we have a use-case that challenges the integrity of every form of democracy up until this point. We don’t want to make this community like the systems we are trying to replace. For this reason, I think the UI should reflect democratic consensus and user choice from the highest level to the smallest in every way possible. A DISLIKE button would help filter out low quality posts that may otherwise devolve into arguments or become generally negative. If someone doesn’t have a well thought out solution to something they disagree with, or someone has already said it better, they can still express their opinion without repeating existing content. Preventing clutter in “hot-button” topics. As you can see from this forum and others, an issue people are divided on can quickly result in a thread that is a near infinite repeat of the same complaints. A DISLIKE button also allows for responses that are removed to be converted into a dislike instead. Negative content is removed, but is still able to reflect the community’s feelings on an issue.      MarkOSullivan94:  Otherwise you could see a proposal received an overwhelming amount of disagrees and zero explanation   People already write posts to express dislike without expanding on the idea at all, maybe having a dislike button can fulfill that need to state your opinion and keep things more civil at the same time. In the unlikely chance a thread turns into only likes and dislikes, it is up to the community to rally and get dissenting ideas and productive solutions into a thread. The same way we need to do if a topic turns into a garbage pile due to low quality posts. Let’s take a look at how the like button is used. What generally happens on a post when someone is really in support of it? Two things (in either order):  User likes a post they agree with. Same user (might) posts an affirmative reply.  But we do not worry that the LIKE button will cause a thread to turn into everyone just agreeing and not talking, I haven’t seen that concern brought up once, yet it is exactly what we are talking about here. I want to wrap up by stressing the gravity of what we have all been handed. To those arguing against the DISLIKE because it is “rude”, “hurts feelings”, or similar. When we come in here, we need to check not only our offense, but also our capacity for offense, at the door. What we’re doing is bigger than just us. We must be as respectful of others as possible—we are all in this together—and I think knee-jerk reactions to something perceived as negative is not helpful either. Together we will be voting on decisions that will impact the financial security and prosperity of many, many people. At a certain point, things need to be put concisely and bluntly, offended parties need to be the bigger person, and we need to have a common understanding that regardless of opinion we all want Uniswap to prosper. The most highly engaged forums have the ability to dislike a post, because it simply makes sense to have. Sometimes the press of a button really is all there is to say. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.556638418079096
                },
                {
                    "author_link": "https://gov.uniswap.org/u/heyJonBray",
                    "index": "23",
                    "likes": "2",
                    "time": "31/10/2020-06:41:25",
                    "content": "    MarkOSullivan94:  Otherwise you could see a proposal received an overwhelming amount of disagrees and zero explanation   I just don’t see this happening. If someone disagrees with a proposal, an idea, a post, or a topic and they don’t have something of substance to contribute, a dislike is a preferred way to gauge sentiment. People already write posts to express dislike without expanding on the idea at all, maybe having a dislike button can fulfill that need to state your opinion and keep things more civil at the same time. It is also a great, quick visual cue showing how the community feels about something. If there’s a discussion and it turns into only likes and dislikes (which again, will not happen, spend 20 minutes looking through random forums on the internet with this system and you’ll see that’s not the case), it is up to the community to rally and get dissenting ideas and productive solutions into a thread. The same way we do if a topic turns into a garbage pile due to low quality posts. Take a look at how the like button is used. What generally happens on a post when someone is really in support of it? Two things (in either order):  User likes a post they agree with. Same user (might) posts an affirmative reply.  But we do not worry that the LIKE button will cause a thread to turn into everyone just agreeing and not talking, I haven’t seen that concern brought up once, yet it is exactly what we are talking about here. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.815104166666667
                },
                {
                    "author_link": "https://gov.uniswap.org/u/MarkOSullivan94",
                    "index": "24",
                    "likes": "1",
                    "time": "31/10/2020-12:17:26",
                    "content": "    heyJonBray:  If someone disagrees with a proposal, an idea, a post, or a topic and they don’t have something of substance to contribute, a dislike is a preferred way to gauge sentiment. People already write posts to express dislike without expanding on the idea at all, maybe having a dislike button can fulfill that need to state your opinion and keep things more civil at the same time.   True a dislike button would be a quick way to show you disagree BUT the reason why 3 individuals disliked a proposal might be completely unique. If they provide a reason then it makes it a lot easier to see who agrees with the point they have raised on why they dislike the proposal (higher amount of likes on the reply). Arguably the best thing about requiring a reason for the dislike is that it gives OP the chance to take address the dislike and reiterate / improve the original proposal. Having constructive criticism on proposals is invaluable and my fear is a dislike button without reasoning would lead to proposal creators becoming frustrated at receiving dislikes but unable to gain an understand as to why they had been disliked.     heyJonBray:  Take a look at how the like button is used. What generally happens on a post when someone is really in support of it? Two things (in either order):  User likes a post they agree with. Same user (might) posts an affirmative reply.  But we do not worry that the LIKE button will cause a thread to turn into everyone just agreeing and not talking, I haven’t seen that concern brought up once, yet it is exactly what we are talking about here.   I don’t think it’s as necessary for a like button, when you like the proposal you are showing your support for it and want it implemented ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.824561403508772
                },
                {
                    "author_link": "https://gov.uniswap.org/u/heyJonBray",
                    "index": "25",
                    "likes": "1",
                    "time": "31/10/2020-22:10:34",
                    "content": "    MarkOSullivan94:  I don’t think it’s as necessary for a like button, when you like the proposal you are showing your support for it and want it implemented   But the principle is exactly the same, why would you not have a dislike button? Both buttons have an equal impact on the quality of feedback that gets left on a post: nothing.     MarkOSullivan94:  Having constructive criticism on proposals is invaluable and my fear is a dislike button without reasoning would lead to proposal creators becoming frustrated at receiving dislikes but unable to gain an understand as to why they had been disliked.   You’re making a broad assumption that a button to show general acceptance or disapproval of an idea is impactful on community growth and development, this is a false premise. This is the same reason the verbiage doesn’t matter either. You could call one the FOO button and the other BAR and it’s not going to have the least bit of impact on the quality of content. I posted an idea recently regarding a system for standardizing the process of evolving ideas into proposals. In it I asked that people provide feedback so that I could better develop and form this idea. So far I have one reply, but a lot more likes. What do those “likes” tell me about why my idea is liked? That’s a little frustrating, having a bunch of people agree with you but not knowing why. What do they tell me about parts of my idea that might not be so good? Absolutely nothing, they provide me no actionable feedback on my idea; and that’s fine, that is what the like button is for. It’s for people to quickly show a general sense of agreement, it’s for people with nothing to add. People with something to add to the conversation, positive or negative, will add to the conversation. A LIKE is nothing more than passive observation, and no more effective at evolving ideas or providing constructive criticism than if the user liking the post made no interaction at all. Should we remove the LIKE button because it leads to proposal creators having a good idea but be frustrated at never being able to improve on it through community feedback? If anything, not having a dislike button is doing the community the disservice skewing, unalterably and from inception, every idea that gets posted towards the affirmative or the positive regardless of the quality of content. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.473587223587224
                },
                {
                    "author_link": "https://gov.uniswap.org/u/green",
                    "index": "26",
                    "likes": "3",
                    "time": "01/11/2020-18:31:37",
                    "content": "I want to see this, but I want to see the amount of hearts and dislikes, not the resultant balance. That way we can see at a first glance what posts get more reactions than others. Dislike button is necessary because half the discussions are crumbling into “disagree reply” with sophism, rethoric and low discussion content. That way no one feels like they have to show everyone else how much disagreement they have via text. Not that that is going to be able to cut bland reactions out of discussions, but it should help. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.697916666666667
                },
                {
                    "author_link": "https://gov.uniswap.org/u/heyJonBray",
                    "index": "28",
                    "likes": "2",
                    "time": "02/11/2020-15:43:59",
                    "content": "    green:  Dislike button is necessary because half the discussions are crumbling into “disagree reply” with sophism, rethoric and low discussion content.   This is a concise reason for a dislike button.     green:  I want to see this, but I want to see the amount of hearts and dislikes, not the resultant balance.   Agreed, it should be two separate metrics to identify the weight and number of each. The PostRep = # Likes - # Dislikes model doesn’t provide any good information. For anyone opposed to a DISLIKE button, I encourage you to follow the creed and DYOR. I’ve done mine, I’ve posted an article from a very reputable community builder as well as my own experience. I encourage the side against to find any legitimate references as to why a DISLIKE button is negative for the community. With only fears and worries to back up the side against and no actual evidence, I feel as though we should implement a dislike button in the manner @green described ASAP. If at some point in the future evidence for an actual discussion emerges, discussion about tweaking it should only take place at that point. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.28921568627451
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Ebubekirsan",
                    "index": "29",
                    "likes": "0",
                    "time": "02/02/2021-06:31:47",
                    "content": "AA/Katılmıyorummkiki ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/leanykol1987",
                    "index": "30",
                    "likes": "0",
                    "time": "22/03/2021-03:18:47",
                    "content": "Agreed. Great project ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/IonYopYop",
                    "index": "31",
                    "likes": "1",
                    "time": "22/03/2021-12:11:16",
                    "content": "    jaytee213:  I dis agree the public should see every comment or proposal!   The public should see every comment or proposal because this is the differences between what blockchain do and the real life goverment do. When it goes private then what is the differences? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Crypto_Cap",
                    "index": "32",
                    "likes": "0",
                    "time": "21/05/2021-06:00:48",
                    "content": "I agree with having the buttons but disagree with them serving as a stop before proposals reach the public. The issue is that alot of the UNISWAP community don’t use the governance forum yet so stopping it before it reaches the public may not be an accurate reflection of community thought. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.666666666666666
                }
            ]
        }
    ],
    "group_index": "364"
}