{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/can-the-uni-airdrop-mistakes-continue-to-be-made/8263",
            "title": "Can the UNI airdrop mistakes continue to be made? ",
            "index": 8263,
            "category": [
                "Governance-Meta"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/taolu1973",
                    "index": "1",
                    "likes": "8",
                    "time": "06/11/2020-04:03:27",
                    "content": "In order to get back Uniswap’s original liquidity share from Sushi, the UNI token issuance uses a powerful airdrop, which is really helpless. Even so, the first airdrop of UNI tokens has many points worthy of reflection. For example, where did UNI go? Does Uniswap want to vote for users or addresses? An address does not correspond to a person. This is the biggest problem. In other words, many of the UNIs that were airdropped for the first time were cast in vain, which is equivalent to Uniswap taking the initiative to be slapped by users. Now, there are a bunch of applications or projects that want to airdrop UNI; next, what if someone comes up with a “reasonable reason” to airdrop UNI? It sounds like there are good reasons for the projects and applications that you want to airdrop. The questions are: 1. How to verify that each UNI token can be truly voted to the user instead of the address? 2. How to determine valid users? 3. How to prevent cheating? The first airdrop of UNI was a helpless “feat”. If the second, third, or even Nth airdrop occurs, what is UNI? Airdrop is an art, and there are many ways to do it. Uniswap made many very low-level mistakes in its first airdrop, so that some members of the crypto community believed that UNI was just another altcoin or air currency. There is a Chinese proverb, “Eat a ditch, grow a wisdom”, I believe that the Uniswap community colleagues can seriously reflect on the many mistakes of the first airdrop, and they will be more mature in the second airdrop. I am from China, and the English is translated using Google Translator. It is very likely that the words are not expressive or cause unnecessary misunderstandings. But for Uniswap to stop making low-level mistakes, that’s all. What are your thoughts on the UNI airdrop? Please open your heart and speak freely; Tao Lu welcomes rational objections. Thank you for taking the time to read and feedback! ",
                    "links": [],
                    "GPT-summary": "The author of the post discusses the mistakes made during the first airdrop of UNI tokens and raises questions about the validity of future airdrops. The post provides constructive criticism and asks questions about how to verify that each UNI token can be truly voted to the user instead of the address, how to determine valid users, and how to prevent cheating. The author also suggests that Uniswap should reflect on the mistakes made during the first airdrop to avoid making similar mistakes in the future.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.893939393939394
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Ezzy",
                    "index": "2",
                    "likes": "2",
                    "time": "18/11/2020-12:01:09",
                    "content": "It wasn’t a mistake neither does it relegate Uniswap to the background. It’s rational act, a peculiar one at that and will be impactful in the long run. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://gov.uniswap.org/u/refri",
                    "index": "3",
                    "likes": "2",
                    "time": "18/11/2020-17:57:49",
                    "content": "Maybe you are right regarding the problems with the translator, at least, after reading your text  I am not sure what you like to point out. What did you mean by many low-level mistakes? Do you have some examples? Imho the UNI airdrop gaves uniswap a boost in attention which is very good, and many people (like me) using uniswap before feel even more dedicated to it. Regarding the person/address problem: Some might have been lucky by getting UNI on more than one address, regarding the voting power in the long run it doesnt make much difference as long as the voting goes 1vote/1uni. In some instances it might be appropriate to limit the voting power of single voters in the future and a cutoff can be installed like a specified no of max votes per address.  This of course would be open to cheating but it has nothing to do with the airdrop. If you like to omit this you have to implement a kyc policy but even this can be open to bought votes. Although I see your point regarding the votes, I do not understand how it is linked to the airdrop and what do you think was wrong with it. Hope that the translator gives you a correct impression of my thoughts;-) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.736279761904762
                },
                {
                    "author_link": "https://gov.uniswap.org/u/CWhite",
                    "index": "4",
                    "likes": "0",
                    "time": "20/05/2021-02:47:38",
                    "content": "Eat a ditch, grow a wisdom? Please Tell  me  more  of  this  ancient  Chinese  proverb ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                }
            ]
        }
    ],
    "group_index": "466"
}