{
    "poll_list": [
        {
            "id": "Qma8KF8jTV3kwBFdjfwE9jvLpPYVMdY6RVS9pJZ6QGEur6",
            "title": "Retroactive Airdrop For Proxy Contract Users (e.g. 1Inch, Dharma, Matcha, etc.)",
            "discussion": "",
            "body": "Details:\nhttps://gov.uniswap.org/t/retroactive-airdrop-excludes-proxy-contract-users-e-g-dharma-matcha-etc/1222\n\nhttps://gov.uniswap.org/t/application-for-retroactive-proxy-contract-airdrop-for-projects-apps/3221",
            "choices": [
                "Yes",
                "No"
            ],
            "scores": [
                0,
                33977.76998886946
            ],
            "start": 1600678800,
            "end": 1601208000,
            "snapshot": "10911534",
            "state": "closed",
            "author": "0x00000583Cf2C6aA7488471fbe12ac7f0DfeB1cDa",
            "space": {
                "id": "uniswap",
                "name": "Uniswap"
            }
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/retroactive-airdrop-excludes-proxy-contract-users-e-g-dharma-matcha-etc/1222",
            "title": "Retroactive Airdrop Excludes Proxy Contract Users (e.g. Dharma, Matcha, etc.) ",
            "index": 1222,
            "category": [
                "Proposal Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/nadav_dharma",
                    "index": "1",
                    "likes": "157",
                    "time": "17/09/2020-16:06:09",
                    "content": "Hey everybody — this is Nadav from Dharma. Since August, our business has been razor-focused on providing a mainstream-friendly experience for trading in Uniswap. We have successfully onboarded over 2,500 new users onto Uniswap in the span of just a month who otherwise would have likely floundered with the clunkiness of Metamask, gas fees, etc.  This has been really great for our business, and we’re basically doubling down all of our energies on making Uniswap something anyone with a US bank account and zero crypto knowledge can use instantly. Unfortunately, the way the retroactive airdrop was architected seemed to make a slight oversight in the snapshotting process — only addresses which directly called the Uniswap contracts were considered to be users.  Our system (as well as many other more consumer-oriented systems) interact with Uniswap through a proxy contract. As a result, approximately 2,000 users who used Uniswap through Dharma are ineligible to claim UNI rewards. This is not an issue isolated to Dharma due to an esoteric design choice — proxy contracts are very commonly used by interfaces that interact with Uniswap.  Notably, DEX aggregators such as Matcha and Paraswap have confirmed they are also affected, and we believe others are quite likely to be affected as well. From our discussions with the Uniswap team, it seems highly unlikely that the intention of the retroactive airdrop was to exclude users who did not directly call Uniswap.  In all likelihood, this was an innocent oversight. As such, we’re considering submitting a proposal (perhaps the first!) to Uniswap governance to expand the UNI retroactive airdrop to those who used Uniswap through proxy contracts before Sept. 1st.  Our team is very experienced with submitting proposals to the Compound governance module and we feel quite confident we could do this securely and quickly. That being said, we first wanted to gauge interest and reactions from the Uniswap community. I will note to the community that this vote sets a cultural precedent as to how the protocol treats not only its direct users but also developers who take entrepreneurial bets building on Uniswap. The status quo has unfortunately punished our users and eroded our reputation with them — future builders will heed the signal and precedent set by how the Uniswap community addresses this. Interested to hear feedback and thoughts; technical discussion around how best to structure this proposal highly encouraged! Nadav Edit: Really happy to see what appears to be an overwhelmingly positive response to the high-level proposal.  I would like to shift the discussion to more specific, technical matters related to how we can implement this proposal — please skip down to this message to add color to the specifics Edit 2: The latest proposal can be found down here.  We intend to discuss is it for the next 24 hours before proceeding [9/17/20 10:05PM MT] ",
                    "links": [
                        "https://gov.uniswap.org/t/retroactive-airdrop-excludes-proxy-contract-users-e-g-dharma-matcha-etc/1222/121",
                        "https://gov.uniswap.org/t/proposal-excluded-proxy-contract-airdrop-phase-1/5811/224",
                        "https://gov.uniswap.org/t/urgent-discussion-on-current-vote-reduce-uni-governance-proposal-quorum-thresholds/7117/10",
                        "https://gov.uniswap.org/t/proposal-reduce-amount-of-unis-required-to-submit-governance-proposal/3320/66"
                    ],
                    "GPT-summary": "Nadav from Dharma explains that approximately 2,000 users who used Uniswap through Dharma are ineligible to claim UNI rewards due to an oversight in the snapshotting process of the retroactive airdrop. He proposes to submit a proposal to Uniswap governance to expand the UNI retroactive airdrop to those who used Uniswap through proxy contracts before Sept. 1st. He seeks feedback and thoughts from the Uniswap community and encourages technical discussion around how best to structure this proposal.",
                    "GPT-proposal-categories": [
                        "Token economics",
                        "Community and engagement",
                        "Interoperability and Scalability",
                        "Privacy, Security and risk management",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.774597537878787
                },
                {
                    "author_link": "https://gov.uniswap.org/u/sabbir883",
                    "index": "2",
                    "likes": "36",
                    "time": "17/09/2020-16:17:24",
                    "content": "Definitely the Dharma users deserve this. We love uni swap and we love Dharma. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.666666666666666
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Jem457",
                    "index": "3",
                    "likes": "36",
                    "time": "17/09/2020-16:24:12",
                    "content": "As someone who has used Dharma due to its mobile compatibility, I wholeheartedly support this. It would suck to be left out of the airdrop due to mainly using a platform that allows me to browse and swap ERC20 tokens when at work and away from my desktop. Hope for the best Dharma team  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.916666666666667
                },
                {
                    "author_link": "https://gov.uniswap.org/u/t11s",
                    "index": "4",
                    "likes": "28",
                    "time": "17/09/2020-16:24:42",
                    "content": "This seems like a great change. Dharma users and Matcha users still have supported the Uniswap ecosystem, even if they haven’t used the interface directly! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.3125
                },
                {
                    "author_link": "https://gov.uniswap.org/u/rmncryptosaint",
                    "index": "6",
                    "likes": "34",
                    "time": "17/09/2020-16:27:19",
                    "content": "At the outset, huge respect to Uniswap for having showcased a true example of how a Decentralized protocol could work wherein everyone that is part of the ecosystem benefits. Thank you very much. Over the past few months, Dharma has tried to do its best in simplifying the onboarding process for a lot of noobs (like me) by hiding the gas and TX component. They have internally used Uniswap/other exchanges for token swaps and it has definitely helped additional users to jump onboard due to the power of strong design thinking. It will be great if Uniswap could include Dharma users for the $uni airdrops. It will definitely help the community grow in a positive manner. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.113694638694639
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Defi",
                    "index": "7",
                    "likes": "22",
                    "time": "17/09/2020-16:30:30",
                    "content": "I support this 100%. As someone who used dharma mobile app many time and traded on uniswap I think I deserve UNI airdrop not less than all those scammers who were creating numerous fake coin contracts (rugpulls) over and over and now got the airdrop on top. Really excited to see this issue resolve and really hope we get our tokens ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.8273809523809526
                },
                {
                    "author_link": "https://gov.uniswap.org/u/DegenPepe",
                    "index": "8",
                    "likes": "22",
                    "time": "17/09/2020-16:30:56",
                    "content": "I fully support this proposal. I myself have conducted all of my uniswap transactions via Dharma and missed out on the UNI airdrop. I introduced some friends to defi and highly recommended them to use dharma to trade on uniswap and they’re all pretty unhappy about it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.683333333333334
                },
                {
                    "author_link": "https://gov.uniswap.org/u/leo_eth",
                    "index": "9",
                    "likes": "9",
                    "time": "17/09/2020-16:31:41",
                    "content": "Any suggestion from where would come those new coins? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.681818181818182
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Anxiiouz",
                    "index": "11",
                    "likes": "16",
                    "time": "17/09/2020-16:34:19",
                    "content": "As a user of both Uniswap and Dharma, I believe proxy contract users should also be included in the recent airdrop. It was an innocent mistake that may have passed through the Uniswap team and I am sure they appreciate proxy contract users’ addition to the DeFi Uniswap ecosystem. After all, DeFi is about being fair to some degree, isn’t it? Regards.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.125
                },
                {
                    "author_link": "https://gov.uniswap.org/u/MarkOSullivan94",
                    "index": "12",
                    "likes": "20",
                    "time": "17/09/2020-16:35:35",
                    "content": "It would be a shame not to include any wallet which used a proxy contract, such as all the Dharma users, in the Uni airdrop. Really hope those users will eventually be airdropped Uni tokens  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/tgijs",
                    "index": "13",
                    "likes": "23",
                    "time": "17/09/2020-16:39:41",
                    "content": "Very fair proposal. The current airdrop has (inevitably) been hugely profitable for whales, scammers, ripoffs of Uniswap, whereas the defi newbs/ small traders that first used Uniswap via Dharma are now penalised. Also agree with the point that this damages Dharma’s reputation and disincentivizes similar initiatives in the space. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.935714285714285
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Domscrypto",
                    "index": "14",
                    "likes": "17",
                    "time": "17/09/2020-16:50:01",
                    "content": "Love both Uniswap and Dharma! Dharma is the perfect access point to interact with the protocol, wouldn’t change it for anything else. I think we deserve the UNI  thank you team ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 9.0625
                },
                {
                    "author_link": "https://gov.uniswap.org/u/ygclyde",
                    "index": "15",
                    "likes": "18",
                    "time": "17/09/2020-16:51:11",
                    "content": "I started using Uniswap by sending eth to Dharma to buy yam v1 in early August and got rekt lol but that is really the event that got me to be an active user in crypto. Prior to that I was only holding btc in cold storage. Would love to be able to receive retroactive rewards for my Dharma wallet address! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.828703703703704
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Bhogi",
                    "index": "16",
                    "likes": "14",
                    "time": "17/09/2020-17:12:05",
                    "content": "Dharma wallet users should ofcause also recieve the airdrop, Im super surprised and disapointed that they have excluded us. They are basically forcing us to not use these third party services. Which is a shame because that will only stiffle development and collaborations. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.541666666666667
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Lex_deFi",
                    "index": "17",
                    "likes": "15",
                    "time": "17/09/2020-17:12:28",
                    "content": "Agree, we Dharma users deserve to be part of the Uniswap community airdrop just like everyone else. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/drew",
                    "index": "18",
                    "likes": "20",
                    "time": "17/09/2020-17:16:35",
                    "content": "I support this and hope that users of Monolith, an excellent card service which has also on boarded thousands of people into the DeFi space, will also be helped by such a proposal. All swaps in Monolith take place through the paraswap contract, and therefore were not accounted for in the Uni Airdrop (even though Uniswap was used for most of the trades!). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.708333333333332
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Noah",
                    "index": "22",
                    "likes": "47",
                    "time": "17/09/2020-17:28:01",
                    "content": "reminding everyone to please use the  button to indicate support instead of commenting, if you’re not adding anything of substance to the conversation. this helps keep the thread clear and informative  ",
                    "links": [
                        "https://gov.uniswap.org/t/announcing-dharmas-intention-to-propose-the-retroactive-uni-distribution/7450",
                        "https://gov.uniswap.org/t/proposal-excluded-proxy-contract-airdrop-phase-1/5811/49"
                    ],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/tamileth",
                    "index": "24",
                    "likes": "16",
                    "time": "17/09/2020-17:38:27",
                    "content": "Agree, we Dharma users deserve to be part of the Uniswap community airdrop just like everyone else ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/gizmuf",
                    "index": "25",
                    "likes": "19",
                    "time": "17/09/2020-17:40:40",
                    "content": "I love both projects. Lately I opened my macbook and Uniswap to swap some eth for dot, link, Lrc and few others. As I love mobile experience more then laptop (no offence apple!) my friend suggestes I use Dharma for tokens I wanna swap so I did… I wouldn’t like to be “panished” just for using some other UX to do basically the same thing. I believe we all appreciate a lot Uniswap protocol and would be gratefull a lot for appreciating our activity, no matter if it was direct or proxy originated. I kond of understand that first of all Uniswap wanted to appreciate their direct users, as some could not even be aware of uniswap existance, they just new some app which happened to use uniswap in background, so basically those were not uniswap users. I get it. However I think many of us, including myself, just used some app they like conciously knowing that uniswap is behind that. Even more, that was the reason to use that particular app at all. So please appreciate our effort to support DeFi community of any kind as we ALL will benefit from it as the whole market grows with us allowing to earn also to you, uniswap. It is all connected. You know. Best Robert ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.1586921850079746
                },
                {
                    "author_link": "https://gov.uniswap.org/u/gioman",
                    "index": "26",
                    "likes": "10",
                    "time": "17/09/2020-17:45:42",
                    "content": "I think it was an error to exclude those users in the first place. Proxy contract users should be rewarded and doing so will only benefit the whole crypto community ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Yieldcrypto",
                    "index": "27",
                    "likes": "16",
                    "time": "17/09/2020-17:46:25",
                    "content": "I am in support of this proposal. What uni swap did was not in favour of people supporting the newly emerging tech like Dharma. Dharma is building add-on for customer experience for users who can’t use uniswap. I urge uniswap to do the right thing and airdrop the required tokens to proxy contract users. Thanks Uniswap for all that you did. Please support Dharma. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.090097402597403
                },
                {
                    "author_link": "https://gov.uniswap.org/u/aasinghal",
                    "index": "29",
                    "likes": "10",
                    "time": "17/09/2020-18:03:27",
                    "content": "Uniswap has been a great platform. But it’s not possible to be in front of laptop all the time. Dharma has been a great alternative to do trnx on uniswap on the go (on mobile). It would be great if mobile (dharma) users of uniswap are not left out of retrospective rewards. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.4
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Jay-Prime",
                    "index": "30",
                    "likes": "15",
                    "time": "17/09/2020-18:09:57",
                    "content": "Hey all, Nikola from DeFi Saver here. Our users are in a similar boat, though the architecture is a tad more complex (user calls the transaction for actions on their dsproxy (which holds their MakerDAO CDP/Vault, Compound or Aave position etc) and then a UniswapWrapper contract of ours initiates the actual trade further down within the transaction). This is in regards to our Boost, Repay and other transactions that involve swaps which are often handled by Uniswap. If there’s a possibility of these accounts being considered for UNI airdrops, that would be absolutely amazing. We’ll be following this thread and we will gladly provide any more information needed. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.690656565656566
                },
                {
                    "author_link": "https://gov.uniswap.org/u/ValCrytoast",
                    "index": "32",
                    "likes": "7",
                    "time": "17/09/2020-18:26:51",
                    "content": "I support this proposal and I am delighted that it is only an oversight. I hope that it will be rectified as soon as possible by the community. not taking part in the biggest airdrops in history with these UNIs is frustrating. especially as we interact a lot with the protocol. thank you  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.300000000000001
                },
                {
                    "author_link": "https://gov.uniswap.org/u/monet-supply",
                    "index": "33",
                    "likes": "13",
                    "time": "17/09/2020-18:36:35",
                    "content": "I’m generally in favor 100%  . My only concerns: Is there any way that supporting distribution to delegateCall interactions would skew distribution towards whales or bots? Or any other gaming issues to be considered? My general assumption is NO this shouldn’t be a problem if we use the same retrospective snapshot date, but it’s worth considering. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.375
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Direwolf",
                    "index": "34",
                    "likes": "11",
                    "time": "17/09/2020-18:37:38",
                    "content": "Startups like Dharma, offer great opportunities to enter the Dex world on mobile devices.  Such initiatives and the users who support it, deserve to be as cared for as the others. XXX ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/nadav_dharma",
                    "index": "35",
                    "likes": "32",
                    "time": "17/09/2020-18:46:25",
                    "content": "Glad to hear there’s significant interest in this proposal.  Would like to shift the discussion to some of the specifics of how such a system would be implemented. There are two high-level questions that need to be answered before we submit a proposal: #1 — How will we execute the retroactive airdrop for excluded users, if approved? #2 — How will we determine the set of users who have been excluded from the drop? Re: #1 — I feel there is a fairly straightforward proposal here. In approximately 7 hours, vesting of the community treasury UNI allocation will begin, with a 30 day cliff ending on ≈October 17th, 2020.  At that point, 172,000,000 / 12 ≈ 14.3m UNI will become available to the community treasury. Once we’ve aligned the community on a set of excluded users, we deploy a merkle drop contract akin to the one Uniswap used for the initial airdrop that commits too this user set and to the quantity to which they’re entitled. We can then initiate a governance proposal that grants ERC20 transfer approval from the timelock contract (0x1a9C8182C09F50C8318d769245beA52c32BE35BC) to the merkle drop contract in the amount precisely equal to the quantity agreed upon for excluded users.  This means we can vote to “confirm” the distribution to excluded users now, and the distributed UNI will be withdrawable in approximately 30 days — the merkle drop contract will be able to pull the UNI at that time and make the UNI claimable by users. Re: #2 — This is where I suspect the locus of contention will be: how do we determine the excluded user set? I will propose a few approaches for discussion (note that, for all of these approaches, we would de-dupe addresses that are already present in the current UNI distribution):  Compile a list of all addresses (contracts or EOAs) that are in the call-chain of historical calls to Uniswap v1 /  v2 before Sept 1. — i.e. if a Uniswap trade was triggered as EOA -> ContractA -> ContractB -> UniswapV2, all three addresses would be considered to be “users”.  This is likely the most comprehensive, but I fear would be overly liberal in allocating UNI.. A rough analysis of on-chain data is required here. Compile the same list of addresses described in approach #1, but limit them to 1-hop proxies — i.e. we make a simplifying assumption that you are only a “user” of Uniswap if you either call Uniswap directly or call a contract that calls Uniswap directly.  This would work well for Dharma and would likely narrow the set described in approach #1 significantly — but may exclude other interfaces / projects who use multiple-chained contracts  Finally, we can do this much more “surgically” — i.e. Dharma pulls it’s list of affected users, Matcha pulls their list, Paraswap theirs, etc. etc. Though this would certainly limit the amount of UNI being distributed to a conservative number, it would also invite a lot of subjectivity into this process that may hamper its likelihood of passing as a proposal.   Would love to hear thoughts (in particular from other projects that have been affected) on what would be the maximally inclusive way of doing this that spends the least UNI from the community treasury ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.430617559523809
                },
                {
                    "author_link": "https://gov.uniswap.org/u/monet-supply",
                    "index": "36",
                    "likes": "13",
                    "time": "17/09/2020-18:54:44",
                    "content": "    nadav_dharma:  Compile the same list of addresses described in approach #1, but limit them to 1-hop proxies — i.e. we make a simplifying assumption that you are only a “user” of Uniswap if you either call Uniswap directly or call a contract that calls Uniswap directly. This would work well for Dharma and would likely narrow the set described in approach #1 significantly — but may exclude other interfaces / projects who use multiple-chained contracts   I would love to hear other impacted interfaces / contract wallets speak up on this point. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.3125
                },
                {
                    "author_link": "https://gov.uniswap.org/u/ryanc414",
                    "index": "37",
                    "likes": "10",
                    "time": "17/09/2020-18:58:56",
                    "content": "    monet-supply:      nadav_dharma:  Compile the same list of addresses described in approach #1, but limit them to 1-hop proxies — i.e. we make a simplifying assumption that you are only a “user” of Uniswap if you either call Uniswap directly or call a contract that calls Uniswap directly. This would work well for Dharma and would likely narrow the set described in approach #1 significantly — but may exclude other interfaces / projects who use multiple-chained contracts   I would love to hear other impacted interfaces / contract wallets speak up on this point.   I don’t think that would work for Paraswap users, and by extension it wouldn’t work for Monolith users either since Monolith uses Paraswap for in-app swaps. Paraswap seems to have multiple hops between the initiating user address and the uniswap contract, for example: https://etherscan.io/tx/0x9aa38d9a86654e80e689f424cdda570ae33dbe48112dd860720d62f44968c7aa ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.284090909090909
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Jay-Prime",
                    "index": "42",
                    "likes": "9",
                    "time": "17/09/2020-19:07:43",
                    "content": "    monet-supply:      nadav_dharma:  Compile the same list of addresses described in approach #1, but limit them to 1-hop proxies — i.e. we make a simplifying assumption that you are only a “user” of Uniswap if you either call Uniswap directly or call a contract that calls Uniswap directly. This would work well for Dharma and would likely narrow the set described in approach #1 significantly — but may exclude other interfaces / projects who use multiple-chained contracts   I would love to hear other impacted interfaces / contract wallets speak up on this point.   Yeah, pretty sure this wouldn’t work for DeFi Saver users either. (User account - DSProxy - UniswapWrapper<>Uniswap) The user account initiating the transaction should be the one to receive the UNI in our case. Is there a reason not to just stick with EOA, the addresses initiating whichever transaction including a Uniswap swap? Guessing there’s a pretty obvious one that I’m not realizing, but just sounds like the simplest potential solution. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.541666666666667
                },
                {
                    "author_link": "https://gov.uniswap.org/u/nadav_dharma",
                    "index": "45",
                    "likes": "4",
                    "time": "17/09/2020-19:16:51",
                    "content": "Sounds like the 1-hop approach would have exclusionary implications.  I think the next step here is to pull some empirical data to get some rough heuristics on the scale of each approach.  I will circle back with more information (or, if anyone else wants to pull this thread, your contribution would be helpful). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.583333333333334
                },
                {
                    "author_link": "https://gov.uniswap.org/u/nadav_dharma",
                    "index": "46",
                    "likes": "6",
                    "time": "17/09/2020-19:17:29",
                    "content": "    Jay-Prime:  Is there a reason not to just stick with EOA, the addresses initiating whichever transaction including a Uniswap swap? Guessing there’s a pretty obvious one that I’m not realizing, but just sounds like the simplest potential solution.   For smart wallets like Dharma, the EOAs are simply the keys we use to submit transactions for our users.  The user’s “address” is their smart wallet contract. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.565476190476191
                },
                {
                    "author_link": "https://gov.uniswap.org/u/AgentSmith",
                    "index": "49",
                    "likes": "13",
                    "time": "17/09/2020-19:22:40",
                    "content": "If feasible, I propose adding a “claim” button to each excluded platform for active users to participate in a roll call. All possible methods of communication should be used to promote this. Then, use that list of addresses to check for TXs within the eligibility window and distribute UNI accordingly. I believe the tradeoff of inclusivity for equitability and efficiency is justified in this scenario. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.444444444444445
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Jay-Prime",
                    "index": "50",
                    "likes": "5",
                    "time": "17/09/2020-19:26:53",
                    "content": "Yup, that’s definitely an obvious issue, thanks for clarifying  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/mds1",
                    "index": "53",
                    "likes": "4",
                    "time": "17/09/2020-19:51:36",
                    "content": "If that’s the only reason not to simply use the EOA that initialized the transaction, can’t we work around that by modifying the claim function? Adding a function argument that lets the UNI be transferred to a specified recipient and supporting meta-transactions should be the only required changes. Then in Dharma’s case you’d specify the user’s contract wallet as the recipient, sign the claim transaction with the EOA, and send the meta-transaction. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.3125
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Keeeeeeeks",
                    "index": "54",
                    "likes": "3",
                    "time": "17/09/2020-19:54:52",
                    "content": "ELI5 where did the coins go? Aren’t they in the proxy contracts that interacted with users? Or is the idea that all of Dharma users got a 400 UNI allocation, and not 400UNI * [number of proxy contract users] ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/onlinedollars",
                    "index": "55",
                    "likes": "3",
                    "time": "17/09/2020-19:55:04",
                    "content": "It is worthy to appreciate the team for taking responsibility and are willing to make amends for any oversight. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.458333333333332
                },
                {
                    "author_link": "https://gov.uniswap.org/u/monet-supply",
                    "index": "56",
                    "likes": "5",
                    "time": "17/09/2020-20:00:02",
                    "content": "There were never coins allocated to these users. They interacted with Uniswap contracts via delegate call, instead of calling the contracts directly. Only those who directly called the contracts had UNI allocated to their address. So in the case of delegate call users, neither their wallet, nor the contract received UNI. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://gov.uniswap.org/u/brendan_dharma",
                    "index": "57",
                    "likes": "10",
                    "time": "17/09/2020-20:01:46",
                    "content": "Services that used a proxy architecture (in which a proxy contract performs the Uniswap smart contract calls on behalf of users), were not included in the initial UNI distribution. Only addresses that had called Uniswap functions themselves were included. We think this was an innocent oversight, and that the spirit of the distribution was to include these addresses. So we are working to try to get them included in a new UNI distribution. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.85064935064935
                },
                {
                    "author_link": "https://gov.uniswap.org/u/MrDost",
                    "index": "58",
                    "likes": "4",
                    "time": "17/09/2020-20:05:32",
                    "content": "Paraswap and Uniswap are  We, DeFi users, appreciate DeFi movement and swapping plalforms. Uniswap is the one of those platforms! I mean, I dont think we need to use Uniswap directly to show our love and support, any transaction, passed throught Uniswap deserves our attention and thankfulness! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.6875
                },
                {
                    "author_link": "https://gov.uniswap.org/u/nadav_dharma",
                    "index": "59",
                    "likes": "14",
                    "time": "17/09/2020-20:05:38",
                    "content": " If feasible, I propose adding a “claim” button to each excluded platform for active users to participate in a roll call. All possible methods of communication should be used to promote this.  Then, use that list of addresses to check for TXs within the eligibility window and distribute UNI accordingly.  I believe the tradeoff of inclusivity for equitability and efficiency is justified in this scenario.  This is a very, very interesting idea — so, from the proposal standpoint, we could say:  Deploy the merkle drop contract with the maximally inclusive subset of excluded users (i.e. approach #1) Include logic in the merkle drop contract that basically forces a user to send a claim call to that merkle drop in advance of some deadline (e.g. 30 days from now) Once the deadline passes, we only pull the amount of UNI necessary to satisfy claim'd users, and only those users can withdraw their UNI.  From an end-user standpoint, any affected wallets / implementations basically just give users the ability to claim their UNI now (with an X day lockup until the eventual point when the UNI can actually be withdrawn / traded).  I quite like that. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.572916666666666
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Defi_cefi",
                    "index": "61",
                    "likes": "7",
                    "time": "17/09/2020-20:24:17",
                    "content": "It would be sad if dharma wallet user will not get those sweet airdrops … basically they used uniswap indirectly …dharma provided an easy interface … uniswap got more trading volume …it was win win for everyone … uniswap kindly find a way to reward dharma wallet users too ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.130952380952381
                },
                {
                    "author_link": "https://gov.uniswap.org/u/deacix",
                    "index": "62",
                    "likes": "9",
                    "time": "17/09/2020-20:26:37",
                    "content": "Same here at 1inch! We provided huge volume to Uniswap and our users are now asking for the UNI token! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.uniswap.org/u/JFrankfurt",
                    "index": "63",
                    "likes": "9",
                    "time": "17/09/2020-20:28:13",
                    "content": "As much as I like Dharma, Uniswap, and contract layering in general, I do think there’s a strong opposition argument that could be made here. If the intent is to reward active participants in Uniswap and give them a voice in future platform development, we should consider that maybe each abstraction diminishes a user’s knowledge and care for the inner workings of the contract call stack they ultimately execute. Direct contract interaction is a rough gauge, but it does work reasonably well for targeting the people who are most committed to the platform. (And not to a higher abstraction.) I don’t expect to see much opposition to this proposal. I just don’t think it’s actually a clear-cut issue. Love you guys.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.733333333333333
                },
                {
                    "author_link": "https://gov.uniswap.org/u/t11s",
                    "index": "64",
                    "likes": "12",
                    "time": "17/09/2020-20:31:34",
                    "content": "I would disagree with the idea that using an aggregator diminishes care for the product. That’s like saying that buying soda from a shop instead of straight from the manufacturer means you don’t care about the product, even though that soda may be a soda you purchase often and enjoy. Using an aggregator doesn’t make you not care about Uniswap or disinterested in governance, it just means you were looking for a way to get the best price, and if you supported Uniswap through Dharma or Matcha or 1inch, I think it is fair to say that you deserve UNI for your patronage. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.875
                },
                {
                    "author_link": "https://gov.uniswap.org/u/JFrankfurt",
                    "index": "67",
                    "likes": "5",
                    "time": "17/09/2020-20:47:42",
                    "content": "Yeah, I understand that opinion. I think a more apt analogy would be white-labeling, not distribution. (At least, that’s what I was trying to get at.) It’s obviously case-by-case. In Dharma’s case, I see a small unicorn icon on the trading UI and nothing to indicate uniswap pipes after tokens are selected. 🤷see what I mean? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.197916666666666
                },
                {
                    "author_link": "https://gov.uniswap.org/u/AgentSmith",
                    "index": "68",
                    "likes": "2",
                    "time": "17/09/2020-21:08:18",
                    "content": "Precisely and thank you for expanding on the idea! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/nadav_dharma",
                    "index": "69",
                    "likes": "7",
                    "time": "17/09/2020-21:18:56",
                    "content": "Great idea!  Let me formalize this into a more verbose proposal w/ some associated data, I think this is the winner  This has the added benefit of really “enforcing” there being a user behind the allocation.  If the address in the merkle root is, for instance, an intermediary contract with no ability to execute arbitrary transactions, well, then that’s definitely not a “user” in the traditional sense. The only way an EOA or contract can claim the UNI is if they can actually send an arbitrary transaction — a capability typically reserved only for entities we’d generally conceptualize as “wallets” ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.378205128205128
                },
                {
                    "author_link": "https://gov.uniswap.org/u/haydenadams",
                    "index": "70",
                    "likes": "14",
                    "time": "17/09/2020-21:40:35",
                    "content": "    nadav_dharma:    Compile a list of all addresses (contracts or EOAs) that are in the call-chain of historical calls to Uniswap v1 / v2 before Sept 1. — i.e. if a Uniswap trade was triggered as EOA -> ContractA -> ContractB -> UniswapV2, all three addresses would be considered to be “users”. This is likely the most comprehensive, but I fear would be overly liberal in allocating UNI. . A rough analysis of on-chain data is required here.   Compile the same list of addresses described in approach #1, but limit them to 1-hop proxies — i.e. we make a simplifying assumption that you are only a “user” of Uniswap if you either call Uniswap directly or call a contract that calls Uniswap directly. This would work well for Dharma and would likely narrow the set described in approach #1 significantly — but may exclude other interfaces / projects who use multiple-chained contracts   Finally, we can do this much more “surgically” — i.e. Dharma pulls it’s list of affected users, Matcha pulls their list, Paraswap theirs, etc. etc. Though this would certainly limit the amount of UNI being distributed to a conservative number, it would also invite a lot of subjectivity into this process that may hamper its likelihood of passing as a proposal.     One consideration with 1. and 2. is there are likely arbitrageurs / bots / relayers with thousands or tens of thousands of addresses that trade through custom smart contract proxies that would receive hundreds of thousands of UNI from this proposal. Maximally inclusive sounds nice but I imagine will result in sending UNI to over >100,000 addresses (only <2% of which would be Dharma users) its worth noting governance can always vote to allocate more UNI in the future, but can’t ever get back UNI it unnecessarily wasted. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5788690476190474
                },
                {
                    "author_link": "https://gov.uniswap.org/u/t11s",
                    "index": "71",
                    "likes": "2",
                    "time": "17/09/2020-21:41:19",
                    "content": "In the case of Dharma I could agree that it would be more akin to whitelabeling, however with aggregators like 1inch and Matcha I believe the UI makes it clear enough that you are using Uniswap. Further, there are possibly many users who know that Dharma is using Uniswap, and use it for the free gas. I do see you side of the argument, and respect your willingness to be the opposite voice here.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.071428571428571
                },
                {
                    "author_link": "https://gov.uniswap.org/u/t11s",
                    "index": "72",
                    "likes": "4",
                    "time": "17/09/2020-21:51:09",
                    "content": "Maybe we have protocols or wallets that think their users would have been affected stake/send a certain amount of UNI and then allow them to add themselves to a list of wallets, and then have the wider community vote with their UNI if they want those wallet users to receive UNI. This process would allow for semi-decentralized approach to gathering and filtering out which wallets and their users should receive a second airdrop, without sending funds to thousands of bots and arbs as its not worthwhile for each bot or address to stake or send a large amount of UNI just to get 400 UNI in return. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.2232142857142865
                },
                {
                    "author_link": "https://gov.uniswap.org/u/chituga",
                    "index": "73",
                    "likes": "10",
                    "time": "17/09/2020-21:54:21",
                    "content": "Dharma users are uniswap users. We just preferred to access uniswap via Dharma because it’s less complicated for noobs. We deserve this airdrop too  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.333333333333334
                },
                {
                    "author_link": "https://gov.uniswap.org/u/TEDnica",
                    "index": "74",
                    "likes": "10",
                    "time": "17/09/2020-21:59:36",
                    "content": "All Dharma users know they are using uniswap, Dharma add a second layer of accesibility and security to uniswap platform for newbies like me. A Claim button with human validation on app can filter these bots and active users to be added to whitelist. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.777777777777778
                },
                {
                    "author_link": "https://gov.uniswap.org/u/kbridge",
                    "index": "75",
                    "likes": "3",
                    "time": "17/09/2020-22:07:10",
                    "content": "I appreciate applications that help bring new users to DeFi and cryptocurrency. I do have a question though. I notice that on your page it says “zero gas fees”. How does this work? If in fact there are no gas fees being paid, I don’t think it would be fair to distribute the UNI tokens. At least not in the same amounts. At times Uniswap users are paying up to $50 dollars in gas fees. I don’t understand how Dharma users are able to avoid them. Could you please explain? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.036363636363636
                },
                {
                    "author_link": "https://gov.uniswap.org/u/wazza",
                    "index": "76",
                    "likes": "11",
                    "time": "17/09/2020-22:07:17",
                    "content": "Absolutely NOT! These people are not paying gas fees like the rest of us, and many people that used Uniswap after 9/1 are not eligible, I disagree with this completely and it feels like users from those services are shilling this forum so fast. Disgusting that they want to ruin something so great like the UNI token so soon. I will vote NO and encourage others to do so, this is for UNISWAP users only. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely negative feedback on proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.339285714285714
                },
                {
                    "author_link": "https://gov.uniswap.org/u/ChazR",
                    "index": "77",
                    "likes": "5",
                    "time": "17/09/2020-22:11:15",
                    "content": "Metamask was causing issues with uniswap so I used Dharma at first, if this could be resolved we would be forever grateful  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.uniswap.org/u/RichP",
                    "index": "78",
                    "likes": "4",
                    "time": "17/09/2020-22:14:47",
                    "content": "You talk about a specific service like dharma in any case… theres many real human people that use uniswap through proxy contracts… for example I myself on 1inch exchange where gas fees are still paid, ive used 1inch exchange with uniswap many times, i have all the transaction hashes of the transaction clearly going through uniswap with 1inch exchange yet i am not able to claim the UNI yet. I do really hope this proposal passes through and ALL real human users that interacted with uniswap receive their deserved UNI tokens, this proposal isnt specific to dharma only… I hope this gets fixed as soon as possible, was super disappointed the moment i learned i wasnt able to claim the UNI tokens after having done Multiple Multiple transactions with 1inch through uniswap, specifically choosing unsiwap there many times for the better rate… This is a serious issue, defi community should work together and make sure all real human users of this service get recognized and can claim their tokens within a certain deadline at least… ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5941558441558445
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Theducky",
                    "index": "79",
                    "likes": "2",
                    "time": "17/09/2020-22:19:21",
                    "content": "I used dharma because My iphone did not let me download metamask. Will I still get my UNI airdrop? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/TEDnica",
                    "index": "80",
                    "likes": "6",
                    "time": "17/09/2020-22:19:21",
                    "content": "All swaps in uniswap pay fees, there is no way to bypass that, Dharma subsidized some of gas when network congestion are low and that all. Before Dharma I have too much troubles using metamask, and fail swaps, loosing partial transaction gas. In top of that Dharma verifies tokens enabled on app, so enabled tokens to swap are relative safe to operate. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.428571428571428
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Reeser",
                    "index": "81",
                    "likes": "3",
                    "time": "17/09/2020-22:23:30",
                    "content": "@wazza to build off of what @TEDnica said. Dharma subsidizes all of the fees, so the user doesn’t see them. It feels a lot better, but it’s not always the best price. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 8.75
                },
                {
                    "author_link": "https://gov.uniswap.org/u/t11s",
                    "index": "82",
                    "likes": "7",
                    "time": "17/09/2020-22:29:58",
                    "content": "For those that don’t understand how “gas-less” trades on Dharma work, let me explain. Dharma users don’t pay gas on their trades, but Dharma does on their behalf, they do this by taking a cut of APY from the “save” feature of their wallet which uses Compound for lending. Uniswap doesn’t get hurt from being used by Dharma, it has no effect on Uniswap whether I pay the gas or Dharma does, it still gets paid either way. Uniswap doesn’t even generate revenue from gas either, gas is always paid to the miners who execute smart contracts, never the contracts themselves. @wazza @kbridge @neverselling ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving additional information about proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.071428571428571
                },
                {
                    "author_link": "https://gov.uniswap.org/u/itsahedge",
                    "index": "83",
                    "likes": "6",
                    "time": "17/09/2020-22:30:46",
                    "content": "I like this idea as well. The less friction users have during the claim process through simple UX, the better. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.555555555555555
                },
                {
                    "author_link": "https://gov.uniswap.org/u/neverselling",
                    "index": "84",
                    "likes": "4",
                    "time": "17/09/2020-22:31:05",
                    "content": "No retroactive airdrop. Your users did not have to pay large gas fees. If anything, Dharma owes its users a drop directly, after all how many wallets did Dharma have hooked into uniswap trades? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.357142857142857
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Hash_tag",
                    "index": "85",
                    "likes": "7",
                    "time": "17/09/2020-22:31:58",
                    "content": "I support the proposal not for the free money,  but for the most fair distribution among UNISWAP USERS.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.666666666666666
                },
                {
                    "author_link": "https://gov.uniswap.org/u/RichP",
                    "index": "86",
                    "likes": "3",
                    "time": "17/09/2020-22:36:45",
                    "content": "This involves all proxy contract uniswap real human users… for example 1INCH Exchange which is a huge DEX aggregator and has many users who used Uniswap exclusively through 1inch exchange to at the same time be sure uniswap was giving the best rate compared to other defi projects, those real human users should have their voice heard by having UNI token power attached to them ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.421875
                },
                {
                    "author_link": "https://gov.uniswap.org/u/neverselling",
                    "index": "87",
                    "likes": "7",
                    "time": "17/09/2020-22:37:07",
                    "content": "Ill be voting no. Hopefully this doesnt even reach the proposal stage ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 2.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Megaz6",
                    "index": "88",
                    "likes": "3",
                    "time": "17/09/2020-22:39:21",
                    "content": "Many of us don’t have much money to throw around on gas fees as many times it would take a massive cut on any potential profits for low fund investors.  Dharma is a perfect choice for getting the maximum from my investments and the best option for me to trade on uniswap. You need to realise that not everyone can afford to pay the astronomical fees. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/camchis",
                    "index": "89",
                    "likes": "8",
                    "time": "17/09/2020-22:41:17",
                    "content": "Gas fees aren’t even a factor in this conversation, not paying gas fees doesn’t make you anymore/less of a supporter/user of Uniswap, gas fees do not go to Uniswap but to miners. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/RichP",
                    "index": "90",
                    "likes": "2",
                    "time": "17/09/2020-22:44:21",
                    "content": "The topic isnt even about gas fees… Again, many people use services like 1inch echange where huge fees of nowadays are still paid there and the users who sued uniswap exclusively though 1inch were not rewarded… this highly unfair… i do think it was a mistake to not make sure those users were included and this is why this thread was made. you can see i am a real human being that is even very active and can contribute to teh governance of the project… I have all the transaction hashes were i used uniswap through 1inch exchange, and i didnt get any amount of uni tokens… because i always used 1inch exchange to choose the best DEX at the moment of transaction… ive always been up to date on uniswap development and all and have used it many times through 1inch exchange… this is highly unfair… users like me should be recognized accurately and given the UNI tokens they shoudl have gotten I have many transactions through 1inch that used uniswap that didnt have any splits with other dexes… 100 percent uniswap. i would like to be recognized, i have the transactions hashes where it can clearly be seen ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.508333333333334
                },
                {
                    "author_link": "https://gov.uniswap.org/u/monet-supply",
                    "index": "91",
                    "likes": "8",
                    "time": "17/09/2020-22:44:52",
                    "content": "    wazza:  it feels like users from those services are shilling this forum so fast. Disgusting that they want to ruin something so great like the UNI token so soon.   Please read and adhere to the community guidelines. This feels like a personal attack, rather than a rational argument for your point of view. Maintaining a light hearted, friendly community vibe is everyone’s responsibility  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.645833333333333
                },
                {
                    "author_link": "https://gov.uniswap.org/u/tgijs",
                    "index": "92",
                    "likes": "4",
                    "time": "17/09/2020-22:45:53",
                    "content": "Strongly disagree. These are gateway platforms. I started off at Dharma, and once I’d figured it out I moved onto Uniswap directly, while still having a small portfolio at Dharma. Might not have gone on to Uniswap if I hadn’t tried Dharma first, due to the whole gas/gwei/fees mess. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.309523809523809
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Walkiry",
                    "index": "93",
                    "likes": "6",
                    "time": "17/09/2020-22:46:59",
                    "content": "I will most definitely be voting no on this proposal. If you use a proxy service of any kind you did it because you were getting (or thought you were getting) some other benefit on top of the use of Uniswap. In the case of 1inch, for example, you get to split and redistribute your trade by the “best” deal based on different liquidity pools. The claims are for the people who used and supported Uniswap directly, not through some other proxy that merely used Uniswap as a backend. You’re trying to, as the saying goes, have your cake and eat it too. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.444444444444444
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Reeser",
                    "index": "94",
                    "likes": "0",
                    "time": "17/09/2020-22:47:31",
                    "content": "That sounds like an excellent argument FOR Uniswap to include Dharma in the distribution? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/TEDnica",
                    "index": "95",
                    "likes": "2",
                    "time": "17/09/2020-22:50:51",
                    "content": "Gas fees have nothing to do with this discussion, it is about participating in the gobernance of uniswap for users that uses swaps trought third party apps but respecting all the rules of uniswap. If tomorrow are some desition that affects the functionally of uniswap I will like to participate, thats all. Any changes in uniswap will affect Dharma functionallity and users. UNI tokens must go to all users of uniswap platform on any form of interaction, making desitions more descentralized, fair and correct for everyone. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/tgijs",
                    "index": "96",
                    "likes": "2",
                    "time": "17/09/2020-22:56:11",
                    "content": "Yes that’s what I’m saying. I am replying to JFrankfurt above, who thinks Dharma users are not ‘active participants’ in Uniswap and therefore should not be rewarded, if I read him/her correctly. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/ygclyde",
                    "index": "98",
                    "likes": "4",
                    "time": "17/09/2020-22:57:28",
                    "content": "nice ill vote for this ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://gov.uniswap.org/u/tgijs",
                    "index": "99",
                    "likes": "3",
                    "time": "17/09/2020-23:01:05",
                    "content": "Unable to edit my post, but to clarify this is a reply to JFrankfurt’s post above. I am strongly in favour of the proposal to airdrop UNI to Dharma users and those of similar platforms. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.916666666666666
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Hold2zero",
                    "index": "100",
                    "likes": "4",
                    "time": "17/09/2020-23:15:13",
                    "content": "The 3rd party services recieved the Uni on their clients behalf and is their responsibility to distribute it to their clients if they wish. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/iwearahoodie",
                    "index": "101",
                    "likes": "8",
                    "time": "17/09/2020-23:16:52",
                    "content": "I do not support this at all. Anyone using an aggregator only used uniswap accidentally, if at all. They do not represent core supporters of the concept or protocol. Giving an airdrop to aggregator users defeats the entire purpose of trying to promote uniswap itself. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/TEDnica",
                    "index": "102",
                    "likes": "0",
                    "time": "17/09/2020-23:25:28",
                    "content": "But many users know they are using uniswap for swaps, just want to use a more friendly app to do that and on top of that apps like Dharma allows new users enter to crypto world. Because of that one opt-in button that allows users to claim UNI to participate on futures uniswap desitions will be great. Users that do not know what is uniswap will do not claim. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.34280303030303
                },
                {
                    "author_link": "https://gov.uniswap.org/u/iwearahoodie",
                    "index": "103",
                    "likes": "4",
                    "time": "17/09/2020-23:26:28",
                    "content": "Uniswap is plenty friendly. And apps like Dharma are more than happy to send users to other AMMs whenever it suits them. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.9375
                },
                {
                    "author_link": "https://gov.uniswap.org/u/lord_flo1",
                    "index": "104",
                    "likes": "4",
                    "time": "17/09/2020-23:37:16",
                    "content": "The airdrop is supposed to be shared with people who have supported the exchange, I think Dharma has been a great contributor to Uniswap, the dharma users should be included in the airdrop. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Walkiry",
                    "index": "106",
                    "likes": "1",
                    "time": "17/09/2020-23:44:51",
                    "content": "If you tried using Uniswap and failed for any of those reasons, you’d have gotten your airdrop. Everyone who used Uniswap, even if all they had was a single failed transaction, got the 400 UNI. So that’s not a valid reason to extend the drops. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 3.214285714285714
                },
                {
                    "author_link": "https://gov.uniswap.org/u/m0n3r0",
                    "index": "107",
                    "likes": "1",
                    "time": "17/09/2020-23:45:01",
                    "content": "I use Dharma wallet in my iPhone to do swapping since Metamask doesn’t available yet at that time. I would support this proposal to enable airdropping UNI for Dharma. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Rob",
                    "index": "108",
                    "likes": "10",
                    "time": "17/09/2020-23:47:54",
                    "content": "I’ve swung back and forth on this proposal a little. I take the argument that some of these aggregators are their own product, and Uniswap is simply used as infrastructure to facilitate the trade. I think there is a good case that users of these protocols are not users of Uniswap in the same sense as someone who interacts directly with the app. I’m thinking, for instance, of Kyber users. That said, for apps like Dharma who were explicit that their users were interacting with Uniswap, I think the case is much clearer. Dharma themselves marketed this Uniswap integration as little more than a convenient, user-friendly front end, built directly into their wallet. I think these users are Uniswap users. Certainly, arbitrage bots with hundreds or thousands of addresses should not benefit from a secondary distribution. I would propose that if there is a secondary distribution to include this edge case, then it should be done on a per protocol basis where governance decides whether it would be in the spirit of the distribution to extend it to the users of each service, app or protocol. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.514030612244898
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Demiserv",
                    "index": "109",
                    "likes": "1",
                    "time": "18/09/2020-00:30:08",
                    "content": "Would this also include Zapper users?  I wholeheartedly agree with this proposal and would love to see users added! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.125
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Wetitpig0",
                    "index": "110",
                    "likes": "3",
                    "time": "18/09/2020-00:30:14",
                    "content": "I want to also draw everyone’s attention to contract deployers. Contract deployers for 1inch and Paraswap etc. were contributors to Uniswap as they provided channels for people to access Uniswap. These contract deployers should also be rewarded, by allowing them to claim the tokens and send them to contract deploying account. Thank you. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Morning_staar",
                    "index": "111",
                    "likes": "3",
                    "time": "18/09/2020-00:31:53",
                    "content": "I strongly believe dharma users deserve UNI - after all Uniswap benefited the volume from Dharma users.   I know several of my non techie buddies chose to use dharma for its simplicity ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.083333333333333
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Dramatic-Interest-37",
                    "index": "112",
                    "likes": "1",
                    "time": "18/09/2020-00:54:54",
                    "content": "There are several My Ether Wallet (MEW) users affected, too. The app routed transactions through a proxy contract. The extra annoying part is that since MEW doesn’t support WalletConnect, the only way to access uniswap if you are a MEW user was through the in-app swap function, which went to that proxy even if your transaction was 100% uniswap. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/griplod",
                    "index": "115",
                    "likes": "2",
                    "time": "18/09/2020-02:18:46",
                    "content": "This makes sense to approve. I support it. It would be screwing over a huge user base, and if not supported I would expect Dharma and others to never use Uniswap again. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 4.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/uwuquant",
                    "index": "116",
                    "likes": "8",
                    "time": "18/09/2020-02:35:21",
                    "content": "I think the key considerations for including users of apps like Dharma are probably:   App must have directly integrated with Uniswap i.e. aggregators, bots should be excluded. This must be verified in terms of smart contact implementation - individual trade transactions should be linked directly to the exact wallet that was transacting   Must have been explicit about it (like in the case of Dharma)   We can have a period of whitelisting whereby the teams from affected apps can come forward to put their case for the community to vote on, and thereafter conduct the retroactive airdrop ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.553571428571429
                },
                {
                    "author_link": "https://gov.uniswap.org/u/coolcryptomaniac",
                    "index": "118",
                    "likes": "2",
                    "time": "18/09/2020-02:41:26",
                    "content": "There is nothing wrong in giving the airdrop to Dharma users , they should be rewarded if they have used the the Uniswap ,but there is a catch. In Dharma you can’t import your wallet , most of the wallets are created by Dharma so there will be many people who already traded in Uniswap and used Dharma for reason of gas fee. A huge mistake Uniswap team did was not considering the multiple addresses of same users and rewarding them , any person who uses say 10-50 addresses to trade in Uniswap already have got disproportionate amount of rewards and In future they will try to do so more as I think team didn’t think of sybil attack , as there is no way to measure sybil attack and hoping the percentage of dubplicate addresses with same users to be low, I congratulate Uniswap for giving every small traders the reward. Once Dharma can make sure the users are first time users and not traded in Uniswap and getting rewards two times ,rewards to Dharma should be released and rest of them should be added to treasury for any future use. Yes but every new project sending airdrop of any kind should try to find ways to uniquely identify users and disincentivies Sybil rewards. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.975378787878788
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Governor",
                    "index": "119",
                    "likes": "6",
                    "time": "18/09/2020-02:55:03",
                    "content": "Firstly, no one knew that “users” were going to be airdroped tokens by uniswap. So people claiming UNI on multiple addresses is not a bad thing as they didn’t do that solely to get UNI tokens in the first place. If they knew or heck if I knew, I would have traded through 100 different addresses before September 1st. And when it comes to Dharma, it’s not as same as trading through just another Eth address. On metamask, with one seed phrase, you can create multiple eth addresses. On Dharma, you need to set up an email and password and once you delete the Dharma app from your phone, recovery of your smart wallet is through support. So, it’s not the same. I doubt if any single person would be able to claim twice from Dharma. @coolcryptomaniac ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.508116883116884
                },
                {
                    "author_link": "https://gov.uniswap.org/u/nadav_dharma",
                    "index": "121",
                    "likes": "37",
                    "time": "18/09/2020-03:47:22",
                    "content": "Wow, OK — this discussion is spiraling in a variety of directions. Let me try to focus things here: In contradiction to what I said above, though, I have heard several anecdotes in private discussions indicating that expanding the UNI distribution to the “maximally inclusive / non-discretionary” options I listed above may abusively advantage arbitrageurs.  Allegedly, an oft-used infrastructural setup for such users is to have a single proxy contract with a large number of (circa 1000s) EOAs attached, and, unfortunately, the clever design suggested previously by @AgentSmith could succumb to this if it purely lived at the protocol layer. This isn’t to say that the initial allocation was maximally sybil-resistant or “fair” – but, in a sense, we’re better-positioned to not repeat or exacerbate drawbacks in a “programmatically-objective” distribution strategy now that we have governance. My revised proposal then would be as follows — establish clear “inclusion criteria” for wallets, interfaces, and aggregators whose users have been excluded from the distribution, collect a list of addresses from said wallets, and then use that list to create the initial merkle root for the allocation. The goal here will be to keep the allocation minimally surgical. In more detail: Inclusion Criteria We define “projects” as being any entity whose users were excluded from the retroactive UNI allocation due to the proxy contract issue identified above. In order to be eligible for inclusion in this distribution, a “project” must meet the following criteria:   Prior to September 1st, they exposed a publicly-available user interface either on web or in an integrated mobile application that allowed users to make trades on Uniswap in some capacity.  We include DEX aggregators in this definition — UNI holders ultimately get their paycheck from market takers, not makers.  Aggregators are fundamentally in the interest of Uniswap’s success.   It must be clearly verifiable that said interface / application was available to users prior to September 1st (e.g. if this is not immediately obvious that this is the case, the burden of proof is on the project for demonstrating, for instance, that an interface can be loaded on Wayback Machine, etc.)   It must be clearly verifiable that said interface / application at the time hooked into a proxy contract calling into Uniswap.  Again — if this is not immediately obvious or verifiable, the burden of proof is on the project to demonstrate this.   Finally, the project should provide a list of addresses of affected users.  It must be clearly verifiable that those addresses are associated with the proxy contract system previously identified to be associated with the project.  Once again, if this is not immediately obvious, the burden of proof lays with the project.   All provided addresses will be verified against historical Uniswap v1 and v2 calls to exclude any addresses that were not in the call-chain of a Uniswap transaction (successful or failed).  Open-source code to verify that this is indeed the case will be published for independent review. All addresses will be verified for not having been in the initial retroactive UNI allocation. Discussion Period We set aside the following 24 hours for discussion & debate of the above criteria.  Once the 24 hours elapse, we move into the Application Period Application Period A thread will be posted in the governance forum where projects will be asked to submit short, public applications on behalf of their users.  This will be a handful of questions we will post into a template in the thread’s OP.  We will reserve 48 hours for submission and inline discussion / debate. Submission Once a set of projects is decided upon, said projects will be asked to submit a list of affected user addresses in a public thread. Those addresses will be verified against the aforementioned criteria using publicly available code we will publish. We will then compile a merkle root for the distribution, deploy a merkle drop contract referencing that root, and will initiate a governance proposal to grant approval to said contract, with triggering scheduled for October 17th, 2020. To correct some misconceptions that appear to be circulating above — this allocation will be no more dilutive than the normal state of affairs; it will come out of the community treasury in which UNI is continuously vesting. Moreover, our intention is to be as surgical as possible — our hope is to limit the expanded allocation to the single-digit thousands.  We are open to employing a methodology akin to the one previously suggested by @AgentSmith (i.e. users must claim their distribution on-chain prior to October 17th, so only a strictly claim'd amount is transferred to the merkle drop contracgt), though the end-result numbers may militate towards this approach being overkill. ",
                    "links": [
                        "https://gov.uniswap.org/t/application-for-retroactive-proxy-contract-airdrop-for-projects-apps/3221"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.177164502164501
                },
                {
                    "author_link": "https://gov.uniswap.org/u/shauny",
                    "index": "122",
                    "likes": "12",
                    "time": "18/09/2020-03:50:50",
                    "content": "Notably, UNI tokens were also distributed to foodponzis creators like PASTA, SUSHI, FARM, etc. It’s disturbing that the UNI tokens were distributed to these ponzis instead of users who had actually used their capital to provide liquidity to uniswap. It does not make sense to penalize users who had contributed liquidity to Uniswap by distributing their UNI allocation to the ponzi creators instead. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Rnisbet",
                    "index": "124",
                    "likes": "5",
                    "time": "18/09/2020-04:43:05",
                    "content": "I think this is fair. Dharma promotes the fact that they use Uniswap and I think it’s one of the primary reasons people trust it. This would also benefit smaller users which is worth going out of our way for. If people are so worried about Dharma and other users not being dedicated enough a 2-4 year vesting period could be a good compromise. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.410714285714285
                },
                {
                    "author_link": "https://gov.uniswap.org/u/thejoulethief",
                    "index": "130",
                    "likes": "10",
                    "time": "18/09/2020-06:38:21",
                    "content": "It’s obvious, isn’t it? Uniswap is a DEX, market takers are what determine the revenue of the protocol. Even if someone uses an arbitrary aggregator or wallet, they’re still paying fees and interacting with the Uniswap contract by proxy – same as any other user. This airdrop isn’t an act of charity, it is fixing an oversight in the token distribution and giving a subset of users what they are owed. It’s in the best interests of the protocol to do this as it is in line with the goal of having as fair of a distribution as possible. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.053571428571428
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Abhimanyu121",
                    "index": "131",
                    "likes": "5",
                    "time": "18/09/2020-06:46:01",
                    "content": "How about people submit tx hashes where they used uniswap via something like dharma or 1inch exchange. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Tomas",
                    "index": "133",
                    "likes": "5",
                    "time": "18/09/2020-07:22:20",
                    "content": "I support the Dharma airdrop — many traders/investors prefer to use Dharma instead of Uniswap for different reasons (such as speed, mobility, simplicity, subsidized gas). Dharma has created an amazing product. It would be a shame and waste to see its users “punished” for using Uniswap indirectly. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.8999999999999995
                },
                {
                    "author_link": "https://gov.uniswap.org/u/RickyyValdez",
                    "index": "134",
                    "likes": "3",
                    "time": "18/09/2020-07:31:09",
                    "content": "I whole heartedly agree. It was simply an oversight  and would be honored to pass this proposal. Like mentioned before from other users , these scammer and Rug pullers  were able to receive their UNI but those who are new to the space or just want to be secure with their money didn’t . Would be a shame if we didn’t agree that they also deserve in getting an airdrop. Looking forward to show that this community can come together and put their best foot forward! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.508116883116884
                },
                {
                    "author_link": "https://gov.uniswap.org/u/litocoen",
                    "index": "135",
                    "likes": "6",
                    "time": "18/09/2020-07:34:45",
                    "content": "I support this 100%. Uniswap has shown that it wants a fair distribution with UNI tokens going to EVERY user. Even ones that had FAILED transactions. I don’t think they wanted to leave out Dharma users and besides usage through proxy contracts should be encouraged as it simplifies the UX. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.666666666666666
                },
                {
                    "author_link": "https://gov.uniswap.org/u/pants",
                    "index": "137",
                    "likes": "4",
                    "time": "18/09/2020-09:03:45",
                    "content": "I’m with this, not because I stand to gain uni tokens, but because Dharma and other dapps/wallets are trying to make things easier for users, and bring in new users. Some ppl only ever knew Uniswap through Dharma. It’s fair that they are included imo. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.889204545454545
                },
                {
                    "author_link": "https://gov.uniswap.org/u/cryptocatVC",
                    "index": "138",
                    "likes": "4",
                    "time": "18/09/2020-09:14:00",
                    "content": "so i will probably be skinned alive for saying this, but. I dont think proxy contract users should get the reward. If you are not technical enough to use Uniswap on your own, without having to rely on a 3rd party, you are not the type of person to make educated decisions on complex protocol governance. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.333333333333333
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Yieldcrypto",
                    "index": "139",
                    "likes": "5",
                    "time": "18/09/2020-09:23:45",
                    "content": "Using Dharma is convenient, that’s what all tech is about. Making users enable to use product in a simple form. If everyone has to setup nodes and write code then crypto would never been here. So here Dharma did was a good thing. @Dharma_HQ has triggered two timelocks:  upgrade the Dharma Smart Wallet to version 12, supporting Uniswap limit orders (ready to execute next Thursday) shorten the default account recovery timelock from 72 hours to 48 (ready to execute the following Tuesday)  After this update even the guys who are saying that people with no tech knowledge to use uniswap have no right for $UNI will start trading on $Dharma app. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.7896825396825395
                },
                {
                    "author_link": "https://gov.uniswap.org/u/gioman",
                    "index": "140",
                    "likes": "3",
                    "time": "18/09/2020-09:29:44",
                    "content": "I don’t like this selfishness.  Considering many crap like food tokens scam that have disappeared in exit scams have received the airdrop. Also same users have received tokens to different wallets. This not crypto and this is not why many people are in, the rule should be the same for everyone. I will be really disappointed if a solution can’t be found because of selfish users like yourself! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.265625
                },
                {
                    "author_link": "https://gov.uniswap.org/u/iwearahoodie",
                    "index": "143",
                    "likes": "1",
                    "time": "18/09/2020-12:06:41",
                    "content": "absolutely not. This is up to governance to vote on. Wait 30 days for governance to vest with community and then we’ll look at it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/iwearahoodie",
                    "index": "144",
                    "likes": "8",
                    "time": "18/09/2020-12:08:28",
                    "content": "    nadav_dharma:  Edit: Really happy to see what appears to be an overwhelmingly positive response to the high-level proposal. I would like to shift the discussion to more specific, technical matters related to how we can implement this proposal — please skip down to this message to add color to the specifics   This is nonsense. There’s no evidence the support is overwhelmingly positive. And these forums are painfully easy to sybil attack. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.129068462401795
                },
                {
                    "author_link": "https://gov.uniswap.org/u/STVC137",
                    "index": "145",
                    "likes": "6",
                    "time": "18/09/2020-12:13:52",
                    "content": "Hello, plese do not forget MEW Users. I have swaped many times by Uniswap integrated in the MyEtherWallet. I belive that we have the right to be also included in the airdrop. Afterall, we are also Uniswap users. Regards. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.9642857142857135
                },
                {
                    "author_link": "https://gov.uniswap.org/u/rabbidfly",
                    "index": "146",
                    "likes": "2",
                    "time": "18/09/2020-12:25:09",
                    "content": "tis a good thing that a democratized issue can marginalize the loud unsavoury opinions of the minority - who enjoy the sound of their own opinion echoing endlessly into the vacuum i do find it remarkable that in a time such as this when fiscal constraint tightens the purse - you can only think of launching a narrative that denies the community a small insignificant portion of the available pool - a community, no less, that contributes to your purse by using Uniswap, albeit through unconventional pathways ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.173076923076923
                },
                {
                    "author_link": "https://gov.uniswap.org/u/ryanc414",
                    "index": "147",
                    "likes": "2",
                    "time": "18/09/2020-12:32:57",
                    "content": "    cryptocatVC:  so i will probably be skinned alive for saying this, but. I dont think proxy contract users should get the reward. If you are not technical enough to use Uniswap on your own, without having to rely on a 3rd party, you are not the type of person to make educated decisions on complex protocol governance.   Because using metamask and the uniswap web app requires such expert technical skills? If you follow this line of reasoning, the airdrop should only have been given to users who called the smart contract interface directly (not via the web app). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.256493506493507
                },
                {
                    "author_link": "https://gov.uniswap.org/u/iwearahoodie",
                    "index": "148",
                    "likes": "0",
                    "time": "18/09/2020-12:34:53",
                    "content": "you raise valid points, I concur. And I have no better suggestion on how to divine the will of the ethereal “community” apart from the very forum upon which we debate. I will support the decision of a token-holder vote on the matter. I wish no-one financial misfortune due to the fickle hand of fate, and you are right that there’s plenty to go 'round. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.925595238095238
                },
                {
                    "author_link": "https://gov.uniswap.org/u/bitfloorsghost",
                    "index": "149",
                    "likes": "6",
                    "time": "18/09/2020-13:39:33",
                    "content": "Have to disagree in a big way here. There are tons of different ways that people “missed” the airdrop - I have a buddy who created his wallet two hours after the snapshot, and he missed out, too. I can’t in good conscience vote to dilute the shares of everyone who supported UNI just because certain wallet users were left out. tldr: If you used an aggregator to skip out on paying the fees that the rest of us were subject to, you shouldn’t be rewarded with a retroactive payout. You took a risk to try and save some bucks, and the consequences were not being included in this drop. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.6230158730158735
                },
                {
                    "author_link": "https://gov.uniswap.org/u/bitfloorsghost",
                    "index": "150",
                    "likes": "4",
                    "time": "18/09/2020-13:40:49",
                    "content": "Yeah, kind of shady marketing tbh to post that there. This is a big no from me. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.583333333333334
                },
                {
                    "author_link": "https://gov.uniswap.org/u/dmcintyre",
                    "index": "152",
                    "likes": "7",
                    "time": "18/09/2020-14:05:20",
                    "content": "I support this proposal 100%. There is clearly a way to work with the Proxy Contract systems (Dharma, 1Inch, etc.) to gather the list of users that are entitled to the airdrop. As for those pointing out that “x other person used Uniswap starting on Sept 2. and they didn’t get any UNI, why should you”, I would just loop back to purpose of the airdrop and the UNI protocol in general. It is to reward those who have supported Uniswap and DeFi over the long run. Users of services like Dharma and 1Inch certainly fall into that category - they’ve provided liquidity, fees, etc. to Uniswap and contributed massively to its growth. It is absolutely justified to reward those users in the exact same way that direct Uniswap users were rewarded. As @litocoen said, “Uniswap has shown that it wants a fair distribution with UNI tokens going to EVERY user. Even ones that had FAILED transactions. I don’t think they wanted to leave out Dharma users and besides usage through proxy contracts should be encouraged as it simplifies the UX.” ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.446428571428571
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Matle85",
                    "index": "154",
                    "likes": "0",
                    "time": "18/09/2020-16:04:12",
                    "content": "This is a great idea - ParJar from Parachute Token have built a great integration that gave people their first exposure to Uniswap (now including pooling in their app too). I know they were gutted that their users ended up missing out from something nobody could have called or expected. I’m sure they will be keen to set it right as well! Strongly support. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.775297619047619
                },
                {
                    "author_link": "https://gov.uniswap.org/u/mountain720",
                    "index": "155",
                    "likes": "0",
                    "time": "18/09/2020-16:22:59",
                    "content": "I would only support such a proposal if it addressed the following 2 concerns, and offered a real compromise to everyone:   It is easy to request an airdrop for UNI tokens now that we see the success of the coin.  A future airdrop of coins is unfair to those who immediately sold their 400 UNIs, as it was unknown whether or not the coin would gain traction.  If those users had known, they probably would have held their coins at least a little longer.  So the beneficiaries of this proposal have the advantage of knowing future value, in a sense.  A compromise would be that, on the date of any distribution, the amount of coins distributed would be in relation to the current market price vs. the initial price.  Let’s say the average initial price was $2.50, if UNI is trading at $7.50 on that date, only a third of coins should be distributed, as an example.   It is in the interest of UNI coinholders to have users use the Uniswap platform directly.  If a third party wants to access it, there is definitely a benefit to everyone too, as these synergies do help the ecosystem, and I see that argument too.  Perhaps the third party app should reward its user with its own native token to some degree as well as requesting UNI.  I cannot request this native token because I don’t use the 3rd party apps.  In this way, the amount of UNI in a potential distribution should be, as an example, quartered from the amount given to actual users.   So, a compromise counterproposal would be:  100 UNI, only to users who make a valid claim (TBD how), divided by (the market price of UNI on the day of distribution / $2.50).  The claimants could also request the native token of the platform they traded on as well, and it would be up to the platform if it wanted to distribute ownership interests, or not.  These numbers are just guidelines at this time, but, I feel like this is a real compromise that I would vote approval on. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.1242559523809526
                },
                {
                    "author_link": "https://gov.uniswap.org/u/HGP",
                    "index": "156",
                    "likes": "0",
                    "time": "18/09/2020-16:35:05",
                    "content": "It is noted that the growing trend for mobile applications has been proportionally increasing, thus making it more accessible to all Dharma users and others as mentioned above. Reaching an exponential number of people to connect in a simple way and directly with the Uniswap platform.  We cannot help but see an increase in mobile devices and through this a mass adoption for DEX ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.9750000000000005
                },
                {
                    "author_link": "https://gov.uniswap.org/u/PirosB3",
                    "index": "157",
                    "likes": "0",
                    "time": "18/09/2020-17:53:09",
                    "content": "I am a little concerned that the suggested proposal will still cause some takers to lose out on their $UNI. For example, if you traded using a non-public (custom built) smart contract which did not have a claim functionality, then you will be missing out. Are there any efforts to also include these custom-built contracts in the proposals? thanks! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.095982142857142
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Lovelight33",
                    "index": "158",
                    "likes": "7",
                    "time": "18/09/2020-18:22:43",
                    "content": "I’d like to add that Dharma is what led me and may other users to Uniswap directly. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.9375
                },
                {
                    "author_link": "https://gov.uniswap.org/u/blahblahblah",
                    "index": "159",
                    "likes": "8",
                    "time": "18/09/2020-18:42:32",
                    "content": "Dharma and Nadav are the reason I know what Uniswap does. They introduced me to the platform and I regularly swapped coins via the platform, as a result. I’m shocked my ETH address does not qualify for the 400 UNI. Would love to see this proposal go through. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.666666666666667
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Dodecagon",
                    "index": "160",
                    "likes": "1",
                    "time": "18/09/2020-18:57:07",
                    "content": "This is part of the risk people assume when downloading and using the software needed to make these transactions. While this may be a dilemma it is one between the user and the interface they used to interact with the Uniswap contract and not Uniswap’s obligation to correct. There should always be forethought and research done on how those proxy contracts can benefit and harm someone and it is the creator of those contracts duty to inform it’s users of those limits. UNI allocation was decided based on a large amount of data and those proxy contracts should of known there can be downsides to their design, otherwise everyone would be using the same security in smart contracts. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.7142857142857135
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Governor",
                    "index": "161",
                    "likes": "14",
                    "time": "18/09/2020-18:59:00",
                    "content": "What the 400 UNI airdrop for 251k addresses has done is that it has effectively bought loyalty of users and I’m not saying that in a bad way. We are all early users and were all rewarded. My rough guess is that there will be less than 25k addresses which will qualify for airdrop to proxy users and Nadav even said it will be in single digit thousands- less than 10k. If not, these users will feel left out. And if these users are given 400 UNI each, then this will be a nice gesture that composability is welcome and is rewarded. In future, this will motivate more projects to build on top of and side by side of each other. I understand the concerns of some users and at the base, the reason must be that these new airdrop receivers will sell and that each is getting $2500-$3000. But in my opinion, this wouldn’t be such a terrible thing as UNI is in heavy demand and this will be just a small price to pay for a broader distribution and a more wider community with more positive sentiment and loyalty towards the project. @haydenadams I would love to hear your thoughts on this proposal. I know you said on twitter that its upto uniswap governance to decide how to use treasury but we’d all love to know what you think about this  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.376774891774891
                },
                {
                    "author_link": "https://gov.uniswap.org/u/BCpowerup",
                    "index": "162",
                    "likes": "2",
                    "time": "18/09/2020-19:33:11",
                    "content": "Depends, If these services where using DEX and profiting from doing so, accessing the service through a dif interface? I think they should not get any UNI. That is the cost you pay. No ill intentions. using product with different brand… ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://gov.uniswap.org/u/wazza",
                    "index": "164",
                    "likes": "4",
                    "time": "18/09/2020-20:20:22",
                    "content": "Why are these 3rd party services not giving the rewards they got to their users? They were the ones interacting with the smart contract. I will vote NO and will keep encouraging others to do the same. I will protect the value of UNI tokens and all the supporters of Uniswap, no exceptions, no more. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.955357142857143
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Jay-Prime",
                    "index": "166",
                    "likes": "0",
                    "time": "18/09/2020-20:26:03",
                    "content": "I’m not sure you fully understand the transaction flow in this case, so let me please provide an example. In case of DeFi Saver specifically there were thousands of users who interacted with Uniswap through a UniswapWrapper contract. That contract got 400 UNI airdropped to it - not (X thousands * 400) UNI. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 3.75
                },
                {
                    "author_link": "https://gov.uniswap.org/u/wazza",
                    "index": "167",
                    "likes": "2",
                    "time": "18/09/2020-20:26:57",
                    "content": "Well that’s one of the risks of not using Uniswap directly. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Jay-Prime",
                    "index": "169",
                    "likes": "5",
                    "time": "18/09/2020-20:49:59",
                    "content": "I think it’s unfair to call this “risk”. Nobody knew that any event such as this airdrop is likely or even possible and there was no risk to take or not take. UNI was airdropped even to accounts that had failed transactions - so potentially accounts that made 0 volume. On the other hand, DeFi Saver users made millions of volume for Uniswap. Which of these would be more worthy of a UNI airdrop? I definitely agree that it’s hard to draw the line and find an ideal solution fair towards everyone, but I have to say I disagree with where you’re putting the line right now. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.465136054421769
                },
                {
                    "author_link": "https://gov.uniswap.org/u/unijay",
                    "index": "170",
                    "likes": "6",
                    "time": "18/09/2020-21:24:50",
                    "content": "The symbiotic relationships between these “money lego” dapps cannot be understated. It is important that interoperability and connectivity is encouraged wherever possible for the mutual benefit of all participants. Users should never be punished for helping grow the space by adopting dapps that are beneficial to them as their experience encourages their participation and ultimately their stake in the entire network. If the purpose of the 400 UNI is to reward participants, then a user that accessed uniswap, and paid their uniswap exchange fee, regardless of method, should IMO receive their UNI. I don’t see any material difference in connecting directly vs connecting via an aggregator. Both users have identical impact on revenue. Aggregators/dapps providing access to uniswap is a mutually beneficial arrangement, creating a hierarchy of users I believe would be a counter productive president to set. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Magnihusk",
                    "index": "172",
                    "likes": "7",
                    "time": "18/09/2020-21:55:26",
                    "content": "When the airdrop scramble initially happened people were selling as low as $1-$2 at the time and it was an uncertain risk what UNI’s price was going to be. Litigating the “fairness” of the whole process will be endless and this proposal just creates a precedent for perpetual litigation. I’ll be voting nay on any such proposals that want to expand snapshot criteria. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.074999999999999
                },
                {
                    "author_link": "https://gov.uniswap.org/u/AgentSmith",
                    "index": "173",
                    "likes": "16",
                    "time": "18/09/2020-22:11:56",
                    "content": "Thank you for the thoughtful post, Nadav! I generally agree with your assessment and the effort to be as surgical as possible as a means of maximizing equity for legitimate users and capital efficiency for the community treasury. In that spirit, I describe in point 3 (below) how elements of my previous suggestion can benefit users when integrated with your revised proposal. I believe these elements will materially benefit overall UX and allocation outcomes, which I aim to demonstrate. I also believe it will address concerns you and @haydenadams have expressed. For clarity, I’ll recap my understanding of your proposal along with my suggested amendment in a rough OKR format & procedural outline. Objective: Identify, verify, & make whole all excluded, legitimate users eligible for UNI in the most equitable, frictionless, transparent, and capital efficient manner possible. Note: “legitimate users” is defined here as individual users utilizing projects that incorporate Uniswap for personal trading and are not engaged in arbitrage or other use cases involving enmassed EOAs. Key results:   Legitimate users are identified & included in finalized Merkle root (by extension, arbitrageurs, bots, and relayers are identified & maximally excluded)   Code & identified addresses are independently verifiable by users   Legitimate, excluded users recieve UNI as though omission never occurred.   Amended process proposal:   Identify projects via Nadav’s aforementioned Inclusion Criteria   Selected projects generate lists of affected users which will be verified against historical Uniswap v1 & v2 calls as well as UNI claims list to verify eligibility. This serves as preliminary Merkle root.   Users are able to independently verify their address has been included in preliminary Merkle root via a search bar similar to initial Uniswap claim UI and/or a CAPTCHA enabled form where addresses may be submitted and verification of inclusion is provided on submission.   If the user’s address has been omitted, the user is additionally able to add it to a pending list via form logic for consideration and will be required to provide proof that they are not an arbitrager with 10+ wallets, while also meeting initial eligibility requirements. It is unlikely that projects with KYC would experience additional omissions but in the interest of benefitting users and mitigating future contention, I think this should be included. I believe user verification is an important feature in this process because it:   Provides users trustless/transparent assurance of inclusion & a dispute resolution process in the event of another unintended omission while eliminating the external locus of control they may otherwise feel.   Provides projects a secondary dataset to verify against. Lists generated by projects may still be vulnerable to inefficient inclusion, just as my previously suggested claim design is, but a combination of project lists and user verification should create a highly surgical (i.e. efficient & effective) dataset of EOAs.   In the event the end-result numbers exceed the projected goal of single digit thousands, user-generated verification could prove to be a viable solution to satisfy projects’ burden of proof. This can also create metrics such as % of user verified EOAs to objectively confirm achievement of key results, which subsequently confirm achievement of our objective.   Merkle root is compiled using finalized list after completion of the vetting process described in 3   Deploy Merkle drop contract referencing that root.   Initiate governance proposal to grant approval   Potentially overkill option to optimize for capital efficiency:   Include claim function in addition to aforementioned verification process for Merkle drop contract and refund unclaimed UNI to community treasury after x claim period. This will add friction and be inherently more exclusive and labor intensive, but will have redundant verification that only active users will recieve drop. Thank you for your consideration and I hope my perspective positively influences the outcomes of all involved. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.208241943241943
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Ndso",
                    "index": "174",
                    "likes": "3",
                    "time": "18/09/2020-22:25:47",
                    "content": "Why was Dharma not consider for the UNI airdrop? At a time when gas fees were through the roof, dharma helped so many users interact with the Uniswap proxy contract and give you guys business too. The gas fees was partially borne by dharma and a higher slippage. Uniswap HQ , please consider Dharma HQ for the airdrop. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.083333333333334
                },
                {
                    "author_link": "https://gov.uniswap.org/u/electroxts",
                    "index": "175",
                    "likes": "2",
                    "time": "18/09/2020-22:35:54",
                    "content": "Like many of the others described here, I used the proxy of the dharma provider on my mobile phone to make transactions on uniswap when i’m on the road, driving a car and at work, it would be great if the uniswap team considers the possibility of the dharma team initiative about air allocation as well  users like me, tnks Andrew ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 8.25
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Rnisbet",
                    "index": "177",
                    "likes": "6",
                    "time": "18/09/2020-23:47:33",
                    "content": "People opposed to this don’t want less than 10k addresses to be rewarded for supporting Uniswap. Meanwhile, not many complaints about the 12k addresses that never had a successful transaction and were rewarded. It will be a greedy start to Uniswap governance if this is rejected. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.729166666666666
                },
                {
                    "author_link": "https://gov.uniswap.org/u/nadav_dharma",
                    "index": "179",
                    "likes": "5",
                    "time": "19/09/2020-00:29:53",
                    "content": "Though I’m supportive of the spirit behind this suggestion, I fear that allowing arbitrary submission of addresses by any means (i.e. “dispute resolution”) is ultimately game-able, one way or another, and will add needless controversy to the vote for the proposal. Sybil-resistance is not so simple to build into an application and it’s not so simple to prove that someone is not an arbitrageur. Moreover, I would argue that folks who fall into the “edge-case” category of not having a project that will vouch for them in this process most likely developed their own proxy contracts to take actions on Uniswap.  It seems a bit unlikely to me that those users wouldn’t have already had the technical acumen to use Uniswap directly and, in turn, gotten a UNI payout elsewhere.  I would be surprised if there are more than 10 people in the world whose first and only interaction with Uniswap was through Solidity code. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.319444444444445
                },
                {
                    "author_link": "https://gov.uniswap.org/u/nadav_dharma",
                    "index": "181",
                    "likes": "8",
                    "time": "19/09/2020-00:46:50",
                    "content": "The Application Period has started and projects are welcome to submit applications to be included in this proposal in this thread  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/AgentSmith",
                    "index": "182",
                    "likes": "4",
                    "time": "19/09/2020-02:07:49",
                    "content": "All valid points and I trust all projects will do their due diligence to ensure all users are made whole. Thanks again for your time and consideration  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.458333333333334
                },
                {
                    "author_link": "https://gov.uniswap.org/u/projectuwb",
                    "index": "183",
                    "likes": "8",
                    "time": "19/09/2020-02:08:10",
                    "content": "Completely agree with the proposal. Dharma must have introduced numerous newbies to the Uniswap world minus the complexities of Metamask. Dharma users and other similar projects rightfully should have had the airdrop in the first place. It is disappointing that scams and rug pulls got allocation of the initial UNI but not legitimate users that actually provided liquidity and paid fees by trading on Uniswap using the Dharma wallets. It will be a very disappointing end if Dharma and similar project users are not given the opportunity to be part of this early adoption grant. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.518750000000001
                },
                {
                    "author_link": "https://gov.uniswap.org/u/projectuwb",
                    "index": "185",
                    "likes": "4",
                    "time": "19/09/2020-04:01:44",
                    "content": "I can understand your perspective, not sure if you are a user, but if you used Dharma you will know that they are as transparent as glass. Yes agreed the ‘No gas’ looks a bit gimmicky which I think can be improved on, all the fee are as transparent as they get. They list the slippage and clearly state that they will take the remainder from the slippage. Mainstream users will mostly prefer this over having to see and adjust various metrics in metamask to be able to get their trades through especially in this exploding gas market. So I would suggest you give Dharma a chance before being critical. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.40625
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Matle85",
                    "index": "186",
                    "likes": "5",
                    "time": "19/09/2020-06:24:13",
                    "content": "Sounds sensible. I have asked the Parachute token guys to have a read to make sure their ParJar Uniswap users are included. They have had a great in telegram bot which people have been using for a while now so it’s a real shame all those users missing out. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.625
                },
                {
                    "author_link": "https://gov.uniswap.org/u/routine88",
                    "index": "187",
                    "likes": "2",
                    "time": "19/09/2020-07:30:03",
                    "content": "How about KNC token holders? There aren’t that many of us, and UNI and KNC are in the same business and Kyber calls on UNI reserves for liquidity. Plus, UNI may be putting Kyber out of business pretty soon. Give us a parachute amirite? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.uniswap.org/u/fin2thepeople",
                    "index": "188",
                    "likes": "4",
                    "time": "19/09/2020-09:10:13",
                    "content": "I assume dharma & co users will want to have a proposal for quadratic voting in place before this this is decided. Quadradic will works kinda like this: If you have 10 gov token = 10 votes whale has 1000 gov token but only = 100 votes superwhale 1.000.000gov only = 10.000 votes Dharma & Co give a user experience to retail. So retail should be heard in this (and further) matters. Opinions of someone who is 100x richer must not be 100x cleverer. Therefore I urge everyone interested in this matter to push the discussions and implementation of quadratic voting. edit: typo ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.3125
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Abhimanyu121",
                    "index": "189",
                    "likes": "3",
                    "time": "19/09/2020-09:15:07",
                    "content": "I used 1inch exchange to make my swaps and I am not sure if the project owner will post in the application thread, so can I Simply put out my transaction hashes that shows that I interacted with Uniswap via delegated call? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 4.375
                },
                {
                    "author_link": "https://gov.uniswap.org/u/CryptoAssasin",
                    "index": "191",
                    "likes": "2",
                    "time": "19/09/2020-09:27:03",
                    "content": "Mooniswap / 1inch Users who provided Liq - Which mostly fed through Uniswap should not be penalized for doing it. All provided adoption and tremendous amount of money into the digital asset space. Lets see if this is acceptable - Once done - Binance and the rest will list 1INCH / MOONI tokens as well for sure which will make back the Airdrop distribution anyway. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.333333333333333
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Herbalizah",
                    "index": "192",
                    "likes": "1",
                    "time": "19/09/2020-12:08:33",
                    "content": "I think it is not more than fair to reward the Dharma users. It sole purpose is to interact with the the uniswapmarket and provide a buyers sellers market gor uniswap. It’s like another walletadress. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://gov.uniswap.org/u/ryanc414",
                    "index": "193",
                    "likes": "5",
                    "time": "19/09/2020-13:36:00",
                    "content": "For UNI bagholders who are against this proposal for totally understandable, rational self-interest in not diluting the value of UNI, here’s something to consider: What do you think will happen if this proposal gets denied - how likely is it that Dharma and other third party platforms will continue to direct their user’s volumes to uniswap, after being told by the uniswap community that their users don’t matter? Sure there are some token pairs that can only be traded on uniswap but for many of the more liquid pairs there’s nothing to stop platforms from directing trading volume to another DEX instead. Uniswap is a fantastic protocol and money lego, but its true value comes from the integrations with other money legos in the ethereum ecosystem. Ensuring that the users and developers of these third party platforms feel like a valued part of the uniswap community would be a rational investment in the future of uniswap and its token. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://gov.uniswap.org/u/gioman",
                    "index": "194",
                    "likes": "1",
                    "time": "19/09/2020-15:25:41",
                    "content": "24h have gone. Any update on the submission? Did the application period started? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Dramatic-Interest-37",
                    "index": "195",
                    "likes": "3",
                    "time": "19/09/2020-18:05:54",
                    "content": "Application is here:     Application For Retroactive Proxy Contract Airdrop [For Projects / Apps] Proposal Discussion       Hey folks — as described in this thread, we are now proceeding to the 48 hour Application Period for projects who’d like their users to be included in the retroactive airdrop for users affected by the proxy contract omission.  As a reminder, these are the criteria for inclusion:  Inclusion Criteria We define “projects” as being any entity whose users were excluded from the retroactive UNI allocation due to the proxy contract issue identified above.  In order to be eligible for inclusion in this …      ",
                    "links": [
                        "https://gov.uniswap.org/t/retroactive-airdrop-excludes-proxy-contract-users-e-g-dharma-matcha-etc/1222/121"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.6875
                },
                {
                    "author_link": "https://gov.uniswap.org/u/CutieSwap",
                    "index": "196",
                    "likes": "7",
                    "time": "19/09/2020-18:48:29",
                    "content": "I support this proposal. Im going to tell you my experience, i wanted to use Uniswap back in April of this year, i used it 2 times but transactions failed, something happened everytime i had no idea, so i used 1inch.exchange as a way to use Uniswap and in that way all transactions went throught. So they are both allies. A lot of activity was facilitated this way and a lot of users used Uniswap this way. Thanks for creating all of this, its exciting! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.09375
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Magnihusk",
                    "index": "198",
                    "likes": "5",
                    "time": "19/09/2020-21:18:49",
                    "content": "I find it funny DEX aggregators think they can make threats as if someone would use an aggregator that ignored uniswap ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Walkiry",
                    "index": "199",
                    "likes": "2",
                    "time": "19/09/2020-21:51:14",
                    "content": "    CutieSwap:  Uniswap back in April of this year, i used it 2 times but transactions failed   If you used Uniswap even once, even if the transaction failed, you got your 400 UNI drop. So, no. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 3.333333333333334
                },
                {
                    "author_link": "https://gov.uniswap.org/u/t11s",
                    "index": "202",
                    "likes": "4",
                    "time": "20/09/2020-05:47:48",
                    "content": "Just a thought, but what if we gave out 300 tokens to these users instead of 400. I think it’s reasonable as users who use Uniswap thru a proxy are still supporters of Uniswap, but are not necessarily as committed or ready to be involved with governance. I think this would be a fair compromise, as it still allows these users to get $UNI but still rewarding direct users of Uniswap who are more likely to be involved in governance. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.375
                },
                {
                    "author_link": "https://gov.uniswap.org/u/projectuwb",
                    "index": "203",
                    "likes": "1",
                    "time": "20/09/2020-11:10:53",
                    "content": "What is the difference between interacting with Uniswap direct vs going through a services like Matcha, Paraswap or Dharma? Do the users that interacted with Uniswap through proxies not pay the same fees and supported Uniswap? I think proxy services make it much easier for newbies to get into this space and this should not be penalised. But this is just my opinion. On another note @nadav_dharma it looks like there is a fair few projects that replied to the retroactive airdrop application. When is the cut off to have the proposal drafted? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.8
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Tim",
                    "index": "205",
                    "likes": "1",
                    "time": "20/09/2020-17:56:49",
                    "content": "i dont know what you are doing? this is not governance. it need offical proposal in29 days? I swapped trough instadapp and didnt get any uni. Dont vote here just make a proposal later when you have 1000 uni ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/nadav_dharma",
                    "index": "206",
                    "likes": "2",
                    "time": "20/09/2020-18:11:36",
                    "content": "Approximate cutoff is tonight ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/nadav_dharma",
                    "index": "208",
                    "likes": "4",
                    "time": "20/09/2020-18:20:46",
                    "content": "To my knowledge, no.  It appears there is an individual proxy contract per-user, in which case users would not have been omitted. More context.   twitter.com    Instadapp (Instadapp)  Anyone who previously used Instadapp portal to interact with Uniswap v1 or used our developer platform to interact with Uniswap v2, refer to this guide on how to claim $UNI tokens.  https://t.co/YxGzijaD82  8:35 AM - 18 Sep 2020     31          6            ",
                    "links": [
                        "https://twitter.com/Instadapp/status/1306980278964019200?s=20",
                        "https://twitter.com/Instadapp/status/1306980278964019200?s=20"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.555555555555555
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Tim",
                    "index": "209",
                    "likes": "1",
                    "time": "20/09/2020-18:26:40",
                    "content": "Thanks so much for providing this link. I did tried it already but it said the dsa didnt had any uni to claim altough i traded before 1 sept. i ll try it again . Thanks! Edit: i just checked… still no claimable uni on my dsa adress… Well i shouldn’t complain. i lok forward to your proposal to vote on! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.1875
                },
                {
                    "author_link": "https://gov.uniswap.org/u/t0m",
                    "index": "210",
                    "likes": "1",
                    "time": "20/09/2020-20:41:37",
                    "content": "Aggregators should also be taken into account! i used MEW and always choose uniswap. So on purpose because I want uniswap! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/t0m",
                    "index": "211",
                    "likes": "1",
                    "time": "20/09/2020-20:49:15",
                    "content": "    Walkiry:  Ich werde definitiv nein zu diesem Vorschlag stimmen. Wenn Sie einen Proxy-Dienst jeglicher Art verwenden, haben Sie dies getan, weil Sie zusätzlich zur Verwendung von Uniswap einen weiteren Vorteil erhalten haben (oder dachten, dass Sie dies erhalten). Im Fall von 1 Zoll können Sie beispielsweise Ihren Trade nach dem „besten“ Geschäft auf der Grundlage verschiedener Liquiditätspools aufteilen und neu verteilen. Die Ansprüche gelten für die Personen, die Uniswap direkt verwendet und unterstützt haben, nicht über einen anderen Proxy, der Uniswap lediglich als Backend verwendet hat. Sie versuchen, wie das Sprichwort sagt, Ihren Kuchen zu haben und ihn auch zu essen.   i used MEW and always choose uniswap. So on purpose because I want uniswap! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/dontforgetkyber",
                    "index": "212",
                    "likes": "1",
                    "time": "20/09/2020-21:14:01",
                    "content": "Don’t forget Kyber and Bancor! EOAs whose transactions have been routed through Uniswap from the Kyber etc proxies need to be included for being market takers!!  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Jay-Prime",
                    "index": "214",
                    "likes": "5",
                    "time": "21/09/2020-00:40:01",
                    "content": "After some internal and talks with our community of users, we quickly realized that DeFi Saver users are for the most part in a similar boat as Dharma users. As mentioned earlier, the architecture that transactions made via DeFi Saver follow in terms of Uniswap interactions is: Tx Sender -> User’s DSProxy -> DFS UniswapWrapper <> Uniswap. However, due to our Automation services the Tx Sender can be either the User’s actual account, or an Automation bot account. We believe the fairest approach in terms of DeFi Saver users would be for Users’ DSProxy accounts to be included, instead of Tx Sender accounts, since many DeFi Saver users exclusively use our Automation services for their leveraging and de-leveraging trades on their MakerDAO and Compound positions, in which case the Tx Sender is not User’s Account, but rather one of our Automation bot accounts (very similar to Dharma where they sign and send transactions for their users, if I understand correctly). For example, 71% of DeFi Saver transactions that include token swaps in August have been initiated by Automation bots. This approach would make sure that the receipients of the UNI aidrop are the actual accounts whose funds were being swapped and not our team owned Automation bot accounts (of which we have at least 10 currently active and many more that were previously used) that were merely signing and sending these transactions, on behalf of actual user accounts. As all DeFi Saver features revolve around the DSProxy architecture, all funds involved in all trades made via Uniswap were indeed originating from Users’ DSProxies, which hold either their MakerDAO CDPs/Vaults or their Compound portfolios. Additionally, we would like to highlight that we already have an interface available for User accounts to withdraw any tokens (e.g. UNI in this case) from their User DSProxies, meaning this approach would not be creating an issue for anyone. We are open on feedback and discussion on this, of course. ",
                    "links": [
                        "https://gov.uniswap.org/t/application-for-retroactive-proxy-contract-airdrop-for-projects-apps/3221/92"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.502083333333333
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Unlikely",
                    "index": "215",
                    "likes": "1",
                    "time": "21/09/2020-04:25:45",
                    "content": "I was in the habit of using 1inch to save gas fees with the CHI token.  So I was using Uniswap a lot, but have not benefited.  I would be very pleased if this use-case was considered. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 8.25
                },
                {
                    "author_link": "https://gov.uniswap.org/u/DonnoShit",
                    "index": "217",
                    "likes": "1",
                    "time": "21/09/2020-13:00:46",
                    "content": "We’re all together. We love Ethereum, Uniswap, Dharma Wallet. Each of them have something unique of their own. We are all part of one chain (Ethereum) and one community (Crypto). Lets make this happen with true governance for the people, by the people. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 7.28125
                },
                {
                    "author_link": "https://gov.uniswap.org/u/CryptoAssasin",
                    "index": "218",
                    "likes": "2",
                    "time": "21/09/2020-13:12:53",
                    "content": "1inch and Mooniswap need to be included as again it was used on a multitude of occasions for a variety of reasons. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Tim",
                    "index": "220",
                    "likes": "2",
                    "time": "21/09/2020-17:02:59",
                    "content": "Why are you flagging normal questions here? This is really shady business going on here/ sybil attack and flooding … I  REPEAT HERE WHAT I SAID EARLIER q: Shoud instadapp join? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 4.833333333333333
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Uniguy772",
                    "index": "221",
                    "likes": "2",
                    "time": "21/09/2020-17:14:18",
                    "content": "To be fair most flags I’ve seen are legit, admins can see who report things anyway so i’m sure if someone is abusing the flagging system they can warn and on repeated re-offence terminate the offending accounts ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.833333333333333
                },
                {
                    "author_link": "https://gov.uniswap.org/u/heyJonBray",
                    "index": "227",
                    "likes": "1",
                    "time": "23/09/2020-06:06:52",
                    "content": "    nadav_dharma:  The status quo has unfortunately punished our users and eroded our reputation with them — future builders will heed the signal and precedent set by how the Uniswap community addresses this.   This is something we need to keep in mind with every decision we make now that it’s in our hands. We’re in the position to build a better system than we have today with the help of partners and contributors like Dharma. We’re role models for the industry. No pressure  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Gottlieb",
                    "index": "228",
                    "likes": "0",
                    "time": "24/09/2020-12:17:44",
                    "content": "For anyone interested in this proposal. There is a vote running on shapshot until 27th of September o0 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.uniswap.org/u/futuresBetter",
                    "index": "229",
                    "likes": "0",
                    "time": "25/09/2020-10:27:19",
                    "content": "like this    On another topic   Hmm it looks like you didn’t quote me in your reply? Selecting any text in my post will bring up the Quote button. And pressing Reply with any text selected will work, too! Can you try again?   sorry I think I’ve messed this up. I don’t know what I pressed ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 2.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/bfrazier72",
                    "index": "232",
                    "likes": "2",
                    "time": "03/10/2020-03:01:12",
                    "content": "Totally agree with you. Uniswap gave those token to users who supported Uniswap, directly. Anyone who use other apps because fees are cheaper do not deserve the free tokens. There are times when we have to paid $50.00 in gass fees, but we still use uniswap. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.46875
                },
                {
                    "author_link": "https://gov.uniswap.org/u/bfrazier72",
                    "index": "233",
                    "likes": "5",
                    "time": "03/10/2020-03:17:57",
                    "content": "If this makes it to voting I will be voting no. You guys claim support for Uniswap, yet you guys do not use it for your transactions. Why don’t you guys demand your provider to give you the 400 UNI? Seems only fair. You guys consciously decided NOT to use uniswap for your transactions and chosing Dharma, Matcha etc… because it was covinient for you. Well it is only fair that UNI tokens are only given to those who used uniswap. You guys want free to tokens? Ask Dharma, Matcha etc for their own token… ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.5625
                },
                {
                    "author_link": "https://gov.uniswap.org/u/ageless",
                    "index": "234",
                    "likes": "3",
                    "time": "03/10/2020-03:46:27",
                    "content": "Will also vote no on this. The other service hooked up to Uniswap because it benefited their service. I get they want free money but these users used another service. That service can create a token and reward their users, but certainly Uniswap users wouldn’t expect a free meal if that happened. Don’t see why it works the other way around. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.764285714285714
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Uniguy772",
                    "index": "235",
                    "likes": "1",
                    "time": "03/10/2020-03:51:37",
                    "content": "Would disagree under the ground that   These people were all still under the terms of using the service before September 1, 2020, at 12:00 am UTC   These people provided the same participation to the Uniswap Network as users of the Uniswap network before the predefined above date and time   These people are not the same as others begging for tokens after the predefined date as set by the team who are most certainly not eligible as they were past the “cut off date/time”   I think this should be the one and only exception to the rule for the Airdrop as it will only be provided to those again within the predefined set time again anyone on this after the predefined time is considered “cut off” thus not intentionally hurting Uniswap and its Governance Token (Not money token) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0892857142857135
                },
                {
                    "author_link": "https://gov.uniswap.org/u/ageless",
                    "index": "236",
                    "likes": "4",
                    "time": "03/10/2020-03:55:08",
                    "content": "What happens if 1inch release a token and reward their past users? Do you think it’s fair that you would get rewarded with tokens from both Uniswap and 1inch? You used 1inch service and 1inch service used Uniswap. Why don’t you ask them to create a token and distribute it to users? And while you are at it ask them how can they distribute the token to Uniswap seeders since they were using Uniswap liquidity? Doesn’t work both ways this free lunch does it? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.416666666666666
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Uniguy772",
                    "index": "237",
                    "likes": "1",
                    "time": "03/10/2020-03:55:58",
                    "content": "Not the same as Uniswap is not or does not claim to be   a DEX aggregator 1inch is a DEX aggregator for DEX’s Also if you see it as a free lunch and not an opportunity to improve the Uniswap platform and govern then you’re clearly looking at the tokens use very wrongly its purpose wasnt to “Pay peoples salaries” or “refund peoples fees” it was to allow people to govern over the Uniswap platform to help keep it in community control unfortunately though a load of people saw it as a quick money grab and have sold where the is a risk a CEX has then grabbed it up for cheap giving CEX’s more control to make a damaging and lasting change to the Uniswap Platform ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.324074074074074
                },
                {
                    "author_link": "https://gov.uniswap.org/u/ageless",
                    "index": "238",
                    "likes": "1",
                    "time": "03/10/2020-04:00:59",
                    "content": "Anyone that used 1inch and did not simultaneously use Uniswap on another address we are talking about a tiny fraction of traders. Big overlap with users using DEX aggregators and Uniswap independently. Don’t buy it for a second that the large majority of these users haven’t already received 400 UNI on another address. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.214285714285714
                },
                {
                    "author_link": "https://gov.uniswap.org/u/ageless",
                    "index": "239",
                    "likes": "1",
                    "time": "03/10/2020-04:02:37",
                    "content": "25mm of the tokens went straight to Binance @Uniguy772. Think you’re a bit naive. Other users that didn’t use Uniswap previously and want to participate in the governance can also buy it from the market or get it from liquidity mining. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.510416666666667
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Uniguy772",
                    "index": "240",
                    "likes": "0",
                    "time": "03/10/2020-04:04:04",
                    "content": "Plenty of people had multiple addresses that’s beyond the question.  If someone happened to have multiple addresses (and I know plenty of people did for their own reasons) that had traded on Uniswap before the screenshot was taken they are still valid and these people were lucky either way is out of Uniswaps control Uniswap minted 15% of the total supply and sent them to a smart contract for the airdrop and named all the applicable addresses. These tokens are gone now and locked away forever if not all claimed by the original valid recipients as outlined in a locked post by Noah. People who didnt meet the airdrop requirement need to move on and stop moaning the opportunity has passed. As mentioned before Dharma are the only exception I believe should be allowed to this and tokens for that would come out of the Community Governance Fund I believe. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.951636904761904
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Uniguy772",
                    "index": "241",
                    "likes": "2",
                    "time": "03/10/2020-04:12:55",
                    "content": "Either way that’s not begging   Buying is someone deciding they want to have an interest in the platform and potentially vote which is good   Providing in liquidity pools is helping Uniswap and allowing people to be AMM’s, the heart of what Uniswap is about a community driven exchange.   Either way neither are the same as begging and these people would be rewarded for their later actions not related to the original airdrop. Would read https://uniswap.org/blog/uni/ to see where the above two categories come from to be honest as these are laid out as far as I’m aware on their original UNI blog post ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.090909090909092
                },
                {
                    "author_link": "https://gov.uniswap.org/u/ageless",
                    "index": "242",
                    "likes": "3",
                    "time": "03/10/2020-04:18:09",
                    "content": "Never said 1. or 2. was begging. I just don’t agree that users that use a third party service and indirectly use uniswap in the process deserve an airdrop. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Uniguy772",
                    "index": "243",
                    "likes": "1",
                    "time": "03/10/2020-04:22:04",
                    "content": "Would still disagree for my original posts reasons. These people arent asking to be included from outside the dates of the original airdrop they are being treated the exact same as anyone else who got the airdrop and still technically used Uniswap. Again not a free lunch I believe that to be a very bad attitude to label this airdrop as it was/still is about Governance not about “free lunches” while I can understand it did help a lot of people and for some related to a whole years salary the focus on this forum anyway in my opinion should be about the governance aspect not free lunches/monetary aspect. Still strongly believe in the saying \"There’s no such thing as a free lunch\" ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.258333333333334
                },
                {
                    "author_link": "https://gov.uniswap.org/u/ageless",
                    "index": "244",
                    "likes": "0",
                    "time": "03/10/2020-05:51:39",
                    "content": "I’d at least want to look at this on a case by case basis. Definitely no for DEX aggregators. edit: i had never used dharma before but having checked out their uniswap tutorial I would have no objection their users receiving a retrospective airdrop. I don’t like that everything gets clumped together though. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.25
                },
                {
                    "author_link": "https://gov.uniswap.org/u/uni123",
                    "index": "246",
                    "likes": "5",
                    "time": "03/10/2020-13:10:18",
                    "content": "Dharma now have 15m+ UNI delegated to them, so we will see this proposal to vote upon, personally I’m against it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/electroxts",
                    "index": "247",
                    "likes": "1",
                    "time": "04/10/2020-06:01:31",
                    "content": "how can you be against getting airdrop active community members - the same as you I personally have used dharma on my mobile, because I was often on the road driving your car and at the workplace it would be fair to reward members of dharma and similar app and of course it’s worth split these proposals with the DEX aggregators in different votes thanks to Nadav and other builders for defending the interests of your users, good luck and success in your difficult business and haters will always be, this is a state of a “black soul” in the first place ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.6506410256410255
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Uniguy772",
                    "index": "248",
                    "likes": "2",
                    "time": "04/10/2020-09:48:32",
                    "content": "Agree with you in part… I stand for Dharma to be an exception to the rule and anyone still within the original rules i.e.   Didnt already claim UNI with a wallet address also on the original list   Transacted before the cut off of 1st September @12   should be given tokens. Other than this there shouldn’t be any more airdrops and discussion on airdrops on this Governance forums should be stopped as it’s just getting annoying seeing the same people getting give out to by admins making multiple fake accounts to re-post the same crap than accept reality ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.5125
                },
                {
                    "author_link": "https://gov.uniswap.org/u/sommi",
                    "index": "249",
                    "likes": "3",
                    "time": "11/10/2020-04:36:28",
                    "content": "If you’re going to give them UNI, perhaps only give them 25% allocation once a month for 4 months Endless supply of tokens can damage the foundation of UNI. We are a working product but there are nefarious actors who are actively working to sink the price ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.569444444444445
                },
                {
                    "author_link": "https://gov.uniswap.org/u/insun",
                    "index": "250",
                    "likes": "0",
                    "time": "13/10/2020-02:37:36",
                    "content": "DeFi is about being fair to some degree, isn’t it? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Uniguy772",
                    "index": "252",
                    "likes": "2",
                    "time": "13/10/2020-07:18:39",
                    "content": "Support questions should be placed in the Uniswap discord not on the governance forum ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/heyJonBray",
                    "index": "253",
                    "likes": "8",
                    "time": "16/10/2020-13:56:25",
                    "content": "I thought we’ve already weeded out this nonsense… anyone who heard about the airdrop and is complaining simply wants free money. These are not people who want 400 UNI so that they can be part of governing the system, if you didn’t get an airdrop that means you probably didn’t hear about Uniswap until after the announcement. If you do in fact desire to take part in governing the system, right now is an excellent time to pick up tokens at a discounted price on secondary exchanges. You can even buy them through Uniswap! I have been accumulating ~100 UNI daily, and will allocate whatever it takes or delegate myself a proposal to prevent the snapshot from being extended. All of us, right now, are currently missing opportunities that we don’t even know about. That doesn’t entitle us to rewards once we hear about them. I have seen so many threads on this, and heard pretty much every excuse as to why it should be extended, and none of them have a net benefit for the system. All arguments boil down to entitled people who are envious that other people got something they want. This is the behavior of toddlers, and toddlers won’t provide good decision-making going forward. After gas fees, failed transactions, and other slow Ether drain since Uniswap started, the airdrop was basically a reimbursement for many long time users. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.581160241874528
                },
                {
                    "author_link": "https://gov.uniswap.org/u/heyJonBray",
                    "index": "254",
                    "likes": "5",
                    "time": "16/10/2020-14:10:47",
                    "content": "No, DeFi is not about being fair. It is about providing a means to transact assets without a third party. “Fair” is a construct of envy, and there is no place for envy in DeFi. Legacy systems are lousy with it, DeFi should rise above it. You missed one single opportunity in your life. I promise you, there will be another. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.128571428571429
                },
                {
                    "author_link": "https://gov.uniswap.org/u/jimz",
                    "index": "255",
                    "likes": "6",
                    "time": "18/10/2020-04:35:33",
                    "content": "The current argument surely isn’t about literally extending the airdrop to those who weren’t Uniswap users prior to September 1 but the difference in the announcement blog post between:  \"15% of UNI  150,000,000 UNI  can immediately be claimed by  historical liquidity providers, users, and SOCKS redeemers/holders  based on a snapshot ending September 1, 2020, at 12:00 am UTC.  and  \"400 UNI are claimable by each address that has ever called the Uniswap v1 or v2 contracts. This includes  ~12,000  addresses that have only ever submitted failed transactions — love you guys.  The fact seems clear that many users did not call directly either contract, and while the first statement in the blog post says users can claim UNI, the second only says addresses that directly called the contracts. In that sense, people feel entitled because, frankly, the announcement’s language entitles them. The ambiguity exists because the second paragraph only seems to expand the definition of those able to claim to include those addresses who did not literally successfully use Uniswap but only had attempted to do so as well as affirming that “users” definitely includes “addresses that have directly interacted with the contracts”, it doesn’t exclude any who ordinarily may have thought of themselves as users or have actually in some way used Uniswap via an indirect mean, knowingly or not knowingly. It also doesn’t include them. The tokens entitle governance, and this creates a situation where we have seen people use - as in in some way interact, ultimately, with the Uniswap contracts, complete swaps or attempt to complete swaps or provide liquidity or attempt to provide liquidity, but because of some distinction made later that they at the time certainly can’t be aware of mattering, be left out of the process. Yes, it’s about entitlement, but that’s because who is and who isn’t entitled in the promise made here is unclear and a binary choice. Whether they want to use the tokens for governance or just dump them or whatever, none of that matters here. It’s a matter of interpreting ambiguities in the language in what was already promised. It doesn’t help that immediately after the graphic in the blog the paragraph states:  With 15% of tokens already available to be claimed by historical users and liquidity providers, the governance treasury will retain 43% [430,000,000 UNI] of UNI supply to distribute on an ongoing basis through  contributor grants, community initiatives, liquidity mining , and other programs.  So once again, “users”. The decision really needs to be about what these terms mean and are supposed to mean. Instead of all the policy discussion we should really entirely focus on the ambiguity here in the language - unless there’s another document somewhere that more definitively defines who is and isn’t entitled as intended, in which case I would really appreciate it to be linked. Cheers. edit: Just refining the ultimate question can be boiled down to: Does a “user” include addresses (by extension really those who had control of the addresses) that ultimately had their assets interact with the Uniswap contracts, and: a) Have done so without knowing to have done so, or b) Have done so with the understanding that they have done so, or c) Have done so thinking that they have actually chosen to do so and because of various reasons (technical ability, platform confusion or obfuscation, etc) have only, as it turns out, interacted through a proxy. BTW This is why these things get written up by lawyers so because this is definitively something that should have been made clear ahead of time. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.3696230158730165
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Joncatch",
                    "index": "256",
                    "likes": "4",
                    "time": "18/10/2020-08:06:53",
                    "content": "This is ridiculous. Uniswap chose to airdrop the uni token as they saw fit. It was to ACTUAL people who logged into and used their website and program. Not to third party dex aggregators looking for the best prices for people and then taking their fee… I don’t even know why there’s a discussion about this. Those people weren’t using uniswap they were using an aggregators who did the work of finding the best prices for them which is totally different than even using uniswap. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.476190476190475
                },
                {
                    "author_link": "https://gov.uniswap.org/u/jimz",
                    "index": "257",
                    "likes": "2",
                    "time": "18/10/2020-19:10:22",
                    "content": "There’s a discussion to this because apparently people keep assigning meaning and intent to the devs without any evidence showing that it was the actual intent. You did the same here. I don’t know how you can call this ridiculous when not only does it affect actual people, but also the blog from the devs say things that are clearly interpreted in ways that many found unsatisfactory.  This is ridiculous. Uniswap chose to airdrop the uni token as they saw fit.  Unless you can get an actual statement stating that the tokens were dropped as they see fit and that is it - not partially, not just what’s conveinent, but in thact this is the outer limit, then I don’t know how you can justify that. Are you Uniswap? How do you know if the choice is a final one that is inclusive of exactly the intended? And if they said “users” multiple times and yet, dropped the tokens to “those who they saw fit”, that’s a phrase that isn’t even in the original post, so where are you gleaming their intent from? People make mistakes, code have bugs, best laid plans of mice and men, etc. But how do we know that if the text doesn’t say that?  It was to ACTUAL people who logged into and used their website and program.  Again, this doesn’t even represent a huge portion of the people who actually did get the tokens. Are you suggesting some sort of rollback in case? I primarily used contracts and eth calls to interact with the swap. Does not using the front end mean that I didn’t use Uniswap? Is Uniswap just the front end? There’s no way this assertion can at all be true unless you want to take away people’s tokens afterwards. How would this even make sense?  I don’t even know why there’s a discussion about this.  Because there’s an ambiguity and for some reason people keep calling it ridiculous while asserting things backed not by the text of the announcement which people have relied on, but rather, just their opinions and instincts. I was under the imrpession that governance requires knowledge and evidence, not just. I’m happy to see any evidence to the contrary except I haven’t seen much of anything,.  Those people weren’t using uniswap they were using an aggregators who did the work of finding the best prices for them which is totally different than even using uniswap.  And that was my whole point in the end. There are at least three groups of people who “used” in the commonly understood dictionary sense with Uniswap contracts (and one group that didn’t but were counted anyway as they intended to use but failed due to the blockchain).  What is “use”, and in what context does it count for “use” in this case? The factual matter is that for the addresses listed in teh Git repo of the lists, all thoe addresses/contracts were interacting and swapping with UNI. Some may have known that they were doiing it indirectly, some may not. Either hway, we’re not mind-readers, And I think it would be appropriate to back up any assertions with hard evidence that is literallya part of the record or otherwise it goes offt he rails really fast. The problem is very simple, but it’s absolutely not ridiculous unless schadenfreude is your thing,. Don’t minimize any of this. We have votes because your definition of \"using \" and mine are almost necessarily different and we both got airdropped anyway. Usuaslly we have a court to try to fix the difference, and we don’t have an in depejndent judiciary in a decentralized way. I’m happy to address any objections but I personally go with the original text announcement first, that is more ort less the public founding document, since that’s all we got to start with. Unless a dev can come out to state exactly what they had intended to do, that must be where we start. What’s ridiculous about that except somehow this didn’t get defined beforehand and cause a lot less trouble and disussion. edit: Straightening up train of thought, been a long day ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.544418238993711
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Joncatch",
                    "index": "258",
                    "likes": "4",
                    "time": "18/10/2020-20:37:17",
                    "content": "You seem to be the opinion that uniswap owes you something when the fact of the matter is they don’t owe you anything so I’m not continue with your circular arguments they did what they did and it’s done there’s literally no legality to your arguments although you pose them as if your some lawyer. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/jimz",
                    "index": "259",
                    "likes": "1",
                    "time": "19/10/2020-05:07:54",
                    "content": "tl:dr Many people feel uniswap owes them something because what appears to be a promise was made, in the open, but instead weren’t able to participate because apparently there’s no well-defined boundaries of “user” in that document, with no indication that it’s an omission, deliberate, mistake, or anything. We need to clear this up at least, whether we distribute the tokens or not, because that’s basically the essence of governance. This affects literally thousands of addresses. The defi ecosystem is heavy on credibility of individual actors and projects and so, how would people feel about those who paritcipated in, however directly but still factually, in Uniswap’s success yet are excluded because of a failure to properly define the parameters? Longer more in depth points: BTW, I am a lawyer by training and background but I’m speaking on my personal behalf as a member of the community. I’m not interpreting or giving advice as to the laws of any jurisdiction and should not be construed as doing so. However, governance represents essentially the setting out, creation, and application of legalistic standards within a community. If your participation in the community is to say “let’s turn this into a CEX” then, you’re welcome to be here but it seems to be the wrong venue for such an argument, but by arguing that “what’s done is done” and that the dev’s actions to the current moment is immutable and final and can be determined as such (by who, you?) then why even engage in governance? “What’s done is done” means you never go back to fix things if what’s done was done badly. I’m not talking about it in legal terms, but general, every day terms. We’re also not talking about illegality - we’re making the laws here, but there are matters of equity outside of the law that still apply, as in, community trust, unequal treatment, not fulfilling promises, making ambiguous promises. You surely have experienced some sort of situation where it’s not a legal wrong but nevertheless, a wrongful act to your detriment that you feel that someone broke a promise or did something untoward that you feel aggrieved about. Setting laws and codes and definitions, in the small community here, is a way to avoid that. The fact that we have vigorous debate and discussion is undoubtedly a good thing because you can’t govern without discussion and sometimes even vigorous ones. Do you think the one-party rubber stamp “people’s congress” in China does any debate or defining ambiguities? My grandfather was on that and no, they didn’t, and we’re hopefully trying to avoid that, and the first step is to set out boundaries as to the basic terms being used. I don’t know if the devs owe me any more tokens, I frankly don’t know if they owe anyone any tokens. It is only a mere possibility, and only if the community decides on what is a user and what isn’t a user. You’ve stated earlier that you consider users to be those who used the front end but that’s obviously not even supported by how the tokens were distributed. I’m suggesting that we acknowledge the baseline parameters here:   “Usage (noun)” - this is a pretty simple one. I realize that not everybody’s first language, including my own, defines this with the same nuance as and sometimes lack thereof in English, buit the devs have in some ways done that for us. The usage of uniswap means to interact with, via the front end or directly via the contracts, to complete, or prior to September 1, 2020, to attempt to complete some sort of a swap or liquidity add/removal act, by a user’s actions, at the very least. The devs don’t use the word usage itself I believe but because “use” can be a verb and a noun in English, this should also refer to any time “use” is used as a noun. And to use something, it’s a sentence that at least requires a subject, and in this case an object as well.   “User” - this is less simple. Firstly, since linking natural persons to addresess or contracts is self-defeating in this sense, a user is a contract or wallet, with the understanding that someone has control over it, that interacted with the uniswap contracts successfully in making swaps, adding/removing liquidity, or before September 1, have attempted to do so. Because you can’t swap nothing for nothing, I think this should include an actual transfer of tokens/eth in the formulation. If you’re not a user by the 1st of September, the current, outlined rules say that you’re not included in the users that are eligible. That doesn’t mean that in the future you don’t count as a user, just for the current purpose.   Because that’s where we are, the question left is “who, in their capacity in controlling funds/tokens in usage, constitute a user”. Since we are only talking about cases where third party intermediaries of some sort acted as a middleman/proxy/front-end/etc really there are only a few potential options. And the options really are:   Some sort of strict liability - you didn’t even know that Uniswap was a possibility and certainly made no conscious effort to choose it but the result is that the transaction was done with Uniswap got back to your wallet without you knowing through which means that was achieved.   (Possibly, still working this out) - some sort of at least in criminal and civil contexts in the US, a “recklessness standard” equivalent, as in you didn’t intentionally choose to use Uniswap and but are aware of its possibility and was ambivalent about using it, and indeed in the transaction it was used and all was well and the transaction was completed.   Some sort of knowingly standard , as in you knew that uniswap was a choice and some part of the decision making process involved in you knowingly selecting a service that had Uniswap as an option, without selecting Uniswap itself over other services (for a Dex aggregator). The transaction happened and was completed through Uniswap.   Some sort of purposeful standard, where you went to some third party service, saw Uniswap, chose it specifically, and it was completed.   While this really should have been worked out by the devs (as they determined that failed transactions also count), I guess it’s left to us. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.182371262458472
                },
                {
                    "author_link": "https://gov.uniswap.org/u/UniT",
                    "index": "260",
                    "likes": "16",
                    "time": "19/10/2020-08:33:16",
                    "content": "From the UNI blog post:  Uniswap owes its success to the thousands of community members that have joined its journey over the past two years. These early community members will naturally serve as responsible stewards of Uniswap.  Using Dharma to unknowingly trade Uniswap was not joining the Uniswap journey. Those who used Dharma used Dharma, not Uniswap.  They were not early Uniswap community members. They were not on the Uniswap journey. They are Dharma users.  To the Dharma folks: perhaps create your own DHARMA token and airdrop to your users. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.7142857142857135
                },
                {
                    "author_link": "https://gov.uniswap.org/u/jimz",
                    "index": "261",
                    "likes": "2",
                    "time": "19/10/2020-18:01:42",
                    "content": "Okay, and that’s a fair opinion and reading of what constitutes a “user” in the case and I think an entirely valid way of defining what a “user” counts for. This would mean that a user as defined by the announcement would require someone to not just incidentally or unknowningly interact with Uniswap without their knowledge but had at least some knowledge if not intent to participate in the process. That’s a perfectly valid way of defining the boundaries. The nexus of control both in the transacting of the transaction in question as well as the target contract in the end would be require at least knowledge of the initiating person/code designed by a person. However I just want to note that just because someone is a DHARMA user does not make it mutually exclusive that they may have used Uniswap in some manner as well. It makes no sense to say \"they are Dharma users, they can’t also be Uniswap users, just not in the transactions in question where they interacted with Dharma without having intended to do so with Uniswap. I don’t know if that’s what you had meant but I’d simply like to, for the sake of avoiding further ambiguities, at least point that out that we’re talking about these on a transactional, per-use level, not labeling someone in a binary. As long as we’re good with that then I think that’s a perfectly fine definition that the community should at least have a crack at discussing and voting on down the line. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.53287037037037
                },
                {
                    "author_link": "https://gov.uniswap.org/u/BananoForScale",
                    "index": "263",
                    "likes": "1",
                    "time": "26/10/2020-02:13:56",
                    "content": "    jimz:  However I just want to note that just because someone is a DHARMA user does not make it mutually exclusive that they may have used Uniswap in some manner as well.   Then they would have already gotten the airdrop, correct? If you used Uniswap before the deadline, even tried and FAILED to make a trade, then you were eligible and can claim any unclaimed funds. I think it’s rather cut-and-dry. I speak as someone who didn’t receive an airdrop. Also, as a sidenote, I use Uniswap on my phone all the time through metamask, and it seamlessly works. Perhaps not using it is a choice? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/memoool",
                    "index": "264",
                    "likes": "1",
                    "time": "26/10/2020-13:59:54",
                    "content": "Dharma is the perfect access point to interact with the protocol, wouldn’t change it for anything else. I think we deserve the UNI  thank you team Damn I Love Uniswap and Dharma! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 9.0625
                },
                {
                    "author_link": "https://gov.uniswap.org/u/frdsofficial",
                    "index": "265",
                    "likes": "0",
                    "time": "30/10/2020-02:00:00",
                    "content": "Guys, that’s our chance! Leshner (@rleshner) has voted for the Dharma proposal! Mark @gauntletnetwork on his post and ask them to rethink about their vote! Something like this: @gauntletnetwork please, rethink about your vote! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/graemeblackwood",
                    "index": "266",
                    "likes": "4",
                    "time": "30/10/2020-10:41:27",
                    "content": "I have a couple of thoughts on this:   For those arguing about whether someone can be considered a Uniswap user if they only used it in an abstracted way – Uniswap is a protocol. app .uniswap .org is just a frontend, and Uniswap themselves could have used a proxy to orchestrate certain actions if they had chosen to.   Uniswap LPs have benefited from the volume of activity through proxy interactions like Argent, Dharma etc. And in general, these apps have helped Uniswap to grow and succeed as much as any other interaction.   A new 5 million UNI drop would mean increasing the circulating supply by ~2%. A minimal potential impact to existing holders.   By nature of their focus on simplicity, Dharma and Argent are often someone’s first foray into crypto. Many know nothing about airdrops, or the incredible ecosystem out there. The original UNI airdrop was quite miraculous for many people. Possibly life changing in some cases.   We have an opportunity to deepen the interest and commitment of thousands of people, both in Uniswap and in crypto. This seems worth it to me for the sake of bringing forward a 2% increase in circulating supply. I presume those voting against think they are being principled. But to me seem to want to deny something amazing to others that they themselves benefited from. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.02592627960275
                },
                {
                    "author_link": "https://gov.uniswap.org/u/uni0",
                    "index": "267",
                    "likes": "8",
                    "time": "30/10/2020-11:38:33",
                    "content": "I don’t think you quite understand what 2% inflation overnight would do to market orderbooks. It will absolutely tank the token because of existing users front-running it like we a seeing now, and because of the possibility of a second airdrop, and lastly because of the 2% inflation hitting market almost instantly. Dont try to play this off as a small thing. It’s not. I have voted NO ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.95
                },
                {
                    "author_link": "https://gov.uniswap.org/u/ipungcaem",
                    "index": "268",
                    "likes": "2",
                    "time": "30/10/2020-12:13:07",
                    "content": "We love uni swap and we love Dharma ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/graemeblackwood",
                    "index": "269",
                    "likes": "5",
                    "time": "30/10/2020-15:31:55",
                    "content": "Whether short term volatility matters depends on your time horizon. Yes there would be some temporary price impact. And if you are patient it will settle down after a few days to a week or two. So for the sake of a couple of weeks, I do feel No voters are being quite selfish in this. I’m personally unaffected, I should say. I just find it fascinating how people who were gifted something can suddenly refuse to allow others equally deserving to receive the same gift. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.447222222222222
                },
                {
                    "author_link": "https://gov.uniswap.org/u/tarek1357",
                    "index": "270",
                    "likes": "3",
                    "time": "30/10/2020-21:51:55",
                    "content": "I’ll vote & support this proposal ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/heyJonBray",
                    "index": "271",
                    "likes": "2",
                    "time": "31/10/2020-08:31:40",
                    "content": "    jimz:  BTW This is why these things get written up by lawyers so because this is definitively something that should have been made clear ahead of time.   You bring up some really interesting ideas in your post, I agree with much of it and I will come back and read it again after I’ve had some time to marinate on it. However this last part about it being a litigious issue I don’t agree with. The creators intentionally and willingly handed this over to the community, and I agree completely that it is up to us now to respectfully dissect how it was rolled out and set up fair reward systems going forward. We are all the judge and the jury now when it comes to determining verbiage and sorting out the last decisions the original creators made. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.238636363636364
                },
                {
                    "author_link": "https://gov.uniswap.org/u/heyJonBray",
                    "index": "272",
                    "likes": "6",
                    "time": "31/10/2020-08:35:28",
                    "content": "Agreed, we’re all in this together now and the users who took advantage of Uniswap by proxy were as much contributors to the system as those of us who used it directly. It is a shame that so many people cannot see the forest for the trees. Thinking about the price impact on UNI as an asset is selfish in the face of this amazing gift we’ve been collectively given. The more I think about the nuance of this and read existing literature on reward distribution, I’ve changed my opinion on this matter:     Retroactive Airdrop Excludes Proxy Contract Users (e.g. Dharma, Matcha, etc.) Proposal Discussion       The more I think about it, I think that while it is frustrating for people who used a proxy, that is one of the risks when using a proxy. I handle multiple accounts for family members who don’t have the time to invest in crypto. When the UNI airdrop happened I could have taken all their UNI, transferred it to my address and they would have been none the wiser. Granted, I informed them of the windfall, let them know that not selling at airdrop price was an extreme risk, and let them decide. At th…     ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.6875
                },
                {
                    "author_link": "https://gov.uniswap.org/u/green",
                    "index": "273",
                    "likes": "2",
                    "time": "31/10/2020-21:27:55",
                    "content": "Duplicate airdrops are a problem. How many Uniswap users chose to go to Dharma later in order to save gas fees? Why give them twice the UNI? I see imminent freeloading. Why not reward twice Uniswap v1 and Uniswap v2 users? Retroactively giving away free stuff is less desirable when you are losing some of that free stuff. I can’t see how this benefits me, so I will reject this. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party giving entirely negative feedback on proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.133333333333333
                },
                {
                    "author_link": "https://gov.uniswap.org/u/heyJonBray",
                    "index": "274",
                    "likes": "3",
                    "time": "31/10/2020-23:13:59",
                    "content": "The more I think about it, I think that while it is frustrating for people who used a proxy, that is one of the risks when using a proxy. I handle multiple accounts for family members who don’t have the time to invest in crypto. When the UNI airdrop happened I could have taken all their UNI, transferred it to my address and they would have been none the wiser. Granted, I informed them of the windfall, let them know that not selling at airdrop price was an extreme risk, and let them decide. At the end of the day I did all of the work managing assets and making trades on their accounts to provide them with a benefit (profit in this case). I could have by all rights taken the UNI as I was the only one interacting the the actual system. This is one of the risks of using a broker over handling your money directly, you are delegating some resource to a third-party (time, money, making certain decisions for you) in order to make it easier for you. The inherent risk remains that the proxy is the one really involved with the core system, and therefore have set themselves up in a position to act as a wall. Clearly, anyone who uses a proxy for anything is gaining something, otherwise they wouldn’t be using a proxy. When the proxy then receives a benefit from the third party they’re mediating business with for you gets access to a reward, you’re not entitled to it. Again, that is the inherent risk of using a proxy service that has existed and will exist as long as proxies do. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.2247023809523805
                },
                {
                    "author_link": "https://gov.uniswap.org/u/heyJonBray",
                    "index": "275",
                    "likes": "3",
                    "time": "31/10/2020-23:21:11",
                    "content": "    green:  Duplicate airdrops are a problem. How many Uniswap users chose to go to Dharma later in order to save gas fees? Why give them twice the UNI? I see imminent freeloading. Why not reward twice Uniswap v1 and Uniswap v2 users? Retroactively giving away free stuff is less desirable when you are losing some of that free stuff. I can’t see how this benefits me, so I will reject this.   I totally agree with all your points, but it’s sad to see your decision based on how “this benefits me” over the community that you’re now a part of. Just looking at the overview of this entire forum, how many more posts there are about money and how few there are with novel ideas about governance systems is reflective that we brought so much of the negative into this new system. We’re so young as a community, and already we’ve brought the snakes into the garden. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.428030303030304
                },
                {
                    "author_link": "https://gov.uniswap.org/u/fery379",
                    "index": "276",
                    "likes": "2",
                    "time": "31/10/2020-23:23:38",
                    "content": "    heyJonBray:  No, DeFi is not about being fair.   Like I told you before, DeFi is a space of bare capitalism. You seem to agree now. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://gov.uniswap.org/u/heyJonBray",
                    "index": "277",
                    "likes": "2",
                    "time": "31/10/2020-23:36:19",
                    "content": "I’ve always agreed that DeFi is purist capitalism. When it comes to the system or community in charge of the allocation of resources that are a byproduct of gains from that capital, I believe there is much more nuance. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/heyJonBray",
                    "index": "278",
                    "likes": "4",
                    "time": "31/10/2020-23:42:03",
                    "content": "    UniT:  Using Dharma to unknowingly trade Uniswap was not joining the Uniswap journey. Those who used Dharma used Dharma , not Uniswap.  They were not early Uniswap community members. They were not on the Uniswap journey. They are Dharma users.  To the Dharma folks: perhaps create your own DHARMA token and airdrop to your users.   This is the most logical post in the thread. You don’t deserve a reward because someone or something that you used to perform a task for you interacted with a system. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.625
                },
                {
                    "author_link": "https://gov.uniswap.org/u/aru31",
                    "index": "279",
                    "likes": "4",
                    "time": "01/11/2020-09:16:25",
                    "content": "twitter / NadavAHollander/status/1322283182205489153 Why did the vote say extra hours even though there was only 1??? I was at work and my investment group and I were going to meet later because we saw 8 hours left on clock. Lost faith in this system. . . I thought this was fool proof (DEFI???) My colleges and I put a very large sum on here, and missed the vote. I feel like it was sabotage? I don’t want to say how many votes we control but we would of put the vote very close to pass at that point. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.698979591836735
                },
                {
                    "author_link": "https://gov.uniswap.org/u/aru31",
                    "index": "280",
                    "likes": "0",
                    "time": "01/11/2020-09:17:04",
                    "content": "I cant post link but its pinned on dharma twitter page. . . ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/mahdira",
                    "index": "283",
                    "likes": "0",
                    "time": "11/11/2020-17:04:47",
                    "content": "HI. i already voted, how can we vote again ? only uniswap can create topic to vote ? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/heyJonBray",
                    "index": "284",
                    "likes": "5",
                    "time": "23/11/2020-02:27:37",
                    "content": "    aru31:  Lost faith in this system. . .   How does one lose faith in a system that is essentially 28 days old? It is such a shame to see the amount of people who can’t see the forest for the trees. The gift that was bestowed upon us simply by virtue of UNI Gov being created is enormous. A team bootstrapped the largest DeFi project on Earth and then willingly gave up custody of it’s governance to the masses. There should by no means be any expectation that the system works in a way you deem fair. There’s no way a perfect protocol could have been implemented from the start, it is meant to grow organically. Please check yourself at the door and consider that you’re on the ground floor of a single part of the largest paradigm shift in finance history. Attitudes like this are entitled, short-sighted, and impatient. We can quite literally evolve this system into anything we want. Any feature that didn’t work as planned, rules that are arbitrary or outdated, even the contracts that run the system; with time we as a group can change things in a way that is more agile and less congested than traditional governance and voting models. But it’s not going to happen overnight, and it’s certainly not going to fix bugs, greed, “fairness”, or the list of other things complaining voices can’t stop going on about. If you’ve considered all this, and still don’t have faith in the system, do the community a favor while removing a big stressor from your life at the same time and find a good price to sell your UNI at. Because at the end of the day, regardless of how altruistic anyone says they are, the goal here is to make money. Plain and simple. That doesn’t mean we shouldn’t strive for a more inclusive and frictionless way to make money that can meet the specific demands of the people using/governing Uniswap, but it does mean that the community members doing the work need to be able to put this entire operation into perspective; otherwise we’re going to end up dragging the same problems from the old systems with us and ruin what would have otherwise been a perfect template for how we define and utilize value in this world. If you decide that you want to make this system which is barely even in it’s infancy better:  Take one large dose of reality, a light brushing of Game Theory, a dash of Social Engineering (to taste), large helping of Governing Dynamics, and one extremely open mind.  Change takes time, effort, and the ability to put your pride and ego to the side. It’s very much worth it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.628339140534262
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Amau39",
                    "index": "285",
                    "likes": "0",
                    "time": "16/02/2021-18:25:24",
                    "content": "OkTq, sukses, sir the proposal ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Salmawati1",
                    "index": "288",
                    "likes": "1",
                    "time": "10/03/2021-17:40:33",
                    "content": "I do not agree with your opinion, precisely by giving rewards to those who interact at Uniswap will increase the number of people who interact at Uniswap. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/toto",
                    "index": "289",
                    "likes": "1",
                    "time": "18/03/2021-06:40:06",
                    "content": "i do not agree opinion ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/litocoen",
                    "index": "290",
                    "likes": "1",
                    "time": "08/11/2021-12:07:31",
                    "content": "Is this retroactive airdrop now completely ruled out? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Buckerino",
                    "index": "291",
                    "likes": "0",
                    "time": "08/11/2021-15:47:16",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "62"
}