{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/layer-2-is-upon-us-back-to-discussing-the-fee-switch/13419",
            "title": "Layer 2 is upon us, back to discussing the fee switch! ",
            "index": 13419,
            "category": [
                "Proposal Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/burtrico",
                    "index": "1",
                    "likes": "1",
                    "time": "14/07/2021-15:31:56",
                    "content": "Discussion Goals:  Coming to a consensus on the best long term token value capture strategy Developing the framework of our token value capture strategy After step 2, we can discuss the small fee percentage to start with After step 3, we can discuss when to flip the switch  Based on our previous poll [POLL] How Would We Structure a Fee Reward?, many users voted for a buy back UNI and either burn or distribute value capture method. Distributing UNI creates sell pressure for the token similar to token issuance, so I do not believe that is ideal. Then I have recently learned more about buy back and burn methods … and well … its a horrible idea! For a detailed explanation on why, see the previous post that @jumnhy made: [POLL] How Would We Structure a Fee Reward? - #69 by jumnhy . Here is one paragraph from an article that he shared explaining the issue with a buy back and burn model: \" It’s not that you can’t grow without issuance, but without any new issuance, there isn’t as much of an incentive to continuously capitalize the system. As a token holder, you’re more likely to increase your contribution over time if there’s some dilution than if there’s none. With burning the incentive is worse, because you’re increasing the participation of token holders without requiring them to increase their investment. And whenever the price of the token does not immediately grow at the same rate as the burn (which is most of the time) burning actually decreases the overall market cap of the network . \" Stop Burning Tokens – Buyback and Make Instead — Placeholder In the short term, UNI would go up, but in the long term, UNI “voting tokens” would be burned at an unsustainable rate since we do not have new issuance for UNI tokens, that I know of. After skimming through the previous proposal discussion, it seems clear to me that distributing ETH to UNI holders appears to be the most reasonable solution. I have not yet dug deep into the mechanics of how MKR & ZRX distribute ETH to their governance token holders, but we can start there. One of the major issues with this method was high gas fees. Now with Optimism live though, gas fees are no longer a problem! Regardless, we want to develop a fee collecting and distributing strategy that will limit the code and limit the transactions for the sake of simplicity and security. For example, fees could be collected into a pool of some sort such as Balancer as @jumnhy previously stated, then distributed periodically (once every 1-2 weeks, month, etc) to UNI holders based on a snapshot or some method of tracking. Using a Uniswap pool to collect fees doesn’t really make sense since Uniswap is a DEX. We do not need to flip the switch tomorrow, but the UNI token needs some form of fee generation in order to sustain its value in the long term. The UNI token is not worthless as some haters say, it provides capital to the protocol in order to build a better Uniswap and Ethereum network through the UNI governance. In return, investors such as myself expect the UNI token value to increase. Note that we can set the percentage of fee to be collected very low to start with, so that LPs are not disincentivized. We can also provide other incentives to offset for fees collected. That is the second portion of this discussion though. Once Uniswap’s volume is through the roof on Layer 2 roll ups, we have no reason to not have a fee switch plan ready and waiting. ",
                    "links": [
                        "https://gov.uniswap.org/t/poll-how-would-we-structure-a-fee-reward/5790/69",
                        "https://www.placeholder.vc/blog/2020/9/17/stop-burning-tokens-buyback-and-make-instead"
                    ],
                    "GPT-summary": "The author of the post is explaining the need for a fee switch in the UNI token and discussing the best long-term token value capture strategy. The post also includes constructive criticism from a third party regarding the buyback and burn method and proposes distributing ETH to UNI holders as a more reasonable solution. The author also suggests developing a fee collecting and distributing strategy that will limit the code and transactions for simplicity and security. The post ends with a call to have a fee switch plan ready and waiting for when Uniswap's volume is through the roof on Layer 2 roll-ups.",
                    "GPT-proposal-categories": [
                        "Token economics",
                        "Privacy, Security and risk management",
                        "Interoperability and Scaleability",
                        "Board composition",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.408751578282828
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Buckerino",
                    "index": "2",
                    "likes": "2",
                    "time": "14/07/2021-16:26:56",
                    "content": "Yo, this was discussed like 2 weeks ago on the Uniswap Community Call and it was established that the best way to go around it would be to turn on the fee switch on V2 and instate a buyback and keep model. Actually, a lot of delegates are in favor of voting for such a proposal. Right now, I am waiting for Optimism to be fully launched and then we will proceed with a snapshot poll here on forums. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.607142857142857
                },
                {
                    "author_link": "https://gov.uniswap.org/u/burtrico",
                    "index": "3",
                    "likes": "0",
                    "time": "14/07/2021-16:47:34",
                    "content": "Awww, I see. Good to know! In that case, we can wait to see how that goes before discussing this topic any further. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.125
                }
            ]
        }
    ],
    "group_index": "103"
}