{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/swap-uni-for-eth-and-wbtc-and-provide-liquidity/9260",
            "title": "Swap UNI for ETH and wBTC and provide liquidity ",
            "index": 9260,
            "category": [
                "Consensus Check"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/Uni3",
                    "index": "1",
                    "likes": "7",
                    "time": "14/12/2020-16:00:30",
                    "content": "Instead of incentivizing LP we can use treasury to buy ETH and BTC and add permanent liquidity to Uniswap. Benefits: -We are swaping UNI for top assets which value will go up over time. -There is no dump of new tokens. (New tokens are backed with underlying asset) -We are earning more from every transaction and LP is growing organically. -No risk that someone can take liquidity from us. -As Bitcoin price and Ethereum price go up, the value of UNI assets go up as well. Risk: Is it wBTC really decentralized (safe)? It sounds as win win solution for me. Please write your thoughts on this idea. Thank you. ",
                    "links": [],
                    "GPT-summary": "The author proposes to use the treasury to buy ETH and BTC and add permanent liquidity to Uniswap instead of incentivizing LP. The post lists the benefits of this approach and also mentions the risk associated with using wBTC. The author seeks feedback on the idea.",
                    "GPT-proposal-categories": [
                        "Token economics",
                        "Interoperability and Scalability",
                        "Privacy, Security and risk management",
                        "None",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 7.232954545454545
                },
                {
                    "author_link": "https://gov.uniswap.org/u/g_dip",
                    "index": "2",
                    "likes": "7",
                    "time": "14/12/2020-21:52:50",
                    "content": "It’s an interesting idea, but I wouldn’t advocate doing it with UNI, it seems like we’d be selling our most valuable asset at a discount to do that. Instead I would like to explore taking the fees that accumulate to the UNI in the treasury to re-invest in LP pools PS - I’m saying this assuming that we stop doing large scale liquidity mining… ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 7.023809523809524
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Uni3",
                    "index": "3",
                    "likes": "2",
                    "time": "15/12/2020-02:07:24",
                    "content": "    g_dip:  it seems like we’d be selling our most valuable asset at a discount to do that.   Accumulating ETH and BTC sounds more like an investment, UNI price at the moment is pure speculation as there is not anything certain that allows us to make evaluation.     g_dip:  Instead I would like to explore taking the fees that accumulate to the UNI in the treasury to re-invest in LP pools   I agree that’s a great idea if we talk about BTC and ETH LPs but that is a few months away.     g_dip:  PS - I’m saying this assuming that we stop doing large scale liquidity mining…   Let’s not waist our assets on liquidity mining because:  It is not necessary at the moment Doesn’t give us a long term effect Dilutes every UNI holder by increasing supply.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.218253968253968
                },
                {
                    "author_link": "https://gov.uniswap.org/u/KitHab",
                    "index": "4",
                    "likes": "0",
                    "time": "19/12/2020-02:35:49",
                    "content": "Thank you, we totally agree with your policy. Respectfully yours: Director of the publishing house “Owl Fairy Tail” - individual entrepreneur Zelinsky Evgeny Petrovich. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Uni3",
                    "index": "5",
                    "likes": "1",
                    "time": "31/12/2020-02:51:37",
                    "content": "It’s interesting that no one is interesting in this! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.8125
                },
                {
                    "author_link": "https://gov.uniswap.org/u/zerocool",
                    "index": "6",
                    "likes": "5",
                    "time": "05/01/2021-20:23:29",
                    "content": "I think you’re on a valid track here, at least proposing to actively manage the UNI treasury in theory sounds like a good idea. In practice I’m not sure that it will be easy to coordinate managing the UNI treasury, given the barriers to passing proposals for this project in particular. Are there any governance token projects with community distribution that actively manage their treasury? Would be cool to see how others are doing it. EDIT: Looks like AAVE and SNX might actually do this - still need to learn more though, reading about it here: Maker Stability Module, inspired by Aave and Synthetix - Governance - MakerDAO Maybe we can put UNI in a Maker vault, and then lend the Dai on Compound. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.666666666666666
                },
                {
                    "author_link": "https://gov.uniswap.org/u/egk10",
                    "index": "8",
                    "likes": "3",
                    "time": "20/01/2021-14:32:57",
                    "content": "great proposal Having own LP tokens will ensure that liquidity will never be lacking ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Uni3",
                    "index": "9",
                    "likes": "1",
                    "time": "28/01/2021-00:32:40",
                    "content": "Swap treasury for ETH and BTC and lock permanent liquidity. This way, we will grow with ETH and BTC, we will earn more and more fees every day… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/CWhite",
                    "index": "10",
                    "likes": "1",
                    "time": "16/05/2021-04:40:49",
                    "content": "I  this idea. UNIs long term holders are providing a loyal strong base to build around. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.895833333333333
                }
            ]
        }
    ],
    "group_index": "520"
}