{
    "poll_list": [
        {
            "id": "QmWe6Krc81pkCtQFbd2AxytFCp1imLGUnFTEEom9YNwFte",
            "title": "Can UGP increase their Q2 budget to $1.5M?",
            "discussion": "",
            "body": "The UNI Grants Program would like to double the Q2 budget to $1.5M in order to match the Uniswap Labs bug bounty program with $500,000 worth of UNI from the Committee multisig. Due to the price change of UNI, the funds are already available and will not require a formal transfer of funds from community treasury.  \n\nHowever, as these funds were not a part of our original proposal, we are seeking approval via a 7 day time-bound Snapshot vote, after which UGP will act according to the majority vote. ",
            "choices": [
                "Approve",
                "Deny"
            ],
            "scores": [
                7036339.680800256,
                70.22498717711055
            ],
            "start": 1616770800,
            "end": 1617422340,
            "snapshot": "12115392",
            "state": "closed",
            "author": "0xA2BF1B0a7E079767B4701b5a1D9D5700eB42D1d1",
            "space": {
                "id": "uniswap",
                "name": "Uniswap"
            }
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/ugp-v3-bug-bounty-contribution/11179",
            "title": "UGP v3 Bug Bounty contribution ",
            "index": 11179,
            "category": [
                "Temperature Check"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/kenneth",
                    "index": "1",
                    "likes": "17",
                    "time": "26/03/2021-15:44:23",
                    "content": "With the announcement of Uniswap v3, the Uniswap Labs team has posted a $500,000 bug bounty program for the reporting of any bugs that can lead to the potential loss of LP funds as well as discretionary rewards for lower severity bugs. We believe the security of v3 contracts is critical to continuing to grow the UNI ecosystem around, which is part of the stated mission of the UNI Grants Program that governance approved in Q4 2020. The UNI Grants Program would like to double the UGP Q2 budget to $1.5M in order to match the Uniswap Labs bug bounty program with $500,000 worth of UNI from the Committee multisig. As these funds were not a part of our original proposal, we are outlining our rationale and process for its approval via a Snapshot temperature check. Rationale: In Q4 2020, UNI governance approved a transfer of $1.5M from treasury to the Uniswap Grants Program multisig. Since then, the following has happened:  In Q1 2021, UGP has successfully funded 23 projects, deploying the targeted $750,000 worth of UNI. You can read more about the details of our Q1 grants here. In Q2, UGP is on track to deploy $750,000 worth of UNI and will be updating our process to make grant approvals more frequent. Read more on our request for proposals for Q2 here. The value of UNI in the multisig has grown from approximately ~$1.5M to ~$14M at the time of this writing  Separately, v3 introduces new market dynamics and customizable liquidity provisions with both increased gains and associated risk, putting more pressure to ensuring the security of v3 contracts. While several audits have been completed, there may be bugs and exploits that have been overlooked. Given the mission of the grants program, our progress to date, and the importance of security for users funds, we believe the bounty match would be an appropriate use of funds entrusted to us. Process: There has not yet been a precedent set for governance decisions that do not require any code or additional actions from treasury. Therefore to approve the match, we are seeking community support through a Snapshot temperature check. We’re employing an open voting period of 7 days starting today, 03/26/21 until 04/02/21, after which UGP will act according to the majority vote! Unlike a full governance proposal, this process is meant to be lightweight because the funds are already sitting in the UGP multisig and as such, there will be no minimum threshold for voting. Please submit your votes within the next 7 days here and let us know your thoughts on the lite-proposalTM! Snapshot Temp-Check ",
                    "links": [
                        "https://www.notion.so/UGP-Q1-Updates-a24ad2d072184120a06ce3ad330385eb",
                        "https://www.notion.so/RFPs-Challenges-3be614ba4e504b5caeee7b0159e64a42",
                        "https://snapshot.org/#/uniswap/proposal/QmWe6Krc81pkCtQFbd2AxytFCp1imLGUnFTEEom9YNwFte"
                    ],
                    "GPT-summary": "The author of the proposal is explaining the need to double the UGP Q2 budget to $1.5M to match the Uniswap Labs bug bounty program with $500,000 worth of UNI from the Committee multisig. The proposal outlines the rationale and process for its approval via a Snapshot temperature check. The post also highlights the importance of security for users' funds and the need to ensure the security of v3 contracts. The proposal seeks community support through a Snapshot temperature check.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Privacy, Security and risk management",
                        "Token economics",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.024209486166008
                },
                {
                    "author_link": "https://gov.uniswap.org/u/dennisonb",
                    "index": "2",
                    "likes": "2",
                    "time": "26/03/2021-17:03:26",
                    "content": "I really like this idea, but I wonder how it would be implemented: Would the grants committee be responsible for determining what gets a bug bounty payout? Would the current funds be delegated to a different committee to handle issues like this? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/kenneth",
                    "index": "3",
                    "likes": "2",
                    "time": "26/03/2021-17:21:31",
                    "content": "    dennisonb:  Would the grants committee be responsible for determining what gets a bug bounty payout?   Great question! We have to acknowledge our own blindspots in our technical expertise. UGP seeks to match the bounties 1:1 with the Uniswap Labs team instead of us evaluating the individual submissions. v3 brings a lot of attention to something new both on the contracting side as well as the financial side so security is of utmost importance. Looking at past contracts and their exploits, we’d want to ensure users are as safe as can be. With UNI price having increased quite a decent amount, we wouldn’t be asking for more funds, just approval from the community to spend what’s already in the multisig for what we feel is quite important. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.355429292929293
                },
                {
                    "author_link": "https://gov.uniswap.org/u/g_dip",
                    "index": "4",
                    "likes": "6",
                    "time": "26/03/2021-20:46:43",
                    "content": "I definitely support bigger bounties - it’s going to be ~$4B soon enough so we may as well do the best we can before launch. Can I suggest that instead of a simple matching program, you expand the audience of hackers by using another platform to run a parallel program? For instance, in the launch process of Multi-Collateral Dai we had success with HackerOne (they detected a critical bug). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.8125
                },
                {
                    "author_link": "https://gov.uniswap.org/u/kenneth",
                    "index": "5",
                    "likes": "2",
                    "time": "30/03/2021-17:29:31",
                    "content": "    g_dip:  Can I suggest that instead of a simple matching program, you expand the audience of hackers by using another platform to run a parallel program?   yes would love to discuss! DMing you! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 6.302083333333334
                },
                {
                    "author_link": "https://gov.uniswap.org/u/brilj310",
                    "index": "7",
                    "likes": "0",
                    "time": "23/10/2021-06:17:24",
                    "content": "Well yes. Now I am actualy unemploied and I am opening my own company. Until then I have plenty of time to work on your domand. So, doo tell what bug you want me to eliminate and where. It shouldn’s take long if the code is not codependent to itself ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party offering to help with proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.375
                }
            ]
        }
    ],
    "group_index": "35"
}