{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/deploy-uniswap-v3-to-xdai-chain/12508",
            "title": "Deploy Uniswap v3 to xDai Chain ",
            "index": 12508,
            "category": [
                "Proposal Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/AndrewG",
                    "index": "1",
                    "likes": "12",
                    "time": "26/05/2021-19:09:41",
                    "content": "After reading through other deployment proposals I’d like to submit xDai Chain for consideration. The xDai stable-payments chain provides a unique scaling opportunity and an attractive option for Uniswap v3 deployment. A stable trading environment with low, predictable fees creates new scenarios and use cases for trading not available on other networks. xDai is upgraded to the latest EVM patchset (Berlin HF now active) and supported by 2 clients - Open Ethereum and Nethermind. The current validator set features projects actively engaged within the Ethereum ecosystem. The energy-efficient delegated Proof of Stake consensus is currently secured by 16 validator pools and 270 active delegators (as of 5/26/2021) with additional validator candidates planning to onboard in the near term. xDai has been in production since 2018 and received support from the Ethereum community as a neutral and secure scaling solution. xDai depends on multi-chain interoperability provided by several fully audited bridges featuring fast withdrawals (typically confirmed within minutes). A distributed governance board oversees changes related to bridge functionality and security. The xDai chain recently increased block capacity by more than 30% and is supporting a large range of projects including high volume applications like Perpetual Protocol and dark forest. The chain is available to assist with scaling and ready to support Uniswap v3. As other proposals have mentioned, there is much to gain in providing swaps on additional EVM compatible networks. xDai should be considered in this conversation as a viable and available deployment option for Uniswap v3. ",
                    "links": [
                        "https://www.xdaichain.com/for-users/governance#governance-board",
                        "https://perp.fi/",
                        "https://zkga.me/",
                        "https://gov.uniswap.org/t/uni-v3-licensing-general-discussion/12620"
                    ],
                    "GPT-summary": "The author of the proposal is explaining why xDai Chain is a suitable option for deploying Uniswap v3. They highlight the unique scaling opportunity and stable trading environment with low fees that xDai Chain provides. They also mention the latest EVM patchset, the active validator set, and the multi-chain interoperability provided by fully audited bridges. A 3rd party gives entirely positive feedback on the proposal, extending to the proposal and asking questions about it. The post can be seen as advertising the proposal to the Uniswap community.",
                    "GPT-proposal-categories": [
                        "Interoperability and Scalability",
                        "Token economics",
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.611038961038961
                },
                {
                    "author_link": "https://gov.uniswap.org/u/justAnotherGuy",
                    "index": "2",
                    "likes": "3",
                    "time": "26/05/2021-20:08:58",
                    "content": "With the xDai omni bridge, this might actually be one of the most functional sidechains to deploy on. However while xDai has a lot of useful infrastructure that other sidechains just don’t have yet (i.e the omnibridge and upcoming nft bridge), at the same time it is still super young in terms of its DeFi ecosystem and on-chain liquidity. I know that sushi has partnered with xDai to provide liquidity incentives in the near future, to the tune of $2M, which I’m sure will increase the amount of liquidity on-chain to some degree - but this could very well be a short lived liquidity boom until there is a more robust DeFi ecosystem with lending protocols and such. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.8601190476190474
                },
                {
                    "author_link": "https://gov.uniswap.org/u/whatsnext2020",
                    "index": "3",
                    "likes": "3",
                    "time": "27/05/2021-06:25:21",
                    "content": "I’m definitely liking the idea of UNI V3 on XDAI Chain ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/CryptoWonk",
                    "index": "4",
                    "likes": "2",
                    "time": "27/05/2021-09:43:28",
                    "content": "I really think xDai Chain would be the best sidechain for Uniswap v3 to deploy on. It is so under the radar, but in my opinion is the best one. I think this idea would be a win-win. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party is advertising proposal"
                    ],
                    "Sentiment": 8.666666666666668
                },
                {
                    "author_link": "https://gov.uniswap.org/u/RodAthens",
                    "index": "5",
                    "likes": "2",
                    "time": "27/05/2021-16:12:14",
                    "content": "Completely support this proposal ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/rekt",
                    "index": "6",
                    "likes": "2",
                    "time": "27/05/2021-18:28:44",
                    "content": "Supporting this 100% and six ways to Sunday. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.uniswap.org/u/refri",
                    "index": "7",
                    "likes": "0",
                    "time": "31/05/2021-22:44:44",
                    "content": "Would appreciate this very much. Have most of my liquidity still on uniswap and balancer on mainchain but for trading I have moved mainly to xDAI already, would be glad if uniswap v3 will also be available there. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.826666666666666
                },
                {
                    "author_link": "https://gov.uniswap.org/u/cvmars",
                    "index": "8",
                    "likes": "1",
                    "time": "04/06/2021-08:16:16",
                    "content": "I’d still like to see it deployed in layer 2. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/amitu",
                    "index": "9",
                    "likes": "1",
                    "time": "06/06/2021-14:35:40",
                    "content": "very good idea. how can i vote in favour for this ? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.549999999999999
                }
            ]
        }
    ],
    "group_index": "69"
}