{
    "poll_list": [
        {
            "id": "0xe3d59b3439ac0519b02ff39606e0ad571cc9fa7a05b334b6f87df09b2c883879",
            "title": "Temperature Check - Deploy Uniswap V3 on Harmony through an Additional Use Grant to Hermes DeFi",
            "discussion": "",
            "body": "Dear Uniswap community,\n\nSince our initial proposal submission 9 days ago to bring Uniswap V3 technology to Harmony, we have seen an extremely positive response from both the Harmony and Uniswap communities. We have integrated community feedback and compiled a revised proposal and have posted it on the Uniswap governance forum: https://gov.uniswap.org/t/temperature-check-deploy-uniswap-v3-on-harmony-through-an-additional-use-grant-to-hermes-defi/16128\n\nIn summary, Hermes DeFi is requesting an Additional Use grant from Uniswap to deploy Uniswap V3 based smart contracts to power a new AMM/DEX on the Harmony blockchain.\n\nIn exchange for this permission, the Uniswap DAO will receive:\n1. A 10% allocation of HERMES tokens\n2. 25% of platform trading fees, returned as IRIS (decreasing 5% each year for the next 5 years)\n3. 50% of platform trading fees for the IRIS/1UNI pair, which will have a dedicated farm for the foreseeable future.\n4. 2% of IRIS supply (governance token of Hermes).\n5. Lending and borrowing support for 1UNI upon the launch of our lending market.\n6. The ability to bond 1UNI to earn HERMES as a mechanism of protocol-owned liquidity.\n",
            "choices": [
                "Yes, grant the license.",
                "No, do not grant the license."
            ],
            "scores": [
                8370.853437946993,
                1742.828494209686
            ],
            "start": 1644421200,
            "end": 1644853200,
            "snapshot": "14172713",
            "state": "closed",
            "author": "0x98e3623bCa45BF01D58E833811882777C8C015F8",
            "space": {
                "id": "uniswap",
                "name": "Uniswap"
            }
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/temperature-check-deploy-uniswap-v3-on-harmony-through-an-additional-use-grant-to-hermes-defi/16128",
            "title": "Temperature Check - Deploy Uniswap V3 on Harmony through an Additional Use Grant to Hermes DeFi ",
            "index": 16128,
            "category": [
                "Temperature Check"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/HermesDeFi",
                    "index": "1",
                    "likes": "11",
                    "time": "09/02/2022-15:09:59",
                    "content": " Temperature Check: For your convenience, we have compiled our proposal with the additional changes from community feedback into this new post. In this second stage of the ‘revised governance model’, we are submitting this temperature check as a 5 day snapshot vote. To pass, Hermes DeFi needs 5M UNI ‘YES’ votes. If this is achieved, a full governance proposal will be submitted (2.5M delegated to propose, 40M to pass). Snapshot Vote: Snapshot Initial Proposal: Deploy Uniswap V3 on Harmony through an Additional Use Grant to Hermes DeFi Community Feedback Revision: Deploy Uniswap V3 on Harmony through an Additional Use Grant to Hermes DeFi - #15 by HermesDeFi  Project Overview: Harmony and Hermes DeFi are requesting an Additional Use Grant for the Uniswap V3 core to develop and deploy a next-generation AMM on the Harmony blockchain. Uniswap would receive a 10% allocation of the HERMES token, vested over one year, in addition to other financial incentives. Long term value will be derived from increased user base, expansion to the Harmony blockchain and returns from project investments.  Abstract: Harmony is a quickly growing L1 blockchain with advanced technology that offers trustless bridges, 2 second transaction finality, and scalability using a sharded proof-of-stake mechanism. Since June of 2019, their native token, $ONE has grown to 3.5 Billion market cap with around 1B TVL in DeFi protocols. However, the Harmony blockchain lacks a comprehensive, easy-to-use, and efficient DeFi platform. Hermes DeFi is an experienced team of developers that wants to deploy a Uniswap-V3 DEX/AMM on the Harmony blockchain. The generational enhancements of this framework, combined with a great need for a reliable DeFi platform on Harmony, offer an extremely appealing opportunity. Hermes DeFi has worked closely with the Harmony team, and recently was approved for a 50K launch grant (4/5 milestones achieved) to develop this platform. By allowing Hermes to deploy this framework, Uniswap will be able to expand their reach to a new blockchain without any additional development time. We would continue to work with Harmony and Uniswap directly to optimize our platform.  Motivation: With respect to Hermes’ strategic vision and why we consider that Harmony represents an appealing expansion, consider the following aspects. At the moment, the majority of projects on Harmony relate to the Earn2Play / GameFi / NFTs sectors. These projects are specialists in creating a large user base due to their specialized development in graphics, interfaces, and large and active communities. One issue these projects can have is the maintenance of stable and attractive liquidity so that large investors can invest efficiently. Currently, the solutions presented by the current DEX’s available on Harmony are not efficient enough to meet this goal, so bringing a Uniswap V3-based DEX has the potential to fill a large need within the Harmony blockchain.This perfectly aligns to Uniswap’s goals to expand to new users outside of the traditional DeFi sector. Hermes has made substantial progress over the past month marrying other Harmony projects to the DeFi systems granted through the $PLTS token. The $PLTS token launched on December 27th, and as of today, Hermes holds around $7.3M in total value locked, distributed across 8 native harmony tokens in our pools and farms. We have demonstrated that we are capable of making stellar connections within Harmony quickly, and would make powerful partners with new Harmony projects that host liquidity on our platform.  Specification and Rationale:  Hermes DeFi overview: Hermes DeFi is an easy to use and powerful decentralized finance platform that empowers users to build their wealth through liquidity aggregation services and our native Harmony reward token, PLUTUS (PLTS). After a successful launch on the Polygon blockchain with our IRIS governance token, our team identified Harmony as a fantastic opportunity for expansion, as it is currently underserved by robust DeFi protocols. To this end, we have upgraded and deployed our new website and smart contract system on the Harmony blockchain, accessible at https://plutus.hermesdefi.io. The current tokenomics of Hermes DeFi revolve around two tokens, $IRIS and $PLTS. IRIS was launched on the Polygon chain, and has recently become cross-chain compatible with Harmony through our partnership with Anyswap/Multichain. It was distributed through our farming system of pools and farms. Our farming contracts were audited by Paladin https://paladinsec.co/projects/hermes-defi/ as part of our commitment to safety. At Hermes, IRIS holders will always receive rewards and hold governance power. In our current tokenomic model of The Hermes Protocol, IRIS will receive 65% of platform fees. PLUTUS (PLTS) is our current farming reward token that will grant holders a preferred swap into our final protocol. Plutus contains multiple deflationary mechanisms to help sustain token value during the farming period, which have proven to be remarkably effective. First, PLUTUS transactions are taxed at a rate of 3%, 2% of which is converted to the 1DAI stablecoin and routed to the bank and 1% is burned forever. The bank is a new system that allows users to lock their PLUTUS tokens, removing them until the launch of Hermes Protocol, while earning stable coin and partner token rewards funded by the transaction tax as well as performance fees from our auto-compounding vaults. In our current tokenomic model of The Hermes Protocol, 2% of HERMES will be directed towards enhancing rewards for Bank participants. The emissions of PLUTUS have been designed to bridge the time gap until the development and launch of Hermes Protocol. Hermes DeFi is composed of eight core team members that have undertaken projects on both the Polygon and Harmony blockchains with great success. All core team members have been doxxed to Harmony, and two of us are publicly doxxed. Project leader, Roberto Quintero, has well-established connections within many aspects of the crypto community along with a business management degree at University of Porto. CMO, Austin Hovland, has experience with marketing strategy, data analytics, linux system administration, and a PhD in Bioinformatics from Cornell University. Two back end developers, Wendel and PestCtrl, have experience with DeFi 1.0/2.0, market lending, and are very familiar with Uniswap contracts. Two front end developers, Miguel and Marvin, who have built customized user interfaces from the ground up, backed by their work in consolidated companies in Berlin and Madrid. Graphic designer, Kami, is in charge of the graphics in social networks and internal documents, he is fluent in all Adobe software, illustration, and video production. Communications Director, Aaron B, his expertise in data analysis and extensive connections with Harmony projects make him a perfect fit for this position. Throughout our entire journey together Hermes has committed to be safe, transparent, and fast. We deployed our first contracts on the Harmony blockchain in December 2021, and have grown to an active user base of almost 4,400 (along with 2,400 Discord members) since then. Measuring our growth on our website using Google Analytics shows almost a three-fold increase in active users over the past month (Dec 27-January 27). If this pace of growth continues, we expect to surpass 2,500 daily users within the next month. We have deployed enhanced safety procedures including multi-sig wallets for our treasury and grant funds. Our commitment to the Harmony blockchain runs deep. Recently, we have deployed our own validator node and RPC endpoint for the Harmony blockchain and are now serving over 25M requests daily. We recently have been noticed as the second most influential Harmony Dapp in a Twitter social analysis, with over 428K Tweet impressions from the last month. We have the skills, community insight, and momentum to successfully deploy a Uniswap V3 core based AMM/DEX and bring its many benefits to the Harmony blockchain.  About Harmony: Harmony is an open, decentralized, and fast blockchain. Our mainnet runs Ethereum applications with 2-second transaction finality and 100 times lower fees. Our secure bridges offer cross-chain transfers with Ethereum, Binance and 3 other chains. Build on Harmony, bridge to all chains. We are an open platform for your assets, collectibles, identity, and governance. Since going live on Mainnet in June of 2019, the network has produced 30M+ blocks with 477 million transactions in publicly traded, native ONE tokens. The ONE token has reached a market cap of $3.5B, joining the Top 50 in CoinMarketCap in October of 2021. HRC-20 tokens launched on Harmony boasts a DeFi ecosystem with a total TVL of over $1.3 billion, including stakes, according to DefiLlama. With over 700,000 unique wallets, 331,500 followers on Twitter, and 20,219 members on Discord, Harmony is a thriving and growing community. Harmony is an EVM-compatible, sharded Proof of Stake smart contract blockchain. Our Fast Byzantine Fault Tolerant (FBFT) consensus protocol, combined with random state sharding and Boneh–Lynn–Shacham (BLS) constant-sized signatures allows Harmony to achieve finality in one block or roughly two seconds – compared to optimistic finality in Solana or Avalanche, or 6 seconds for Cosmos, or 60 seconds for Polkadot. A normal transfer costs only about 0.000021 ONE. Harmony was the first sharding-based L1 on a mainnet. It has solved the trilemma of decentralization-security-scalability by uniformly scaling with shards. The Harmony Foundation recently announced one of the largest Ecosystem Grant Funds worth $300M to help attract industry leading projects such as Uniswap into the Harmony ecosystem. Other industry leaders like Sushi and Curve have launched into Harmony in Q2 and Q3 2021 respectively, while Aave governance voted to approve launching on Harmony, currently targeted to roll out at the end of Q4 2021. The Harmony blockchain has transparent development, and there are a number of upcoming major catalysts that are expected to drive new waves of adoptionation. Firstly, we are deploying trustless bridges to both Bitcoin and Etherum, increasing the flow of capital available to the Harmony blockchain. This would also enable trustless bridging of the Uniswap token to Harmony. Additionally, Harmony will aim to enable Apple Pay and Bank Wire on 1Wallet, opening up trusted avenues for fiat conversion. We have also recently enabled Chainlink integration to support more robust lending markets, and there are numerous other advancements already under development.  Proposal: In this proposal, Hermes DeFi is seeking an Additional Use Grant for the Uniswap V3 core contracts on which to build an AMM/DEX platform on the Harmony blockchain. In return, we are prepared to offer partial project ownership to the Uniswap DAO, realized in an allocation of 10% of our HERMES token, vested over the course of one year, as well as incentives directly tied to the growth of our platform. In addition to the 10% HERMES allocation, we will 1) dedicate 25% of platform trading fees to the Uniswap DAO (decreasing 5% each year). 2) Host a IRIS/1UNI farm on Harmony in perpetuity, directly rewarding Uniswap investors that stake at Hermes. Additionally, the Uniswap DAO would receive 50% of all platform fees derived from this trading pair. 3) Allocate 2% of IRIS’s total supply to the Uniswap DAO upon passing of our proposal. 4) Enable 1UNI lending on our platform, and 5) enable 1UNI bonding for Hermes. In such an agreement, the Hermes DeFi team will deploy, manage, and grow the Uniswap user base on the Harmony blockchain. The growth of our platform will directly benefit the Uniswap DAO. We expect to complete core contract development, auditing, and deployment by March/April of 2022. Additional facets that will expand upon this codebase are the addition of lending markets, NFT staking, and The Hermes DeFi team is committed to transparency, and we will provide any and all information required to ensure that the legality, security, and ownership of this ecosystem is protected.  1600×1131 234 KB  Benefits: The DeFi ecosystem within Harmony is currently composed of three major players, but all of these ecosystems have inefficiencies and leave a large market opportunity for Uniswap to expand to one of the fastest growing blockchains with advanced technology. Harmony, despite its large user base, has more activity within NFTs and GameFi, and many traditional needs of a DeFi ecosystem (Swapping, High-Frequency Trading, Bridging, Lending and Borrowing) have yet to be elegantly and efficiently integrated. Many of the new members of the Harmony community are unfamiliar with basic concepts of AMMs, and the Hermes community focuses on education as a primary goal. As such, there is a large user base with untapped potential drawn to the Harmony ecosystem from other projects. Uniswap has little to lose from this proposal, as it only requires approval for Hermes DeFi to expand upon the Uniswap V3 framework that has already been developed. In addition, Hermes has offered significant long-term financial incentives for the Uniswap DAO. Conclusions: The Harmony blockchain represents an attractive market currently underserved by DeFi technology. Uniswap should, through the operation facilitated by Hermes DeFi and supported by the official Harmony development team, deploy Uniswap V3 to the Harmony blockchain. Doing so will directly benefit the Uniswap DAO by expanding their user base, earning financial rewards through ownership of this platform, and greatly benefit a quickly-expanding blockchain. Voting: Snapshot Vote Yes, grant Hermes DeFi an Additional Use Grant License. No, do not grant Hermes DeFi an Additional Use Grant License. ",
                    "links": [
                        "https://gov.uniswap.org/t/deploy-uniswap-v3-on-harmony-through-an-additional-use-grant-to-hermes-defi/16001",
                        "https://gov.uniswap.org/t/deploy-uniswap-v3-on-harmony-through-an-additional-use-grant-to-hermes-defi/16001/15",
                        "https://bit.ly/3rdUKfV",
                        "https://www.harmony.one/",
                        "https://defillama.com/chain/Harmony",
                        "https://talk.harmony.one/t/hermes-defi-the-hermes-protocol/10339",
                        "https://gov.uniswap.org/t/building-uniswaps-moat-attracting-non-defi-developers/12419",
                        "https://plutus.hermesdefi.io/app",
                        "https://bit.ly/3rdUKfV",
                        "https://bit.ly/3rdUKfV",
                        "https://paladinsec.co/projects/hermes-defi/",
                        "https://plutus.hermesdefi.io/app",
                        "https://twitter.com/hermesdefi/status/1489335733987024902?s=20&t=yWY-aRuJI8JmwWThSqrujQ",
                        "https://bit.ly/3rdUKfV",
                        "https://twitter.com/hermesdefi/status/1489335733987024902?s=20&t=yWY-aRuJI8JmwWThSqrujQ",
                        "https://twitter.com/hermesdefi/status/1487520800395513856?s=20&t=0PyiSB0FXoCjIY6Kk_XKlg",
                        "https://hermes-defi.gitbook.io/plutus/bonus/hermes-defi-rpc",
                        "https://twitter.com/HarmonyOneDaily/status/1490275974252228610",
                        "https://medium.com/harmony-one/2-seconds-block-time-on-harmony-mainnet-aba78ee5643f",
                        "https://bridge.harmony.one/",
                        "https://coinmarketcap.com/currencies/harmony/",
                        "https://defillama.com/chain/Harmony",
                        "https://docs.harmony.one/home/general/technology/key-features",
                        "https://open.harmony.one/300m-on-bounties-grants-daos",
                        "https://open.harmony.one/strategy-roadmap",
                        "https://open.harmony.one/strategy-roadmap/launch-dates-weekly-updates/bitcoin-bridge",
                        "https://open.harmony.one/strategy-roadmap/launch-dates-weekly-updates/trustless-ethereum-bridge",
                        "https://open.harmony.one/strategy-roadmap/launch-dates-weekly-updates/1wallet-with-apple-pay-bank-wire",
                        "https://docs.harmony.one/home/developers/tools/oracles/chainlink",
                        "https://gov.uniswap.org/t/deploy-uniswap-v3-on-harmony-through-an-additional-use-grant-to-hermes-defi/16001/15",
                        "https://global.discourse-cdn.com/business6/uploads/uniswap1/original/2X/8/8b21be9a651c2bc3586ead9658d4b238da72876f.jpeg",
                        "https://snapshot.org/#/uniswap/proposal/0xe3d59b3439ac0519b02ff39606e0ad571cc9fa7a05b334b6f87df09b2c883879"
                    ],
                    "GPT-summary": "The post is a proposal by Hermes DeFi to deploy Uniswap V3 on the Harmony blockchain through an additional use grant. The proposal includes details about the project overview, motivation, specification and rationale, benefits, and conclusion. The post also includes a snapshot vote for the community to approve the proposal. The post explains the benefits of the proposal and offers long-term financial incentives for the Uniswap DAO. The post also includes constructive criticism from the community feedback and extends an invitation to collaborate with new Harmony projects.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Interoperability and Scaleability",
                        "Smart contract updates",
                        "Community and engagement",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.654687822098536
                },
                {
                    "author_link": "https://gov.uniswap.org/u/RuckiTV",
                    "index": "2",
                    "likes": "4",
                    "time": "09/02/2022-18:48:38",
                    "content": "Based on the advantages for Uniswap, I am definitely in favor of a license for Hermes. This will further increase Uniswap’s treasury. Let everyone know and vote in the snapshot voting. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/kostissss",
                    "index": "3",
                    "likes": "5",
                    "time": "09/02/2022-19:08:36",
                    "content": "I think the fees that we will earn  a lot from the pool in addition with the added liquidity from the 1UNI/IRIS pool . Just voted btw  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Maba078",
                    "index": "4",
                    "likes": "6",
                    "time": "09/02/2022-19:14:38",
                    "content": "I am thrilled to see the vision, plan and so far execution of the Hermes platform. The grant to use V3 will benefit both Hermes and Uniswap through growth of the Uni treasury as well as enabling Hermes to take the next step forward with their roadmap. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.166666666666667
                },
                {
                    "author_link": "https://gov.uniswap.org/u/pbjclimbing",
                    "index": "5",
                    "likes": "5",
                    "time": "09/02/2022-21:08:29",
                    "content": "I have held UniSwap since the airdrop and have been using Harmony ONE for ~6 months. I don’t see the downside in UniSwap granting a license to use V3 on Harmony ONE. The Harmony Foundation has basically said that they are not going provide liquidity for a new dex directly and won’t be the front runners to get V3 on Harmony. This means that essentially another outfit will have to contract with UniSwap to get V3 on Harmony. The main DEXs are Sushiswap, ViperSwap, and DefiKingdoms. ViperSwap is a one man team that heavily modified V2 and many of the DEXs including DefiKingdoms are a fork of it. DefiKingdoms is focusing on their game, not their dex. That essentially leaves a new player to be the one that V3 would go on. I think the Hermes has done a good job in forming relationships with many of the up and coming projects on Harmony. This relationship before they are a dex is going to allow them to have projects move liquidity to them. This is not the normal process a dex takes and I think will work. I think the revised proposal is a good one for UniSwap. As a UniSwap holder I am looking for a combination of a good offer and a team that can make a great product that gets used and becomes one of the premier DEXs on a blockchain. I am not look for an amazing offer with an average or below average team/concept. I would be happy moving forward with Hermes on Harmony ONE ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.339314194577352
                }
            ]
        },
        {
            "thread_link": "https://gov.uniswap.org/t/deploy-uniswap-v3-on-harmony-through-an-additional-use-grant-to-hermes-defi/16001",
            "title": "Deploy Uniswap V3 on Harmony through an Additional Use Grant to Hermes DeFi ",
            "index": 16001,
            "category": [
                "Proposal Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/HermesDeFi",
                    "index": "1",
                    "likes": "19",
                    "time": "31/01/2022-18:52:04",
                    "content": " Project Overview: Harmony and Hermes DeFi are requesting an Additional Use Grant for the Uniswap V3 core to develop and deploy a next-generation AMM on the Harmony blockchain. Uniswap would receive a 10% allocation of the HERMES token, vested over one year. Long term value will be derived from increased user base, expansion to the Harmony blockchain and returns from project investments.  Abstract: Harmony is a quickly growing L1 blockchain with advanced technology that offers trustless bridges, 2 second transaction finality, and scalability using a sharded proof-of-stake mechanism. Since June of 2019, their native token, $ONE has grown to 3.5 Billion market cap with around 1B TVL in DeFi protocols. However, the Harmony blockchain lacks a comprehensive, easy-to-use, and efficient DeFi platform. Hermes DeFi is an experienced team of developers that wants to deploy a Uniswap-V3 DEX/AMM on the Harmony blockchain. The generational enhancements of this framework, combined with a great need for a reliable DeFi platform on Harmony, offer an extremely appealing opportunity. Hermes DeFi has worked closely with the Harmony team, and recently was approved for a 50K launch grant to develop this platform. By allowing Hermes to deploy this framework, Uniswap will be able to expand their reach to a new blockchain without any additional development time. We would continue to work with Harmony and Uniswap directly to optimize our platform.  Motivation: With respect to Hermes’ strategic vision and why we consider that Harmony represents an appealing expansion, consider the following aspects. At the moment, the majority of projects on Harmony relate to the Earn2Play / GameFi / NFTs sectors. These projects are specialists in creating a large user base due to their specialized development in graphics, interfaces, and large and active communities. One issue these projects can have is the maintenance of stable and attractive liquidity so that large investors can invest efficiently. Currently, the solutions presented by the current DEX’s available on Harmony are not efficient enough to meet this goal, so bringing a Uniswap V3-based DEX has the potential to fill a large need within the Harmony blockchain.This perfectly aligns to Uniswap’s goals to expand to new users outside of the traditional DeFi sector. Hermes has made substantial progress over the past month marrying other Harmony projects to the DeFi systems granted through the $PLTS token. The $PLTS token launched on December 27th, and as of today, Hermes holds around $2.3M in total value locked, distributed across 8 native harmony tokens in our pools and farms. We have demonstrated that we are capable of making these connections quickly, and would make powerful partners with new Harmony projects that host liquidity on our platform.  Specification and Rationale:  Hermes DeFi overview: Hermes DeFi is an easy to use and powerful decentralized finance platform that empowers users to build their wealth through liquidity aggregation services and our native Harmony reward token, PLUTUS (PLTS). After a successful launch on the Polygon blockchain with our IRIS cross governance token, our team identified Harmony as a fantastic opportunity for expansion, as it is currently underserved by robust DeFi protocols. To this end, we have upgraded and deployed our new website and smart contract system on the Harmony blockchain, accessible at https://plutus.hermesdefi.io. The tokenomics of Hermes DeFi revolve around two tokens, $IRIS and $PLTS. IRIS was launched on the Polygon chain, and has recently become cross-chain compatible with Harmony through our partnership with Anyswap/Multichain. It was distributed through our farming system of pools and farms. Our farming contracts were audited by Paladin https://paladinsec.co/projects/hermes-defi/ as part of our commitment to safety. At Hermes, IRIS holders will always receive rewards and hold governance power. PLUTUS is our current farming reward token that will grant holders a preferred swap into our final protocol. It contains multiple deflationary mechanisms to help sustain token value during the farming period, which have proven to be remarkably effective. First, PLUTUS transactions are taxed at a rate of 3%, 2% of which is converted to the 1DAI stablecoin and routed to the bank and 1% is burned forever. The bank is a new system that allows users to lock their PLUTUS tokens, removing them until the launch of Hermes Protocol, while earning stable coin and partner token rewards funded by the transaction tax as well as performance fees from our auto-compounding vaults. The emissions of PLUTUS have been designed to bridge the time gap until the development and launch of Hermes Protocol. Hermes DeFi is composed of eight core team members that have undertaken projects on both the Polygon and Harmony blockchains with great success. Project leader, Roberto Quintero, has well-established connections within many aspects of the crypto community along with a business management degree at University of Porto. CMO, Austin Hovland, has experience with marketing strategy, data analytics, linux system administration, and a PhD in Bioinformatics from Cornell University. Two back end developers, Wendel and PestCtrl, have experience with DeFi 1.0/2.0, market lending, and are very familiar with Uniswap contracts. Two front end developers, Miguel and Marvin, who have built customized user interfaces from the ground up, backed by their work in consolidated companies in Berlin and Madrid. Graphic designer, Kami, is in charge of the graphics in social networks and internal documents, he is fluent in all Adobe software, illustration, and video production. Communications Director, Aaron B, his expertise in data analysis and extensive connections with Harmony projects make him a perfect fit for this position. Throughout our entire journey together Hermes has committed to be safe, transparent, and fast. We deployed our first contracts on the Harmony blockchain in December 2021, and have grown to an active user base of almost 3,000 (along with 2,000 Discord members) in less than a month. Measuring our growth on our website using Google Analytics shows almost a three-fold increase in active users over the past month (Dec 27-January 27). If this pace of growth continues, we expect to surpass 2,500 daily users within the next month. We have deployed enhanced safety procedures including multi-sig wallets for our treasury and grant funds. Our commitment to the Harmony blockchain runs deep. Recently, we have deployed our own validator node and RPC endpoint for the Harmony blockchain and are now serving over 23M requests daily. We recently have been noticed as the third most influential Harmony Dapp in a Twitter social analysis, with over 324K Tweet impressions from the last month. We have the skills, community insight, and momentum to successfully deploy a Uniswap V3 core based AMM/DEX and bring its many benefits to the Harmony blockchain.  About Harmony: Harmony is an open, decentralized, and fast blockchain. Our mainnet runs Ethereum applications with 2-second transaction finality and 100 times lower fees. Our secure bridges offer cross-chain transfers with Ethereum, Binance and 3 other chains. Build on Harmony, bridge to all chains. We are an open platform for your assets, collectibles, identity, and governance. Since going live on Mainnet in June of 2019, the network has produced 30M+ blocks with 477 million transactions in publicly traded, native ONE tokens. The ONE token has reached a market cap of $3.5B, joining the Top 50 in CoinMarketCap in October of 2021. HRC-20 tokens launched on Harmony boasts a DeFi ecosystem with a total TVL of over $1.3 billion, including stakes, according to DefiLlama. With over 700,000 unique wallets, 331,500 followers on Twitter, and 20,219 members on Discord, Harmony is a thriving and growing community. Harmony is an EVM-compatible, sharded Proof of Stake smart contract blockchain. Our Fast Byzantine Fault Tolerant (FBFT) consensus protocol, combined with random state sharding and Boneh–Lynn–Shacham (BLS) constant-sized signatures allows Harmony to achieve finality in one block or roughly two seconds – compared to optimistic finality in Solana or Avalanche, or 6 seconds for Cosmos, or 60 seconds for Polkadot. A normal transfer costs only about 0.000021 ONE. Harmony was the first sharding-based L1 on a mainnet. It has solved the trilemma of decentralization-security-scalability by uniformly scaling with shards. The Harmony Foundation recently announced one of the largest Ecosystem Grant Funds worth $300M to help attract industry leading projects such as Uniswap into the Harmony ecosystem. Other industry leaders like Sushi and Curve have launched into Harmony in Q2 and Q3 2021 respectively, while Aave governance voted to approve launching on Harmony, currently targeted to roll out at the end of Q4 2021. The Harmony blockchain has transparent development, and there are a number of upcoming major catalysts that are expected to drive new waves of adoptionation. Firstly, we are deploying trustless bridges to both Bitcoin and Etherum, increasing the flow of capital available to the Harmony blockchain. This would also enable trustless bridging of the Uniswap token to Harmony. Additionally, Harmony will aim to enable Apple Pay and Bank Wire on 1Wallet, opening up trusted avenues for fiat conversion. We have also recently enabled Chainlink integration to support more robust lending markets, and there are numerous other advancements already under development.  Proposal: In this proposal, Hermes DeFi is seeking an Additional Use Grant for the Uniswap V3 core contracts on which to build an AMM/DEX platform on the Harmony blockchain. In return, we are prepared to offer partial project ownership to the Uniswap DAO, realized in an allocation of 10% of our HERMES token, vested over the course of one year. In such an agreement, the Hermes DeFi team will deploy, manage, and grow the Uniswap user base on the Harmony blockchain. The growth of our platform will directly benefit the Uniswap DAO. We expect to complete core contract development, auditing, and deployment by March/April of 2022. Additional facets that will expand upon this codebase are the addition of lending markets, NFT staking, and The Hermes DeFi team is committed to transparency, and we will provide any and all information required to ensure that the legality, security, and ownership of this ecosystem is protected.   Benefits: The DeFi ecosystem within Harmony is currently composed of three major players, but all of these ecosystems have inefficiencies and leave a large market opportunity for Uniswap to expand to one of the fastest growing blockchains with advanced technology. Harmony, despite its large user base, has more activity within NFTs and GameFi, and many traditional needs of a DeFi ecosystem (Swapping, High-Frequency Trading, Bridging, Lending and Borrowing) have yet to be elegantly and efficiently integrated. Many of the new members of the Harmony community are unfamiliar with basic concepts of AMMs, and the Hermes community focuses on education as a primary goal. As such, there is a large user base with untapped potential drawn to the Harmony ecosystem from other projects. Uniswap has little to lose from this proposal, as it only requires approval for Hermes DeFi to expand upon the Uniswap V3 framework that has already been developed.  Conclusions: The Harmony blockchain represents an attractive market currently underserved by DeFi technology. Uniswap should, through the operation facilitated by Hermes DeFi and supported by the official Harmony development team, deploy Uniswap V3 to the Harmony blockchain. Doing so will directly benefit the Uniswap DAO by expanding their user base, earning financial rewards through ownership of this platform, and greatly benefit a quickly-expanding blockchain.  Voting:  Yes, grant Hermes DeFi an Additional Use Grant License. No, do not grant Hermes DeFi an Additional Use Grant License.  ",
                    "links": [
                        "https://www.harmony.one/",
                        "https://defillama.com/chain/Harmony",
                        "https://talk.harmony.one/t/hermes-defi-the-hermes-protocol/10339",
                        "https://gov.uniswap.org/t/building-uniswaps-moat-attracting-non-defi-developers/12419",
                        "https://plutus.hermesdefi.io/app",
                        "https://bit.ly/3rdUKfV",
                        "https://bit.ly/3rdUKfV",
                        "https://paladinsec.co/projects/hermes-defi/",
                        "https://plutus.hermesdefi.io/app",
                        "https://bit.ly/3rdUKfV",
                        "https://twitter.com/HarmonyOneDaily/status/1486950113201524736?s=20&t=Neiamh-CMrAk9cPQ3gDlfQ",
                        "https://medium.com/harmony-one/2-seconds-block-time-on-harmony-mainnet-aba78ee5643f",
                        "https://bridge.harmony.one/",
                        "https://coinmarketcap.com/currencies/harmony/",
                        "https://defillama.com/chain/Harmony",
                        "https://docs.harmony.one/home/general/technology/key-features",
                        "https://open.harmony.one/300m-on-bounties-grants-daos",
                        "https://open.harmony.one/strategy-roadmap",
                        "https://open.harmony.one/strategy-roadmap/launch-dates-weekly-updates/bitcoin-bridge",
                        "https://open.harmony.one/strategy-roadmap/launch-dates-weekly-updates/trustless-ethereum-bridge",
                        "https://open.harmony.one/strategy-roadmap/launch-dates-weekly-updates/1wallet-with-apple-pay-bank-wire",
                        "https://docs.harmony.one/home/developers/tools/oracles/chainlink",
                        "https://gov.uniswap.org/t/temperature-check-deploy-uniswap-v3-on-harmony-through-an-additional-use-grant-to-hermes-defi/16128"
                    ],
                    "GPT-summary": "The proposal explains that Hermes DeFi is seeking an Additional Use Grant for the Uniswap V3 core contracts to develop and deploy a next-generation AMM on the Harmony blockchain. The proposal highlights the benefits of deploying Uniswap V3 on Harmony and how it will directly benefit the Uniswap DAO. The proposal also provides information about the Harmony blockchain and the Hermes DeFi team. The post does not contain entirely positive or negative feedback, but rather constructive criticism and an explanation of the proposal.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Interoperability and Scaleability",
                        "Smart contract updates",
                        "Token economics",
                        "Community and engagement"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.6572883285545625
                },
                {
                    "author_link": "https://gov.uniswap.org/u/giv",
                    "index": "2",
                    "likes": "11",
                    "time": "31/01/2022-19:51:35",
                    "content": "I’m excited to see this project launch on Harmony. The Hermes team is extremely skilled and qualified to develop a next-generation AMM from Uniswap v3 on the Harmony blockchain. Hermes team recently received a grant from the Harmony ecosystem fund and I’m excited to see this initiative take off. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.5625
                },
                {
                    "author_link": "https://gov.uniswap.org/u/kostissss",
                    "index": "3",
                    "likes": "5",
                    "time": "31/01/2022-19:52:52",
                    "content": "Hermes DeFi is on of the best and most transparent communities i have seen in the whole DeFi space! Im really interested in seeing Hermes deploying Uniswap V3 on Harmony! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.578125
                },
                {
                    "author_link": "https://gov.uniswap.org/u/abodie2",
                    "index": "4",
                    "likes": "4",
                    "time": "31/01/2022-19:57:46",
                    "content": "As a long time participant in the Harmony ecosystem I can only see this as beneficial to the entire crypto space. Harmony is growing from within at a parabolic rate. I have written on and reviewed over 30 different projects within the ecosystem Many of them truly fantastic, yet they all fall short to what Hermes Defi has already begun to do. This team is so transparent in every aspect as well as fully doxxed to Harmony. As Hermes and Harmony continue to grow there is no better space for Uniswap to be next. Hermes Defi will only further the progress of fantastic products that Uniswap has established. I personally see this as a no brainer! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party or author is advertising proposal",
                        "3rd party giving entirely positive feedback on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.384615384615384
                },
                {
                    "author_link": "https://gov.uniswap.org/u/CouchPotitu26",
                    "index": "5",
                    "likes": "4",
                    "time": "31/01/2022-19:58:20",
                    "content": "I hope they grant this to the Hermes Team!! Hermes team is amongst the most capable devs out there. They were able to roll out a bunch of updates/works towards their project in very short amount of time. Can’t wait for them to launch Uniswap v3 in Harmony! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/spira",
                    "index": "6",
                    "likes": "4",
                    "time": "31/01/2022-19:58:29",
                    "content": "I have been using Hermes for a bit now. I can say without a doubt that their community and products are great. Interesting roadmap and tons of potential to develop a truly amazing ecosystem. Product integrity matters a lot to me and I can tell that there has been a lot of thought put behind this project. It would be sick to see uniswap v3 be deployed on harmony through hermes. I think these guys would be the best representatives for it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party giving entirely positive feedback on proposal",
                        "None"
                    ],
                    "Sentiment": 6.275510204081632
                },
                {
                    "author_link": "https://gov.uniswap.org/u/FFabio",
                    "index": "7",
                    "likes": "3",
                    "time": "31/01/2022-20:28:10",
                    "content": "Hermes Defi is one of the best and most reliable project on Defi and in particular in Harmony ecosystem. I’ll be very excited to see Hermes reach this goal, it would be a big goal also for all of us defi users. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.154166666666667
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Valclereon",
                    "index": "8",
                    "likes": "3",
                    "time": "31/01/2022-20:37:53",
                    "content": "Hermes is a breath of fresh air within the Harmony ecosystem as they strive to be a true DeFi platform with a genuinely good team and clear goals. Deployment of Uniswap v3 core has not yet been achieved within Harmony and will mark Hermes as the go-to DEX & AMM platform. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.8125
                },
                {
                    "author_link": "https://gov.uniswap.org/u/reXavis",
                    "index": "9",
                    "likes": "3",
                    "time": "31/01/2022-20:50:53",
                    "content": "I have been with Hermes since the first Iris launch in Polygon, and through a massive push even in the worst moments of the market, they succeded. Please, allow them to be the ones who wield Uni V3 on a blockchain such as Harmony!! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 4.0625
                },
                {
                    "author_link": "https://gov.uniswap.org/u/RuckiTV",
                    "index": "10",
                    "likes": "2",
                    "time": "31/01/2022-21:24:06",
                    "content": "Hermes have on of the best communities i had seen in the whole Krypto Space Im really interested in seeing Hermes deploying Uniswap V3 on Harmony! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.520833333333333
                },
                {
                    "author_link": "https://gov.uniswap.org/u/jc162444",
                    "index": "11",
                    "likes": "3",
                    "time": "31/01/2022-23:16:21",
                    "content": "Let’s do this guys! Really hope this to come true! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.59375
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Rise",
                    "index": "12",
                    "likes": "3",
                    "time": "31/01/2022-23:28:48",
                    "content": "HermesDefi developers are very dedicated. Transparency and openness are very important here. I have never met a community like this before. You are always helped with questions and so far with one of the best projects I have been able to get to know. I am very excited about the upcoming goals. With all due respect, I think that HermesDefi will revolutionize the Defi world in the future. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.676562500000001
                },
                {
                    "author_link": "https://gov.uniswap.org/u/HermesDeFi",
                    "index": "13",
                    "likes": "1",
                    "time": "02/02/2022-19:37:22",
                    "content": "Dear Uniswap Community, Please join us tomorrow at 9:30PM UTC for a Twitter spaces event where we can answer your questions live! https://twitter.com/i/spaces/1jMJgeyDLQgKL We will have Austin, our CMO as well as special guests @giv from Harmony and @GuzMassAdoption and @BOR4 from Uniswap. Can’t wait and see you there! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Topic:",
                        "• 3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.542207792207792
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Naught",
                    "index": "14",
                    "likes": "1",
                    "time": "04/02/2022-00:42:01",
                    "content": "I have a few issues with this proposal:   Why is Harmony Blockchain not taking the route like Polygon, where it is asking to launch and provide Harmony token to incentivize Uniswap V3 on Harmony?   From my understanding of this proposal, it is offering 10% of a new AMM/Defi token Hermes (a non governance token) to Uniswap Treasury and they basically get to create a rebrand Uniswap v3 on Harmony using Hermes as an emission token to bootstrap liquidity. My question is how is this different than what Sushiswap did with Uniswap v2, other than it being on a different blockchain (i.e. Harmony)?   It is stated on the harmony website that it provides trustless bridges, but then also mentions a multisig that controls the bridge. What is the trustless guarantee?   I do not think 10% is a high enough allocation for this proposal. This proposal is very different than the Voltz proposal as Voltz is not competiting with the AMM usage of its proposed v3 usage license, and is expanding Uniswap v3’s usage through intrest rate swaps.   With the proposal layed out here, Harmony and Hermes are benefiting from:   getting a sushiswap model ( a reskined Uniswap with token emission incentive) with a Uniswap v3 integration   cutting out Uniswap governance control with it’s own Iris governance token (Uniswap tresury does not recieve a governance stake)   a marketing/trust benefit by saying Hermes is affliated/approved by Uniswap Governance   If this proposal is even to be considered, I would think a 50%> allocation of Hermes is more suitable. I am overall against this proposal without more information on how the above can be rectified. I would be more open to a straight Uniswap v3 launch proposal (like Polygon’s) where Harmony itself is providing liquidity incentive. In this case my questions would refer directly to what Harmony does, and how secure it is. Is harmony similar to AVAX, and Solana in bridge trust assumptioms, is it a layer 1 to layer 1? Or is it a rollup? How many validators does it have etc.? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.732128099173553
                },
                {
                    "author_link": "https://gov.uniswap.org/u/HermesDeFi",
                    "index": "15",
                    "likes": "5",
                    "time": "07/02/2022-19:10:13",
                    "content": " Update Summary After careful consideration and review, we would like to provide an update to some of the questions we received in our community AMA event with Uniswap. In this update we will:  Demonstrate our willingness and enthusiasm to work with Uniswap. Clarify and enhance the proposed rewards allocated to the Uniswap DAO. Address concerns relating to the ETH-ONE bridge and associated governance. Identify mechanisms used to send incentives to Uniswap.  So long as no major modifications are needed, we intend to submit our proposal for the official temperature check on Wednesday February 9th. In this governance vote, we will require 5M UNI votes with a majority ‘YES’ to continue.  Currently Active Uniswap Incentives When we presented the Uniswap V3 deployment proposal, we wanted to celebrate by adding a 1UNI pool to our project to allocate PLTS rewards and allow PLTS investors to earn 1UNI through our bank system. The pool does not have any kind of fee, other than any costs of moving UNI to Harmony (1UNI) through the Harmony Bridge. To fund the initial bank rewards of 1UNI, we purchased a few thousand dollars worth of 1UNI on the open market. These two gestures were made selflessly before we know if we will be able to deploy V3 on Harmony to better connect us directly with UNI holders. This has proven effective in attracting Uniswap investors to Harmony as shown in these two screenshots below. Over the past 3.5 days, over 5,000 UNI tokens ($50,000+) have been bridged to Harmony and staked in our platform. Before announcements.  1320×136 12.7 KB  After announcements.  1333×132 12.4 KB   Licensing incentives from Hermes DeFi In our initial proposal to the Uniswap DAO, we offered a 10% allocation of HERMES tokens vested over a year. In our current tokenomic modeling and price projection of the HERMES token, this represents $180,000 at present day evaluation and over $4,000,000 in a conservative six-month projection. Uniswap would be able to choose if they wish to receive this allocation in HERMES tokens or if they would like to swap their HERMES allocation to IRIS. Multiple lines of discussion led us to believe that the Uniswap DAO was also interested in the governance of The Hermes Protocol. To help increase exposure to this, we are proposing the following incentives in addition to this direct allocation of HERMES tokens:  A direct allocation of platform trading fees directed towards IRIS buybacks for the Uniswap DAO. Under this model, platform fees (0.2% swap fee, 0.17% allocated to LP providers and 0.03% allocated as ‘platform fees’), would be allocated to Uniswap. For the first year of trading, 65% of platform fees would be directed towards IRIS dividends (various mechanisms), 25% would be directed towards Uniswap (IRIS buyback and return to Uniswap treasury), and 10% would be directed towards operation costs. The Uniswap allocation would decrease from 25% to 0% in 5% increments over the next 5 years. The Hermes Protocol would host an IRIS/1UNI farm on Harmony in perpetuity, directly rewarding Uniswap investors that stake at Hermes. Additionally, the Uniswap DAO would receive 50% of all platform fees derived from this trading pair. At the moment of agreement, 2% of IRIS supply would be distributed to the Uniswap treasury from the Hermes treasury. When the lending market for The Hermes Protocol launches, UNI will be one of the first tokens eligible for lending and borrowing. This will allow Uniswap investors to earn HERMES as a reward token in addition to increasing their capital efficiency. When the bonding market for The Hermes Protocol launches, UNI will be able to be bonded to earn HERMES. The bonded UNI will be added to the Hermes protocol-owned liquidity and will be utilized to generate stable returns.  We hope that these significant financial incentives present a low-risk investment (simple licensing agreement) to the Uniswap DAO.  Cross-chain considerations for Uniswap During our AMA conversations and associated discussions, multiple individuals raised questions about the stability and nature of the Horizon bridge operated by Harmony that allows ETH-ONE bridging. First of all, we would like to highlight that while the Harmony-Ethereum bridge is not fully trustless in its current state, it maintains ~$500M in locked tokens and is an area of active development. Harmony is in the final stages of deploying a fully-trustless Bitcoin bridge, which will be shortly followed by a fully trustless ETH bridge. As IRIS is also available on Polygon, any Uniswap-held tokens could be located on any of these three blockchains. Thus, we would love to hear from the Uniswap DAO how they would like to proceed in holding tokens and have presented a few options.  Hold IRIS & HERMES in a multisig wallet operated by Uniswap DAO members on the Harmony blockchain. Hold IRIS on a multisig wallet operated by Uniswap DAO members on the Polygon blockchain. Hermes DeFi could deploy IRIS as an ERC20 token, provide initial liquidity (~$20,000), and support IRIS/ETH liquidity as a farm (+$10,000 in bonus rewards) on Uniswap directly on the Ethereum blockchain.  In all scenarios, we would ensure that IRIS would be allowed to have voting privileges in our Snapshot.org governance strategies. Whatever option Uniswap determines would be most convenient to them, we will adapt to.  Conclusions We look forward to hearing additional feedback from Uniswap, Harmony, and our communities about this proposal. We hope that we have offered significant financial and community-building incentives to Uniswap in this proposal. We have received so much positive feedback from our community and are really enthusiastic about working together to build something amazing. ",
                    "links": [
                        "https://global.discourse-cdn.com/business6/uploads/uniswap1/original/2X/5/52bfe49ff3d369a66d9834739bfd9591f7bea8b8.png",
                        "https://global.discourse-cdn.com/business6/uploads/uniswap1/original/2X/2/2fcbb94d3a57e046fdbcdd8bf00e04ce00814047.png",
                        "https://docs.google.com/document/d/1fbY4Sc6o34506a_0l7XvwjtmZiyLc9atgOgnAqChlRc/edit?usp=sharing",
                        "https://bridge.harmony.one/tokens",
                        "https://multisig.harmony.one/",
                        "https://gnosis-safe.io/app/welcome",
                        "https://snapshot.org/#/hermesdefi.eth",
                        "https://gov.uniswap.org/t/temperature-check-deploy-uniswap-v3-on-harmony-through-an-additional-use-grant-to-hermes-defi/16128"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.760230986333927
                },
                {
                    "author_link": "https://gov.uniswap.org/u/reXavis",
                    "index": "16",
                    "likes": "1",
                    "time": "07/02/2022-19:20:15",
                    "content": "This new proposal looks waay better than the original one, V3 in Harmony is going to make the blockchain grow exponentially. As always, well done Hermes! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.8418560606060606
                },
                {
                    "author_link": "https://gov.uniswap.org/u/RuckiTV",
                    "index": "17",
                    "likes": "3",
                    "time": "07/02/2022-19:24:45",
                    "content": "In my opinion, the changes are exactly what Uniswap wanted. Share of Iris to be able to shape governance votes, continuous revenue through fees, etc…if that should not be enough Hermes have tried everything. Very good Hermes  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party giving entirely positive feedback on proposal"
                    ],
                    "Sentiment": 7.075
                },
                {
                    "author_link": "https://gov.uniswap.org/u/HermesDeFi",
                    "index": "18",
                    "likes": "7",
                    "time": "07/02/2022-19:34:57",
                    "content": "Dear Naught, please read through our recent update to learn about our most recent (and increased) financial incentives to Uniswap. I will also address your points individually.  This was done because Hermes would be the group responsible for operating the DEX, not the Harmony team. As we do not want to burden Uniswap with additional development tasks, it was decided that Hermes would be the best fit to apply in this manner. See our recent post, which contains more ways to reward UNI with IRIS-based governance among other things. Furthermore, we are not going to have a ‘reskinned’ Uniswap, but build many features on top of the smart contract framework. This is fundamentally different from the ‘cloning’ nature of some other platforms. 3. and 4. were also covered in this post.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.113839285714286
                },
                {
                    "author_link": "https://gov.uniswap.org/u/caideguang",
                    "index": "19",
                    "likes": "2",
                    "time": "08/02/2022-10:50:13",
                    "content": "That’s a great suggestion~ ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Naught",
                    "index": "20",
                    "likes": "2",
                    "time": "09/02/2022-23:30:55",
                    "content": "The clarified terms look fair to me. This still needs to be figured out before an on-chain vote:    Hold IRIS & HERMES in a multisig wallet  operated by Uniswap DAO members on the Harmony blockchain.   Hold IRIS on a multisig wallet operated by Uniswap DAO members on the Polygon blockchain.   Hermes DeFi could deploy IRIS as an ERC20 token, provide initial liquidity (~$20,000), and support IRIS/ETH liquidity as a farm (+$10,000 in bonus rewards) on Uniswap directly on the Ethereum blockchain.    I think option 2 or 3 would be best. I lean more towards 3 as it may be easier to manage for the treasury. The NFT of the position could be sent to the treasury, and potentially not require a multi-sig. ",
                    "links": [
                        "https://gnosis-safe.io/app/welcome"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.916666666666666
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Sampahcokk-dev",
                    "index": "21",
                    "likes": "0",
                    "time": "10/02/2022-10:29:28",
                    "content": "Yes, grant Hermes DeFi an Additional Use Grant License. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/HermesDeFi",
                    "index": "22",
                    "likes": "1",
                    "time": "10/02/2022-16:19:58",
                    "content": "Would love to discuss this in more detail with you. Please reach out on Discord/Twitter so we can have a more engaging conversation. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.375
                },
                {
                    "author_link": "https://gov.uniswap.org/u/monet-supply",
                    "index": "23",
                    "likes": "5",
                    "time": "15/02/2022-23:32:28",
                    "content": "I didn’t vote in the recent snapshot, but if this moves forward to consensus check I will plan to vote against (based on proposal as it currently stands). My issues with current proposal:  Hermes defi has multiple native tokens, I consider this a red flag as almost all multitoken projects have been forced to merge them eventually, and sometimes holders of one class of tokens get a worse deal (see ANT/ANJ, MCO/CRO, etc) Uniswap has little governance protections or assurances, Hermes uses snapshot (presumably with a multisig for execution) so we’re just trusting the team to follow through on any promises The allocation offered seems far too low, with Uniswap v3 use grant likely representing a majority of protocol value if the deal goes through. See price chart for indication of this:  image1620×728 40.4 KB    I’m skeptical of franchising v3 being a good strategy for the immediate future. I’d prefer to see Uniswap pursue the highest value L2s/L1s with a direct launch that preserves Uniswap’s autonomy and branding and lets us own the user relationship. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.03515625
                },
                {
                    "author_link": "https://gov.uniswap.org/u/0x7751",
                    "index": "24",
                    "likes": "0",
                    "time": "20/02/2022-19:27:15",
                    "content": "Well said. Avantgarde will also plan to vote against. In framing how we evaluate license grant applications, I think there’s a stark difference between projects that are using the protected code in novel ways and simply franchising the protocol’s functionality in an undifferentiated way across many venues. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/gmJones",
                    "index": "25",
                    "likes": "0",
                    "time": "28/02/2022-20:26:20",
                    "content": "Direct launch makes sense. True to what Uniswap represents ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.125
                }
            ]
        }
    ],
    "group_index": "168"
}