{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/is-this-a-hack/10416",
            "title": "Is this a hack? ",
            "index": 10416,
            "category": [
                "Proposal Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/Nikix",
                    "index": "1",
                    "likes": "0",
                    "time": "18/02/2021-17:38:41",
                    "content": "Hey guys I really need help with this one ! it’s been a while that when I copy any wallet address or contract and paste it, a specific address will be pasted instead of what I have copied ! And this happens on all of my browsers (Brave - Chrome - Firefox) this is the address 0x81daa515b9b2584a52b5ad78140a751bb698635a (the address which is not mine but it’s been messing with me)  any suggestion ? ",
                    "links": [],
                    "GPT-summary": "The post is about a technical issue with copying and pasting wallet addresses, and the author is seeking help to resolve the issue. None of the listed topics match the content of the post.",
                    "GPT-proposal-categories": [
                        "Privacy, Security and risk management",
                        "None",
                        "None",
                        "None",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "None"
                    ],
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Danpi314",
                    "index": "2",
                    "likes": "2",
                    "time": "19/02/2021-02:54:57",
                    "content": "Not heard of that but it seems like a computer virus on your end, immediately unplug the internet from the PC, write down your seed words on a piece of paper. Run an antivirus, or better yet completely re-install windows. Recover your funds and then make a new seed word and move everything there double checking they are being sent to the correct place. If your using a hardware wallet you don’t need to worry about the seed words (though they should be backed up anyway), still double check that when sending tokens they are being sent from the hardware wallet to where you actually want them sent. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.414862914862915
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Nikix",
                    "index": "3",
                    "likes": "0",
                    "time": "19/02/2021-08:21:08",
                    "content": "Yes, sit thank you. I bought a new laptop last night and I will change my windows and will use a dedicated laptop just for trading. I am a bit scared because the last time I changed a device and used my seed phrase to recover my funds on “Coindbase” I lost my funds! I hope this won’t happen in Metamask. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match the content of the post."
                    ],
                    "Sentiment": 5.227272727272727
                },
                {
                    "author_link": "https://gov.uniswap.org/u/tiuni",
                    "index": "4",
                    "likes": "2",
                    "time": "20/02/2021-14:32:35",
                    "content": "Even though I’m personally sympathetic about your troubles, please be mindful of Uniswap Governance Forum Rules You’ve posted a technical support question to governance forum (and to “Proposal Discussion” section no less!)   If you need technical help, or want a place for more general discussion, visit the official Uniswap Discord .   ",
                    "links": [
                        "https://discord.gg/XErMcTq"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.961805555555555
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Nikix",
                    "index": "5",
                    "likes": "1",
                    "time": "20/02/2021-17:44:00",
                    "content": "Thank you for replying. I will put this in mind  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "12"
}