{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/update-uniswap-v3-0-to-accept-rebase-tokens/17191",
            "title": "Update Uniswap v3.0 to accept rebase tokens ",
            "index": 17191,
            "category": [
                "Proposal Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/alan",
                    "index": "1",
                    "likes": "5",
                    "time": "21/07/2022-22:58:35",
                    "content": "Hi All, I wanted to check on how the community feels about updating uniswap v3.0 smart contract code so that pools can accept rebase tokens (e.g, stEth, Ampl), which it cannot currently do. Don’t want to make this a discussion on whether it is feasible or not (I am posting this because I think I have a feasible approach).   Would love to focus this discussion on whether this would be of interest to the community to have, and if so, I could submit a more specific proposal as a temperature check. Best, Alan. ",
                    "links": [],
                    "GPT-summary": "The author of the post is proposing an update to Uniswap v3.0 to accept rebase tokens and is asking for feedback from the community on whether this would be of interest. The author is not interested in discussing the feasibility of the proposal but is willing to submit a more specific proposal if there is interest. Some 3rd parties are giving constructive criticism and asking questions about the proposal.",
                    "GPT-proposal-categories": [
                        "Smart contract updates",
                        "Community and engagement",
                        "Token economics"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 6.845238095238095
                },
                {
                    "author_link": "https://gov.uniswap.org/u/alan",
                    "index": "2",
                    "likes": "2",
                    "time": "18/08/2022-21:46:15",
                    "content": "I’ll take the lack of responses as a no!  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/baizetianxia",
                    "index": "3",
                    "likes": "2",
                    "time": "05/09/2022-13:49:13",
                    "content": "Hi  @alan , I am developer and blocking by swap from stETH to ETH on Uniswap V3, can you give me some advice on what to do with it. Thanks a lot! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                }
            ]
        }
    ],
    "group_index": "208"
}