{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/uniswap-proposal-an-alternative-use-case-for-the-fee-switch/20779",
            "title": "Uniswap Proposal: An Alternative Use-Case for the Fee Switch ",
            "index": 20779,
            "category": [],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/guil-lambert",
                    "index": "1",
                    "likes": "4",
                    "time": "20/03/2023-19:52:44",
                    "content": "EXECUTIVE SUMMARY: This is a proposal to address the legal and tax concerns surrounding the implementation of the fee switch on Uniswap. The current plan to add a ‘fee switch’ to certain token pairs has raised several legal and tax questions that could potentially put the Uniswap ecosystem at risk. The proposal suggests that teams who launched a token should be the ones submitting a proposal to the Uniswap DAO to capture the fees collected for that token’s Uniswap pool. This would give the teams more control over the market making of their tokens, encourage LP participation and mitigate risks associated with impermanent loss. The proposal has several benefits for all parties involved, including protocols, LPs, and swappers, and could help create a more sustainable and equitable ecosystem for all participants.  Introduction Uniswap has been one of the most innovative and successful decentralized exchanges in the DeFi space, allowing users to swap between any ERC-20 token with ease. The Uniswap community has highlighted the importance of a model to support sustainable growth of the protocol over time. The current proposed direction is to add a ‘fee switch’ on token pairs so that fees are distributed to both LPs and Uniswap governance. However, recent discussions around turning on the fees switch for some of the ETH-stablecoin pairs have raised regulatory uncertainties and unclear tax implications. We believe this presents an opportunity to re-assess the proposed plan and develop a fee model that can benefit LPs, Uniswap governance, and token projects. This proposal seeks to address risks of the current plan and better align incentives between all ecosystem participants. We will present below an alternative use-case for the fee switch that can benefit the Uniswap protocol, swappers, LPs, and DeFi protocols, while reducing the potential liability for all Uniswap ecosystem participants.  The Problem with the Current Fee Switch Plans The current plan to turn on the fee switch for the ETH-stablecoin pairs raises several questions that haven’t been solved during the last 6 months. For example, is it a taxable event? Which entity should collect those fees and pay taxes? How should it be used? Does it make sense to return it to the token holders, and how to do that? Turning on the fee switch for ETH-stablecoin pairs is putting the Uniswap DAO, stakeholders, and foundation under a legal risk. Moreover, targeting the set of pools with the most volumes (ie. ETH-USDC, ETH-USDT, and ETH-Dai) is an overly ambitious plan that may poison the well for future fee switch proposals if it fails. It is important to find an alternative use-case for the fee switch that reduces the risk that puts LPs and Uniswap governance at odds.  The Proposal: A New Use-Case for the Fee Switch My proposal is to shift the responsibility away from the Uniswap stakeholders and instead allow protocols to capture the fees switch for their own pool. Specifically: fee switch proposals for each pool should come from the teams that launched the token for that pool. If a team launches tokenX, then that team will have the right to submit a proposal to the Uniswap DAO to capture fees collected for the ETH-TokenX pair. In other words, fees from each pool will mainly go to protocols, not to Uniswap ecosystem participants. This way, the team that launched TokenX would effectively take a cut of any trading activity that occurs in their own token’s Uniswap pool. This has the added benefit of giving protocol/token projects the flexibility to craft liquidity programs for their Uniswap pool that make it easier for their community of token holders to LP; such as narrow/wide/single-sided/automated LP positions. LPs that do not follow these guidelines will not receive any rewards and will take a 10% pay cut. The key point here is that the protocol X will be in full control of these funds, and they will have to make the decisions about liability, taxes, and legal entities, not the Uniswap DAO, stakeholders, or foundation. Note that the fee switch distribution is still contingent on the protocols’ proposal being approved by UNI voters. The Uniswap DAO, stakeholders, and foundation could still provide general guidelines that are aligned with Uniswap’s values when reviewing any team’s proposal to use those funds. And the UniswapDAO should set very high standards from the very beginning for approving any proposal. Overall, this proposal has the potential to create a more sustainable and equitable ecosystem for all participants, including swappers, LPs, protocols, and the Uniswap DAO.  Benefits for All Parties Involved The proposed alternative use-case for the fee switch offers several benefits for all parties involved. Benefits for protocols:  By allocating fees to the teams that launched tokens on Uniswap, this proposal gives these teams more control over the market making of their own tokens. This could result in increased liquidity and trading volume for these tokens, as the teams have a greater incentive to promote their own assets and encourage LP participation. Teams can use the fees collected to incentivize their own community to LP safely, by providing rewards for LPs that follow certain guidelines or best practices. This would help mitigate risks associated with impermanent loss and promote healthy LP behavior, resulting in a more stable and sustainable market for these tokens. This proposal has the potential to make liquidity mining relevant again, as the teams can use the fees collected to offer additional incentives to LPs that stake their tokens in Uniswap pools. These measures, together with a well executed liquidity mining campaign, could help attract more liquidity to these pools and create a virtuous cycle of increased liquidity, trading volume, and LP participation.  Benefits for LPs:  If protocols choose to offer incentives to LPs, it would potentially result in higher revenues for LPs who follow the guidelines set forth by the protocol. These incentives could increase the overall yield for LPs. The ability to earn extra ETH (cold hard cash) in addition to tokens would be an attractive proposition for LPs, as it would provide additional liquidity to participate in other opportunities within the DeFi ecosystem. With increased revenues, LPs would have more flexibility to participate in long-tail assets that may have previously been unattractive due to highly volatile yields. LPs could also benefit from being part of a community incentivized to LP safely, as this would help ensure the sustainability of the underlying protocol and provide a similar goal among LPs.  Benefits for swappers:  Many protocol tokens have very low liquidity in Uni v3. Swappers can benefit from incentive alignments that could lead to a better liquidity distribution across pools, which in turn would result in better prices and reduced slippage.  Benefits for Uniswap:  By giving teams more control over the market making of their own tokens, Uniswap becomes a more attractive platform for LPs to participate in, making it the preferred AMM for LPs. As a result, Uniswap will likely see an increase in liquidity, which in turn will improve the user experience for swappers, as they can trade with more ease and lower slippage. UNI token holders could vote to keep a fraction of that 10% for their own treasury after a legal structure has been put in place, which means that the fee capture mechanism proposed in this plan can be an extra source of revenue for the Uniswap protocol. These funds could be used to finance protocol development, community initiatives, or other growth-related activities. By incentivizing competition and diversity among protocols to make better use of the collected funds, Uniswap can foster innovation and experimentation within the DeFi space. This will also create more incentives for projects to launch tokens on Uniswap v3 vs on other dexs/cexs. Ultimately, this could lead to a more dynamic and thriving ecosystem for all participants, with Uniswap at the forefront of driving positive change.   Frequently Asked Questions  Who decides who is the issuer of the token? Who gets that revenue? How to prevent malicious actors trying to pocket these fees? The Uniswap DAO and voters will have to evaluate the proposal for each team. There will likely need to be a due diligence process for each proposal, but it is very easy to verify which multisig belongs to which protocols from on-chain data.  What type of liquidity distribution should be incentivized? Which pair and fee tier? It would be up to the protocols making the fee switch proposals. I am partial to using the ideas behind the David Mihal’s modified v3-staker contract and incentivize position of a minimum widths (eg. at least 1000 ticks wide) –although using the staker contract may not be necessary and rewards could be computed off-chain. Ultimately, it will be up to the protocols to decide for themselves, and to the Uniswap DAO to evaluate the credibility and seriousness of their plans.  How will the fee switch be distributed to the protocols? While the collectProtocol function in each UniswapV3Pool MUST be called from the owner of the Uniswap factory, it has a recipient field. This means that the multisig controlled by the Uniswap foundation could call the collectProtocol function with the protocol multisig as recipient. The protocols could then distribute the fees whichever way they want. It could be done using the merkle distributor, Angle Protocol’s Merkl, or it can be keep it their multisig as a treasury diversification – it will 100% be up to the proposing team to formulate a comprehensive plan when submitting their proposal to the Uniswap governance forum.  What’s in it for projects? Project would benefit from having liquidity Uniswap pools that favor trading of their native token. I find it extremely unfortunate that some protocols have to resort to using market making firms to provide and manage liquidity in Uniswap, often very poorly and at a high cost for the protocols. Similarly, some protocols are creating assets and derivatives that also need to be traded in liquid markets to succeed, and the fee switch could also be used for those pools as a way to incentivize liquidity without having to spend their native tokens. A limited number of examples include: i) Lido, which has the LDO token and the stETH, ii) MakerDAO, which has the MRK token and Dai, iii) Index Coop with the COOP token and DPI, iv) Frax finance with FXS and the FRAX stablecoin. In addition, allowing protocols to capture the trading fees from their token pools is a revenue incentive for protocols if they don’t plan on distributing 100% of the fees collected via the switch (credit to daftary.eth for this idea).  What’s in it for UniswapDAO? This makes it more attractive for protocols to launch their pools on Uniswap as compared to other AMMs and Uniswap forks - thus helping Uniswap maintain its competitive advantage once the V3 license expires (daftary.eth). Uniswap could also keep a portion of those collected fees to be used as a way to diversify their treasury, generate revenues, fund public goods, donations, etc. Again, it will 100% be up to the Uniswap DAO and foundation to decide.  What are the next steps? I will be happy to help teams work on their proposal to capture the fees for their own Uniswap pair. Feel free to reach out to me here or on twitter @guil_lambert. Huge thanks to Devin Walsh, Raffi Sapire, Andrew Foreman, PhABCD, BP_Gamma, daftary.eth and Leighton Cusack for their help writing this article and thoughtful feedback.  Disclaimer: I am the founder of Panoptic, an options protocol built on top of Uniswap v3. This post has been generated with the help of ChatGPT using using the following prompt: ”I am writing an article for a new proposal for a DAO. I have several bullet points and I want you to help me write a fleshed out article based on these ideas\" ",
                    "links": [
                        "https://gov.uniswap.org/t/fees-switch-follow-up-supporting-the-evolution-of-uniswap-protocol-design/20751",
                        "https://gov.uniswap.org/t/fee-switch-pilot-update-vote/19514/50",
                        "https://gov.uniswap.org/t/fee-switch-design-space-next-steps/17132",
                        "https://github.com/dmihal/v3-staker",
                        "https://github.com/Uniswap/merkle-distributor",
                        "https://docs.angle.money/side-products/merkl",
                        "https://twitter.com/guil_lambert"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.02371126228269
                },
                {
                    "author_link": "https://gov.uniswap.org/u/MattOnChain",
                    "index": "2",
                    "likes": "1",
                    "time": "20/03/2023-22:18:56",
                    "content": "    guil-lambert:   UNI token holders could vote to keep a fraction of that 10% for their own treasury after a legal structure has been put in place, which means that the fee capture mechanism proposed in this plan can be an extra source of revenue for the Uniswap protocol. These funds could be used to finance protocol development, community initiatives, or other growth-related activities.    Even this 10% cut would come with the same worry of potential regulatory issues. In my opinion, the fee switch as proposed has zero benefit to UNI holders, besides maybe as a test for the impact of the fee switch and to see if regulators come after the projects who receive protocol fee revenue (grasping at straws here). I doubt it even drives significantly more tvl/volume. If we are going to allocate fee revenue to projects, it might as well be to public goods rather than shit coin teams… The additional liquidity and swap volume would be marginal at best. Likely, the teams would return the revenue to their token holders (at best) or themselves (at worst). Just because a team’s proposal to the DAO looks pretty when the team sends it in does not in any way, shape, or form mean that is how it will be executed on. Even if the team does return revenue to LPs, that makes turning on the fee switch in the first place pretty irrelevant. If we are going to flip on the fee switch, we should do it right, with the UNI DAO as the main beneficiary.  This post has been generated with the help of ChatGPT using using the following prompt: ”I am writing an article for a new proposal for a DAO. I have several bullet points and I want you to help me write a fleshed out article based on these ideas\"  lel ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5437488236401276
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Naught",
                    "index": "4",
                    "likes": "1",
                    "time": "21/03/2023-05:09:23",
                    "content": "A few questions for this idea:   Who would propose a fee switch for pools like WBTC/ETH, and could this create legal issues around ownership of tokens from project creators?   Could proposals for pool fee switches be made by liquidity provision/user fee rebate/fund lottery projects like Pool Together, rather than by token creators/projects themselves, to mitigate legal issues for central teams?   Instead of project/creator/etc directly claiming fees, could a proposal be made to designate the fee directly to LP pools in certain ranges, or to a set of addresses that paid gas over a certain period, or sent to the 0x000000000 burn address?   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.517857142857143
                },
                {
                    "author_link": "https://gov.uniswap.org/u/cryptoyeye",
                    "index": "5",
                    "likes": "2",
                    "time": "21/03/2023-05:13:54",
                    "content": "Love this idea. We as UNI holders ought to remember the UNI token isn’t the product, and every design decision should be making Uniswap the Protocol better. Maximizing token value is short sighted. This essentially decentralizes the decision making of the “fee switch” and if we imagine there will be hundreds of millions of tokens in the future, we should not be taking a top down approach to the fee switch experimentation. I like this idea because like Guil said, this puts the market-making and LM decision back to the protocol team. This also makes V3 LM relevant, as there is now strong incentives for teams to launch on V3 vs V2. Team can decide what liquidity provisioning rages are most appropriate. And the market makers who are more active will pay a small tax to those who are passive. Passive LPs basically get a “boosted” apy. I think this is brilliant. This is what V3 is all about → let those want to take higher risk reap higher reward. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.304012345679012
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Spongky",
                    "index": "6",
                    "likes": "0",
                    "time": "21/03/2023-10:24:10",
                    "content": "yeah, especially 2 & 3 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "283"
}