{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/an-argument-for-new-success-metrics-volume-and-distribution/8675",
            "title": "An Argument for New Success Metrics - Volume and Distribution ",
            "index": 8675,
            "category": [],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/g_dip",
                    "index": "1",
                    "likes": "16",
                    "time": "17/11/2020-19:29:16",
                    "content": "Hi Uniswap Community, There has been a lot of discussion around the liquidity mining program recently, and I think a lot of nuance is getting lost in the weeds. I want to begin a discussion around what our “North Star” is, and argue that we are not solving for the right metric by arbitrarily distributing UNI via liquidity mining. What is the real goal of liquidity mining? It may be tempting to say that “liquidity” is the ultimate goal of these programs, and that they’ve been very successful in that context. But liquidity is a means to an end. We try to source liquidity so that we can provide the best price discovery, which will then lead to more traders using Uniswap over other venues, and ultimately to more volume flowing through the platform. Targeting liquidity in order to achieve greater volume has been a decent strategy and, at least so far, has been successful. But, I believe this strategy has reached the point where we are now solving for the metric and not the problem. It’s kind of like when colleges decided to use SATs as a metric to find intelligent students. At a certain point you just start getting students who are great and standardized tests and not much else – SATs are a good approximation, but they need to be taken in the context of the other dimensions of a “good student.” What brings traders to Uniswap? The decision-making process of traders is multi-dimensional. Liquidity mining solves for only one of those dimensions. The three primary factors that bring traders to Uniswap (in my opinion) are:  Cost of execution (liquidity/fees) Ease of use (distribution within aggregators and front-ends) Availability of assets (listings are not controlled by a centralized entity)  Item 3 is fortunately implicit to Uniswap being a decentralized protocol. Item 1 has been aided by liquidity mining. But item 2 has been Uniswap’s true competitive advantage - without better distribution, volumes may have went permanently to Sushiswap in the “vampire attack” and we’d likely be in a much worse competitive position today. The LPs that remained on Uniswap were rewarded with high organic fees, even after the majority of liquidity left the protocol. This is the kind of sticky competitive advantage we need to encourage. What brings liquidity providers to Uniswap? The other side of this coin is of course the LPs themselves. They also have a multidimensional decision making process. I believe they look for:  Volume (fees they can generate, governance tokens/liquidity mining schemes) Security (battle-tested code) Inventory management (x*y = k)  In my opinon, item 3 stands to be improved, as different assets should have different inventory management strategies (e.g. Curve has done a nice job of this for stablecoins). Item 2 is unique to Uniswap, but also to its forks. Item 1 is the sole factor that we, as a community, can help to control. So how do we deploy resources to grow trading volumes and not just liquidity? If you don’t already see where this is going…we need to focus on distribution in order to grow trading volumes. None of this is to say that we should stop liquidity mining altogether. It is to say that we should be benchmarking these efforts based on how much volume the protocol is doing at different levels of liquidity, and that we should cease devoting resources (UNI) to a strategy with decreasing marginal returns. Instead, we should focus on deploying UNI intelligently towards furthering our distribution – more aggregators, more front-ends, more third party platforms that route through the protocol. Thanks for reading and I’m looking forward to having a discussion. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.446985815602837
                },
                {
                    "author_link": "https://gov.uniswap.org/u/monet-supply",
                    "index": "2",
                    "likes": "4",
                    "time": "18/11/2020-19:28:15",
                    "content": "@g_dip thanks for this post! I agree that liquidity and TVL in themselves are not really good success metrics for Uniswap. Volume is a much better gauge of platform adoption and usage, and also naturally benefits LPs through fee returns. I’ve been thinking about ways that Uniswap can try to broaden distribution and integrations with other platforms and wallets. One idea that comes to mind is payment for order flow. In traditional finance, large market making firms will pay stock broker firms for the ability to trade against their clients’ orders. Market makers get more volume, while brokers receive referral revenue. Many brokers use this payment for order flow revenue to subsidize their services (eg. Robinhood and other online brokers eliminating trade commissions), which can help further increase trade volume like a flywheel effect. If Uniswap were to turn on the fee switch, part of the money earned from the 0.05% protocol swap fee could be given to integrators or referrers. This would incentivize platforms to route more volume through Uniswap, and LPs would come out ahead as long as trade volume increased by at least 20% (to counterbalance their earnings reductions from lower swap fees). In the shorter term, we could also subsidize integrators via UNI distributions instead of re-routed swap fees. But we would need to ensure that the UNI subsidy never exceeds the swap fee, otherwise there would be perverse incentives for wash trading. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.638095238095238
                },
                {
                    "author_link": "https://gov.uniswap.org/u/PureSubstance",
                    "index": "3",
                    "likes": "1",
                    "time": "18/11/2020-21:01:03",
                    "content": "@g_dip very thoughtful insight. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.6
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Obikawa",
                    "index": "4",
                    "likes": "0",
                    "time": "19/11/2020-07:25:54",
                    "content": "I am reluctant to provide liquidity, because the fees are paid with the weaker currency. Think about the WBTC - DAI pair. The “reward” for this pool is a growing stack of Dollars. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/refri",
                    "index": "5",
                    "likes": "1",
                    "time": "19/11/2020-14:58:34",
                    "content": "but if btc price goes down again you’ll buy with your earned DAI. In the long term you’ll earn if there is enough fluctuation in price. ofc it’s always good to provide just part of you liquidity and not all of it, how much depends on you personal investment goals. For diversification I use about a quarter of my crypto holdings as lp, some is in stake and about half is in wallets and on CEX. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.3769841269841265
                },
                {
                    "author_link": "https://gov.uniswap.org/u/UnITeoO",
                    "index": "6",
                    "likes": "0",
                    "time": "19/11/2020-15:26:39",
                    "content": "Hi, I do not know if is much connected to the article but I’d like to mention as a liquid provider at Uniswap mining program for a middle and low section of providers are full of crap though! I do not want to mention exactly how much I provide and for how long but trust me your mining program is full of jokes! Maybe the “Big guys” are happy with the mining program cause they hold a massive percentage of the pools and massive return on mining but if you are middle like me pfff guys come on…better to scratch lotto cards… If the rewards are not fixed and made of some point better soon nobody even gonna remember Uniswap Thank you ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.51171875
                },
                {
                    "author_link": "https://gov.uniswap.org/u/refri",
                    "index": "7",
                    "likes": "0",
                    "time": "19/11/2020-15:30:31",
                    "content": "Don’t know what you mean, there isn’t a ‘mining program’ right now. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.9330357142857135
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Uni3",
                    "index": "8",
                    "likes": "0",
                    "time": "19/11/2020-15:49:37",
                    "content": "We can see that drop in ETH-USD pairs liquidity didn’t have impact on volumes in this short period. Returns on those pairs are over 10% APY. Potential LP tokens are TopX(ex.50) tokens by market cap with volume over $XXmil (ex.50) Our treasury is too big 14mil x$3.5= $49mil per month… majority of this tokens should be burned in my opinion. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/g_dip",
                    "index": "9",
                    "likes": "2",
                    "time": "19/11/2020-16:37:41",
                    "content": "Yes, the incentive to wash trade would need to be factored in from the get-go. But imagine Robinhood integrating Uniswap as its primary crypto-to-crypto trading venue - it would be unstoppable. As you mentioned, traditionally you could handle this with a legal contract. We’ll have to get more creative. One idea is to have integrators submit proposals to Uniswap governance, where integrators must be onboarded one by one. For instance, there could be two tiers of volume-incentivized integrations proposals: (a) Exclusive integrator - Uniswap is the only venue where users can trade crypto-to-crypto (b) General integrator - Uniswap is one of many venues where users can trade crypto-to-crypto This would allow us to reward group (a) to a greater extent than group (b), and would allow governance to turn rewards on/off based upon compliance. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.949999999999999
                },
                {
                    "author_link": "https://gov.uniswap.org/u/refri",
                    "index": "10",
                    "likes": "0",
                    "time": "19/11/2020-18:10:40",
                    "content": "not sure if I like the idea of more incentive for exclusive integrators, uniswap should become (or remain) the best place to trade, incentive for exclusive integrators seems like buying trading volume to me and I wouldn’t use an integrator that is going for this. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.083333333333334
                },
                {
                    "author_link": "https://gov.uniswap.org/u/g_dip",
                    "index": "11",
                    "likes": "2",
                    "time": "19/11/2020-20:09:12",
                    "content": "But the point is not to get users like you, it’s to tap into ecosystems that we don’t already have access to. Robinhood, which does not let you transfer crypto out of the app, is a good example. By isolating distribution channels which increase volume regardless of liquidity, it will draw more LPs over time, enforcing Uniswap as the best place to trade. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.666666666666668
                },
                {
                    "author_link": "https://gov.uniswap.org/u/refri",
                    "index": "12",
                    "likes": "2",
                    "time": "19/11/2020-21:12:31",
                    "content": "valid point , But if Robinhood don’t allow the transfer of crypto out of the app (and maybe also no transfer into it? I havent tried the app so far) it might not fit their concept to allow routing through Uniswap cause they like to be the mm theirselvs? Would a CEX route their trades through Uniswap?  Anyway, I get your point: looking for ways to attract trading and liqudity from places far outside the defi space is worth thinking about. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.300000000000001
                },
                {
                    "author_link": "https://gov.uniswap.org/u/1xiao",
                    "index": "14",
                    "likes": "0",
                    "time": "12/05/2021-08:20:12",
                    "content": "Why I was attracted:  Security (decentralized, famous) Free transaction (no accumulating large amount of handling fees will occur) Easy to use (a small amount of information interface)  Reasons for long-term use:  High yield Looking forward to higher returns from V3  doubt:  Is interest compounded?  May improve:   Simplified interface: Preset popular swap combinations, such as eth: usdt 1:1 automatically exchange 1000 USD, 5000 USD, 10000 USD【YES】【NO】 No need to search for coins (default), no need to enter numbers (default), no exchange (automatic)   Explain compound interest   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.282010582010582
                }
            ]
        }
    ],
    "group_index": "485"
}