{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/urgent-discussion-on-current-vote-reduce-uni-governance-proposal-quorum-thresholds/7117",
            "title": "URGENT discussion on current vote: \"Reduce UNI Governance Proposal & Quorum Thresholds\" ",
            "index": 7117,
            "category": [
                "Proposal Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/uni0",
                    "index": "1",
                    "likes": "29",
                    "time": "13/10/2020-12:52:34",
                    "content": "Reduce UNI Governance Proposal & Quorum Thresholds Is a proposal by Gauntlet @Tarun and Dharma. Currently up for vote. It stems from the community discussion: Proposal: Reduce amount of UNIs required to submit governance proposal the proposal by Gauntlet @Tarun and Dharma proposes not one, but two things:   Lowers proposal threshold from 10M to 3M UNI   Lowers quorum threshold from 40M to 30M UNI   These are two distinct changes with two VERY different consequences. THEY SHOULD THEREFORE BE TWO DISTINCT PROPOSALS. We, as a community, should be VERY wary of proposals including changes that are NOT core to the main proposal. These are called “Riders” And should not be welcomed into uniswap governance! VOTE AGAINST. SPLIT IT UP. ",
                    "links": [
                        "https://en.wikipedia.org/wiki/Rider_%28legislation%29",
                        "https://gov.uniswap.org/t/proposal-reduce-amount-of-unis-required-to-submit-governance-proposal/3320/55"
                    ],
                    "GPT-summary": "The post is discussing a proposal to reduce UNI Governance Proposal & Quorum Thresholds by Gauntlet @Tarun and Dharma. The author of the post is explaining the proposal and urging the community to vote against it, arguing that the proposal includes two distinct changes that should be split into two separate proposals. The post also invites constructive criticism and questions about the proposal.",
                    "GPT-proposal-categories": [
                        "Board composition",
                        "Change to proposal pipeline",
                        "Token economics",
                        "Law and regulations",
                        "Community and engagement"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.113095238095237
                },
                {
                    "author_link": "https://gov.uniswap.org/u/kolten",
                    "index": "2",
                    "likes": "0",
                    "time": "13/10/2020-17:55:26",
                    "content": "@uni0 can you please specify the proposals name in the title for archival purposes? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/uni0",
                    "index": "3",
                    "likes": "3",
                    "time": "13/10/2020-17:58:46",
                    "content": "Changed, hope this is what you meant. Thanks! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Buckerino",
                    "index": "4",
                    "likes": "15",
                    "time": "13/10/2020-20:46:19",
                    "content": "Yes, it is Dharma´s way of saying: We couldnt get you to give us free money so we will try to lower the quorum and pass it ourselves without you. VOTE NO! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely negative feedback on proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/TMod_Marco",
                    "index": "5",
                    "likes": "12",
                    "time": "13/10/2020-21:42:10",
                    "content": "Hi Uni, Personally, I agree these are two very different proposals. Therefore, I voted no on this proposal. I’d recommend them to create two separate proposals for these and carefully describe the consequences were these proposals to be approved. Then again, it’s up to the community (UNI holders) and we’ll see what’ll be decided. Be interesting to see a discussion regarding this here on the forum. Edit; before getting any comments regarding me expressing my opinion as a forum moderator: I do this voluntarily, I’m not part of the Uniswap team and this does not affect my moderation decisions  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Dmills",
                    "index": "6",
                    "likes": "1",
                    "time": "13/10/2020-22:37:11",
                    "content": "I haven’t voted yet still kinda unsure how to, but it’s seems that everyone is voting yes for it? When do I have to vote by? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Uniguy772",
                    "index": "7",
                    "likes": "1",
                    "time": "14/10/2020-00:17:49",
                    "content": "Depends where you are in the world. If you go to https://app.uniswap.org/#/vote/1 it should say below the title when voting ends for you ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/rabbidfly",
                    "index": "8",
                    "likes": "1",
                    "time": "14/10/2020-02:46:55",
                    "content": "If two separate changes are proposed to achieve a single goal, then splitting it accomplishes the opposite of your intent. We will have a lengthier process consuming a greater proportion of the community’s time. Instead of having a focused conversation around the goal, you are asking us to spend unnecessary effort understanding the context across two separate proposals that are intentionally linked. If this was your intent all along, then i’ll introduce you to another term. It is called ‘filbustering’. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.035714285714286
                },
                {
                    "author_link": "https://gov.uniswap.org/u/uni0",
                    "index": "10",
                    "likes": "4",
                    "time": "14/10/2020-12:50:22",
                    "content": "These two changes do NOT achieve a single goal. Letting people propose easier is NOT the same as reaching quorum easier. Gauntlet and Dharma collectively have 30m votes, they are proposing a 30m quorum so that they can push through any proposal they like. (Dharma might feel strongly about one particular proposal) We can only hope that people that haven’t voted yet see this as the attack on governance that it is and VOTE NO! ",
                    "links": [
                        "https://gov.uniswap.org/t/retroactive-airdrop-excludes-proxy-contract-users-e-g-dharma-matcha-etc/1222"
                    ],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.5285714285714285
                },
                {
                    "author_link": "https://gov.uniswap.org/u/rabbidfly",
                    "index": "11",
                    "likes": "2",
                    "time": "14/10/2020-12:55:38",
                    "content": "The UNI voting community that you claim to represent feels otherwise. 98% of the vote.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/uni0",
                    "index": "12",
                    "likes": "6",
                    "time": "14/10/2020-13:00:53",
                    "content": "… The 30m “YES” is DHARMA and GAUNTLET. They have 30m votes, and they have used them to propose and vote. Despite this seemingly overwhelming “community support” for “Yes”, the UNI community is actually voting NO. Like they should be if they care about fair governance! ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 7.291666666666666
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Pipo-Mandarina",
                    "index": "13",
                    "likes": "4",
                    "time": "14/10/2020-13:01:40",
                    "content": "Those 30m yes are two delegates, Dharma and Gauntlet… it’s not a coincidence they are pushing to lower the limit to 30m and they have a combined voting power of 30m… ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/rabbidfly",
                    "index": "14",
                    "likes": "2",
                    "time": "14/10/2020-13:35:11",
                    "content": "@uni0 and @Pipo-Mandarina. I understand what you are asking for. I get the sentiment. Unfortunately you can’t “yes…but” the structure of a DAO governance vehicle. What would you propose? Undelegating Dharma and Gauntlet’s vote? DAOs, in principle, exist precisely to prevent that kind of manipulation. It appears that you have 2 issues that are far more important to discuss.  The design and process of the voting mechanism. The choice of UNI voters to delegate to the twin evil empires  Honestly guys. You have lots of energy that is being misspent here. In order to justify your claims, you are trying to characterize the Dharma proposal as a disingenuous unethical cash grab. Do you have proof of that? Have you considered that Dharma has nothing more than the good will of their users to gain? Have you also considered that your mischaracterization is bordering on slander towards a great project that is servicing consumers with a much needed mobile product? (in full disclosure, i used them once or twice to try it out - i have nothing to gain from this proposal however). I understand the psychology. You feel passionate about your position, and you will create whatever fictional narrative you can summon to justify your position. In this case, characterizing @nadav_dharma as an evil despot looking to make a getaway with a paltry few UNI tokens, is factually incorrect. He is a servant leader trying to build a community. He is extremely respectful, considers both sides, and always solicits the opinions of those who don’t agree in order to engage in productive dialog. You should talk to him directly, instead of making loud appeals to the UNI community to filibuster this vote. Btw, the goal is singular. It is a proposal designed to “make the voting mechanism usable and coherent”. At some point in the future you will appreciate this, especially when much needed reforms are able to leverage the newly designed constraints. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.787272727272727
                },
                {
                    "author_link": "https://gov.uniswap.org/u/chrisblec",
                    "index": "15",
                    "likes": "5",
                    "time": "14/10/2020-13:41:59",
                    "content": "I appreciate the points that you are raising. I agree with you and will vote NO. Is there anywhere that we can look to confirm that the majority of the YES votes are coming from Dharma and Gauntlet?   twitter.com    Chris Blec (ChrisBlec)  If \"FOR\" wins, then @NadavAHollander and @tarunchitra will have enough power to control the outcome of *every* Uniswap vote.  1st thing Nadav plans to do is vote-in a $UNI airdrop to his Dharma users from the \"community treasury\".  If this isn't a governance attack, then what is?  6:53 AM - 14 Oct 2020       ",
                    "links": [
                        "https://twitter.com/ChrisBlec/status/1316376544051429376?s=20",
                        "https://twitter.com/ChrisBlec/status/1316376544051429376?s=20"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://gov.uniswap.org/u/uni0",
                    "index": "16",
                    "likes": "4",
                    "time": "14/10/2020-13:56:18",
                    "content": "You can check that Gauntlet and Dharma have 30m votes by going Here, or by running the queries yourself at the contract We know that Gauntlet and Dharma are behind this proposal. Gauntlet said that they voted yes Dharma said that they voted yes This is a clear takeover attempt. ",
                    "links": [
                        "https://etherscan.io/address/0x1f9840a85d5af5bf1d1762f925bdaddc4201f984#readContract",
                        "https://gov.uniswap.org/t/proposal-reduce-amount-of-unis-required-to-submit-governance-proposal/3320/29",
                        "https://twitter.com/gauntletnetwork/status/1315831922711564294",
                        "https://twitter.com/Dharma_HQ/status/1315724871112945664"
                    ],
                    "GPT-discussion-categories": [],
                    "Sentiment": 4.25
                },
                {
                    "author_link": "https://gov.uniswap.org/u/rabbidfly",
                    "index": "17",
                    "likes": "2",
                    "time": "14/10/2020-14:04:07",
                    "content": "Is committing slander without proof a value that ‘you’ support, or are you suggesting that you represent the sentiment of the entire Uniswap community? I sincerely hope it is the former. Your tweet “If this isn’t a governance attack, then what is?”. Ummm, i dunno. Maybe someone is using initiative and trying to repair the voting mechanism. Must there be evil intent simply because you disagree or harbour fantastical narratives about an elaborately concocted attempt to overthrow UNI governance? The simplest answer is the most logical. @nadav_dharma is just trying to do the right thing. Maybe if you read his posts you’ll reconsider your position. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party questioning the author's claims",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.575396825396826
                },
                {
                    "author_link": "https://gov.uniswap.org/u/chrisblec",
                    "index": "18",
                    "likes": "6",
                    "time": "14/10/2020-14:07:27",
                    "content": "Slander requires a falsehood. I said nothing false. I didn’t say “If this isn’t a governance attack, then what is it?” I said “If this isn’t a governance attack, then what is?” Meaning that this very clearly fits my understood definition of an attack on a decentralized governance system. 2 humans are attempting to create an environment where the community becomes completely irrelevant and they control the outcome of every vote. That is a very clear attack on decentralization and if it’s not stopped, it will make a complete mockery of Uniswap’s governance going forward. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.46
                },
                {
                    "author_link": "https://gov.uniswap.org/u/rabbidfly",
                    "index": "19",
                    "likes": "1",
                    "time": "14/10/2020-14:25:19",
                    "content": "we are starting to sound like lawyers i also despise semantics and cannot practice proper sophistry now let’s agree to disagree - i think i’ve exhausted my argument and will leave it to you enjoy the discussion, but please consider the possibility that your suspicions may be incorrect (i’m not saying you are wrong - just that it is highly unlikely) critical thinking is a must in any dialog - all sides must be considered thoughtfully ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 4.888888888888888
                },
                {
                    "author_link": "https://gov.uniswap.org/u/chrisblec",
                    "index": "20",
                    "likes": "5",
                    "time": "14/10/2020-14:39:46",
                    "content": "I am not casting any suspicions. I am only dealing in facts. 2 parties are very clearly working together to take governance power away from the community, with an immediate goal of using the community treasury to please the users/customers of 1 of said parties. This is all fact. This is what we are talking about. It’s very clear what is happening. Now, the question is, can the users do anything about it? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely negative feedback on proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.433333333333334
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Zer0dot",
                    "index": "21",
                    "likes": "3",
                    "time": "14/10/2020-15:05:39",
                    "content": "It’s important to keep in mind that regardless of the impact of a potential airdrop- Uniswap is open source and fork-able. If the community doesn’t like it, they can clone it. This creates an interesting dynamic where incentives are (hypothetically) aligned between large and small members. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.61734693877551
                },
                {
                    "author_link": "https://gov.uniswap.org/u/kaibakker",
                    "index": "22",
                    "likes": "7",
                    "time": "14/10/2020-16:27:13",
                    "content": "We need some UNI whales to vote NO! I would like to have the threshold be lowered for proposal creation to 3m. Someone should make this a separated/competing proposal to raise attention. Is there a delegate that supports this view? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/dcota",
                    "index": "23",
                    "likes": "2",
                    "time": "14/10/2020-17:25:44",
                    "content": "I have a doubt here, Isn’t quorum the minimum required to vote for passing a proposal?, but not necessarily means you have the majority to pass all proposals. Lowering the quorum from 4% (40 Million Uni) to 3% (30 Million UNI) only works on favor of the majority members when the other minorities abstain or neglect voting.  In this case that means that if 97% of the other UNI holders don’t vote or don’t care about the governance As of now I think Dharma has 15.5 Million UNI votes, and Gaunlet 13.7 Million UNI. Together they have majority power to pass a proposal at 4% or 3% Quorum regardless; I guess is more a matter of  the remaining (current supply) 156 Million UNI holders actively participating or not. Am I interpreting how this works correctly? ",
                    "links": [
                        "https://gov.uniswap.org/t/decrypt-article-uniswap-governance-proposal-sparks-controversy/7220/2"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.083333333333333
                },
                {
                    "author_link": "https://gov.uniswap.org/u/uni0",
                    "index": "24",
                    "likes": "1",
                    "time": "14/10/2020-22:06:41",
                    "content": "No that isn’t right, you need 40m votes on “yes” to reach quorum, not 40m total, as per the UNI blog post. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.7142857142857135
                },
                {
                    "author_link": "https://gov.uniswap.org/u/TMod_Marco",
                    "index": "25",
                    "likes": "5",
                    "time": "15/10/2020-14:52:23",
                    "content": "Hi all, I’m noticing a lot of posts flagged ‘against’ this proposal. Please, this is a discussion forum. That being said, everyone is entitled to their opinion as long as it’s backed by arguments. If more false reports happen, then I’ll see to discuss with the moderation team to have this punished. Enable everyone to speak their mind, this is an important proposal. And, don’t attack someone sharing their thoughts, provide arguments once again (counts for flags throughout the whole forum). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.6499999999999995
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Buckerino",
                    "index": "26",
                    "likes": "4",
                    "time": "15/10/2020-15:38:11",
                    "content": "Paltry few UNI tokens??? You mean five milion UNI tokens?  I second the voices that are against this proposal and I think they have good arguments against it which everybody ignored. Nobody (Dharma and Gauntlet) is willing to discuss any concessions, they just want to shove it down everybody´s throat. There is the reason why everybody thinks its despotic. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.234953703703704
                },
                {
                    "author_link": "https://gov.uniswap.org/u/graeme",
                    "index": "27",
                    "likes": "7",
                    "time": "15/10/2020-15:54:42",
                    "content": "Hmmm, just to be clear: Dharma itself doesn’t get UNI from its proposal for retroactive distribution. It’s the users of multiple wallets (Dharma, Argent, etc.) who will receive the UNI, for trading on Uniswap via meta-transactions. I think this is in alignment with the goals of the initial distribution of token, and it’s not a play by Dharma to get tokens for itself. It’s also a very fair way of distributing tokens to more people, because we know that there is very likely one single address per real user. Disclosure: I work at Dharma, but I do think this is true. Nadav and others involved are doing a lot of work on behalf of thousands of people in the community who did use Uniswap before the distribution. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.104761904761905
                },
                {
                    "author_link": "https://gov.uniswap.org/u/uni0",
                    "index": "28",
                    "likes": "7",
                    "time": "15/10/2020-16:55:36",
                    "content": "Whether or not you support airdropping users who didn’t visit Uniswap at the expense of the Uniswap community treasury, isn’t actually the point @Buckerino is making here. It’s the way you decided to pursue your goal that is the point. Trying to fool users into thinking that it is a good idea to reduce the quorum threshold to the amount you yourself hold, with some smart sounding language and Python calculations is not okay. This is clearly a takeover attempt. Simple as that. Your goal doesn’t even matter at this point, even if it is well-meaning. If you want a handout from the community fund, maybe you should ask? Instead of stealing it? ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.636904761904762
                },
                {
                    "author_link": "https://gov.uniswap.org/u/graeme",
                    "index": "29",
                    "likes": "3",
                    "time": "15/10/2020-17:17:54",
                    "content": "But Dharma doesn’t really hold any UNI. It’s not a “bagholder”, as Decrypt argued. There are some investors, who are not invested in Dharma, who have delegated to Dharma for this proposal. But this delegation is revokable, and is just a vote of trust. If it looks like Dharma is doing anything that is misaligned with the UNI community’s best interests, that delegation will be removed, and Dharma will have absolutely no ability to propose or pass anything – regardless of whether the threshold decreases significantly. I think there’s a more realistic concern about whether large exchanges may acquire enough UNI to affect proposals - for example, a large exchange like Binance. But I think the current proposal is conservative enough to avoid that scenario. My argument for passing the proposal is that I think we should prove that UNI governance can work, in the same way that Compound governance has proven to work and be effective. Dharma played a large role in Compound’s governance so far, which has been positive in terms of showing that it is a decentralized protocol. I believe proving that the token can create effective governance should be a priority for the community, and to show that it isn’t just the UNI team, or elite investors, who control the protocol. Dharma is neither of those things, and retroactive distribution brings more people into the community of token holders. So I view it as a perfect opportunity to show how well decentralized governance can work. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.529420141262246
                },
                {
                    "author_link": "https://gov.uniswap.org/u/uni0",
                    "index": "30",
                    "likes": "7",
                    "time": "15/10/2020-17:35:11",
                    "content": "    graeme:  But Dharma doesn’t really hold any UNI   Dharma’s entire voting pool is created by less than 50 addresses. This is provable, and easily available information over at Dune Analytics. It’s not a community effort, not even close. There are clearly special interests involved.     graeme:  But I think the current proposal is conservative enough to avoid that scenario.   What do you have against exchanges exactly? Shouldn’t the argument be that no single outside entity should be able to overthrow governance? If so, you fit into this category yourself. And also… Have you seen the release schedule? Binance will probably have over 30m uni quite soon, this change is extremely short-sighted and clearly only made to benefit yourself short-term. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.661139455782313
                },
                {
                    "author_link": "https://gov.uniswap.org/u/rabbidfly",
                    "index": "31",
                    "likes": "4",
                    "time": "15/10/2020-17:40:04",
                    "content": "Well said graeme. I think that as long as we swirl in the narratives  “trying to fool users into thinking that it is a good idea to reduce the quorum threshold” “This is clearly a takeover attempt”  any attempt at rational, objective discourse, is, well, hard to justify I facilitate large corporate groups all day long, so i have a feel for how this works. The pointless rhetoric that camouflages itself as ‘discussion’ will continue until we ask pointedly… @uni0 @Buckerino @chrisblec  Why do you believe that Dharma is attempting to fool the entire Uniswap community into accepting a lower voting threshold? What proof do you have of this or is it just an ‘opinion’? Have you reached out to Dharma directly to ask for an equally direct response to your claim? If this is a takeover attempt, what do you believe the goal is? All takeover attempts that require this much investment in time and energy have an ideological foundation. Do you think Dharma is trying to financially benefit? Perhaps they are doing it as a part of an elaborate social experiment? Or maybe there are esoteric plans afoot that we aren’t aware of but should guard against? Have you considered that maybe the ideological foundation is quite ethical and interested in benefiting the UNI community? A rational mind would exhaust both possibilities before attempting to put pen to their thoughts. Finally, what do you have to gain from filibustering and getting the proposal to fail? Have you been transparent with your motivations in doing so? How would the UNI community gain from a failed proposal? Do you have an alternative to the proposal? Listening to people complain about stuff but doing nothing to offer alternatives leaves a certain distaste that is true of any human social interaction.  Look, the point is that conspiracy theories are fun to elaborate on. It fulfills our inner sense of value and how we perceive the world. However, they rarely have any substance. Here’s what i recommend. Create a post and ask your questions directly to @nadav_dharma and @gauntlet. Get it from the horse’s mouth. If you are unwilling to challenge them in person, then they have no choice but to treat your accusations in the same light. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.4853896103896105
                },
                {
                    "author_link": "https://gov.uniswap.org/u/uni0",
                    "index": "32",
                    "likes": "7",
                    "time": "15/10/2020-18:24:41",
                    "content": "Sure, happy to answer…        rabbidfly:  Why do you believe that Dharma is attempting to fool the entire Uniswap community into accepting a lower voting threshold?   To be able to push their Proxy airdrop proposal through, and anything else they might want to do.     rabbidfly:  What proof do you have of this?   Proof that this is what is happening is all over this thread. It also makes logical sense.        rabbidfly:  If this is a takeover attempt, what do you believe the goal is?   Dharma has a lot to gain from supplying their users with this money. It buys good-will, something very valuable in business as you probably know. It’s also a very good look for them in the sense that it creates precedence for multiple proxy airdrops for Dharma users. Dharma is not Uniswap dependent. … Also a takeover attempt of a community treasury is inherently bad, regardless of the goal.     rabbidfly:  Have you considered that maybe the ideological foundation is quite ethical and interested in benefiting the UNI community?   A takeover of a community fund to buy goodwill from your users is not ethical, and I don’t believe it benefits the UNI community.        rabbidfly:  what do you have to gain from filibustering and getting the proposal to fail?   It is impossible to filibuster this? This is just a community discussion.     rabbidfly:  How would the UNI community gain from a failed proposal?   Having actual governance and not dictatorship is, I believe, a good thing. Getting to actually have a fair vote on the proxy proposal is a good thing.     rabbidfly:  Do you have an alternative to the proposal?   Did you read this post? SPLIT IT UP.     rabbidfly:  Create a post and ask your questions directly to @nadav_dharma   I have tagged @nadav_dharma @Tarun several times. Both here and on the main proposal discussion. I hope they show up to explain themselves… ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.76304347826087
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Joshuawakefield",
                    "index": "33",
                    "likes": "1",
                    "time": "15/10/2020-18:59:51",
                    "content": "Think you are stressing for no reason. It doesn’t look like they can get 40 million quorum. Not sure why they proposed it if some of their members aren’t voting. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 3.75
                },
                {
                    "author_link": "https://gov.uniswap.org/u/chrisblec",
                    "index": "34",
                    "likes": "7",
                    "time": "15/10/2020-21:30:47",
                    "content": "We answered a lot of these questions on this live stream today. I am posting it here because it is 100% relevant content. Sorry if I’m breaking any rules. https://www.youtube.com/watch?v=SJrazSFZsdo ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0606060606060606
                },
                {
                    "author_link": "https://gov.uniswap.org/u/rabbidfly",
                    "index": "35",
                    "likes": "2",
                    "time": "16/10/2020-01:03:49",
                    "content": "Listened to the discussion. Thanks for adding value to the community through open discourse. I’ll share my thoughts if anyone wants to geek out on philosophy, anthro-complexity, economics, etc. Be warned TLDR: humans are complex social beings and we are far better served finding ways to achieve working compromise, than to demonize each other simply because our values differ. If Dharma refuses to engage in this dialog, then we have no choice but to assume they are complicit by absence. If however, they choose to collaborate on a solution but we continue to vacillate in our refusal to empathize, we are complicit by choice and have undermined our right to an objective opinion.    The assumption that a ‘for profit’ organization has nothing but self-interest in mind is extremely problematic. The core polarity fallacy that if it’s not black, it must be white, is central here. Just because you are ‘for profit’, does not mean that your corporate value system focuses solely on driving revenue to sate the maniacal appetites of their shareholders. This is a blessedly naïve perspective of the world. Dharma is definitely fighting to establish a viable business model, but can we seriously kangaroo-court them into a ‘corporation’ stigma, and by association, assume arbitrarily that their actions should all be examined through the lens of ‘evil centralized interests’? We are acting precisely in the manner with which we are accusing them, but standing behind our value system as justification. Centralized vs decentralized. Representation vs Plutocracy. Polarities are fallacies, because most of life is lived in the middle - a spectrum.   The romanticism around decentralized permissionless governance is quaint, but they don’t address human nature and what we know of behavioural economics. Humans are hierarchical. Even as hunter gatherers we operated within a social hierarchy - if not a power hierarchy. Whether it is a token, or fiat, or social recognition, or kudos, all systems migrate towards autopoietic balance - or centralized control. If i can buy, or take, or trick others into giving me that item of intrinsic value, then i will do whatever is necessary to acquire it. The incentive is far too enticing to avoid for long. Eventually, power consolidates, or social influence consolidates into a systemic balance. Maybe technology can overcome this, but not for a very long time - our cognition is not wired for that degree of critical thought. Dharma is utilizing whatever means they have within the rules to achieve their ‘noble’ outcome. Everyone’s version of nobility differs of course, but we cannot immediately assume that a substantial delegate in the system went through all that trouble only to undermine the same system. If they are truly a ‘for-profit’ organization, there are far better and more effective ways to establish your brand presence, than to mount a ‘take-over’ campaign like we were trapped in a Sun Tzu essay 1000s of years after it was written. That is soo 90s corporate. Today, boardrooms are grappling with complexity - not the ‘competition’.   The one token - one vote is incredibly short-sighted, which you guys recognized. The ancient greeks made it work in a village town square where the numbers never exceeded 100s, and where decisions had existential consequences. When the Romans capitulated into an Empire, democracy died with it. That was a long time ago. Today, decentralizing decision making on a planet of 6 Billion is riddled with issues. The assumptions that you are forced to adopt includes a knowledgeable, conscientious voter who has the greater interests of the group in mind. If you cannot assure that, then you are left with adopting a delegate model, because like Plato’s philosopher king, the decision making is then given to a trusted person that has earned the right. In our case, delegates have to use social influence to acquire tokens, which renders them as no better than a politician. This is a horribly broken system. The solutions, sadly, are emergent. We simply don’t know because humanity has never been here before. I can suggest one thing however. Systems that adapt successfully are those that can change as quickly as the underlying context. This is the basis of Complexity Science and what it has taught us. Experimenting with different forms of governance, and yes, failing forward, will get us closer to an emergent solution that works ‘better’. I’m sure political scientists and marcro economists are busy writing papers about this as we speak. If however, we don’t have a fast feedback loop in our governance structure, then whether through voter apathy or highly restrictive governance constraints, the absence of a self-healing mechanism will not allow Uniswap to evolve quickly enough to avoid it’s own demise (all systems fight entropy in their own way - eventually most fail - look at the turnover of the fortune 500 for proof of this mechanism). This only leads towards one outcome. I like the idea of autonomous proposals to help solve that!   We are the trail blazers here, but we are fighting the most challenging of all possible challenges - humanity. In some ways, we are inquiring into human psychology and attempting to version it socially. Not an easy task, but who knows, with recent development in epi-genetics, it could work!  I don’t have answers, but I do know one thing. Demonizing people or entities autonomically because of a perceived difference in ideologies, will get us nowhere. We may as well crawl back into that cave and we’ll get exactly what we deserve - crypto or otherwise. There are lots of upcoming disruptive technologies that will make crypto seem like solving a rubik’s cube (AGI for example). If however, we enter into open dialog where the intent is to achieve, NOT consensus, but something better as a result of the collaboration. Something unique, perhaps innovative, then we have unlocked the human potential for endless creativity. What I have objected to all along on this thread is not whether Dharma gets or does not get an opportunity to reward their poor idle, and mostly completely oblivious users who’ll never know that they can ‘claim’ any UNI. It was always about the knee-jerk reaction that many of us tend towards because of the perceived assault on our value system and our beliefs. The variety in values will always be there, unless we are condoning a 1984-like conditioning campaign. Finding ways to achieve effective compromise is the only way forward. What will happen when the world figures us out and massive fiat starts getting pumped into the system?  The lobsters will very quickly sort out their hierarchy. Our biology dictates it. Can we sort out the technology to solve this inevitability? I doubt it, but it’s definitely worth the attempt. p.s. I’m still a bit of a crypto neophyte, but why can’t we have a 1-wallet address 1-vote system? The address is weighted slightly by tenure of stake and size of stake, but only to incentivize good behaviour. KYC seems to be the only hiccup, because otherwise I’d just create bots to mount a sybill-like attack. What if KYC established uniqueness of your identity but without centrally hosting those details? I’m sure there is something like this out there. Anyway, just thinking out loud. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.561766265912306
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Joshuawakefield",
                    "index": "36",
                    "likes": "3",
                    "time": "16/10/2020-02:25:49",
                    "content": "God damn that intro is too long. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://gov.uniswap.org/u/sommi",
                    "index": "37",
                    "likes": "3",
                    "time": "16/10/2020-03:55:42",
                    "content": " Dharma are attempting a backdoor take-over. Uni is for everyone. Retroactive drops are not the ethos of Cryptocurrency. Vote NO to Dharma scum for trying to ruin the system! This Magical Unicorn has a long and healthy life ahead of it.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.71875
                },
                {
                    "author_link": "https://gov.uniswap.org/u/frdsofficial",
                    "index": "38",
                    "likes": "1",
                    "time": "16/10/2020-04:06:54",
                    "content": "Below, words of @strangechances . \"I would emphatically clarify three points about the UNI discussions regarding retroactive distribution and lowering thresholds. There’s a lot of misinformation surfacing in the forums and media, and misinformation is bad for governance. So let me share these assertions:  Dharma itself does not get UNI from its proposal for retroactive distribution. It’s the users of multiple wallets (Dharma, Argent, etc.) who will receive the UNI, for trading on Uniswap via meta-transactions. This is in alignment with the goals of the initial UNI distribution. Dharma is not a UNI “bagholder”, and there is no chance of Dharma “controlling Uniswap”. This is something that was incorrectly argued by blockchain media company Decrypt. Some investors, who are not invested in Dharma, have delegated to Dharma, and this is a vote of trust. If the Uniswap Governance parameters remain the way they are (40m UNI), it’s unlikely that any decentralized UNI governance could happen this year. Either voter participation or share of delegation needs to increase significantly for it to be viable. Further discussion: I believe UNI community should prioritize proving that decentralized can governance work. The retroactive distribution proposal is fair and lower risk than the initial distribution, since we know there is a 1:1 user:address relationship. It’s a great step.\".  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.375
                },
                {
                    "author_link": "https://gov.uniswap.org/u/SlowChimera",
                    "index": "39",
                    "likes": "0",
                    "time": "16/10/2020-11:17:02",
                    "content": "There doesnt appear to be any benefit for a smallish holder to actually vote no here.  My small holdings arent going to make any significant change to the ratio. The proposal will pass or fail on whether it reaches quorum, so rather than persuading people to vote no, its more a case of persuading them to not vote yes (and not delegating to those who may). I’m a soft no to this proposal, because as the OP points out, its two different things and should be seperated and its also too soon to start making very significant governance changes proposed by a high level holder which gives them additional power. I dont see anything necessarily nefarious in it, but I’m very aware that blockchain governance is in its infancy and my concern is that it may transpire that there is no way to reverse it, as it becomes easier for large holder to shut down reversal routes. There is a low level awareness among ordinary uni holders (and for many of them, this will be the first time that they have held a governance token) about their responsibilities. Even although I have some familiarity with governance, I dont know how to delegate my votes responsibly, because I dont really have a feel for the ethos and values of those who I may delegate to, and the gas fees for voting directly with such a small holding are an inhibitory factor ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party giving entirely negative feedback on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.4559613997114
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Mr_Po",
                    "index": "40",
                    "likes": "9",
                    "time": "16/10/2020-11:41:07",
                    "content": "Good job, @uni0, on defending the Uniswap governance.   Fundamentally, there is no reason to lower the quorum threshold.  You already only need 21% of the current supply to vote yes - and it will come down to 4% eventually. I don’t think that many voting decisions need to be passed during the first few months of Uniswap governance. We simply don’t have the safety practices in place yet. No teams to develop proposals, no audit teams to verify that the proposals are solid.  When it comes to the Dharma & Gauntlet group of interest, we can identify a couple of things about them.  The goal: they want to get another UNI airdrop. a) When it comes to UNI airdrop itself, I see no reason for it to be done. It is somewhat clear now that airdropping UNI is not an efficient way to build the community to govern the protocol. There are a lot of better ways. Just think about it: 251k addresses received free UNI, and most topics on the governance forum don’t reach 1k views. b) How much UNI do they want to get airdropped on them exactly? If they already have 30m votes, how much more will they gain from this airdrop? What percentage of the supply do we find reasonable for this group of interest to have? Keep in mind that it’s much easier to act as a single entity. You could view one vote from a single entity as 2 or 3 votes from not mobilized voters. So, Dharma & Gauntlet group of interest want to:  Lower the quorum so that they can reach it without community support. Lowering the quorum is harmful to the protocol in its early governance stages. Effectively send themselves the UNI from the governance treasury, which in turn means giving themselves more voting rights.  The method: delegates use deceptive tactics.  The rider problem has been mentioned a lot here already. The justification for lowering the quorum threshold is highly speculative. The analysis is made in a way that would fit the desired outcome.  Let’s take a close look at this post. It looks smart. All that code in it makes it look nifty. The code is not understood by most people who read it, but it creates a reputational signal. There’s code, graphs, Nansen, PGP signatures. But there is no essence to it. Creating a model based on the assumption that Binance will always have 25m UNI tokens just doesn’t make sense. And there is no disclosure in this post of how the proposed changes benefit the Dharma & Gauntlet group of interest. The real analysis of the implications of lowering the quorum threshold would be about how it would feed into Dharma & Gauntle’s ability to distribute the governance treasury towards themselves. That is a much more real and apparent issue. And make no mistake, by “themselves,” I mean the whole group of interest and not just its representatives. This group has an interest in getting free UNI. And by getting free UNI, it will get more control over governance decisions in the future. I’m not sure why anyone other than people who directly benefit from it would ever get behind this proposal. I also don’t see the value in distributing UNI towards the group that wants to distribute free UNI towards itself. How exactly can an increase in this group’s voting power benefit the Uniswap protocol’s development? If these goals and this method don’t qualify this group of interest as a bad actor, what does? a) They want to have quorum without even a slight support of the rest of the Uniswap community. And it happens in the time when the governance is at its most vulnerable point. b) They want to distribute UNI from the governance treasury towards themselves for free at the expense of everyone else. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party giving entirely negative feedback on proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.828745545837383
                },
                {
                    "author_link": "https://gov.uniswap.org/u/rabbidfly",
                    "index": "41",
                    "likes": "1",
                    "time": "16/10/2020-15:27:34",
                    "content": "Just running some numbers here. Looks like the combined total of delegated votes between Dharma and Gauntlet is 29.14 Million.  So far, the tally is 30,655,106 FOR and 633,960 AGAINST.  Now we’ll remove 29.14 Million from Gauntlet and Dharma and we have… 1,515,106 FOR and 633,960 AGAINST Unless i miscalculated or missed something obvious, we are left with 2 choices:  We expand the conspiracy to additional delegates to extend our confirmation bias around the “take-over Uniswap” narrative/meme We acknowledge that the majority of Uniswap is voting FOR this proposal  #2 is the most likely outcome, because like most conspiracies, #1 takes a ridiculous amount of effort to pull off, and we can’t even credibly articulate ‘why’ they would even bother doing so. In any case, it seems to highlight that the Uniswap governance structure is broken in its current form. If we can’t establish the quorum threshold of 40 Million across all votes (for and against), then what are we arguing about? The case against Dharma is secondary to a more pressing issue, which irrespective of the source, this proposal attempts to solve. Are we convinced that we can reach quorum easily for beneficial proposals that have unilateral support? To abstain is to say ‘no’ minus the gas fee? Not sure that is a safe assumption to make. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.291666666666667
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Buckerino",
                    "index": "42",
                    "likes": "5",
                    "time": "16/10/2020-17:03:54",
                    "content": "I think your argument is flawed in multiple points. There are many people who would vote NO, but will not bother to do so as they see the proposal will not pass. Not voting in this case means voting NO. For example, I know a couple of people who hold a significant amount of UNI which would completely counter your argument that the community is voting for this proposal and turn it upside down. They did not bother voting now as it is more or less very unlikely that the proposal will pass, but dont worry, people are watching. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.0015432098765435
                },
                {
                    "author_link": "https://gov.uniswap.org/u/rabbidfly",
                    "index": "43",
                    "likes": "0",
                    "time": "16/10/2020-18:05:45",
                    "content": "I fear you are correct. My second last statement suggested as much, so i did see the flaw in my own argument. What are we left with then? Despite our best attempts to create an ideology that democratizes decision making in a decentralized and permissionless manner. Instead, as you have just characterized, we have the kind of manipulation and scheming that is frankly no different from what i see in conventional politics. My greater point has nothing to do with Dharma. It can be summarized as:  This is all new and we have no idea what will work, but we have ideas! Create a governance meta-structure that allows us to experiment and adapt quickly in a tight feedback loop as we race toward ‘fit for purpose’ in our system  Making proposal and quorum constraints prohibitively high diminishes our ability to achieve #2, and our ability to maintain coherence in the rapidly moving world of crypto and it’s inherent complexity. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.118856143856144
                },
                {
                    "author_link": "https://gov.uniswap.org/u/chrisblec",
                    "index": "44",
                    "likes": "9",
                    "time": "16/10/2020-18:57:04",
                    "content": "It’s important to keep in mind that Uniswap worked perfectly fine before governance was introduced. I believe that, for now, governance is a liability rather than an asset to the decentralized nature of this protocol. We do not need to have constant rapid-fire proposals & voting to prove that governance works. A more cautious approach is needed. Keeping a high threshhold is the right way to go, as long as we have tools such as Compound’s autonomous proposals that allow anyone to offer up an idea to the community in an attempt to garner support. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.173544973544973
                },
                {
                    "author_link": "https://gov.uniswap.org/u/jumnhy",
                    "index": "45",
                    "likes": "1",
                    "time": "16/10/2020-19:13:07",
                    "content": "Just skipping over most of your post to the end: Uniqueness of identity is something of an open problem in governance. Because yes, it’s trivial to create additional wallets. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.uniswap.org/u/rabbidfly",
                    "index": "46",
                    "likes": "0",
                    "time": "16/10/2020-19:39:19",
                    "content": "I understand your sentiment but i would caution your approach. “worked perfectly fine” is retrospective causality. DeFi has accomplished in 12 months what most initiatives take years to replicate. DeFi is the very essence of a highly complex and dynamic system. ‘Caution’ is anathema to what got us here. The torrid pace of innovation, in both tech and governance, is required to survive. So, we can politely disagree on this point. From what we have learned through the science of complex adaptive systems, staying at that edge of discomfort is an existential requirement. Seeking stability, caution, restrictive constraints, makes Uniswap highly prone to entropy. At this point, it doesn’t take the ‘next’ uniswap much energy to replace what’s there with a better service. From what i can see as a consumer, if you can nail the following, Uniswap should do well:  a better and more intuitive user experience to draw in a wider consumer base and accelerate adoption improved trust through some sort of decentralized governance that makes it ‘safer’ to invest - we are still in the wild west here and that scares the majority of consumers and institutions an institutional grade of financial instruments to ensure scalability, economy of use (gas fees!), security, and insurance. as long as ‘rug pull’ remains the dominant narrative amongst CT, good luck trying to draw in more capital. looking at DeFi charts in the last 2 months plainly demonstrates that we hit a glass ceiling.  The added layer of governance will help, and i would argue, is necessary to navigate the obstacles we know are ahead. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.727329192546584
                },
                {
                    "author_link": "https://gov.uniswap.org/u/limabeans",
                    "index": "47",
                    "likes": "4",
                    "time": "17/10/2020-02:45:35",
                    "content": "Speaking of DeFi, I was a Dharma app user and in the spirit of full decentralization, I expected the app to work the same way. However, it appears that their system kicks in some sort of KYC and there have been reports of users having their funds locked for no apparent reason. I see that Dharma delegates here are touting governance, when their own app is not supporting any principles of decentralization. If Dharma wants this, they should pay something in return to the Uniswap community. Their surge fees is a price gouging scheme and hurts users more, despite claims made to the contrary i.e. friendly user interface. As usual, assume positive intent in this dialogue. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.796487603305786
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Allansimons",
                    "index": "48",
                    "likes": "0",
                    "time": "17/10/2020-04:02:42",
                    "content": "I’m agree with uniswap controlling not to dharma ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Mr_Po",
                    "index": "49",
                    "likes": "7",
                    "time": "17/10/2020-10:14:22",
                    "content": "The current vote is not representative due to a couple of reasons.  It is a Rider proposal. It means that it grabs the votes of people who want to reduce the proposal threshold while being neutral on lowering the Quorum threshold.  As there wasn’t even a topic on the forum focusing on lowering the quorum, it’s not a thing in the governance discourse, so more people are neutral.  People who delegated their votes towards Dharma & Gauntlet can’t revoke their votes if they don’t support the proposal.  The current voting procedure fails at its primary purpose: people expressing their will. If you delegated your votes to Gauntlet because they promised to be politically neutral, and now they vote in contradiction to their statement and against your will, there’s nothing you can do.  Only votes that were delegated or self-delegated before the proposal can take part in the voting procedure.  It means that there’s no room to respond. And the majority of voters had no idea about this system design . == Voters who hadn’t claimed their liquidity mining rewards yet can’t vote . Voters who haven’t self-delegated (as there were no proposals) can’t vote . Part of voters who delegated to the wrong candidate vote opposed to their will . == There are multiple severe flaws in the current voting procedure. And Dharma & Gauntlet are trying to take advantage of it. They take advantage of voters not being able to respond to their actions. And they try to take advantage of the way UNI is distributed while they can. As I said earlier, it only makes sense to support what Dharma & Gauntlet do for people who are direct beneficiaries of the airdrop they try to push through. They can only do that in the very early stages . As later, more percentage of the supply will go to Liquidity providers, the team & investors, who have no interest in making said airdrop. And airdrop is a euphemism, by the way. The initial airdrop was an airdrop, and the team had reasons to do it the way they did. Dharma’s ‘airdrop’ is closer to sending UNI from the governance treasury towards your addresses without doing anything useful to earn that. The adequate word would be stealing, as it comes at the expense of all other network participants. It has nothing to do with Uniswap protocol development. It is just an attempt to get free money & more voting rights. And to get this free money, this group of interest is willing to compromise the protocol’s governance procedure. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.567283950617283
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Snuffy",
                    "index": "50",
                    "likes": "4",
                    "time": "17/10/2020-10:25:35",
                    "content": "The sheer gaslighting in this thread is staggering. Don’t be fooled, this quorum proposal is a DIRECT ATTACK against uniswap’s governance. Vote NO ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://gov.uniswap.org/u/rezwile",
                    "index": "51",
                    "likes": "2",
                    "time": "17/10/2020-11:36:56",
                    "content": "    Mr_Po:   It is a Rider proposal. It means that it grabs the votes of people who want to reduce the proposal threshold while being neutral on lowering the Quorum threshold.  As there wasn’t even a topic on the forum focusing on lowering the quorum, it’s not a thing in the governance discourse, so more people are neutral.  People who delegated their votes towards Dharma & Gauntlet can’t revoke their votes if they don’t support the proposal.  The current voting procedure fails at its primary purpose: people expressing their will . If you delegated your votes to Gauntlet because they promised to be politically neutral, and now they vote in contradiction to their statement and against your will, there’s nothing you can do.  Only votes that were delegated or self-delegated before the proposal can take part in the voting procedure.    Supporting the expressed concerns 100%. I feel a deep mistrust towards the proposal and voting system. Please stop this now!  Nearly noone will like the outcomes. It hurts uniswap governance.  Have a longer voting period. With much more open discussion beforehand. Look at EIP in Ethereum. A healthy discussion is needed! Allow redirecting delegated anytime. Dont let people ‘be locked in’ Dont allow changes of “voting limits” in the upcoming year.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.78125
                },
                {
                    "author_link": "https://gov.uniswap.org/u/neverselling",
                    "index": "52",
                    "likes": "5",
                    "time": "17/10/2020-13:11:36",
                    "content": "If anything we should vote to raise thresholds after this attack by Dharma ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Byrana",
                    "index": "53",
                    "likes": "1",
                    "time": "17/10/2020-13:43:01",
                    "content": "Thanks, uni0 for bringing this up. This is a clear vote - NO. It seems I missed the window to delegate. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Danpi314",
                    "index": "54",
                    "likes": "1",
                    "time": "17/10/2020-14:15:01",
                    "content": "I was originally for this proposal as reducing the number of votes required to make a proposal is unlikely to be an issue. However, the second part of the proposal is much more troubling as it risks centralising Uniswap substantially. No proposals being passed for a short while is better than a bad proposal being passed when the future of the largest Decentralised Finance project is at stake. I have only now enabled delegating so I wasn’t eligible to vote on this one. However, if this proposal was to come up again without the quorum reduction I would support it. If anything this has shown how easy it is to reach around 30M votes (Almost all of these are from Dharma & Gauntlet), that in itself is a reason that I’d have to vote down a similar proposal if it contained the 2nd clause. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.1741452991453
                },
                {
                    "author_link": "https://gov.uniswap.org/u/neverselling",
                    "index": "55",
                    "likes": "2",
                    "time": "17/10/2020-14:18:38",
                    "content": "If Dharma got 15 million UNI, why arent they distributing them direct to their users? Did they get them through the airdrop? Looks to me like Dharma is trying to double dip as well as take over governance. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Byrana",
                    "index": "56",
                    "likes": "0",
                    "time": "17/10/2020-14:28:42",
                    "content": "All we have are promises and claims. How do we know how many “proxy” wallets they have for themselves? For all I know…decentralized protocols should be trustless and theirs a good reason for it. Passing this vote, and we are back to where we come from. I am not buying into that narrative (morality, good will & so on) some try to spin here. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party giving entirely negative feedback on proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.375
                },
                {
                    "author_link": "https://gov.uniswap.org/u/neverselling",
                    "index": "57",
                    "likes": "4",
                    "time": "17/10/2020-14:30:31",
                    "content": "Its beyond obvious that this is a clear attack on governance. Its also be clear from the beginning that Dharma and company have been attacking this forum. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely negative feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.333333333333333
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Byrana",
                    "index": "58",
                    "likes": "2",
                    "time": "17/10/2020-14:52:45",
                    "content": "This might be a bit off-topic but relates to it. I noticed a few days ago, that UNI was added to compound with a very high APY. 57 adresses voted for it to pass. Gaunlet and Dharma among the TOP 3. This will lure users to deposit UNI, which can be borrowed to gain voting power. I rather propose to raise the bar for quorum instead of lowering. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.846666666666667
                },
                {
                    "author_link": "https://gov.uniswap.org/u/rabbidfly",
                    "index": "59",
                    "likes": "0",
                    "time": "17/10/2020-15:46:50",
                    "content": "Decentralized governance is a fantasy. As long as we have tokenized voting, the natural aggregation through delegation or economic pressure, is inevitable. We should focus less on Dharma-Gauntlet and more on the governance structure. The problem we are addressing here, once averted through a failed proposal, will only happen AGAIN. So, unless we enjoy meeting back here and vacillating the same argument over again, let’s instead focus on how to fix it. I’ll research this a bit more on the scientific front. Papers must have been written to recommend solutions. I’ll report back if i find anything. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.378205128205128
                },
                {
                    "author_link": "https://gov.uniswap.org/u/neverselling",
                    "index": "60",
                    "likes": "0",
                    "time": "17/10/2020-16:03:12",
                    "content": "raise the minimums for quorum to 5 or 6 %, fixed ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/rabbidfly",
                    "index": "61",
                    "likes": "0",
                    "time": "17/10/2020-16:16:23",
                    "content": "found https://papers.ssrn.com/sol3/Delivery.cfm/SSRN_ID3082055_code2508452.pdf?abstractid=3082055&mirid=1 it’s short, but full of possibly useful references will give it a read ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.083333333333333
                },
                {
                    "author_link": "https://gov.uniswap.org/u/kolten",
                    "index": "62",
                    "likes": "0",
                    "time": "17/10/2020-16:18:07",
                    "content": "Quick aside: Dharma does not have 15M UNI. They have 15M UNI delegated to them. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.666666666666666
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Pipo-Mandarina",
                    "index": "63",
                    "likes": "2",
                    "time": "17/10/2020-16:20:55",
                    "content": "Andre just voted yes, we are really close of Dharma taking over governance  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/neverselling",
                    "index": "64",
                    "likes": "0",
                    "time": "17/10/2020-16:24:23",
                    "content": "arent they 10 million votes short? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/rabbidfly",
                    "index": "65",
                    "likes": "0",
                    "time": "17/10/2020-16:29:30",
                    "content": " ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Danpi314",
                    "index": "66",
                    "likes": "0",
                    "time": "17/10/2020-16:30:11",
                    "content": "No, Currently has 38,549,331 votes of 40,000,000 required. Edit: This proposal expires at 18:00 UTC on Monday ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/rabbidfly",
                    "index": "67",
                    "likes": "1",
                    "time": "17/10/2020-16:33:07",
                    "content": "let’s piece a few things together  Andre Cronje (eth dev who built YFI) just added 8M votes Hayden Adams keeps retweeting Dharma  What do we actually believe is going on here?  Something tells me this proposal would never have been launched unless there was 100% certainty it would pass. Not good or bad. Just guesswork. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 3.4375
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Uniguy772",
                    "index": "68",
                    "likes": "1",
                    "time": "17/10/2020-16:40:07",
                    "content": "Says it expires on the 19th for me which is in 2 days time so it cant possibly expire for you today as no country is that far apart in time zones ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://gov.uniswap.org/u/neverselling",
                    "index": "69",
                    "likes": "1",
                    "time": "17/10/2020-16:49:36",
                    "content": "Better alert all UNI holders to self delegate so we can vote this down if it passes quorum which it looks like it will ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.861111111111112
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Uniguy772",
                    "index": "70",
                    "likes": "0",
                    "time": "17/10/2020-16:50:28",
                    "content": "They cant they had to be delegated before the set date in the proposal to be eligible to vote. Screenshot_20201017-175250_Chrome988×628 181 KB Encouraging people to delegate at this point would just be asking them to waste gas fees to be disappointed that they cannot vote (always good though so they know for the next proposal) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.6875
                },
                {
                    "author_link": "https://gov.uniswap.org/u/neverselling",
                    "index": "71",
                    "likes": "0",
                    "time": "17/10/2020-16:53:15",
                    "content": "Well then a proposal to raise votes needed for a proposal to pass from simple majority to 2/3rds majority might be in order. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/neverselling",
                    "index": "72",
                    "likes": "0",
                    "time": "17/10/2020-16:55:01",
                    "content": "Also, the gas fees to delegate are about a dollar. Which is more important? The dollar for gas fees or to have your votes count. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.25
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Uniguy772",
                    "index": "73",
                    "likes": "0",
                    "time": "17/10/2020-16:56:48",
                    "content": "Screenshot_20201017-175250_Chrome988×628 181 KB Again they cant for this one as we are well past block 11042288 so the only people who would want to pay that $1 fee are the people who are certain they’re delegating their uni to the right person As I said you can inform people for the next proposal that they have advanced warning of what they need to do if that’s what you feel most appropriate. I have a feeling though people wont be delegating as quickly next time before doing research especially those unhappy if this proposals does go through ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.4772727272727275
                },
                {
                    "author_link": "https://gov.uniswap.org/u/neverselling",
                    "index": "74",
                    "likes": "0",
                    "time": "17/10/2020-17:01:11",
                    "content": "Having your voice heard is even more important if this passes ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.25
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Uniguy772",
                    "index": "75",
                    "likes": "0",
                    "time": "17/10/2020-17:03:02",
                    "content": "True and untrue depending where you stand and whether you believe the proposal was right or wrong. As I said in another post i will be respecting the vote whatever way it ends regardless of my view on it ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.226190476190476
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Agusx1211",
                    "index": "76",
                    "likes": "5",
                    "time": "17/10/2020-17:26:51",
                    "content": "This proposal has been made when the total delegated UNI was around 43m, however right now there is almost 74m delegated UNI. The delegated voting power has shifted a little too, I think it’s a good idea to make a 2nd if the 1st get’s approved, proposing to cancel the 1st proposal. The new delegates can make the decision of “confirming” the 1st proposal, or not. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.778814935064935
                },
                {
                    "author_link": "https://gov.uniswap.org/u/neverselling",
                    "index": "77",
                    "likes": "0",
                    "time": "17/10/2020-17:34:19",
                    "content": "Why would you ever argue for UNI holders not using their UNI to vote, or at least having their UNI delegated to be able to vote. Thats absolutely absurd unless you have an agenda ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/neverselling",
                    "index": "78",
                    "likes": "0",
                    "time": "17/10/2020-17:36:00",
                    "content": "That is a great idea. Its not good governance if 30 million votes arent counted. Personally, I had no idea I had to self delegate, so my votes wont count, even for the vote if this passes. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Buckerino",
                    "index": "79",
                    "likes": "4",
                    "time": "17/10/2020-17:51:22",
                    "content": "Utterly disgusting. A pure coup d´etat to hijack Uniswap governance…If this passes, I´ll have to reevaluate whether being a UNI holder has any merits if one does not have at least 10m delegated votes or an equivalent in a wallet. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely negative feedback on proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 3.1904761904761902
                },
                {
                    "author_link": "https://gov.uniswap.org/u/limabeans",
                    "index": "80",
                    "likes": "1",
                    "time": "17/10/2020-17:53:37",
                    "content": "That paper doesn’t cover aspects of intentional manipulation of the DAO, which is what bothers me about this proposal and what everyone’s perception of Dharma’s action are. Uniswap protocol is better off with autonomous proposals, instead of 1 or 2 entities regulating the proposal process. Dharma chose to use proxy contracts and if their users are not rewarded, it can be faulted on Dharma. Regardless of the outcome of this vote, it is imperative that actors involved in intentional manipulation need to removed from the governance process and to that end delegation should be completely prohibited. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.375
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Uniguy772",
                    "index": "81",
                    "likes": "0",
                    "time": "17/10/2020-18:39:18",
                    "content": "I’m not, I’m simply stating telling people to delegate now making them think they can still vote in Proposl 1 is wrong as they cant. If you tell people this is the process then it mean when proposal 2 comes around they know what to do that’s bey different (two very different things) As I said above a few times I will accept to vote whatever way it goes and I would hope other would too as not much can be done at this point unless someone has delegated before the block mentioned above in which case I’d encourage them to utilize their vote ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.38125
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Dmills",
                    "index": "82",
                    "likes": "0",
                    "time": "17/10/2020-19:07:55",
                    "content": "So obviously, it is natural for a decent amount of people to think the worst case scenario for outcomes in certain events! I kinda happen to fall in that category from time to time. Graeme and Rabbidfly, you guys surely understand why some of us uni holders could be pretty worried, and fear the worst in this scenario… our token started off great, tons of air drops, alot of people like myself bought in investing a decent about 5 to 10k. The token went it $8 which was awesome. And then the wierd stuff started happening. Uni starts falling on its face literally, get se bad world news, bitmax gets introuble, people thinking uniswap could be next, and then volume completely dissappers.  It’s been a rough month to say the least. Governace was alright there was some good talks and awesome ideas…getting the airdrop to darma and the other was spoken of, alot of us were for it as I understood. I hear alot of ideas about what to do to build uni more, what we could do to attract users, I personally was pushing for uni holders to earn rewards on their uni tokens(which by the way, no rewards or earning by owning a uni is probably the single biggest deterrent, and reason why alot of people just aren’t interested. Saying uni will never get back to $8, it’s a scam, so on so fourth… fml right.  Good talk… Proposal day was getting closer, and we were actually seeing the price increase a wee bit. For a sec hope was building. Then darmas proposal came in. I was hearing some stuff about what binance could possibly do(wasn’t good news), but now darma was in the spotlight for a conspiracy of whatever. And it was everywhere and if someone was thinking about buying they were glad they didn’t now for sure. So yet again shot in the other leg, we not attracting new customers, at least people that are buying I do think? Is this community going to consist of majority owners being airdropped their unis. So a how bunch of people used uniswap, gets free tokens. Sounds great, except it doesn’t look great, and smells like bulls**t, lol. Im not saying that you guys havnt made a decent arguements in this discussion, honestly I want to believe you. But truthfully, and unfortunately both sides in this argument are speaking only based on opinion, and speculation. Here we were talking about things we could change to prevent whales from doing whale things and it does look like out governace was just over ran buy a whale. When I got on to vote, I knew right away there was no way in hell to compete with that, and apparently I was right. Obviously any one holding uni can still vote if they choose to, but after this are we even going to have a say. It just doesn’t seem like it, and again bad talk about uni, price is sucky, and it’s all out there for everyone to see. I guess if everyone doesn’t sell and unis price does turn around and exceed expectations then I will tell you both you were right… but like I said, if it looks like poo it usually is. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.820401537238272
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Agusx1211",
                    "index": "83",
                    "likes": "5",
                    "time": "17/10/2020-20:38:11",
                    "content": "This is my counter proposal for proposal #1, I know I should make a standalone post but I don’t have the power yet. I am looking for feedback:   Code a new contract that allows to update each parameter individually, deploy it with the exact parameters as the one we currently have   Pay a 3rd party to audit the contract   Then, we can move forward into two more proposals   Lower the min required to make a proposal   Lower the required quorum   That way we would have 0 riders, and people can better cast their votes and audited contracts are a must, I know changes are small, but the gov contract is super critical ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.734848484848484
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Scrum",
                    "index": "84",
                    "likes": "4",
                    "time": "17/10/2020-22:14:45",
                    "content": "These things are a priority over reducing proposal threshold and quorum threshold:   Ability to revoke delegated votes at any time (especially during a vote).   Ability to delegate/self-delegate at any time.   Ability to vote with LP tokens that represent their share of UNI.   Adding this functionality is paramount to fair and active governance. These need to take priority. Lowering required quorum before these issues are addressed just gives the largest holders even more power. Passing this current vote will damage the Uniswap reputation in a great way, along with the reputation of the organizations/people that are pushing this through (Dharma, Gauntlet, and Andre). If Dharma, Gauntlet, and @AndreCronjeTech want to move this proposal forward in an ethical way, they should re-propose it after the governance design flaws are fixed. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.354166666666668
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Moonshot",
                    "index": "85",
                    "likes": "0",
                    "time": "17/10/2020-22:20:57",
                    "content": "Why is a lowered quorum needed? That just opens UNI up to the same problems. If anything the amounts should be raised to 5% ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Byrana",
                    "index": "86",
                    "likes": "0",
                    "time": "17/10/2020-22:28:35",
                    "content": "This is what I thought. If it passes it should be no problem to make another proposal and reach Quorum ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Byrana",
                    "index": "87",
                    "likes": "0",
                    "time": "17/10/2020-23:29:44",
                    "content": "The way this has been handled should get some publicity. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Uniguy772",
                    "index": "88",
                    "likes": "0",
                    "time": "17/10/2020-23:32:51",
                    "content": "What part, how would it help the governance of Uniswap going forward? I can understand people being upset but making a move like that is kind of just asking to sink Uni and Uniswap into bad light surely much better to focus on trying to fix it if there is in fact anything to fix. Again vote doesnt close for a few days we still dont know what the outcome could be this could potentially reach the 40M Quorum or it could still fall short by 1.5M votes in which case it wouldnt get through. Too early to call it really at this point as it could go either way ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/rabbidfly",
                    "index": "89",
                    "likes": "1",
                    "time": "18/10/2020-00:06:10",
                    "content": "this is a done deal may as well see the experiment through and learn from it stagnation = death for most systems  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Byrana",
                    "index": "90",
                    "likes": "1",
                    "time": "18/10/2020-00:09:18",
                    "content": "I think this has been discussed already. 2 proposals in 1. You know I would profit from another Airdrop because I tested some services like 1inch and so on. That would be another 1200 UNI and voting power, just for me. The way this is done is somewhat arkward and I do not believe that they are doing it for their customers. If all cars of a certain model are sold under certain conditions at a specific time…they are sold. Someone simply missed out. It is unfortunate for some, but  lowering everything in one move … hmmm. No problem though. I am sure with these low requirements (if it passes), we will get this back on track. I have been alerted through this. If this gets some publicity others might be more aware too. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.589285714285714
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Uniguy772",
                    "index": "91",
                    "likes": "0",
                    "time": "18/10/2020-00:13:16",
                    "content": "Plenty of articles out there already by simply googling Uniswap, the damage that had tried to be done to Dharma with no evidence proved to not bother more than the dharma vote. Even if 30M accounted for Dharma and co (Based on proof this figured actually ended up being less than 30M) there are currently still more than 9M Uni more voted by the people. Anyway these are all numbers the important thing is improving the system going forward if it needs fixing but at the current rate it would look like the majority dont mind the idea of lowering the Proposal and Quorum levels which would sugguest that it’s a minority worried about this proposal rather than the majority even though it was attempted to be portrayed as the other way round. My hope is just that people respect the vote if it passes or not but I feel like there will continue to be drag on the topic long past when this vote is over in 2 ish days time for weeks, months and years from now ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.3601190476190474
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Byrana",
                    "index": "92",
                    "likes": "0",
                    "time": "18/10/2020-00:35:24",
                    "content": "What is the majority? Not sure you can extrapolate from these votes. The promise of money is hard to resist. An easy way to get someone’s attention and to manipulate. I do not see a problem that needs to be fixed, when it comes to the quorum. Proposal is a different story. Not being able to remove delegation should be fixed or having a set time to delegate might be something to consider. What’s the rush anyway? I have been around people with lots of power, money and influence … so I am very familiar with their worldviews, mindsets and so on. They look you in the eyes and smile while lying. Something I started to despise and most of them act like their doing it for the good. Never do politics and I am happy not to be part of it anymore. Not saying these guys are, but boy does it smell fishy.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.407986111111112
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Uniguy772",
                    "index": "93",
                    "likes": "0",
                    "time": "18/10/2020-00:46:39",
                    "content": "    rabbidfly:  this is a done deal may as well see the experiment through and learn from it stagnation = death for most systems    As mentioned by Rabbidfly it looks like it will probably likely go through id suspect either today or tomorrow but again who knows could stay at its current figure and not get the last 500+k it needs to reach the hurdle. Yeah there is no rush with the process and I agree it shouldn’t be rushed never said it should be rushed.     Byrana:  The way this has been handled should get some publicity.   If you claim there is no issue then what exactly did you mean by your original comment a lot would argue this has been handled the way the community voted with no issues while a few would argue it is been rigged by the big bad corporates in Dharma out to “cash grab” with very little evidence… the latter seems to be what is getting the attention online so I’m guessing there must be a few people on this forum in journalism, with high up connections or working directly for crypto news outlets who dont mind straight out bad mouthing another company with no evidence. Luckily for them it’s unlikely the Uniswap team or Dharma would go after them or their companies for false reports and slander ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.665520833333333
                },
                {
                    "author_link": "https://gov.uniswap.org/u/rabbidfly",
                    "index": "94",
                    "likes": "1",
                    "time": "18/10/2020-01:00:39",
                    "content": "I scanned most of the 300 transactions. (until i can create a query in dune analytics) Unfortunately for the conspiracy theorists, many small wallets like this one are voting ‘aye’. ¯_(ツ)_/¯ image780×334 15.9 KB the votes are in uint256 format, which is why the number looks big. it’s small. solidity doesn’t much like decimals (shrug). Votes in image is 1000.9 ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.142857142857142
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Byrana",
                    "index": "95",
                    "likes": "2",
                    "time": "18/10/2020-01:16:44",
                    "content": "Well, well … calling others comsipary theorist always catches my attention. This is usually done by people that have no arguments and try to discredit other perspective. Why do you call others CT?  Do you have any reason to discredit others. Why so offensive? I suspect another pump and dump soon and I am going to dump this tokem. Another defi project gets overthrown by a centralized point of view. The token will become useless and just another object of speculation. So be it. There are other good projects in the making, ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely negative feedback on proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.699999999999999
                },
                {
                    "author_link": "https://gov.uniswap.org/u/aokpj",
                    "index": "96",
                    "likes": "4",
                    "time": "18/10/2020-02:40:31",
                    "content": "As a relatively small UNI holder, I am glad this happened. This governance proposal has inspired me to delegate my votes to myself for whatever proposals come next (I didn’t realize the stakes would be so high so quickly) and to also become much more active in this community. The fact is, not your keys, not your coins. Downside of using a middleman like Dharma. They should probably be more up-front about the downsides to letting them hold your keys. The customers should consider it a free lesson. Crypto isn’t fair. Redistributing from the community treasury is theft, and this proposal is lube. It’s hard to kill a Unicorn but it should be harder. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely negative feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.965972222222222
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Byrana",
                    "index": "97",
                    "likes": "1",
                    "time": "18/10/2020-07:34:23",
                    "content": "There a lots of people in the “real” world that would love to see all of these projects fail, because they have the potential to depower them. They have tons of money and therefore power. I have my doubts that the community will regain influence. The moment the quorum has been reached I see no reason to hold on to UNI, but this is just my personal dystopian perspective and taken consequences. I would be happy if I get proven wrong. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://gov.uniswap.org/u/mjgla4",
                    "index": "98",
                    "likes": "2",
                    "time": "18/10/2020-08:03:35",
                    "content": "I agree with the other user that remarked that this whole situation makes me question the merits of being a uni holder. Currently it’s only function is governance, and regardless of whether this passes or not - the discussions here and the votes are not representative. The large disparity between For and Against implies that we are not being heard as a community and are largely being controlled by large users (potentially with malicious intentions). It’s quite worrying and doesn’t bode well for the future. Just my two cents. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.398809523809524
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Snuffy",
                    "index": "100",
                    "likes": "1",
                    "time": "18/10/2020-10:34:59",
                    "content": "This is such an exploit of circumstances. Makes me sick. a situation where no one can react to a surprise proposal like this vote is horribly broken. Decentralized my ass, this is being rammed down our throats. Just the discrepancy between the outrage in this thread and the number of positive votes should tell you enough, this is tyrannical. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.131192881192881
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Joshuawakefield",
                    "index": "101",
                    "likes": "4",
                    "time": "18/10/2020-10:59:27",
                    "content": "You guys are a vocal minority. I’m a UNI user who wants this to pass. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/txnde",
                    "index": "103",
                    "likes": "2",
                    "time": "18/10/2020-12:34:53",
                    "content": "Funny thing here is the vocal minority (conspiracy theorists) here are just the same accounts that have been against this proposal from day one. univalent/dharma/gauntlet made their votes using “delegated tokens” and those votes matters too. dismissing those votes is just pathetic. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 3.75
                },
                {
                    "author_link": "https://gov.uniswap.org/u/bruh",
                    "index": "105",
                    "likes": "3",
                    "time": "18/10/2020-16:13:11",
                    "content": "A large portion of people are abstaining from voting because there is literal no difference between voting “against” and doing nothing.  Except having to pay gas fees when voting for no reason. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.071428571428571
                },
                {
                    "author_link": "https://gov.uniswap.org/u/7Frenzy",
                    "index": "106",
                    "likes": "1",
                    "time": "18/10/2020-16:55:54",
                    "content": "I would vote no, but missed delegation period, like me, I believe there is a silent majority of small UNI holders that did not have the responsibility to check the delegation period and now are out of voting in this proposal. Decentralized governance is all new to most users and we all have to learn our responsibilities as UNI holders, maybe this will serve as a lesson, and next proposal will have more small UNI holders voting. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None"
                    ],
                    "Sentiment": 5.454545454545454
                },
                {
                    "author_link": "https://gov.uniswap.org/u/mjgla4",
                    "index": "107",
                    "likes": "0",
                    "time": "18/10/2020-17:00:23",
                    "content": "“Every vote matters.” That mentality is an issue. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/bruh",
                    "index": "108",
                    "likes": "0",
                    "time": "18/10/2020-17:09:15",
                    "content": "It actually doesn’t matter though… “4% of UNI supply required to vote ’yes’ to reach quorum” It is exactly the same thing to not vote vs. voting “against.” ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.416666666666666
                },
                {
                    "author_link": "https://gov.uniswap.org/u/mjgla4",
                    "index": "110",
                    "likes": "0",
                    "time": "18/10/2020-18:09:18",
                    "content": "Sure, unless as you said people are abstaining from voting because they feel it will not move the needle. Then it does matter, because the more that vote, the more it will instill confidence that their position may be heard (as the numbers grow). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Agusx1211",
                    "index": "111",
                    "likes": "1",
                    "time": "18/10/2020-18:23:14",
                    "content": "Yes but every vote cost 1 dollar, spending a dollar just to send a message with no real impact may not be something that many people are interested in doing ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.083333333333334
                },
                {
                    "author_link": "https://gov.uniswap.org/u/limabeans",
                    "index": "112",
                    "likes": "1",
                    "time": "18/10/2020-18:47:53",
                    "content": "I would add a rider where 3rd parties profiting off of Uniswap protocol, should add to the community treasury. In Dharma’s case, since they charge surge fees etc to the users, Dharma should be asked to pay a surcharge to use the service. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Agusx1211",
                    "index": "113",
                    "likes": "0",
                    "time": "18/10/2020-19:49:37",
                    "content": "That’s impossible to enforce ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 1.666666666666667
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Byrana",
                    "index": "114",
                    "likes": "2",
                    "time": "18/10/2020-23:19:37",
                    "content": "A pleasure to see, that this one has been defeated and I have been proven wrong. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 2.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Danpi314",
                    "index": "115",
                    "likes": "0",
                    "time": "18/10/2020-23:40:31",
                    "content": "Not sure, this could be a UI bug, Uniswap voting page indicates this vote will run till 18:00 UTC ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.75
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Byrana",
                    "index": "116",
                    "likes": "1",
                    "time": "18/10/2020-23:44:33",
                    "content": "Not sure either, but I am happy to see it! This was a quick and dirty move, that caught a few off-guard. Glad, we have some watch dogs.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.652777777777778
                },
                {
                    "author_link": "https://gov.uniswap.org/u/rabbidfly",
                    "index": "117",
                    "likes": "0",
                    "time": "18/10/2020-23:51:15",
                    "content": "welcome to governance hell this may actually be worse than the alternative you seem to revile hypothesis: Uniswap will be incapable of passing quorum on any governance matter due to voter apathy test: Propose a UNI airdrop of 400 tokens another thing to consider is that you have lost the goodwill of 39 Million votes thirty-nine-million 39,000,000 someone wake me up when the next proposal is birthed from the womb of mediocrity ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.074999999999999
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Danpi314",
                    "index": "118",
                    "likes": "1",
                    "time": "18/10/2020-23:53:26",
                    "content": "Can confirm it failed. Due to variations between actual block time (Defeated) and Uniswap’s estimated block time. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.958333333333333
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Byrana",
                    "index": "119",
                    "likes": "3",
                    "time": "18/10/2020-23:56:26",
                    "content": "I did not lose the good will of 39 million votes - it is the opposite for my taste. It seems you have a hard time with the outcome. If you have a problem with this, no one is forcing you to be part of this. There are other projects…very similar to this. I am sure we will find a way, but thanks for your concern. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.7023809523809526
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Byrana",
                    "index": "120",
                    "likes": "0",
                    "time": "18/10/2020-23:57:35",
                    "content": "Fantastic! Thanks for sharing! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Danpi314",
                    "index": "121",
                    "likes": "1",
                    "time": "19/10/2020-00:08:48",
                    "content": "We should absolutely discuss Dharma’s proposal for them to get Uni tokens, seems to me as if they deserve them just like any other Uniswap users. Though probably this thread isn’t the place to discuss it. Just personally didn’t think this was the best way to go about it. The proposal didn’t make it clear that they wanted to airdrop 400 tokens to their users, only that they thought lowering the requirements was good for the project) Edit: I meant Thread not Forum. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.3392857142857135
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Keivys",
                    "index": "122",
                    "likes": "4",
                    "time": "19/10/2020-00:36:23",
                    "content": "I am glad that this proposal will not prosper ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/rabbidfly",
                    "index": "123",
                    "likes": "0",
                    "time": "19/10/2020-01:09:48",
                    "content": "@nadav_dharma has been pretty clear about the connection between both proposals on twitter and here however, he’s been mischaracterized here by certain community members who insist on drinking from a glass half-empty of hyperbole so what now team Uniswap? Here is what i propose:  rewrite the governance contract - not tweak it  Proposals  allow autonomous proposals like Compound https://defirate.com/compound-autonomous-proposals/#:~:text=Compound%20–%20the%20leading%20US%20lending,to%20create%20a%20Governance%20Proposal.&text=Autonomous%20Proposals%20are%20a%20new,to%20submit%20a%20governance%20draft.  Process of vote  make voting results hidden so that we don’t dissolve the process into a daytime soap-opera on these forums  Quorum threshold  Quorum as a static number does not make sense Make quorum threshold a product of delegated votes  Long-term fairness between short-term and long-term interests  implement ‘tenure voting’ which is currently being tested at the LTSE (eric reis innovation) https://ltse.com/team/   How it works?  to properly balance the interests of long-term vs short-term token holders, you create a system that slowly moves power away from a plutocracy and into the hands of those who have an interest in the long-term health of Uniswap so for example, holding 1000 tokens after 1 year might increase to 1.5x in voting power if you don’t like the direction Uniswap is taking you can walk with your feet and sell your UNI (bye)  Ok, so there’s a quick stab at ideas from the seat of my pants. ",
                    "links": [
                        "https://ltse.com/team/"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.832251082251082
                },
                {
                    "author_link": "https://gov.uniswap.org/u/ELEVATED1",
                    "index": "124",
                    "likes": "1",
                    "time": "19/10/2020-01:13:55",
                    "content": "Stay focused on core of main proposal ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Naught",
                    "index": "125",
                    "likes": "4",
                    "time": "19/10/2020-01:23:39",
                    "content": "Penguin party is working on autonomous proposals. The governance contract is fine and worked as intended. Twice as many UNI are delegated now 75~ million vs when this defeated proposal was rushed in at 45~ million. This is a huge success and the new activity can be attributed to the negative reaction to the lowering quorum proposal. I am in support of raising the quorum in the future as more UNI become delegated. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party giving entirely positive feedback on proposal"
                    ],
                    "Sentiment": 6.307239057239057
                },
                {
                    "author_link": "https://gov.uniswap.org/u/rabbidfly",
                    "index": "126",
                    "likes": "0",
                    "time": "19/10/2020-01:25:07",
                    "content": "Actually, i’m beginning to like image1280×160 31.7 KB hidden voting and quorum is established by the percentage of the gap of Yes and No over the total so for 100 votes, you need at least 55 to pass (assuming there were no abstains) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.416666666666666
                },
                {
                    "author_link": "https://gov.uniswap.org/u/rabbidfly",
                    "index": "127",
                    "likes": "0",
                    "time": "19/10/2020-01:33:21",
                    "content": "    Naught:  The governance contract is fine and worked as intended.   worked as intended? this does not explain why Cronje and H Adams supported this proposal surely, ‘intent’ is more accurately represented by the leaders in this space they voted with votes and/or social media influence, because, presumably, they wanted to change the governance structure? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.8500000000000005
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Joshuawakefield",
                    "index": "128",
                    "likes": "1",
                    "time": "19/10/2020-03:26:29",
                    "content": "They are Univalent, the ones who first wanted this proposal put forward Dharma was only participating because Univalent said they wouldn’t vote on any issue without lowering quorum numbers first. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://gov.uniswap.org/u/neverselling",
                    "index": "129",
                    "likes": "2",
                    "time": "19/10/2020-04:32:06",
                    "content": "Why this immediate desire to change governance? Seems to me the governance is fine at present moment and needs no changing whatsoever. If anything I would vote yes to raise minimums slightly for quorum and possibly raise votes needed to pass something from 50% to 66%. Good proposals should be passed by more than a simple majority IMO. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.035714285714286
                },
                {
                    "author_link": "https://gov.uniswap.org/u/limabeans",
                    "index": "130",
                    "likes": "7",
                    "time": "19/10/2020-04:36:33",
                    "content": "Congratulations to Uniswap community. Let’s put this victory into context - this proposal was a blatant abuse of community’s time, when it could have been well spent in implementing and discussing autonomous proposals. Despite what some people are pushing for here, we should not rush into any other proposals, unless their merits are fully clear to the community. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.775
                },
                {
                    "author_link": "https://gov.uniswap.org/u/uni0",
                    "index": "131",
                    "likes": "4",
                    "time": "19/10/2020-10:23:12",
                    "content": "Yes, Congratulations all-around, this is a big victory for Uniswap. Hopefully we can learn from this, and recognize how close we were to loosing the essence of what this space is trying to accomplish: Decentralization. I pray that the next proposal will have a chance to be discussed by the community (and maybe even get a 3. party audit or two) before going up for vote. Lets all be more critical of proposals from now on… Thank you to anyone who read this thread or replied, your knowledge helps further our community  ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.583333333333334
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Byrana",
                    "index": "132",
                    "likes": "0",
                    "time": "19/10/2020-12:00:27",
                    "content": "If Dharma really cares for their customers and UNI, I believe there’s a better solution. It seems, not sure, that they have lots of voting power therefore tokens. How about this? Give some of that to the customers. How many customers do they have … devided by 15 million…fair enough for my taste. The way this was done…it seems hard to believe, that this is for their customers. I read a post on twitter, before the end of the voting period that they took care of it and customers will get UNI. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.548611111111112
                },
                {
                    "author_link": "https://gov.uniswap.org/u/jumnhy",
                    "index": "133",
                    "likes": "3",
                    "time": "19/10/2020-12:45:34",
                    "content": "Hey @Dmills, catching up on the thread from where I left off a couple days ago– I think you hit on a fundamental axiom for proposals: the burden of proof that a proposal comprises an  an improvement over the status quo should fall on the proposer. Or, put another way–every proposal is in bad faith until it’s proved not to be. The point of these forums is to allow intelligent and rational discussion of proposals and give proposers their day in court, so to speak. To preserve the integrity of the protocol as a battle-tested, proven solution, any changes need to be fully interrogated. The whole point of playing devil’s advocate is that if an idea is worthwhile, it can stand up to the strongest critiques. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.166666666666667
                },
                {
                    "author_link": "https://gov.uniswap.org/u/jumnhy",
                    "index": "134",
                    "likes": "3",
                    "time": "19/10/2020-12:57:28",
                    "content": "I need to look at this idea further, but… My understanding of a quorum: the minimum number of stakeholder attendees for a given idea, such that no highly organized minority bloc can push through proposals until “everyone” (for whatever minimum “everyone” we define) has weighed in. This formula simply establishes a baseline for consensus, or at least, a different idea of supermajority. I’m not sure that it relates to the discussion around quorums. That said, where were you pulling this from? I appreciated the paper your referenced earlier in this thread; was this from there or elsewhere? Much appreciate any resources you can share. I’d also add that it gets more complex with the addition of a third “abstain” option for voting, which I would suggest be included for quorum related conversations. Allowing people to abstain shows that they were present, they read through the proposal, and they don’t feel strongly one way or the other. This is different, of course, from simply non-voting. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.073245614035088
                },
                {
                    "author_link": "https://gov.uniswap.org/u/rabbidfly",
                    "index": "135",
                    "likes": "4",
                    "time": "19/10/2020-13:23:32",
                    "content": "Here is the paper https://academy.horizen.io/horizen/expert/dao-decentralized-autonomous-organization/. The quorum constraint we have now is a factor of available UNI governance tokens, NOT ‘delegated’ tokens. This is highly problematic, especially in the beginning when the delegates have fewer votes. Confusion around ‘self-delegation’ and ‘timelocked snapshots’ made this worse. A good strategy to mitigate ‘highly organized minorities’ is to give tenured voting power to UNI holders. As an example, 1000 UNI that has 1 year of tenure in a wallet address may represent 1500 votes, and possibly 2000 after 2 years. I’m sure the curve wouldn’t be linear, but you get the point. This balances the long-term interests of all token holders with the short-termed interests of investors who may have poor intent. The abstain vote should be reserved for those who don’t agree to the need to vote on a given proposal. This should be a thoughtful and precise decision. Unfortunately, because we have transparent voting metrics for the duration, it turns into a slovenly display of politicking, story weaving of the most elaborate fantasies, and unnecessary drama. Instead, let’s have a ‘proposal baking’ period of 6 days, where we can debate its merits without the added weight of a vote-count leaderboard. Then, on the last day we engage in a ‘hidden’ vote. Those who normally abstain because they want to save on gas fees, or because they realize the vote will fail quorum, are now forced to cast their vote. Put your money where your mouth is. If you don’t have skin in the game, you should sell your UNI and buy meme instead. I mean that sincerely. Governance is not a joke. (that wasn’t directed at you jumnhy) Great thoughts jumnhy. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.408522727272728
                },
                {
                    "author_link": "https://gov.uniswap.org/u/jumnhy",
                    "index": "136",
                    "likes": "1",
                    "time": "19/10/2020-13:51:51",
                    "content": "Interesting. Curve has experimented with time-locking CRV to achieve a similar “tenured” affect, although I believe their system gives a weight boost immediately on lock (ie, you lock for 4 years, you get the full 2.5(?)x boost immediately). If technically feasible, duration in a given wallet address would seem to be a better metric to me; or a soft “lock” that allows “vote weight vesting” that only applies the weight as it is earned through tenure. I think that’s a better system than giving the weighted voting power out immediately, but I’m not a game theorist. To respond to your other points re: a 6-day voting period, and a hidden vote: I understand the concerns around unnecessary dramatics. We’ve seen in play out here and in other threads around Uniswap’s first handful of proposed proposals. However, “politicking” could be better reframed as coordination. Dependent on our governance parameters for a proposal minimum vote count, and a quorum, and proposal passage, we might arrive at a “better” solution that needs less coordination and politics to move the needle, but the status quo demands delegation and coordination of multiple delegated blocs to achieve anything. For representative democracy of this style, I think we need the radical transparency to incentivize honest behavior on the part of the delegates. It does come down to the details; how does one do a truly “hidden” vote? Will the “voting record” for delegates be visible after the fact? Public coordination, again, contingent on our selected parameter set, may still be a necessary component, so we’d likely see delegations coordinating both publicly and privately, but now without oversight from the delegators. In a hidden vote, how does one “realize” that a vote will fail quorum? I’m not sure I understand. That’s part of why I think a degree of transparency is necessary. In practice on other platforms, we’ve seen blocs (even where delegation was off-chain/informal amongst a private syndicate) flip votes at the last minute of voting. Your proposal of a “hidden” vote is in effect the same thing as asking everyone to vote in that last minute. I agree that we need a system that incentivizes participation for folks with skin in the game. Governance is no joke. I’m just not sure that a hidden vote (again, contingent on other parameters) is a panacea. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.022792022792023
                },
                {
                    "author_link": "https://gov.uniswap.org/u/rabbidfly",
                    "index": "137",
                    "likes": "1",
                    "time": "19/10/2020-14:06:36",
                    "content": "appreciate it once again @jumnhy in my line of work, which is defined as ‘highly complex’ organizational behaviour,  outcomes are never a product of ‘thought’, or ‘due dilligence’, or ‘strategy’. They are more a product of ‘rapid experimentation’ and ‘learning’. We all have great thoughts. There is no precedence for how a DAO should work in modern literature. I’ve scanned it. We barely have a grasp of how ‘representative democracy’ should work effectively, as today’s bi-partisan structure seems to clearly demonstrate. So, once we get over the fact that there ‘is no right answer’, we are only left with ‘let’s try something! and let’s do it quickly’. The next Uniswap-killer is around the corner, and we cannot afford to be slow or methodical. So yeah @jumnhy, let’s try out some of your thoughts sprinkled in with some of mine, but they key is, let’s experiment safely to figure out what works. So, you see, i’m not necessarily married to my ideas. They are just ideas for the sake of learning if they work or not. It’s a difficult mindset to enter into, but it is essential in the modern context. Moore’s Law doesn’t give us any place to hide. If you really want to geek out, the ‘law of requisite variety’ from cybernetics research gives us even less room to hide. Complex systems survive on the edge of discomfort. It’s how the physics works. Hidden, not-hidden, quorum threshold, radical transparency. These are all levers that trigger the butterfly effect in systems. Let’s pull them and see what happens. If my assumption that the ‘delegates’ are faithful actors intending to improve the system is true, then we can afford to move quickly. If jeff bezos can adopt a complexity mindset of rapid experimentation with Amazon, we have no excuses.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.463509316770186
                },
                {
                    "author_link": "https://gov.uniswap.org/u/aokpj",
                    "index": "138",
                    "likes": "1",
                    "time": "19/10/2020-16:27:57",
                    "content": "I signed up to say I am against this. I am not a conspiracy theorist. The only person who would be for a package deal like this, is a Dharma user. Period. So I think posters saying they are for this should clarify whether they are also a Dharma user, and if not also explain why they hell they are for this. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely negative feedback on proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/jumnhy",
                    "index": "139",
                    "likes": "2",
                    "time": "19/10/2020-18:06:28",
                    "content": "As always, a thoughtful reply. There’s not necessarily a blueprint for how a DAO should work, but mechanism design is more broadly the area I’ve been reading up on. Organizational behavior is another fascinating lens to look at this through. Mechanism design is full of oddball edge cases that leave me apprehensive about too aggressive an approach in radical experimentation. That said, I appreciate the go-getter mindset. I’ll highlight one additional area of your response: DELEGATES are likely to be good-faith actors. They only derive their power through the consent of the governed, as it were. Whales, particularly exchanges and the like, are not such good actors. They are self-interested rather than organizationally interested. I think stagnation is less of an existential threat to Uniswap than you do; while in a broad sense, staying nimble and uncomfortable can be organizationally healthy, I’d emphasize that we need to do so safely. Particularly with respect to governance, we don’t have a particularly robust risk analysis framework yet to know what changes are going to break this and, in all likelihood, do so irreversibly. In this vein, I appreciated @tarun’s in-depth analysis of threat vectors to governance. (Proposal: Reduce amount of UNIs required to submit governance proposal) for those who missed it earlier). Some of our problems can be solved with engineering solutions; others, as you suggest, will go through iterative development through rapid experimentation. As an aside, I always look forward to reading your posts, @rabbidfly. Like yourself, I’m not wedded to any ideas in particular, and it’s precisely this sort of critical discourse that helps us all figure this out. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.896739130434783
                },
                {
                    "author_link": "https://gov.uniswap.org/u/jrali889",
                    "index": "140",
                    "likes": "0",
                    "time": "19/10/2020-18:30:09",
                    "content": "I believe this is correct and this proposal would be in our favour!! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/rabbidfly",
                    "index": "141",
                    "likes": "0",
                    "time": "19/10/2020-18:31:00",
                    "content": "Yeah, i read @tarun 's threat modeling treatise. I like it, but i don’t think the general approach will work on principle. The foundation of my claim comes from  cybernetics and ‘law of requisite variety’. Essentially, it says “the internal complexity of the system (uniswap) must match the external complexity it confronts”. Trying to predict all outcomes in a threat analysis is important, but you can’t stop there. This is the difference between being robust and resilient. Robust systems end up failing because they cannot possibly keep up with all the threat types and frequency. Resilient systems focus on ‘rapid response’ mechanisms to address the threat when it happens. I can’t believe i’m saying this, but Uniswap needs to take a page out of Google’s resiliency engineering handbook (we have some former google employees here). Google faces hundreds, if not thousands, of threats per day. The user never notices. Why? Because instead of focusing on robustness (threat modeling every possible type of threat), they instead focus on resiliency (isolate, identify, repair, CICD that sucker in seconds, and get it out the door into production before anyone blinks). This is why i’m insisting on governance progress biasing resiliency and rapid response, rather than the opposite. When a true threat arrives, we will have lost the operational resiliency to address it quickly. That’s my fear in a nutshell. As for specifics of governance, i don’t care as much. I only care that we move progressively towards a resilient state, and will object to governance proposals that would constrain this essential attribute of all complex adaptive modern organizations. The irony among crypto-natives is that the best template for navigating change is still outside our domain. What is mechanism design? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.481481481481482
                },
                {
                    "author_link": "https://gov.uniswap.org/u/jumnhy",
                    "index": "143",
                    "likes": "0",
                    "time": "20/10/2020-13:15:19",
                    "content": "I hear you on that front. The reason I reference mechanism design is that unlike conventional organizations, DAOs are governed by a set of rules that are functionally immutable, so at least some bits of entropy are minimized. In essence, mechanism design is tokenomics crossed with game theory. Here’s a great primer:    Medium – 14 Feb 18    A Crash Course in Mechanism Design for Cryptoeconomic Applications Understanding the Basic Fundamentals of “Cryptoeconomics” Reading time: 18 min read       Are you familiar with Aavenomics, Aave’s proposed governance and tokenomics framework? I think that’s a good synthesis of economics and governance. I think by combining a cybernetics-oriented and mechanism design informed approach to our governance process, we can do some great things here. That said, I can’t help but mention: I have a knee-jerk response to the “I don’t care/want to engage with/know how X is done, I just care that X happens!” e.g. “We have to stop climate change. Not doing so represents an existential threat to our species. I don’t care as much about the specifics of environmental science, I only care that the world move progressively away from destroying the planet.” Your in-depth posts across the forum bely the notion that this is all you’re saying, but like a somewhat inept middle manager, that sentiment feels like you’re demanding results without feeling any commitment to participating in the work. In that sense: concretely, what does cultivating resilience look like in our community here? I see you waging the good fight in terms of cultivating a lean, experimental culture. I see references to rapid experimentation as an exploratory methodology and rapid response as a threat mitigation modality. What does this look like in the context of Uniswap, when balanced against stability of the platform, in the context of a DAO where certain rules are immutable, and their consequences, irreversible-- certain spaghetti that, once thrown, might stick on the wall and rot for eternity? I’m not sure that I have examples of disastrous governance decisions, but I certainly have examples of poor mechanism design. The idea will be to marry these two–the thoughtful analysis needed to find theoretical future equilibria against a resilient organizational structure. I’m pretty clear on how one does the mechanism design part, (though I’m just an informed layman) but I’m still struggling to understand what it is you’re asking for in regards to achieving resilience. What are the intermediate steps? ",
                    "links": [
                        "https://medium.com/blockchannel/a-crash-course-in-mechanism-design-for-cryptoeconomic-applications-a9f06ab6a976"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.543269230769231
                },
                {
                    "author_link": "https://gov.uniswap.org/u/rabbidfly",
                    "index": "144",
                    "likes": "2",
                    "time": "20/10/2020-14:27:25",
                    "content": "Ha! Lots to think about. (where to start…)  DAOs are governed by a set of rules that are functionally immutable, so at least some bits of entropy are minimized. In essence, mechanism design is tokenomics crossed with game theory.  I’m essentially a creature of the Santa Fe complexity group. In full disclosure, my philosophical biases are heavily influenced by the belief that complex adaptive systems cannot be measured through mechanistic designs. This is an a priori argument for me, and makes it difficult to evaluate such systems. To be clear, it is not a criticism, but simply the issuance of a point of view, but also helps us understand where we may disagree. (i read through your link btw - thanks!) The core premise behind much of complexity based research is the evaluation around ontology, or causality. Where many see a mechanistic, Newtonian world that can be understood given enough study and investigation, others, like myself, see only probabilities and dispositionality. These probabilities are distinctly non-predictive in complex systems. The world-view models can be differentiated between ‘deterministic and reductionist’ and ‘non-deterministic’. I’m squarely in the latter camp. It doesn’t mean that Mechanism Design doesn’t have utility, only that i recognize limitations in how effective its modeling can be in predicting outcomes. For instance, the mathematical notation used to measure a system’s utility and the desire that it exceeds the cost is very troublesome. (in the embedded paper attached to your article link)   This doesn’t account for hierarchical benefits through multiple systems. A system can never be evaluated within itself, but only in the system harbouring it. A car for example, is a system. It has a goal however, which can ‘never’ be determined by reductively examining a car. Only when you zoom out to scan transportation systems, supply/demand, commuting, freedom of travel, do you being to understand what a car truly represents. Measurement of this network effect is impossible in a complex system. Humans make everything ‘complex’, even in a DAO with immutability built into it. This forum, governance discussion around the first proposal, is proof of that. If you widen the system to include economic modeling, threat modeling (SEC coming in and poking around), viability of the crypto-anarchist world view given current political environment, utility of DeFi, general prosperity of crypto natives and non-natives, etc… The point of this list is its length. You begin to see that variables contributing to outcomes are non-deterministic. The problem with attempting to place too much value on modeling is that you restrict the possible outcomes to the number of variables the model can account for.  This is my fundamental issue with these approaches. Many will claim success when they find a ‘use case’ to demonstrate that a certain type of modeling worked, but this is when i will fondly recall George Box’s quote (famed statistician)… “all models are wrong. some are simply more useful than others”. How i interpret this is to concede that modeling the universe or human behaviour is impossible. Worthwhile? Yes! But only when you recognize the limits. As a panacea it becomes a blunt weapon that dulls understanding.  I thank you for giving me the benefit of the doubt with     jumnhy:  Your in-depth posts across the forum bely the notion that this is all you’re saying   When i said i didn’t care about the ‘specific’ governance changes, it is only because i care far more about the ‘governance engine’ itself. I’m always zooming out to evaluate double-loop thinking, or problem dissolution - not resolution. Dissolution is when you ‘reframe’ the system to ensure the problem never returns. In other words, i am challenging the DAO foundation, and privileging that concern over the individual proposals that operate on top of that framework. So, hopefully you now see elevated concern where you may have seen a lack of it earlier. I agree with your suggestion to marry the methods of inquiry together (mechanism design with complexity). If i knew exactly how i would be writing papers about it. This helps reveal that what we are doing is fundamentally ‘experimental’ in nature. Humans simply have never successfully implemented this type of social organization before. If we maintain that perspective on ‘experimentation’, we are likely to be surprised by ‘beneficial’ outcomes. However, if we remain mired in trying to make the existing framework function, we limit the variation in responses, and almost ensure our demise. So, a round-a-bout way to answer your question     jumnhy:  In that sense: concretely, what does cultivating resilience look like in our community here?   It’s a mindset first and foremost. To accept that we cannot possibly predict outcomes through design, only ‘nudge’ towards our north star (goals). Once you accept the interminability of outcomes, then we can skillfully use ‘mechanism design’ to tinker with the gears and pulleys to catalyze change. Finally, most people are unaware that evolution (nature’s mechanism for adaptation) works mostly through exaptation, which is impossible to model. For example, the wings of a bird are an exaptation. The reason is that feathers were initially evolved to provide warmth - not flight. The subsequent adaptation to flight would only have happened if feathers had evolved a utility for that species. Most of evolution works in this manner. An experiment is not strictly useful because it proves or disproves a hypothesis. An experiment in complexity-based science, is useful because it catalyzes non-predictive changes, many of which may result in a beneficial adaptation. Trying to ‘stabilize’ Uniswap governance is the equivalent of slowing adaption and removing any possibility of a beneficial exaptation. In my philosophical model, this is deadly. (we should create a separate post to continue the discussion - i fear we are going well beyond the OPs intent - in Meta-Governance? really enjoy the honest dialog) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.3319348823866894
                },
                {
                    "author_link": "https://gov.uniswap.org/u/damiwack",
                    "index": "145",
                    "likes": "0",
                    "time": "25/10/2020-15:35:24",
                    "content": "im not sure of understand all but some explanation found on @VitalikButerin website my be according with your sentence and can guide us…   vitalik.ca    Governance, Part 2: Plutocracy Is Still Bad      So what’s the alternative? The answer is what we’ve been saying all along:  cryptoeconomics . Cryptoeconomics is fundamentally about the use of economic incentives together with cryptography to design and secure different kinds of systems and applications, including consensus protocols. The goal is simple: to be able to measure the security of a system (that is, the cost of breaking the system or causing it to violate certain guarantees) in dollars. Traditionally, the security of systems often depends on  social  trust assumptions: the system works if 2 of 3 of Alice, Bob and Charlie are honest, and we trust Alice, Bob and Charlie to be honest because I know Alice and she’s a nice girl, Bob registered with FINCEN and has a money transmitter license, and Charlie has run a successful business for three years and wears a suit. Social trust assumptions can work well in many contexts, but they are difficult to universalize; what is trusted in one country or one company or one political tribe may not be trusted in others. They are also difficult to quantify; how much money does it take to manipulate social media to favor some particular delegate in a vote? Social trust assumptions seem secure and controllable, in the sense that “people” are in charge, but in reality they can be manipulated by economic incentives in all sorts of ways. Cryptoeconomics is about trying to reduce social trust assumptions by creating systems where we introduce explicit economic incentives for good behavior and economic penalties for ban behavior, and making mathematical proofs of the form “in order for guarantee X to be violated, at least these people need to misbehave in this way, which means the minimum amount of penalties or foregone revenue that the participants suffer is Y”. Casper is designed to accomplish precisely this objective in the context of proof of stake consensus. Yes, this does mean that you can’t create a “blockchain” by concentrating the consensus validation into 20 uber-powerful “supernodes” and you have to actually think to make a design that intelligently breaks through and navigates existing tradeoffs and achieves massive scalability in a still-decentralized network. But the reward is that you don’t get a network that’s constantly liable to breaking in half or becoming economically captured by unpredictable political forces. ",
                    "links": [
                        "https://vitalik.ca/general/2018/03/28/plutocracy.html",
                        "https://www.coindesk.com/making-sense-cryptoeconomics/",
                        "http://arxiv.org/abs/1710.09437",
                        "https://github.com/ethereum/cbc-casper/wiki",
                        "https://medium.com/@jonchoi/ethereum-casper-101-7a851a4f1eb0",
                        "https://medium.com/@icebearhww/ethereum-sharding-workshop-in-taipei-a44c0db8b8d9",
                        "https://gov.uniswap.org/t/announcing-dharmas-intention-to-propose-the-retroactive-uni-distribution/7450/146"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.645556478405316
                },
                {
                    "author_link": "https://gov.uniswap.org/u/jumnhy",
                    "index": "146",
                    "likes": "2",
                    "time": "26/10/2020-13:14:56",
                    "content": "I think we’re very much on the same page. Mechanism design is simply the thoughtful consideration for structuring these (crypto)economic incentives. I like the idea of integrating that with complexity and exaptive systems “design” because one approach is very much in media res and the other is a priori. We can experiment and rapidly iterate our responses to emerging complex problems, while informing ourselves to avoid introducing perverse incentives. Sounds like you’re very much in alignment with this approach! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None",
                        "None",
                        "3rd party giving constructive criticism of proposal",
                        "None",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.5125
                },
                {
                    "author_link": "https://gov.uniswap.org/u/rabbidfly",
                    "index": "147",
                    "likes": "1",
                    "time": "28/10/2020-22:02:54",
                    "content": "so much to process… consensus was solved by satoshi at the intersection between cryptography and economics. but consensus of what? “consensus of record” - trust in the integrity of historical events what a better way to decentralize ‘history’. cryptography gives us the tech, and economic incentives through PoW gives us the feedback mechanism that hurts the most - money. governance is different however. it is forward looking and experimental in nature. the consequences of decisions are unknown a priori. linear causality was taken to the woodshed. governance in this context is the ‘extraction of potential future financial rewards’. but is that really true? as a delegate who is responsible for the health of the system they are overseeing, how can they use cryptoeconomics to form good decisions, either as an individual or a cartel? long-term thinking occasionally requires short-term sacrifices, or investments, in order achieve a benefit. ‘benefits’ often rely on value systems that go far beyond ‘financial rewards’, and also feature ethical considerations like sustainability, fairness, lawfulness, etc. i’m barely able to maintain a coherent thread, partially because this exploration into human social design is so new. let’s try and simplify. there are 2 modalities here.   system of record and proof using decentralized mechanisms (tech and incentives OR cryptoeconomics)  system of adaptation or advance and proof of value using retroactive mechanisms of a posteriori observation and study (PDCA)  #2 may very well become perverted if you attach economic incentives, because instead of trying to improve the system, delegates will engage in plutocratic behaviour to improve their economic standing. so instead, we have a voting-delegate system that relies on a different incentive paradigm - that of shared values. so, it’s no wonder that it also becomes subject to all the human vices that go with it.  Cryptoeconomics is not the answer for governance. It can’t be. The structure for human social advancement cannot be solved via the lens of economic constraint. in the end i offer no alternative except to encourage frequent experimentation, frequent failure, because the fuel for emergence is change. if agents in the system have the common good in mind, then i remain confident that we will incentivize beneficial adaptations. the essential question is and remains, how to incentivize this behaviour? we need something new. perhaps cryptoanthroeconomics. the intersection of cryptography, humanity, and economics is likely to offer clues. cryptoeconomics was devised to ‘avoid’ human tendencies. it has limitations because, unfortunately, you can’t design the human out of the system. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.5673400673400675
                },
                {
                    "author_link": "https://gov.uniswap.org/u/jumnhy",
                    "index": "148",
                    "likes": "1",
                    "time": "29/10/2020-14:16:25",
                    "content": "Good points all around. Economic incentives are insufficient. Even if you accept the premise in theory (I don’t) that market solutions can fix any problem, you have the issue of the human and all the unknown unknowns that humans bring to the table. While we don’t have a historical analog for DAOs and decentralized governance, we have numerous examples of the failure of the free market in the face of human ingenuity. Ultimately, humans (for now) control the system parameters, and that means that a.) a complex system will display emergent behavior, heuristics for which are non-existent and/or ineffable a priori, and b.) in the final analysis, none of those parameters for the system exist in a vacuum. On a practical note, to address the plutocratic equilibrium that everyone seems to be concerned about– We can introduce a sunset/expiration date on delegated votes. In another thread, we’ve been discussing the necessity of allowing “undelegation” at will, but as a check on delegate power, we can find a balance between allowing for delegated/minimal agency voting (ie, individual holders don’t have to invest time and energy in following governance minutiae, and simply give their voting power to delegates they trust) and the perverse incentives for delegates towards plutocracy. Thoughts? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.1796875
                },
                {
                    "author_link": "https://gov.uniswap.org/u/freezer",
                    "index": "149",
                    "likes": "2",
                    "time": "01/11/2020-17:29:48",
                    "content": "I am unable to read through all of the comments, so forgive my digression.  I do think the discussion on cryptoeconomics is productive, but I also think we should take a few practical steps to get the threshold vote re-voted on and passed.  Until then Uniswap governance is at a standstill. It seems like one of the initial reasons people voted NO against lowering the thresholds is that the ‘quorum threshold’ and ‘proposal threshold’ should be two separate votes. Furthermore,  ‘Retroactive Proxy Contract Airdrop — Phase One’ has now failed to pass (which seemed to be a major topic of discussion / fear of many in this thread) Is there a process to re-submit ‘quorum threshold’ and ‘proposal threshold’  as two separate votes? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.46875
                },
                {
                    "author_link": "https://gov.uniswap.org/u/jumnhy",
                    "index": "150",
                    "likes": "2",
                    "time": "03/11/2020-14:53:47",
                    "content": "Holy shit, I just happened across this post today again, and I missed a HUGE point: You said this, but I’m reiterating for my and anyone else’s benefit: Quorum is % of total supply, but only votes that have been delegated prior to any proposal being submitted (self-delegated, or to someone else) can participate. This is akin to bullshit voter registration requirements, and even more bullshit party registration requirements, in the United States. Not to mention that delegation incurs a gas fee (not a substantial one, but still… we’re already solidly in the plutocratic sphere by making 1 $-denominated shared = 1 vote, so it’s kind of insult to injury). On the flipside, you do want some sort of threshold of the total supply to be involved in the governance process. But functionally, you have scenarios where it is mathematically impossible to achieve quorum based on the levels of “voter registration”. A couple thoughts on this:  Make the quorum threshold a function of the number of delegated votes In tandem with 1.), require some minimum number of delegated votes required for any proposal to be proposed in the first place. Delegation has a sunset provision, ie, lasts only for a given number of votes or a given period of time (I lean towards number of votes)  I’m not super thrilled about point 2, but I’m picturing something with a delegation threshold that was proportional to the amount of votes delegated, ie, if a bunch of votes are delegated, the quorum threshold is high, if not, the quorum threshold is low, with a system minimum established based on the required delegation count. Could borrow from Vitalik’s quadratic voting to temper some of the edge cases (ie, get the bare minimum votes delegated to propose, keep the voter participation super low to be able to pass something easily). I’m not so sure. From our previous conversations, I think I know what complexity would tell us about this: you can’t control every edge case. You can’t mitigate every governance risk. Be adaptable instead. And I agree with that, fundamentally, but making quorum a function of the total supply, while large chunks of the supply are locked up, and participation is limited to delegated votes (so some fraction of the fraction)… that limits our ability to adapt substantially. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.628754578754579
                },
                {
                    "author_link": "https://gov.uniswap.org/u/caideguang",
                    "index": "151",
                    "likes": "0",
                    "time": "17/11/2021-03:31:09",
                    "content": "Support this proposal. At present, uni has many very good ideas in community governance, and there is no way to successfully propose. It is suggested to reduce the proposal standard. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.16
                }
            ]
        }
    ],
    "group_index": "423"
}