{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/the-growing-treasury-can-represent-a-big-incentive-for-a-governance-attack/7493",
            "title": "The growing treasury can represent a big incentive for a governance attack! ",
            "index": 7493,
            "category": [
                "Proposal Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/mmoossttaaffaa",
                    "index": "1",
                    "likes": "1",
                    "time": "21/10/2020-20:29:11",
                    "content": "the UNI treasury is growing fast (14m UNI each month) we will have more than 170m UNI in 11 months from UNI accumulating in the treasury this growing treasury is controlled by the circulating UNI which is around 200m since only 40% of the UNI (arounf 80m) is delegated for voting this makes any party that can secure 40m UNI can vote to take over the treasury with no way to stop them this growing treasury will just increase the incentives for such takeover so I think the best solution to this problem is to spend part of the treasury holdings… This will lower the incentives for such takeover and will increase the circulating UNI which will make such takeover more expensive to do the treasury is supposed to be spent to improve Uniswap right now the team is already working on V3 (so until then we just need to wait for them) - so no need to spend on devs righ now Uniswap is dominating DEXs volumes and TVL and there is no real competitiom from other DEXs right now - so no need to incentivice liquidity pools right now if we want to spend some of the UNI on UNI/ETH pool for example this will introduce the risk of too much of UNI supply get locked in the pool which will make such attacks even easier so the only solution I can think of is if we could allow the UNI/ETH liquidity providers to vote on any proposal but I am not sure if this is technically possible I would love to hear your thoughts ",
                    "links": [],
                    "GPT-summary": "The author of the post is discussing the potential for a governance attack on the UNI treasury due to its rapid growth and the fact that it is controlled by circulating UNI. The author suggests spending part of the treasury holdings to lower the incentives for such a takeover and increase the circulating UNI. The post is open to feedback and suggestions, and the author is asking for thoughts on whether allowing UNI/ETH liquidity providers to vote on proposals is technically possible.",
                    "GPT-proposal-categories": [
                        "Token economics",
                        "Governance and risk management",
                        "Grants, Funding and resource allocation",
                        "Law and regulations",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.670031055900621
                },
                {
                    "author_link": "https://gov.uniswap.org/u/kolten",
                    "index": "2",
                    "likes": "0",
                    "time": "21/10/2020-22:37:27",
                    "content": "Hi! It’s hard to tell what is being called for in this post. I’d recommend ironing it out further with clear guidelines for what you’re hoping to accomplish. A proposal / conversation already exists around a UNI / ETH pool: Add $UNI/$ETH pool to list of pools eligible for rewards Closing this thread for now. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.680555555555555
                },
                {
                    "author_link": "https://gov.uniswap.org/u/kolten",
                    "index": "3",
                    "likes": "0",
                    "time": "21/10/2020-22:37:32",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "438"
}