{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/uniswap-development-team-needs-to-play-a-bigger-role/6566",
            "title": "Uniswap development team needs to play a bigger role ",
            "index": 6566,
            "category": [
                "Site Feedback"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/Shitcoingambler",
                    "index": "1",
                    "likes": "4",
                    "time": "03/10/2020-15:48:12",
                    "content": "My previous thread was locked, as it covered a broad range of ideas: UNI Devs should create a better way to vote However, I wanted to expand on my original idea - It feels like Uniswap Governance (compared to projects like YFI) is generally weak - no proposals that we can vote on (only being discussed on a minor level), contributing members are having a hard time submitting their proposal due to requirements, etc. My suggestion here is that Uniswap’s Development team should take bigger action - promoting the governance portal through social media channels, actively discussing proposals (providing feedback, sharing ideas), and generally ensuring that action is being taken and progress is made - because the governance forum now feels more like a fan project that has low prospects, rather than something serious. Afterall, they have the biggest interest - vested team tokens. I’d love to hear what the rest of you guys think. P.S. If a moderator decides to lock this thread (which is very usual of him to do), I would appreciate a heads up how this post could be altered so that some discussion could take place, regarding this matter. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.105208333333334
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Uniguy772",
                    "index": "2",
                    "likes": "4",
                    "time": "03/10/2020-16:03:58",
                    "content": "Juat a fyi moderator did mention in your previous post why he locked it and where to continue the discussion. Respect is important especially in order to operate a forum like this one well. When a moderator locks your post best not to take is personally I have seen a lot of people have outbursts to their posts being locked which I can understand how being seen to have your post locked can be frustrating and feel silencing in a way but the purpose for moderators choosing to lock posts is usually because it is either “off topic”, “spam”, “duplication” or a topic not related to governance and more so a support question which should be moved to discord as again this is a Governing Forum not a general forum. Duplication of the same topic across multiple posts really limits conversation and requires people to find all the posts their conversation related to and post across multiple posts and is also just more work for a probably already overworked moderation team. Better to have 1 post if possible left open with open discussion on the 1 topic that way making the discussion both easy to follow and easy to moderate. An admin will probably lock this again, again not because its personal but because the topic you’re discussing is best appropriate in this post below as mentioned previously by the admin. I’m sure if you post the above as a comment in the post below people will still follow your conversation if they so feel they want to     Proposal: Reduce amount of UNIs required to submit governance proposal Proposal Discussion       10M UNIs are required to submit governance proposals, that’s insanely high. That’s like ~$65M worth by today’s price.  Proposal: reduce it to 10k. The community is already wanting to make proposals but they won’t go anywhere with this limit.  It’s understandable there are risks given the airdrop, but the team, their backers, and the wider community can surely thwart any  obvious attempts to weaponize governance.  [index]     ",
                    "links": [
                        "https://uniswap.org/blog/uni/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.870343137254902
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Shitcoingambler",
                    "index": "3",
                    "likes": "2",
                    "time": "03/10/2020-17:30:39",
                    "content": "But this isn’t about reducing UNI for governance proposal. This is to attract attention of developers and get them more involved. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Uniguy772",
                    "index": "4",
                    "likes": "2",
                    "time": "03/10/2020-17:56:12",
                    "content": "    Shitcoingambler:  However, I wanted to expand on my original idea - It feels like Uniswap Governance (compared to projects like YFI) is generally weak - no proposals that we can vote on (only being discussed on a minor level),   This sentence in a way could be read the same as wanting to reduce the amount of UNI by suggesting that few people can vote one of the only ways of achieving this would be to reduce the amount of UNI needed to propose this why the admin may have thought that post the most suitable link.     Shitcoingambler:  My suggestion here is that Uniswap’s Development team should take bigger action - promoting the governance portal through social media channels, actively discussing proposals (providing feedback, sharing ideas), and generally ensuring that action is being taken and progress is made - because the governance forum now feels more like a fan project that has low prospects, rather than something serious.   This is the purpose of this forum to discuss governance topics and to have those discussions exactly as you describe above. If you know someone who has a view a governnace idea link them to  this forum or an article it is more than just the team that has a say in this as a governnace token its also holders of UNI who will ideally have a say on proposed changes. It’s the people making the ideas that should be pushing them out and gaining the attention of UNI holders if they they believe their idea to be a good idea. Having centralised social media account picking and choose what to share would just come with controversy. Again would stick to admins advice and move this to the correct forum as it more than likely will end up being locked as it could be seen as a repetitive post. Hopefully I’ve helped cleared some things up for you around how your post may seem linked to where the admin suggests the topic should go ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.694444444444445
                },
                {
                    "author_link": "https://gov.uniswap.org/u/run",
                    "index": "6",
                    "likes": "2",
                    "time": "25/11/2020-14:06:47",
                    "content": "Why isn’t I  uniswap doing more to stop fraud, the same scammer most recently with the deriswap scam stole 900k using uniswap. They make tokens that can be bought but not sold then use uniswap to pull out the liquidity once the scam is over, this usually lasts for two weeks or longer with each scam and there should be a way to stop this fraud which is in 6 or 7 figure range well enough to fund terrorists ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://gov.uniswap.org/u/monet-supply",
                    "index": "7",
                    "likes": "2",
                    "time": "26/11/2020-00:11:04",
                    "content": "Uniswap has already made a great contribution in this regard with token lists, which allow 3rd parties to curate lists of tokens:    uniswap.org    Uniswap Token Lists announcement and details      Ultimately, it is the responsibility of users to vet tokens before purchasing. Uniswap is a permissionless system, so there is no way for governance to prevent people from creating markets or listing tokens. ",
                    "links": [
                        "https://uniswap.org/blog/token-lists/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.333333333333333
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Asuib515",
                    "index": "8",
                    "likes": "0",
                    "time": "25/03/2021-20:24:27",
                    "content": "I have been trying very hard to get ahold of uniswap customer service. Every time I try to do that in the discord I keep getting this. See attachment. Can anyone please help? Thanks! Screenshot_20210325-162400_Discord|690x251 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.677083333333333
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Tomy",
                    "index": "9",
                    "likes": "1",
                    "time": "28/03/2021-14:30:48",
                    "content": "Run, there you have the smart contracts for this case, read it before buy it, if you decide to buy, you do so entirely at your own risk, it’s not a platform fail but it’s true we need more ideas for the user interface, to do easy ways for not developer people. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.141156462585034
                }
            ]
        }
    ],
    "group_index": "406"
}