{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/consensus-check-hire-24-7-discord-support/7855",
            "title": "Consensus Check -- Hire 24/7 Discord support ",
            "index": 7855,
            "category": [
                "Consensus Check"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/Micah",
                    "index": "1",
                    "likes": "9",
                    "time": "29/10/2020-11:53:44",
                    "content": "Poll: Deposit 35,000 UNI into a 365-day Sablier (https://sablier.finance/) money stream destined for Serv.eth Support (https://serv.eth under construction). Serv.eth Support will provide 24/7* end-user support in the Uniswap Discord server. If they are unable to answer a users question directly they will triage the issue and gather any potentially necessary details, or redirect the user to a more appropriate place to ask their question. Serv.eth Support would monitor all channels except for the foreign language channels and the development channels. *lunch breaks and unexpected catastrophic event may cause small gaps in coverage from time to time. At such time as Uniswap governance acquires USDC or DAI, a new proposal will be submitted that cancels the existing Sablier money stream and replaces it with a 50,000 USDC/DAI per year money stream (pro-rated for remainder of the year). If Serv.eth Support fails to provide the level of service governance feels is worth the asking price, a new proposal will be submitted that cancels the existing Sablier money stream. Options: -Yes -No Link to temperature check governance forum post: Proposal: Paid Uniswap chat support Link to snapshot poll: https://snapshot.page/#/uniswap/proposal/QmVD5F6nWjzq2NjXuRKXdcABHS9EgZqyn67eygZmfxsfh2 ",
                    "links": [
                        "https://serv.eth",
                        "https://gov.uniswap.org/t/proposal-paid-uniswap-chat-support/7520/29",
                        "https://snapshot.page/#/uniswap/proposal/QmVD5F6nWjzq2NjXuRKXdcABHS9EgZqyn67eygZmfxsfh2",
                        "https://gov.uniswap.org/t/temperature-check-should-uniswap-services-be-paid-in-uni/8451/2"
                    ],
                    "GPT-summary": "The author of the post is explaining a proposal to hire a 24/7 Discord support team for Uniswap. The proposal involves depositing 35,000 UNI into a 365-day Sablier money stream for Serv.eth Support to provide end-user support in the Uniswap Discord server. The post also includes a poll with options for yes or no. A 3rd party could give constructive criticism or ask questions about the proposal.",
                    "GPT-proposal-categories": [
                        "Community and engagement",
                        "Grants, Funding and resource allocation",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.152972027972028
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Micah",
                    "index": "2",
                    "likes": "3",
                    "time": "29/10/2020-13:06:01",
                    "content": "I will be voting yes for this proposal, and likely voting no on most other things that come up.  If you would like to support this proposal feel free to delegate to me at 0xD095DDBC0BEa971A3ffcb5b64EEBAfce13B59538. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.96875
                },
                {
                    "author_link": "https://gov.uniswap.org/u/nsinalis11",
                    "index": "3",
                    "likes": "0",
                    "time": "29/10/2020-15:22:17",
                    "content": "i will vote yes donate here  0xbb76539b3a02F51170BF4b8bc251F153098cEB4E ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/kaibakker",
                    "index": "4",
                    "likes": "0",
                    "time": "29/10/2020-22:06:50",
                    "content": "This proposal is a no brainer. Lets do it to show uniswap governance is working. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Micah",
                    "index": "5",
                    "likes": "2",
                    "time": "31/10/2020-04:29:05",
                    "content": "Voting is now open on this Consensus Check! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/green",
                    "index": "6",
                    "likes": "0",
                    "time": "01/11/2020-17:40:37",
                    "content": "I prefer this to NOT pass, but the amount of UNI is so small, gas fees are comparatively more expensive. This is because I was banned from Discord due to unclear (to me, at least) reasons, so this is a service I will not be able to enjoy. While I don’t think that such a service is necessary, it could be profitable to Uniswap to clear doubts and get newfound interest with investors or users. Now, it does not have to be funded with Uniswap’s treasure:  Volunteers could do this service perfectly well, as they already do in an informal scale. UNI whales could fund it themselves if they assesed the risks and found it profitable.  This proposal just looks like a money-grab to me, really. What is serv.eth, even? Do you get a cut on this? Can anyone volunteer and participate in serv.eth to get part of this hiring? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.635416666666666
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Micah",
                    "index": "7",
                    "likes": "1",
                    "time": "01/11/2020-17:58:41",
                    "content": "    green:  What is serv.eth, even? Do you get a cut on this? Can anyone volunteer and participate in serv.eth to get part of this hiring?   Serv.eth Support is a new Ethereum focused support outsourcing business I am starting.  We have been using Uniswap Discord server for training since before UNI was announced.  We are not currently hiring, as we have enough now for 24/7 coverage which was the initial hiring target.  We don’t plan on hiring more until such time as we are generating positive revenue with what we have.     green:  Volunteers could do this service perfectly well, as they already do in an informal scale.   These “volunteers” are mostly my team getting training and practice.  We answer the majority of all questions in Uniswap Discord server.     green:  UNI whales could fund it themselves if they assesed the risks and found it profitable.   This is getting a bit off topic, but why do you think UNI whales should fund this rather than UNI governance?  Is it just a matter of “someone else should pay for this, not me”? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.678321678321678
                },
                {
                    "author_link": "https://gov.uniswap.org/u/green",
                    "index": "8",
                    "likes": "0",
                    "time": "01/11/2020-18:22:40",
                    "content": "I should’ve read this post before, but thanks for clarity.     Micah:  These “volunteers” are mostly my team getting training and practice. We answer the majority of all questions in Uniswap Discord server.   I was not referring exclusively to Discord, but I’m glad that front is covered.     Micah:  This is getting a bit off topic, but why do you think UNI whales should fund this rather than UNI governance? Is it just a matter of “someone else should pay for this, not me”?   Short-sighted selfishness on my part, really. I’d prefer if someone else paid this for me. I see it this way, there are some employees giving support for free. That support probably gives some value to UNI. That’s good. Now those employees suggest that they will move on to other things, but they would be interested in continuing providing this support in exchange of getting (at this moment) ~78k$. I don’t know how much Discord support Uniswap is getting. How many employees are we talking about? Is this service feasible to obtain from someone else for ~20k$? Why or why not? We don’t have a problem with this at the moment. Might be because you are taking care of it, or might be because it’s not such a significant problem. If this becomes a serious problem and price tanks due to unsufficient support, maybe a whale or two will take care of the problem temporarily. A short thought too, is spoonfeeding and giving easy solutions to people who are not willing to read the FAQ or do the barest amount of research good for the token? Why or why not? Maybe not helping incentivizes them to get up and do the research. I’m no marketer so I don’t have much of a clue about these things. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.171052631578947
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Micah",
                    "index": "9",
                    "likes": "0",
                    "time": "02/11/2020-00:23:54",
                    "content": "    green:  How many employees are we talking about?   5, which is required for 24/7 coverage.     green:  Is this service feasible to obtain from someone else for ~20k$? Why or why not?   If you find such a thing please let me know!  I started this business because there is a severe lack of options for dapp teams out there, with the only one being to hire a full time staff of 5 on your own.     green:  Now those employees suggest that they will move on to other things, but they would be interested in continuing providing this support in exchange of getting (at this moment) ~78k$.   With the recent price drop in UNI, I’ll probably have to adjust the ask amount.  I’m not in the business of taking on UNI token risk, but there is no simple/reasonable way to denominate this contract in something else so the ask is significantly higher than if it was denominated in USDC or even ETH. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.510416666666666
                },
                {
                    "author_link": "https://gov.uniswap.org/u/paulrberg",
                    "index": "10",
                    "likes": "0",
                    "time": "10/11/2020-13:04:29",
                    "content": "I am obviously biased, but I am in favour of this. I whitelisted the $UNI token in the Sablier UIs so that it can be streamed shortly after (and if) the proposal passes: Capture d’écran 2020-11-10 à 14.59.171086×442 22.6 KB For any questions or feedback, feel free to join the Sablier Discord server. ",
                    "links": [
                        "https://discord.gg/KXajCXC"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.666666666666666
                },
                {
                    "author_link": "https://gov.uniswap.org/u/UniT",
                    "index": "11",
                    "likes": "1",
                    "time": "10/11/2020-13:18:36",
                    "content": "Strongly against for the sole reason that we should not be treating UNI like USD. Any payments for goods and services should be done from a treasury of stablecoins not UNI. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.083333333333333
                },
                {
                    "author_link": "https://gov.uniswap.org/u/BOR4",
                    "index": "12",
                    "likes": "0",
                    "time": "10/11/2020-14:31:16",
                    "content": "Maybe there is investor who would be willing to buy UNI off treasury at current market price. That way we can avoid the currency uncertainty. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Micah",
                    "index": "13",
                    "likes": "1",
                    "time": "11/11/2020-07:32:42",
                    "content": "If there is an investor that is willing to lock up some DAI/USDC/ETH for the duration of the vote and we can get 10,000,000 UNI to stake in an autonomous proposal, it would not be particularly difficult to author a simple contract that ensures everything is trustless. Autonomous proposal contract would be created and seeded with the DAI/USDC/ETH.  The autonomous proposal would collect the 10M UNI delegates necessary to create the vote.  The vote would issue the following transactions (in order):  Swap UNI with the autonomous proposal for DAI/USDC/ETH at the rate defined in the proposal. Use the DAI/USDC/ETH to open a Sablier stream.  If the proposal fails to achieve 10,000,000 delegates by some time, the autonomous proposal will allow the investor to cancel the contract and get their DAI/USDC/ETH out. If the proposal fails to pass, the investor will be able to get their DAI/USDC/ETH out. If the proposal passes, the investor will be able to get the UNI out after the proposal executes. It is TBD if an autonomous proposal can attract 10,000,000 delegates or not, even when it is a generally supported proposal, which I suspect is going to be the hardest part.  The problem is that delegates cannot delegate, which means none of the large delegates like Dharma, Gauntlet, Penguin Party, etc. can help reach the 10M minimum necessary.  It would have to be individual UNI holders willing to delegate to an autonomous proposal.  FWIW, if someone wants to put in a lot of engineering work there is a way to trustlessly buy UNI at approximately market rate off of Uniswap.  The problem is that the engineering costs of implementing such a mechanism is likely higher than the entire value of this proposal!  I do think it would be valuable long term, so I think it would be worth doing, but UNI governance first needs to hire some engineers to implement it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.58294930875576
                },
                {
                    "author_link": "https://gov.uniswap.org/u/thesoulscoder",
                    "index": "14",
                    "likes": "0",
                    "time": "18/11/2020-00:29:51",
                    "content": "Customer support is always a good option ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Naught",
                    "index": "15",
                    "likes": "1",
                    "time": "25/11/2020-09:59:16",
                    "content": "A problem still exists with distribution. With this proposal I assume it will be one person putting up the funds and receiving UNI at a discount. The discount incentivizes that one person to sell UNI on the market to receive its return. The proposal requires DAI/USDC/ETH funds are locked up first for the duration of Pre-Proposal/Proposal process. During this time price could swing past that individual investor’s expected return for taking the risk. I believe this proposal will attract short term speculator (i.e. equivalent to a monthly call option); rather than a diverse group of long term supporters. I would vote for this strategy if it did not require a one/few people putting up the funds to start it, and it was more open towards others partaking in the buying of the discounted UNI (i.e. perhaps some sort of DAI/USDC/ETH drip of initial bidders?). It may be a better overall approach to have a proposal for UNI treasury to be sold off everyday to USDC/DAI so there is a fund to pay out for services. This proposal should be general purpose, and will not be directed to an individual project, but will allow sablier USDC/DAI payments for agreed upon service rates in future proposals. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.233333333333333
                },
                {
                    "author_link": "https://gov.uniswap.org/u/ashleigh",
                    "index": "17",
                    "likes": "0",
                    "time": "12/03/2021-17:26:14",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/ashleigh",
                    "index": "18",
                    "likes": "0",
                    "time": "12/03/2021-17:26:27",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "450"
}