{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/incognito-mode-for-uniswap/9220",
            "title": "Incognito Mode for Uniswap ",
            "index": 9220,
            "category": [],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/Boogaav",
                    "index": "1",
                    "likes": "12",
                    "time": "10/12/2020-17:23:11",
                    "content": "Hey guys! Andrey is here   This summer we started work on bringing a privacy layer to Uniswap, and I am happy to share that it went live today. image716×399 34.8 KB With this implementation, you will be able to trade against any Uniswap pool, remain your metadata anonymous and unlikable with the executed trade. Dive into tech —> Tutorial: trade on Uniswap anonymously —>  Looking forward to your feedback and suggestions on how to make it better  ",
                    "links": [
                        "https://global.discourse-cdn.com/business6/uploads/uniswap1/original/2X/e/e85c6dbc04fac3ed5e01d100e47eb855e8f9d8c5.png",
                        "https://ethresear.ch/t/pethereum-privacy-mode-for-smart-contracts-integration-with-defi/7336",
                        "https://we.incognito.org/t/how-to-trade-anonymously-with-puniswap/8259"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.420454545454546
                },
                {
                    "author_link": "https://gov.uniswap.org/u/g_dip",
                    "index": "2",
                    "likes": "1",
                    "time": "10/12/2020-19:24:13",
                    "content": "Very cool! Can you talk a bit more about the underlying anonymizing tech? How secure is it against different threat models? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.8359375
                },
                {
                    "author_link": "https://gov.uniswap.org/u/g_dip",
                    "index": "4",
                    "likes": "2",
                    "time": "10/12/2020-22:02:54",
                    "content": "@Boogaav is not on the Uniswap team, he’s building a separate protocol that uses Uniswap ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/ibrahim51",
                    "index": "5",
                    "likes": "0",
                    "time": "11/12/2020-16:34:30",
                    "content": "Salut à tout le monde 🙋 Je me demande moi je ne comprends rien ici Quelqu’un peut m’aider ici à comprendre quelque chose  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Boogaav",
                    "index": "6",
                    "likes": "1",
                    "time": "12/12/2020-05:09:14",
                    "content": "Hi @g_dip yep, we wrap a privacy layer around Uniswap protocol. Not affiliated with the core team, but highly appreciate the core team and community feedbacks. If you guys found it useful, and if there are any improvements should do to make this implementation better?     g_dip:  Can you talk a bit more about the underlying anonymizing tech? How secure is it against different threat models?   Yep, would love to, will share a proper article about it shortly. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.311111111111111
                },
                {
                    "author_link": "https://gov.uniswap.org/u/gman211",
                    "index": "7",
                    "likes": "1",
                    "time": "12/12/2020-12:16:28",
                    "content": "May I ask what are the pro and cons to a Incognito system? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Boogaav",
                    "index": "8",
                    "likes": "2",
                    "time": "15/12/2020-08:54:09",
                    "content": "Hi @g_dip sorry for the delay, happy to bring more clarity into the privacy implementation for Unsiwap : ) About technology Incognito is a privacy sidechain for Ethereum. It allows you to anonymize Ethereum based assets and Dapps. Three whales on which it is built Incognito Mode for Uniswap. Interoperability Communication between Ethereum & Incognito networks goes through a non-custodial, trust-less bridge. image1025×559 58.9 KB It’s a two-way relay bridge that lets you transfer assets from Ethereum to incognito and vice versa. when someone converts ETH to pETH (private ETH), they aren’t swapping their asset with someone else’s. instead, ETH is locked in a smart contract and new pETH is minted on incognito. When the pETH are burned (to maintain a 1:1 ratio), the locking contract on Ethereum will verify the validity and unlock it upon submission of burn proof. for example, you can convert 1000 “public” DAI (on Ethereum) to 1000 “private DAI” pDAI (on incognito) via Ethereum -> incognito relay. once you have 1000 pDAI, on the incognito chain, you can send 500 pDAI to Alice privately, send 300 pDAI to bob privately, and then convert the remaining 200 pDAI back to “public” DAI whenever you want via incognito -> Ethereum relay.  READ THE BRIDGE DESIGN  READ THE BRIDGE CODE  READ THE ZKP FOR MOBILE CODE  Any feedback is welcome. Privacy stack image1024×768 107 KB READ THE PRIVACY STACK Privacy for smart-contracts After Incognito went on mainnet and the trust-less Ethereum bridge went live (Nov 2019) and we started work on bringing a privacy layer for Smart contracts. Execute Instruction Executing is the process of running a function call of an Ethereum smart contract anonymously. For example, running swap(pETH, pDAI) on Uniswap anonymously. The following is an overview of the EXECUTE instruction flow:   A user confidentially signs and sends an EXEC instruction from a pApp on Incognito, with information about which counterpart dApp on Ethereum they want to run and the parameters. The bridge forwards the EXEC instruction to the Broker smart contract. The Broker smart contract parses the EXEC instruction without revealing the user identity, verifies the parameters (especially the amount the user wants to spend against the user balance), and finally sends a message to a suitable smart contract via the encoded ABI.  An EXECUTE instruction contains the following parameters:  The input token to spend on this transaction The input amount of input token to spend on this transaction, which should not exceed the user balance in the Broker smart contract The output token if the execution returns one The dApp contract address The encoded ABI of the target function of the dApp The timestamp of the transaction The signature on the combined data of the above parameters  READ pETHEREUM SPEC READ pETHEREUM DEV TUTORIALS Trade on Uniswap anonymously pUniswap 1.0 is available in Incognito wallet. What is next pUniswap 1.0 is the first implementation and we are going to continue development in this direction. Our next milestones:  Wrap privacy around Metamask Bring pUniswap in web Measure demand in privacy for Uniswap trades The main goal is: to bring Incognito mode for Uniswap main interface  Looking forward to community feedback. ",
                    "links": [
                        "https://we.incognito.org/t/incognito-mode-for-ethereum/53",
                        "https://github.com/incognitochain/bridge-eth",
                        "https://github.com/incognitochain/privacy-js-lib",
                        "https://global.discourse-cdn.com/business6/uploads/uniswap1/original/2X/9/91ad32df6ae375a6b1a357fb43a90ba623c34335.png",
                        "https://we.incognito.org/t/sending-cryptocurrencies-confidentially-ring-signature-homomorphic-commitment-and-zero-knowledge-range-proofs/170",
                        "https://ethresear.ch/t/pethereum-privacy-mode-for-smart-contracts-integration-with-defi/7336/5",
                        "https://we.incognito.org/t/pethereum-developer-tutorials/6668",
                        "https://incognito.org/wallet"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.8244206773618545
                },
                {
                    "author_link": "https://gov.uniswap.org/u/g_dip",
                    "index": "9",
                    "likes": "0",
                    "time": "15/12/2020-22:19:03",
                    "content": "Interesting, so you’re having every node on incognito effectively validate the bridge proofs? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.75
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Boogaav",
                    "index": "10",
                    "likes": "1",
                    "time": "16/12/2020-13:58:50",
                    "content": "yes, if proof has been submitted to a shard then all validators in that shard would verify the proof. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Boogaav",
                    "index": "11",
                    "likes": "2",
                    "time": "26/01/2021-13:11:22",
                    "content": "    gman211:  May I ask what are the pro and cons of a Incognito system?   Hey @gman211 please forgive me, I thought that I answered your question, and just found that I missed it  Obviously my opinion here will be quite subjective, but I’ll try. Pros   Privacy Simply within Incognito, all your activity remains anonymous, no matter you store, transfer trade or invest assets  Network fee. As layer2 for Ethereum and Bitcoin networks Incognito applies a network fee that way cheaper than on main networks. For example the gas fee for transferring ETH, DAI, or UNI within the network ≈ $0.000001. Btw, if you transfer ETH or DAI you are able to pay gas in ETH or DAI accordingly  Interoperability. Incognito is interoperable with your favorite Dapps. The reason for this announcement is to show up privacy tech we built on top of Uniswap  Cons Probably, from the outside, you guys can see better but I’ll try   Hight gas fee for interoperable Daspp. For example, when you use Incognito mode for Uniswpa, you still have to cover a high gas fee TXs within the network are slower. Generating ZKP tx from mobile takes much more time than generate public TXs pUniswap is available from mobile apps. Web-version is still under development While we have 10k active monthly users Incognito supported only 3 crypto wallets (working on expansion)  @gman211 if you will have a chance to try out the Incognito app or pUniswap, please bring your feedback as well. Good, salty feedbacks help us to build better products  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.341666666666667
                }
            ]
        }
    ],
    "group_index": "519"
}