{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/temperature-check-add-limit-order-to-the-ui/13374",
            "title": "Temperature Check - Add limit order to the UI ",
            "index": 13374,
            "category": [
                "Temperature Check"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/imkharn",
                    "index": "1",
                    "likes": "1",
                    "time": "14/07/2021-04:21:36",
                    "content": "A quasi-limit order is a provision of liquidity within the smallest possible range. This is easy to add to the UI. An inconvenience still remains that the liquidity needs to be withdrawn manually after the market price moves across the liquidity range or it could get swapped back again if the price retraces. Is there a reasonable gas cost method of flagging a liquidity provision as a limit order and only allowing it to participate in trades that are one direction. Whenever a trade currently happens it is already counterpartied with a list of valid LPs where the validity is determined by their range. If outside the range, it is not part of the trade. Can the same be done directionally only allowing the liquidity to be active for swaps in the desired direction thereby also updating the backend to make limit orders? ",
                    "links": [],
                    "GPT-summary": "The author of the proposal is seeking feedback on the feasibility of adding a limit order to the UI. They are asking if there is a reasonable gas cost method of flagging a liquidity provision as a limit order and only allowing it to participate in trades that are one direction. They are also asking if the same can be done directionally only allowing the liquidity to be active for swaps in the desired direction thereby also updating the backend to make limit orders.",
                    "GPT-proposal-categories": [
                        "Smart contract updates",
                        "Token economics",
                        "Interoperability and Scalability"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://gov.uniswap.org/u/ilia_0x",
                    "index": "2",
                    "likes": "0",
                    "time": "11/12/2022-12:55:06",
                    "content": "Yes, we need limit orders on Uniswap. We can provide the contracts that we are using for LO on 0xPlasma. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/KromatikaFinance",
                    "index": "3",
                    "likes": "0",
                    "time": "09/01/2023-15:55:30",
                    "content": "Kromatika Finance has resolved this issue by automating Uniswap v3 on its limit orders. Kromatika would be happy to engage with Uniswap and provide a solution using Kromatika’s contracts if required. It is the most used product of Kromatika and several users have switched over from other DEX because of the innovative tech behind Uniswap v3 and how Kromatika has leveraged this tech to provide a solution. Kromatika is built on top of Uniswap v3. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party offering a solution to the proposal",
                        "3rd party advertising proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.267857142857142
                }
            ]
        }
    ],
    "group_index": "101"
}