{
    "poll_list": [
        {
            "id": "QmTksCuBh2HLMKSXUE7yyCHGE9dCevac9oEWnkef8Junn2",
            "title": "Temperature Check - [Merge the Uniswap Grant Program into Uniswap DAO Governance]",
            "discussion": "",
            "body": "View the proposal here:\n\nhttps://gov.uniswap.org/t/temperature-check-merge-the-uniswap-grant-program-into-uniswap-dao-governance/13511",
            "choices": [
                "Yes; Merge Grants and UNI DAO",
                "No"
            ],
            "scores": [
                9959.673901645,
                208871.96187575196
            ],
            "start": 1626567300,
            "end": 1626740100,
            "snapshot": "12847365",
            "state": "closed",
            "author": "0xC8093dA592961367D3448e4635ED9e41C63d2d34",
            "space": {
                "id": "uniswap",
                "name": "Uniswap"
            }
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/temperature-check-merge-the-uniswap-grant-program-into-uniswap-dao-governance/13511",
            "title": "Temperature Check - [Merge the Uniswap Grant Program into Uniswap DAO Governance] ",
            "index": 13511,
            "category": [
                "Temperature Check"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/anapheys",
                    "index": "1",
                    "likes": "0",
                    "time": "17/07/2021-23:55:46",
                    "content": "Merge the Uniswap Grant Program into Uniswap DAO Governance. A more intuitive Uniswap DAO future. Hello UNI community, I am the “summoner” of Ocean Protocol’s OceanDAO. My Twitter. When it comes to Public Protocol DAOs on Ethereum (aka DAOs where you can participate in governance just by way of having a project’s native ERC-20), a generalization as of today, there are “Governance DAOs” and “Grants DAOs”. “Governance DAOs” are where people submit proposals to change arbitrary protocol parameters:  Yearn Example Compound Example Synthetix Example Uniswap Example  “Grants DAOs” are where people submit proposals for grant funding to build something related to the given protocol:  Ocean Protocol Example 1 Ocean Protocol Example 2  IMPORTANT NOTE: There are numerous “Grant Programs” in the crypto space that have been created via a Governance Proposal.  Uniswap Grants: Uniswap Interface  Compound Grants: Compound | Proposal Detail #40  Aave Grants: Boardroom Management Portal  Synthetix Grants: Governance | Synthetix Staking   While some of these Grants Programs may call themselves a “Grant DAO”, they are not really in practice (which is okay; just different) as the grant proposals are chosen by committee as opposed to voted on by the protocols’ token holders. This distinction is crucial. IMO, a “Grants DAO” are where the specific grant proposals are voted on by the token holders. Post Mortem: Governance Proposal 005 - DeFi Education Fund The issue with the UNI Governance Proposal 005 was that it was actually a Grant Proposal that ended up in the Governance DAO proposal pipeline. And remember, Uniswap Grant Proposals are handled by the Uniswap Grants Program and decided on by committee. The Uniswap Governance DAO was not set up to handle a pure-play grant proposal and does not have the necessary requisite community oversight infrastructure established for public tracking of a grant recipient’s roadmap and milestone achievements. Because some of the community didn’t feel like they had transparency into the DeFi Education Fund was cause for some recent backlash [1, 2, 3, etc.]. Current Standing of Uniswap Grants: Uniswap Grants has completed Uniswap Grants Program v0.1 across 4 waves; you can see the results here. Actively in progress now, Uniswap Grants is planning on Reinstating UGP v0.2 with existing funds. Proposal: Merge the Uniswap Grant Program into Uniswap DAO governance. Action: What this means is those that are applying for Uniswap Grants should be put up for UNI token voting to receive a grant or not.  Funds continue to come from the Uniswap grants pool/multi-sig. Voting is conducted at the conclusion of each grant wave. All grant proposals in that wave are put on Snapshot (by the Uniswap Grants Core team) at the same time-window for yes or no voting. Those with the highest UNI votes received are selected to get a grant in descending order until total allocated grant funds available are depleted. The Proposal for Reinstating UGP v0.2 with existing funds is updated to remove the grant committee, as grantees will be decided by UNI token voters. However, someone still needs to put the Grant Proposals from the Notion Submission Form on snapshot, Grants need to meet some fidelity of minimum criteria, and there is the need for the multisig signers - so some form of committee needs to remain, just with different responsibilities. Uniswap Grant proposals are posted for voting by the Uniswap Grant Core team and, operational speaking, therefore when the wave voting window opens, Grant Proposals can just be posted by core team and DO NOT need to follow the [Temperature Check] → [Consensus Check] → [Governance Proposal] workflow. The emergence of a Uniswap Grant Recipient proposal, milestone, and roadmap tracking infrastructure (Updates on UNI Gov Discourse, an Airtable grantee updates-to-community workflow, or some other proprietary ROI tacking tooling) to keep the UNI community up to speed on the deliverables of the given grant to optimize for Grant transparency (aka the core problem going on with gov proposal 005).  VOTE: TEMPERATURE CHECK - Snapshot Poll ",
                    "links": [
                        "https://twitter.com/anapheys",
                        "https://snapshot.org/#/ybaby.eth/proposal/QmddCbGYbkooZ1zp8oYnbBz6frXLRc9xbkapXcuZcdzmMF",
                        "https://compound.finance/governance/proposals/39",
                        "https://snapshot.org/#/snxgov.eth/proposal/QmYjAyAWaCBwocWkG2YkJ5S3bk9LLEdUAvRgpyHYwE2FXe",
                        "https://app.boardroom.info/uniswap/proposal/cHJvcG9zYWw6dW5pc3dhcDphcmNoaXZlOjQ=",
                        "https://vote.oceanprotocol.com/#/officialoceandao.eth/proposal/QmewLHnF4DG7nxopMsyfxg3foYbqPSoFcSBhCiAVWL3EYT",
                        "https://vote.oceanprotocol.com/#/officialoceandao.eth/proposal/QmaY7dEFGU2KRMCp2PFCJfCMx6YsNRmjZ27ruS8MDL7MCv",
                        "https://app.uniswap.org/#/vote/0/3",
                        "https://compound.finance/governance/proposals/40",
                        "https://app.boardroom.info/aave/proposal/cHJvcG9zYWw6YWF2ZTpkZWZhdWx0OjEz",
                        "https://staking.synthetix.io/gov/snxgrants.eth/QmdXdj2Nm4A4Wq6eJu74gX7PUHYwQBZJiY12fpGekwDyew",
                        "https://gov.uniswap.org/t/governance-proposal-005-defi-education-fund/12963",
                        "https://gov.uniswap.org/t/demand-for-transparency-from-defi-education-fund/13299",
                        "https://gov.uniswap.org/t/discussion-should-we-request-defi-education-funds-to-be-put-in-wallet-controlled-by-governance-with-spend-limit/13379",
                        "https://gov.uniswap.org/t/proposal-removal-of-established-cranial-follicles-fund/13314",
                        "https://gov.uniswap.org/t/rfc-uniswap-grants-program-v0-1/9081",
                        "https://twitter.com/uniswapgrants/status/1407429123664928772",
                        "https://gov.uniswap.org/t/temperature-check-reinstating-ugp-v0-2-with-existing-funds/13310/1",
                        "https://gov.uniswap.org/t/temperature-check-reinstating-ugp-v0-2-with-existing-funds/13310/1",
                        "https://airtable.com/shrEXXxXB1humz7VS",
                        "https://gov.uniswap.org/t/read-me-how-to-create-a-temperature-check/7606",
                        "https://gov.uniswap.org/t/readme-how-to-create-a-consensus-check/7607",
                        "https://gov.uniswap.org/t/community-governance-process/7732/1",
                        "https://gov.uniswap.org/",
                        "https://snapshot.org/#/uniswap/proposal/QmTksCuBh2HLMKSXUE7yyCHGE9dCevac9oEWnkef8Junn2"
                    ],
                    "GPT-summary": "The author proposes to merge the Uniswap Grant Program into Uniswap DAO governance, allowing UNI token holders to vote on grant proposals. The author explains the difference between Governance DAOs and Grants DAOs and highlights the issue with the UNI Governance Proposal 005. The proposal suggests that grant proposals should be put up for UNI token voting, and the funds should continue to come from the Uniswap grants pool/multi-sig. The post also mentions the need for a Uniswap Grant Recipient proposal, milestone, and roadmap tracking infrastructure to optimize for grant transparency. The post ends with a temperature check snapshot poll.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Change to proposal pipeline",
                        "Law and regulations",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.300347222222222
                },
                {
                    "author_link": "https://gov.uniswap.org/u/inkymaze",
                    "index": "2",
                    "likes": "0",
                    "time": "18/07/2021-10:28:20",
                    "content": "The preference for a different Grant DAO structure is clear but the reasoning is not. How would this improve the grants process, velocity of funding, efficacy of due diligence, and reduction in friction for applicants? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.958333333333334
                },
                {
                    "author_link": "https://gov.uniswap.org/u/wijuwiju",
                    "index": "3",
                    "likes": "0",
                    "time": "18/07/2021-12:20:25",
                    "content": "hey @anapheys I like the idea of DAO grant control by token holders voting in general, and think that should be further discussed, especially the underlying mechanism to make it robust and composable with any erc20 and preferably on L2, so I would more than keen in discussing, allocating time to research and proposing such mechanism, I even have few in my head. On the other hand I think UGP showed great success and I have no problem with how committee is handling task set upon them, results are clear, they are fairly transparent and cope well with communicating + I think @callil is one of the best talents in the entire industry and would love to see what he could bring to UGP v0.2 as if I’m correct he will be participating in the board, also I think UGP has been without funding for sometime now and we should be focusing first on providing them with funding to restart their ability to grant ASAP So to wrap up, I’m for DAO granting in the future and would love to discuss potential mechanisms, but against mixing it with UGP v.02 as of right now, hence vote against this temp check Please feel free to reach out to me, with any means, u can see them in my profile, cause I really been giving some thoughts on how to make generic DAO grants work and would love to discuss and make it real in the future! Thank you! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.192142857142857
                },
                {
                    "author_link": "https://gov.uniswap.org/u/jcp",
                    "index": "4",
                    "likes": "3",
                    "time": "19/07/2021-02:52:12",
                    "content": "I’d be against trying to merge these together. It’s pretty much impossible to imagine running a grants program as efficiently as it’s being done right now with token voting for every grant. I think it would slow down the number of grants being received and also place a pretty large burden on token-holders. I don’t think most token holders have the time to do the application reading, interviewing, and in-depth assessment required to make decisions about every single grant application. There’s a reason the grants program exists as a separate committee: Token voting shouldn’t be used for everything. Requiring voting on every single decision really slows things down and puts too much process in the way of getting work done. The way I see it, token voting was used for the high-level decision to fund the grants program, with certain specifics (budget, committee members, etc.) and then the program can use more centralized decision-making to work efficiently. Another piece here is about experience and expertise. UGP currently has people involved with tons of experience funding grant applications (Ken, for example, has worked for the Ethereum Foundation for years handling EF grants). I’d personally rather appoint great people like this and allow them to pursue the goal of grant funding to the best of their ability than require token-weighted voting for every decision. That all being said, UGP has limits. It has a limited budget and it’s rare that any grant exceeds even $75k. For larger allocations of the UNI Treasury, I definitely believe that public proposals and token-weighted voting are the right path forward. That’s kind of how things currently work, so right now, I think it makes sense to continue UGP and the rest of UNI governance as is. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.784580498866213
                },
                {
                    "author_link": "https://gov.uniswap.org/u/BOR4",
                    "index": "5",
                    "likes": "0",
                    "time": "19/07/2021-06:47:48",
                    "content": "I wouldn’t do this for all grants. Maybe UGP can do snapshot votes for grants that are $100k+. Making a snapshot vote for grants that are $1-2k is bit too much and only slows things down IMO. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.074074074074074
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Naught",
                    "index": "6",
                    "likes": "0",
                    "time": "19/07/2021-16:22:20",
                    "content": "I agree with the overall sentiment that this would create more bureaucracy in the governance process by requiring much more participation and attention from the community at each step. Having large proposals and idea’s become their own DAO’s that off branch from the main treasury is a good current approach as it allows room for those who are funded to get goals accomplished quickly. It also allows reputation to be scrutinized over the long term for those individuals and teams who got funding. Perhaps what your are proposing could be its own “transparent application process” off-shoot grants DAO where it aims to cultivate grants by using a meta “fish.vote” type of structure for grants that were unsuccessful with UGP and want the application process and development of an idea to be decided in the open by a smaller more active subset of the larger Uniswap community. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.214985994397759
                },
                {
                    "author_link": "https://gov.uniswap.org/u/A1igator",
                    "index": "7",
                    "likes": "0",
                    "time": "19/07/2021-20:22:36",
                    "content": "I agree with the above that it’s not a good idea right now, but I would keep an eye out for https://coordinape.com/ as it might prove to be a good platform to use. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.794642857142858
                },
                {
                    "author_link": "https://gov.uniswap.org/u/anapheys",
                    "index": "8",
                    "likes": "1",
                    "time": "19/07/2021-21:13:31",
                    "content": "This was fun - thanks everyone. Looking like not going to pass, and really appreciate the discussion. We are in the era of DAO experimentation, so this is helpful commentary. There are so many different ways to implement a DAO and no one perfect fit for all. This is a fantastic article on how we think about arriving at protocol self-sustainability at Ocean by funding positive ROI grants: The Web3 Sustainability Loop. A system design for long-term growth of… | by Trent McConaghy | Ocean Protocol For those interested, keep an eye on OceanDAO where we fund community grants via DAO voting monthly. We are learning fast and keeping pulse on community feedback to best build the tooling and components to lower friction, improve due diligence, and voter turnout. Excited for the future of Uniswap and UGP. Cheers, Alex ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party or author is advertising proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.642424242424243
                }
            ]
        }
    ],
    "group_index": "111"
}