{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/uniswap-liquidity-mining-report/9506",
            "title": "Uniswap Liquidity Mining Report ",
            "index": 9506,
            "category": [],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/Integral",
                    "index": "1",
                    "likes": "10",
                    "time": "29/12/2020-13:47:34",
                    "content": "Note: there’s TL;DR at the end of this post. Liquidity Mining has been running for 2 months, from Sep 18 to Nov 17 (announcement). Before seriously considering restarting the program, it would be nice to have some data on whether liquidity mining (from here LM) had any impact. This report tries to provide that data in a human-readable way. First, we would need to decide on what exactly we would like to achieve with LM. As the name itself suggests, the primary goal would be to increase Uniswap’s liquidity. Thankfully, this is easy to measure since with AMMs, liquidity is directly proportional to the value locked. To make it easier to compare Uniswap with CEXs (like Binance and Coinbase), we will also calculate 2% market depth. But what’s the point of liquidity if it’s not utilized properly? In other words, did increase in liquidity (if any) led to the increase in trading volume as well? Did Uniswap increased its market share? As the DEX market is not very efficient yet, we wouldn’t expect volume and liquidity to correlate perfectly, but having no connection at all would be worrisome. We will look at pairs that were incentivised by LM: DAI/ETH, USDC/ETH, USDT/ETH, WBTC/ETH. Timewise, we will pick Sep 11 (week before LM started), Nov 11 (week before LM finished), and Dec 17 (month after LM finished) for comparison. Liquidity We will start by looking at Uniswap’s liquidity, or how much dollar value is locked inside each of the pair. uniswap_liquidity1440×766 69 KB Historical liquidity for each of the pair follow similar pattern: rapid growth at the start of LM, then sharp decrease at the end of LM, and finally gradual decrease down the road. Above is the value locked chart for USDT/ETH pair.     Value Locked, USD WBTC/ETH DAI/ETH USDT/ETH USDC/ETH Total     Sep 11 44.77 48.01 81.16 68.93 242.89   Nov 11 905.23 386.47 525.84 668.37 2485.91   Dec 17 152.52 122.30 123.67 106.38 504.88   LM impact 2021.69% 804.91% 647.87% 969.54% 1023.46%   LM end impact 16.85% 31.65% 23.52% 15.92% 20.31%    (Source: Uniswap Info) There is a clear correlation between LM and liquidity. Overall, liquidity grew 10x since LM was introduced, and later it shrinked 5x when LM ended. Note that some of the growth might be related to DeFi growth in general. Market depth To make it easy to compare Uniswap’s liquidity with CEXs, let’s calculate 2% spread for each of the pair. X% spread is the size of a single order that will result in X% slippage. It shows how deep the order book of a given market. As one would guess, market depth would follow Uniswap’s pair liquidity. On the chart, we can see the same pattern as above. As LM starts, the depth grows rapidly then gradually. Once LM is ended, the depth drops sharply, with WBTC market suffering the most. uniswap_depth1768×1134 141 KB (Source: Integral) Let’s also compare Uniswap’s market depth to Binance and Coinbase Pro to see how it performs across the larger trading. Note: it’s not fully correct to measure WBTC and stablecoin markets on CEXs, since those exchanges have native Bitcoin and USD markets, which are usually much larger. However, it still can provide some insight.     2% depth, USD WBTC/ETH DAI/ETH USDT/ETH USDC/ETH     Uniswap 1,355,767 1,099,463 1,089,129 919,459   Binance 11,673,226 221,245 2,427,735 395,130   Coinbase Pro 1,436,993 159,043.5 - 401,248    (Source: Coingecko) Here, Uniswap dominates DAI/ETH and USDC/ETH markets, while WBTC/ETH and USDT/ETH have a room for improvement. Trading volume Finally, let’s look at Uniswap trading volume to see whether the increase (and subsequent drop) was reflected in trading activity. We will also look at liquidity utilization rate. Here, instead of looking at single day, we will look at week’s average to smoothen day-to-day fluctuations.     Trading volume, USD WBTC/ETH DAI/ETH USDT/ETH USDC/ETH Total     Sep 11 8.21M 26.17M 51.45M 45.32M 131.17M   Nov 11 35.11M 26.94M 53.72M 50.84M 166.62M   Dec 17 15.3M 90.75M 37.31M 47.41M 190.78M   LM impact 427.47% 102.94% 104.41% 112.16% 127.03%   LM end impact 43.57% 336.85% 69.44% 93.25% 114.49%    Here, we can see that WBTC has the biggest impact, as volume increased fourfold. Interestingly, stablecoin markets don’t happen to have the same effect. Liquidity utilization will show how effective the liquidity is used. It’s defined as the ratio between trading volume and value locked. For example, 20% utilization would mean that liquidity is 5x of daily trading volume.     Liquidity utilization WBTC/ETH DAI/ETH USDT/ETH USDC/ETH     Sep 11 18.35% 54.51% 63.40% 65.75%   Nov 11 3.88% 6.97% 10.22% 7.61%   Dec 17 10.03% 74.21% 30.17% 44.57%   LM impact 21.14% 12.79% 16.12% 11.57%   LM end impact 258.59% 1064.44% 295.29% 585.87%    As we can see, liquidity utilization dropped significantly. The rapid growth of supply couldn’t meet the comparable demand in such a short time. Finally, let’s explore whether LM impacted Uniswap’s market share. We will calculate the ratio between Uniswap volume and the total DEX trading volume.     Uniswap market share WBTC/ETH DAI/ETH USDT/ETH USDC/ETH Average     Sep 11 63.68% 50.96% 54.38% 57.01% 56.51%   Nov 11 91.51% 73.02% 68.46% 86.70% 79.92%   Dec 17 42.43% 73.73% 23.75% 69.07% 52.25%    (Source: Uniswap Info, Integral) Clearly LM helped Uniswap to significanly increase market domination. As incentives ended, most of that effect disappeared. Conclusion In short, LM impacted Uniswap’s liquidity significantly. The question of whether that increase translates to the volume is open. Also, it’s worth to mention that large share of incentivised liquidity is not sticky. This report doesn’t try to come up with any specific LM proposal. Instead, it provides raw data for further review. However, here are some ideas for the next round of LM:  Focus incentives on WBTC liquidity, consider other Bitcoin tokens as well. Consider resuming incentives on Tether, as this market seem to benefit the most out of all stablecoins. Consider increasing the duration of LM to 4-6 months so that the impact of LM on trading volume could be measured better.  TL;DR  Liquidity grew 10x since LM was introduced, and later it shrinked 5x when LM ended Market depth is on par with major centralized exchanges, although WBTC/ETH and USDT/ETH markets could be improved. WBTC had the biggest impact on volume, as the trading activity increased fourfold. Stablecoin markets didn’t have the same effect. LM helped Uniswap to significanly increase market domination. As incentives ended, most of that effect disappeared.  ",
                    "links": [
                        "https://global.discourse-cdn.com/business6/uploads/uniswap1/original/2X/f/f5676022957366046156cc5db63823a7d3b1d404.jpeg",
                        "https://global.discourse-cdn.com/business6/uploads/uniswap1/original/2X/4/41a28dc8044d52fc0430189db6ad31b3fd119222.jpeg"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4756203763556694
                }
            ]
        }
    ],
    "group_index": "527"
}