{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/uniswap-pools-to-incentivize-after-mid-november/7857",
            "title": "Uniswap pools to incentivize after Mid November ",
            "index": 7857,
            "category": [
                "Proposal Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/Danpi314",
                    "index": "1",
                    "likes": "12",
                    "time": "29/10/2020-12:37:34",
                    "content": "I’ve been approximate with the timing in the title as block times may vary, but I’d expect the current rewards to expire around November 17th Midnight UTC. Ideally, we need to incentivise tokens which make Uniswap even more competitive with other DeFi and more importantly CeFi programs moving forward. First of all, this liquidity mining has been very successful, increasing liquidity from $900M the day before this came into almost $3B today. However, just over 75% of this is in the currently incentivised pools. Secondly, I realise that not continuing the ETH rewards in some capacity could lead to a mini flash crash (Due to mass selling of ETH). A sudden drop in the price of ETH would be bad for the whole ecosystem, if we wanted the end these programs eventually, it may be best to ease off the rewards gradually, to prevent large market movements. Perhaps and this is just an idea, we keep the ETH/DAI reward where it is (As it currently has the least liquidity, and is the most decentralised stable coin) but reduce the ETH/USDT and ETH/USDC reward by around 40% (To 350,000 Uni/week). ETH/WBTC I’m not too sure on, perhaps leave that where it is (As it’s the only BTC Pair). The reduction in Uni distribution would free up about 20% of the rewards (366,666⅔ Uni/Week), splitting 2% each towards ten smaller tokens (36,666⅔ Uni/Week), so as not to artificially pump the price too much. Again, not too sure on what exactly, but here are ten ideas. I’ve picked these tokens as they are listed on other exchanges (There’s no need to waste Uni tokens incentivising liquidity if there only hosted on Uniswap, that wouldn’t accomplish much other than artificially boosting the price)   Aave, this is a clear one to list, as Uniswap has competition against CeFi (Such as Binance which currently has more 2% depth than Uniswap), and DeFi (From competing Uniswap clones)   LINK [Chainlink], Heavy competition from CeFi here, and Uniswap would probably need to supply more than than 2% split here to generate sufficient liquidity to rival centralised exchanges.   COMP [Compound], Similar reasons as Aave, however, there is much more pressure from Uniswap clones as one such does twice the daily volume as Uniswap.   MKR [Maker], Maker has a surprisingly low amount of liquidity across the board, given its market cap of $500M. Still, other DeFi protocols are currently ahead in terms of liquidity, and some CeFi is now beating Uniswap in terms of the trading volume. To fix this, a relatively small incentive would be sufficient. As Uniswap could easily be No 1. for this token, another reason to keep the rewards low is to prevent too many token holders not voting on the MKR platform.   SNX [Synthetix Network Token], Again, vampire mining has taken it’s toll on Uniswap here as well as CeFi products with both more daily volume and liquidity.   UMA [Universal Market Access], My knowledge of this token is relatively limited, so I would welcome any pointers in terms of incentivising the liquidy of this token. Looks at the statistics we again seem to be behind competing projects here for the time being.   YFI [Yearn.finance], Uniswap is quite far behind here across the board, so a liquidity bonus would help bring trading volume back to Uniswap.   ZRX [0x], Uniswap seems to be very far behind in terms of liquidity for this token against CeFi however is in a great position to turn this through the use of a liquidity mining scheme.   REN [Ren], Ren is under heavy competition from CeFi as well as vampire mining, though in this case, it has been unable to steal more than half of the Uniswap’s pool.   NMX [Nexus Mutual], Nexus Mutual seems to have less liquidity than the tokens above. Therefore, a smaller distribution would probably be sufficient; you could also argue not needing to incentivise this pool at all as despite the lack of an incentive the 2% depth of Uniswap appears to be the highest in terms of trading volume at the time of writing.   Uni, I’ve listed this here to explain why we should probably hold off on this for the time being. While I realise getting Uni tokens off other platforms like exchanges is a good idea (To prevent a CeFi project maliciously influencing a vote for example). The Quorum required is still 40M, so there is no imminent risk of this. Discussions regarding voting from inside the pool will need to be concluded before incentivisation is considered, as tokens in the liquidity pool cannot vote.   I’m open to other strategies to increase and broaden the liquidity of Uniswap, therefore increasing the trading volume and the number of users. Full disclosure: I hold between $100-$500 of the following tokens: Aave, LINK, MKR, Ren, SNX, ZRX. I have no intention to artificially boosting the value of my holdings, just thought it would be best if I mentioned any potential conflicts of interest on this post for transparency. I hold far more Uni so pumping that would be much more beneficial to me, but being as I care about the long term ecosystem of Uniswap, I have no interest in doing that to any token I own. I, therefore, have come to this conclusion by analysing the top 10 tokens on Ethereum by market capitalisation. ",
                    "links": [],
                    "GPT-summary": "The author proposes to incentivize tokens to make Uniswap more competitive with other DeFi and CeFi programs. The author suggests reducing the ETH/USDT and ETH/USDC reward by around 40% and splitting 2% each towards ten smaller tokens. The author lists ten tokens and explains why they are chosen. The author is open to other strategies to increase and broaden the liquidity of Uniswap. The author discloses potential conflicts of interest. A third party gives constructive criticism and extends to the proposal, suggesting that the author should consider the impact of the proposal on smaller tokens and the potential for market manipulation.",
                    "GPT-proposal-categories": [
                        "Token economics",
                        "Interoperability and Scalability",
                        "Community and engagement",
                        "Privacy, Security and risk management",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.527175697865353
                },
                {
                    "author_link": "https://gov.uniswap.org/u/rezwile",
                    "index": "2",
                    "likes": "1",
                    "time": "30/10/2020-13:56:00",
                    "content": "    Danpi314:  I realise that not continuing the ETH rewards in some capacity could lead to a mini flash crash   I really support your ideas. The gradual soft shift of incentives is better than a hard timed on/off. It will make the transition better for most of us. Yet I worry about the defi sector. Because we are in the phase of heavy competition. Thats why all those tokens were created. I believe, they carry no long term value and are only used by people to grab the max profit. All the websites out there even compare the highest rates. There is no look behind the project or future. But if uniswap wouldnt follow this ‘race’, it would have been left behind. How long will this unhealthy boost last? Is really an out of nowhere created token that valuable instantly? Which power can 1000 or even 10000 uni give? I say: Its non sustainable. But its a matter how long certain projects can endure… ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.111904761904762
                },
                {
                    "author_link": "https://gov.uniswap.org/u/mmoossttaaffaa",
                    "index": "3",
                    "likes": "5",
                    "time": "30/10/2020-14:40:01",
                    "content": "I disagree currently Uniswap is dominating dex volumes main competitors volume combined is less than 25% of Uniswap volume (Sushiswap,0x, Balancer, Bancor) Uniswap LPs are making around 1m $ a day from trading fees so no more incentives are needed UNI should be spent to grow Uniswap not for unneeded liquidity incentive program ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 4.65
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Danpi314",
                    "index": "4",
                    "likes": "1",
                    "time": "30/10/2020-15:33:41",
                    "content": "I did a quick look through Coingecko to see if your statement is true. image937×265 30.9 KB As you can see Uniswap is actually behind on liquidity on 7/10 I mentioned, and behind on volume on 5/10. So why is overall volume and fees so much higher on Uniswap. Simple, the answer is the 4 currently incentivised pools. Only 23% of the liquidity currently resides in non-inceivesd pools. And only 33% of the volume is coming from those non-incentivised pools (+25% including KP3R, but that is an anomaly right now). I am not proposing using the rewards at an increasing rate, what I proposing is extending and broadening the current structure of those rewards. Those top 7 charted above look like obvious candidates to me. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.2872023809523805
                },
                {
                    "author_link": "https://gov.uniswap.org/u/mmoossttaaffaa",
                    "index": "5",
                    "likes": "1",
                    "time": "30/10/2020-15:43:42",
                    "content": "Uniswap has thousands of pools and pairs a list of few tokens is not a good representative of the full picture the following volomes represent the full picture that there is no real competition Screenshot (10)579×639 42.3 KB ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.041666666666666
                },
                {
                    "author_link": "https://gov.uniswap.org/u/PinkHorse",
                    "index": "6",
                    "likes": "0",
                    "time": "05/11/2020-06:28:49",
                    "content": "How is this going to be decided by the way? Will we be able to vote on which pools to incentivize next at all or? Sushi is voting every week, while we are 12 days away from the end of the current rewards and there is still no clear path how the next ones will be decided? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.45
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Uni3",
                    "index": "7",
                    "likes": "1",
                    "time": "05/11/2020-07:29:44",
                    "content": "Only ETH, BTC, USD pairs should have LP for liquidity mining. The biggest 3 coins are BTC 245B, ETH 45B and USDT 16B Mcap or 80% of total cryptocurrency. We need highest liquidity in the world for BTC and ETH, volumes for other speculative coins is not essential at the moment. ETH, wBTC, renBTC, wanBTC… with USDT, USDC and DAI pairs. Incentive for BTC pairs should slowly increase and should be caution as Vitalik said some of the BTC tokens on Ethereum network are not even hold in multisig accounts. Issues on tokenized BTC can be found here /https://www.wanchain.org/blog/how-safe-are-todays-wrapped-btc-bridges/ ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.575
                },
                {
                    "author_link": "https://gov.uniswap.org/u/johnnysokko",
                    "index": "8",
                    "likes": "1",
                    "time": "05/11/2020-13:00:35",
                    "content": "There should at least be a plan given a hard stop might and will likely result in a migration off Uniswap to something else with a higher return. You’ve all seen that happen already and why would it not happen again? Whether you like it or not most of the capital remains in the hands of whales that drift back and forth looking for yield and you can bet once there is better profit to be made elsewhere a good bit of that capital will move there. This is all well and good if you don’t care to have that sort of person supplying UNI but just realize the consequences of such a decision. Whatever the case, the clock is ticking and the community should and needs to have a plan and right now I don’t see one, only disagreement and possibly dysfunction. I think this is a good conversation starter so let’s use it as a framework to create a viable plan that the community can support. One item that needs to be added is something sustainable and tangible to incentivize the actual holding of UNI and not just the promise of a voice in governance as you see how that is working… ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.764682539682539
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Uni3",
                    "index": "9",
                    "likes": "4",
                    "time": "05/11/2020-13:27:24",
                    "content": "UNI token has to get some value, otherwise farmers are going to go to another amm exchange with better incentive. If UNI don’t appreciate in value farmers will leave. We need to switch fee to give UNI token value. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/rezwile",
                    "index": "10",
                    "likes": "3",
                    "time": "17/11/2020-09:08:40",
                    "content": " For all who think, that users will just stay. They wont, a lot of people will go for max profit. Not caring too much about the project. Thats why i said, its an unhealthy battle between defi platforms. It will last some month. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 4.666666666666667
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Maktub33",
                    "index": "11",
                    "likes": "6",
                    "time": "17/11/2020-20:45:30",
                    "content": "i really think that uniswap is playing the long game and we should not compare this platfrom with others becouse everybody else whants what uniswap has, a project that has a REAL comunity. Good thoughts to everybody!  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.825
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Uni3",
                    "index": "12",
                    "likes": "0",
                    "time": "18/11/2020-00:13:48",
                    "content": "No proposals to extend farming at least if we can’t agree on new LP farming.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.590909090909091
                },
                {
                    "author_link": "https://gov.uniswap.org/u/thesoulscoder",
                    "index": "13",
                    "likes": "0",
                    "time": "18/11/2020-00:37:12",
                    "content": "Wow this was so insightful, but I definitely still believe UNI could use more holders. A second airdrop would hardly shake the ecosystem, as I speculate that a lot of users will be long term holders and hopefully active members of the community ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.0892857142857135
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Jaffersadiq4u",
                    "index": "14",
                    "likes": "0",
                    "time": "23/11/2020-01:55:03",
                    "content": "We have to come up with staking if possible. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Uni3",
                    "index": "15",
                    "likes": "4",
                    "time": "23/11/2020-11:00:01",
                    "content": "Volume and liquidity1386×355 68.9 KB Obviously there is no impact to Uniswap volumes and liquidity is more than sufficient at the moment. There is interest of big liquidity providers to spin the story and push new LP to earn a disproportional big yield which they can’t get at this size anywhere on this planet. (picture below  ) Top 41367×240 36.4 KB New tokens will dilute value of Uniswap and all UNI tokens in circulation. (more tokens will share the same value because LP will not bring any value in the current situation) We have 14million tokens (valued $53.2 million right now) per month which we don’t need at all at the moment. At the end of every month we need to burn them or redistribute proportional to all addresses that currently hold UNI tokens. ",
                    "links": [
                        "https://global.discourse-cdn.com/business6/uploads/uniswap1/original/2X/4/4fa515fda3c39bd45575613f9afcf7f9b6b9e443.png"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.857683982683982
                },
                {
                    "author_link": "https://gov.uniswap.org/u/OchoELperro",
                    "index": "16",
                    "likes": "0",
                    "time": "22/01/2021-16:46:40",
                    "content": "Hello everyone! - I am one of those people who got into cryptocurrency only to feel I am not missing out. But I know very little about trading. I represent a big percentage of the people who go a buy “bitcoins” cuz everyone else seems to be doing it - being bitcoins the most popular currency. For instance about the fact that when u think in coffee u automatically think in Starbucks (even when we all know there are better coffee options out there).  When no-coin savys like you all think about cryptocurrency they automatically think about Bitcoins. My point is that perhaps there should be some more investment on advertising this currency I went on and purchased some uniwasp only cuz I found the logo to be funny.(it was visually appealing) I think this should be exploited. Psychology plays a huge roll on users behavior… it’s just a thought… a humble opinion. … I thought it might be helpful and informative to share my reasons on investing money on uniswap, and silly as it might sound I think advertising is everything today. - … Kelly kardashian made herself a billionaire advertising her own makeup and her products are horrible quality… people buy it cuz they don’t buy the product they buy the idea of the product … I apologize for the analogy but I hope this review makes sense. (Please don’t judge me) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party or author is advertising proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.673828125
                }
            ]
        }
    ],
    "group_index": "451"
}