{
    "poll_list": [
        {
            "id": "QmUMGd8r249PEEbVkF8z7ftEyvRBhtFA3T3oHMxhSJcFJ9",
            "title": "Begin Uniswap Liquidity Program v0.1",
            "discussion": "",
            "body": "# Purpose\n\nThis proposal seeks approval to begin the Uniswap Liquidity Program v0.1 to migrate liquidity to v3. A detailed proposal on the Uniswap Liquidity Program can be found [here](https://gov.uniswap.org/t/consensus-check-begin-uniswap-liquidity-program-v0-1/13635).\n\n# Summary\n\nThis proposal outlines a framework for establishing a liquidity incentives program (Uniswap Liquidity Program, ULP) with the goals of: accelerating the migration of liquidity to Uniswap v3; encouraging new market participants to experiment with liquidity provision, further distributing ownership of UNI tokens, and supporting ecosystem growth over the long-term.\n\nWe propose the program start with an initial maximum budget of 1.662m UNI, to be allocated as liquidity incentives across two quarters. Continuation of the program will require an additional governance vote. Upon renewal of the program, each of the three initiatives can be broken out into separate proposals.\n\nThe program will aim to bootstrap liquidity across three different initiatives:\n\n* Stablecoin pairs\n* Mid-tail pairs (e.g DeFi governance tokens)\n* Deposit receipt tokens (i.e. cTokens, aTokens)\n\nNote that this is just the beginning of the Uniswap Liquidity Program (v0.1). We want to start simple and evaluate the program's effectiveness before we expand it. We will provide periodic updates on ULP to Uniswap governance and seek community feedback.\n\n# Vote\n\nShould we begin Uniswap Liquidity Program v0.1?\n* Yes\n* No",
            "choices": [
                "Yes",
                "No"
            ],
            "scores": [
                13765334.897324722,
                1892.8484130526317
            ],
            "start": 1627552800,
            "end": 1627984800,
            "snapshot": "12919988",
            "state": "closed",
            "author": "0x10D6d2e343281D388291A3e02f3293AaEdA67178",
            "space": {
                "id": "uniswap",
                "name": "Uniswap"
            }
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/consensus-check-begin-uniswap-liquidity-program-v0-1/13635",
            "title": "Consensus Check - Begin Uniswap Liquidity Program v0.1 ",
            "index": 13635,
            "category": [
                "Consensus Check"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/HelloShreyas",
                    "index": "1",
                    "likes": "5",
                    "time": "29/07/2021-09:10:36",
                    "content": "Authors: @itzler (Variant), @HelloShreyas and @verto0912 (Llama) Updates: We appreciate the positive engagement and feedback we received from our initial proposal. This proposal has been updated based on feedback from community members. The changes include:  Updated the stated long-term goals of the program to include ecosystem growth over the long-term. Increased the rewards allocated for deposit receipt tokens from 2% to 4% to account for the fact that holders of deposit receipt tokens in v3 will forfeit any of the underlying protocol’s liquidity incentives. Excluded aTokens from ULP as they require a wrapper contract that has not yet been audited. We will consider including aTokens in the future. Updated the overall allocations for ULP based on the increase in rewards for Deposit Receipt Tokens and the exclusion of aTokens.  Note that this is just the beginning of the Uniswap Liquidity Program (v0.1!). We want to start simple and evaluate the program’s effectiveness before we expand it. We will provide periodic updates on ULP to Uniswap governance and seek community feedback. Snapshot: The Snapshot vote will be live for 5 days to get a consensus check. Summary: This proposal outlines a framework for establishing a liquidity incentives program (Uniswap Liquidity Program, ULP) with the goals of: accelerating the migration of liquidity to Uniswap v3; encouraging new market participants to experiment with liquidity provision, further distributing ownership of UNI tokens, and supporting ecosystem growth over the long-term. We propose the program start with an initial maximum budget of 1.662m UNI, to be allocated as liquidity incentives across two quarters. Continuation of the program will require an additional governance vote. Upon renewal of the program, each of the three initiatives can be broken out into separate proposals. The program will aim to bootstrap liquidity across three different initiatives:  Stablecoin pairs Mid-tail pairs (e.g DeFi governance tokens) Deposit receipt tokens (i.e. cTokens, aTokens)  Similarly to the Uniswap Grants Program (UGP), pair selection is a subjective process that cannot be easily automated: any action requires close monitoring and frequent reporting to the Uniswap community. To this end, we propose a discretionary committee of 8 members — 5 core members from LlamaDAO to actively lead & manage the committee, as well 3 members for oversight. Find Llama’s full proposal & management plan detailed here. The committee structure allows for incentives to be allocated efficiently across many pairs without requiring a full governance vote on each pair selection. However, Uniswap governance retains ultimate oversight by granting a budget on a bi-quarterly basis. Purpose & Background: While Uniswap v3 has quickly emerged as the market leading DEX, we believe that it has yet to reach its full potential. In particular, large amounts of liquidity remain locked in Uniswap v2, and a majority of v2 LPs have yet to migrate over the v3. Liquidity incentive programs have seen varying degrees of success. In Uniswap’s case, the initial liquidity incentive program between September—November 2020 was met with considerable interest:  Protocol liquidity quickly increased from ~$750M in the week preceding the program to ~$3B at peak. The number of individual addresses holding more than 0 LP tokens increased by ~75% from ~33,500 to ~59,000. The unique UNI token holder base grew by 14% over the course of 2 months.  A contributing factor here is that Uniswap v2 has an organic user-base, which drives organic swap yields to LPs. We expect and hope that a liquidity incentives program on Uniswap v3 would succeed in increasing wider LP participation, liquidity across sought-after pairs, UNI distribution, and swap volume. Importantly, due to v3’s Concentrated Liquidity feature, Uniswap governance can afford to pay significantly lower reward rates than previous liquidity mining programs to achieve similar market depth. Quarterly Budget:  Max quarterly budget of up to 826,091 UNI across all initiatives to start In addition to the quarterly budget, LlamaDAO (core committee members) is to be collectively compensated at a rate of $150 per hour up to 30 hours a week. Each month, oversight members will be responsible for calculating exchange rate from UNI to USD and appropriate payouts (estimated at ~2917 UNI per quarter), with payments being made in UNI. Oversight members will be compensated at a rate of 300 UNI per quarter.  Pair Selection Committee:  5 core committee members, composed of LlamaDAO team members for the first term, as well as 3 oversight committee members. Each committee has a term of 2 quarters (6 months) after which the program and members need to be renewed by UNI governance. Committee functions as a 5 of 6 multi-sig, with 3 members of LlamaDAO and 3 members from the oversight committee. Committee to share a weekly report detailing the decision making process (using a standard template) and periodic updates detailing the successes and failures of the program.  Committee Members: Committee member criteria include:  Credibly neutral — need to avoid any sense of conflict of interest Ability to evaluate fundamental strengths of projects and their place in the ecosystem Data driven — capable of assessing quantitative merits/growth signals  Committee members must recuse themselves from any ULP decision related to a project they hold an investment in or are otherwise related to. Core Committee Members (Llama):   AG: project management and evaluation  Shreyas Hariharan: project management, coordinate with Uniswap governance and stakeholders  Mason: project management, create progress reports on ULP, coordinate with projects  Austin Green: technical and security expertise  Michael Silberling: create Dune Analytics dashboards that help us monitor the effectiveness of the liquidity program and enable us make changes when needed  Oversight Committee Members:  Eva Beylin, Graph Protocol Jon Itzler, Variant Fund Arr00, Core Compound community contributor  Implementation: UNI is distributed to LPs that provide in-range liquidity, with those that concentrate their liquidity closer to the market price (i.e. higher virtual liquidity) receiving larger allocations.    GitHub    Release Mainnet Deployment - v1.0.0 · Uniswap/uniswap-v3-staker The staker is deployed and verified on Etherscan for on all networks at the address: 0x1f98407aaB862CdDeF78Ed252D6f557aA5b0f00d    Network Explorer     Mainnet https://etherscan.io/address/0x1f9840...      Initial Proposed Reward Distribution Across Initiatives: Stablecoin pairs: We suggest an initial stablecoin/stablecoin liquidity mining program over the course of the next three months conservatively targeting $250m in each of the following pools:  USDC/DAI [0.05% fee tier] USDC/USDT [0.05% fee tier] DAI/USDT [0.05% fee tier]  A reward rate of 2% APY feels like an appropriate target for stablecoin/stablecoin pools as v3 stablecoin/stablecoin pools are already generating organic yields in-line with money market protocols. Based on a 30D moving average UNI price of $20.06, the committee would distribute 741.82 UNI per day to each of the three pools listed above for a total of 186,939 UNI across all three pools over the next quarter. Mid-tail pairs We suggest an initial mid-tail pair liquidity mining program over the course of the next quarter. We are conservatively targeting $100m in each of the following pools:  LINK/ETH [0.30% fee tier] YFI/ETH [0.30% fee tier] MKR/ETH [0.30% fee tier] AAVE/ETH [0.30% fee tier] COMP/ETH [0.30% fee tier]  A reward rate of 10% APY feels appropriate for mid-tail pair pools. Compared to stablecoin/stablecoin pools, LPs in mid-tail pairs must bear more price risk. Based on the 30D moving average UNI price of $20.06, 1,483.64 UNI per day to each of the five pools listed above for a total of 623,130.61 UNI across all five pools over the next quarter. Deposit Receipt Tokens (DRT): We suggest an initial DRT liquidity mining program over the course of the next quarter. Due to Uniswap’s brand recognition and gas optimized contracts, deeply liquid DRT pools may serve as an effective alternative distribution channel for yield-generating platforms. We are conservatively targeting $10m in each of the following pools:  DAI/cDAI [0.05% fee tier] [Compound] ETH/wstETH [0.05% fee tier] [Lido] USDC/PcUSDC [0.05% fee tier] [PoolTogether]  As with stablecoin/stablecoin pools, LPs in DRT pairs take on minimal price risk. Additionally, they earn passive yield by maintaining inventories of yield-bearing assets. A reward rate of 4% feels appropriate. Based on the 30D moving average UNI price of $20.06, the committee would distribute 59.34 UNI per day to each of the threepools listed above for a total of 16,021.8UNI across all three pools over the next quarter. Conclusion: We recommend the establishment of a Uniswap Liquidity Program (ULP), which will actively incentivize liquidity across three strategic categories:  Stablecoin/stablecoin pairs Mid-tail pairs Depositary receipt pairs  ULP will exist as a 8-person committee with 5 core members, where core committee members are tasked with closely monitoring the success of ongoing programs and frequently updating the Uniswap community via regular written reports. The 3 oversight members are responsible for monitoring the core committee and multisig signing. We believe that the targeted nature of ULP’s proposals coupled with Uniswap’s organic user base will help achieve various objectives: wider LP participation, more liquidity across sought-after pairs, further UNI distribution, and increasing swap volume. Next Steps: Poll: Should we begin Uniswap Liquidity Program v0.1?  Yes No  This is the original temperature check governance forum post. This is the snapshot poll. ",
                    "links": [
                        "https://www.llama.xyz/",
                        "https://gov.uniswap.org/t/uniswap-liquidity-program-v0-1/13481",
                        "https://snapshot.org/#/uniswap/proposal/QmUMGd8r249PEEbVkF8z7ftEyvRBhtFA3T3oHMxhSJcFJ9",
                        "https://docs.google.com/document/d/16pRfAbSvmU-A7oTlsQEHFPtSSRt1z21cIQaapGl6gWg/edit",
                        "https://twitter.com/verto0912",
                        "https://twitter.com/HelloShreyas",
                        "https://twitter.com/summmason",
                        "https://twitter.com/AustinGreen",
                        "https://twitter.com/MSilb7",
                        "https://github.com/Uniswap/uniswap-v3-staker/releases/tag/v1.0.0",
                        "https://github.com/Uniswap/uniswap-v3-staker/releases/tag/v1.0.0",
                        "https://gov.uniswap.org/t/uniswap-liquidity-program-v0-1/13481",
                        "https://snapshot.org/#/uniswap/proposal/QmUMGd8r249PEEbVkF8z7ftEyvRBhtFA3T3oHMxhSJcFJ9",
                        "https://gov.uniswap.org/t/proposal-uniswap-liquidity-program-v0-1/13877"
                    ],
                    "GPT-summary": "The post is a proposal for a liquidity incentives program called Uniswap Liquidity Program (ULP) with the aim of accelerating the migration of liquidity to Uniswap v3, encouraging new market participants to experiment with liquidity provision, further distributing ownership of UNI tokens, and supporting ecosystem growth over the long-term. The proposal outlines the framework, budget, and initiatives of the program, as well as the committee structure responsible for selecting pairs and monitoring the success of the program. The post also includes updates based on feedback from the community and a snapshot vote to get a consensus check.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Token economics",
                        "Privacy, Security and risk management",
                        "Law and regulations"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.460468426501035
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Buckerino",
                    "index": "2",
                    "likes": "1",
                    "time": "30/07/2021-14:03:05",
                    "content": "This is just such a poor solution to a problem which could be easily fixable without all the rent seeking commitee members wages, without consuming UNI treasury for a temporary fix. But hey! If you got the right people to agree to it, who cares what the community thinks, am I right? Let´s go! The cartel of 10 people who makes the governance here - time to voice your opinion  BTW: If you could not tell already, I will vote NO on your proposal and urge everybody in the community to do so. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.78452380952381
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Naught",
                    "index": "3",
                    "likes": "1",
                    "time": "30/07/2021-17:13:19",
                    "content": "Great job on putting together this proposal; it is a much need program to increase distribution and engagement with wider community. Having a group of expert’s doing analysis for the right pairs in a strategic manner is a good use of funds and I am looking forward to participating in the pools. I do hope there is incentive for those coming just for the APY (i.e UNI sellers) to also take interest in governance in the long run. For now though I am willing to take a chance on the individuals in the proposal, and their reputations. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.821428571428571
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Buckerino",
                    "index": "4",
                    "likes": "0",
                    "time": "31/07/2021-09:53:21",
                    "content": "Yeah right as they took “interest in governance” back in September when the second they got it they pressed the sell button harder than anything ever before. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.232142857142858
                },
                {
                    "author_link": "https://gov.uniswap.org/u/wijuwiju",
                    "index": "5",
                    "likes": "5",
                    "time": "02/08/2021-12:20:46",
                    "content": "just as in temperature check, I will be voting against this consensus check as to me it makes no sense, for the following reasons:   For stable and mid-tail pairs there is no need to extra incentivise LPs with UNI, because for all of them and i mean for all 8 pairs your team or council have suggested v2 APYs are worse than of those v3 currently provides, and that is sufficient enough incentive for the migration, furthermore 4 of those have higher TVL in v3, 1 the same and 3 are lower, but for those 3 APY is 4x-10x higher in v3, so really none of these pairs need any UNI stimulus   DAI/cDAi is feeling great on v3, and suggesting to incentivise such pairs, makes no sense for the UNI holders, but actually helps compound protocol, so please in proposal declare clear goals are we to incentivise the v3 migration or substitute compound users   3.for lido pair, see no point as its doing great at curve finance and don’t see why would we compete for that pair against them, they even got dapp integration directed with curve, so here no   pooltogether is same as point 2, if we are aiming to incentivise/substitute other protocols, then i suggest it should be clearly stated in the goals   you outline criteria for committee member to be credibly neutral, but at the same time propose to put Arr00 as oversight committee member which seems like a conflict of interest, since you suggest subsidising DAI/cDAI (compound)?   imho having committee for general purpose LP subsidising should be avoided, as it should be directly governed, not thru proxy committee, committee is needed for its expertise, and if my calculations are correct, you propose a ~0.5% fee for UNI allocation (im using (2917 + 900) / (826091 / 100)) such fee could make sense to maybe go out and help uni related projects bootstrap liquidities and support them, by monitoring the ecosystem, but not to just stupidly burn UNI into some stable pair which is already extremely competitive thru sheer market forces   no UNI pairs proposed   also provide quick napkin maths to backup my claims regarding the positions in point 1. here is a snapshot of 02.08.21 performances for ur proposed pairs on v2 and v3  Screenshot 2021-08-02 at 14.28.562662×794 237 KB  edit: generally speaking i think your liquidity mining proposal and method is useless and just burns moneys and will only have short term influx of highly capable first comers to reap all the benefits of subsided APYs, such allocation strategy did make sense back during the UNI launch, but not now, I am 100% there tonnes of ways uniswap can better allocate treasury funds, but todays is 2021 and i think we should be focusing in innovative ways to help the ecosystem grow sustainably and organically voted NO! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party giving entirely negative feedback on proposal"
                    ],
                    "Sentiment": 5.361293859649123
                },
                {
                    "author_link": "https://gov.uniswap.org/u/southpawg17",
                    "index": "6",
                    "likes": "3",
                    "time": "03/08/2021-07:31:37",
                    "content": "Absolute NO. Looks and feels like an insider play, detrimental to all UNI holders. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Pinotio.com",
                    "index": "7",
                    "likes": "2",
                    "time": "03/08/2021-14:14:10",
                    "content": "  Committee Independence Seems odd that 5 of 8 members are llamaDAO. It would seem better to have 5 of 8 being oversight.   Core committee hours 30 hours per week seems like a lot. What were the comparable rates and hours paid for v1/2 incentives?   Rationale for incentivizing Could you expand on the pros and cons of incentivizing the three types of pools you have laid out? I would suggest considering: A. Current TVL market share for each pool. B. Incentive rates and organic returns vs competing pools. I think some careful comparison here would make the case clearer for doing incentives.   Lastly, what is the next best use of UNI tokens other than providing incentives like this? Always worth considering when spending. B ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.782407407407407
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Buckerino",
                    "index": "8",
                    "likes": "3",
                    "time": "03/08/2021-14:31:30",
                    "content": "hey man, they just want a job paying 150 USD per hour. Why would you have to come in and try to ruin it for them?  Obvious sarcasm. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/msilb7",
                    "index": "9",
                    "likes": "2",
                    "time": "11/08/2021-16:13:41",
                    "content": "Hi, I’m Michael from the Llama team. I can provide some context on the rationale for incentivizing. We pulled trailing 30 day trading volume and TVL market share into this table. We’re planning on tracking this over time in a community dashboard as part of the program (WIP).  image1600×515 165 KB  Link: Dune Analytics Some Takeaways:   Stablecoins: Curve led 2/3 stablecoin pairs in Volume (Dodo led 1) and all pairs in TVL.  Mid-Tail Pairs: Balancer, Sushi, and Uniswap v2 led in TVL for all (5/5) Mid-Tail Pairs. Uniswap v3 led in Volume for 3/5 Mid-Tail Pairs, and those pairs returned 15-30% in LP Fees/ TVL in aggregate.  Deposit-Receipt Tokens: Curve had 99%+ TVL and Volume for ETH/wstETH. Other Deposit-Receipt Token Pairs (cDAI/DAI, pcUSDC/USDC) had minimal volume and TVL relative to other pairs. In all pairs, Uniswap v3 lags behind another DEX in TVL, except for the Compound and PoolTogether Deposit-Receipt Tokens, where we can experiment with a new method to enter/exit these positions.  We also roughly estimated how the Uniswap Liquidity program incentives compare versus the DEX that led each pair in TVL (WIP as well, so please share if there’s anything you think is missing):  image1904×420 108 KB  We’re still not offering as many incentives percentage-wise as other DEXs in most cases, but we wonder if LPs may respond more favorably to UNI rewards (note that Fees/TVL for v3 may be overstated versus retail LP performance for Mid-Tail pairs).         ",
                    "links": [
                        "https://global.discourse-cdn.com/business6/uploads/uniswap1/original/2X/7/7adf6fe1cd9bb91e93a4a758b4cee5e6ca4afbef.jpeg",
                        "https://dune.xyz/embeds/100574/202642/2f295069-76f5-41f4-8906-addac4630846",
                        "https://global.discourse-cdn.com/business6/uploads/uniswap1/original/2X/d/d9a84b141a8a1a943e0a90d93f8fae233125cfb5.png"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.1922348484848495
                },
                {
                    "author_link": "https://gov.uniswap.org/u/inkymaze",
                    "index": "10",
                    "likes": "2",
                    "time": "10/09/2021-14:28:22",
                    "content": "Gauntlet has been considering the merits of this proposal and we wanted to share our initial analysis of the stated goals. Accelerating the migration of liquidity to Uniswap v3 This goal risks distorting the market by causing people to enter significantly riskier and more complex positions through incentives. Impermanent loss is magnified through V3 and V3 incentives may induce people unable to tolerate that risk to enter an investment vehicle they don’t understand. Both V2 and V3 have a place in the DeFi space, if V3 was monotonically better than V2 more of the liquidity would have migrated over already. With that said, V3 is much more efficient in drawing volume per unit of capital (~3x more efficient). It is in Uniswap’s best interest to compensate LPs for this risk through incentives to draw in more liquidity since this in turn will be better utilized at drawing in volume versus leaving it in V2. The framing of this as a simple migration is inadequate, it’s compensating LPs for the new risk from migration. Strong consideration should be given to the possibility that when incentives are removed LPs will migrate back to V2. Encouraging new market participants to experiment with liquidity provision Providing subsidized returns to convince HODLers to start experimenting with DeFi is a good idea. This grows the overall pie of capital that can be utilized in the DeFi space. Further distributing ownership of UNI tokens Most of the rewards will be concentrated among certain whale LPs so it is dubious how much true distribution this will lead to. Supporting ecosystem growth It is unclear how this differentiates from the first two points. Overall The proposal broadly makes sense although the function for how rewards are distributed is under-explained and analyzed: UNI is distributed to LPs that provide in-range liquidity, with those that concentrate their liquidity closer to the market price (i.e. higher virtual liquidity) receiving larger allocations. Based on this Gauntlet’s preliminary analysis suggests the vast majority of the rewards will go to pre-existing LPs who can actively manage and concentrate their liquidity. The passive LPs who they hope will migrate from V2, other protocols, and HODLers are likely to earn very little as their liquidity will be concentrated meaning much of the incentive will be effectively wasted. On the flip side, incentivizing all liquidity equally is suboptimal since it can be easily gamed by moving your liquidity to non-useful positions. This is a non-trivial problem to solve. Disclosures Besides acting as a delegate for Uniswap, Gauntlet has active engagements with Sushiswap and Balancer where our platform is used by those core teams and communities to inform token emissions and trading fees.* ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.894470373376624
                }
            ]
        },
        {
            "thread_link": "https://gov.uniswap.org/t/proposal-uniswap-liquidity-program-v0-1/13877",
            "title": "Proposal: Uniswap Liquidity Program v0.1 ",
            "index": 13877,
            "category": [
                "Proposal Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/HelloShreyas",
                    "index": "1",
                    "likes": "2",
                    "time": "24/08/2021-12:22:54",
                    "content": "Authors: Jon Itzler (Variant), Shreyas Hariharan and AG (Llama) Updates:  The multi-sig has been changed to a 4 of 5 multi-sig, with 2 members of LlamaDAO and 3 members from the oversight committee. This was previously a 5 of 6 multi-sig with 3 members from Llama. In order to provide sufficient oversight, it makes sense for the multi-sig to be in the control over the oversight members instead of having equal representation from Llama. We would like to emphasize that the payment of $150/hour for up to 30 hours a week goes to all Llama members. This is not the rate per Llama member. There was some confusion on this point in previous posts so we wanted to clarify it upfront. We plan to post the on-chain proposal on August 31. We hope to get as much community feedback as possible over the next week before we post the on-chain proposal, so that the on-chain vote has already built consensus. So far, we have sought community feedback in our temperature check proposal, consensus check proposal, Snapshot vote, and hosted a Twitter spaces discussion to answer questions about ULP. The Snapshot vote was overwhelmingly positive (99%+ for votes) and we have incorporated feedback from each of our proposal discussions in the final proposal. We have already built a Uniswap v3 Liquidity Program Dune dashboard to track the effectiveness of ULP. (Shoutout to Michael from Llama.)  Summary: This proposal outlines a framework for establishing a liquidity incentives program (Uniswap Liquidity Program, ULP) with the goals of: accelerating the migration of liquidity to Uniswap v3; encouraging new market participants to experiment with liquidity provision, further distributing ownership of UNI tokens, and supporting ecosystem growth over the long-term. We propose the program start with an initial maximum budget of 1.662m UNI, to be allocated as liquidity incentives across two quarters. Continuation of the program will require an additional governance vote. Upon renewal of the program, each of the three initiatives can be broken out into separate proposals. The program will aim to bootstrap liquidity across three different initiatives:  Stablecoin pairs Mid-tail pairs (e.g DeFi governance tokens) Deposit receipt tokens (i.e. cTokens, aTokens) Similarly to the Uniswap Grants Program (UGP), pair selection is a subjective process that cannot be easily automated: any action requires close monitoring and frequent reporting to the Uniswap community. To this end, we propose a discretionary committee of 8 members — 5 core members from LlamaDAO to actively lead & manage the committee, as well 3 members for oversight. Find LlamaDAO’s full proposal & management plan detailed here.  The committee structure allows for incentives to be allocated efficiently across many pairs without requiring a full governance vote on each pair selection. However, Uniswap governance retains ultimate oversight by granting a budget on a bi-quarterly basis. Purpose & Background: While Uniswap v3 has quickly emerged as the market leading DEX, we believe that it has yet to reach its full potential. In particular, large amounts of liquidity remain locked in Uniswap v2, and a majority of v2 LPs have yet to migrate over the v3. Liquidity incentive programs have seen varying degrees of success. In Uniswap’s case, the initial liquidity incentive program between September—November 2020 was met with considerable interest:  Protocol liquidity quickly increased from ~$750M in the week preceding the program to ~$3B at peak. The number of individual addresses holding more than 0 LP tokens increased by ~75% from ~33,500 to ~59,000. The unique UNI token holder base grew by 14% over the course of 2 months.  A contributing factor here is that Uniswap v2 has an organic user-base, which drives organic swap yields to LPs. We expect and hope that a liquidity incentives program on Uniswap v3 would succeed in increasing wider LP participation, liquidity across sought-after pairs, UNI distribution, and swap volume. Importantly, due to v3’s Concentrated Liquidity feature, Uniswap governance can afford to pay significantly lower reward rates than previous liquidity mining programs to achieve similar market depth. Quarterly Budget:  Max quarterly budget of up to 826,091 UNI across all initiatives to start In addition to the quarterly budget, LlamaDAO (core committee members) is to be collectively compensated at a rate of $150 per hour up to 30 hours a week. Each month, oversight members will be responsible for calculating exchange rate from UNI to USD and appropriate payouts (estimated at ~2917 UNI per quarter), with payments being made in UNI. Oversight members will be compensated at a rate of 300 UNI per quarter.  Pair Selection Committee:  5 core committee members, composed of LlamaDAO team members for the first term, as well as 3 oversight committee members. Each committee has a term of 2 quarters (6 months) after which the program and members need to be renewed by UNI governance. Committee functions as a 4 of 5 multi-sig, with 2 members of LlamaDAO and 3 members from the oversight committee. Committee to share a weekly report detailing the decision making process (using a standard template) and periodic updates detailing the successes and failures of the program.  Committee Members: Committee member criteria include:  Credibly neutral — need to avoid any sense of conflict of interest Ability to evaluate fundamental strengths of projects and their place in the ecosystem Data driven — capable of assessing quantitative merits/growth signals  Committee members must recuse themselves from any ULP decision related to a project they hold an investment in or are otherwise related to. Core Committee Members (LlamaDAO):   AG: project management and evaluation  Shreyas Hariharan: project management, coordinate with Uniswap governance and stakeholders  Mason: project management, create progress reports on ULP, coordinate with projects  Austin Green: technical and security expertise  Michael Silberling: create Dune Analytics dashboards that help us monitor the effectiveness of the liquidity program and enable us make changes when needed  Oversight Committee Members:   Eva Beylin, Graph Protocol  Jon Itzler, Variant Fund  Arr00, Core Compound community contributor  Implementation: UNI is distributed to LPs that provide in-range liquidity, with those that concentrate their liquidity closer to the market price (i.e. higher virtual liquidity) receiving larger allocations.    GitHub   Release Mainnet Deployment - v1.0.0 · Uniswap/uniswap-v3-staker The staker is deployed and verified on Etherscan for on all networks at the address: 0x1f98407aaB862CdDeF78Ed252D6f557aA5b0f00d    Network Explorer     Mainnet https://etherscan.io/address/0x1f9840...      Initial Proposed Reward Distribution Across Initiatives: Stablecoin pairs We suggest an initial stablecoin/stablecoin liquidity mining program over the course of the next three months conservatively targeting $250m in each of the following pools:  USDC/DAI [0.05% fee tier] USDC/USDT [0.05% fee tier] DAI/USDT [0.05% fee tier]  A reward rate of 2% APY feels like an appropriate target for stablecoin/stablecoin pools as v3 stablecoin/stablecoin pools are already generating organic yields in-line with money market protocols. The committee would distribute 741.82 UNI per day to each of the three pools listed above for a total of 186,939 UNI across all three pools over the next quarter. Mid-tail pairs We suggest an initial mid-tail pair liquidity mining program over the course of the next quarter. We are conservatively targeting $100m in each of the following pools:  LINK/ETH [0.30% fee tier] YFI/ETH  [0.30% fee tier] MKR/ETH  [0.30% fee tier] AAVE/ETH  [0.30% fee tier] COMP/ETH  [0.30% fee tier]  A reward rate of 10% APY feels appropriate for mid-tail pair pools. Compared to stablecoin/stablecoin pools, LPs in mid-tail pairs must bear more price risk. The committee would distribute 1,483.64 UNI per day to each of the five pools listed above for a total of 623,130.61 UNI across all five pools over the next quarter. Deposit Receipt Tokens (DRT) We suggest an initial DRT liquidity mining program over the course of the next quarter. Due to Uniswap’s brand recognition and gas optimized contracts, deeply liquid DRT pools may serve as an effective alternative distribution channel for yield-generating platforms. We are conservatively targeting $10m in each of the following pools:  DAI/cDAI [0.05% fee tier] [Compound] ETH/wstETH [0.05% fee tier] [Lido] USDC/PcUSDC [0.05% fee tier] [PoolTogether]  As with stablecoin/stablecoin pools, LPs in DRT pairs take on minimal price risk. Additionally, they earn passive yield by maintaining inventories of yield-bearing assets. A reward rate of 4% feels appropriate. The committee would distribute 59.34 UNI per day to each of the three pools listed above for a total of 16,021.8 UNI across all three pools over the next quarter. Conclusion: We recommend the establishment of a Uniswap Liquidity Program (ULP), which will actively incentivize liquidity across three strategic categories:  Stablecoin/stablecoin pairs Mid-tail pairs Depositary receipt pairs  ULP will exist as a 8-person committee with 5 core members, where core committee members are tasked with closely monitoring the success of ongoing programs and frequently updating the Uniswap community via regular written reports. The 3 oversight members are responsible for monitoring the core committee and multisig signing. We believe that the targeted nature of ULP’s proposals coupled with Uniswap’s organic user base will help achieve various objectives: wider LP participation, more liquidity across sought-after pairs, further UNI distribution, and increasing swap volume. ",
                    "links": [
                        "https://twitter.com/llamacommunity_",
                        "https://gov.uniswap.org/t/uniswap-liquidity-program-v0-1/13481",
                        "https://gov.uniswap.org/t/consensus-check-begin-uniswap-liquidity-program-v0-1/13635",
                        "https://snapshot.org/#/uniswap/proposal/QmUMGd8r249PEEbVkF8z7ftEyvRBhtFA3T3oHMxhSJcFJ9",
                        "https://twitter.com/llamacommunity_/status/1417022802775875586",
                        "https://dune.xyz/llama/Uniswap-v3-Liquidity-Program-by-Llama",
                        "https://twitter.com/MSilb7",
                        "https://docs.google.com/document/d/16pRfAbSvmU-A7oTlsQEHFPtSSRt1z21cIQaapGl6gWg/edit",
                        "https://twitter.com/verto0912",
                        "https://twitter.com/HelloShreyas",
                        "https://twitter.com/summmason",
                        "https://twitter.com/AustinGreen",
                        "https://twitter.com/MSilb7",
                        "https://twitter.com/evabeylin",
                        "https://twitter.com/jonitzler",
                        "https://twitter.com/Arr00c",
                        "https://github.com/Uniswap/uniswap-v3-staker/releases/tag/v1.0.0",
                        "https://github.com/Uniswap/uniswap-v3-staker/releases/tag/v1.0.0"
                    ],
                    "GPT-summary": "The post outlines a proposal for a liquidity incentives program called Uniswap Liquidity Program (ULP) with the aim of accelerating the migration of liquidity to Uniswap v3, encouraging new market participants to experiment with liquidity provision, further distributing ownership of UNI tokens, and supporting ecosystem growth over the long-term. The proposal includes a breakdown of the program's structure, budget, and initiatives. The post also mentions that the authors have sought community feedback and incorporated it into the final proposal. The post does not advertise the proposal, but rather explains it and invites feedback and collaboration.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Smart contract updates",
                        "Community and engagement",
                        "Token economics",
                        "Privacy, Security and risk management"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.465440115440115
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Buckerino",
                    "index": "2",
                    "likes": "1",
                    "time": "24/08/2021-14:49:43",
                    "content": "I´d really rather see the UNI being used to pay gas fees as 1INCH did rather than this steaming garbo The situation is nowhere near comparable to September 2020 btw. People will just farm and dump UNI like they did before because the reason why they are not on V3 is the gas fees. The second the liquidity incentive runs out people will go back to V2 because it still wont be economically viable for them to stay on V3. This proposal is literally just burning resources into thin air. So who benefits? The farmers and Llama Who loses? The regular UNI token holders. I will vote NO ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.9375
                },
                {
                    "author_link": "https://gov.uniswap.org/u/kaibakker",
                    "index": "3",
                    "likes": "0",
                    "time": "24/08/2021-17:00:19",
                    "content": "What do you mean by targeting 250M per pool? Incentives, volume or TLV? How did you get to the selected pools? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.4375
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Getty",
                    "index": "4",
                    "likes": "2",
                    "time": "24/08/2021-22:43:29",
                    "content": "Interesting proposal. I love seeing new ideas about how to grow the protocol and utilizing the treasury. I have a few questions/thoughts about the proposal.   Do you have docs or a write-up for the staker contract?   Has the staking contract undergone a review or audit?   How did you choose LINK, YFI, MKR, AAVE, and COMP as your mid-tail markets? Should there be fewer or more markets?   Any particular reason to choose 0.30% for Mid-tail pairs vs 0.05%?   Is the goal to increase v3 TVL, number of trades, number of traders, market depth, market breadth, or something else? The summary says the ULP has the “goals of accelerating the migration of liquidity to Uniswap v3; encouraging new market participants to experiment with liquidity provision, further distributing ownership of UNI tokens, and supporting ecosystem growth over the long-term.” Maybe it would help to narrow it down to one goal so the community can try to measure progress objectively?   Do you need one year of funding upfront, or will one or two quarters suffice to show progress?   After the initial liquidity program launches, how will addition pairs get rewards?   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.6283993783993775
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Unisocks",
                    "index": "5",
                    "likes": "2",
                    "time": "25/08/2021-07:12:02",
                    "content": "Hey guys - thank you for your proposal. You clearly have put a lot of thought into it and think it is a great idea to leverage the treasury to drive growth to the protocol.  Given V3 leverages concentrated liquidity, should we be focusing on driving more liquidity or more integrations / volume? In other words, what’s the relative value of liquidity mining at this stage versus allocating more budget to grants for integrations / co-marketing? It feels obvious that we should wait to do any liquidity incentives until Uniswap deploys on Arbitrum and / or Optimism to drive liquidity to those pools. How will we measure success over time? Would we be better off running smaller experiments and seeing performance on retention?  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.3977272727272725
                },
                {
                    "author_link": "https://gov.uniswap.org/u/wario",
                    "index": "6",
                    "likes": "0",
                    "time": "25/08/2021-23:21:55",
                    "content": "Thanks for the proposal, I think liquidity incentives are definitely something the community should consider. However, I’m left wondering if a centralized committee structure is actually the ideal setup.     HelloShreyas:  The committee structure allows for incentives to be allocated efficiently across many pairs without requiring a full governance vote on each pair selection.   It seems we’re taking it as a given that centralized decision making is the optimal way to distribute a considerable amount of treasury funds, which seems at least a wasted opportunity in governance experimentation. ULP and other programs would be setting an important precedent for how we want to decide on the use of the treasury, we should see these as opportunities to consider what tools could be built to make governance voting and decentralized decision making more efficient, and not just surrender to centralized committees as the default choice. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.894230769230769
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Getty",
                    "index": "7",
                    "likes": "0",
                    "time": "26/08/2021-16:35:58",
                    "content": "    Getty:  Do you have docs or a write-up for the staker contract?   I found more info on the staking contract. I still want to understand in detail how they plan to use it but at least the general structure is there. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.416666666666666
                },
                {
                    "author_link": "https://gov.uniswap.org/u/HelloShreyas",
                    "index": "8",
                    "likes": "0",
                    "time": "28/08/2021-04:03:45",
                    "content": " What do you mean by targeting 250M per pool? Incentives, volume or TLV?  We are targeting $250m in liquidity in each of the stablecoin pools (USDC/DAI, USDC/USDT, DAI/USDT), $100m in liquidity in each of the mid-tail pools, and $10m in liquidity in the DRT pools. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 3.4375
                },
                {
                    "author_link": "https://gov.uniswap.org/u/HelloShreyas",
                    "index": "9",
                    "likes": "1",
                    "time": "28/08/2021-04:10:15",
                    "content": "Appreciate the thoughtful questions, @Getty.  Do you have docs or a write-up for the staker contract?  Staking contract docs: Uniswap V3 Staker Contract | Uniswap Staking contract source code: GitHub - Uniswap/uniswap-v3-staker: Canonical liquidity mining contract for Uniswap V3  Has the staking contract undergone a review or audit?  Yes, it has gone through an audit. There’s no report available but you can look at this: Issues · Uniswap/uniswap-v3-staker · GitHub.  Is the goal to increase v3 TVL, number of trades, number of traders, market depth, market breadth, or something else? The summary says the ULP has the “goals of accelerating the migration of liquidity to Uniswap v3; encouraging new market participants to experiment with liquidity provision, further distributing ownership of UNI tokens, and supporting ecosystem growth over the long-term.” Maybe it would help to narrow it down to one goal so the community can try to measure progress objectively?  The primary goal of ULP is to migrate liquidity to v3. We will monitor whether this is happening closely and report back to UNI governance periodically on progress. Michael’s Dune dashboards will help us track the effectiveness of ULP.  Do you need one year of funding upfront, or will one or two quarters suffice to show progress?  I think two quarters of funding is sufficient to evaluate the progress of ULP. We can consider adding additional pairs or tweaking incentives after assessing progress.  I will get to your questions on pool selection. But one thing to note is that this is the beginning of ULP and the program will evolve based on feedback from the market, community, and needs of Uniswap. ",
                    "links": [
                        "https://github.com/Uniswap/uniswap-v3-staker",
                        "https://github.com/Uniswap/uniswap-v3-staker/issues?q=is%3Aissue+is%3Aclosed+label%3Atrailofbits",
                        "https://dune.xyz/llama/Uniswap-v3-Liquidity-Program-by-Llama"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.615404040404041
                },
                {
                    "author_link": "https://gov.uniswap.org/u/HelloShreyas",
                    "index": "10",
                    "likes": "0",
                    "time": "28/08/2021-04:16:36",
                    "content": "Thank you for your insightful questions, @Unisocks.  Given V3 leverages concentrated liquidity, should we be focusing on driving more liquidity or more integrations / volume? In other words, what’s the relative value of liquidity mining at this stage versus allocating more budget to grants for integrations / co-marketing?  Both the liquidity program and integrations are complementary, not mutually exclusive. Getting each of the pools to the target liquidity we have set ($250m in stable pools, $100m in mid-tail pools, and $10m in DRT pools) would be a good first step for other initiatives.  It feels obvious that we should wait to do any liquidity incentives until Uniswap deploys on Arbitrum and / or Optimism to drive liquidity to those pools.  Including Optimism/Arbitrum is definitely an idea we are interested in as the program evolves. These ecosystems are young and it’s best to let Uniswap grow on L2s before adding liquidity incentives. This program focuses on bringing v3 liquidity on L1, which will be important for L2 liquidity as well.  How will we measure success over time?  We are primarily evaluating migration of liquidity to v3. Here are some items we are tracking on our Dune dashboard:  Is incentivizing v3 liquidity providing a better trader experience on v3?  Swap Performance: Share of trades where v3 has the best price (DEX aggregators as a proxy), and price impact trends for incentivized pairs. Benchmark Growth: Share of trades and trading volume for incentivized pairs on v3 vs v2 and other DEXs   Is the liquidity program creating deeper v3 liquidity versus v2?  Liquidity Depth: Monitor total TVL and in-range liquidity for incentivized pairs, and volume of active LPs. New v3 Liquidity: Track v2 liquidity migration to v3 in incentivized pairs, and compare new liquidity going to v3 vs v2.   LP Retention: Track how many users are LPing, how many are new vs returning LPs, and LP cohort retention.  Do we have the right rewards structure in place? What can we learn? UNI Reward Structure: Change in TVL and in-range liquidity by UNI incentive tier. External Rewards: Change in TVL and in-range liquidity for pairs with multiple incentives (i.e. native token liquidity mining, staking), and/or incentives on other DEXs.    ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.243578643578643
                },
                {
                    "author_link": "https://gov.uniswap.org/u/HelloShreyas",
                    "index": "11",
                    "likes": "1",
                    "time": "28/08/2021-04:18:02",
                    "content": "Appreciate your input, @wario. Curious if you have thoughts on what an alternative system could look like? It might be difficult to implement for an initial version of ULP but would be great to explore going forward. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://gov.uniswap.org/u/wario",
                    "index": "12",
                    "likes": "4",
                    "time": "28/08/2021-05:26:02",
                    "content": "Thanks @HelloShreyas, here’s an idea that should be trivial to implement for an initial version of the ULP. Instead of a “Pair Selection committee” with an initial proposed distribution selected by some criteria never explained, we make the criteria for selecting pools explicit and codify the rules in english, like we would for the construction of an index fund. An index of pools is created following the specified rules, and the index is updated every determined period. The quarterly budget is distributed among the pools in this index also following some explicitly defined rules. Surely you can see how the distribution of several million dollars from the treasury can be problematic when done arbitrarily by any selected committee, and that we should strive to minimize this when possible. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.300000000000001
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Naught",
                    "index": "13",
                    "likes": "1",
                    "time": "29/08/2021-06:29:54",
                    "content": "Will the liquidity providing program be through the offical uniswap app page? Or will Llama be providing their own UI/UX as a third party? How do you envision the program developing forward? I think a good layout would be for Llama to provide insight and guidance to recommend pairs based on data, while providing a UI/UX through the offical UI/UX that allows the UNI community to vote to activate recommended pools as batches. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 7.166666666666667
                },
                {
                    "author_link": "https://gov.uniswap.org/u/willhennessy",
                    "index": "14",
                    "likes": "2",
                    "time": "30/08/2021-15:10:06",
                    "content": "Hi Naught! Yes the Uniswap Labs team is building an interface in app.uniswap.org.  If the community approves this proposal in on-chain vote, we’ll release the interface at the LM program start time. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Getty",
                    "index": "15",
                    "likes": "7",
                    "time": "31/08/2021-15:53:09",
                    "content": "    HelloShreyas:  The primary goal of ULP is to migrate liquidity to v3 . We will monitor whether this is happening closely and report back to UNI governance periodically on progress. Michael’s Dune dashboards will help us track the effectiveness of ULP.   Looking at v2.   $4.4b in tvl   Top ten pairs account for $1.6b in tvl. (excluding WISE & HKMT)   FEI related pools account for ~$700m of assets on v2.   Mirror related pools account for ~$420M of assets on v2.   The most affordable way to get liquidity to shift from v2 to v3 is to get FEI and Mirror to move their incentive programs onto v3. We should be asking why they haven’t moved already and what we can do to help them make the move. Next, lets look at the top pairs (by TVL) on v2 (not Fei/Mirror).   USDC-ETH: $244m   ETH-USDT: $190m   WBTC-ETH: $152m   UNI-ETH: $112m   DAI-ETH: $81m   USDC-USDT: $68m   LINK-ETH: $63m   DAI-USDC: $55m   It is clear the money is in the stables and the mainstays of Ethereum. These are the pairs we should be incentivizing to get liquidity to migrate. However, we should also help demystify v3 and make it easier for protocols and users to use and understand v3. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.227272727272728
                },
                {
                    "author_link": "https://gov.uniswap.org/u/alex_kroeger",
                    "index": "16",
                    "likes": "8",
                    "time": "02/09/2021-02:01:51",
                    "content": "We at a16z would like to thank LlamaDAO for their hard work on this proposal. After analyzing the proposal, we don’t think that the benefits of the proposal outweigh the cost of ~$50M in payments to LPs for the following reasons:  Uniswap v3 already has dominant DEX market share on Ethereum layer 1 without incentives. A better use for liquidity mining would be incentivizing liquidity provision on layer 2 chains. There are issues with the pairs chosen for incentivization.  Given these reasons, a16z does not support the proposal in its current form. We explore each of the aforementioned points in greater detail below: Uniswap v3 already has dominant DEX market share on Ethereum layer 1 without incentives. Uniswap v3 alone already has >50% DEX market share on Ethereum layer 1. Furthermore, it already has deep liquidity with over $2.9B in value locked.  image1382×572 64 KB  While there is more capital currently locked in v2, it’s not clear that the benefits of adding more liquidity to v3 will exceed the cost of the program, especially since v3 allows for much greater capital efficiency than v2 by design. A better use for liquidity mining would be incentivizing liquidity provision on layer 2 chains. The most pressing problem for Uniswap v3 on Ethereum layer 1 is not the depth of its pools but rather the cost of interacting with it. The median gas cost of trading through the v3 swapRouter contract over the last 7 days is 160K, which is ~$60 per swap at prevailing gas prices of ~100 gwei. The most effective thing the Uniswap community could do in the short term is migrate to more scalable layer 2 blockchains like Arbitrum and Optimism.** Liquidity mining is most effective when it’s used to “jump-start” network effects in a nascent ecosystem. In Uniswap’s case, a jump-start for liquidity could encourage trading and integrations from applications that require external liquidity. Taker demand and integrations could encourage more folks to provide liquidity to earn trading fees, which in turn could encourage more integrations, and so on. This “flywheel” effect has played out to some extent on Ethereum layer 1 already, but has yet to be sparked for layer 2 deployments. Liquidity mining incentives on these chains could be a helpful jump-start. There are issues with the pairs chosen for incentivization. “Deposit Receipt Tokens” are not a promising DEX market. Redemption of these tokens from the protocols themselves (e.g. Compound) would potentially be more straightforward and less costly (avoiding slippage and a 5 bp fee). Furthermore, COMP rewards accruing to the cDAI in the DAI-cDAI market would be forfeited. It’s worth noting, however, that a relatively small portion of incentives (~2%) will be going toward these pairs. Incentivizing 5 bps stablecoin pairs won’t necessarily make Uniswap v3 more competitive. Offering low slippage on stablecoin<>stablecoin pairs is easier due to their low price volatility. As such, the determining factor is trading fees. Pouring more capital into a 5 bps fee pool won’t necessarily make Uniswap v3’s pricing more attractive, as lower cost pools exist such as Curve’s 3pool (3 bps fees) and DODO’s USDC-USDT pool (1 bps fees). Indeed, most USDC-USDT volume from 1inch is routed to DODO. There isn’t a clear quantitative methodology behind identifying the mid tail pairs. The reasoning isn’t clear behind the 5 DeFi governance tokens chosen for incentivization as “mid tail pairs.” One of these tokens, AAVE, is not a great candidate given that liquidity is dominated by a balancer pool that provides users with LP tokens that can be used in AAVE staking. 1inch AAVE-ETH routing is dominated by this pool.  These shortcomings, in conjunction with the high price tag, should encourage the community to look for other ways to address the core purposes fueling the proposal. In light of this analysis we offer a few potential solutions below and welcome the community’s feedback in continuing this dialogue. Looking forward: There could be some lower cost ways for the treasury to incentivize LP migration to v3:  If the problem is high gas cost, the treasury could subsidize a % of gas costs for new LPs. If the problem is lack of awareness and tools, there could be a grant for building better tools and documentation around v3 LPing. There could be a grant to build easy tools for other teams to incentivize liquidity on v3. For example, Fei incentivizes a large pool on Uniswap v2. Understanding these uses and working with teams to incentivize v3 liquidity instead of v2 could be high leverage for UNI holders.  Furthermore, we think using liquidity mining to bootstrap layer 2 deployments could also be a high leverage use of funds. **a16z is an investor in Optimism. ",
                    "links": [
                        "https://info.uniswap.org/#/",
                        "https://global.discourse-cdn.com/business6/uploads/uniswap1/original/2X/0/0389613a16fefa6471c05b846d816db2a317b104.png",
                        "https://uniswap.org/blog/uniswap-v3/#concentrated-liquidity",
                        "https://dune.xyz/queries/135471",
                        "https://curve.fi/3pool",
                        "https://app.dodoex.io/liquidity?network=mainnet",
                        "https://dune.xyz/queries/135498",
                        "https://pools.balancer.exchange/#/pool/0xc697051d1c6296c24ae3bcef39aca743861d9a81/",
                        "https://twitter.com/AaveAave/status/1358874783455322112?s=20",
                        "https://dune.xyz/queries/135514",
                        "https://app.fei.money/stake"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.9417182024324875
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Naught",
                    "index": "17",
                    "likes": "1",
                    "time": "02/09/2021-02:39:47",
                    "content": "I was initially in support of this proposal by llama. I do see a need to attract more governance participants and active community members. I have noticed recently with this proposal, and flipside’s; a gravitation towards creating committee’s and salaries built around the proposal (businesses being built using the uniswap treasury as a bootstrap). I think uniswap governance and participation would increase with direct incentive proposals, instead of creating small bureaucratic salaried teams; allowing community members to vote a direct seen benefit (layer 2 incentives, with a clear block start, and end date). I think using liquidity mining for bootstraping layer 2 makes plenty of sense. As a uniswap user, I have not tried layer 2. My hesistation is from the unknown of how it works (switching networks) and potential asset lockup times. Uniswap community and engagement will grow if it is seen as a place to go and be the “first time user” onramp to layer 2. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.158333333333333
                },
                {
                    "author_link": "https://gov.uniswap.org/u/HelloShreyas",
                    "index": "18",
                    "likes": "0",
                    "time": "02/09/2021-02:54:42",
                    "content": "Update: we have decided to not proceed with this proposal. We will share our rationale over the next day. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Buckerino",
                    "index": "19",
                    "likes": "0",
                    "time": "02/09/2021-11:51:35",
                    "content": "Subsidizing gas fees would make a lot of sense to be absolutely honest…this would be the way to get most bang for our bucks. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                }
            ]
        },
        {
            "thread_link": "https://gov.uniswap.org/t/uniswap-liquidity-program-v0-1/13481",
            "title": "Uniswap Liquidity Program v0.1 ",
            "index": 13481,
            "category": [
                "Proposal Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/HelloShreyas",
                    "index": "1",
                    "likes": "28",
                    "time": "16/07/2021-14:33:54",
                    "content": "Authors: @itzler, @HelloShreyas, @verto0912 Summary: This proposal outlines a framework for establishing a liquidity incentives program (Uniswap Liquidity Program, ULP) with the goals of: accelerating the migration of liquidity to Uniswap v3; encouraging new market participants to experiment with liquidity provision, and further distributing ownership of UNI tokens. We propose the program start with an initial maximum budget of 1.650m UNI, to be allocated as liquidity incentives across two quarters. Continuation of the program will require an additional governance vote. Upon renewal of the program, each of the three initiatives can be broken out into separate proposals. The program will aim to bootstrap liquidity across three different initiatives:  Stablecoin pairs Mid-tail pairs (e.g DeFi governance tokens) Deposit receipt tokens (i.e. cTokens, aTokens)  Similarly to the Uniswap Grants Program (UGP), pair selection is a subjective process that cannot be easily automated: any action requires close monitoring and frequent reporting to the Uniswap community. To this end, we propose a discretionary committee of 8 members — 5 core members from LlamaDAO to actively lead & manage the committee, as well 3 members for oversight. Find LlamaDAO’s full proposal & management plan detailed here. The committee structure allows for incentives to be allocated efficiently across many pairs without requiring a full governance vote on each pair selection. However, Uniswap governance retains ultimate oversight by granting a budget on a bi-quarterly basis. We hope that the Uniswap community will suggest additional application questions throughout the proposal process. Purpose & Background: While Uniswap v3 has quickly emerged as the market leading DEX, we believe that it has yet to reach its full potential. In particular, large amounts of liquidity remain locked in Uniswap v2, and a majority of v2 LPs have yet to migrate over the v3. Liquidity incentive programs have seen varying degrees of success. In Uniswap’s case, the initial liquidity incentive program between September—November 2020 was met with considerable interest:  Protocol liquidity quickly increased from ~$750M in the week preceding the program to ~$3B at peak. The number of individual addresses holding more than 0 LP tokens increased by ~75% from ~33,500 to ~59,000. The unique UNI token holder base grew by 14% over the course of 2 months.  A contributing factor here is that Uniswap v2 has an organic user-base, which drives organic swap yields to LPs. We expect and hope that a liquidity incentives program on Uniswap v3 would succeed in increasing wider LP participation, liquidity across sought-after pairs, UNI distribution, and swap volume. Importantly, due to v3’s Concentrated Liquidity feature, Uniswap governance can afford to pay significantly lower reward rates than previous liquidity mining programs to achieve similar market depth. Quarterly Budget:  Max quarterly budget of up to 820,039 UNI across all initiatives to start In addition to the quarterly budget, LlamaDAO (core committee members) is to be collectively compensated at a rate of $150 per hour up to 30 hours a week. Each month, oversight members will be responsible for calculating exchange rate from UNI to USD and appropriate payouts (estimated at ~2917 UNI per quarter), with payments being made in UNI. Oversight members will be compensated at a rate of 300 UNI per quarter.  Pair Selection Committee:  5 core committee members, composed of LlamaDAO team members for the first term, as well as 3 oversight committee members. Each committee has a term of 2 quarters (6 months) after which the program and members need to be renewed by UNI governance. Committee functions as a 5 of 6 multi-sig, with 3 members of LlamaDAO and 3 members from the oversight committee. Committee to share a weekly report detailing the decision making process (using a standard template) and periodic updates detailing the successes and failures of the program.  Committee Members: Committee member criteria include:  Credibly neutral — need to avoid any sense of conflict of interest Ability to evaluate fundamental strengths of projects and their place in the ecosystem Data driven — capable of assessing quantitative merits/growth signals  Committee members must recuse themselves from any ULP decision related to a project they hold an investment in or are otherwise related to. Core Committee Members (LlamaDAO):   AG: project management and evaluation  Shreyas Hariharan: project management, coordinate with Uniswap governance and stakeholders  Mason: project management, create progress reports on ULP, coordinate with projects  Austin Green: technical and security expertise  Kiba Gateaux: technical and governance expertise (DAO tooling, admin keys, multisig wallets)  Oversight Committee Members:  Eva Beylin, Graph Protocol Jon Itzler, Variant Fund Arr00, Core Compound community contributor  Implementation: UNI is distributed to LPs that provide in-range liquidity, with those that concentrate their liquidity closer to the market price (i.e. higher virtual liquidity) receiving larger allocations.    GitHub    Release Mainnet Deployment - v1.0.0 · Uniswap/uniswap-v3-staker The staker is deployed and verified on Etherscan for on all networks at the address: 0x1f98407aaB862CdDeF78Ed252D6f557aA5b0f00d    Network Explorer     Mainnet https://etherscan.io/address/0x1f9840...      Initial Proposed Reward Distribution Across Initiatives: Stablecoin pairs: We suggest an initial stablecoin/stablecoin liquidity mining program over the course of the next three months conservatively targeting $250m in each of the following pools:  USDC/DAI [0.05% fee tier] USDC/USDT [0.05% fee tier] DAI/USDT [0.05% fee tier]  A reward rate of 2% APY feels like an appropriate target for stablecoin/stablecoin pools as v3 stablecoin/stablecoin pools are already generating organic yields in-line with money market protocols. Based on a 30D moving average UNI price of $20.06, the committee would distribute 741.82 UNI per day to each of the three pools listed above for a total of 186,939 UNI across all three pools over the next quarter. Mid-tail pairs We suggest an initial mid-tail pair liquidity mining program over the course of the next quarter. We are conservatively targeting $100m in each of the following pools:  LINK/ETH [0.30% fee tier] YFI/ETH [0.30% fee tier] MKR/ETH [0.30% fee tier] AAVE/ETH [0.30% fee tier] COMP/ETH [0.30% fee tier]  A reward rate of 10% APY feels appropriate for mid-tail pair pools. Compared to stablecoin/stablecoin pools, LPs in mid-tail pairs must bear more price risk. Based on the 30D moving average UNI price of $20.06, 1,483.64 UNI per day to each of the five pools listed above for a total of 623,130.61 UNI across all five pools over the next quarter. Deposit Receipt Tokens (DRT) We suggest an initial DRT liquidity mining program over the course of the next quarter. Due to Uniswap’s brand recognition and gas optimized contracts, deeply liquid DRT pools may serve as an effective alternative distribution channel for yield-generating platforms. We are conservatively targeting $10m in each of the following pools:  DAI/cDAI [0.05% fee tier] [Compound] USDC/aUSDC [0.05% fee tier] [Aave] ETH/wstETH [0.05% fee tier] [Lido] USDC/PcUSDC [0.05% fee tier] [PoolTogether]  As with stablecoin/stablecoin pools, LPs in DRT pairs take on minimal price risk. Additionally, they earn passive yield by maintaining inventories of yield-bearing assets. A reward rate of 2% feels appropriate. Based on the 30D moving average UNI price of $20.06, the committee would distribute 29.67 UNI per day to each of the four pools listed above for a total of 9,970.09 UNI across all four pools over the next quarter. Conclusion: We recommend the establishment of a Uniswap Liquidity Program (ULP), which will actively incentivize liquidity across three strategic categories:  Stablecoin/stablecoin pairs Mid-tail pairs Depositary receipt pairs  ULP will exist as a 8-person committee with 5 core members, where core committee members are tasked with closely monitoring ongoing programs and frequently updating the Uniswap community via regular written reports. The 3 oversight members are responsible for monitoring the core committee and multisig signing. We believe that the targeted nature of ULP’s proposals coupled with Uniswap’s organic user base will help achieve various objectives: wider LP participation, more liquidity across sought-after pairs, further UNI distribution, and increasing swap volume. Next Steps: We want the establishment of ULP to be a community-driven process. We actively seek questions and feedback from the Uniswap community over the next 5 days and hope to incorporate relevant points. After this, we will post this proposal for a vote on Snapshot before an on-chain vote. ",
                    "links": [
                        "https://twitter.com/verto0912",
                        "https://twitter.com/HelloShreyas",
                        "https://twitter.com/summmason",
                        "https://twitter.com/AustinGreen",
                        "https://twitter.com/KibaGateaux",
                        "https://github.com/Uniswap/uniswap-v3-staker/releases/tag/v1.0.0",
                        "https://github.com/Uniswap/uniswap-v3-staker/releases/tag/v1.0.0",
                        "https://gov.uniswap.org/t/consensus-check-begin-uniswap-liquidity-program-v0-1/13635",
                        "https://gov.uniswap.org/t/proposal-uniswap-liquidity-program-v0-1/13877"
                    ],
                    "GPT-summary": "The proposal outlines a framework for establishing a liquidity incentives program (Uniswap Liquidity Program, ULP) with the goals of accelerating the migration of liquidity to Uniswap v3, encouraging new market participants to experiment with liquidity provision, and further distributing ownership of UNI tokens. The proposal suggests a discretionary committee of 8 members to allocate incentives across many pairs without requiring a full governance vote on each pair selection. The proposal also suggests an initial maximum budget of 1.650m UNI, to be allocated as liquidity incentives across two quarters. The proposal is open for feedback and questions from the Uniswap community.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Token economics",
                        "Board composition",
                        "Smart contract updates",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.428198238543066
                },
                {
                    "author_link": "https://gov.uniswap.org/u/uba.eth",
                    "index": "2",
                    "likes": "4",
                    "time": "16/07/2021-15:22:18",
                    "content": "Thanks for making this! Would it perhaps be a better idea to wait until Optimism is ready for higher capacity & instant withdrawal options are available/liquid, then launch a program like this on there? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.2
                },
                {
                    "author_link": "https://gov.uniswap.org/u/itzler",
                    "index": "3",
                    "likes": "6",
                    "time": "16/07/2021-15:32:51",
                    "content": "@uba.eth I think extending the program to include Optimism is an excellent idea, and definitely one of the directions we’re hoping to include as the program evolves. Like you mention, the Optimism ecosystem is quite young, so I agree it’s best to let it & Uniswap on Optimism grow naturally before adding liquidity incentives. In the meantime, we think the proposal is great opportunity to help build Uniswap V3 adoption & liquidity on L1, which remains quite important even as Uniswap extends to L2. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.428571428571429
                },
                {
                    "author_link": "https://gov.uniswap.org/u/A1igator",
                    "index": "4",
                    "likes": "5",
                    "time": "16/07/2021-15:35:32",
                    "content": "Right now we are competing with ourselves between v2 and v3, and we have control over both. I’d rather see the v2 fee switch get turned on first to move people then go from there. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.3392857142857135
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Ruzhyo.eth",
                    "index": "5",
                    "likes": "7",
                    "time": "16/07/2021-15:52:06",
                    "content": "Why is LlamaDAO getting 5 users paid $4500/week for this? No mention of arbitrum or optimism? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/scaleweb3",
                    "index": "6",
                    "likes": "6",
                    "time": "16/07/2021-15:52:58",
                    "content": "Thank you for this good proposal. It’s about time that the massive Uni treasury is effectively put to use. I personally hope this proposal will soon be further adjusted, voted on and be implemented - incl. varying incentives for Optimism experimentation. A few comments     HelloShreyas:  We expect and hope that a liquidity incentives program on Uniswap v3 would succeed in increasing wider LP participation, liquidity across sought-after pairs, UNI distribution, and swap volume.   In our opinion, a liquidity mining campaign for a DEX should mainly achieve   additional swap volume vs. competition (focus especially on trades routed towards Uniswap, not directly on Uniswap)   knowledge increase (e.g. experiment with 2-6 week incentive cycles)   Marketing exposure (e.g. co-campaigns with DeFi protocols, Optimism, etc.)   Encouragement of new token buyers and LPs was well done at the start and is an effective way to bootstrap a network. At this stage, there are better options to broaden the investor base and to educate newcomers about LPing (Guides, Videos, Test Environment/Competition). In fact, the liquidity mining campaign on majors will rather lead to more concentration since pros will farm with disproportionally more funds than newcomers. The LP base will broaden with 3rd party projects offering automated LP vaults - another interesting option for Uni treasury investment.     HelloShreyas:  The program will aim to bootstrap liquidity across three different initiatives:  Stablecoin pairs Mid-tail pairs (e.g DeFi governance tokens) Deposit receipt tokens (i.e. cTokens, aTokens)    Agreed, these target pairs are most interesting for V3. I am especially curious on cToken and aToken liquidity and opening up more use cases - is a collaboration with Compound/Aave being discussed? Targeting $100m in each of the DeFi-ETH pools seems excessive. I have serious doubts about swaps requiring such deep liquidity pools but would be happy proven otherwise.     HelloShreyas:  Committee member criteria include:  Credibly neutral — need to avoid any sense of conflict of interest Ability to evaluate fundamental strengths of projects and their place in the ecosystem Data driven — capable of assessing quantitative merits/growth signals    Commitee setup looks very strong and compensation fair. I do believe long-term investors from Paradigm and core developers should also have a seat at the table as they have most certainly thought a lot about important pairs and pair incentivization. Again, thanks for the good proposal. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.046934596934596
                },
                {
                    "author_link": "https://gov.uniswap.org/u/HelloShreyas",
                    "index": "7",
                    "likes": "2",
                    "time": "16/07/2021-15:53:35",
                    "content": "@A1igator v2 fee switch can be a separate proposal if you think there’s a good case to be made to the community for it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/danhsiu",
                    "index": "8",
                    "likes": "4",
                    "time": "16/07/2021-16:08:28",
                    "content": "What really is the problem with organic user-growth? V2 LPs enjoy ease-of-use, compounding interest w/o claiming withdrawals, flashswaps etc. V3 LPs enjoy concentrated liquidity, scarcer liquidity leading to a higher proportion of swap fees accrued, optimism support. I’m quite doubtful that the size of proposed UNI distributed would achieve to accelerate the migration of liquidity to V3. Selective pair liquidity mining is not a fair approach to other token pairs left in the dust. V2 liquidity for mid-tail pairs not mentioned will most likely remain to stay locked in V2 without UNI incentives. Has there been studies on the migration of liquidity from other DeFi projects? Could there be a hybrid bridge of connecting V2 liquidity to V3? Could we simulate the ease-of-use of V2 by allowing a user to select an approximate [0,∞] range on V3? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.979166666666667
                },
                {
                    "author_link": "https://gov.uniswap.org/u/verto0912",
                    "index": "9",
                    "likes": "4",
                    "time": "16/07/2021-16:48:32",
                    "content": "    scaleweb3:  At this stage, there are better options to broaden the investor base and to educate newcomers about LPing (Guides, Videos, Test Environment/Competition).   So, I would say that the point of the proposal is not necessarily to incentivise adoption but to incentivise migration. More V3 liquidity will unlock better user experience through much lower price impact. I would say that automated LP strategies, if they are good, would actually benefit from the program. We will also monitor things like “additional swap volume vs. competition” using Dune and can adjust the parameters of the program based on the data.     scaleweb3:  Targeting $100m in each of the DeFi-ETH pools seems excessive. I have serious doubts about swaps requiring such deep liquidity pools but would be happy proven otherwise.   Would agree that $100mm might be too deep. The goal is to use analytics as much as possible to support the parameters and decision making here. If we see that the pool is not getting utilised up to its potential, we can consider adjusting the rewards and targeting a smaller pool. I am tempted to try and get deeper pools and see if they attract different kinds of trades / unlock different user behaviours. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.478070175438596
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Buckerino",
                    "index": "10",
                    "likes": "1",
                    "time": "16/07/2021-16:59:29",
                    "content": "So yet another proposal which introduces more dilution for the UNI token holders? Tell me, how would this proposal benefit the token holders? It is the prevailing opinion that the initial farming of the UNI token was a net negative for the holders in general. We saw the price of the UNI token drop significantly while the farmers farmed and then dumped the token and moved on. Who´s to say it wont happen again?? The only effective migration from V2 to V3 is by turning on the fee switch on V2. This whole proposal feels incredibly redundant to be honest. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.829545454545455
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Buckerino",
                    "index": "11",
                    "likes": "1",
                    "time": "16/07/2021-17:06:55",
                    "content": "The proposal is in the works. We are just waiting for Optimism to roll out ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/msilb7",
                    "index": "12",
                    "likes": "5",
                    "time": "16/07/2021-17:15:08",
                    "content": "Hi, yeah good points on what the right model is. I’m Michael from Llama, working on dashboards for tracking the liquidity program. Our primary motivation for migrating liquidity to v3 is that concentrated liquidity should provide better pricing for swappers, which leads to a better swapper experience. While I definitely agree that there’s a set of users (including me) who would prefer a “set it and forget it” LP model, there’s a challenge of how to balance the best LP experience with the best swapper experience. We’ll be monitoring performance of incentivized pairs to learn if these incentives are creating a better swapper experience or not. For “set it and forget it” options, LPs could provide an ~infinite range on v3 today, but that might not generate reasonable revenue or improve the swapper experience. They could also explore automated managers, who should be able to both generate fees and provide better trade pricing. We’d hope that anyone building to improve the LP experience should benefit from the extra incentives. On mid-tail pairs, we started with what we (subjectively) perceived to have a high impact for v3, rather than incentivizing every mid-tail pair, but definitely let us know if you have suggested additions. Also, it’s worth noting that this is the initial program, so it could expand over time if the community sees enough benefit to. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.818253968253969
                },
                {
                    "author_link": "https://gov.uniswap.org/u/mame",
                    "index": "13",
                    "likes": "2",
                    "time": "16/07/2021-17:27:07",
                    "content": "I have three questions. Is there any point in doing liquidity mining in L1 instead of L2 at now? What is the point of doing this prior to the V2 rate switch? What is the deciding process for determining the menu for liquidity mining? (of cource, everyone, every project will want to participate). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Leighton",
                    "index": "14",
                    "likes": "4",
                    "time": "16/07/2021-17:40:04",
                    "content": "Excited for this! I know when UNI liquidity mining started was the first time I ever LP’ed in a meaningful way. I think it’s a very important thing to introduce users to what LP’ing is and how it works. One piece of feedback: The stated goals of the program are:   migration of liquidity to v3, 2. new market participants to experiment with LPing, 3. further distribution of UNI ownership.   Those are great but I think another very important goal is supporting the Ethereum ecosystem. Providing liquidity incentives to token pairs naturally does this but I think it should be made an explicit goal. This may be out of scope but longer term I think there should be an additional category of “ecosystem growth”. Ideal candidates for this would be promising token projects built on Ethereum but not yet trading on any Cexs. The issue is placement in this program could become highly political but I think Uniswap being active in supporting early stage projects would mean a lot to those communities – you never forget your first supporters! tl;dr liquidity mining is a big win to the whole community and that should be an explicit goal / narrative of the program. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.395661976911978
                },
                {
                    "author_link": "https://gov.uniswap.org/u/monet-supply",
                    "index": "15",
                    "likes": "2",
                    "time": "16/07/2021-18:23:53",
                    "content": "    HelloShreyas:   DAI/cDAI [0.05% fee tier] [Compound] USDC/aUSDC [0.05% fee tier] [Aave] ETH/wstETH [0.05% fee tier] [Lido] USDC/PcUSDC [0.05% fee tier] [PoolTogether]    I’m not certain, but I’m assuming holding cTokens, aTokens, and plTokens in a Uniswap v3 pool will forfeit any of the underlying protocol’s liquidity incentives. How can we solve for this? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.464285714285714
                },
                {
                    "author_link": "https://gov.uniswap.org/u/burtrico",
                    "index": "16",
                    "likes": "2",
                    "time": "16/07/2021-18:35:42",
                    "content": "    HelloShreyas:  In addition to the quarterly budget, LlamaDAO (core committee members) is to be collectively compensated at a rate of $150 per hour up to 30 hours a week.   I saw the same hourly rate for the reinstating UGP v0.2 post. Is this hourly rate based on some source for the the going rate for developers? I’m mainly curious. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://gov.uniswap.org/u/HelloShreyas",
                    "index": "17",
                    "likes": "6",
                    "time": "16/07/2021-18:45:17",
                    "content": "@Ruzhyo.eth Our compensation is $150 an hour for a maximum of 30 hours a week. Note that compensation may be less than 30 hours a week based on the work involved. We will make our timesheet public for Uniswap’s governance to view. $150 an hour is reasonable compensation given the specialization involved in DeFi liquidity programs. For comparison, the Uniswap Grants committee proposes a compensation of $150 an hour. 30 hours a week is a fair estimate for the work involved. This what we will work on:  Manage incoming and outgoing communication with projects Coordinate with outside counsel to determine token eligibility where needed Create publicly visible dashboards summarizing current status of the ULP and report back to Uniswap governance periodically on the progress and effectiveness of ULP Consistently work with the community to help Uniswap stay up-to-date with the latest regulations and help them think through the benefits and risks of incentivizing new pairs Create public Dune Analytics dashboards to evaluate the effectiveness of the liquidity program; update the community and make changes to the program based on the data (see specific dashboards under the “monitoring and analytics” section below) Sign and execute on multisig transactions  We are focused on creating a gold standard for Uniswap’s liquidity program as well as liquidity incentives across the DeFi ecosystem. We will actively monitor ULP and make adjustments to the program based on the data we track. These are the Dune Analytics dashboards that we will create (subject to some change based on ULP evolves):  Is incentivizing v3 liquidity providing a better trader experience on v3?  Swap Performance: Share of trades where v3 has the best price (DEX aggregators as a proxy), and price impact trends for incentivized pairs. Benchmark Growth: Share of trades and trading volume for incentivized pairs on v3 vs v2 and other DEXs   Is the liquidity program creating deeper v3 liquidity versus v2?  Liquidity Depth: Monitor total TVL and in-range liquidity for incentivized pairs, and volume of active LPs. New v3 Liquidity: Track v2 liquidity migration to v3 in incentivized pairs, and compare new liquidity going to v3 vs v2. LP Retention: Track how many users are LPing, how many are new vs returning LPs, and LP cohort retention.   Do we have the right rewards structure in place? What can we learn?  UNI Reward Structure: Change in TVL and in-range liquidity by UNI incentive tier. External Rewards: Change in TVL and in-range liquidity for pairs with multiple incentives (i.e. native token liquidity mining, staking), and/or incentives on other DEXs.    Re. Optimism: it is definitely something worth considering but it is early days. We will monitor how Optimism evolves and potentially adjust the liquidity program to incorporate L2s in the future. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.647309833024119
                },
                {
                    "author_link": "https://gov.uniswap.org/u/itzler",
                    "index": "18",
                    "likes": "3",
                    "time": "16/07/2021-18:55:02",
                    "content": "100% agree that ecosystem growth, & more particularly, focusing on protocols/tokens that serve as public goods to Ethereum is a key goal (+ proposal’s stated goals could be updated to better reflect this). We aimed to select the starting set of pairs with this in mind. As the program evolves, it has the potential to add an additional mandate of incentivizing emerging public goods that fall within the initiatives - new stablecoins, additional receipt tokens, etc. Considering & proposing pairs like these to select as additions would be part of Llama’s mandate. We made the decision to start the proposal out with limited scope on this particular set & let it prove success first, but the flexibility of the committee structure means that this idea could definitely be within scope over the longer term. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.695810142238713
                },
                {
                    "author_link": "https://gov.uniswap.org/u/burtrico",
                    "index": "19",
                    "likes": "3",
                    "time": "16/07/2021-19:23:21",
                    "content": "@DCinvestor stated my concerns clearly in the Reinstating UGP v0.2 discussion: \" Thanks for this. I mostly estimated the maximum costs because I think that this is a good best practice for any kind of fund disbursement, and is a practice we should try to formalize (e.g., estimate expected and maximum costs). I think it’s reasonable, though would like to see some review of accrued hourly labor from Ken, with a tally of hours spent by participant ultimately published. The goal is not to find a “gotcha,” but to promote a culture of maximum transparency. \" Reinstating UGP v0.2 with existing funds Since this is a DAO and we don’t have a full-time employee overseeing over your team’s hours and budgeting, it will be important to provide transparency. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 6.590909090909091
                },
                {
                    "author_link": "https://gov.uniswap.org/u/HelloShreyas",
                    "index": "20",
                    "likes": "4",
                    "time": "16/07/2021-19:29:30",
                    "content": "We will provide full transparency on the hours worked. We will also build a dashboard to track the progress and effectiveness of ULP, share operational spending of the program, provide periodic updates on the governance forum, and be relatively responsive to feedback. In fact, we strongly considered @DCinvestor’s points mentioned here and incorporated them as much as we could - especially having defined deliverables, shared input on the roadmap, and regular reports on progress and spending. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.819444444444444
                },
                {
                    "author_link": "https://gov.uniswap.org/u/jcp",
                    "index": "21",
                    "likes": "4",
                    "time": "16/07/2021-19:32:25",
                    "content": "Thanks for the very solid post, and for soliciting comments and feedback before moving to a vote. I like this proposal. I’m sure I’ll have other questions, but my first is just around the work from the committee. I believe the $150/hr compensation is a fair rate for this kind of specialized work, but I have a question on the weekly hour limit for this committee. The 30 hour/week limit per person is obviously the same limit for the UGP committee, but there are more members of this committee, and I’m curious how the amount of work stacks up. Do you believe the amount of weekly work for this program will be equivalent to something like UGP, where there’s (at least to me) more obvious human hours required week in and week out to keep the project going? My intuition would be that it might be good to have a lower cap on hours per person, or a team-wide hour cap that comes out to where we think weekly work will hit a plateau in terms of marginal utility. Curious to hear thoughts! @HelloShreyas, I see your post above on the dashboard creation and documentation to be done, and I suppose my question is if you think that kind of work could possible add up to 5 people * 30 hours per week. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.9750000000000005
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Milli3E",
                    "index": "22",
                    "likes": "2",
                    "time": "16/07/2021-19:33:30",
                    "content": "Surprised SNX is left out here, I would think to gain the support of some members of the Synthetix community it would have been included in the mid-tail pair list. I think many Defi users would prefer UNI incentives directed at pairs on Optimism since managing the liquidity positions becomes indiscriminately feasible. This proposal is missing that piece as well. Overall I dont think Uniswap in particular benefits from a Committee to manage liquidity incentives, but would perhaps give it more thought if the group was diversified a little better. I’m not sure a committee made up of mainly LlamaDAO members can adequately represent the Greater DeFi Ecosystem, and the exemption of SNX among the selected Defi gov tokens is an example of that. I have no issue with the LlamaDAO members individually, however this proposal misses the mark for me in its current form.  SNX Ambassador  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.709722222222222
                },
                {
                    "author_link": "https://gov.uniswap.org/u/g_dip",
                    "index": "23",
                    "likes": "3",
                    "time": "16/07/2021-19:47:38",
                    "content": "I don’t think this is necessary. UNI holders forgoing fees is more than enough incentive to provide liquidity on Uniswap over its competitors, not to mention the technical advantages protected by the creative licensing scheme. Additionally, pair selection is implicitly political and opens up an opportunity for our competitors to service the “rejects.” Not to mention adding this other DAO and compensation opens up another political attack surface that could be compromised. I like Uniswap as completely neutral exchange infrastructure. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.541666666666667
                },
                {
                    "author_link": "https://gov.uniswap.org/u/HelloShreyas",
                    "index": "24",
                    "likes": "3",
                    "time": "16/07/2021-19:58:15",
                    "content": "Appreciate the feedback @jcp. We propose 30 hours/week limit for LlamaDAO, i.e. all core members of the ULP committee. (Not 30 hours/week per person.) Hopefully that clarifies things, but let me know if we should change any of the wording in the proposal here:  In addition to the quarterly budget, LlamaDAO (core committee members) is to be collectively compensated at a rate of $150 per hour up to 30 hours a week.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/jcp",
                    "index": "25",
                    "likes": "3",
                    "time": "16/07/2021-20:10:19",
                    "content": "Oh perfect, I was misinterpreting then. Thank you for correcting me! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/mikeborghi",
                    "index": "27",
                    "likes": "1",
                    "time": "16/07/2021-20:24:09",
                    "content": "Would it be beneficial to include an incentivized UNI-ETH or UNI-USD so that LP’s are encouraged to parlay their earnings into a position that does not result in offloading the uni rewards. I’m coming at this from an angle of user retention rather than anything related to price impact on the UNI token. I think the more we incentivize people to keep their uni tokens, the more we incentivize them to stay on the Uniswap platform while also increasing decentralization. Would love to hear thoughts on this. Other thoughts: The general defi public has yet to realize the earnings potential for v3 positions even with 0 incentives. I believe this program will do good things for introducing people to v3 positions and their unique mechanics without diluting the circulation of UNI too much. I am in favor of this proposal. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.227272727272728
                },
                {
                    "author_link": "https://gov.uniswap.org/u/masonv",
                    "index": "28",
                    "likes": "3",
                    "time": "16/07/2021-22:13:21",
                    "content": "Appreciate your candid response. Most Llama members are actively part of other DAOs, it was important to us that we represent a number of different interests across the space. The committee members proposed here have shown a broad knowledge of the space, actively participate in other projects, and overall share a strong desire for the advancement of the DeFi ecosystem. I was around for initial Uni Liquidity mining and also minted one of the first 500 v3 positions. I remember each time with excitement and trepidation and believe that a renewed liquidity mining program on v3 would not only accomplish the stated goals of bringing increased v3 liquidity, but also bring new users to the protocol. As for the pairs mentioned, we can certainly explore the inclusion of SNX in the initial program if there is support from the Uni community for it. If it doesn’t make it in the first round it can also be part of our phased approach and be incentivized later if the Uni community deems the program to be effective ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.649956194599052
                },
                {
                    "author_link": "https://gov.uniswap.org/u/burtrico",
                    "index": "29",
                    "likes": "2",
                    "time": "17/07/2021-02:13:45",
                    "content": "I also was wondering why we would not have a UNI/ETH pair. I would like to see a SNX/ETH pair as well. We could have a poll if these questions need to be answered. Regarding the statement that we don’t really need these incentives since v3 is already dominating the LP game, would it make sense that we plan to flip the v3 fee switch in addition to providing these LP incentives (after at least one layer 2 roll up is fully open)? I know we have proposal to flip the v2 fee switch, but if UNI members would like to see UNI token holders’ incentives as well as LP’s incentives fully align, a low fee v3 switch could be the answer. Without token holders and/or the treasury benefiting, we are potentially wasting some of the value for LP incentives. I would like to see the UNI community and Uniswap Labs discuss both of these topics at the next community call if possible. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 4.6875
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Ruzhyo.eth",
                    "index": "31",
                    "likes": "1",
                    "time": "17/07/2021-15:00:46",
                    "content": "Great in-depth answer. But perhaps the question I meant to ask was: Why LlamaDAO? Seems like there could be a conflict of interest with everyone on this team coming from one organization. What’s to stop you all from agreeing that your $LLAMA tokens (or whatever, I’m guessing) shouldn’t be strongly incentivized over other tokens? RE: Optimism/Arbitrum being early days. That’s exactly why I believe that any liquidity incentive programs should be targeted there. If there are new users to onboard out there, an L2 launch will be the time to attract them. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.328914141414142
                },
                {
                    "author_link": "https://gov.uniswap.org/u/mame",
                    "index": "32",
                    "likes": "1",
                    "time": "17/07/2021-15:41:30",
                    "content": "I agree that incentives should be done in L2. what reason that slect LINK, YFI, MKR, AAVE, and COMP for the mid-pair? Many projects will be want to participate. Is there any way for those projects to participate in mining? Also, how to decide whether or not to participate? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/jhrojas1967",
                    "index": "33",
                    "likes": "2",
                    "time": "17/07/2021-17:12:00",
                    "content": "Hello, I think it is a very good idea. I think we are all aware that it is important to migrate from V1 and V2 to V3. At the moment we are competing with each other and that is good when the competition is yourself, but at the rate that the projects move, we cannot stand still. On the other hand, after almost 10 months since the launch of UNI, the creation of this liquidity program, sure that it helps to increase the number of users who obtain these rewards and, it will increase the deposits in all the groups. In these months a lot of work has been done and, from my point of view, very well. I think it’s a good time for this release. We are at the gates of the first year of UNI and we have to place our project in the TOP 5. Thanks and greetings to all ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.816666666666666
                },
                {
                    "author_link": "https://gov.uniswap.org/u/austin",
                    "index": "34",
                    "likes": "3",
                    "time": "17/07/2021-18:34:15",
                    "content": "Thanks for the feedback! I’m Austin from Llama.     Ruzhyo.eth:  Why LlamaDAO?   Llama is a collection of builders across the crypto industry with a diverse set of backgrounds. We don’t have a token and exist to be an independent voice on treasury management for protocol communities.     Ruzhyo.eth:  RE: Optimism/Arbitrum being early days. That’s exactly why I believe that any liquidity incentive programs should be targeted there.   I agree that we should watch Uniswap adoption on L2s closely. The focus of this proposal is incentivizing liquidity migration from v2 to v3, but we should be willing to evaluate the expansion of ULP as those ecosystems mature. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.791666666666666
                },
                {
                    "author_link": "https://gov.uniswap.org/u/HHJackSun",
                    "index": "35",
                    "likes": "3",
                    "time": "17/07/2021-18:50:54",
                    "content": "Wondering if there’s any reason ETH-DAI isn’t an incentivized pair here given it’s still a top 10 pool on Uniswap v2 in terms of both TVL & volume? I’d personally vote for adding ETH-DAI to the list of incentivized pools on Uniswap V3  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.uniswap.org/u/wijuwiju",
                    "index": "37",
                    "likes": "4",
                    "time": "17/07/2021-22:48:11",
                    "content": "Hey Llama team, Appreciate your proposal and work you have put into it, but to be precise and short, I find it utterly boring, please don’t be offender, I mean no disrespect and as I said appreciate your work, if you could allow me, I would love to explain my reasoning. First of all lets go over what you are proposing: First of the goals you mention is:     HelloShreyas:  accelerating the migration of liquidity to Uniswap v3   Immediately you follow with suggesting subsidising these pairs:     HelloShreyas:   USDC/DAI [0.05% fee tier] USDC/USDT [0.05% fee tier] DAI/USDT [0.05% fee tier]    Lets look at first pair *v3 USDC/DAI 0.05% TVL is $118m compared to v2 which only $21m (so here it seems you completely ignore the market, and forces that move it, the lower fee offers better rate for end users and increases trading volume, and hence is natural migration for efficient capital, if we compare last 24h volume its $116k on v2 vs $7.29m (x62 difference), adjust it for 6x difference in fees (0.3 vs 0.05) and 5.6x difference in volume, we get that v3 gives LP an almost x2 ROI, and im deliberately leaving out all the benefits and earnings adjustments of concentrated liquidity Not sure there is any point of going over every pair as what you are here are proposing: is to provide you with funds for exactly this core capability of choosing what pools to incentive + some periphery tooling, like dune, etc (for the latter I suggest applying to Uniswap grants could be more suitable) So at this point I wouldn’t even consider with voting to provide you with budget to allocate treasury funds for allocation between pools Furthermore your suggested weekly rate, which is exactly the same as recent one requested by uniswap grants team, adds even more concerns to me, because I don’t understand how different size team, with different set of capabilities, responsibilities, challenges, etc could be cost the same Lastly I would like to finish where I started is why I think this proposal is utterly boring, I do agree with where you guys are coming from, making a good use of treasury and really feel these two goals you have set out in your proposal:     HelloShreyas:  encouraging new market participants to experiment with liquidity provision, and further distributing ownership of UNI tokens   and that’s why I completely not getting how is this experimental at all, its just basically the same old farming or what it called, that has been in the market for quite some time and personally I don’t think in your proposed suggestion solves further distributing ownership of UNI tokens or experimental, hence boring. What I would like to see, and would gladly vote for is some innovative ideas, i got couple just while reading this thread and writing a reply:  Something like with partnership with unigrants we bootstrap any project/community approved by them with liquidity for their token pairs on v3 We provide UNI/ETH pools with 1m of UNI liquidity incentives, just cause they didn’t get their fees (around $30k) from the defifund dump the other day due some weird reasoning behind it make idea 1 into a proper dapp  Just to finish, as I have said I feel that I share many of the goals you have outlined here and understand where you coming from, but I simply think the proposal doesn’t solve the problem, hence I will be voting against it, if it comes to the vote, agains thanks for your effort and time! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.2823863636363635
                },
                {
                    "author_link": "https://gov.uniswap.org/u/austin",
                    "index": "38",
                    "likes": "4",
                    "time": "18/07/2021-16:54:13",
                    "content": "Thank you for the thoughtful response! I’m Austin, one of the core committee members from Llama.     wijuwiju:  Not sure there is any point of going over every pair as what you are here are proposing: is to provide you with funds for exactly this core capability of choosing what pools to incentive + some periphery tooling, like dune, etc (for the latter I suggest applying to Uniswap grants could be more suitable)   This proposal is very much the beginning of the Uniswap Liquidity Program (v0.1). We want to ensure the community starts with a strong foundation and is able to adapt as we see the market response through a data-driven lens. Migrating liquidity is just one of the stated goals of our proposal. We also aim to encourage new participants to experiment with LPing and further diversify the UNI token holder base. We believe that incentivizing stablecoin pairs will be a big driver for the latter two goals.     wijuwiju:  Furthermore your suggested weekly rate, which is exactly the same as recent one requested by uniswap grants team, adds even more concerns to me, because I don’t understand how different size team, with different set of capabilities, responsibilities, challenges, etc could be cost the same   Given the experience of the committee and the unique skill set required to implement a comprehensive liquidity program, we believe $150/hr is quite a fair rate. I’m sure most of the committee members are used to being paid much more for their work. The 30 hour aggregate weekly limit means the community will only be paying a max of $4,500 a week for all the manual effort required to help the community manage a liquidity program. Pair selection is a subjective process that cannot be easily automated: any action requires close monitoring and frequent reporting to the Uniswap community. We take this job seriously and are committed to providing weekly updates to ensure the committee is more than justifying the cost of their work.     wijuwiju:  We provide UNI/ETH pools with 1m of UNI liquidity incentives   UNI holders are already highly incentivized to expedite the migration of liquidity to v3, so we figure it will be a better use of funds to start with these pairs.     wijuwiju:  Just to finish, as I have said I feel that I share many of the goals you have outlined here and understand where you coming from, but I simply think the proposal doesn’t solve the problem, hence I will be voting against it, if it comes to the vote, agains thanks for your effort and time!   We’re happy to hear that you share the same goals as us. This proposal is just the beginning of what the Uniswap liquidity program can be. As the program evolves, there is the potential to have a process to add new pairs to this list. Uniswap is a rapidly growing protocol and we think beginning with these selected pairs will maximize our chances to grow with it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.042812269031781
                },
                {
                    "author_link": "https://gov.uniswap.org/u/mame",
                    "index": "39",
                    "likes": "2",
                    "time": "19/07/2021-13:26:30",
                    "content": "I believe that if we are going to start this program, we should add gitcoin (GTC) to the list of targets. They have been incredibly instrumental in expanding DeFi and the OSS culture, and have a strong DAO. The only utility is DAO, but if it is eligible for this program and its market capitalization expands, it will have a beneficial effect on the development of Ethereum. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.222222222222222
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Leighton",
                    "index": "41",
                    "likes": "5",
                    "time": "19/07/2021-16:19:12",
                    "content": "This is correct for all three tokens. The only solution I can think of is wrapping but that creates a lot of headaches and I think is detrimental to the main goal (i.e. “pools may serve as an effective alternative distribution channel for yield-generating platforms.”). Wrapping would be better for the LPs but much worse for the people swapping. So I think the current suggested approach is best. At least for PoolTogether it will provide a meaningfully better experience vs. depositing directly (saves 100k gas). The LPs miss out on the Aave / COMP / POOL tokens but are compensated by getting the UNI tokens. And the Uniswap protocol gets to pilot demand for direct swapping into protocol tokens rather than using protocol UIs… which I think is a really good strategy for Uniswap. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.236111111111111
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Naught",
                    "index": "42",
                    "likes": "3",
                    "time": "21/07/2021-01:44:51",
                    "content": "I am in support of this proposal. It makes sense to have a research based DAO to help with informing the community on key pairs to be focused on to keep Uniswap competitive with other AMM’s and itself (v1 & v2). I few concerns I have is that the treasury has mostly been spent so far on proposals that increase supply of UNI into the market, such as: UGP winners selling UNI to market, DeFi Education Fund selling $10 million usd worth of UNI. If this proposal passes we will mostly see participants who are coming for the APY in UNI rather than an interest in governance, which again will be more selling into a fragile market. I overall am in support of this proposal, but I do think a UI should be built to encourage more governance participation in what pools are selected for further liquidity programs (supplemented by research done by Llama DAO), and a mindful awareness that UNI token itself losses all value as a governance, and treasury if it has little value. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.595833333333333
                },
                {
                    "author_link": "https://gov.uniswap.org/u/0xzeta",
                    "index": "43",
                    "likes": "10",
                    "time": "23/07/2021-08:46:41",
                    "content": "See, this is the problem with liquidity mining. It’s all fun and games in the beginning when nobody knows about the protocol, we attract liquidity (of course we do, we’re giving LPs free “money”). But then how quickly it becomes a slippery slope. Like a drug, basically. We have no choice but to keep distributing rewards and incentives because if we stop, a competitor will come in who will and liquidity is going to migrate to them. Our LPs are addicted. It’s already the case with SushiSwap and others on other chains. And more protocols will be created in the future because everything is open source and forkable and despite what we might think liquidity has very little network effects. Liquidity in DeFi is a mercenary, it will go where it’ll make the most money because there is no switching cost. All this at the detriment, of course, of UNI holders. Case in point, the CRV token, where they are basically printing an unlimited amount of rewards just to try to keep liquidity there. As a consequence the price of CRV just keeps tanking and this despite basically CRV being completely useless outside of staking which is another artificial mechanism created to try to keep people from dumping it. Liquidity providers there are slowly realizing that they are being paid rewards in a token whose value keeps declining so they’re incentivized to sell it as soon as they receive it, which puts further sell pressure on price. It’s a vicious circle. Liquidity mining was never anything more than a financial hack. Perhaps, in the very early days of a protocol, it has value in attracting capital. But it cannot be used all the time. When does it stop? There is no proof that liquidity mining attracts long term capital. At best, it attracts capital while rewards are running and most of that capital will flee elsewhere when the rewards stop. We need a better strategy. We need to think long term. Liquidity mining is very short term thinking. Synthetix lives on liquidity mining and today exists as little more than a zombie protocol. They have an average of 42 trades per day over the past 30 days (!). Can you believe it? See for yourself on their stats site. The fact that they are valued at $1.8B is nothing more than financial hackery that is common in crypto (Cardano, anyone?). They have still not found product-market fit. Uniswap, on the other hand, probably has. We don’t need financial hackery schemes. It dilutes UNI holders but most of all it dilutes the brand and arguably the brand is one of the only sustainable competitive advantages we have against up and coming protocols. If LPs aren’t migrating organically from v2 to v3, then there’s a deeper problem that a few UNI rewards won’t solve, at least not in the long run. Perhaps they don’t want to actively manage their liquidity, which they’ll have to do in v3. Perhaps the solution then would be to create liquidity management tools to help them do that. Rewards are not the solution. I am disappointed in this proposal. It highlights the major problem of protocol governance more generally. Short term solutions will sometimes prevail at the detriment of longer term sustainable solutions. This is not a problem we’d have if governance was in the hands of a small founding team who think about Uniswap 24/7. Arguably given the amount of votes Hayden & co control, it still is, which is a good thing, in which case what we have is simply the illusion of governance. Food for thought. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.189923469387755
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Boogaav",
                    "index": "44",
                    "likes": "1",
                    "time": "06/08/2021-21:32:08",
                    "content": "Hey guys, is this website Uniearn anyhow associated with current thread ?  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/pper",
                    "index": "45",
                    "likes": "1",
                    "time": "07/08/2021-11:27:49",
                    "content": "    msilb7:  For “set it and forget it” options, LPs could provide an ~infinite range on v3 today, but that might not generate reasonable revenue or improve the swapper experience.   Concentrating liquidity around standard deviation from median or average price over a time period (say, 9 days as is accessible in v3), as opposed to rigid brackets can allow LP to “set it and forget it”, while maintaining reasonable revenue, and Range Order protection from sudden price drops with the reduced capital cost. This can be applied by modifying the v3 curve formula so that p represents time weighed average price now and d is percentage deviation from that. (𝑥 + 𝐿/√{𝑝+d𝑝}) (𝑦 + 𝐿√{𝑝-d𝑝}) = 𝐿2 Thus LPs can concentrate their liquidity assets by “bounding” it within the percentage deviation from the time weighed average price. (to use the v3 whitepaper language ) Not sure how much more computationally challenging this is, though.     0xzeta:  Liquidity mining was never anything more than a financial hack. Perhaps, in the very early days of a protocol, it has value in attracting capital. But it cannot be used all the time.   Since in v3 liquidity tokens are NFTs, it would make sense to introduce a square root of time  modifier to fee calculation, making the default fees (slightly) lower and growing to current levels and (slightly) beyond as time goes on. This would incentivise LPs to hold their liquidity pool on Uniswap, as they would loose the higher fees accrued. It can also make these NFT positions a desirable commodity traded as they are, rather than cashed in reducing liquidity. The prices for such “charged” tokens can be higher than the value of the assets they represent as an investor will buy them for future gains. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.407896270396271
                },
                {
                    "author_link": "https://gov.uniswap.org/u/papiporn",
                    "index": "47",
                    "likes": "1",
                    "time": "23/09/2021-04:07:52",
                    "content": "Hi, I have a couple of questions with regards to the Staker.sol contract.  Are there any existing front end or UIs that allow for liquidity mining of Uniswapv3 LP NFTs? The Tuple value parsed into the createincentive function in Staker.sol (reward token address, pool address, start time, end time, refundee address) somehow keeps throwing me an error when I tried testing on Rinkeby. I have ensured that the start and end time are within the checks of maxincentive duration… this is my transaction hash: 0xf7579d8ae405a4eced9579a0f1bae80083a1627e8b24e2c8d531861e6fc01aea is the incentive a 1-1 mapping to a particular pool? and with every pool being unique, is the staker.sol contract essentially just rewarding one particular pool? to put it in context, say there are 3 pools (A,B,C) for wbtc-weth pairing. if i were to create an incentive, I would be creating an incentive for pool A, not (A,B,C) based on that one function call?  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.208333333333334
                },
                {
                    "author_link": "https://gov.uniswap.org/u/samkazemian",
                    "index": "48",
                    "likes": "1",
                    "time": "27/09/2021-19:05:59",
                    "content": "Hey @papiporn, off topic from this thread but to directly answer your question about UIs and contracts for liquidity mining Uniswap v3 LP NFTs, we have what I believe is the first full suite front end at Frax Finance. For example, you can check out our Uni V3 farming pair UI and contracts here: app .frax  .finance/staking#Uniswap_V3_FRAX_USDC We also allow locking the NFT LP for an additional boost to increase stickiness of the LP program. The farming contract also allows setting of range/ticks that are incentivized instead of generalized. The contract itself can be found here: etherscan .io/ address/0x3EF26504dbc8Dd7B7aa3E97Bc9f3813a9FC0B4B0 I think the other protocol that might have full Uni v3 farming infrastructure other than FRAX is Gelato’s G UNI system. Maker is using them to manage their PSM module. I think they also are expanding it to generalized farming for end-users right now as well. Hope that helps  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None"
                    ],
                    "Sentiment": 5.775510204081633
                },
                {
                    "author_link": "https://gov.uniswap.org/u/OpenFi",
                    "index": "49",
                    "likes": "1",
                    "time": "28/09/2021-00:27:11",
                    "content": "Off-topic for this reply thread but was curious to see what is held in the Uniswap treasury? From what I’m seeing in this thread, it seems like there is a mountain of Uni tokens and then some stable coins. Besides protocol fees, how are contributors being rewarded? Does the treasury plan to diversify more? Sorry not active in the community and trying to learn more about the treasury. Forgive the noob question please. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.466666666666667
                },
                {
                    "author_link": "https://gov.uniswap.org/u/nett",
                    "index": "50",
                    "likes": "2",
                    "time": "28/09/2022-01:41:25",
                    "content": "Are there plans to adopt a specific management toolstack to enable transparency and some degree of automation for this program? For example, I’m thinking the payroll component could be automated to reduce time/effort needed on operations and ensure all full-time contributors or contracted (like Llama) get paid on time. I believe Coinshift recently did an integration with Superfluid, so DAO payroll can run automatically via real-time streams and settle multiple “salary streams” in a single batch. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.910714285714286
                }
            ]
        }
    ],
    "group_index": "106"
}