{
    "poll_list": [
        {
            "id": "Qmehop1NNWP9VEf7tGLEAYRphVsXtdxkL7oKEhaXL2Xao6",
            "title": "Deploy Uniswap v3 on Arbitrum",
            "discussion": "",
            "body": "### Background\nPer andy8052 on the [Uniswap forums](https://gov.uniswap.org/t/deploy-uniswap-v3-to-arbitrum-mainnet/12451):\n...there is immense value in being available for swaps on every EVM compatible network. Since there is no liquidity mining, it is hard to make the case that multiple deployments will segment liquidity, and long term if this is an issue governance can flip the switch on liquidity incentives for the chains it desires deepest liquidity. In the meantime, not deploying to new and growing networks like Arbitrum and Matic just allows for other exchanges to come in and fill that spot. This could potentially eat into fees earned by governance in the future.\n\nAlongside this, it will help to grow the potential list of projects that can be built on Uniswap v3. Growing the public smart contract libraries interfacing with and using the v3 codebase will only expedite Uniswap adoption on all chains as the code and integrations become more battle tested.\n\nArbitrum launches later this week on May 28th. I think it would be best to start a discussion ASAP around deploying the Uniswap v3 code to Arbitrum network.\n\n### Next Steps\nIndicate your interest for Uniswap moving forward with a deployment of Uniswap v3 on Arbitrum, by (1) opening the Uniswap v3 license to include code deployed on Arbitrum, (2) allowing community developers to implement Uniswap v3 on Arbitrum.\n",
            "choices": [
                "FOR Uniswap v3 on Arbitrum",
                "AGAINST Uniswap v3 on Arbitrum"
            ],
            "scores": [
                38647456.608673014,
                306.10608628738817
            ],
            "start": 1622044800,
            "end": 1622217600,
            "snapshot": "12510878",
            "state": "closed",
            "author": "0x88FB3D509fC49B515BFEb04e23f53ba339563981",
            "space": {
                "id": "uniswap",
                "name": "Uniswap"
            }
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/deploy-uniswap-v3-to-arbitrum-mainnet/12451",
            "title": "Deploy Uniswap v3 to Arbitrum Mainnet ",
            "index": 12451,
            "category": [
                "Proposal Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/andy8052",
                    "index": "1",
                    "likes": "69",
                    "time": "26/05/2021-04:13:13",
                    "content": "As Bill Parcels said, “The best ability is availability”. Uniswap v3 finds itself in an interesting position with its licensing that legitimate teams cannot legally fork the code. This is great for maintaining a competitive advantage, but also has Uniswap Labs in a hard place when it comes to deploying the smart contracts to new chains that they did not previously plan to support. I believe that there is immense value in being available for swaps on every EVM compatible network. Since there is no liquidity mining, it is hard to make the case that multiple deployments will segment liquidity, and long term if this is an issue governance can flip the switch on liquidity incentives for the chains it desires deepest liquidity. In the meantime, not deploying to new and growing networks like Arbitrum and Matic just allows for other exchanges to come in and fill that spot. This could potentially eat into fees earned by governance in the future. Alongside this, it will help to grow the potential list of projects that can be built on Uniswap v3. Growing the public smart contract libraries interfacing with and using the v3 codebase will only expedite Uniswap adoption on all chains as the code and integrations become more battle tested. Arbitrum launches later this week on May 28th. I think it would be best to start a discussion ASAP around deploying the Uniswap v3 code to Arbitrum network. ",
                    "links": [],
                    "GPT-summary": "The author proposes deploying Uniswap v3 to new chains like Arbitrum and Matic to increase availability and grow the potential list of projects that can be built on Uniswap v3. The author asks for feedback and suggests starting a discussion around deploying the Uniswap v3 code to the Arbitrum network. The post also extends to potential collaborations and advertising the proposal.",
                    "GPT-proposal-categories": [
                        "Interoperability and Scalability",
                        "Smart contract updates",
                        "Token economics",
                        "Community and engagement",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.922145562770563
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Agusx1211",
                    "index": "3",
                    "likes": "22",
                    "time": "26/05/2021-07:26:45",
                    "content": "I support this proposal. In my opinion it would be good for Uniswap with regards to L2, Arbitrum is an alternative implementation of an optimistic rollup with different design principles and thus tradeoffs. Optimism can automatically follow Ethereum hardforks but Arbitrum has far less risk of reaching a non-deterministic state and it can be used with the same contract bytecode as used for Ethereum L1 contracts. We can’t know yet which one is going to be more attractive for developers, if Uniswap decides to only integrate with Optimism and Arbitrum becomes the most popular rollup then we could leave a big void that will be filled by a competitor. Last but not least, Arbitrum is launching the 28 of May and we don’t know when Optimism is launching, deploying v3 to Arbitrum will mitigate in a short timeframe the “high gas fees” bad publicity Uniswap is having without requiring practically any contract changes from the dev team. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.901041666666666
                },
                {
                    "author_link": "https://gov.uniswap.org/u/mihal",
                    "index": "4",
                    "likes": "17",
                    "time": "26/05/2021-07:48:00",
                    "content": "I’d strongly support this proposal as well. Arbitrum is strongly aligned with Uniswap & Ethereum values: it inherits the trust assumptions of mainnet and uses ETH for transaction fees. While I agree that Uniswap shouldn’t chase every side-chain out there, I do think Arbitrum has solid potential to be one of the primary Ethereum scaling solutions, operating alongside Optimism. Arbitrum will have a version of Uniswap on it, either a fork of V2 or an anonymous fork of V3. I believe it is in the best interest of UNI holders, as well as the Ethereum ecosystem as a whole, for there to be an officially-supported instance of Uniswap V3 deployed to Arbitrum. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party is auditing and reviewing proposal"
                    ],
                    "Sentiment": 6.761904761904763
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Jay-Prime",
                    "index": "5",
                    "likes": "10",
                    "time": "26/05/2021-09:18:34",
                    "content": "I support this proposal.     mihal:  Arbitrum will have a version of Uniswap on it, either a fork of V2 or an anonymous fork of V3. I believe it is in the best interest of UNI holders, as well as the Ethereum ecosystem as a whole, for there to be an officially-supported instance of Uniswap V3 deployed to Arbitrum.   I can see this happening, too, and would definitely prefer to see an official Uniswap v3 release on Arbitrum. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/samueldashadrach",
                    "index": "6",
                    "likes": "18",
                    "time": "26/05/2021-11:13:14",
                    "content": "I storngly support this proposal. If the overall community too supports this proposal, this proposal will serve as a strong litmus test for whether Uniswap governance will be able to respect the wishes of the community. There have been rumours that Uniswap investors such as Paradigm and a16z will be reluctant to deploy Uniswap to Arbitrum due to vested financial interest in Optimism. Deploying Uniswap to Arbitrum will quash these rumours and strongly signal that the there is no misalignment of goals amongst the various investors, funds, and individuals invested in Uniswap. Uniswap should aim to be public infrastructure and deploy itself wherever possible. This is simultaneously also the path to maximising revenue. Projects such as Sushiswap and Aave have already soft-signalled intentions to deploy to Arbitrum, this indicates that a vibrant DeFi ecosystem is going to grow on Arbitrum, whether we are prepared for it or not. Uniswap v3 has a competitive moat due to its licensed codebase and capital efficient model, it must take full advantage of this. Not deploying to all chains could be interpeted as some as an action undertaken in bad faith, this in turn could lead to someone not respecting the license and forking the codebase. To conclude, I can’t think of a single reason why the broader community should not want Uniswap deployed on Arbitrum. I would specifically request the Uniswap team and lead engineers - Hayden Adams, Noah Zinsmeister, Dan Robinson and anyone else involved - to let the community know if and how such a deployment could take place, and any roadblocks they may face. Such information would be helpful as we head towards an official vote. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.253132832080201
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Buckerino",
                    "index": "7",
                    "likes": "0",
                    "time": "26/05/2021-11:22:25",
                    "content": "I´d say its too early to decide for Arbitrum…Give it a few weeks time for the community to make it crystal clear which one will be the leader. Then this discussion would be on point. I´d say that I am hesitant to support this proposal until more data is available. I bet the Uniswap team is a little bit busy with Optimism already right now. The die has been cast…do you truly want to complicate it now? I mean, I think we are kind of getting a little bit ahead of ourselves. We have optimism coming up, Vitalik´s proposal, and now pleas for Arbitrum. Its turning into a bit of a mess at the time. So just to sum it up, Im NOT against it, but I´d prefer to wait just a little bit. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.321428571428571
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Donzo",
                    "index": "8",
                    "likes": "8",
                    "time": "26/05/2021-11:43:05",
                    "content": "V3 is built. Let’s deploy it where it makes sense. It makes a lot of sense to deploy it on Arbitrum. Let’s make this happen. To whom can we delegate to get this to a token vote? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Gid",
                    "index": "9",
                    "likes": "11",
                    "time": "26/05/2021-11:47:31",
                    "content": "    samueldashadrach:  There have been rumours that Uniswap investors such as Paradigm and a16z will be reluctant to deploy Uniswap to Arbitrum due to vested financial interest in Optimism. Deploying Uniswap to Arbitrum will quash these rumours and strongly signal that the there is no misalignment of goals amongst the various investors, funds, and individuals invested in Uniswap.   Agreed, is it imperative that Uniswap leads the way in it’s original goal of allowing anyone to swap in an uncensored, decentralised and permissionless system. If the judgements of large VC’s impedes on the governance because of their other interests, it would be devastating for the defi ecosystem as Uniswap is the poster-boy of defi and it will set a dangerous precedent for other protocols. If Arbitrum is sufficient to support the requirements of Uniswap I see no reason for it not to go ahead. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.567099567099567
                },
                {
                    "author_link": "https://gov.uniswap.org/u/altGuber",
                    "index": "10",
                    "likes": "6",
                    "time": "26/05/2021-11:48:22",
                    "content": "I understand the idea was to deploy Uniswap on Optimism, but the realty is Arbitrum is way ahead of Optimism and who knows how long will we have to wait until Optimism is ready. I strongly support deploying on Arbitrum Mainnet! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.152777777777779
                },
                {
                    "author_link": "https://gov.uniswap.org/u/mihal",
                    "index": "11",
                    "likes": "11",
                    "time": "26/05/2021-12:00:29",
                    "content": "Only 1,000 UNI is required to create a Snapshot proposal. Could be a good way to gauge community sentiment on this topic. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Hindel",
                    "index": "12",
                    "likes": "8",
                    "time": "26/05/2021-13:02:00",
                    "content": "I fully support this proposal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Danger",
                    "index": "13",
                    "likes": "2",
                    "time": "26/05/2021-13:08:04",
                    "content": "100% support this proposal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/andy8052",
                    "index": "14",
                    "likes": "6",
                    "time": "26/05/2021-13:37:52",
                    "content": "Good idea. Maybe we give it a full 24 hours and if sentiment is still highly in favor we move to a snapshot vote? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.016666666666667
                },
                {
                    "author_link": "https://gov.uniswap.org/u/samueldashadrach",
                    "index": "15",
                    "likes": "3",
                    "time": "26/05/2021-13:40:09",
                    "content": "Just adding this here for everyone’s reference. The current official procedure seems to be to do two sentiment polls with passing thresholds of 25k UNI and 50k UNI respectively, followed by a on-chain governance proposal. The governance proposal requires the proposer to have 10m UNI ($260 million at today’s prices) delegated to them. Passing the vote requires 40m UNI ($1 billion at today’s prices).     Community Governance Process Governance-Meta       This document is a suggested process for developing and advancing Uniswap Governance Proposals. It is a living document intended to be owned, modified and enforced by the Uniswap community.  Note: Autonomous proposals are a recent addition to Governance, not yet considered in this document. A process and policy around this proposal type should be created and implemented by the community.  Process:  Several governance venues available to Uniswap governance are mentioned, each serving its own part…     ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/rajivpoc",
                    "index": "16",
                    "likes": "3",
                    "time": "26/05/2021-15:38:45",
                    "content": "I’m supportive of this as well. As a tangible follow-up, it might make sense to deploy to the Arbitrum testnet and ensure everything is working as intended. AFAIK this is as simple as adding a new network in hardhat.config.ts, but please correct me if that isn’t the case. I understand the Uniswap Labs team needs to prioritize what it works on, and understand if they don’t currently have the bandwidth. That being said, I’m confident that the community (including myself) would be down to put in the technical work to make this happen and allay relevant concerns. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.86300505050505
                },
                {
                    "author_link": "https://gov.uniswap.org/u/dlehenky",
                    "index": "17",
                    "likes": "3",
                    "time": "26/05/2021-16:43:50",
                    "content": "Absolutely support this proposal. In my mind, Uniswap doesn’t have the luxury of waiting for OE to get it done. Arbitrum is a very strong and like-minded project, and there is very low friction to deploying to it. Let’s make it so! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.272222222222222
                },
                {
                    "author_link": "https://gov.uniswap.org/u/blaccrifle",
                    "index": "18",
                    "likes": "1",
                    "time": "26/05/2021-16:45:08",
                    "content": "I support this proposal. Like other commentators mentioned, Arbitrum will host UNI, whether a clone or a direct deployment. Furthermore, I don’t think that L2s should be thought of as competition, especially since Arbitrum does not have a direct token associated with it - the tech is neutral and developers should think of it like building an app for release on both Mac and Android. The end result is that the consumers and users of that tech benefit and create a synergistic effect. Also it’s worth considering that the low gas fees could lead to explosive TVL growth the way that BSC had explosive growth this year primarily due to low cost gas fees. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.15625
                },
                {
                    "author_link": "https://gov.uniswap.org/u/monet-supply",
                    "index": "19",
                    "likes": "9",
                    "time": "26/05/2021-17:05:18",
                    "content": "On chain governance votes should involve concrete actions rather than intention. So if the snapshot poll(s) resolve favorably, I think it would be worth taking time to plan a scope of work and estimate cost of development/deployment. We’ll then be able to hold a proposal to fund development and take any other actions needed to make this happen. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.03125
                },
                {
                    "author_link": "https://gov.uniswap.org/u/jmb-42",
                    "index": "20",
                    "likes": "0",
                    "time": "26/05/2021-17:30:00",
                    "content": "I have a crazy idea that could be used to concretely incentivize Uni v3 deployment onto Arbitrum: we use counterfactual address prediction and a custom UNI token locking contract to temporarily stake UNI treasury funds. The funds would only be able to be returned to the treasury once the pre-computed, counterfactual addresses of UNI on Arbitrum are verified programmatically. We would use a publicly claimed Uni deployer address and a custom written deployer contract (with the Uni deployer whitelisted on it) to achieve this trustless incentivizer. The funds would stay on L1 and only be unlocked by a valid L2ToL1Message from Arbitrum. We could use a multisig emergency backdoor in the locking contract to prevent permanently locking the funds, and we would make it so that the contract could only transfer back to the treasury to prevent theft. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.03125
                },
                {
                    "author_link": "https://gov.uniswap.org/u/BOR4",
                    "index": "21",
                    "likes": "3",
                    "time": "26/05/2021-17:41:32",
                    "content": "I think this is good idea. v3 is so efficient that I think there is enough liquidity in DeFi to make both Arbitrum and L1 deploys work. Additionally, arbitrage opportunities would probably boost up volume a little bit also. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.854166666666667
                },
                {
                    "author_link": "https://gov.uniswap.org/u/jmb-42",
                    "index": "22",
                    "likes": "1",
                    "time": "26/05/2021-17:51:16",
                    "content": "It might be worthwhile to note that this strategy could potentially violate contractual agreements or social obligations between interested parties, and it forces them to make a statement. By exploring a less game-theoretic approach, ie using a direct incentivizer such as a Uni locking contract, we alleviate the problems investors/builders might have in contradicting their own agreements. That’s all pure speculation, of course. I would imagine that it gives teams some freedom from the consequences of such a deployment, and it’s a really cool experiment in L2<>L1 interactions! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.894751082251082
                },
                {
                    "author_link": "https://gov.uniswap.org/u/N44G",
                    "index": "23",
                    "likes": "1",
                    "time": "26/05/2021-19:29:16",
                    "content": "I support this proposal. I’d love to try uniswap with cheap fee ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.25
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Noah",
                    "index": "24",
                    "likes": "12",
                    "time": "26/05/2021-19:58:16",
                    "content": "Thanks @andy8052 for this, and others for voicing your opinions! I’d like to briefly explain the mechanics of what an on-chain governance action to accomplish this proposal would look like. As explained in the V3 announcement post, the V3 source code may not be used in a commercial or production setting for up to 2 years after launch without appropriate permission. However, additional use grants can be made via changes to v3-core-license-grants.uniswap.eth. Since Uniswap governance owns uniswap.eth, it’s possible for governance to create a text record at this subdomain indicating that a V3 deployment on the Arbitrum Mainnet which appropriately gives control over the factory owner address to Uniswap governance is not in violation of the license. If this action passed, any deploy that met the criteria could become the canonical V3 on Arbitrum. It might be desirable to coordinate this deployment process with the Uniswap Labs team, so that (for example) the factory addresses on all canonical deploys would continue to be identical, as well as the Arbitrum team, for any technical issues that may arise. ",
                    "links": [
                        "https://etherscan.io/enslookup-search?search=uniswap.eth",
                        "https://github.com/Uniswap/uniswap-v3-core/blob/main/contracts/UniswapV3Factory.sol#L15",
                        "https://gov.uniswap.org/t/uni-v3-licensing-general-discussion/12620"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.805555555555556
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Vangoh",
                    "index": "25",
                    "likes": "0",
                    "time": "26/05/2021-21:18:44",
                    "content": "I support this proposal too. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/andy8052",
                    "index": "26",
                    "likes": "0",
                    "time": "26/05/2021-21:22:42",
                    "content": "Thanks Noah! And agreed that working with the team is important. This also will allow for the UI to support Arbitrum sooner rather than later. Unless I am mistaken, I think the technical requirements are actually pretty small here after we get a vote passed ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party is advertising proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.541666666666667
                },
                {
                    "author_link": "https://gov.uniswap.org/u/jcp",
                    "index": "27",
                    "likes": "2",
                    "time": "26/05/2021-21:32:03",
                    "content": "We can add support for this kind of proposal creation to the fish.vote UI if that’s helpful. It’s not hard for us to add support for formal governance proposals in the case that the author already has 10M delegate votes. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.864583333333334
                },
                {
                    "author_link": "https://gov.uniswap.org/u/eth4me",
                    "index": "28",
                    "likes": "1",
                    "time": "26/05/2021-22:15:45",
                    "content": "I 100% support this proposal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/BOR4",
                    "index": "29",
                    "likes": "4",
                    "time": "26/05/2021-23:01:42",
                    "content": "Just a quick write up on what we know about this proposal What is Arbitrum? L2 scaling solution based on rollups (link) Why Arbitrum? Initial idea by the Uniswap core team was to wait for Optimism to be ready and launch Uniswap v3 there (Optimism is also L2 scaling based on rollups). Arbitrum launches May 28th and community started the incentive to deploy Uniswap v3 there. Why rollups? Rollups will allow users to use Uniswap in environment where fees will be much lower than they are on Ethereum chain (L1) Please explain rollups in 2 minutes, preferably with pictures sure: https://youtu.be/BgCgauWVTs0?t=452 How can Uniswap be deployed to Arbitrum? Deploy Uniswap v3 to Arbitrum Mainnet - #24 by Noah Will Arbitrum deployment use liquidity from pools on Ethereum chain? No. It is separate deployment which means separate pools. How big of a performance upgrade can we expect?* Not an expert on this topic but based on my research rollups can scale around 100x if all transactions in a rollup are simple payments. However since average Uniswap transaction is ~5x more gas hungry than a simple payment we can probably expect around 15-20x? (I would love someone more knowledgeable to answer this) How much lower will the fees be?* Assuming you already transferred some of your funds to L2 fees can be as low as 10% of those on L1. However, “bridging” liquidity in itself to any L2 is quite gas hungry. Bridging liquidity to L2?* Yes. Assuming v3 is deployed on Arbitrum, in order for your to use that deployment you will have to bridge some of your funds to Arbitrum. Only then you will be able to use Arbitrum deployment. How do I get my funds back to the chain?* You have to bridge it back. Rollups are notorious for this process being pretty slow. Not sure what is expected delay for Arbitrum. EDIT1: joined Offchain Labs community to try and find out some more details about how Arbitrum deployment would potentially look for an end user. Couple interesting details Delay for getting your funds from Arbitrum back to L1 chain is 7 days Gas cost for getting ETH onto Arbitrum is 70k gas. That is gas cost of ~0.5 swaps on the L1 (Uniswap v3 swap is around 120k-150k gas) *I would love if someone could expand more on last 4 questions. I think that’d be very valuable info. I just know the basics. Feel free to tell me correct answers and I’ll update. I think these are the interesting questions an average user might have. ",
                    "links": [
                        "https://community.optimism.io/docs/#for-casually-interested-readers",
                        "https://youtu.be/BgCgauWVTs0?t=452",
                        "https://gov.uniswap.org/t/deploy-uniswap-v3-to-arbitrum-mainnet/12451/24"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.883838383838383
                },
                {
                    "author_link": "https://gov.uniswap.org/u/jmb-42",
                    "index": "30",
                    "likes": "0",
                    "time": "27/05/2021-01:02:14",
                    "content": "Thanks for clarifying. It appears that the subdomain v3-core-license-grants has not yet been set on uniswap.eth, so the proposal would need to first do this before setting the text record at that subdomain. I made an initial implementation of this proposal here:    github.com    uclablockchain/UniLicenseProposal Grant a Uniswap License Proposal to deploy V3 onto Arbitrum      Important to note that I just copied your words directly for the license grant, and I imagine it would need to be updated to be more explicit and professional. This is incomplete in terms of the unit tests, but I can get back to it tomorrow sometime. ",
                    "links": [
                        "https://github.com/uclablockchain/UniLicenseProposal"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.96875
                },
                {
                    "author_link": "https://gov.uniswap.org/u/xingkongampl",
                    "index": "31",
                    "likes": "1",
                    "time": "27/05/2021-01:26:54",
                    "content": "同意，尽快部署在l2网络上，可以增加uniswap的竞争力。 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/CWhite",
                    "index": "32",
                    "likes": "0",
                    "time": "27/05/2021-03:32:52",
                    "content": "I support strongly.  Arbitrum Mainnet V3 rollout ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.166666666666667
                },
                {
                    "author_link": "https://gov.uniswap.org/u/AndyQ-hoo",
                    "index": "33",
                    "likes": "0",
                    "time": "27/05/2021-06:25:08",
                    "content": "I support this proposal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/jmb-42",
                    "index": "34",
                    "likes": "1",
                    "time": "27/05/2021-07:18:19",
                    "content": "Hi Noah. I nearly wrote the proposal to accomplish this task, but there’s a slight problem. The uniswap governance cannot actually control the uniswap.eth ENS name, because it is owned by an EOA: 0x42D44cC7435CCF5DBDfD59e01fe9f4d306365C7A. This EOA needs to do one of several things to give uniswap governance control of the uniswap.eth name, so that the governance can create the v3-core-license-grants.uniswap.eth subdomain:  call setApprovalForAll(...) on ENSRegistryWithFallback   This would make uniswap timelock contract an operator of the uniswap.eth node, allowing it to create subdomains. Alternatively,  call setSubnodeRecord(...) directly from the EOA to create the subdomain, instead of requiring the governance to do so  This would need to be followed up with,  call setAuthorisation(...) on ENSPublicResolver2, setting the uni timelock as authorized on the newly created v3-core-license-grants.uniswap.eth subdomain.  As it is, the uniswap governance has no power to issue licenses as detailed in V3 announcement post. In other words, the uniswap license is currently centralized by this EOA! I’ve since updated the proposal repository. Take note of this line, which is the only way I could get the proposal to execute. It took me quite a while to dig through etherscan, ENS, etc. to solve this problem. ",
                    "links": [
                        "https://etherscan.io/address/0x00000000000C2E074eC69A0dFb2997BA6C7d2e1e#writeContract",
                        "https://etherscan.io/address/0x4976fb03c32e5b8cfe2b6ccb31c09ba78ebaba41#writeContract",
                        "https://uniswap.org/blog/uniswap-v3/#license",
                        "https://github.com/uclablockchain/UniLicenseProposal/blob/main/test/UniLicenseProposal.test.js#L120"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.222348484848485
                },
                {
                    "author_link": "https://gov.uniswap.org/u/wazmm999",
                    "index": "35",
                    "likes": "0",
                    "time": "27/05/2021-09:07:14",
                    "content": "I can not agree more ;  I support this proposal.  how can I  to take part in  voting? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/belmore",
                    "index": "36",
                    "likes": "10",
                    "time": "27/05/2021-13:49:02",
                    "content": "I brought this up on twitter, but want to raise it here. If we are going to as a community support a brand new platform that is not battle-tested, we should be:  EXTREMELY confident in the security of the platform. Given that confidence, we should put the weight of our bug bounty programs behind it by extending it such that if there is a bug in Arbitrum, that results in loss of LP funds, that is eligible for the full reward ($500k, soon to be $1.5m I believe).  One of Uniswap’s benefits is their exceptional track record. It falls on the community to ensure that an underlying platform we deploy on isn’t an extreme risk for general users. I imagine a lot of people in this thread are both UNI holders and uniswap exchange users. As uni holders, we have an obligation to make the best decisions possible for the broad set of users. This includes evaluating the safety of a particular platform. The only thing worse than not deploying is deploying and people losing serious amounts of money. I have faith in the Arbitrum team’s execution, but it won’t be battle-tested for some time. They have undergone audit, but it is a very complex, built from scratch, L2 node + contracts. Anyway, food for thought ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.4012073863636365
                },
                {
                    "author_link": "https://gov.uniswap.org/u/InternetJohnny",
                    "index": "37",
                    "likes": "0",
                    "time": "27/05/2021-14:53:57",
                    "content": "Absolutely agree with this. Uniswap’s untarnished reputation is priceless, and we should make sure that any decision made that has the potential to change this should be scrutinized (I say this in the best possible way), in order to preserve this reputation ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 7.25
                },
                {
                    "author_link": "https://gov.uniswap.org/u/haydenadams",
                    "index": "38",
                    "likes": "3",
                    "time": "27/05/2021-15:03:16",
                    "content": " The uniswap governance cannot actually control the uniswap.eth ENS name, because it is owned by an EOA: 0x42D44cC7435CCF5DBDfD59e01fe9f4d306365C7A .  Not quite true! We transferred ownership of uniswap.eth to timelock in this transaction soon after governance launch. The controller was still set to the EOA but the owner can change the controller at any time (while the controller has no ability to change the owner). Thanks for pointing this out, was still an oversight. The current controller EOA just transferred its role to timelock to save needing to add this step to a gov vote. ",
                    "links": [
                        "https://etherscan.io/tx/0x6255c3c4f724748feb75d40639bec7ff8145ac0a41bf3ee90a8ebab262d60c49"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.796875
                },
                {
                    "author_link": "https://gov.uniswap.org/u/jmb-42",
                    "index": "39",
                    "likes": "0",
                    "time": "27/05/2021-15:49:25",
                    "content": "I did see that it was transferred a while ago. Strangely enough, the problem was that ENSRegistry didn’t update its owner variable, despite the domain having been transferred according to ENSPublicResolver2, so the governance couldn’t make the subdomain until you transferred the controller to the governance. I think it was a weird quirk of ENS that no one noticed until now. It is fixed now, thanks! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 4.8125
                },
                {
                    "author_link": "https://gov.uniswap.org/u/EvilCryptKeeper",
                    "index": "40",
                    "likes": "0",
                    "time": "28/05/2021-00:00:04",
                    "content": "I’m not sure if I’m too late to have my say but I fully support ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.625
                },
                {
                    "author_link": "https://gov.uniswap.org/u/jmb-42",
                    "index": "41",
                    "likes": "0",
                    "time": "28/05/2021-17:51:02",
                    "content": "    haydenadams:  The controller was still set to the EOA but the owner can change the controller at any time (while the controller has no ability to change the owner).   This part just clicked for me. I was wrong, you were right! I get it now, the path to issue a license would begin with transferring the controller, then creating the subdomain, then setting a text record. Out of curiosity, why wasn’t the license subdomain made before setting the controller to governance though? This still has to be done by governance. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.642857142857143
                },
                {
                    "author_link": "https://gov.uniswap.org/u/MaaikeD1",
                    "index": "42",
                    "likes": "0",
                    "time": "30/05/2021-08:23:32",
                    "content": "I support the proposal ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/kaibakker",
                    "index": "43",
                    "likes": "0",
                    "time": "30/05/2021-11:33:00",
                    "content": "Will the Uni labs team be responsible for deployment on Atbitrum once governance deploys or and accepts the proposal? Or should we write out a grant. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Hindel",
                    "index": "44",
                    "likes": "0",
                    "time": "30/05/2021-15:24:38",
                    "content": "Feels good to see some governance finally happening with Uniswap ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Buckerino",
                    "index": "45",
                    "likes": "3",
                    "time": "03/06/2021-19:14:40",
                    "content": "Whats the current state of this proposal? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/moonrocksrodeo",
                    "index": "48",
                    "likes": "0",
                    "time": "26/08/2021-20:40:19",
                    "content": "I support this proposal. Whether Arbitrum or Optimism, increasing optionality for UNIv3 and is good for the community ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Buckerino",
                    "index": "49",
                    "likes": "0",
                    "time": "28/08/2021-16:05:46",
                    "content": "Just to update folks who might not know: Arbitrum should be deployed on the 31st so…presumably if V3 is already ready for it,  we might see the launch on the same day as well. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/willhennessy",
                    "index": "50",
                    "likes": "4",
                    "time": "29/08/2021-20:12:37",
                    "content": "Uniswap v3 was deployed on Arbitrum mainnet on June 2 in response to the community snapshot pool. Here is the commit for reference with contract addresses. Offchain Labs (the team building Arbitrum) has so far maintained a whitelist limiting which wallets are allowed to transact on Arbitrum mainnet. As you mentioned, Offchain Labs announced plans to lift that whitelist by the end of August so all users can transact on Arbitrum.  Uniswap v3 is ready and waiting  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Aslam0011",
                    "index": "51",
                    "likes": "0",
                    "time": "01/09/2021-00:13:35",
                    "content": "I strongly support this proposal ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.166666666666667
                },
                {
                    "author_link": "https://gov.uniswap.org/u/B-0Xbluewhale",
                    "index": "52",
                    "likes": "0",
                    "time": "01/12/2021-14:18:36",
                    "content": "I agree with this proposal, I think it can provide a lot of convenience. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Buckerino",
                    "index": "53",
                    "likes": "0",
                    "time": "01/12/2021-14:23:14",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "67"
}