{
    "poll_list": [
        {
            "id": "QmWbgzHJ8nK2TDaj6LF6BxAMPahy97dMmbbU5kRBw1QkXt",
            "title": "Consensus Check: Upgrade Governance Contract to Governor Bravo",
            "discussion": "",
            "body": "Upgrade Uniswap’s current governance contract from Governor Alpha to Governor Bravo to improve governance upgradability and protocol safety. \n\nSpecifically, we plan on using Compound’s Governor Bravo contract rather than Open Zeppelin's reimplementation. The reasoning for doing so can be found under the \"Implementation\" section of the [proposal](https://gov.uniswap.org/t/consensus-check-upgrade-governance-contract-to-governor-bravo/13707).\n\nThe contracts have been deployed to Ropsten for the community to review. Links can be found below:\n[Governor Bravo Delegator](https://ropsten.etherscan.io/address/0x15df15caad12adaa03949014ba5cc49a84803d0f#code)\n[Governor Bravo Delegate](https://ropsten.etherscan.io/address/0xD8bf60dfC5115F6cB99bb50502346E7b863800f1#code)\n[Github for contracts](https://github.com/gettty/uniswap-gov)",
            "choices": [
                "Upgrade to Governor Bravo",
                "Do not upgrade to Governor Bravo"
            ],
            "scores": [
                19647554.394415952,
                862.9909052313448
            ],
            "start": 1628510400,
            "end": 1628899200,
            "snapshot": "12973703",
            "state": "closed",
            "author": "0x070341aA5Ed571f0FB2c4a5641409B1A46b4961b",
            "space": {
                "id": "uniswap",
                "name": "Uniswap"
            }
        },
        {
            "id": "QmScNLeajiF2hQh1z9DYqTFKGgrRhHwrHisV4ynmDEQwxH",
            "title": "Temperature Check: Upgrade Governance Contract to Governor Bravo",
            "discussion": "",
            "body": "Upgrade Uniswap’s current governance contract from Governor Alpha to Governor Bravo because this will offer a number of benefits.",
            "choices": [
                "Upgrade to Governor Bravo",
                "Do not upgrade to Governor Bravo"
            ],
            "scores": [
                8358374.097954816,
                378.82371370807414
            ],
            "start": 1627358400,
            "end": 1627704000,
            "snapshot": "12904523",
            "state": "closed",
            "author": "0x070341aA5Ed571f0FB2c4a5641409B1A46b4961b",
            "space": {
                "id": "uniswap",
                "name": "Uniswap"
            }
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/temperature-check-upgrade-governance-contract-to-governor-bravo/13610",
            "title": "Temperature Check: Upgrade Governance Contract to Governor Bravo ",
            "index": 13610,
            "category": [
                "Temperature Check"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/pennblockchain",
                    "index": "1",
                    "likes": "14",
                    "time": "27/07/2021-02:11:00",
                    "content": " TL;DR: Upgrade Uniswap’s current governance contract from Governor Alpha to Governor Bravo because this will offer a number of benefits.  Summary and Motivation: Co-written with Getty Hill (@Getty), Eddy Lee (@elee), Yuan Han Li (@yuan-han-li), John Wang (@johnwang), and Ali Khambati (@alikhambati) Governor Alpha, the current governance framework, is a great start; however, in light of Compound’s upgrade to Governor Bravo, it would be prudent for Uniswap to consider a similar migration due to Governor Bravo’s strong value proposition:   Native upgradeability: Under Governor Alpha, changes to governance parameters require deploying a new contract and completely migrating to a new address. This is particularly damaging to governance participation as it introduces downtime and asynchronicity. Many governance tools and custodians use factory contracts which point to a specific contract address, meaning parties must manually upgrade their infrastructure every time governance parameters are changed under Governor Alpha. This includes tools for creating autonomous proposals like fish.vote; front-ends such as Tally, Sybil, and Boardroom which aggregate and display governance results for various protocols; and professional custodians which are used by large token holders, delegates, and community members. Enabling a static contract address that has proxy upgradability patterns is paramount for maximizing participation, and maintaining an open and secure governance process.   Voting reason string: Governor Bravo gives voters the opportunity to add free-form comments (text strings) along with their on-chain votes. Not only does this increase the transparency around the rationale people have behind their votes, but it also facilitates more in-depth and nuanced discussion.   New ‘abstain’ voting option: Governor Bravo enables voters to formally abstain rather than forcing them to choose between voting yes/no or not voting at all. This will give voters more flexibility and also increase transparency into delegate behavior.   Proposal numbers won’t reset: Under Governor Alpha, any upgrades to the contract resets the proposal number schema. Notice that ‘Proposal 0.4’ (which resulted in deployment and migration to a new Governor Alpha contract due to modifying the proposal submission threshold parameter) caused the following on-chain proposal from @HarvardLawBFI to be numbered ‘Proposal 1.1’. Under Governor Bravo, this would not be an issue and proposal numbers would be continuous because the contract would be maintained at a single address.   Proposal Cancellation: Bravo allows user-directed cancellations enabling erroneous proposals to be canceled if need be (rather than forcing people to vote no/abstain).   Review Period: Governor Bravo allows governance to include a review/analysis period. Currently, Compound uses a 13140 block (~2-day) review period that allows holders to review the proposal. This means that users will have 2-days to prepare for voting (e.g., remove UNI from Aave), unlike Governor Alpha which instantly snapshots users’ voting power. A review period substantially improves the accessibility and safety of the governance process.    Snapshot: The Snap Poll will be live for 96 hours (4 days) from July 27th at 00:00 EDT. If the poll passes with a minimum of 25,000 UNI in support, this proposal will move forward to the consensus check phase. A link to our snapshot proposal: Snapshot  Next Steps: If the Temperature Check Snapshot proposal passes @Getty and @elee will do the necessary development work to migrate Uniswap from Governor Alpha to Bravo. The deployment and details will be included in the consensus check for the community to review.  Resource links:  Governor Bravo Development - Protocol Development - Compound Community Forum Understanding Governor Bravo. A review of key changes versus… | by monetsupply | Tally | Jul, 2021 | Medium Compound | Proposal Detail #42 Compound | Proposal Detail #43  ",
                    "links": [
                        "https://twitter.com/yesimeddy",
                        "https://twitter.com/yuan_han_li",
                        "https://twitter.com/j0hnwang",
                        "https://twitter.com/alikhambati1",
                        "https://www.fish.vote/",
                        "https://www.withtally.com/",
                        "https://sybil.org/#/delegates/uniswap",
                        "https://app.boardroom.info/",
                        "https://app.uniswap.org/#/vote/0/4",
                        "https://app.uniswap.org/#/vote/1/1",
                        "https://snapshot.org/#/uniswap/proposal/QmScNLeajiF2hQh1z9DYqTFKGgrRhHwrHisV4ynmDEQwxH",
                        "https://www.comp.xyz/t/governor-bravo-development/942",
                        "https://medium.com/tally-blog/understanding-governor-bravo-69b06f1875da",
                        "https://compound.finance/governance/proposals/42",
                        "https://compound.finance/governance/proposals/43",
                        "https://gov.uniswap.org/t/consensus-check-upgrade-governance-contract-to-governor-bravo/13707"
                    ],
                    "GPT-summary": "The post proposes upgrading Uniswap's current governance contract from Governor Alpha to Governor Bravo, citing the latter's benefits such as native upgradeability, voting reason string, new 'abstain' voting option, proposal numbers that won't reset, proposal cancellation, review period, and more. The post also includes resource links and a snapshot poll for community feedback. The proposal is explained in detail by the authors, while third parties offer constructive criticism, ask questions, and extend to the proposal.",
                    "GPT-proposal-categories": [
                        "Smart contract updates",
                        "Community and engagement",
                        "Grants, Funding and resource allocation",
                        "Privacy, Security and risk management",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.6046858546858545
                },
                {
                    "author_link": "https://gov.uniswap.org/u/dennisonb",
                    "index": "2",
                    "likes": "4",
                    "time": "27/07/2021-19:10:05",
                    "content": "Hello folks, Dennison from Tally here. We strongly support this proposal. It follows in the steps of Compound, allows governance to be more flexible and supports upgrades without proposal renumbering. We also would like to suggest that the starting number of the new Bravo Governance be set to reflect all the past proposals, including the failed proposal. The Uniswap numbering convention of 0.x and 1.x is not standard and is not used in any of the other Compound-style governances in the ecosystem. Additionally, despite the failed proposal, well, failing, it still is a part of the official on-chain record of Uniswap governance and should not be, in our opinion omitted, as it’s participants and ballots still form part of the large picture of Uniswap. Regardless, upgrading to Bravo is in our opinion the right way to go and we are looking forward to it! One additional option that should be considered at this point is, OpenZeppelin will be releasing a complete set of Compound Compatible Governance contracts in a soon-to-be-released version of the OpenZeppelin contracts. Considering OpenZeppelin is the leader of standards in the Ethereum ecosystem, it might be worth while to wait to evaluate the OpenZeppelin solutions to see if they might provide an even better solution. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.416473407544836
                },
                {
                    "author_link": "https://gov.uniswap.org/u/frangio",
                    "index": "3",
                    "likes": "4",
                    "time": "27/07/2021-19:37:29",
                    "content": "Thanks for the mention @dennisonb. This is Francisco from OpenZeppelin. We’re indeed about to publish a system of Governor contracts compatible with GovernorBravo. A couple of benefits that might motivate this choice:  Modular design allows customizing Governor behavior without forking the code. Ability to use OpenZeppelin Upgrades tooling to ensure safety of upgrades and aid development. GovernorBravo uses a custom proxy that is not compatible.  The current version of the code can be found in the contracts/governance directory in the OpenZeppelin Contracts repo, but please note it is not released yet. (Can’t include links due to new account.) Happy to answer any further questions.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.842803030303029
                },
                {
                    "author_link": "https://gov.uniswap.org/u/pennblockchain",
                    "index": "4",
                    "likes": "2",
                    "time": "27/07/2021-20:34:04",
                    "content": "Hey Dennison, thank you very much for your feedback, we will be sure to number the proposal with #7 if it goes to a formal vote (that is, assuming nothing else gets proposed on-chain in the meantime). @frangio, thank you also for sharing more about what you guys are working on at OpenZeppelin. We have DMed you on Twitter to open up a line and so we can chat more about OpenZeppelin’s solutions. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 6.76
                },
                {
                    "author_link": "https://gov.uniswap.org/u/jcp",
                    "index": "5",
                    "likes": "0",
                    "time": "29/07/2021-13:35:11",
                    "content": "I’m in support of upgrading to bravo but agree with Dennison’s point about waiting to see what the Open Zeppelin contracts look like. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Getty",
                    "index": "6",
                    "likes": "2",
                    "time": "31/07/2021-18:40:42",
                    "content": "After talking with the OpenZeppelin guys about their governance contract, we think using Governor Bravo makes the most sense at this stage. Their governance contract takes a more simple approach that can include all Bravo functionality but does not by default. The contract uses similar logic, but the code is new. It has gone through an internal audit and review process but still needs to go through an external audit. Github Docs More info For safety and simplicity, we think using Governor Bravo is the best decision right now. Bravo has already undergone an audit by OpenZeppelin and is widely used. We can always change/upgrade at a future date if OZ’s Governance contract introduces new features/functionality the community is interested in. ",
                    "links": [
                        "https://docs.openzeppelin.com/contracts/4.x/api/governance",
                        "https://openzeppelin.notion.site/Comparing-Compound-Governor-to-OpenZeppelin-Governor-2-10d0fdcf61ba476fae492b295822ee13",
                        "https://blog.openzeppelin.com/compound-governor-bravo-audit/"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 6.145871985157699
                },
                {
                    "author_link": "https://gov.uniswap.org/u/spalladino",
                    "index": "7",
                    "likes": "0",
                    "time": "02/08/2021-21:07:36",
                    "content": "Thanks for sharing @Getty. Santiago from OpenZeppelin here. As I’ve mentioned over DM, we’d love to see Uniswap adopting the contract we’ve been working on - we’re committed to maintaining it and adding new features requested by the community. But we understand that going with a more battle-tested and audited (ironically, by our own team) contract like Bravo makes sense for Uniswap. However, one thing I’d add is that migrating from Bravo to our Governance contract in the future (in case you want to leverage new features) may require another redeploy, rather than an upgrade, since contract storage is not compatible. This would diminish the benefit of moving right now to Bravo, since native upgradeability would only be usable for moving to compatible Bravo implementations. Now, I’m curious if having our Governor externally audited could change the current decision. If so, can I ask you about the timeline you have in mind for migrating? So we know whether this migration is intended to happen in the immediate future, or it is possible to get an external firm to audit our contract in time. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.643262987012987
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Getty",
                    "index": "8",
                    "likes": "1",
                    "time": "03/08/2021-02:06:45",
                    "content": "For the sake of argument. Say you have two choices.  Governor Bravo OZ’s Governance contract.  Where OZ’s Governance contract has been fully audited and is ready right now and has all of the Bravo functionality. I would choose Bravo because it is the tried and tested governance contract. If there are two contracts with the same functionality, but one is common, and the other hasn’t been used, then it is a no-brainer to choose the one in use. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.060714285714286
                },
                {
                    "author_link": "https://gov.uniswap.org/u/spalladino",
                    "index": "9",
                    "likes": "1",
                    "time": "03/08/2021-12:54:56",
                    "content": "Got it, and makes sense from a security perspective! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        },
        {
            "thread_link": "https://gov.uniswap.org/t/governance-proposal-8-upgrade-governance-contract-to-compounds-governor-bravo/13835",
            "title": "Governance Proposal 8 - Upgrade Governance Contract to Compound's Governor Bravo ",
            "index": 13835,
            "category": [
                "Proposal Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/pennblockchain",
                    "index": "1",
                    "likes": "1",
                    "time": "20/08/2021-03:23:34",
                    "content": " Previous Discussion: Temperature Check | Snapshot Consensus Check | Snapshot  TL;DR: Upgrade Uniswap’s current governance contract from Governor Alpha to Governor Bravo to improve governance upgradability and protocol safety. On-Chain Proposal  Summary and Motivation: Co-written with Getty Hill (@Getty), Eddy Lee  (@elee), Yuan Han Li  (@yuan-han-li), John Wang  (@johnwang), and Ali Khambati  (@alikhambati) Governor Alpha, the current governance contract used, was a great start, but in light of Compound’s and other protocols upgrade to Governor Bravo, Uniswap should migrate given Bravo’s additional safety benefits and upgradability.   Native upgradeability: Under Governor Alpha, changes to governance parameters require deploying a new contract and completely migrating to a new address. This is particularly damaging to governance participation as it introduces downtime and asynchronicity. Many governance tools and custodians use factory contracts which point to a specific contract address, meaning parties must manually upgrade their infrastructure every time governance parameters are changed under Governor Alpha. This includes tools for creating autonomous proposals like fish.vote ; front-ends such as Tally , Sybil, and Boardroom  which aggregate and display governance results for various protocols; and professional custodians which are used by large token holders, delegates, and community members. Enabling a static contract address that has proxy upgradability patterns is paramount for maximizing participation, and maintaining an open and secure governance process.   Voting reason string: Governor Bravo gives voters the opportunity to add free-form comments (text strings) along with their on-chain votes. Not only does this increase the transparency around the rationale people have behind their votes, but it also facilitates more in-depth and nuanced discussion.   New ‘abstain’ voting option: Governor Bravo enables voters to formally abstain rather than forcing them to choose between voting yes/no or not voting at all. This will give voters more flexibility and also increase transparency into delegate behavior.   Proposal numbers won’t reset: Under Governor Alpha, any upgrades to the contract resets the proposal number schema. Notice that ‘Proposal 0.4’ (which resulted in deployment and migration to a new Governor Alpha contract due to modifying the proposal submission threshold parameter) caused the following on-chain proposal from @HarvardLawBFI to be numbered ‘Proposal 1.1’ . Under Governor Bravo, this would not be an issue and proposal numbers would be continuous because the contract would be maintained at a single address.   Proposal Cancellation: Bravo allows user-directed cancellations enabling erroneous proposals to be canceled if need be (rather than forcing people to vote no/abstain).   Review Period: Governor Bravo allows governance to include a review/analysis period. Currently, Compound uses a 13140 block (~2-day) review period that allows holders to review the proposal. This means that users will have 2-days to prepare for voting (e.g., remove UNI from Aave), unlike Governor Alpha which instantly snapshots users’ voting power. A review period substantially improves the accessibility and safety of the governance process.    Implementation: After speaking with the OpenZeppelin team about their reimplementation of Governor Bravo, we think using Compound’s Governor Bravo contract instead makes the most sense at this stage. Although Open Zeppelin’s Governor contract takes a simpler approach that can include all Bravo functionality, it does not do so by default. The contract uses similar logic, but the code is new. It has gone through an internal audit and review process but still needs to go through an external audit. For the safety and simplicity of Uniswap, we think using Compound’s Governor Bravo contract is the best decision for the time being. Compound’s Governor contract has already undergone an audit by OpenZeppelin and has been widely used. We can always change/upgrade to Open Zeppelin Governor contract at a future date if their contract introduces new features/functionality the community is interested in. More details on OpenZeppelin’s code can be found here: Github Docs More info As mentioned in the previous Consensus Check, we have deployed the contract on the Ropsten test net for the community to review our code: Governor Bravo Delegator Governor Bravo Delegate Github for contracts NB: The _initiate function has been slightly modified to take an initial proposal number as an input rather than pulling it from Governor Alpha. This way Uniswap can resume proper proposal numbering.  Resource links:   Governor Bravo Development - Protocol Development - Compound Community Forum    Understanding Governor Bravo. A review of key changes versus… | by monetsupply | Tally | Jul, 2021 | Medium    Compound | Proposal Detail #42    Compound | Proposal Detail #43   ",
                    "links": [
                        "https://gov.uniswap.org/t/consensus-check-upgrade-governance-contract-to-governor-bravo/13707",
                        "https://snapshot.org/#/uniswap/proposal/QmWbgzHJ8nK2TDaj6LF6BxAMPahy97dMmbbU5kRBw1QkXt",
                        "https://www.withtally.com/governance/uniswap/proposal/8",
                        "https://twitter.com/getty_hill",
                        "https://twitter.com/yesimeddy",
                        "https://twitter.com/yuan_han_li",
                        "https://twitter.com/j0hnwang",
                        "https://twitter.com/alikhambati1",
                        "https://www.fish.vote/",
                        "https://www.withtally.com/",
                        "https://sybil.org/#/delegates/uniswap",
                        "https://app.boardroom.info/",
                        "https://app.uniswap.org/#/vote/0/4",
                        "https://app.uniswap.org/#/vote/1/1",
                        "https://blog.openzeppelin.com/compound-governor-bravo-audit/",
                        "https://github.com/OpenZeppelin/openzeppelin-contracts/tree/master/contracts/governance",
                        "https://docs.openzeppelin.com/contracts/4.x/api/governance",
                        "https://openzeppelin.notion.site/Comparing-Compound-Governor-to-OpenZeppelin-Governor-2-10d0fdcf61ba476fae492b295822ee13",
                        "https://ropsten.etherscan.io/address/0x15df15caad12adaa03949014ba5cc49a84803d0f#code",
                        "https://ropsten.etherscan.io/address/0xD8bf60dfC5115F6cB99bb50502346E7b863800f1#code",
                        "https://github.com/gettty/uniswap-gov",
                        "https://www.comp.xyz/t/governor-bravo-development/942",
                        "https://medium.com/tally-blog/understanding-governor-bravo-69b06f1875da",
                        "https://compound.finance/governance/proposals/42",
                        "https://compound.finance/governance/proposals/43"
                    ],
                    "GPT-summary": "The post is a governance proposal for Uniswap to upgrade its current governance contract from Governor Alpha to Governor Bravo. The proposal explains the benefits of Governor Bravo, such as native upgradeability, voting reason string, new 'abstain' voting option, proposal cancellation, and review period. The post also mentions the implementation of the proposal and provides resource links for further information. The post can be categorized as the author of the proposal explaining the proposal, with some constructive criticism and auditing/reviewing of the proposal by third parties.",
                    "GPT-proposal-categories": [
                        "Smart contract updates",
                        "Governance and engagement",
                        "Grants, Funding and resource allocation",
                        "Privacy, Security and risk management",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.608433233433233
                },
                {
                    "author_link": "https://gov.uniswap.org/u/DrPog",
                    "index": "2",
                    "likes": "0",
                    "time": "28/11/2021-02:49:17",
                    "content": "    pennblockchain:  Review Period: Governor Bravo allows governance to include a review/analysis period. Currently, Compound uses a 13140 block (~2-day) review period that allows holders to review the proposal. This means that users will have 2-days to prepare for voting (e.g., remove UNI from Aave), unlike Governor Alpha which instantly snapshots users’ voting power. A review period substantially improves the accessibility and safety of the governance process   Can someone clarify if the Governor Bravo 2-day review period lengthens the voting period by two days or actually delays the snapshot of voters’ voting power by twos days? If it’s the former, why does this text mention that Governor Alpha instantly snapshots users’ voting power? If it’s the latter, doesn’t a 2-day delay open us up to opportunistic edge case exploitation as described in Scenario 1 of the Uniswap Docs Adversarial Circumstances section? Thank you. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal explaining proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Getty",
                    "index": "3",
                    "likes": "0",
                    "time": "30/11/2021-04:25:04",
                    "content": "The 2-day review period doesn’t snapshot users’ votes. The snapshot occurs at the beginning of the voting window. So 2-days passes where users can move their coins and analyze the proposal, then voting begins. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.0
                }
            ]
        },
        {
            "thread_link": "https://gov.uniswap.org/t/consensus-check-upgrade-governance-contract-to-governor-bravo/13707",
            "title": "Consensus Check: Upgrade Governance Contract to Governor Bravo ",
            "index": 13707,
            "category": [
                "Consensus Check"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/pennblockchain",
                    "index": "1",
                    "likes": "7",
                    "time": "06/08/2021-21:08:20",
                    "content": " TL;DR: Upgrade Uniswap’s current governance contract from Governor Alpha to Governor Bravo to improve governance upgradability and protocol safety. Temperature Check Temperature Check Snapshot Poll  Summary and Motivation: Co-written with Getty Hill (@Getty), Eddy Lee  (@elee), Yuan Han Li  (@yuan-han-li), John Wang  (@johnwang), and Ali Khambati  (@alikhambati) Governor Alpha, the current governance contract used, was a great start, but in light of Compound’s and other protocols upgrade to Governor Bravo, Uniswap should migrate given Bravo’s additional safety benefits and upgradability.   Native upgradeability: Under Governor Alpha, changes to governance parameters require deploying a new contract and completely migrating to a new address. This is particularly damaging to governance participation as it introduces downtime and asynchronicity. Many governance tools and custodians use factory contracts which point to a specific contract address, meaning parties must manually upgrade their infrastructure every time governance parameters are changed under Governor Alpha. This includes tools for creating autonomous proposals like fish.vote ; front-ends such as Tally , Sybil, and Boardroom  which aggregate and display governance results for various protocols; and professional custodians which are used by large token holders, delegates, and community members. Enabling a static contract address that has proxy upgradability patterns is paramount for maximizing participation, and maintaining an open and secure governance process.  Voting reason string: Governor Bravo gives voters the opportunity to add free-form comments (text strings) along with their on-chain votes. Not only does this increase the transparency around the rationale people have behind their votes, but it also facilitates more in-depth and nuanced discussion.  New ‘abstain’ voting option: Governor Bravo enables voters to formally abstain rather than forcing them to choose between voting yes/no or not voting at all. This will give voters more flexibility and also increase transparency into delegate behavior.  Proposal numbers won’t reset: Under Governor Alpha, any upgrades to the contract resets the proposal number schema. Notice that ‘Proposal 0.4’ (which resulted in deployment and migration to a new Governor Alpha contract due to modifying the proposal submission threshold parameter) caused the following on-chain proposal from @HarvardLawBFI to be numbered ‘Proposal 1.1’ . Under Governor Bravo, this would not be an issue and proposal numbers would be continuous because the contract would be maintained at a single address.  Proposal Cancellation: Bravo allows user-directed cancellations enabling erroneous proposals to be canceled if need be (rather than forcing people to vote no/abstain).  Review Period: Governor Bravo allows governance to include a review/analysis period. Currently, Compound uses a 13140 block (~2-day) review period that allows holders to review the proposal. This means that users will have 2-days to prepare for voting (e.g., remove UNI from Aave), unlike Governor Alpha which instantly snapshots users’ voting power. A review period substantially improves the accessibility and safety of the governance process.   Implementation: After speaking with the OpenZeppelin team about their reimplementation of Governor Bravo, we think using Compound’s Governor Bravo contract instead makes the most sense at this stage. Although Open Zeppelin’s contract takes a simpler approach that can include all Bravo functionality, it does not do so by default. The contract uses similar logic, but the code is new. It has gone through an internal audit and review process but still needs to go through an external audit. For the safety and simplicity of Uniswap, we think using Compound’s Governor Bravo contract is the best decision for the time being. Compound’s Bravo contract has already undergone an audit by OpenZeppelin and has been widely used. We can always change/upgrade to Open Zeppelin’s contract at a future date if their contract introduces new features/functionality the community is interested in. More details on OpenZeppelin’s code can be found here: Github Docs More info To allow the community to review our code, we have deployed the contract on the Ropsten test net. If this Consensus Check passes, we will then deploy the contract on mainnet for the formal on-chain proposal. Ropsten links: Governor Bravo Delegator Governor Bravo Delegate Github for contracts NB: The _initiate function has been slightly modified to take an initial proposal number as an input rather than pulling it from Governor Alpha. This way Uniswap can resume proper proposal numbering.  Snapshot: The Snap Poll will be live for voting from 8AM EST on August 9th until 8PM EST on August 13th. If the poll passes with a minimum of 50,000 UNI in support, this proposal will move forward to the final stages. A link to our snapshot proposal: Snapshot  Resource links:  Governor Bravo Development - Protocol Development - Compound Community Forum  Understanding Governor Bravo. A review of key changes versus… | by monetsupply | Tally | Jul, 2021 | Medium  Compound | Proposal Detail #42  Compound | Proposal Detail #43  ",
                    "links": [
                        "https://snapshot.org/#/uniswap/proposal/QmScNLeajiF2hQh1z9DYqTFKGgrRhHwrHisV4ynmDEQwxH",
                        "https://twitter.com/getty_hill",
                        "https://twitter.com/yesimeddy",
                        "https://twitter.com/yuan_han_li",
                        "https://twitter.com/j0hnwang",
                        "https://twitter.com/alikhambati1",
                        "https://www.fish.vote/",
                        "https://www.withtally.com/",
                        "https://sybil.org/#/delegates/uniswap",
                        "https://app.boardroom.info/",
                        "https://app.uniswap.org/#/vote/0/4",
                        "https://app.uniswap.org/#/vote/1/1",
                        "https://blog.openzeppelin.com/compound-governor-bravo-audit/",
                        "https://github.com/OpenZeppelin/openzeppelin-contracts/tree/master/contracts/governance",
                        "https://docs.openzeppelin.com/contracts/4.x/api/governance",
                        "https://openzeppelin.notion.site/Comparing-Compound-Governor-to-OpenZeppelin-Governor-2-10d0fdcf61ba476fae492b295822ee13",
                        "https://ropsten.etherscan.io/address/0x15df15caad12adaa03949014ba5cc49a84803d0f#code",
                        "https://ropsten.etherscan.io/address/0xD8bf60dfC5115F6cB99bb50502346E7b863800f1#code",
                        "https://github.com/gettty/uniswap-gov",
                        "https://snapshot.org/#/uniswap/proposal/QmWbgzHJ8nK2TDaj6LF6BxAMPahy97dMmbbU5kRBw1QkXt",
                        "https://www.comp.xyz/t/governor-bravo-development/942",
                        "https://medium.com/tally-blog/understanding-governor-bravo-69b06f1875da",
                        "https://compound.finance/governance/proposals/42",
                        "https://compound.finance/governance/proposals/43",
                        "https://gov.uniswap.org/t/governance-proposal-8-upgrade-governance-contract-to-compounds-governor-bravo/13835"
                    ],
                    "GPT-summary": "The post proposes upgrading Uniswap's current governance contract from Governor Alpha to Governor Bravo to improve governance upgradability and protocol safety. The post explains the benefits of Governor Bravo, such as native upgradeability, free-form comments, and a review period. The author also discusses the implementation of the proposal and provides resource links for further information. The post invites the community to review the code and participate in the Snap Poll. The post does not advertise the proposal, give entirely positive or negative feedback, or audit and review the proposal.",
                    "GPT-proposal-categories": [
                        "Smart contract updates",
                        "Governance and voting systems",
                        "Grants, Funding and resource allocation",
                        "Privacy, Security and risk management",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.641264395981377
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Zilch496",
                    "index": "2",
                    "likes": "0",
                    "time": "24/08/2021-13:32:26",
                    "content": "Is there any particular reason quadratic voting hasn’t been included/considered for this proposal? This might be the best time to be looking at implementing it if there ever was one… ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 7.916666666666668
                },
                {
                    "author_link": "https://gov.uniswap.org/u/pennblockchain",
                    "index": "3",
                    "likes": "3",
                    "time": "24/08/2021-13:49:14",
                    "content": "Quadratic voting is a great mechanism used by projects like Gitcoin, however, it requires some level of KYC/verification of individuality. Without this, quadratic voting mechanisms are exposed to Sybil attacks where users could make multiple accounts and exploit the weighting of votes. With the open, anonymized state of Uniswap governance, it does not make sense to implement quadratic voting at this stage. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.333333333333333
                }
            ]
        }
    ],
    "group_index": "115"
}