{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/honeyswap-advanced-features-parameters/10720",
            "title": "Honeyswap Advanced Features/Parameters ",
            "index": 10720,
            "category": [
                "Temperature Check"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/Jzjallday",
                    "index": "1",
                    "likes": "7",
                    "time": "07/03/2021-23:57:41",
                    "content": "Quick discussion about the idea to add advanced features to Uniswap. Is it possible to create a way for the swap to be triggered once the selected coins reach a certain price, obtain a desired coin quantity, and/or specific gas price range? I know for me when I’m swapping on Uniswap, I find myself babysitting the token prices waiting for them to line up, so to speak, with my specific price targets and final swapped coin amounts. I also find myself waiting for certain gas fees to line up to make the swap happen. It would be really neat if you could set swap parameters for the coins and the gas fees you are willing to spend on said swap. Once the parameters/thresholds have been met, the application could send you an alert to approve the transaction or at least know to begin monitoring the situation for a better swap to occur. While I’m quite sure Uniswap can see the frequency my wallet has has executed swaps, I wonder if the protocol can also see how many times I’ve setup a swap, superficially approved the swap (just to view the real-time gas fees), and then rejected the swap because things didn’t fall into my desired parameters. If there is then you would see the massive amount of times I’m doing this on a daily basis   ! Maybe there’s a better way to go about doing all of this? If there is, I’d love to know about it. Although, if it does exist, it’s not apparent or user friendly, at least not on Uniswap yet. I think it would look very close to a market order on an exchange. When the targets are close, the application could then send you an alert to approve the transfer. I do believe something like this would save a lot of users waiting into the wee hours of the night for a best possible transaction situation to develop. Especially since “Expert Mode” leaves a lot to the imagination when it comes to the capabilities it provides the user. I have seen on 1Inch that they have a feature to view the amount of estimated gas while swapping which is helpful. They also have a limit order section to make a limit order but that still does not solve the problem of wanting a desired gas range to be used when the actual swap is made. With the 1inch limit order you may get the price you are looking for but it could also be made at a time when gas fees are undesirable. Some people may care about this more than others, but I think with the increasingly higher cost of gas, more users are starting to care. As I’m sure a comment like, “Wait for V3 to come out to see what it does before making a wish list type of post like this” could be said right now, I know, but I thought I’d throw this out there just in case. I have not found another discussion similar to this so if there is one, I’d love to read about it and vote on the possibilities.    Should Uniswap explore advanced features like, ‘market order alerts that include desired gas fees’?  Yes No More Discussion Needed Wait for V3     0 voters     ",
                    "links": [],
                    "GPT-summary": "The author proposes adding advanced features to Uniswap to allow users to set swap parameters for coins and gas fees, triggering a swap once certain thresholds are met. The author notes that this would save users time and effort, as they would not have to constantly monitor token prices and gas fees. The post also asks if Uniswap should explore these advanced features and invites discussion and feedback.",
                    "GPT-proposal-categories": [
                        "Smart contract updates",
                        "Token economics",
                        "Privacy, Security and risk management",
                        "Interoperability and Scaleability",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.101029601029601
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Jorropo",
                    "index": "3",
                    "likes": "4",
                    "time": "08/03/2021-16:00:16",
                    "content": "Wtf 1lich L. I. C. H. are you trying to scam us (I don’t think see seing the rest of your message, but still pls correct this fast) ? The real link is : 1inch.exchange I. N. C. H. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 4.833333333333333
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Jzjallday",
                    "index": "4",
                    "likes": "3",
                    "time": "08/03/2021-16:37:44",
                    "content": "Simple typo, it has been corrected. The link was and is still for 1inch exchange. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Babson",
                    "index": "5",
                    "likes": "3",
                    "time": "08/03/2021-22:51:24",
                    "content": "Yesssssss. It does make sense. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Silent",
                    "index": "8",
                    "likes": "5",
                    "time": "09/03/2021-23:42:47",
                    "content": "I do believe you are talking about the project Unitrade. It is built on top of Uniswap so it has access to all of its pairs and has limit order tools for anyone. https://unitrade.app/ You also set the gas fee in order for it to trigger. I have used it before the high explosion of gas fees, and it worked better than I thought with the limit order feature. Sadly, these gas fees make impossible for a small trader like me. https://about.unitrade.app/ Here is more information, that hopefully explains everything. I believe this is what you are looking for. ",
                    "links": [
                        "https://about.unitrade.app/"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.173809523809524
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Jzjallday",
                    "index": "9",
                    "likes": "2",
                    "time": "10/03/2021-00:15:02",
                    "content": "@Silent, yes this seems to be close to what 1inch is offering as well. However, I believe both fall short of what could be accomplished by Uniswap. I would like to be able to set in motion something like the following scenario; I want to swap 13-14 (Stake) to produce 2450-2500 (RING) with a gas price range of 110-117 gwei at a maximum gas limit of 340,000-350,000 with an expiry of 7 days. Something to that nature, where all the parameters are changeable or at least able to be set in ranges of qualification. Now maybe that scenario never comes to fruition because the parameters are never reached in the market or maybe an alert is triggered when the scenario is close to or actually in the range of happening. That’s more along the lines of what I’m looking to see. All in a user friendly package of course! I know, I want the world but it would be really exciting and I think ground-breaking to be able to have that kind of control in place for their users. As I stated earlier, I think a lot of people are manually babysitting these parameters to get the most out of their money. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.25625
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Kcs1992",
                    "index": "10",
                    "likes": "2",
                    "time": "13/03/2021-06:29:27",
                    "content": "我们想的一样——来自中国的朋友  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Jzjallday",
                    "index": "11",
                    "likes": "3",
                    "time": "13/03/2021-06:49:45",
                    "content": "感谢您阅读本文并回复。请访问我的博客，点赞并分享。谢谢   publish0x.com    The Case For A Better Uniswap Photo by Mateusz Dach from Pexels   Shiver Me Timbers O.K., so you've come here because you're wondering what new features Uniswap will have when it launches it's third iteration. There's a lot of questions out there and like me,...      ",
                    "links": [
                        "https://www.publish0x.com/heres-the-skinny/the-case-for-a-better-uniswap-xzwdprl?a=4oeElz4md0*"
                    ],
                    "GPT-discussion-categories": [
                        "None of the topics listed match. The comment does not provide any feedback or discussion related to the proposal."
                    ],
                    "Sentiment": 6.0606060606060606
                }
            ]
        }
    ],
    "group_index": "24"
}