{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/running-for-delegate-as-dr-no/4773",
            "title": "Running for delegate as Dr. No ",
            "index": 4773,
            "category": [
                "Delegation Pitch"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/neverselling",
                    "index": "1",
                    "likes": "5",
                    "time": "21/09/2020-05:14:25",
                    "content": "Ill vote no to any proposal unless 80% of the UNI delegated to me decides a certain vote is worth adopting. I’ll use any validation system desired for your Yay or Nay vote, as long as it is is secure and anonymous. My philosophy is that any adopted changes must be overwhelmingly supported. Better to risk voting down a good proposal (which can be re-submitted) than risk voting up a bad proposal (which may be irreversible or may take time to fix). “We fear change” As stated below, when I receive 20 likes on here I will post my address that you can delegate to. You can read some of my comments to see my opinions and such. Thank you ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5494227994228
                },
                {
                    "author_link": "https://gov.uniswap.org/u/kbridge",
                    "index": "2",
                    "likes": "1",
                    "time": "22/09/2020-14:47:52",
                    "content": "What do you think about further Airdrops? I wouldnt like this tbh, unless they are for UNI holders and in very small quantities ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.1875
                },
                {
                    "author_link": "https://gov.uniswap.org/u/neverselling",
                    "index": "3",
                    "likes": "2",
                    "time": "22/09/2020-19:54:55",
                    "content": "Any further airdrops I think would have to be far in the future, less amounts like you said, and would have to be for users I think before the snapshot date. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.916666666666667
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Uniguy772",
                    "index": "4",
                    "likes": "0",
                    "time": "22/09/2020-21:02:23",
                    "content": "Where would these tokens come from for this as this was posted by Noah earlier on a locked forum clarifying that the 15% of tokens sent to the distributor contract for the last airdrop are locked forever? image692×232 11.1 KB ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Moonshot",
                    "index": "5",
                    "likes": "1",
                    "time": "23/09/2020-22:59:06",
                    "content": "From the Treasury. Once the community has control of the Treasury tokens we can do with them what we like. This could include airdrops ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/neverselling",
                    "index": "6",
                    "likes": "0",
                    "time": "17/10/2020-12:51:51",
                    "content": "If I get 20 likes on this thread Ill post my address and you can delegate your UNI towards me. As I said, Ill be voting NO towards any proposal unless I recieve secure comms from 80% of the UNI delgated to me that they want me to vote yes. The current proposal is a prime example why voting NO matters, as Dharma is trying to change the voting rules in order to profit for themselves. As stated before, its much better to vote NO on everything, even a good proposal, which can just be resubmitted. I’d like to have at least 500k UNI to have a decent voting block. Thank you for your time. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.291666666666667
                }
            ]
        }
    ],
    "group_index": "348"
}