{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/should-uniswap-sponsor-ethereum-the-infinite-garden-documentary/13448",
            "title": "Should Uniswap sponsor \"Ethereum: The Infinite Garden\" documentary ",
            "index": 13448,
            "category": [
                "Temperature Check"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/wijuwiju",
                    "index": "1",
                    "likes": "4",
                    "time": "15/07/2021-07:28:03",
                    "content": "Should Uniswap sponsor Ethereum: The Infinite Garden documentary? UPDATE: NO LONGER APPLICABLE, SINCE THEY HAVE RAISED REQUIRED FUND FOR THE MOVIE, lets just wait and enjoy the premier! I think it would be of great benefit for Uniswap community to become one of the major backers for the movie, for various reasons:  Promotion through titles, etc Further solidify ourselves as a major player in ethereum community Potential opportunity to market among non-crypto masses  Costs: It varies, but if we set to become the major backer of the movie, current top giver is at 20 ETH, so that would require use to donate around 2500 UNI Further ideas: Since becoming top 3 backers receives certain unique ecosystem artefacts (NFTs) and in future there will be more opportunities to participate and some of them would require constant monitor of the metaverse and ability to execute as fast as possible, I could envision some sort of fund, i.e Uniswap museum where professional committee of artefacts gatherers could act on our behalf to gather and present the pieces of the metaverse, but for now I think we can focus on becoming of the top 3 backers for the movie and set out a precedent and proof for further discussions regarding the need for such fund/entity Lets discuss the most suitable approach and try to act quickly upon this, since funding goal is at 30% as of right now disclaimer: I’ve personally funded 0.25 ETH towards the movie, as seen in this tx Link to snapshot: I don’t have enough UNI to start a proposal, so if anyone wants to delegate to me or start one on this temp check behalf, feel free to do so, and ping me, to update this post! Link to any additional reading: Ethereum: The Infinite Garden ",
                    "links": [
                        "https://etherscan.io/tx/0xb800144060fe3e1335761f5161a495c2665c4e4c73b2512ed8abd504d75c8ddd",
                        "https://sybil.org/#/delegates/uniswap/0xF4844a06d4f995C4c03195AfcB5Aa59dCBB5b4Fc",
                        "https://ethereumfilm.mirror.xyz/3SV8gLXHIW8Ot45h3RL7aOgDINxN2hjLfFVOvyatB2A"
                    ],
                    "GPT-summary": "The author of the post is suggesting that Uniswap should sponsor the documentary \"Ethereum: The Infinite Garden\" and is providing reasons for why it would be beneficial for the Uniswap community. The author also suggests the possibility of creating a fund for gathering and presenting pieces of the metaverse. The post includes an update that the required funds for the movie have been raised. The post is open for discussion and feedback.",
                    "GPT-proposal-categories": [
                        "Community and engagement",
                        "Grants, Funding and resource allocation",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.061921296296297
                },
                {
                    "author_link": "https://gov.uniswap.org/u/JulianS",
                    "index": "3",
                    "likes": "2",
                    "time": "16/07/2021-07:22:00",
                    "content": "It’s excellent marketing material for the Ethereum community and Uniswap, that can potentially help bridge the ever growing divide in views on crypto between millennials and the boomer generation. This is something I could refer my mother to, and she might take more away from it than “crypto is a scam.” Looks like there’s a pretty good value add considering the production crew’s history, Vitalik’s involvement. It is surely something UNI should back- even 10 ETH might have a better social reach that the broadly defined Defi Education Fund (which essentially ends up being bribes one way or another). At least this is opens doors to folks that have no clue about the cryptocurrency community as outsiders looking in. If the film reaches millions of views the value add, is pennies per view. Considering the reach can break out of our community I see any contribution as extremely beneficial to Uniswap. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.200320512820513
                },
                {
                    "author_link": "https://gov.uniswap.org/u/wijuwiju",
                    "index": "4",
                    "likes": "2",
                    "time": "16/07/2021-07:52:23",
                    "content": "thank you @JulianS for seeing benefit of such move for the Uniswap, but it seems community is a bit slow to react or maybe not interested in supporting such initiative! Since we are a little time restricted by funding deadline which is on Friday, July 16th at 3pm PDT/6pm EDT and by the actual funding limit, which currently sits at 500/750 ETH  top bid at 25 ETH to get into top 20 and hence mentioned in the titles will require only ~3-5 ETH  We shouldn’t  be letting our hopes down, although we haven’t even started discussing technical aspects of execution this funding. Some update as of right now: We would probably require at least 3300 UNI to make a 30 ETH for top bid (only 56 000$, in comparison unigrants paid $15 000 to bankless dao for one month of integrations on their YouTube) But I would suggest getting for this proposal 4500 UNI for ability to incrementally bid in auction, and after send any unused funds to unigrants or something like that ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.284605508870214
                },
                {
                    "author_link": "https://gov.uniswap.org/u/JulianS",
                    "index": "5",
                    "likes": "0",
                    "time": "16/07/2021-08:17:35",
                    "content": "Would be awesome to be in the top 20 and get Uniswap mentioned in the credits, on top of supporting a great project. Is there anyway to actually get this done in the next few hours? Let me know if there’s anything I can do to help out. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.78125
                },
                {
                    "author_link": "https://gov.uniswap.org/u/wijuwiju",
                    "index": "7",
                    "likes": "0",
                    "time": "16/07/2021-19:22:46",
                    "content": "@beachwalker1  not sure this is correct thread, I guess you are referring to the fee switch proposal to share liquidity providers with UNI holders, cause to my knowledge treasury holds no profits, just portion of initial distribution, and here I’m suggesting to distribute to what in my opinion is a great cause both for Uniswap and Ethereum community and ecosystem as whole and could have huge amplification and be beneficial monetary for UNI holders both from promotion and network effect, but anyhow not sure community cares about this proposal or can quickly act upon something like this in such a short of period of time, but appreciate your concerns ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.685185185185185
                },
                {
                    "author_link": "https://gov.uniswap.org/u/heyheyitsnma",
                    "index": "8",
                    "likes": "1",
                    "time": "19/07/2021-11:57:47",
                    "content": "Sounds like a great proporsal to me too. I think that there needs to be more initaitves like this in the industry, it creates a knock-on effect by engaging others in a visual manner and explaining the growth and impact our indsutry is making. Uniswap also is in a Win-Win situation here, as we are in a privelleged position to actually support them and get some potential spotlight too. Procedurally, how would the funding occur? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.416666666666667
                },
                {
                    "author_link": "https://gov.uniswap.org/u/wijuwiju",
                    "index": "9",
                    "likes": "0",
                    "time": "19/07/2021-21:22:03",
                    "content": "hey, fundraiser is finished, have updated the post accordingly, apologies for this, but yeah would be cool to come up with more fluid entity/mechanism that could response in short period of time for such events ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is updating post",
                        "Author of proposal is suggesting a new mechanism for fundraising",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.85
                },
                {
                    "author_link": "https://gov.uniswap.org/u/heyheyitsnma",
                    "index": "10",
                    "likes": "1",
                    "time": "19/07/2021-21:42:10",
                    "content": "Thanks for the update there bud. Yeah perhaps there could be a threshold for lower value requests/proposals that could have a shorter voting lifecylce. i.e. in a company, there isn’t an entire voting proposal for providing an employee with travel expenses >€1.000, but if it exceeds a certain level, then a more formal proposal is needed. Perhaps, depending on the value, the lifecycle and the quorum (voting threshold) could change too. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.142857142857143
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Naught",
                    "index": "11",
                    "likes": "0",
                    "time": "21/07/2021-02:34:15",
                    "content": "Maybe the UGP could have been used here? It sponsored Team Secret esports; funding “Ethereum: The Infinite Garden” would have been a similar marketing usage. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/wijuwiju",
                    "index": "12",
                    "likes": "0",
                    "time": "21/07/2021-07:08:45",
                    "content": "Yeah, that would make sense, but they were out of funds at the time, still are I think. But anyhow hope @haydenadams is featuring in the documentary ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Kripto",
                    "index": "13",
                    "likes": "0",
                    "time": "01/09/2021-08:53:53",
                    "content": "the leading exchange uniswap seems to need no introduction. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/mrmcintosh",
                    "index": "14",
                    "likes": "0",
                    "time": "28/09/2021-08:27:49",
                    "content": "Hi Julian, the guys really did well do raise what they did and I think their film will be an excellent one   I have an idea along side this one and would love to put it forward. Would you be interested to see more of these kind of proposals? Cheers mate! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 7.666666666666666
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Noah",
                    "index": "15",
                    "likes": "0",
                    "time": "11/10/2021-08:00:59",
                    "content": "This topic was automatically closed after 11 days. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.09090909090909
                }
            ]
        }
    ],
    "group_index": "104"
}