{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/algo-stablecoins-are-popping-up-everywhere-but-why-not-uni/12588",
            "title": "Algo-stablecoins are popping up everywhere, but why not UNI? ",
            "index": 12588,
            "category": [
                "Proposal Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/XYK_Ventures",
                    "index": "1",
                    "likes": "0",
                    "time": "28/05/2021-07:04:21",
                    "content": "Lately, there has been many attempts for constructing a decentralized algorithmic stablecoin. It started with Ampleforth… and then Basis Cash and Empty set Dollar came along trying to take over. We also saw things like Mithril Cash(I had lots of fun farming these btw) and all sorts of degen shit going on. Now, there are Tribe, Frax, Luna, and even the paypal mafias are trying to make one(Reserve) The way I see it, they basically all have the same problem. They issue an algorithmic stablecoin that is backed by their governance token. The problem arises because the governance token has no value. Then I thought to myself… Why can’t uniswap issue a stablecoin backed by UNI token? Uni token is backed by the future cashflow of fees generated by Liquidity Providers on Uniswap platform. It will be so much easier to issue a stablecoin backed by Uni token.  image600×600 14.1 KB  This is basically 99% of all algo-stablecoins. It is backed by itself, which makes zero sense. But if uniswap issues a stablecoin, it is clearly different because it’s backed by the liquidity fees on uniswap platform. 목록 항목 ",
                    "links": [],
                    "GPT-summary": "The author discusses the rise of decentralized algorithmic stablecoins and suggests that Uniswap should issue a stablecoin backed by its UNI token, which is backed by the future cashflow of fees generated by Liquidity Providers on the Uniswap platform. The author argues that this would be different from other algo-stablecoins, which are backed by their own governance tokens. The post does not involve any third party giving entirely positive or negative feedback, advertising, collaborating, or auditing the proposal.",
                    "GPT-proposal-categories": [
                        "Token economics",
                        "Interoperability and Scalability",
                        "Privacy, Security and risk management",
                        "None",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.222222222222222
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Danpi314",
                    "index": "2",
                    "likes": "0",
                    "time": "28/05/2021-19:19:49",
                    "content": "You can already, it’s called Maker. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/XYK_Ventures",
                    "index": "3",
                    "likes": "0",
                    "time": "29/05/2021-01:28:11",
                    "content": "No. its not maker. Maker Dai is backed by 40% ETH and 40% USDC. What i mean is 100% backed by Uni token, which is backed by future cash flow of LPs ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.21875
                },
                {
                    "author_link": "https://gov.uniswap.org/u/d3rwisjnodes",
                    "index": "4",
                    "likes": "0",
                    "time": "04/03/2022-13:04:11",
                    "content": "UNI can make use of other stablecoins. Furthermore, stablecoins backed by baskets of this and that are majorly scrutinized by governmental institutions. Considering algorithmic stablecoins, a far better choice imho, they are widely available. Look at UST. Bridgeable to different networks too. UNI could make use of those too.     Algo-stablecoins are popping up everywhere, but why not UNI? Proposal Discussion       You can already, it’s called Maker.     ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.78125
                }
            ]
        }
    ],
    "group_index": "72"
}