{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/proposal-burn-the-coins-created-by-2-inflation/6878",
            "title": "Proposal: Burn the coins created by 2 % inflation ",
            "index": 6878,
            "category": [
                "Proposal Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/Buckerino",
                    "index": "1",
                    "likes": "5",
                    "time": "08/10/2020-08:23:46",
                    "content": "Hello everybody, We are discussing here the governance topics as pioneers of something great. It is us who will charter the way forward. One man once told me, “It is incredibly hard to replace the foundation of a building that has already been built.” . I think this applies wonderfully right now to Uniswap. The pioneers(us) will bear the brunt of the most crucial decisions; therefore, we should also bear the fruit of our actions. That is why I think it would be only appropriate to burn the tokens arising from the additional inflation in order to reward the current governors of Uniswap for their participation. The inflation was added in order to onboard more people into the project after 4 years, but I think this can be done wonderfully even without the inflation. Think about it: the foundation we built, we cherish. The new users could see the rewards the original Uniswap governors received and be incentivized to foster further proposals which would benefit the ecosystem. What I do not think is appropriate is to say that the current UNI governors who put in incredible work now should be punished for their contribution. ",
                    "links": [],
                    "GPT-summary": "The author proposes to burn the tokens created by 2% inflation in order to reward the current governors of Uniswap for their participation. The author argues that the inflation was added to onboard more people into the project, but this can be done without inflation. The author believes that the current UNI governors who put in incredible work should not be punished for their contribution. A 3rd party could give constructive criticism of the proposal or ask questions about it.",
                    "GPT-proposal-categories": [
                        "Token economics",
                        "Governance and decision-making",
                        "Community and engagement"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.626691017316018
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Buckerino",
                    "index": "3",
                    "likes": "2",
                    "time": "08/10/2020-21:00:48",
                    "content": "I see your point, but I do not see the underlying arguments behind it. I´d argue buy and burn would apply not only short term, but also long term. Given the fact that the burn would happen daily gives off the impression that it is indeed short sighted, but I would argue the exact opposite. The new buildings you mentioned can be built by old members who are aware of the dillution and not necessarily by new members. I´d argue, in fact, the inflation will be bought up vastly by old members who already are aware of the value Uniswap represents. Please, go into further detail why you think the burn mechanism would be detrimental as I´d like to see your point of view. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.1893939393939394
                },
                {
                    "author_link": "https://gov.uniswap.org/u/monet-supply",
                    "index": "4",
                    "likes": "5",
                    "time": "08/10/2020-21:49:50",
                    "content": "I’m in favor of the 2% perpetual inflation. The way I see it is, if you stop participating and contributing actively to Uniswap, your UNI ownership percentage should be diluted in favor of newcomers who are willing to contribute. Ownership without participation is free riding. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.861111111111112
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Buckerino",
                    "index": "5",
                    "likes": "1",
                    "time": "08/10/2020-22:28:39",
                    "content": "However, nothing stops an actor from buying more UNI and still free ride ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.25
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Naught",
                    "index": "9",
                    "likes": "0",
                    "time": "01/12/2020-10:51:33",
                    "content": "I read a similar statement in the initial UNI blogpost. I am unsure how the current UNI model incentivizes those who are active in governance to maintain voting position? Inflation as it is designed now will dilute UNI governance voters (i.e. active participants in governance) as this inflation is put to the market and not into UNI governance participants hands. Maybe you could provide some insight on how participating and contributing UNI members do not actively become diluted from the 2% perpetual inflation? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.833333333333333
                }
            ]
        }
    ],
    "group_index": "414"
}