{
    "poll_list": [
        {
            "id": "QmTyWBn3PcBcFeuwKcjwAu5DZypVTK3aGuQ6EGQPFghgtX",
            "title": "Consensus Check - ABOLISH Delegates and change the UNI Governance Voting System",
            "discussion": "",
            "body": "Read the proposal HERE: https://gov.uniswap.org/t/consensus-check-abolish-delegates-and-change-the-uni-governance-voting-system/13458",
            "choices": [
                "YES, ABOLISH delegates ",
                "Let delegates RUN UNI governance"
            ],
            "scores": [
                3126.6984581613974,
                213625.41427895636
            ],
            "start": 1626366600,
            "end": 1626971400,
            "snapshot": "12832548",
            "state": "closed",
            "author": "0x77848888BeCe35979dbE948C7931a3E7Bb7e0d50",
            "space": {
                "id": "uniswap",
                "name": "Uniswap"
            }
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/consensus-check-abolish-delegates-and-change-the-uni-governance-voting-system/13458",
            "title": "Consensus Check - ABOLISH Delegates and change the UNI Governance Voting System ",
            "index": 13458,
            "category": [
                "Consensus Check"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/Luchango",
                    "index": "1",
                    "likes": "1",
                    "time": "15/07/2021-16:24:46",
                    "content": "The Voting system is BROKEN, and it is completely run by 5 -7 whales who have 5-15 million delegated votes each! That’s ridiculous! Where have you seen anywhere in the world a voting system where a single person can cast 10 million votes?? And vote on the proposal he made himself where he is asking for 20 million USD?? And worst of all, thanks to his 10 million votes, he gets the 1.000.000 UNI and immediately sells half of it… And yea, tries to sweet talk out of it, because, that’s what lawyers do, right?? Not only that, there’s also good and honest proposals that NEVER get to Consensus Check because a SINGLE WHALE doesn’t like it and votes “NO” with millions of votes… Even though there’s hundreds of people that are in favor of the proposal… That’s just WRONG! Didn’t even do a temperature check for this proposal, because, who would really give up that kind of voting power, right? So this is a proposal to NOT ALLOW ANY DELEGATES to vote on ANY Proposal, and to CHANGE the voting system as following:  If a person wants to vote on any proposal, they should have at least 1 UNI on their wallet. Regardless of the number of UNI they on their wallet, they can only cast 1 VOTE.  This will allow us to have a more FAIR and DEMOCRATIC system. It will also help avoid bots with the 1 UNI requirement. And if a person has 10 million UNI and wants to cast 10m votes, they have to create 10m wallets and transfer 1 UNI to each! Also, if we abolish delegates, the proposal requirements should change since it will be impossible to meet them. Most proposals have around 300-400 votes, so we suggest a Temperature check should pass with 150 votes after a 5 day period of voting time, a Consensus Check should pass with 200 votes after a 7 day period of time, and the Final Proposals should pass with 500 votes after a 15 day period of time. Of course the final numbers can be decided over a separate vote. You can VOTE for this proposal HERE: Snapshot Thank you for your time. ",
                    "links": [],
                    "GPT-summary": "The author of the post is proposing to abolish delegates and change the UNI governance voting system. The post criticizes the current system, which is controlled by a few individuals with a large number of votes, and proposes a new system that requires voters to have at least 1 UNI in their wallet and limits each voter to one vote. The post also suggests changing the proposal requirements and outlines the voting periods for different types of proposals. The post is advertising the proposal and responding to potential criticism.",
                    "GPT-proposal-categories": [
                        "Governance and voting systems",
                        "Privacy, Security and risk management",
                        "Law and regulations",
                        "Token economics",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.289408866995073
                },
                {
                    "author_link": "https://gov.uniswap.org/u/monet-supply",
                    "index": "3",
                    "likes": "7",
                    "time": "15/07/2021-17:46:19",
                    "content": "I voted against your original temperature check proposal (here) because the mechanism simply will not work. I didn’t mean to be harsh about it but you should do deeper research and discuss with the community before you put stuff up for a vote. People could have explained to you why your idea is not feasible. That being said, you should be embarrassed and ashamed to post in this forum after making dishonest advances to try and buy votes:  image1392×1288 165 KB  ",
                    "links": [
                        "https://global.discourse-cdn.com/business6/uploads/uniswap1/original/2X/9/922900b599c953905dcfcef59d39bd520debb8c2.jpeg"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 4.5625
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Luchango",
                    "index": "4",
                    "likes": "0",
                    "time": "15/07/2021-19:11:24",
                    "content": "I was really hoping that you would take the bait and mention this here! And of course you did LOL!! First of all, why didnt you say anything on the coments of that proposal?? Why didnt you answer any of my messages? You simply went ahead with your 4 million votes and shut down the proposal even though it had hundreds of people voting on favor. And thats exactly the point of THIS Proposal, so that never happens again! And the bribe was just to prove my point here. Shame you didnt take it because it would have proven this BROKEN system even more!! But what happens if theres a proposal thats asks for 20 million USD and bribes your 4 million votes with $1.000.000 USD or more?? Please say that you wouldnt take it because that would be COMPLETELY BELIEVABLE!! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.659722222222221
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Luchango",
                    "index": "5",
                    "likes": "0",
                    "time": "17/07/2021-18:42:30",
                    "content": "So a baby delegate is trying to shut down our proposal, how nice. Well hiturunk.eth, I thank you for your vote, because you are helping us to show this comunity how BROKEN this voting system really is!! Theres almost 400 people voting in favor of the proposal, and 1 single person comes along and with a single click casts more than twice the votes the rest of us have… How democratic… I am really suprised that the bigger delegates havent voted on this yet, not even monet-supply, who clearly likes to shut down proposals based on his own opinion whether something can be done or not… So this is a question for the Uniswap developers: Do you really think that this is a FAIR and DEMOCRATIC voting system? Unless of course you are whale delegates yourself, and if thats the case, then why even have governance at all?? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.84233276643991
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Isaac100",
                    "index": "6",
                    "likes": "2",
                    "time": "17/07/2021-21:13:47",
                    "content": "this is hilarious‏‏‎ ‎ ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Luchango",
                    "index": "7",
                    "likes": "0",
                    "time": "17/07/2021-21:55:40",
                    "content": "What is the point in creating a Decentralized Exchange, on top of a Decentralized network, if the DEX itself is going to be run as a CENTRIALIZED company by a few people? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://gov.uniswap.org/u/BOR4",
                    "index": "8",
                    "likes": "0",
                    "time": "19/07/2021-07:07:19",
                    "content": "Indeed voting power is imbalanced a bit but I think over time whales will get diluted ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/ianaz",
                    "index": "9",
                    "likes": "0",
                    "time": "19/07/2021-09:08:39",
                    "content": "At the end of the day they’re the most affected if the token lose value due to their choices. And honestly, that proposal with exclamation points + uppercase words  on every phrase doesn’t inspire confidence and seriousness ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party giving entirely negative feedback on proposal"
                    ],
                    "Sentiment": 6.625
                },
                {
                    "author_link": "https://gov.uniswap.org/u/smsunarto",
                    "index": "10",
                    "likes": "1",
                    "time": "22/07/2021-14:54:31",
                    "content": "  en.wikipedia.org   Sybil attack  In a Sybil attack, the attacker subverts the reputation system of a network service by creating a large number of pseudonymous identities and uses them to gain a disproportionately large influence. It is named after the subject of the book Sybil, a case study of a woman diagnosed with dissociative identity disorder. The name was suggested in or before 2002 by Brian Zill at Microsoft Research. The term pseudospoofing had previously been coined by L. Detweiler on the Cypherpunks mailing list The S...      ",
                    "links": [
                        "https://en.wikipedia.org/wiki/Sybil_attack"
                    ],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.119047619047619
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Moonshot",
                    "index": "11",
                    "likes": "1",
                    "time": "11/08/2021-17:44:40",
                    "content": "Bad fix, really bad. Revoking delegates is a good start. If a vote is important, you vote yrself, with yr own wallet. Second, any whale (say over 500k UNI) should be forced to deanonymize themselves or have their vote not count. Third, you could have an anti-sybil like Proof of Humanity, so a vote would have to pass that check, and the regular UNI check. Having 1 uni count as a vote is an extremely bad idea. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party giving entirely negative feedback on proposal"
                    ],
                    "Sentiment": 4.65
                },
                {
                    "author_link": "https://gov.uniswap.org/u/haydenadams",
                    "index": "12",
                    "likes": "0",
                    "time": "11/08/2021-19:18:20",
                    "content": "Locking because temperature check failed so consensus check violates governance process, not to mention the obvious issues with the proposal ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.75
                }
            ]
        }
    ],
    "group_index": "105"
}