{
    "poll_list": [
        {
            "id": "0x2f72d9f247d9ce143809bbb4af7f5b36aa50895e517cc32096b15b18b40e3191",
            "title": "Should we deploy Uniswap v3 on Aurora?",
            "discussion": "https://gov.uniswap.org/t/temperature-check-uniswap-x-aurora-expanding-our-multichain-future/17635",
            "body": "## Summary\n\nThis proposal is created on behalf of Blockchain at Michigan, and in partnership with [Proximity Labs](https://www.proximity.dev/). We propose to deploy Uniswap v3 on Aurora through an additional grant license and ask the Uniswap community to consider and discuss this proposal.\n\nUniswap will expand access to decentralized and permissionless trading of tokens on Aurora, and aligns with the community’s multichain vision to bring trustless liquidity to all chains and position itself as a de facto DeFi hub in the space.\n\nOur proposal will include a $5m amount allocated for financial incentives to Uniswap users on Aurora and a commitment to actively engage with the Uniswap community to further support its growth through grant programs and funding for protocol-related development.\n\nProximity Labs will coordinate with the community and governance participants to distribute these funds and will support future developments and allocations to projects leveraging Uniswap and DeFi’s ecosystem participants on Aurora.\n\n## About Aurora\n\n[Aurora ](http://aurora.dev)is an EVM-compatible execution environment running on top of [NEAR](http://near.org), a proof-of-stake layer 1 chain, and takes advantage of its unique features, including sharding and developer gas fee remuneration. Our long-term vision is to provide a user-friendly platform for developers and users to build fast and highly-scalable decentralized applications offering seamless integrations with NEAR’s native chain as well as different L1s and L2 networks.\n\nTransaction costs on Aurora are among the lowest while ensuring a high throughput, scalability, and security. Aurora's SputnikVM is a highly optimized EVM that can execute transactions at high speeds while maintaining full compatibility with Ethereum's VM. This makes Aurora the perfect platform for applications that require high transaction throughput without incurring high costs.\n\nThere are a total of 100 active NEAR nodes acting as Aurora Relayers. The transaction finality happens on NEAR when a new block is minted, right after it’s wrapped in a NEAR transaction and broadcasted to the nodes through one of the relayers. Since the launch of Aurora in May 2021, the average block time has hovered around 1 second, the chain boosts almost instant transaction finality at ~2 secs and a near-zero transaction cost of ~$0.02 on average per tx.\n\n## Proposal\n\nThe Aurora ecosystem has been growing tremendously with very talented builders and founders joining our sides and leveraging Aurora’s exceptional low fees and fast-finality transactions. New integrations and exciting announcements from major protocols and DeFi players such as Curve, Lido,.. have made Aurora one of the fastest growing chains out in the space with an ever-growing number of new people joining and interacting with our dApps. Our network consists of a wide array of platforms, from decentralized exchanges, lending protocols and cross-chain bridges. Our flagship protocols include Bastion Protocol, a lending protocol with more than $340M worth of assets deposited; Trisolaris, a decentralized exchange which secures more than $230M in liquidity; and the Rainbow Bridge, [with over $900M in volume](https://app.uniwhales.io/near/bridge-tracker) bridged across NEAR, Aurora, and Ethereum.\n\n[Aurora’s TVL](https://defillama.com/chain/Aurora) sits at $500M, with highs at around $2.64B, demonstrating an overall increasing engagement with our ecosystem and a tremendously growing base of native supporters. There are more than 2.5 mil unique addresses with around 200k new unique addresses per day and we count around 200k transactions daily.\n\n### Uniswap on Aurora\n\nAurora has a long history of supporting cross-chain protocol deployment and has been eagerly assisting developers and founders all across various chains and spaces to expand and reach new communities and tap into new ecosystems...\n\nMajor DeFi protocols such as The Graph, Flux Protocol, and Gnosis have already deployed on Aurora, and other blue chips such as Chainlink and Curve have committed to launching soon. We’re aware Uniswap has deployed on major chains such as Polygon, Arbitrum, Optimism, and Celo, with successful proposals to deploy on Moonbeam and Gnosis Chain. Deploying Uniswap would be the next big step to take to add to the already-growing DeFi hub on Aurora and will undoubtedly position itself as a premier AMM, and a major liquidity hub for Near, offering a seamless trading experience and allowing defi users to take advantage of its concentrated liquidity mechanism.\n\nThis opportunity will allow Uniswap to gain more exposure within the NEAR community as it positions itself as a primary decentralized exchange hub as we’re headed towards a multi-chain economy, and will undoubtedly bring a massive stream of revenue for Liquidity Providers.\n\n### Incentives\n\nOur proposal comes with financial and non-financial incentives to promote long-term protocol development, developer activity and innovation\n\nWe plan on offering $5m from our ecosystem growth fund to the Uniswap community in the form of Liquidity Mining incentives and Developer Grants to support DeFi applications leveraging Uniswap on Aurora and building on top of it:\n\n* Commit up to $2.5M for a liquidity mining campaign targeting the top liquid pairs to support the overall adoption of Uniswap V3\n* Allocate a $2.5M fund to support long-term protocol development by funding developers, designers, and community members building on top of Uniswap and driving Aurora’s growth.\n* Promote and increase Uniswap’s visibility within our ecosystem and to new projects, as well as showcase in Aurora’s marketing campaigns and Near/Aurora hacker houses and hackathons.\n\n### Rainbow Bridge\n\nRainbow Bridge is the official decentralized bridge for transferring tokens between Ethereum, NEAR and the Aurora networks. At a high level, Rainbow Bridge works through:\n\n1. LiteNodes (a lightweight node implemented as a smart contract that stores block headers. One deployed on the Ethereum network, which stores NEAR block headers, and one deployed on NEAR which stores Ethereum block headers.)\n2. Relayers (scripts running on virtual servers, that periodically read blocks from one blockchain, and communicate them to the LiteNode running on the other.)\n3. Connectors (smart contracts responsible for all of the logic associated with the cross-chain management of a given asset type).\n\nProximity Labs and Aurora will build a connector following the community vote to make the bridge compatible with general messaging functionality. This connector will be deployed on both Ethereum and Near and will be responsible for transferring governance votes/messages between both chains. One of the advantages of Rainbow Bridge is its malleability. Any asset or data can be transferred across the Rainbow Bridge if relevant Connectors exist.\n\n#### Bridge Security\n\n* Does the bridge support arbitrary message passing?\n  * Yes, once the relevant connector will be deployed\n* Is the bridge secured by a trusted entity, by a multi-sig, or a protocol/set of incentivized nodes?\n  * The bridge is secured by multi-sig. Security is provided by implementing light-clients of both networks on the counterpart network: Ethereum light client on NEAR and NEAR light client on Ethereum.\n* Does the bridge leverage the security of the source chain (e.g. Ethereum L1) or destination chain, or is the security provided by another third-party entity?\n  * Rainbow bridge leverages both chains’ security (Ethereum and Near) through the use of Provers on both chains: EthOnNearProver NEAR contract in Rust and NearOnEthProver Ethereum contract in Solidity to verify Ethereum events and Near contract execution results. On Near, trust relies that at no time, 2/3 of the validators stake are honest. Not only the bridge, but also all other applications on NEAR operate under this assumption.\n* Is it possible for a fraudulent message to be passed to the destination chain? If so, are there any recall mechanisms?\n  * The rainbow bridge is based on trustless assumptions with no selected middleman to transfer messages or assets between chains. Because of this, anyone can interact with its smart contracts. When players with bad intentions submit bad information, it would be challenged by independent Watchdogs watching the Near blockchain. [Similar attacks on the Rainbow Bridge have been dismissed resulting in the loss of the hacker’s funds ](https://twitter.com/AlexAuroraDev/status/1561692371833667585?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1561692371833667585%7Ctwgr%5E6740c1fdd2c41ab98ee269e3e593e69b3891d107%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Fdecrypt.co%2F108015%2Fnears-rainbow-bridge-blocks-another-attack-costing-hackers-5-ethereum)\n* What are the ramifications of fraud to the malicious actor?\n  * The bridge requires having a watchdog service that monitors submitted NEAR headers and challenges any headers with invalid signatures. For added security, independent users can run several watchdog services. In the event one entity runs a majority of the watchdogs, fraudulent messages can be processed\n* Has the bridge code been audited? By a third party? What attack vectors and vulnerabilities were identified, if any? Have the identified vulnerabilities been remedied?\n  * The code has been audited by ConsenSys and SigmaPrime. No critical vector attacks were identified.\n  * [View Audit Report](https://www.datocms-assets.com/50156/1659700568-sigma-prime-rainbow-bridge-final-report-10-06-2022.pdf)\n\n### License Exemption\n\nWe are requesting an exemption via an Additional Use Grant (license change enacted via the ENS domain uniswap.eth) that would allow Proximity Labs and Aurora to use the Licensed Work to deploy it on Aurora, a Layer2 EVM compatible blockchain, provided that the deployment is subject to Ethereum layer 1 Uniswap Protocol governance and control. Uniswap V3 will be deployed on Aurora by Proximity Labs or Aurora through the “[Deploy Uniswap V3 Script 15](https://github.com/Uniswap/deploy-v3#deploy-uniswap-v3-script).” Proximity Labs or Aurora would be permitted to use subcontractors to do this work.\n\n### Timeline\n\nFollowing the vote on the proposal by the Uniswap community, our team will be ready to start working on the deployment of Uniswap V3 on Aurora.\n\nWe anticipate a few extra steps that will prelude the full deployment such as:\n\n* Developing the general message connector on top of Rainbow Bridge\n* Deploying Uniswap V3 smart contracts on Aurora\n\nWe expected the full deployment to take anywhere around 4-5 weeks.",
            "choices": [
                "Yes",
                "No"
            ],
            "scores": [
                18645802.148627073,
                784.7887352752425
            ],
            "start": 1662989955,
            "end": 1663977600,
            "snapshot": "15521135",
            "state": "closed",
            "author": "0x13BDaE8c5F0fC40231F0E6A4ad70196F59138548",
            "space": {
                "id": "uniswap",
                "name": "Uniswap"
            }
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/temperature-check-uniswap-x-aurora-expanding-our-multichain-future/17635",
            "title": "[Temperature Check] Uniswap x Aurora: Expanding our Multichain Future ",
            "index": 17635,
            "category": [
                "Temperature Check"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/ishaan",
                    "index": "1",
                    "likes": "7",
                    "time": "12/09/2022-13:37:53",
                    "content": " Summary This proposal is created on behalf of Blockchain at Michigan, and in partnership with Proximity Labs. We propose to deploy Uniswap v3 on Aurora through an additional grant license and ask the Uniswap community to consider and discuss this proposal. Vote here. Uniswap will expand access to decentralized and permissionless trading of tokens on Aurora, and aligns with the community’s multichain vision to bring trustless liquidity to all chains and position itself as a de facto DeFi hub in the space. Our proposal will include a $5m amount allocated for financial incentives to Uniswap users on Aurora and a commitment to actively engage with the Uniswap community to further support its growth through grant programs and funding for protocol-related development. Proximity Labs will coordinate with the community and governance participants to distribute these funds and will support future developments and allocations to projects leveraging Uniswap and DeFi’s ecosystem participants on Aurora.  About Aurora Aurora is an EVM-compatible execution environment running on top of NEAR, a proof-of-stake layer 1 chain, and takes advantage of its unique features, including sharding and developer gas fee remuneration. Our long-term vision is to provide a user-friendly platform for developers and users to build fast and highly-scalable decentralized applications offering seamless integrations with NEAR’s native chain as well as different L1s and L2 networks. Transaction costs on Aurora are among the lowest while ensuring a high throughput, scalability, and security. Aurora’s SputnikVM is a highly optimized EVM that can execute transactions at high speeds while maintaining full compatibility with Ethereum’s VM. This makes Aurora the perfect platform for applications that require high transaction throughput without incurring high costs. There are a total of 100 active NEAR nodes acting as Aurora Relayers. The transaction finality happens on NEAR when a new block is minted, right after it’s wrapped in a NEAR transaction and broadcasted to the nodes through one of the relayers. Since the launch of Aurora in May 2021, the average block time has hovered around 1 second, the chain boosts almost instant transaction finality at ~2 secs and a near-zero transaction cost of ~$0.02 on average per tx.  Proposal The Aurora ecosystem has been growing tremendously with very talented builders and founders joining our sides and leveraging Aurora’s exceptional low fees and fast-finality transactions. New integrations and exciting announcements from major protocols and DeFi players such as Curve, Lido,… have made Aurora one of the fastest growing chains out in the space with an ever-growing number of new people joining and interacting with our dApps. Our network consists of a wide array of platforms, from decentralized exchanges, lending protocols and cross-chain bridges. Our flagship protocols include Bastion Protocol, a lending protocol with more than $340M worth of assets deposited; Trisolaris, a decentralized exchange which secures more than $230M in liquidity; and the Rainbow Bridge, with over $900M in volume bridged across NEAR, Aurora, and Ethereum. Aurora’s TVL sits at $500M, with highs at around $2.64B, demonstrating an overall increasing engagement with our ecosystem and a tremendously growing base of native supporters. There are more than 2.5 mil unique addresses with around 200k new unique addresses per day and we count around 200k transactions daily.  Uniswap on Aurora Aurora has a long history of supporting cross-chain protocol deployment and has been eagerly assisting developers and founders all across various chains and spaces to expand and reach new communities and tap into new ecosystems… Major DeFi protocols such as The Graph, Flux Protocol, and Gnosis have already deployed on Aurora, and other blue chips such as Chainlink and Curve have committed to launching soon. We’re aware Uniswap has deployed on major chains such as Polygon, Arbitrum, Optimism, and Celo, with successful proposals to deploy on Moonbeam and Gnosis Chain. Deploying Uniswap would be the next big step to take to add to the already-growing DeFi hub on Aurora and will undoubtedly position itself as a premier AMM, and a major liquidity hub for Near, offering a seamless trading experience and allowing defi users to take advantage of its concentrated liquidity mechanism. This opportunity will allow Uniswap to gain more exposure within the NEAR community as it positions itself as a primary decentralized exchange hub as we’re headed towards a multi-chain economy, and will undoubtedly bring a massive stream of revenue for Liquidity Providers.  Incentives Our proposal comes with financial and non-financial incentives to promote long-term protocol development, developer activity and innovation We plan on offering $5m from our ecosystem growth fund to the Uniswap community in the form of Liquidity Mining incentives and Developer Grants to support DeFi applications leveraging Uniswap on Aurora and building on top of it:  Commit up to $2.5M for a liquidity mining campaign targeting the top liquid pairs to support the overall adoption of Uniswap V3 Allocate a $2.5M fund to support long-term protocol development by funding developers, designers, and community members building on top of Uniswap and driving Aurora’s growth. Promote and increase Uniswap’s visibility within our ecosystem and to new projects, as well as showcase in Aurora’s marketing campaigns and Near/Aurora hacker houses and hackathons.   Rainbow Bridge Rainbow Bridge is the official decentralized bridge for transferring tokens between Ethereum, NEAR and the Aurora networks. At a high level, Rainbow Bridge works through:  LiteNodes (a lightweight node implemented as a smart contract that stores block headers. One deployed on the Ethereum network, which stores NEAR block headers, and one deployed on NEAR which stores Ethereum block headers.) Relayers (scripts running on virtual servers, that periodically read blocks from one blockchain, and communicate them to the LiteNode running on the other.) Connectors (smart contracts responsible for all of the logic associated with the cross-chain management of a given asset type).  Proximity Labs and Aurora will build a connector following the community vote to make the bridge compatible with general messaging functionality. This connector will be deployed on both Ethereum and Near and will be responsible for transferring governance votes/messages between both chains. One of the advantages of Rainbow Bridge is its malleability. Any asset or data can be transferred across the Rainbow Bridge if relevant Connectors exist.  Bridge Security  Does the bridge support arbitrary message passing?  Yes, once the relevant connector will be deployed   Is the bridge secured by a trusted entity, by a multi-sig, or a protocol/set of incentivized nodes?  The bridge is secured by multi-sig. Security is provided by implementing light-clients of both networks on the counterpart network: Ethereum light client on NEAR and NEAR light client on Ethereum.   Does the bridge leverage the security of the source chain (e.g. Ethereum L1) or destination chain, or is the security provided by another third-party entity?  Rainbow bridge leverages both chains’ security (Ethereum and Near) through the use of Provers on both chains: EthOnNearProver NEAR contract in Rust and NearOnEthProver Ethereum contract in Solidity to verify Ethereum events and Near contract execution results. On Near, trust relies that at no time, 2/3 of the validators stake are honest. Not only the bridge, but also all other applications on NEAR operate under this assumption.   Is it possible for a fraudulent message to be passed to the destination chain? If so, are there any recall mechanisms?  The rainbow bridge is based on trustless assumptions with no selected middleman to transfer messages or assets between chains. Because of this, anyone can interact with its smart contracts. When players with bad intentions submit bad information, it would be challenged by independent Watchdogs watching the Near blockchain. Similar attacks on the Rainbow Bridge have been dismissed resulting in the loss of the hacker’s funds     What are the ramifications of fraud to the malicious actor?  The bridge requires having a watchdog service that monitors submitted NEAR headers and challenges any headers with invalid signatures. For added security, independent users can run several watchdog services. In the event one entity runs a majority of the watchdogs, fraudulent messages can be processed   Has the bridge code been audited? By a third party? What attack vectors and vulnerabilities were identified, if any? Have the identified vulnerabilities been remedied?  The code has been audited by ConsenSys and SigmaPrime. No critical vector attacks were identified. View Audit Report     License Exemption We are requesting an exemption via an Additional Use Grant (license change enacted via the ENS domain uniswap.eth) that would allow Proximity Labs and Aurora to use the Licensed Work to deploy it on Aurora, a Layer2 EVM compatible blockchain, provided that the deployment is subject to Ethereum layer 1 Uniswap Protocol governance and control. Uniswap V3 will be deployed on Aurora by Proximity Labs or Aurora through the “Deploy Uniswap V3 Script 15.” Proximity Labs or Aurora would be permitted to use subcontractors to do this work.  Timeline Following the vote on the proposal by the Uniswap community, our team will be ready to start working on the deployment of Uniswap V3 on Aurora. We anticipate a few extra steps that will prelude the full deployment such as:  Developing the general message connector on top of Rainbow Bridge Deploying Uniswap V3 smart contracts on Aurora  We expected the full deployment to take anywhere around 4-5 weeks.  Link to Snapshot  ",
                    "links": [
                        "https://snapshot.org/#/uniswap/proposal/0x2f72d9f247d9ce143809bbb4af7f5b36aa50895e517cc32096b15b18b40e3191",
                        "http://aurora.dev",
                        "http://near.org",
                        "https://app.uniwhales.io/near/bridge-tracker",
                        "https://defillama.com/chain/Aurora",
                        "https://twitter.com/AlexAuroraDev/status/1561692371833667585?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1561692371833667585%7Ctwgr%5E6740c1fdd2c41ab98ee269e3e593e69b3891d107%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Fdecrypt.co%2F108015%2Fnears-rainbow-bridge-blocks-another-attack-costing-hackers-5-ethereum",
                        "https://www.datocms-assets.com/50156/1659700568-sigma-prime-rainbow-bridge-final-report-10-06-2022.pdf",
                        "https://github.com/Uniswap/deploy-v3#deploy-uniswap-v3-script",
                        "https://snapshot.org/#/uniswap/proposal/0x2f72d9f247d9ce143809bbb4af7f5b36aa50895e517cc32096b15b18b40e3191"
                    ],
                    "GPT-summary": "The proposal suggests deploying Uniswap v3 on Aurora, a Layer2 EVM compatible blockchain, to expand access to decentralized and permissionless trading of tokens on Aurora. The proposal includes a $5m amount allocated for financial incentives to Uniswap users on Aurora and a commitment to actively engage with the Uniswap community to further support its growth through grant programs and funding for protocol-related development. The post also provides information about Aurora, Rainbow Bridge, and the proposed timeline for the deployment. The post does not contain any negative feedback or constructive criticism.",
                    "GPT-proposal-categories": [
                        "Interoperability and Scalability",
                        "Grants, Funding and Resource Allocation",
                        "Smart Contract Updates",
                        "Community and Engagement",
                        "Not a Proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.606992634231441
                },
                {
                    "author_link": "https://gov.uniswap.org/u/devinwalsh",
                    "index": "2",
                    "likes": "2",
                    "time": "13/09/2022-16:02:44",
                    "content": "Thanks @ishaan, Blockchain at Michigan, and Proximity Labs for putting together this proposal! I want to dig in to the security of the governance messaging passing bridge. As background for the community, @tobyshorin summarized some of the risks to insecure implementations of bridges in his UGM Findings + Recommendation post here. My chief concern is the risk of an attack that would send a malicious, invalid message to a cross-chain deployment of Uniswap v3 that would turn on fees and sends the fees to an attacker’s address, and/or changes ownership of the deployment’s Factory contract to the attacker’s address. This is a major security risk for the Protocol, and would also damage Uniswap’s reputation. Thank you for using the template for cross-chain deployments here, however I do want to further clarify some of the information.     ishaan:   Does the bridge support arbitrary message passing? Yes, once the relevant connector will be deployed    So to clarify here - it sounds like today, the bridge does NOT SUPPORT arbitrary message passing. Can you confirm? If this is correct can you please edit in the Consensus check (if Temp check is passed). Will there be an audit of this contract prior to going live? Uniswap governance would be the first user of this connector contract?     ishaan:   Is the bridge secured by a trusted entity, by a multi-sig, or a protocol/set of incentivized nodes? The bridge is secured by multi-sig. Security is provided by implementing light-clients of both networks on the counterpart network: Ethereum light client on NEAR and NEAR light client on Ethereum.    Can you further clarify how this works? Who are the members of the multi-sig? What is the difference between the Relayers and the multisig? Is there a risk that the multi-sig could be subject to a Ronin or Horizon style hack which could send a malicious message of the type described above?     ishaan:   Does the bridge leverage the security of the source chain (e.g. Ethereum L1) or destination chain, or is the security provided by another third-party entity?  Rainbow bridge leverages both chains’ security (Ethereum and Near) through the use of Provers on both chains: EthOnNearProver NEAR contract in Rust and NearOnEthProver Ethereum contract in Solidity to verify Ethereum events and Near contract execution results. On Near, trust relies that at no time, 2/3 of the validators stake are honest. Not only the bridge, but also all other applications on NEAR operate under this assumption.      Can you clarify this - where does the multi-sig come into play?     ishaan:    Is it possible for a fraudulent message to be passed to the destination chain? If so, are there any recall mechanisms?  The rainbow bridge is based on trustless assumptions with no selected middleman to transfer messages or assets between chains. Because of this, anyone can interact with its smart contracts. When players with bad intentions submit bad information, it would be challenged by independent Watchdogs watching the Near blockchain. Similar attacks on the Rainbow Bridge have been dismissed resulting in the loss of the hacker’s funds     What are the ramifications of fraud to the malicious actor?  The bridge requires having a watchdog service that monitors submitted NEAR headers and challenges any headers with invalid signatures. For added security, independent users can run several watchdog services. In the event one entity runs a majority of the watchdogs, fraudulent messages can be processed      Who are the watchdogs? How many are there, and how are they incentivized? ",
                    "links": [
                        "https://gov.uniswap.org/t/proposed-template-for-future-cross-chain-deployment-proposals/16611",
                        "https://twitter.com/AlexAuroraDev/status/1561692371833667585?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1561692371833667585%7Ctwgr%5E6740c1fdd2c41ab98ee269e3e593e69b3891d107%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Fdecrypt.co%2F108015%2Fnears-rainbow-bridge-blocks-another-attack-costing-hackers-5-ethereum"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.239094817219817
                },
                {
                    "author_link": "https://gov.uniswap.org/u/GFXlabs",
                    "index": "3",
                    "likes": "2",
                    "time": "19/09/2022-21:49:48",
                    "content": "Generally, GFX Labs is for expanding Uniswap’s reach. If Aurora can demonstrate to Uniswap Governance that they can sufficiently control and prohibit other parties from controlling the protocol, then we’ll vote for it in a Consensus Check. Devin’s questions are on point. We will look forward to seeing replies to those.     ishaan:  This connector will be deployed on both Ethereum and Near and will be responsible for transferring governance votes/messages between both chains.   It would be helpful if you could deploy Uni v3 on Aurora’s testnet and configure Uniswap’s Goerli Governance as the owner. This way, everyone can see exactly how the deployment will work. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.475
                }
            ]
        }
    ],
    "group_index": "221"
}