{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/add-socks-eth-pool-to-list-of-pools-eligible-for-rewards/3433",
            "title": "Add $SOCKS/$ETH pool to list of pools eligible for rewards ",
            "index": 3433,
            "category": [
                "Proposal Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/rubik",
                    "index": "1",
                    "likes": "0",
                    "time": "19/09/2020-06:02:19",
                    "content": "Communities rally around scarce assets. Let’s make $SOCKS more than socks ",
                    "links": [],
                    "GPT-summary": "The author is proposing to add a $SOCKS/$ETH pool to the list of pools eligible for rewards. The post is an explanation of the proposal and an advertisement for it. Additionally, the post extends an invitation to the community to support the proposal.",
                    "GPT-proposal-categories": [
                        "Token economics",
                        "Community and engagement"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Noah",
                    "index": "2",
                    "likes": "0",
                    "time": "23/09/2020-15:27:06",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        },
        {
            "thread_link": "https://gov.uniswap.org/t/add-uni-renbtc-and-renbtc-eth-to-list-of-pools-eligible-for-rewards/5235",
            "title": "Add $UNI/$renBTC and $renBTC/ETH to list of pools eligible for rewards ",
            "index": 5235,
            "category": [
                "Proposal Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/marcangeloh",
                    "index": "1",
                    "likes": "4",
                    "time": "22/09/2020-00:36:18",
                    "content": "Seen as renBTC would be the decentralized version of wBTC I think it would be a good idea to allow renBTC to be a part of the UNI farming pools. Also, there should be a trade between BTC and UNI tokens as well. PS: I do not hold renBTC and actually hold wBTC myself however I do still firmly believe that this should be a part of the uni ecosystem. ",
                    "links": [],
                    "GPT-summary": "The author proposes adding $UNI/$renBTC and $renBTC/ETH to the list of pools eligible for rewards. The author explains that since renBTC is the decentralized version of wBTC, it should be included in the UNI farming pools. The author also suggests a trade between BTC and UNI tokens. The post does not receive entirely positive or negative feedback, but rather constructive criticism and questions from third parties.",
                    "GPT-proposal-categories": [
                        "Token economics",
                        "Smart contract updates",
                        "Community and engagement"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://gov.uniswap.org/u/rezwile",
                    "index": "2",
                    "likes": "2",
                    "time": "22/09/2020-15:07:20",
                    "content": "There are several issues with renBTC. There is a risk behind the way they lock up invested bitcoin. Not sure if this is good for exchanges/swaps:  The developers are not showing the full source of the running contracts/modules The system stores locked BTC in a single address The known implementation doesnt follow the own whitepaper  Details: On Medium  you can find the article named  “how-safe-are-todays-wrapped-btc-bridges” \"…they emphasize that the management of cross-chain BTC accounts is done by a group of “dark nodes” using MPC and TSS (specifically, Shamir’s Secret Sharing), and the members of this group of “dark nodes” are periodically regrouped. Paradoxically, we found that the Bitcoin address provided by renBTC that users transfer their real BTC to for locking has not changed since the first day it went online.\" ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.489285714285714
                },
                {
                    "author_link": "https://gov.uniswap.org/u/marcangeloh",
                    "index": "3",
                    "likes": "1",
                    "time": "22/09/2020-22:03:41",
                    "content": "Thanks for the information, I did not know that. But wouldn’t wrapped BTC have the same issue? Seen as it’s a centralized entity who holds bitcoin for you basically. Anyway I find it illogical to have one and not the other. Therefore I think if uniswap is to keep the wBTC - ETH pair, then it should implement renBTC too. Again, I should state that I personally hold wBTC and not renBTC. Just thinking of more options to bring more liquidity to the UNI liquidity program. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.895833333333334
                },
                {
                    "author_link": "https://gov.uniswap.org/u/MaxRoszko",
                    "index": "4",
                    "likes": "1",
                    "time": "25/09/2020-15:53:45",
                    "content": "Both of those things are changing in the next phases of their mainnet. If you Google “Road to decentralization Ren” you’ll find their article on this (can’t post links). Most of the code is open-sourced and everything will be open-sourced, and the validator set holding the private keys will expand and sharding will be enabled where liquidity is distributed in multiple wallets, rotating to new ones every 24h. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.636363636363636
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Mr_Po",
                    "index": "5",
                    "likes": "0",
                    "time": "25/09/2020-19:49:15",
                    "content": "Even though I would welcome another BTC option on Ethereum other than WBTC, and RenVM seems like an exciting project, at this point in time its mainnet is only 4 months old. I’m afraid the technology might not be mature enough, at the very least it is quite hard to estimate what the risks are. If we take a look at the adoption of RenBTC among centralized exchanges, it’s only listed on 1 currently. So maybe they’re not sure yet either. I think at least it needs some time and some expertise to be put into it before we can offer it as an “advertised” option… When it comes to centralized solutions for pegged coins for USD, up until now they have been keeping the peg better than their decentralized alternatives. Custody is not a new piece of technology, and custodial risks seem to be better understood overall. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.076430976430977
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Darkhane",
                    "index": "6",
                    "likes": "1",
                    "time": "25/09/2020-20:08:53",
                    "content": "    Mr_Po:  Even though I would welcome another BTC option on Ethereum other than WBTC, and RenVM seems like an exciting project, at this point in time its mainnet is only 4 months old.   Humm, I’d rather wait until tBTC arrives. As far as I understand, It’s backed by BTCs and ETHs stored on much more than one adress ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.196428571428571
                },
                {
                    "author_link": "https://gov.uniswap.org/u/MaxRoszko",
                    "index": "7",
                    "likes": "0",
                    "time": "28/09/2020-11:20:24",
                    "content": "    Mr_Po:  Even though I would welcome another BTC option on Ethereum other than WBTC, and RenVM seems like an exciting project, at this point in time its mainnet is only 4 months old. I’m afraid the technology might not be mature enough, at the very least it is quite hard to estimate what the risks are.   A totally fair assessment! In the meantime the Ren team are pushing ahead delivering more integrations with other chains and making it more secure, and decentralizing the network further. More chain support also means more assets can be listed on Uniswap (Polkadot assets, Binance Smart chain assets, Cosmos assets, Filecoin, Dogecoin etc.).     Darkhane:  Humm, I’d rather wait until tBTC arrives. As far as I understand, It’s backed by BTCs and ETHs stored on much more than one adress   RenVM has been live for 5 months now and has not had a single hack or user losing funds, and is progressively getting more decentralized. The point of the centralization has been to make sure that nothing bad would happen if something broke in the system, which has not happened. And as the system continually proves to be secure and robust, the number of active validators in the system will expand and the network will take on a sharded structure where not only are the backing assets custodied by different validator groups, but also the validator groups will be churned daily forming new groups controlling new addresses that custody the assets. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.744404125286478
                },
                {
                    "author_link": "https://gov.uniswap.org/u/MarkOSullivan94",
                    "index": "8",
                    "likes": "1",
                    "time": "28/09/2020-11:34:45",
                    "content": "Definitely against this, Chris Blec did a great job highlighting how centralized renBTC is right now: https://twitter.com/ChrisBlec/status/1302998918020714497 Decrypt did a write up about it: https://decrypt.co/40110/massive-honeypot-ren-holds-100m-bitcoin-centralized-wallet Until it becomes more decentralized it’s a BIG NO from me  What would be better than renBTC & wBTC would be tBTC providing there’s no issues with the latest deployment although maybe bit premature for that discussion and better when it’s been active for a few months with no issues ",
                    "links": [
                        "https://decrypt.co/40110/massive-honeypot-ren-holds-100m-bitcoin-centralized-wallet"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.376190476190477
                }
            ]
        },
        {
            "thread_link": "https://gov.uniswap.org/t/add-dpi-eth-to-list-of-pools-eligible-for-rewards/3271",
            "title": "Add DPI/ETH to list of pools eligible for rewards ",
            "index": 3271,
            "category": [
                "Proposal Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/Artbeat",
                    "index": "1",
                    "likes": "0",
                    "time": "19/09/2020-02:18:08",
                    "content": "DeFi Pulse Index includes many of the tokens that have been critical to driving the popularity of DeFi. It would also drive up the demand for DPI which would drive up the demand of the underlying tokens, and now you could earn UNI with it, another critical component of DeFi. An overall win-win for DeFi, I see no downsides to adding it. ",
                    "links": [],
                    "GPT-summary": "The author proposes adding DPI/ETH to the list of pools eligible for rewards, arguing that it would benefit DeFi by increasing demand for DPI and its underlying tokens, as well as allowing users to earn UNI. The post receives entirely positive feedback and is seen as an overall win-win for DeFi.",
                    "GPT-proposal-categories": [
                        "Token economics",
                        "Interoperability and Scalability",
                        "Community and engagement"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal",
                        "None"
                    ],
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Noah",
                    "index": "2",
                    "likes": "0",
                    "time": "23/09/2020-15:26:51",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        },
        {
            "thread_link": "https://gov.uniswap.org/t/add-snx-eth-pool-to-list-of-pools-eligible-for-rewards/3248",
            "title": "Add SNX/ETH pool to list of pools eligible for rewards ",
            "index": 3248,
            "category": [
                "Proposal Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/BatmanDeFi",
                    "index": "1",
                    "likes": "2",
                    "time": "19/09/2020-01:35:14",
                    "content": "Synthetix & Uniswap go way back before liquidity mining is a thing. In fact, Synthetix gave rise to liquidity mining and inspired a new generation of farmers. Would love to see SNX/ETH among the early pools to receive $UNI rewards. ",
                    "links": [],
                    "GPT-summary": "The author of the post is proposing to add SNX/ETH pool to the list of pools eligible for rewards. The post also extends to the Uniswap community, expressing the author's desire to see SNX/ETH among the early pools to receive $UNI rewards. A third party gives entirely positive feedback on the proposal and asks questions about it.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Community and engagement"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.920454545454545
                },
                {
                    "author_link": "https://gov.uniswap.org/u/CryptoCow",
                    "index": "2",
                    "likes": "0",
                    "time": "21/09/2020-21:06:22",
                    "content": "Outside of the novelty of having two of the original platforms being paired together I don’t feel like this is the best pool to add when thinking of how much it will grow the Uniswap platform. I personally agree that it would be really cool but there are other “big name” pairs that would draw holders of other tokens to decide to pool their tokens. The whole goal of deciding on new pools eligible for rewards is to increase the overall liquidity, so adding a pool like LINK/ETH would be more beneficial due to the number of Link holders. (Chainlink’s higher market cap would lead to a larger liquidity pool than what SNX/ETH could provide) I also think UNI/ETH would be a natural selection to be added perhaps before SNX/ETH gets added. SNX could come at a much later time. Thoughts? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.804812834224599
                }
            ]
        },
        {
            "thread_link": "https://gov.uniswap.org/t/add-yfi-eth-pool-to-list-of-pools-eligible-for-rewards/3256",
            "title": "Add YFI/ETH pool to list of pools eligible for rewards ",
            "index": 3256,
            "category": [
                "Proposal Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/devops199fan",
                    "index": "1",
                    "likes": "39",
                    "time": "19/09/2020-01:53:07",
                    "content": "The top 5 tokens on Uniswap are already incentivized via liquidity mining, and there is already an existing proposal for $UNI (Add $UNI/$ETH pool to list of pools eligible for rewards).  The next clear candidate for $UNI rewards is YFI: Uniswap_Info2864×902 203 KB Let’s make it happen  ",
                    "links": [
                        "https://global.discourse-cdn.com/business6/uploads/uniswap1/original/1X/548286f867633167758f29cf6fef54722710e3ac.jpeg"
                    ],
                    "GPT-summary": "The author is proposing to add a new pool to the list of pools eligible for rewards on Uniswap. The post explains the rationale behind the proposal and suggests that YFI is the next clear candidate for rewards. The post also invites feedback and support for the proposal.",
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Token economics",
                        "Community and engagement"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Governor",
                    "index": "2",
                    "likes": "12",
                    "time": "19/09/2020-02:08:55",
                    "content": "I 100% support this and will vote in favour of this proposal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/CLCL",
                    "index": "3",
                    "likes": "7",
                    "time": "19/09/2020-02:09:34",
                    "content": "Buying more UNI to vote for this. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/crypto",
                    "index": "4",
                    "likes": "7",
                    "time": "19/09/2020-02:16:24",
                    "content": "Love it. I would vote in favor ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/RichieElUnico",
                    "index": "5",
                    "likes": "7",
                    "time": "19/09/2020-02:22:23",
                    "content": "A great project like YFI would be an asset to the pools. It’s a great proposal! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Doge",
                    "index": "6",
                    "likes": "6",
                    "time": "19/09/2020-02:26:31",
                    "content": "Support. Let’s do it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/ethamphetamine",
                    "index": "7",
                    "likes": "5",
                    "time": "19/09/2020-02:31:29",
                    "content": "Take advantage of all tokens that enhance the value of $UNI ecosystem - $YFI is at the top ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/willprice",
                    "index": "8",
                    "likes": "6",
                    "time": "19/09/2020-02:34:36",
                    "content": "I support this proposal. YFI is among the most heavily traded pairs on Uniswap. Its holders have shown themselves to be active LPs and governance participants. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.277777777777778
                },
                {
                    "author_link": "https://gov.uniswap.org/u/achalam",
                    "index": "9",
                    "likes": "1",
                    "time": "19/09/2020-03:26:50",
                    "content": "I fully support this proposal…please add this and let’s make it…I vote ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/mdesim01",
                    "index": "10",
                    "likes": "1",
                    "time": "19/09/2020-03:48:00",
                    "content": "I am all for this. Let’s bring it to vote. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/James",
                    "index": "11",
                    "likes": "2",
                    "time": "19/09/2020-05:06:05",
                    "content": "+1, YFI has been one of the most interesting and productive experiments in the Ethereum space in recent history. YFI + UNI as ‘long-term token partners’ makes sense, YFI:ETH pool rewards make sense. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.666666666666666
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Gitsomelearnsome",
                    "index": "12",
                    "likes": "1",
                    "time": "19/09/2020-06:17:45",
                    "content": "Should have been listed from the start. Most traded Uniswap coin and still about 40M of liquidity sitting on Sushiswap. Also the most vibrant community. The Apex of DeFi. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party giving entirely positive feedback on proposal"
                    ],
                    "Sentiment": 6.944444444444445
                },
                {
                    "author_link": "https://gov.uniswap.org/u/ethdonatello",
                    "index": "13",
                    "likes": "0",
                    "time": "19/09/2020-09:49:18",
                    "content": "I’m in. Booyakasha!   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/huntercoin",
                    "index": "14",
                    "likes": "1",
                    "time": "19/09/2020-09:52:02",
                    "content": "Add $UNI/$ETH pool to list of pools eligible for rewards good job ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/pet3rpan",
                    "index": "15",
                    "likes": "24",
                    "time": "19/09/2020-11:08:48",
                    "content": "I am voting “No” for this proposal to incentivise $YFI/$ETH liquidity. Why is this my stance?   There is no real outlined motivation nor goal that is stated for this proposal, I’d like to see more explanation around why this would be good for Uniswap. I believe every proposal for Uniswap should have clearly defined outcomes that are positive sum and beneficial for Uniswap both as a community and as a protocol.   The current pairs right now such as ETH/DAI, ETH/USDC, ETHWBTC etc. are staple liquidity pools for DeFi as a whole itself. Better liquidity here both creates a more stable ecosystem as well as establishes greater defensibililty against other competing AMMs DEXs out there in terms of liquidity. I argue that $YFI as great of a project as it is would not fit this bucket (not used as collateral, like other assets mentioned here, but instead is a governance token).   Favouring non-staple DeFi assets without a objective reason, potentially threatens the neutrality of Uniswap as a fairly governed public good. This is not to say that this proposal would immediately damage the credibility of Uniswap itself but I do believe it is a slippery slope to a myriad of problems. While I do believe that political political neutrality doesn’t really exist, non-objective decision making is a weakness and would eventually be exploited by bad actors. Rationality is our best strength as a crowd.   As much as I want this proposal to pass to pump my $YFI bags, I think that for those reasons above, I am pass on this one. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.046961966604823
                },
                {
                    "author_link": "https://gov.uniswap.org/u/adiazre",
                    "index": "16",
                    "likes": "0",
                    "time": "19/09/2020-14:00:37",
                    "content": "Yo lo veo de lujooo El proyecto ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/monet-supply",
                    "index": "17",
                    "likes": "6",
                    "time": "19/09/2020-15:26:43",
                    "content": "I agree 100% with @pet3rpan’s comment above. Just to expand a little bit on it, I think Uniswap should be targeting rewards primarily at “bridge asset pairs”. eg. Compare USDC token liquidity:    uniswap.info    Uniswap Info      to YFI liquidity:    uniswap.info    Uniswap Info      The only pair with real volume for YFI is the YFI/ETH pair. USDC has several additional pairs with substantial volume and liquidity, and in some cases trades will be routed through USDC even if it’s not the asset being sold or bought directly - acting as a bridge like ETH. ",
                    "links": [
                        "https://uniswap.info/token/0xa0b86991c6218b36c1d19d4a2e9eb0ce3606eb48",
                        "https://uniswap.info/token/0x0bc529c00c6401aef6d220be8c6ea1667f6ad93e",
                        "https://uniswap.info/token/0x0bc529c00c6401aef6d220be8c6ea1667f6ad93e"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.294642857142858
                },
                {
                    "author_link": "https://gov.uniswap.org/u/JusDAO",
                    "index": "18",
                    "likes": "0",
                    "time": "20/09/2020-04:15:58",
                    "content": "UNI should pay for ETH pair more  until uniswap  AMM dominate  ETH lliquid ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/CryptoGeex",
                    "index": "22",
                    "likes": "0",
                    "time": "20/09/2020-12:45:53",
                    "content": "Please I need this in my life and it’d be a great ,market pair… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/cp287",
                    "index": "23",
                    "likes": "0",
                    "time": "21/09/2020-00:56:05",
                    "content": "lets do that! What if not YFI? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/iwearahoodie",
                    "index": "24",
                    "likes": "1",
                    "time": "21/09/2020-04:47:14",
                    "content": "That doesn’t seem to logically follow that YFI, because it has a lot of liquidity on uniswap, should have incentives added to it vis-à-vis even more free $UNI. Perhaps we should be looking at projects that are specifically symbiotic with uniswap, i.e. they help make uniswap better in some way, or projects that will make uniswap more desirable to use if we incentivise those pools? I’m not against adding a YFI pool, I’m just not following the rationale. I don’t think we should all just be rushing to add our bags. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.791666666666667
                },
                {
                    "author_link": "https://gov.uniswap.org/u/daihuashong",
                    "index": "25",
                    "likes": "0",
                    "time": "21/09/2020-07:32:54",
                    "content": "    monet-supply:  YFI   100%赞成这个提议 ，真的很棒 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/vesper39",
                    "index": "26",
                    "likes": "1",
                    "time": "21/09/2020-21:51:44",
                    "content": "APY for Uni pool is already down to 30%. Adding another pool and splitting the rewards will drop them down to 24%… You’re gonna be losing money trying to provide LP in an YFI:ETH pool from IL with only 24% interest. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.481481481481481
                },
                {
                    "author_link": "https://gov.uniswap.org/u/jmorris",
                    "index": "27",
                    "likes": "1",
                    "time": "22/09/2020-08:42:48",
                    "content": "voting power is 0. Tokens claimed on UNI-day. Tokens haven’t moved from wallet. why my uni tokens have 0 voting power? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Mr_Po",
                    "index": "28",
                    "likes": "3",
                    "time": "23/09/2020-03:26:44",
                    "content": "This proposal is hurtful to Uniswap ecosystem development. It only benefits people who already own YFI tokens at the expense of current and future Uniswap ecosystem participants. At this point YFI token does not possess store of value capabilities. And it’s supply distribution is heavily centralized between a couple of big liquidity providers. I don’t think it would be good for Uniswap’s reputation to offer UNI tokens for providing liquidity on highly speculative  pairs, as it would create incentive for people to buy into these assets and expose them for high risk of losing money. You don’t want to lock funds for 4 years into providing liquidity for volatile assets with centralized wealth distribution. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party giving entirely negative feedback on proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.788888888888889
                },
                {
                    "author_link": "https://gov.uniswap.org/u/vla",
                    "index": "29",
                    "likes": "0",
                    "time": "23/09/2020-03:35:17",
                    "content": "Great proposal. Let our voice be heard ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/miawivxx",
                    "index": "30",
                    "likes": "0",
                    "time": "23/09/2020-03:37:28",
                    "content": "I agree with you, we shouldn’t add a non-stable token into the liquidity campaign, doing so will imply to give away our governance (UNI) to a lower level token (YFI). Andre Cronje knows the potential reach of UNI, that’s why his interest in it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/caquinn",
                    "index": "33",
                    "likes": "0",
                    "time": "25/09/2020-13:26:29",
                    "content": "Right now YFI/ETH pair is not appropriate, however maybe revisit this conversation down the road. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.800264550264551
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Demaxplero",
                    "index": "34",
                    "likes": "0",
                    "time": "29/09/2020-13:20:44",
                    "content": "I want to know if there are any rewards for the provision of liquidation in ETH/USDT pair? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/jonl33",
                    "index": "35",
                    "likes": "0",
                    "time": "02/10/2020-00:59:13",
                    "content": "g’day, quick Q: --> will $WBTC/$USDT ever be added to a pool eligible for UNI rewards? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.666666666666666
                },
                {
                    "author_link": "https://gov.uniswap.org/u/SandorClegane",
                    "index": "36",
                    "likes": "2",
                    "time": "06/10/2020-08:51:43",
                    "content": "I would vote No for now. Think other issues are more urgent in this community. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9375
                },
                {
                    "author_link": "https://gov.uniswap.org/u/CryptoGeex",
                    "index": "37",
                    "likes": "0",
                    "time": "07/10/2020-09:33:32",
                    "content": "Agreed on that, like really? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/PinkHorse",
                    "index": "38",
                    "likes": "0",
                    "time": "08/10/2020-08:56:57",
                    "content": "When and where we can vote on that? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/scottro",
                    "index": "39",
                    "likes": "0",
                    "time": "12/12/2020-06:31:10",
                    "content": "100 % in favor of this ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Amir_M_Abbasi",
                    "index": "40",
                    "likes": "0",
                    "time": "11/08/2021-08:48:08",
                    "content": "great project ( YFI ) great proposal i’m all for this ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/gsteele178",
                    "index": "41",
                    "likes": "0",
                    "time": "14/08/2021-04:36:07",
                    "content": "Btc/uni? Usdt has long position off site as of now.  To me , no pair will suite a fixable issue. However, unibank, uni ATM, uni advance could really fix a lot of issues. As for gas prices I’d like to purpose uni bank/ and uniwallet. Zero cost if sent from bank to wallet or vice versa. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.375
                }
            ]
        },
        {
            "thread_link": "https://gov.uniswap.org/t/add-uni-eth-pool-to-list-of-pools-eligible-for-rewards/423",
            "title": "Add $UNI/$ETH pool to list of pools eligible for rewards ",
            "index": 423,
            "category": [
                "Proposal Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/iwearahoodie",
                    "index": "1",
                    "likes": "128",
                    "time": "17/09/2020-05:59:30",
                    "content": "It seems natural that we’d want to add the uni / ETH pool to the list of pools that upcoming incentives are distributed to. Thoughts? ",
                    "links": [
                        "https://gov.uniswap.org/t/a-case-for-a-uni-eth-farming-pool-before-any-retroactive-proposals/6849/3",
                        "https://gov.uniswap.org/t/the-growing-treasury-can-represent-a-big-incentive-for-a-governance-attack/7493/2",
                        "https://gov.uniswap.org/t/add-yfi-eth-pool-to-list-of-pools-eligible-for-rewards/3256/14"
                    ],
                    "GPT-summary": "The author is proposing to add the $UNI/$ETH pool to the list of pools eligible for rewards and is seeking feedback on the proposal. A 3rd party could provide constructive criticism on the proposal.",
                    "GPT-proposal-categories": [
                        "Token economics",
                        "Grants, Funding and resource allocation",
                        "Smart contract updates"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/cyril_figgis",
                    "index": "2",
                    "likes": "32",
                    "time": "17/09/2020-07:03:32",
                    "content": "Makes sense to me. Also provides incentive for people to hold the token rather than dump it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/DZ8888",
                    "index": "3",
                    "likes": "18",
                    "time": "17/09/2020-08:48:06",
                    "content": "Yeah I was surprised it wasn’t an option. Is there anyone smarter than me that might know why they didnt? Seem like a Good incentive to stop dumping for short term gains. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.333333333333333
                },
                {
                    "author_link": "https://gov.uniswap.org/u/iwearahoodie",
                    "index": "4",
                    "likes": "17",
                    "time": "17/09/2020-08:50:10",
                    "content": "when they launched the announcement the token had only just gone live. If they had created the pool first maybe it would have caused the price to spike way to high as everyone fomo’d in and people would have got rekt. idk. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.682954545454546
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Flourishabg",
                    "index": "5",
                    "likes": "9",
                    "time": "17/09/2020-08:50:35",
                    "content": "Yeah. Sure it does make sense ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/2ndnikolai",
                    "index": "6",
                    "likes": "6",
                    "time": "17/09/2020-09:27:17",
                    "content": "Seems natural, yes. Will follow to see if anyone can think of why not ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/iwearahoodie",
                    "index": "9",
                    "likes": "2",
                    "time": "17/09/2020-09:36:37",
                    "content": "you can purchase it on uniswap. this is the link: https://uniswap.info/token/0x1f9840a85d5af5bf1d1762f925bdaddc4201f984 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Weatherman",
                    "index": "10",
                    "likes": "4",
                    "time": "17/09/2020-09:38:16",
                    "content": "I totally agree and this would make Uni token more easy to trade on most platforms. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.791666666666667
                },
                {
                    "author_link": "https://gov.uniswap.org/u/olekeel",
                    "index": "11",
                    "likes": "2",
                    "time": "17/09/2020-12:37:41",
                    "content": "Shake out weak hands  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.125
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Zed",
                    "index": "12",
                    "likes": "4",
                    "time": "17/09/2020-12:56:02",
                    "content": "That’s a great idea. It gives people more of an incentive to hold it than to simply market sell it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.166666666666667
                },
                {
                    "author_link": "https://gov.uniswap.org/u/chitty",
                    "index": "13",
                    "likes": "2",
                    "time": "17/09/2020-14:43:04",
                    "content": "    iwearahoodie:  when they launched the announcement the token had only just gone live. If they had created the pool first maybe it would have caused the price to spike   This was probably the reason, it makes sense to add it now and promote UNI/ETH liquidity to reduce slippage. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.6439393939393945
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Kiba",
                    "index": "14",
                    "likes": "8",
                    "time": "17/09/2020-15:07:14",
                    "content": "It doesn’t matter if people dump the token. People interested in Uniswap governance are already buying tokens, you don’t need to give them more free ones The pools already listed are the ones with highest volume in every major CEX, increasing liquidity to them makes UNI the best option in the market (we’re almost there already). UNI/ETH pool incentives only make sense if UNI is a major trading pair on CEXs to attract users from there. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.625
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Governor",
                    "index": "15",
                    "likes": "1",
                    "time": "17/09/2020-16:30:00",
                    "content": "Yes. I was wondering why this pool wasn’t there by default haha. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/msagansk",
                    "index": "16",
                    "likes": "21",
                    "time": "17/09/2020-16:41:07",
                    "content": "I think this is especially important because it will encourage liquidity of the UNI token to stay on Uniswap, rather than centralized exchanges. Having UNI pool in centralized exchanges gives the competition governance rights which seems like a poor strategy for us. We should try to discourage that as much as possible by incentivising the UNI/ETH pool. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.666666666666666
                },
                {
                    "author_link": "https://gov.uniswap.org/u/andy8052",
                    "index": "17",
                    "likes": "4",
                    "time": "17/09/2020-17:56:48",
                    "content": "Based on some quick research, I think deploying this code is pretty feasible. The largest hurdle now would be getting the governance proposal passed ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.458333333333332
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Darkhane",
                    "index": "18",
                    "likes": "6",
                    "time": "17/09/2020-18:08:04",
                    "content": "I would not be surprised that they prefered to keep the major pairs : big volumes so a lot of fees. Don’t forget that we might be able to stake UNI to gain fees Giving UNI to pool UNI/ETH, what’s the interest? You want to gain UNI then stake your UNIs and earn fees. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.828125
                },
                {
                    "author_link": "https://gov.uniswap.org/u/darwell",
                    "index": "19",
                    "likes": "0",
                    "time": "17/09/2020-18:14:43",
                    "content": "can already add liquidity? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Native",
                    "index": "20",
                    "likes": "1",
                    "time": "17/09/2020-19:03:36",
                    "content": "Indeed. This is a great way to tie UNI to ETH and continue to supercharge the value base. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/skyseer",
                    "index": "21",
                    "likes": "1",
                    "time": "17/09/2020-19:49:06",
                    "content": "Totally agree. Huge volume on eth/uni pair. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Kiba",
                    "index": "22",
                    "likes": "3",
                    "time": "17/09/2020-20:49:07",
                    "content": "Staking could be setup to accept UNI LP tokens too ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/DZ8888",
                    "index": "23",
                    "likes": "1",
                    "time": "17/09/2020-20:54:41",
                    "content": "Yeah thats a good point. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/kbridge",
                    "index": "24",
                    "likes": "3",
                    "time": "17/09/2020-22:12:04",
                    "content": "Completely agree! Should be one of the first pools to open  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://gov.uniswap.org/u/monet-supply",
                    "index": "25",
                    "likes": "6",
                    "time": "17/09/2020-22:34:12",
                    "content": "Just wanted to highlight the community guidelines:  Rather than posting “+1” or “Agreed”, use the Like button.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/ETHisFunny",
                    "index": "26",
                    "likes": "1",
                    "time": "17/09/2020-22:52:52",
                    "content": "I am 50/50 on this. Seems like a good idea. I’m just worried about how it could disincentive other pools.  I think it’s pretty obvious that the ETH/Stablecoin pools would pose a higher risk to impermanent loss. Honestly, I think this is a bigger discussion. I think that long term the way we incentive certain pools over others could pose a systemic problem. However, I guess I’m in favor of it for now. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.021825396825396
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Native",
                    "index": "27",
                    "likes": "3",
                    "time": "17/09/2020-23:36:59",
                    "content": "This brings exceptional value to UNI tokens. Single-asset liquidity additions to most profitable pools. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.916666666666666
                },
                {
                    "author_link": "https://gov.uniswap.org/u/iwearahoodie",
                    "index": "28",
                    "likes": "9",
                    "time": "18/09/2020-00:13:40",
                    "content": "there’s a natural balance that occurs as liquidity moves into incentivised pools, in that the fees earned from trading become higher for pools not included. That is to say, if I’m in say an ETH / YFI pool as an LP and most people exit to go farm $UNI, I all of a sudden become far more profitable. This keeps a certain amount of liquidity there to make trading those pools viable. However it seems that if you’re a supporter of uniswap, and ergo $uni, at the moment you’re kind of torn between selling your $uni to get into a pool that can farm $uni. Would be nice to be able to hang on to $uni, provide more liquidity for the $uni pool, AND earn more $uni from the distributions. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 6.818452380952381
                },
                {
                    "author_link": "https://gov.uniswap.org/u/uni-louis",
                    "index": "29",
                    "likes": "1",
                    "time": "18/09/2020-01:02:53",
                    "content": "cannot agree more they bear more risk so they deserve them ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/cryptoprince",
                    "index": "30",
                    "likes": "1",
                    "time": "18/09/2020-01:03:51",
                    "content": "Excited to hear taking care of the community ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://gov.uniswap.org/u/ETHisFunny",
                    "index": "31",
                    "likes": "2",
                    "time": "18/09/2020-01:15:22",
                    "content": "I guess you’re right. It probably balances itself for the most part. In regards to earning $UNI I’m definitely in favor of something besides being an LP at least in the near term as I don’t want to lose a lot of my $UNI for ETH. I would prefer some kind of staking. In the future it could be good tokenomics to do something even better. We could do what YFI does and have a token buy-back fund based off of fees generated or something. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.325396825396825
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Michealss",
                    "index": "32",
                    "likes": "1",
                    "time": "18/09/2020-02:16:09",
                    "content": "I agree totally with the ideas. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/coolcryptomaniac",
                    "index": "33",
                    "likes": "0",
                    "time": "18/09/2020-03:11:36",
                    "content": "Absolutely right , it should be done afterwards in a manner such that neither it creates fomo and neither it creates a very high sell pressure. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.822857142857143
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Nic",
                    "index": "34",
                    "likes": "1",
                    "time": "18/09/2020-06:04:41",
                    "content": "It’s not a bad thing that uninterested people dump early. Especially if they need the money. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Superior",
                    "index": "35",
                    "likes": "0",
                    "time": "18/09/2020-12:38:12",
                    "content": "That a really good idea ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/iwearahoodie",
                    "index": "36",
                    "likes": "1",
                    "time": "18/09/2020-12:39:34",
                    "content": "Are you sure YFI has that? As far as I knew they distribute yCRV to people who stake YFI. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/TexisPete",
                    "index": "37",
                    "likes": "1",
                    "time": "18/09/2020-12:47:45",
                    "content": "I agree, was surprised there was no UNI pool in the first place. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.875
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Lokiloki",
                    "index": "38",
                    "likes": "1",
                    "time": "18/09/2020-14:47:24",
                    "content": "Much better that we stable the price of uni before adding a pool with eth ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Zer0dot",
                    "index": "39",
                    "likes": "2",
                    "time": "18/09/2020-17:14:35",
                    "content": "What happens when we run out of UNI to incentivize with? I’m not sure… Also, this is an interesting, albeit confusing situation since listing this pool for rewards essentially feeds into itself, which might pull liquidity away from the pools external members use Uniswap for. The way it is now incentivizes liquidity provision to the greater DeFi ecosystem, rather than a self-contained UNI loop. That’s the way I see it, but what do I know?  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.699999999999999
                },
                {
                    "author_link": "https://gov.uniswap.org/u/msagansk",
                    "index": "40",
                    "likes": "1",
                    "time": "18/09/2020-17:23:57",
                    "content": "There is a 2% perpetual inflation in UNI, so we will never run out. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Zer0dot",
                    "index": "41",
                    "likes": "1",
                    "time": "18/09/2020-17:36:22",
                    "content": "Good point! But still, something bothers me about this being self-contained. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.375
                },
                {
                    "author_link": "https://gov.uniswap.org/u/ETHisFunny",
                    "index": "42",
                    "likes": "0",
                    "time": "18/09/2020-21:25:01",
                    "content": "I’m probably wrong about that, maybe I mixed it up with another project. Yearn’s confusing as it is. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.666666666666667
                },
                {
                    "author_link": "https://gov.uniswap.org/u/blackhatzw",
                    "index": "43",
                    "likes": "0",
                    "time": "18/09/2020-22:06:46",
                    "content": "It should add ETH/UNI by default! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Unicoin",
                    "index": "44",
                    "likes": "0",
                    "time": "18/09/2020-22:11:43",
                    "content": "I think this a great Idea, I have lots of liquidity Id love to put work and look foward to a deployment of this nature. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.25
                },
                {
                    "author_link": "https://gov.uniswap.org/u/BCpowerup",
                    "index": "45",
                    "likes": "1",
                    "time": "18/09/2020-22:49:08",
                    "content": "I saw the Pair and put a bunch of eth and UNI to facilitate people trading and getting a price discovery and don’t be misled my the DEX… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Native",
                    "index": "46",
                    "likes": "1",
                    "time": "18/09/2020-23:13:44",
                    "content": "@iwearahoodie  Totally agree with your statements on the power of incentivized pools and Single-Asset LP input options. Perhaps, the weight of a Single-Asset addition of $UNI outweighs the binary additions to pools. In response to @ETHisFunny: Token buy-back would be profound by batching automated liquidity sweeps via a $UNI wallet designed to HODL/capture % of circulating supply from (x) amount of transactions at (x) rate of time intervals. These liquidity sweeps can also delegate a % of the sweep to supply payouts to $UNI holders as an incentive; therefore pulling supply off the market as transactions take place and redistributing to HODLing patrons; thus increasing incentive. Perhaps, xDai or 1inch CHI can help with gas fees; in terms of frequent transactions. Thoughts… ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.305555555555555
                },
                {
                    "author_link": "https://gov.uniswap.org/u/ETHisFunny",
                    "index": "47",
                    "likes": "2",
                    "time": "19/09/2020-00:53:48",
                    "content": "    Native:  Token buy-back would be profound by batching automated liquidity sweeps via a $UNI wallet designed to HODL/capture % of circulating supply from (x) amount of transactions at (x) rate of time intervals. These liquidity sweeps can also delegate a % of the sweep to supply payouts to $UNI holders as an incentive   Thanks, for elaborating on it but yeah that’s pretty much what I was thinking. This is probably something that was already planned in V3, but yeah part of every transaction fee say 1% could be swept into a wallet or maybe instead a wallet could be created in tandem with a pool that owns a flat proportion of the total pool. When the fees collected reach a threshold any user could “harvest” it. It would then be banked in a fund which could be used to buy UNI from the UNI-ETH Pool. Users who then staked UNI could claim their portion of the buyback, proportional to the amount they staked. I’ve done some coding over the years but I’m not very good, so don’t expect a written up contract out of me. Just an idea that could help the tokenomics and incentivize protocol use. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.313644688644689
                },
                {
                    "author_link": "https://gov.uniswap.org/u/PhABC",
                    "index": "48",
                    "likes": "19",
                    "time": "19/09/2020-03:34:42",
                    "content": "We shouldn’t add UNI/ETH pair as part of liquidity mining pool. Before explaining my position, I would like to disclose that I do in fact own a significant amount of UNI tokens. TL;DR: UNI/ETH pool is a short term increase in UNI demand to pump the price and has little long term benefit for Uniswap and UNI holders. Instead, we should use the Liquidity Mining rewards to steal markets from competitors like Curve and centralized exchanges. Full reply: First of all, it is clear that the main rational behind adding UNI/ETH as a reward pool is to increase the demand for UNI and hence increase its price. This is defi farming 101 and the reason why the Pool 2 is usually given a 5-10x reward boost. However, the goal of UNI distribution program should be two folds:  Distribute governance tokens to participants that care about Uniswap and will ensure its success Incentivize liquidity where it’s most needed  1 was fairly well achieved by the ad-hoc distribution and by the fact that liquidity mining will only be small % of UNI distributed. To achieve 1, it’s important that liquidity mining is only a small portion of how UNI tokens are distributed. Lets not lie to ourselves; liquidity miners, myself included, just want to farm for the sake of being able to buy our favorite assets. We are liquidity locusts swarming from one farm to the other until nothing remains. That being said, liquidity mining is a powerful tool and we can wield it for the long term good of Uniswap. If we are to use financial incentives for the good of Uniswap, then lets not use it to create a demand pressure that will quickly dissipate once the rewards halt, achieving nothing but only short term price jubilation. In my opinion, a better use of liquidity mining could be use to steal markets from competitors. For instance, we could pick currencies that are most traded on Binance or Coinbase to try to bring back these tokens trader back to Uniswap. Alternatively, we could encourage stablecoin/stablecoin pairs to make Uniswap competitive with Curve and Swerve. Lets think long term. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.880357142857143
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Northoak",
                    "index": "49",
                    "likes": "0",
                    "time": "19/09/2020-03:50:48",
                    "content": "I agree! Long term is the only way to go. Bring on UNI-ETH! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.875
                },
                {
                    "author_link": "https://gov.uniswap.org/u/James",
                    "index": "50",
                    "likes": "6",
                    "time": "19/09/2020-04:35:36",
                    "content": "+1 to @PhABC’s comments above. imo using the UNI rewards to bring more outside liquidity to Uniswap makes more sense then using these rewards for ETH/UNI liquidity. Realistically UNI currently has a $500m+ market cap with ~$50m in uniswap liquidity, as well as centralised exchanges, etc - Don’t see the reason to distribute more UNI tokens to ETH:UNI LP’s. I wouldn’t want to deposit my LP tokens into the pool anyway - holding, participating in governance & eventually collecting protocol fees with my UNI tokens is significantly more interesting than getting IL rekt from being an LP. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.5625
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Ayo",
                    "index": "51",
                    "likes": "0",
                    "time": "19/09/2020-05:31:25",
                    "content": "+1 too, must add these UNI/ETH to lock and stabilize market. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Hoanglongqb",
                    "index": "52",
                    "likes": "0",
                    "time": "19/09/2020-05:49:32",
                    "content": "Bạn cho tôi hỏi, hôm qua tôi làm BOT và kiếm được 290 UNI, nhưng vì sao tôi rút về ví trust không được? Bạn có thế giúp tôi rút UNI ko? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/blockomoco",
                    "index": "53",
                    "likes": "1",
                    "time": "19/09/2020-06:30:38",
                    "content": "Liquidity providers of UNI/ETH are essential and should be rewarded. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/skyseer",
                    "index": "54",
                    "likes": "1",
                    "time": "19/09/2020-06:50:17",
                    "content": "Uniswap team could add vesting for ETH-UNI pool rewards or even make rewards 10 times less than ETH-Stablecoins pools. I’m going to provide liq to eth-uni pool either way. But some rewards won’t hurt, even some minimal amount. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.333333333333334
                },
                {
                    "author_link": "https://gov.uniswap.org/u/grin",
                    "index": "55",
                    "likes": "1",
                    "time": "19/09/2020-09:49:20",
                    "content": "100% in favor of it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/huntercoin",
                    "index": "56",
                    "likes": "1",
                    "time": "19/09/2020-09:53:11",
                    "content": "   app.uniswap.org    Uniswap Interface      ",
                    "links": [
                        "https://app.uniswap.org/#/swap"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/somebodywashere",
                    "index": "57",
                    "likes": "0",
                    "time": "19/09/2020-10:54:30",
                    "content": "Sure, should have been from the start imo ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/pet3rpan",
                    "index": "58",
                    "likes": "1",
                    "time": "19/09/2020-11:23:11",
                    "content": "A consideration here is that by incentivising liquidity, we would be creating greater price stability around the price of $UNI relative to ETH and less volatility. This would potentially means soften crashes against ETH as well as blunted upwards price movements (to a certain degree depending on liquidity provided). Sometimes for fairly more illiquid pairs, this is desired but there is a level of diminishing returns as a token project (less moon potential too essentially). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.48941798941799
                },
                {
                    "author_link": "https://gov.uniswap.org/u/drchase1616",
                    "index": "59",
                    "likes": "2",
                    "time": "19/09/2020-11:42:07",
                    "content": "I think UNI/Dai pool would also be great to incentivize ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/GoJackzi",
                    "index": "60",
                    "likes": "0",
                    "time": "19/09/2020-14:26:23",
                    "content": "Probably would happen when Uniswap V3 launces. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/monet-supply",
                    "index": "61",
                    "likes": "7",
                    "time": "19/09/2020-14:27:54",
                    "content": "    blockomoco:  Liquidity providers of UNI/ETH are essential and should be rewarded.   Disagree. They’re only essential if you want to dump your tokens. If you want to participate in governance and hold for the long term, UNI/ETH liquidity doesn’t provide any value. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.9375
                },
                {
                    "author_link": "https://gov.uniswap.org/u/blockomoco",
                    "index": "62",
                    "likes": "1",
                    "time": "19/09/2020-15:03:47",
                    "content": "How do we get swaps to/from $UNI with low slippage if there is no deep liquidity in the UNI/ETH pool ? Arguably, people could use CEXs instead. Although the value proposition of Uniswap is to not encourage that. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/diazMelgarejo",
                    "index": "63",
                    "likes": "2",
                    "time": "20/09/2020-09:37:37",
                    "content": "#1: would a {sUSD / renBTC} pair make better sense @PhABC? the advantage of Balancer and Curve.fi Liquidity is that they can contain a basket of coins like 4 or 8 while Uniswap only accommodates a pair, so our choices are limited another pair in mind is #2: {FTX / SRM} pair if you are thinking of competitors?  i would confess that at first thought, $UNI pool is a no-brainer, but reading your lengthy argument made me think again…  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.928571428571429
                },
                {
                    "author_link": "https://gov.uniswap.org/u/LikeTerryFox",
                    "index": "64",
                    "likes": "3",
                    "time": "20/09/2020-10:36:47",
                    "content": "I don’t think it’s wise to allocate a similar pool of UNI/ETH rewards, but if the reward was 10 times less, then ok. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.291666666666666
                },
                {
                    "author_link": "https://gov.uniswap.org/u/CryptoGeex",
                    "index": "65",
                    "likes": "0",
                    "time": "20/09/2020-12:43:15",
                    "content": "Support this!!! It’s the perfect dream i never knew existed until now. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/JokerTheBond",
                    "index": "66",
                    "likes": "4",
                    "time": "20/09/2020-14:06:22",
                    "content": "I don’t completely agree with you. Your comment does make a lot of sense, but I think adding UNI/ETH could help the whole liquidity mining program if done in a smart way. Of course, not all of the mined UNI reward should go to UNI/ETH, only a small percentage like 10%. We would still have 90% of the reward to allocate to strategic pairs. And if adding UNI/ETH cause the price of UNI to pump, now the 90% of the reward would be worth more than 100% of it with UNI at a lower price. Adding a mining reward to strategic pairs should still be the main focus of the liquidity mining program, but 9 UNI worth 7$ are a bigger incentive then 10 UNI worth 5$. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.832251082251082
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Batercuc",
                    "index": "67",
                    "likes": "1",
                    "time": "20/09/2020-15:04:04",
                    "content": "great pair, i wait it ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/David1992",
                    "index": "68",
                    "likes": "0",
                    "time": "20/09/2020-15:38:56",
                    "content": "Si  puede adquirir liquidez y entrar en pares para minería desde el 18 de septiembre a las 12:00 horas @darwell ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/d1m9en",
                    "index": "69",
                    "likes": "0",
                    "time": "20/09/2020-19:34:51",
                    "content": "Yes this makes perfect sense. This would compliment both protocols and LP’s  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Tim",
                    "index": "70",
                    "likes": "0",
                    "time": "20/09/2020-20:17:30",
                    "content": "i agree but i fear impermanent loss on this pair maybe is get some rekt. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/vipmoney",
                    "index": "71",
                    "likes": "5",
                    "time": "21/09/2020-01:38:35",
                    "content": "Agree 100% UNI/ETH should be the first new Pool to include in UNI farming. It’s a no-brainer, it will provide a big incentive for people not to dump (price stability) and will reward the Unicorn Marines for being loyal. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.899621212121212
                },
                {
                    "author_link": "https://gov.uniswap.org/u/blackhatzw",
                    "index": "72",
                    "likes": "0",
                    "time": "21/09/2020-07:41:00",
                    "content": "Think about Sushi then you would understand the importance of token incentivize. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/diazMelgarejo",
                    "index": "73",
                    "likes": "0",
                    "time": "21/09/2020-12:56:18",
                    "content": "  sUSD / renBTC pair  wNXM / SRM pair  2 alternatives to UNI / ETH pool for $UNI rewards ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/iwearahoodie",
                    "index": "74",
                    "likes": "3",
                    "time": "21/09/2020-12:58:19",
                    "content": "why? Are they just your bags? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/marcangeloh",
                    "index": "75",
                    "likes": "0",
                    "time": "21/09/2020-13:08:17",
                    "content": "But what about adding a time-lock to the uni-eth pool. In order to prevent a pump-n-dump and instead of adding liquidity, I think it should be taken out of the other liquidity pools equally and given to UNI-ETH. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.6875
                },
                {
                    "author_link": "https://gov.uniswap.org/u/iwearahoodie",
                    "index": "76",
                    "likes": "1",
                    "time": "21/09/2020-13:29:38",
                    "content": "I’d like to hear more pro’s v cons on time locks. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/iwearahoodie",
                    "index": "77",
                    "likes": "0",
                    "time": "21/09/2020-13:33:02",
                    "content": "I very much respect this response. Especially your idea about stablecoin / stablecoin pairs, making us more competitive with curve et al. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.2666666666666675
                },
                {
                    "author_link": "https://gov.uniswap.org/u/marcangeloh",
                    "index": "78",
                    "likes": "3",
                    "time": "21/09/2020-13:35:58",
                    "content": "Pro for timelock:  Stops whales from putting their money in and dumping it the next day. Increases the UNI price over a longer period of time, as locking it makes the money inaccessible for the duration of it’s lock. Locking it removes the locked amount from the market supply (which is how crypto.com has been skyrocketing) Locking it targets the long term. After the locked time the money can remain staked or be removed. Can give a bigger incentive than not time locking  Cons for timelock:  It may scare some people away (as they cannot take their money out anytime) It’s less flexible to simply put in money and take out your money whenever you want to. Timelock (due to smart-contract failures and glitches) may cause more issues in terms of stability and safety of your money. Not required/ recommended for the stablecoins  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.113095238095237
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Darkhane",
                    "index": "79",
                    "likes": "0",
                    "time": "21/09/2020-19:58:57",
                    "content": "    PhABC:  Alternatively, we could encourage stablecoin/stablecoin pairs to make Uniswap competitive with Curve and Swerve.   I agree with this proposal, it would give a better user experience to those who want to switch from one stablecoin to another rather than use Curve. Curve is a great tools but very limited for “small” amounts. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 7.011904761904763
                },
                {
                    "author_link": "https://gov.uniswap.org/u/JokerTheBond",
                    "index": "80",
                    "likes": "0",
                    "time": "21/09/2020-19:59:34",
                    "content": "I don’t think trying to compete with curve would be a good idea for the moment. Uniswap and Curve are both DEXes, but they do different things. Uniswap is more of a general purpose exchange, Curve is only used to exchange assets that have the same value. Both are good in what they do. Curve rely on low fees (0,04%) compared to Uniswap (0,3%) and use a different algorithm to manage liquidity pool. Curve can’t do most of the things Uniswap does, but for Uniswap to compete with Curve on stable/stable pairs it would take more than just UNI incentives. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.34090909090909
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Darkhane",
                    "index": "81",
                    "likes": "0",
                    "time": "21/09/2020-20:05:02",
                    "content": "Time lock doesn’t add any long-term value. This artificially reduces sales pressure, nothing else. And that favors whales who have currently a lot of UNI tokens., nobody else. Add time lock and I will do what I did with Sushiswap : I will immediatly remove all my LP from Uniswap. Don’t be greedy and don’t forget one thing : LP providers take a lot of risks, impermanent losses are real and this risk has to be reward. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 4.333333333333334
                },
                {
                    "author_link": "https://gov.uniswap.org/u/JokerTheBond",
                    "index": "82",
                    "likes": "3",
                    "time": "21/09/2020-20:17:30",
                    "content": "I’m against timelocks, mainly for 2 reasons:  the first you already said, it is going to scare investors. We can have more UNI in LPs if the UNI are not locked then if they were locked. I’ve been providing liquidity to UNI-ETH since day 1 and I’m not planning to stop it, but I wouldn’t provide liquidity if it implied that I need to lock my token. impermanent loss is already a big incentive to keep your UNI in the liquidity pools, The way you overcome the impermanent loss with gains is by providing liqudiity for a longer timeframe.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.145833333333334
                },
                {
                    "author_link": "https://gov.uniswap.org/u/codebam",
                    "index": "83",
                    "likes": "0",
                    "time": "21/09/2020-23:50:16",
                    "content": "I don’t like the idea of a time lock as it may scare away new investors, those new to DEX’s or even ETH as a whole. All while making the price less stable because you don’t know when some Whale is going to dump after their time lock is up. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.382575757575757
                },
                {
                    "author_link": "https://gov.uniswap.org/u/miawivxx",
                    "index": "87",
                    "likes": "3",
                    "time": "23/09/2020-02:36:49",
                    "content": "I oppose to this because this will lead to a dump situation, If uniswap team decide to open the UNI-ETH pool and give UNI rewards to those pools, what will happen is that most UNI holders will stake their coins at that pool and the few remaining in circulation will be the ones that will decide its price and if a ETH-UNI whale staking at that pool decides to sell his rewards even the smallest sell will collapse price and people staked at that pool will be subjected at a hughe loss since they have wrapped versions of a token (impermanent loss) In fact this was the modus operandi of previous DeFi scam teams. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party giving entirely negative feedback on proposal"
                    ],
                    "Sentiment": 5.166666666666667
                },
                {
                    "author_link": "https://gov.uniswap.org/u/JokerTheBond",
                    "index": "88",
                    "likes": "0",
                    "time": "23/09/2020-09:10:54",
                    "content": "If there is an higher liquidity on UNI-ETH it will be harder for the price to dump because it would require much more UNI to be sold. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.083333333333334
                },
                {
                    "author_link": "https://gov.uniswap.org/u/emobe",
                    "index": "89",
                    "likes": "0",
                    "time": "23/09/2020-10:10:28",
                    "content": "Why do you care about CEXs when Uniswap is a DEX? Rewarding people who put liquidity into trading UNI makes perfect sense. It didn’t make sense to put it up right away but definitely at some point it should be considered. CEX pairs are pretty meaningless when it comes to this ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.279761904761905
                },
                {
                    "author_link": "https://gov.uniswap.org/u/miawivxx",
                    "index": "90",
                    "likes": "0",
                    "time": "23/09/2020-13:59:00",
                    "content": "On the Uniswap exchange maybe yes, the problem is that we are being traded on Binance, which is where prices are taken. That is why if most of the UNIs are staked in the uniswap pool, the price difference would cause the UNIs distributed in the liquidity campaign to be sold in the foreign market, and since the foreign market has low UNI liquidity, price volatility will be higher, therefore if a whale staking at UNI pool decided to sell all his UNI, price dump will occur ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Native",
                    "index": "92",
                    "likes": "0",
                    "time": "23/09/2020-15:08:51",
                    "content": "Is there a way to make rewards specific to local UNI pools on UniSwap to keep incentive local ? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Mr_Po",
                    "index": "93",
                    "likes": "4",
                    "time": "23/09/2020-16:28:07",
                    "content": "I think this proposition if realized wisely would benefit Uniswap ecosystem and UNI token holders greatly over the long term . In my opinion UNI/ETH pool is the only ‘speculative asset’ pool that makes sense to add for additional UNI distribution.  Let’s take a look at it from UNI token holder’s point of view.  At this point in time if you want to maximize the amount of UNI tokens you own over the next 4 years of the token distribution, it is not quite obvious whether or not you should add your UNI tokens to UNI/ETH liquidity pool or just hold them. Because there is a real risk that if over the next 4 years UNI price rises over ETH significantly and stays that way, that because of impermanent loss problem you’ll have less UNI than a person who did nothing with them, i.e. who didn’t provide value for the network in terms of adding liquidity. So distributing some additional UNI towards UNI/ETH liquidity providers would eliminate that problem and make the decision easy for long term UNI holder.  On the other hand, it would complicate the decision for liquidity providers of other current pairs.  For example, if you’re providing liquidity on ETH/USDT ‘for money’, at this point it’s quite obvious for you to sell the crops for your yield farm for a coin that has store of value capacity. Like, a YFI vault pool would make a perfect job for you at executing whatever APY there is to be farmed by just mining and selling the UNI tokens. If we were to introduce UNI/ETH rewards, these calculations become much less obvious, which in turn removes a decent bit of selling pressure from UNI token . So both points feed into supporting long term holders of UNI token . And getting them to own bigger % of overall supply, which is fundamentally a good thing for the network development. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.942901234567901
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Darkhane",
                    "index": "94",
                    "likes": "0",
                    "time": "23/09/2020-18:38:22",
                    "content": "    Mr_Po:  which in turn removes a decent bit of selling pressure from UNI token .   Selling pressure is a problem only if the token is useless. If UNI token gives fees then the price will find an healthy equilibrium. Everything else is speculation : It reminds me of companies that buy back their own shares. This raises prices for a while only, but then it collapse  because it creates no value. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "None",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.5476190476190474
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Mr_Po",
                    "index": "95",
                    "likes": "2",
                    "time": "23/09/2020-19:29:52",
                    "content": "Ok then, let’s completely disregard buying and selling pressure terms. Given that liquidity provision is the main proposition Uniswap offers don’t you think that: UNI token that provides liquidity in UNI-ETH pair is more valuable to the ecosystem then the UNI token that drains that liquidity by being staked ? My position is that UNI/ETH Pool tokens provide more value to the ecosystem then UNI tokens alone. This means two things for me:  UNI/ETH Pool tokens should have some sort of UNI loss insurance compared to simple holding of UNI tokens. This could be granted by a moderate amount of extra distribution of UNI tokens towards UNI/ETH pool UNI/ETH Pool tokens should be granted  proportional voting rights to the amount of UNI locked in liquidity pair proportional amount of fees that are given to UNI holders    By no means do I argue with the point that fees distributed towards UNI token holders would bring the value to the token, I think it’s the most obvious thing to do. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.075757575757575
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Json101",
                    "index": "96",
                    "likes": "4",
                    "time": "23/09/2020-20:05:02",
                    "content": "It seems to me that this is essential to the healthy functioning of the uniswap exchange. At the moment the majority of the circulating supply of UNI is held on centralised exchanges which means that uniswap can be controlled by its centralised competitors as far as i understand the situation. Having an extra incentive for the UNI/ETH pair should rebalance this and allow the users of uniswap to steer the decisions of the exchange towards sucsessful outcomes, rather than self destructive outcomes which is the likely desire of the big centralised exchanges. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Json101",
                    "index": "97",
                    "likes": "2",
                    "time": "23/09/2020-21:23:02",
                    "content": "I see your point but I think that UNI is mostly held and traded on the centralised exchanges at the moment and this is a much bigger risk to uniswap governance than some short term price manipulation. A larger UNI/ETH pool and UNI rewards from it will help rebalance the control of the exchange back towards the users rather than uniswaps competitors. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/rileyjt",
                    "index": "98",
                    "likes": "1",
                    "time": "25/09/2020-14:53:49",
                    "content": "    PhABC:  For instance, we could pick currencies that are most traded on Binance or Coinbase to try to bring back these tokens trader back to Uniswap.   I agree. And UNI is the 4th highest volume market on both Coinbase and Binance, so it should definitely be in the short list of markets we want to incentivize. Currently this T1 list looks something like: LINK, UNI, YFI ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.416666666666666
                },
                {
                    "author_link": "https://gov.uniswap.org/u/BitSavage0202",
                    "index": "99",
                    "likes": "0",
                    "time": "25/09/2020-18:23:44",
                    "content": "    iwearahoodie:  uni / ETH pool   I agree! add ETH incentive to entice the community! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/nicoGD",
                    "index": "100",
                    "likes": "1",
                    "time": "25/09/2020-19:36:22",
                    "content": "Very good point ! Aiming at the biggest markets in order for more people to come. New Uniswap customers will then use other pools and bring money to the system. THIS will increase the value of $UNI. Not throwing $UNI to ourselves, I agree. @JokerTheBond noticed that the Curve AMM is much more efficient than Uniswap AMM for stablecoins exchange, which is true. So maybe we should concentrate on the other biggest markets : bridged BTC and biggest volume ERC20s. Today this would mean renBTC, and/or LINK, pooled with ETH and/or stablecoins. Also btw, do we really need to incentivise other pools than the four we already incentivise ? Notice than after BTC, ETH and LINK, the 4th biggest market on binance is $UNI/$USDT today  So maybe we will come to incentivse $UNI pool some day. But I agree it is no the priority today. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.999431818181819
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Darkhane",
                    "index": "101",
                    "likes": "1",
                    "time": "25/09/2020-21:03:25",
                    "content": "    Mr_Po:   UNI/ETH Pool tokens should have some sort of UNI loss insurance compared to simple holding of UNI tokens. This could be granted by a moderate amount of extra distribution of UNI tokens towards UNI/ETH pool UNI/ETH Pool tokens should be granted  proportional voting rights to the amount of UNI locked in liquidity pair proportional amount of fees that are given to UNI holders      But why do you want to incentive this pool? If UNI is successful and distributes a lot of fees, the trading volume and demand will naturally increase. The core value of UNI is volume, not artificial support. Right now there is no need to incentive any other pools : all the DEX volume is on Uniswap, Sushiswap is dead… ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.819196428571428
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Sifu",
                    "index": "102",
                    "likes": "1",
                    "time": "25/09/2020-22:33:05",
                    "content": "The pool seems to currently earn around 65% APY. $50MM liquidity, Currently takes over $220k worth of UNI tokens (45000) to cause 1% slippage. I think it’s doing fine without the incentives so far. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.816666666666666
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Mr_Po",
                    "index": "103",
                    "likes": "2",
                    "time": "26/09/2020-00:15:02",
                    "content": "This is a good question. I do agree that from the sheer liquidity provision standpoint the pool is incentivized enough at the moment by the fees. But I do not think that it is all about volume only: it is also about liquidity and it is also about governance. From the governance standpoint it’s quite important that as many UNI tokens as possible either stay in people’s wallets or are locked in Uniswap contracts. I think it is beneficial to encourage participation in UNI governance, and one just feeds into the other in the proposition I made. I’m sure there are alternative ways to solve for the same things. Incentivization of UNI pairs + granting UNI LPs voting rights:  makes it obvious that it is more fruitful to keep your UNI on Uniswap than on any other exchange  allows UNI maximalists to participate in the distribution event in a safe way . People who only want to own UNI and ETH in this topic’s case. I definitely do think that this group of actors both deserves to receive the distribution rewards and is likely to contribute to the protocol development.  It makes UNI produce value within the protocol instead of just sitting on the sidelines.  It is logical that when you get a mining rig in a mining factory – you mine. So it seems logical to me that the main token of a decentralized liquidity platform is super liquid, and it doesn’t compromise its governance. In a good, fair system where incentives align evenly different groups of actors tend to mix with each other. It shouldn’t be a choice for you to get rewards because you vote or because you mine liquidity with your token, you should be able to do both as both provide value for the network. If I were to propose the amount of additional UNI distributed to a pool, it would intend to create quite a moderate increase in the APY. I think that it would sound more or less fair if the APY for UNI pair would be on par with other pairs. Also I do think that it is irresponsible to bring tokens that have weak store of value properties to Uniswap liquidity mining programme. So I would like to bring at least some of those properties to UNI, and the best way to do that is through fees distribution. I do consider that just generally adding more UNI pairs would be beneficial for the token, not just UNI/ETH, but also UNI/USD and UNI/BTC. Let all the maximalists in  But even beyond that, having more traded UNI pairs would very likely be beneficial. UNI could become the reserve currency of Uniswap, why not? If we were to manage UNI as an exchange token, exchanges do tend to list a ton of pairs for their tokens. Maybe it is not neccessary, the key question is: is it valueable enough that we wish to spend treasury funds to incentivise it? I think at least incentivizing UNI/ETH and UNI/USD would be valuable, but maybe 1 type of dollar is enough. But at the same time it is crucial that we don’t grant these pairs crazy APYs, as it would ruin everything very fast. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.861284722222222
                },
                {
                    "author_link": "https://gov.uniswap.org/u/MarkOSullivan94",
                    "index": "104",
                    "likes": "2",
                    "time": "28/09/2020-11:39:58",
                    "content": "    rileyjt:  UNI is the 4th highest volume market on both Coinbase and Binance   This is a big reason why it would be good to add it to the list of pools eligible for rewards. Better to avoid the centralized exchanges holding UNI. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/DnewNick",
                    "index": "105",
                    "likes": "0",
                    "time": "28/09/2020-12:52:34",
                    "content": "It has.  The more expensive uni is, the more difficult it is to buy them for accumulation in the same hands. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/_Ruanpotgieter97",
                    "index": "106",
                    "likes": "0",
                    "time": "04/10/2020-12:54:27",
                    "content": "@iwearahoodie agree!  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/meigui888",
                    "index": "107",
                    "likes": "0",
                    "time": "04/10/2020-18:40:32",
                    "content": "       ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/melveyr",
                    "index": "108",
                    "likes": "6",
                    "time": "06/10/2020-04:36:25",
                    "content": "Number of reasons to do this… #1 we don’t want UNI being held on centralized exchanges because it allows CZ to vote for us which is obviously not good. UNI liquidity should stay on Uniswap #2 Current UNI inflation penalizes UNI holders at the expense of providers of liquidity in the other pairs. Why are we punishing holders of the governance token? They should at least get same rewards, if not more than the other pools. If we don’t do this bots will continue to farm and dump using market orders, making the UNI market more chaotic than it needs to be. #3 Instead of farmer bots instantly dumping all of their UNI (sometimes not even on our exchange!), they might direct a portion of it back into the UNI/ETH pool. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://gov.uniswap.org/u/meigui888",
                    "index": "109",
                    "likes": "0",
                    "time": "06/10/2020-09:26:56",
                    "content": "Hope to start soon！  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/neozaru",
                    "index": "110",
                    "likes": "1",
                    "time": "06/10/2020-11:12:40",
                    "content": "The fact that this would help UNI escape from centralized exchanges totally sold me on this <3 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/melveyr",
                    "index": "111",
                    "likes": "1",
                    "time": "06/10/2020-12:37:13",
                    "content": "How do we get this over the line? Uni holders are bearing all of the protocol inflation to subsidize transient bot farmers that market sell all of their UNI. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/CryptoGeex",
                    "index": "112",
                    "likes": "1",
                    "time": "07/10/2020-09:04:13",
                    "content": "Please do it, I would be in heaven! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Alex17",
                    "index": "113",
                    "likes": "3",
                    "time": "07/10/2020-21:30:25",
                    "content": "Moving this year since Marco yelled at me  Hey Everyone, I wanted to share some thoughts on the two main proposals being discussed within this governance channel, and why I think we should be championing a UNI/ETH farming pool before any retroactive airdrop that @nadav_dharma and the rest of the Dharma team have been proposing. This proposal is in no way questioning the merits of the retroactive airdrop. As an analyst working in this space I have my own opinions on it, but it will ultimately come down to governance to decide what to do. That is what is nice about governance tokens, my opinion doesn’t matter. To discuss why I think a UNI/ETH rewards pool should come before any retroactive airdrop, I want to take a high level look at what has worked over the past few months in during the yield craze. To me the what has surprised me the most has not been the amount of capital going into farming (You can see growth in TVL here: https://defipulse.com/) but the speed at which this capital has been rotating to different assets. There is no other asset class where billions of dollars can rotate investments in a few clicks at 3am on a Sunday night  But to me this makes it clear that these new assets have no investible moat. That has lead me to ask what does have a moat, and what else is benefiting from this trend when looking at how to invest. To me this is pretty clear, it is the underlying assets that are used to earn yield in almost all new farming projects. This is your YFI’s, SNX’s, LEND’s, and LINK’s. These have all been assets used to farm in multiple farming projects from YAM to Kimchi, and all saw increases in price because of it. I see this because of two reasons. The first being it locks up a significant percentage of the circulating supply causing a liquidity crisis on the buyside. With high yields, more people look to buy the underlying asset to capture that yield, causing a recursive feedback loop to the upside. The second and more important is that it gives an additional use case to a governance token. The token is  making people money rather than just a say in governance  I discussed this more in another thread about whether the fee switch should be a dividend or a token burn.(Message 47, [POLL] How Would We Structure a Fee Reward? ) Alittle different, but apply the same line of thinking here. Turning towards a UNI/ETH pool. By having UNI as an underlying asset to earn more UNI we would accomplish both of the two things outlined above. We would lock up a significant chunk of UNI and holders of UNI would make money/earn yield rather than just a say in governance, and ultimately help end the sell pressure that UNI has been seeing. It would also begin pulling UNI off of centralized exchanges, which I think is everyone’s goal. This should be done before any vote on either retroactive airdrop proposal because it will provide a way for the new UNI holders to make more money instead of just seeing 400 UNI offers across all exchanges. I believe a UNI/ETH rewards pool will have a significant impact on slowing down any dilution in the form of retroactive airdrops as well as begin building a price floor for UNI overall, and would love to see this proposal up for a vote and active before any retroactive airdrop proposals. I am happy to answer any questions or concerns to what I have outlined above. Long UNI. ",
                    "links": [
                        "https://gov.uniswap.org/t/poll-how-would-we-structure-a-fee-reward/5790/49"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.879410583103764
                },
                {
                    "author_link": "https://gov.uniswap.org/u/GreyEcologist",
                    "index": "114",
                    "likes": "2",
                    "time": "09/10/2020-01:45:15",
                    "content": "Yes! Let’s make this happen! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/lorryxiong",
                    "index": "115",
                    "likes": "3",
                    "time": "09/10/2020-10:14:19",
                    "content": "agree, let’s vote for the UNI/ETH pool first! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5625
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Uni_Man",
                    "index": "116",
                    "likes": "1",
                    "time": "09/10/2020-17:47:47",
                    "content": "God a lot of posts here. I have some issues with governance tokens in Liquidity pools. Pros:  Pairing a governance token that has value with another token (I would prefer this be to a stablecoin like DAI, USDC etc.) in effect the UNI UNI-DAI or UNI-USDC token has sqrt less volatility than the UNI token alone.   The positive of a large number of people holding these is if a significant portion of the outstanding does this - it can provide a price support - and acts as a measure of confidence in the project.   For UNI holders holding UNI in these pairs is a way to dampen price volatility as the UNI UNI-stablecoin volatility goes by sqrt of price moves.  Particularly relative to the stablecoin price.  Cons  Incentivizing these basically drains liquidity that would be used for governance.  I have a 3rd suggestion btw.   How about rewarding people who provide liquidity in the common pools that also not just hold UNI in their wallets but have also participated in governance with it?   This seems a more sensible way to additionally reward people who hold UNI.  Give them a LP reward that includes a bonus based on the UNI in the LP providers wallet participating in governance decisions.   Weight it as a UNI held at time of a vote (i.e. what they could vote) over all the times a vote happened to create a 0-1 weight of that UNI participating in governance and give them their governance participation weight * the UNI LP provider participation amount.   This way you have to be a LP provider into a uniswap farming fund that gives UNI rewards AND be active in governance to receive any of the extra UNI returns based on your wallets governance participation. Based on the above I want to abstain.   IF we could have UNI UNI-pairs included in governance AND  earn a UNI return I would be all for adding all UNI UNI-tokenpairs into governance with UNI rewards generally as well as a bonus for people who used the UNI in the UNI UNI-tokenpairs and any other UNI in governance as I describe in the suggestion above. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.512987012987013
                },
                {
                    "author_link": "https://gov.uniswap.org/u/jrali889",
                    "index": "117",
                    "likes": "0",
                    "time": "10/10/2020-12:20:51",
                    "content": "I totally agree with this!! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/brockelmore",
                    "index": "118",
                    "likes": "8",
                    "time": "11/10/2020-22:55:50",
                    "content": "Hi all, Brock from YAM here. I just want everyone to be aware of the issues that come along with incentivizing locking up a governance token without taking necessary steps beforehand. We experienced this at YAM and I would like to pass my learnings onto this community. There has already been an issue with getting enough delegation power to pass proposals. If this is implemented, it will almost certainly lock governance if the system stays as it is and a UNI/ETH pool is added. This is because of how the Compound-esc governance system works. Any UNI in the incentivizer will have 0 voting power. There would need to be additional work done to add voting power to the incentivizer staking contract as well as the Governor contract to prevent total lockup of the voting system. Again to really nail the idea home: “just adding a UNI/ETH pool isn’t hard” is wrong and actually requires major changes to incentivizer contract and the governor. I’m not sure who would implement this as I doubt it is a priority for the team ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.353084415584416
                },
                {
                    "author_link": "https://gov.uniswap.org/u/UNI-TED",
                    "index": "119",
                    "likes": "0",
                    "time": "11/10/2020-23:43:22",
                    "content": "Very important to take in consideration, thank you. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.6
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Chsu-oscar",
                    "index": "120",
                    "likes": "0",
                    "time": "14/10/2020-02:00:32",
                    "content": "If add UNI/ETH pool to create new UNI, will it effect the price ETH? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.681818181818182
                },
                {
                    "author_link": "https://gov.uniswap.org/u/sblevins",
                    "index": "121",
                    "likes": "1",
                    "time": "14/10/2020-22:42:42",
                    "content": "There are more benefits to stealing UNI from centralized exchanges. Leaving them on CEXs gives those CEXs a lot of voting power ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Unicorns",
                    "index": "122",
                    "likes": "1",
                    "time": "21/10/2020-15:18:16",
                    "content": "I personally think a reduction of UNI incentive distribution should be done for any pair that is not UNI/XXX. And slightly higher distribution rewarding for the actual believers who support UNI hence UNI/XXX pairs. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.9375
                },
                {
                    "author_link": "https://gov.uniswap.org/u/chrisblec",
                    "index": "123",
                    "likes": "2",
                    "time": "21/10/2020-16:06:59",
                    "content": "    brockelmore:  I just want everyone to be aware of the issues that come along with incentivizing locking up a governance token without taking necessary steps beforehand.   This has been my major concern around a UNI/ETH pool and would need to be addressed before I could vote “yes”. UNI is first & foremost a voting token, and it needs to retain its voting ability while it’s locked up as liquidity. There have been some ideas floating around in other threads - perhaps someone can start a new thread with potential solutions to this issue? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.409902597402597
                },
                {
                    "author_link": "https://gov.uniswap.org/u/PinkHorse",
                    "index": "124",
                    "likes": "0",
                    "time": "21/10/2020-16:43:46",
                    "content": "where and when we can vote on this? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/mmoossttaaffaa",
                    "index": "125",
                    "likes": "2",
                    "time": "21/10/2020-19:42:44",
                    "content": "I think there are a lot of risks if we couln’t add incentives to this pool there will be more than 170 m UNI available in the treasury in the first year (14m each month) if too much UNI accumulated is the treasury with relatively low UNI in the circulation this will increase the incentives for a coalition between few large holders to reach the Quorum and steal 10s of millions of UNI and they will face little resistance because of the low UNI supply in circulation so spending part of the treasury on this pool will lower the incentives to do this attack and also will increase the resistance by the holders since there will be a higher circulating supply ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.713392857142857
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Micah",
                    "index": "126",
                    "likes": "5",
                    "time": "22/10/2020-08:02:36",
                    "content": "Incentivizing the UNI:ETH pool disincentivizes governance participation! This is generally bad for governance as it lowers the cost of a governance attack. Already, there are notable incentives for pooling UNI:ETH because you get the normal liquidity provider fees.  Adding more incentive beyond that makes the incentive misalignment problem even worse. The core of the problem is that the way voting and delegation is currently implement means that you have to choose to either participate in governance or participate in liquidity pooling.  You cannot, currently, both participate in liquidity pooling and participate in governance. If we first address the problem of being unable to vote while also pooling, then this proposal becomes slightly more reasonable.  However, as it stands I think anything that incentivizes doing something with UNI other than holding it in a wallet is a bad idea. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party giving entirely negative feedback on proposal"
                    ],
                    "Sentiment": 4.875
                },
                {
                    "author_link": "https://gov.uniswap.org/u/GreyEcologist",
                    "index": "127",
                    "likes": "0",
                    "time": "23/10/2020-17:19:18",
                    "content": "It does retain its voting ability. The proposal will only incentivize farmers who currently dump their tokens to hodl their tokens. Will it also incentivize voters to add their $UNI to the pool, yes, but that’s their choice, it’s their token to what they deem most valuable for them. I think it’s better from a coding POV anyway to separate the incentivization of the pool from the implementation of a snapshot of staking derivative. It’s cleaner and iterative (hence safer) approach. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.uniswap.org/u/GreyEcologist",
                    "index": "128",
                    "likes": "1",
                    "time": "23/10/2020-17:25:05",
                    "content": "I strongly disagree. First, it’s up to the token holder to decide what is more valuable to them. Second, there’s a lot of token holders that don’t vote. And that’s true in any governance. You’re not going to get 80% of any community to meaningfully participate in governance, that’s not realistic. I think it’s a false problem. I do agree that enabling LP to vote is useful. But it can be implemented later. The $UNI is a governance token, but it is first and foremost a token, ie a value capture mechanism. It’s a flaw in the token model not to have a sink or value capture. I’m happy to discuss this point on Discord, but I have been making that point for weeks now, I’m surprised we’re still going back and forth on this point. There is a flaw in the token model. Incentivizing the UNI/ETH pool is a way to fix it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.071428571428571
                },
                {
                    "author_link": "https://gov.uniswap.org/u/barbagianni",
                    "index": "129",
                    "likes": "1",
                    "time": "26/10/2020-09:29:25",
                    "content": "I think the question whether rewards should be added is a very interesting one. It would shift the incentives of investing in UNI into a different direction, while also influencing how the governance will work in practice. I was trying to get an overview over the arguments, to for an opinion, but I feel there might be more to it. I used a structured discussion tool, to map out the arguments. (has been used to discuss ETH governance before) I’d be happy if you help me add the missing pieces!    Kialo – 23 Oct 20    The Uniswap UNI/ETH pool should be eligible for pool rewards This discussion aims at summarizing arguments around whether pool rewards should be introduced for pooling UNI/ETH.  Discussion in the governance forum: Link      ",
                    "links": [
                        "https://www.kialo.com/the-uniswap-unieth-pool-should-be-eligible-for-pool-rewards-41774"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.699999999999999
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Mien",
                    "index": "130",
                    "likes": "0",
                    "time": "26/10/2020-17:38:45",
                    "content": "Yes nên làm như vậy… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/rileyjt",
                    "index": "131",
                    "likes": "2",
                    "time": "26/10/2020-23:00:53",
                    "content": "The dangers of not doing this are significant IMO. If UNI trading markets move to primarily be on centralized exchanges, it allows for Uniswap’s primary competitors to use their dominance of those markets capture its governance. They don’t even have to try to decide whether to be a LP or a voter, they can effectively do both as a centralized custodian. The economic implications of this proposal are debatable, but IMO this is about an existential threat to the protocol and keeping price discovery out of CeFi should be a primary objective. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.696428571428572
                },
                {
                    "author_link": "https://gov.uniswap.org/u/L.A.SanJose",
                    "index": "132",
                    "likes": "1",
                    "time": "27/10/2020-02:19:34",
                    "content": "Yes. This is a good idea! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.375
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Mien",
                    "index": "133",
                    "likes": "0",
                    "time": "27/10/2020-17:47:31",
                    "content": "Ok tôi nghĩ đó là 1 ý tg hay ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Mien",
                    "index": "134",
                    "likes": "0",
                    "time": "27/10/2020-17:55:43",
                    "content": "Yes làm sao để thêm nhóm vào ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/rahulthemoksh",
                    "index": "135",
                    "likes": "1",
                    "time": "27/10/2020-23:39:47",
                    "content": "It definitely make sense to add $Uni/$Eth pool as it will push people to hodl $Uni for long term. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.875
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Joncatch",
                    "index": "136",
                    "likes": "0",
                    "time": "03/11/2020-07:13:02",
                    "content": "To add to this I though maybe have additional stable coin-uni pools as well to retain those stable coin amounts ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Joncatch",
                    "index": "137",
                    "likes": "0",
                    "time": "03/11/2020-07:35:19",
                    "content": "A locking mechanism for voting would resolve this as well longer term option of course ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Uni3",
                    "index": "138",
                    "likes": "1",
                    "time": "06/11/2020-14:47:34",
                    "content": "We need to incentivize people to not keep tokens on exchanges. Exchanges are threat and competitor to Uniswap. Binance already offers 0.44% interest on UNI per year without any lock! In my opinion we have to give any UNI holder bigger interest every month than exchanges. For example 1% monthly would be 2 million tokens on 200 million circulating supply. We have 14mil tokens in treasury every month. @Alex17 @Mr_Po @iwearahoodie @PhABC @Micah ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.3125
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Mr_Po",
                    "index": "139",
                    "likes": "0",
                    "time": "06/11/2020-18:18:52",
                    "content": "In my opinion, there’s nothing wrong with UNI holders being able to get interest on their UNI tokens outside Uniswap. If the preparation period (voting delay) is introduced, UNI holders will be able to keep their UNI whenever they like. And mobilize them if they wish to vote on an important proposal. It is by far the easiest and the cheapest solution to the problem. On a side note, I don’t think there is a big chance of Binance being a threat to Uniswap governance. There is a decent possibility that Compound will transform Uniswap governance, bringing more power to large UNI holders. There is a proposal there that will allow for UNI held there to vote. By the way, currently, Compound offers 5.88% APY on UNI. More ‘minority’ votes will unwillingly vote the way the ‘majority’ wants with that system. But it is up to COMP holders to decide that. ",
                    "links": [
                        "https://www.comp.xyz/t/setup-community-cuni-voting/440"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.95748299319728
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Uni3",
                    "index": "140",
                    "likes": "0",
                    "time": "07/11/2020-02:22:28",
                    "content": "    Mr_Po:  On a side note, I don’t think there is a big chance of Binance being a threat to Uniswap governance.   Maybe not by itself but with other exchanges, they are threat. Binance and Huobi have around 30mil UNI on main accounts.     Mr_Po:  By the way, currently, Compound offers 5.88% APY on UNI.   This is 0.477% monthly and we can easily give 1% monthly to everyone account except exchanges. (that would cost only around 13% of monthly treasury at the moment) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.410714285714286
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Mr_Po",
                    "index": "141",
                    "likes": "0",
                    "time": "07/11/2020-03:11:41",
                    "content": "    Uni3:  exchanges, they are threat.   What makes you think they are a threat? What is the scenario of attack you find feasible for them? Launching any sort of attack on Uniswap would cost these exchanges much more value loss through reputational damage than what they could ever get out of it. On top of that, it is quite unlikely to succeed, as a lot of money would vote against that. Even if the attack somehow succeeds, UNI can be forked to a pre-attack state. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Joncatch",
                    "index": "142",
                    "likes": "2",
                    "time": "07/11/2020-23:26:39",
                    "content": "Surely with all the interest in this pool and the fee locking timer some whale could start the vote in this one? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/PinkHorse",
                    "index": "143",
                    "likes": "1",
                    "time": "09/11/2020-07:47:39",
                    "content": "Obviously this proposal has a lot of traction, yet nothing is clear about how those things will be voted and when implemented? The current rewards end in 7 days. Nothing is clear what is next? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.2
                }
            ]
        },
        {
            "thread_link": "https://gov.uniswap.org/t/add-snx-eth-pool-to-list-of-pools-eligible-for-uni-rewards/3286",
            "title": "Add SNX/ETH pool to list of pools eligible for UNI rewards ",
            "index": 3286,
            "category": [
                "Proposal Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/maxbronstein",
                    "index": "1",
                    "likes": "20",
                    "time": "19/09/2020-02:28:38",
                    "content": "SNX is an important collateral asset within the DeFi ecosystem, it currently secures nearly $150 million USD worth of synthetic assets on Ethereum. Greater liquidity for SNX makes it easier for stakers to manage their debt obligations and for the entire system to stay sufficiently collateralized, both of which in turn make DeFi’s largest pool of synthetic asset liquidity more efficient. Let’s make it happen! ",
                    "links": [],
                    "GPT-summary": "The author is proposing to add SNX/ETH pool to the list of pools eligible for UNI rewards. The proposal explains the importance of SNX as a collateral asset in the DeFi ecosystem and how greater liquidity for SNX can benefit the entire system. The proposal is open for feedback and the author is advertising it to the community. A 3rd party can extend to the proposal, give constructive criticism, or ask questions about it.",
                    "GPT-proposal-categories": [
                        "Token economics",
                        "Interoperability and Scalability",
                        "Grants, Funding and resource allocation"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 6.375
                },
                {
                    "author_link": "https://gov.uniswap.org/u/CLCL",
                    "index": "2",
                    "likes": "6",
                    "time": "19/09/2020-02:30:24",
                    "content": "100% support this proposal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/devops199fan",
                    "index": "3",
                    "likes": "3",
                    "time": "19/09/2020-02:34:21",
                    "content": "i strongly support this proposal  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.166666666666667
                },
                {
                    "author_link": "https://gov.uniswap.org/u/nottrunner",
                    "index": "4",
                    "likes": "2",
                    "time": "19/09/2020-02:54:59",
                    "content": "Totally agree. 100% supported. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/BatmanDeFi",
                    "index": "5",
                    "likes": "2",
                    "time": "19/09/2020-03:03:32",
                    "content": "Yes please! 100% support ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/caquinn",
                    "index": "6",
                    "likes": "1",
                    "time": "19/09/2020-03:13:53",
                    "content": "I support this proposal! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Governor",
                    "index": "7",
                    "likes": "1",
                    "time": "19/09/2020-03:18:00",
                    "content": "I support this 100% and will vote in favour of this  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/haiko",
                    "index": "8",
                    "likes": "0",
                    "time": "19/09/2020-04:37:43",
                    "content": "yes snx is one of the best projects out there ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/itsahedge",
                    "index": "9",
                    "likes": "1",
                    "time": "19/09/2020-05:48:59",
                    "content": "Yes. Fully support this proposal! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Batercuc",
                    "index": "10",
                    "likes": "0",
                    "time": "19/09/2020-09:49:14",
                    "content": "100% support this proposal  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/cryptocatVC",
                    "index": "11",
                    "likes": "2",
                    "time": "19/09/2020-13:46:22",
                    "content": "SNX holders are holding till 60$ they dont need liquidity. So that’s a vote for “No” if it wasnt clear. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/monet-supply",
                    "index": "12",
                    "likes": "5",
                    "time": "19/09/2020-14:18:58",
                    "content": "Hey folx! I disagree with this initiative, because I don’t think that SNX brings additional value to the exchange as a bridge asset. Eg. increased ETH/USDC depth improves the trading experience for many additional assets beyond USDC and ETH by virtue of users being able to trade USDC <> other assets with more liquidity. USDC is also directly paired with many assets on UniV2, so it may improve generalized liquidity for ETH as well. I’d argue the same applies for DAI, USDT, and WBTC, but isn’t applicable to SNX. The only people who benefit directly from incentivizing SNX liquidity depth are SNX holders. I’d be much more interested in an sUSD/ETH pool for incentives, as this could serve as bridge liquidity between Uniswap and the Synthetix Exchange. PS. No need to make a reply to write “+1 agree”, can always use the like button  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.284090909090909
                },
                {
                    "author_link": "https://gov.uniswap.org/u/OliverNChalk",
                    "index": "13",
                    "likes": "1",
                    "time": "19/09/2020-15:56:16",
                    "content": "I don’t think any of the outlined dontpoints show why uni should invest UNI here. Afaik, there are no liquidations in SNX yet so the only order flow coming to uni for SNX would strictly be speculatory. If SNX had liquidations they needed to process, it would be much more interesting imo ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.666666666666666
                },
                {
                    "author_link": "https://gov.uniswap.org/u/JusDAO",
                    "index": "14",
                    "likes": "2",
                    "time": "20/09/2020-04:45:52",
                    "content": "show your UNI  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/hjmomtazi",
                    "index": "15",
                    "likes": "1",
                    "time": "21/09/2020-00:19:51",
                    "content": "Liquidations do exist in the system now    SIPs    SNX liquidation mechanism Synthetix Improvement Proposals (SIPs) describe standards for the Synthetix platform, including core protocol specifications, client APIs, and contract standards.      ",
                    "links": [
                        "https://sips.synthetix.io/sips/sip-15"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/mindfulnews",
                    "index": "16",
                    "likes": "0",
                    "time": "23/09/2020-21:11:00",
                    "content": "100% Suport this proposal too. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/darwell",
                    "index": "17",
                    "likes": "0",
                    "time": "23/09/2020-22:18:33",
                    "content": "very good, 100% support this proposal ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.549999999999999
                },
                {
                    "author_link": "https://gov.uniswap.org/u/azimanuar5874",
                    "index": "18",
                    "likes": "0",
                    "time": "06/04/2021-07:29:35",
                    "content": "Great…meanwhile the price for that pair are the most lowest compared with other network…totally agree ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9375
                },
                {
                    "author_link": "https://gov.uniswap.org/u/azimanuar5874",
                    "index": "19",
                    "likes": "0",
                    "time": "06/04/2021-08:44:11",
                    "content": "Gotcha…you are right monet…i also prefer in USDC becasue the coin paired with many asset… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.9642857142857135
                }
            ]
        },
        {
            "thread_link": "https://gov.uniswap.org/t/add-rmpl-eth-pool-to-list-of-pools-eligible-for-uni-rewards/3345",
            "title": "Add RMPL/ETH pool to list of pools eligible for UNI rewards ",
            "index": 3345,
            "category": [
                "Proposal Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/KingKong1",
                    "index": "1",
                    "likes": "9",
                    "time": "19/09/2020-03:45:36",
                    "content": "RMPL is a DeFi protocol with an elastic supply model. This means that the total supply of RMPL is constantly changing via a Rebase, the exact date and time of the Rebase is random to prevent price manipulation and exploitation by bots. With its partnership with Yellow and its recent Bithumb Global exchange listing (more coming soon), RMPL is becoming a crypto to hodl in any portfolio. Adding RMPL/ETH pool to list of pools eligible for UNI rewards would be extremely beneficial to both Uniswap and RMPL.  Let’s make it happen. Website: https://www.rmpl.io/ Telegram Group: https://t.me/RMPLTG ",
                    "links": [
                        "https://t.me/RMPLTG"
                    ],
                    "GPT-summary": "The author of the post is proposing to add the RMPL/ETH pool to the list of pools eligible for UNI rewards. The post explains the benefits of adding this pool and encourages readers to support the proposal. Additionally, the post provides links to the RMPL website and Telegram group for further information.",
                    "GPT-proposal-categories": [
                        "Token economics",
                        "Interoperability and Scalability",
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.2875000000000005
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Zynot7",
                    "index": "2",
                    "likes": "4",
                    "time": "19/09/2020-05:17:01",
                    "content": "Volume is there, community is there, project is legit and team building more use cases for RMPL Win win for everyone! Please add it    uniswap.info    Uniswap Info      ",
                    "links": [
                        "https://uniswap.info/pair/0x6a3d23fa07c455f88d70c29d230467c407a3964b"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 8.833333333333332
                },
                {
                    "author_link": "https://gov.uniswap.org/u/TFBalean",
                    "index": "3",
                    "likes": "6",
                    "time": "19/09/2020-06:08:08",
                    "content": "RMPL is a refined and a randomized version of AMPL.  It’s a young and vibrant project with great potential. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.333333333333333
                },
                {
                    "author_link": "https://gov.uniswap.org/u/salad-fingers",
                    "index": "4",
                    "likes": "3",
                    "time": "19/09/2020-07:03:12",
                    "content": "Solid project, so much potential, the team have delivered everything so far, much more projects currently in process to work around the RMPL ecosystem. RMPL is a DeFi settlement token designed to prevent market manipulation with an elastic supply model. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.6000000000000005
                },
                {
                    "author_link": "https://gov.uniswap.org/u/zooaka",
                    "index": "5",
                    "likes": "3",
                    "time": "19/09/2020-10:30:32",
                    "content": "I totally want to stake my RMPL for UNI tokens. Please allow me to do so! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Stoli",
                    "index": "6",
                    "likes": "2",
                    "time": "19/09/2020-10:42:39",
                    "content": "This is a no brainer considering $RMPL achieved #2 volume on uniswap on release day and stayed in the top 10 with 60M in volume for 8 days. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Sebasbraz",
                    "index": "7",
                    "likes": "2",
                    "time": "19/09/2020-10:52:16",
                    "content": "RMPL is an amazing project!!! Would really like to stake for Uni. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/somebodywashere",
                    "index": "8",
                    "likes": "3",
                    "time": "19/09/2020-10:53:24",
                    "content": "Well, pretty catchy project, random rebases looks interesting ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.416666666666666
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Justio",
                    "index": "9",
                    "likes": "1",
                    "time": "19/09/2020-14:26:29",
                    "content": "I am interested. RMPL is less manipulated than other rebase coins because of its randomized rebase.  They have a small but engaged following.  Let’s stake RMPL for UNI ! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving positive feedback on proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.708333333333333
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Foreverholiday",
                    "index": "10",
                    "likes": "1",
                    "time": "19/09/2020-14:30:57",
                    "content": "Agreed. RMPL is the best coin pls add ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/monet-supply",
                    "index": "11",
                    "likes": "3",
                    "time": "19/09/2020-14:32:05",
                    "content": "Firm NO. RMPL is not a bridge asset, it’s a dead end. Incentivizing RMPL liquidity is just giving a handout to RMPL holders, it does not improve the trading experience for any other users. This thread feels like it’s getting brigaded as well. Please don’t make a separate post if all you have to say is “yes, agree, +1”. Use the like button instead. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.125
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Noah",
                    "index": "12",
                    "likes": "0",
                    "time": "26/09/2020-22:00:13",
                    "content": "This topic was automatically closed after 3 days. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.09090909090909
                }
            ]
        }
    ],
    "group_index": "307"
}