{
    "poll_list": [
        {
            "id": "0x1bf2c3fb48e31f4e006ce6349967088fc726cbf1d1518eca60babfe44e9e2895",
            "title": "Should Uniswap provide Rage Trade with an additional use grant?",
            "discussion": "",
            "body": "Authors: [Noodles](https://twitter.com/crypto_noodles) + [Crema](https://twitter.com/0xCrema) + [Vertex](https://twitter.com/0xVertex) \n\nRelated Discussion: Our proposal is similar to [Voltz Additional Use Grant](https://gov.uniswap.org/t/should-uniswap-provide-voltz-with-v3-additional-use-grant/15669)\n\n### What is Rage Trade?\n\n[Rage Trade](https://rage.trade) is a new perpetual swap  protocol built using Uniswap v3. Many on-chain perpetuals currently use Uniswap v2 style vAMMs. However, traders and LPs benefit from v3’s concentrated liquidity so we opted to build on v3 to design the most capital efficient perp.\n\n### Why do we need an additional use grant?\n\nOur proposal is most similar to the proposal by Voltz Protocol. Unlike Voltz we have not forked UNI v3’s code but instead we have built on top of it. Think of Uniswap as our matching engine, and on top we have built a risk engine to enable leverage trading. We have wrapped the following on top of Uniswap’s core: leverage trading, leverage LPing, cross-margin, liquidations, and real time funding rates. \n\n### What changes have we made that require additional use?\n\nWe have built libraries to enable leverage trading, leverage LPing, and real-time funding rates. Each of the libraries below makes use of Uniswap’s BUSL protect code (that we require an additional grants use for):\n\n- [SimulateSwap](https://github.com/RageTrade/core/blob/ea881f6204f1bf7f065bd9a4b11ee792592c7230/contracts/libraries/SimulateSwap.sol): This library is used to simulate a swap on Rage. It makes use of Uniswap’s TickBitMap and SwapMath libraries.\n- [TickBitmapExtended](https://github.com/RageTrade/core/blob/ea881f6204f1bf7f065bd9a4b11ee792592c7230/contracts/libraries/TickBitmapExtended.sol): This library is a slightly modified version of Uniswap's TickBitmap, required in SimulateSwap for using tick data from UniswapV3Pool contract.\n- [TickExtended](https://github.com/RageTrade/core/blob/ea881f6204f1bf7f065bd9a4b11ee792592c7230/contracts/libraries/TickExtended.sol): This library is used to enable realtime funding payments on Rage Trade. They borrow from Tick libraries of Uniswap v3.\n- [LiquidityPosition](https://github.com/RageTrade/core/blob/ea881f6204f1bf7f065bd9a4b11ee792592c7230/contracts/libraries/LiquidityPosition.sol#L5): This library enables leverage liquidity providing (and the accompanying margin logic). It utilises the Uniswap SqrtPriceMath library to do so.\n\n\n ### How will approving this proposal benefit Uniswap?\n\n1. Onchain Perps bring new liquidity to UNI v3: Since we are strictly built on top of UNI v3 (not a fork) all additional TVL + trading volume is strictly additive to UNI v3.\n\n2. Rage Trade will spend significant R&D resources on designing efficient v3 LP strategie: Rage has already designed a new LP strategy known as the 80-20 strategy that composes with Curve’s tricrypto.\n\n3. Liquid & composable on-chain perpetuals enable a whole new world of Uniswap spot strategies: Using perps, Uniswap v3 users can mitigate impermanent loss on Uni v3 via delta hedging. Additionally multi-collateral perps open new avenues and payoffs that are currently not possible on the spot market. \n\n### Conclusion\n\nRage Trade stands to benefit Uniswap in many ways and strictly adds to Uniswap’s value as a protocol. We look forward to discussing our proposal with the Uniswap community and answering questions in the comments below.\n",
            "choices": [
                "Yes",
                "No"
            ],
            "scores": [
                3642395.090248266,
                66.30507572393458
            ],
            "start": 1657635461,
            "end": 1657962000,
            "snapshot": "15128294",
            "state": "closed",
            "author": "0x507c7777837B85EDe1e67f5A4554dDD7e58b1F87",
            "space": {
                "id": "uniswap",
                "name": "Uniswap"
            }
        },
        {
            "id": "0xbfeb7f3c4a3f1d4979b59129f9a78ee217183b0656a480612d261233fb3f8c62",
            "title": "Consensus Check -  Should Uniswap Provide Voltz with v3 Additional Use Grant",
            "discussion": "",
            "body": "Dear Uniswap Community,\n\nA few weeks ago, Voltz submitted a proposal to request for an “Additional Use Grant” from the Uniswap Community. This would allow Voltz to use aspects of the v3 code that is subject to a “Business Source License”. Voltz recognises the significant R&D that went into v3 and as a result is offering Uniswap Governance 1% of Voltz future tokens, alongside a number of non-financial benefits. The full proposal is available here https://gov.uniswap.org/t/should-uniswap-provide-voltz-with-v3-additional-use-grant/15669?u=simonj\n\nWe were delighted and humbled by the response from the Uniswap Community to our Temperature Check vote, with >99% voting in favour of our proposal! The Temperature Check also met the 25k UNI Yes threshold required to pass.  https://snapshot.org/#/uniswap/proposal/0x4f42b3215c4028edd947dc69980a9b8ba837ffbe3d0caa60d999406d634c8e79 \n\nWe are now kicking off the Consensus Check - the 2nd of 3 votes, which requires 50k UNI Yes votes to pass - with the community. https://gov.uniswap.org/t/consensus-check-should-uniswap-provide-voltz-with-v3-additional-use-grant/16012?u=simonj\n\nWe’re excited to see how the community votes! And we’re excited to make this happen and set a precedent for DeFi! \n\n\n**Voltz TL;DR**\n\nVoltz is a new DeFi primitive, bringing interest rate swaps to DeFi in a manner that is up to 3000x more capital efficient than alternative models. Voltz, therefore, is not a competitor to Uniswap but instead is complementary; interest rate swaps are a core pillar of well-functioning financial systems - so as Voltz grows it should help DeFi grow, which in turn should have second order benefits to Uniswap.\n",
            "choices": [
                "Yes",
                "No"
            ],
            "scores": [
                3284888.2999831676,
                403
            ],
            "start": 1644224400,
            "end": 1644656400,
            "snapshot": "14154289",
            "state": "closed",
            "author": "0xFD4295c1A0b07e6b706f0Ab83dC9eB461b7f17B3",
            "space": {
                "id": "uniswap",
                "name": "Uniswap"
            }
        },
        {
            "id": "0x4f42b3215c4028edd947dc69980a9b8ba837ffbe3d0caa60d999406d634c8e79",
            "title": "Temperature Check - Should Uniswap Provide Voltz with v3 Additional Use Grant?",
            "discussion": "",
            "body": "Dear Uniswap Community,\n\nThe Voltz Labs team recently submitted a proposal to request for an “Additional Use Grant” from Uniswap governance. This would allow Voltz to use aspects of the Uniswap v3 code that is subject to the “Business Source License”.\n\nVoltz is a new DeFi primitive, bringing interest rate swaps to DeFi in a manner that is up to 3000x more capital efficient than alternative models. Voltz, therefore, is not a competitor to Uniswap but instead is complementary; interest rate swaps are a core pillar of well-functioning financial systems - so as Voltz grows it should help DeFi grow, which in turn should have second order benefits to Uniswap.\n\nThat said, the Voltz Labs team recognise the significant R&D that went into v3 and as a result are offering Uniswap governance 1% of Voltz future tokens alongside a number of additional non-financial benefits. The full proposal, and discussion, can be found here: https://gov.uniswap.org/t/should-uniswap-provide-voltz-with-v3-additional-use-grant/15669?u=simonj\n\nFollowing positive feedback, including the discussion with the Voltz Labs founders on the Uniswap discord community call last week, we are now initiating the Temperate Check with the Uniswap community.\n\nWe’re excited to see how the community votes. And excited about the opportunity to make this happen and set a precedent for DeFi!\n",
            "choices": [
                "Yes",
                "No"
            ],
            "scores": [
                235389.28838682565,
                423.95782696824176
            ],
            "start": 1642582800,
            "end": 1642842000,
            "snapshot": "14031057",
            "state": "closed",
            "author": "0xFD4295c1A0b07e6b706f0Ab83dC9eB461b7f17B3",
            "space": {
                "id": "uniswap",
                "name": "Uniswap"
            }
        },
        {
            "title": "Should Uniswap Provide Voltz with v3 Additional Us…",
            "date": "Proposed on: Feb 28th, 2022",
            "yes_votes": "77.41M",
            "no_votes": "1.26K"
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/should-uniswap-provide-voltz-with-v3-additional-use-grant/15669",
            "title": "Should Uniswap Provide Voltz with v3 Additional Use Grant ",
            "index": 15669,
            "category": [
                "Temperature Check"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/simonj",
                    "index": "1",
                    "likes": "23",
                    "time": "22/12/2021-14:58:35",
                    "content": "TL;DR Voltz is a new defi primitive that brings interest rate swaps to DeFi in a manner that is up to 3000x more capital efficient than alternative models. This is achieved through a variety of mechanisms, including the use of concentrated liquidity pioneered in Uniswap v3 (ref). However, since v3 is subject to a Business Source License, Voltz needs an Additional Use Grant to allow us to use aspects of the v3 code base within the Voltz AMM (ref). We recognise the significant R&D that went into v3. As a result, we would like to offer the Uniswap Treasury 1% of Voltz’s future token supply. Beyond the financial benefit for Uniswap token holders, if approved, this will also represent a first for DeFi and set precedent for future Additional Use Grant requests. In addition, we also believe there are a number non-financial benefits to Uniswap, including: 1. Interest Rate Swaps are a core pillar of well-functioning financial systems. By supporting Voltz, Uniswap is helping create a fundamental DeFi primitive, which will ultimately help fuel the growth of the entire sector. This will benefit everyone wanting decentralised finance to become the future financial system for billions of people around the world. 2. Uniswap continues to be seen as the grandfather of DeFi. By allowing a non-competing and innovative protocol to leverage the Uni v3 codebase, not only will it help the whole sector grow, it will also further strengthen Uniswap’s reputation as one of the core enablers of the decentralised finance movement. 3. Voltz will help amplify the ecosystem’s understanding of how concentrated liquidity provisioning works. Having a non-competing AMM leveraging Uni v3 code helps to further educate the market on how to LP via Uni v3. This should have a second-order impact on liquidity that ends up deployed on Uni v3 directly. As a result, we humbly request Uniswap’s community to consider this proposal in depth. We look forward to having a fruitful conversation with the Uniswap community and look forward to answering your comments and questions. About Voltz Voltz is a noncustodial automated market maker for Interest Rate Swaps (IRS). The protocol uses a concentrated liquidity virtual AMM (vAMM) for price discovery only, with the management of the underlying assets performed by the Margin Engine. The combined impact of these modules means counterparties can create and trade fixed and variable rates through a mechanism that is up to 3,000x more capital efficient than alternative interest rate swap models. Critically, Voltz has figured out how to trade fixed and variable rate exposures through a two-axis AMM, leveraging the concept of concentrated liquidity pioneered in Uniswap v3. Whilst Voltz uses some of the v3 code base, there are a large number of additional complex innovations that had to be unlocked in order to create an Interest Rates Swap specific AMM. These innovations have a number of important consequences when considering the merit of providing Voltz with an Additional Use Grant: 1. Voltz and Uniswap are complementary not competitive Interest Rate Swaps are a core pillar of well-functioning financial systems. By bringing Interest Rate Swaps to DeFi, Voltz should help accelerate DeFi’s displacement of traditional finance. In turn, this will help boost the growth of the sector, whilst also unlocking a new wave of financial primitives, structured products and trading strategies for the whole ecosystem. Uniswap is not an Interest Rate Swap AMM. As a result, Voltz and Uniswap don’t compete. Instead they can be complementary to each other - where one grows, the ecosystem grows, which in turn helps the other grow too. By providing Voltz with an Additional Use Grant, Uniswap can help accelerate the growth of a fundamental primitive that’s needed within DeFi. 2. Voltz cannot route trades via Uni v3, instead the code is native to Voltz AMM There are numerous additional innovations required to create an Interest Rate Swap specific AMM. Whilst parts of the v3 code base are required to create the concentrated liquidity logic, trades can’t simply be routed via Uni v3 since the v3 AMM is not designed for Interest Rate Swaps. Instead the concentrated liquidity logic is native to the Voltz AMM, meaning an Additional Use Grant is required. It’s possible for the Voltz Labs team to implement concentrated liquidity logic in a way that doesn’t utilise some of the Uniswap v3 code base. However, the v3 code is battle-tested and already optimised to enable concentrated liquidity to exist in the most efficient way. As a result, the cleanest and most logical option is to request an Additional Use Grant. 3. Uniswap cannot adjust their AMM to create an IRS market Following the above - the creation of an Interest Rate Swap specific AMM requires a significant amount of new code and innovation. As a result, we think it’s highly unlikely Uniswap can simply adjust the v3 code base to enter the interest rate swap market - meaning Voltz and Uniswap will remain complementary rather than ever becoming competitors. Alongside this, Voltz is also highly aligned with the values of Uniswap, decentralised finance and the broad web3 ecosystem more generally. Voltz Protocol will be managed by the VoltzDAO. This will enable Voltz to effectively become a public good that is owned and managed by the community that uses it. In turn this will continue to support the wider movement of DeFi to build a more transparent, more equitable and more efficient financial system. Our Proposal We recognise the significant R&D that went into developing the concentrated liquidity logic used within Uniswap v3. Therefore, we would like to offer the Uniswap Treasury 1% of Voltz’s future token supply for the Additional Use Grant. Voltz Tokens will be provided to Uniswap Treasury following the Voltz Token Generation Event. Beyond the financial benefit to Uniswap token holders, this will also represent a first for DeFi and set a precedent for future Additional Use Grant requests. In addition, we also believe there are a number non-financial benefits to Uniswap, including those outlined in the TL;DR. Conclusion We’d like Uniswap’s community to consider this proposal in depth. Not just based on the merits of the proposal itself, but also on the precedent this sets as an industry first for DeFi. We look forward to having a fruitful conversation with the Uniswap community and look forward to answering your comments and questions. Note: we wanted to share this proposal with the community for digestion and feedback. If feedback is directionally positive, we’ll initiate the Temperature Check on Snapshot in the new year. ",
                    "links": [
                        "https://github.com/Uniswap/v3-core/blob/main/LICENSE",
                        "https://gov.uniswap.org/t/governance-proposal-should-uniswap-provide-voltz-with-v3-additional-use-grant/16276",
                        "https://gov.uniswap.org/t/should-uniswap-provide-rage-trade-with-an-additional-use-grant/17087"
                    ],
                    "GPT-summary": "The post proposes that Uniswap provides Voltz with an Additional Use Grant to allow Voltz to use aspects of the Uniswap v3 code base within the Voltz AMM. The proposal offers Uniswap Treasury 1% of Voltz's future token supply and outlines the benefits of supporting Voltz, including creating a fundamental DeFi primitive, amplifying the ecosystem's understanding of concentrated liquidity provisioning, and strengthening Uniswap's reputation. The post also explains why Voltz needs an Additional Use Grant and how Voltz and Uniswap are complementary. The author invites feedback from the Uniswap community.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Token economics",
                        "Interoperability and Scaleability",
                        "Community and engagement"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.361548462360151
                },
                {
                    "author_link": "https://gov.uniswap.org/u/uniyj",
                    "index": "2",
                    "likes": "3",
                    "time": "23/12/2021-03:37:13",
                    "content": "This is definitely an interesting additional use case. I had joined the Voltz Discord and asked about how Voltz AMM will interact with Uni-v3, but unfortunately I was not able to join the AMA that included this question (waiting for the post-AMA answer/update post to come out). I guess this post here somewhat answers the high-level question, though I am still very curious and interested in the details in implementation. Also, one more question – what license will the Voltz AMM code fall under? Thanks. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.407142857142857
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Naught",
                    "index": "3",
                    "likes": "5",
                    "time": "23/12/2021-04:43:54",
                    "content": " We recognise the significant R&D that went into v3. As a result, we would like to offer the Uniswap Treasury 1% of Voltz’s future token supply.  A great way to set a precedent on cooperative interactions between DAO’s! The proposal is straight forward, it does not ask for any Uni Funds, rather it is providing a symbiotic association through the acknowledgement of Uniswap’s innovation and effort.  1. Interest Rate Swaps are a core pillar of well-functioning financial systems. By supporting Voltz, Uniswap is helping create a fundamental DeFi primitive, which will ultimately help fuel the growth of the entire sector. This will benefit everyone wanting decentralised finance to become the future financial system for billions of people around the world.  I am not familar with how Intrest Rate Swap’s work, but it is something I would be intrested in learning more about.  Our Proposal We recognise the significant R&D that went into developing the concentrated liquidity logic used within Uniswap v3. Therefore, we would like to offer the Uniswap Treasury 1% of Voltz’s future token supply for the Additional Use Grant. Voltz Tokens will be provided to Uniswap Treasury following the Voltz Token Generation Event.  Have you recieved a Uniswap’s Grant in the past, or is the name Additional Use Grant a new term relating to using the V3 code in a novel way? Also just to clarify: this proposal is not asking for any UNI token transfer, rather it is looking to distribute an allocation to the Uniswap Treasury for use of the V3 code? I like the direction of the proposal, and I am in support of a Additonal Use Grant Model. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.808238636363637
                },
                {
                    "author_link": "https://gov.uniswap.org/u/caideguang",
                    "index": "4",
                    "likes": "2",
                    "time": "23/12/2021-06:05:28",
                    "content": "This is an interesting suggestion~ Can make a tentative exploration ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/eek637",
                    "index": "5",
                    "likes": "2",
                    "time": "23/12/2021-18:07:03",
                    "content": "I’m Erin from Avantgarde Finance. We have done the majority of the dev work on Enzyme Finance, where among other things we have built integrations that allow Enzyme vault managers to trade and provide liquidity on both v2 and v3 of Uniswap. We are generally supportive of this proposal and the precedent it sets. The Business Source License was implemented in Uniswap v3 to protect the Core codebase and allow for the Uniswap community to build an ecosystem around it (according to the blog post anyway, we weren’t in the strategy conversations) without having to fend off another vampire attack. Importantly, the post goes on to mention that “Uniswap governance can … grant exemptions to the license at any time…”. In our opinion, we should not interpret the protection this license confers not as “no one can build on the core codebase except Uniswap Labs” but rather “no one can build on the Core codebase except members of the Uniswap community as decided by Uniswap governance”. Granting the Uniswap treasury a meaningful portion of the Voltz token supply provides at the very least an economic alignment of the two protocols that we think is a meaningful signal that Voltz fits the bill as a community member. And given that  Voltz Protocol will be managed by the VoltzDAO  the grant presumably enables Uniswap to have a say in how Voltz grows. That said, we’d be interested to know what governance mechanisms you’ll be using @simonj? ",
                    "links": [
                        "https://uniswap.org/blog/uniswap-v3#license",
                        "https://gov.uniswap.org/t/rfc-accountability-committee-proposal/20316/13"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 6.1468750000000005
                },
                {
                    "author_link": "https://gov.uniswap.org/u/jonsnow",
                    "index": "6",
                    "likes": "2",
                    "time": "23/12/2021-20:01:53",
                    "content": "I like the idea, but think it should be 10% - 15% token allocated into uniswap treasury to make it matter. 1% is too immaterial. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Naught",
                    "index": "7",
                    "likes": "1",
                    "time": "24/12/2021-13:16:01",
                    "content": "I think it is a good question on the rational for Voltz to go with 1% vs say, 2%, 3% etc. I am not opposed to the 1% proposed here, but am curious to how the number was arrived. As it does set a precedent to similarly structured proposals. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/simonj",
                    "index": "8",
                    "likes": "0",
                    "time": "24/12/2021-15:57:39",
                    "content": "hey @uniyj - ahh shame you missed our AMA - but we’ll be posting some of the key takeaways over the holidays! fwiw, there’s actually been some discussion in the voltz discord about this recently if you choose to jump back in :). On the license - our understanding is that we need what’s called an “Additional Use Grant” from uniswap governance, as shown here: v3-core/LICENSE at main · Uniswap/v3-core · GitHub. But happy to be corrected if we’ve got that wrong! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.526041666666667
                },
                {
                    "author_link": "https://gov.uniswap.org/u/simonj",
                    "index": "9",
                    "likes": "2",
                    "time": "24/12/2021-16:06:43",
                    "content": "Great to hear you’re supportive of the proposal!  On your questions: Additional Use Grant No we haven’t ever received a grant from Uniswap. Instead, our understanding is that Voltz needs what’s described as an “Additional Use Grant” from Uniswap Governance to use the v3 code. According to the License, this then needs to be listed at v3-core-license-grants.uniswap.eth (as shown here). But happy to be corrected if we’ve misunderstood something! Tokens Yes that’s right - we’re not asking for any UNI token’s. Instead we’re proposing we provide Uniswap with 1% of Voltz’s future tokens for the Additional Use Grant ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.710714285714285
                },
                {
                    "author_link": "https://gov.uniswap.org/u/simonj",
                    "index": "10",
                    "likes": "0",
                    "time": "24/12/2021-16:20:54",
                    "content": "hey @jonsnow sorry to hear you think 1% is too low. it certainly wasn’t intended to be perceived as an immaterial amount! clearly though there’s no precedent here, but we were looking to put something attractive together as a proposal  There are also a number of non-financial benefits associated with the proposal too - what’s your perspective on those? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.667857142857144
                },
                {
                    "author_link": "https://gov.uniswap.org/u/simonj",
                    "index": "11",
                    "likes": "1",
                    "time": "24/12/2021-16:28:29",
                    "content": "From a Voltz perspective, we were keen to put a “stake in the ground” with something we felt was attractive for the Uni community that also recognised the R&D that had gone into v3. When considered alongside the non-financial benefits to Uni and the sector as a whole, plus the fact the Voltz model is completely unique except for the concentrated liquidity logic, we felt 1% was directionally correct. But we were keen to initiate conversations off the back of our proposal - so curious to hear your thoughts too? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 6.2749999999999995
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Naught",
                    "index": "12",
                    "likes": "1",
                    "time": "25/12/2021-09:00:36",
                    "content": "Just some initial thoughts off the top of my head for the 1% fee. If I hypothetically value Voltz in the future at 1 billion dollars market capital, then the license fee for V3 license and additional value to the Uniswap Treasury is around 10 million dollars. This 10 million as a fee seems pretty good to me as it equates to a 3 cent EPT (earning per token, 290k holders~ /10million) for very low engagement other than the initial vote. However, the 1% stake in Voltz might not be enough at stake for UNI governance to actively engage participants around Voltz DAO proposals in the future. This is a bigger unknown with DAO voting on other DAO’s and how to incentives participation. The 1% is good for just  the narrow scope of the V3 Additional Use Grant, with future incentive for UNI treasury/ or UNI holder’s to engage in active participation in the Voltz Governance. Also, Thank you for answering my questions on the Additional Use Grant. I am not familar with how it is suppose to be used. Your research look like it is the right interpretation. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.426065162907268
                },
                {
                    "author_link": "https://gov.uniswap.org/u/jonsnow",
                    "index": "13",
                    "likes": "1",
                    "time": "25/12/2021-20:33:01",
                    "content": "I think it is less of compensating R&D cost, but the downside reputational risk UNI community is underwriting. If there is a “hack” or “exploiting” event happens, and even if it is actually not related to the code of V3, people might still thinks it shows potential vulnerability in Uniswap V3 code. This is the reputational risk the community is undertaking. That’s why I think 1% is immaterial for the community to take this risk. If the project is valued between 100mm-1bn, the marginal value to the uniswap treasury is only 1-10mm, but if a reputational damaging event happened, a 10-20% sell off can cause a few bn market cap loss for Uniswap. If we probability adjust it, say 1% of chance, that’s would still be $10mm - $100mm. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.633333333333333
                },
                {
                    "author_link": "https://gov.uniswap.org/u/artur",
                    "index": "15",
                    "likes": "2",
                    "time": "26/12/2021-11:02:31",
                    "content": "Hey @jonsnow, thanks for this! Great to hear your concerns and see your thinking. That said, it’s not clear to me how a (hypothetical) hack of Voltz would cause rational actors to sell off 10-20% of Uni without first checking the underlying cause of the exploit. In addition, if a hack were to occur then the likelihood of it being caused by Uni’s codebase (before digging into the details) is only around 5% given that only c.5% of our code is like-for-like from v3, with another c.15% refactored to make it work for interest rate swaps / our model. So it feels like the downside risk to Uniswap is extremely low. But when looking at the upside, it’s worth adding that derivative trading volumes tend to be orders of magnitude higher than spot volumes. So if Voltz has the potential to be worth 1bn, then arguably we’d have found product-market-fit and have the potential to be worth $20-100bn, meaning the “opportunity” is heavily skewed to the upside for the Uni community. That’s before accounting for all the additional second-order benefits of helping the whole ecosystem grow and what that means to Uniswap over the long-term. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.8
                },
                {
                    "author_link": "https://gov.uniswap.org/u/cryptoworld",
                    "index": "16",
                    "likes": "0",
                    "time": "26/12/2021-11:09:15",
                    "content": "I  think it should be  at least 5% token allocated into uniswap treasury ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Buckerino",
                    "index": "17",
                    "likes": "3",
                    "time": "26/12/2021-11:10:08",
                    "content": "I also think this is an awesome usecase which would be beneficial. Good stuff. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.25
                },
                {
                    "author_link": "https://gov.uniswap.org/u/artur",
                    "index": "18",
                    "likes": "0",
                    "time": "26/12/2021-12:04:59",
                    "content": "Hey @cryptoworld, thanks for this! Would be great to hear the reasoning behind your proposition and where it is stemming from. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.083333333333334
                },
                {
                    "author_link": "https://gov.uniswap.org/u/uniyj",
                    "index": "19",
                    "likes": "0",
                    "time": "27/12/2021-15:07:34",
                    "content": "Hi. I was asking more about Voltz’s license plan for the rest of your code, i.e. the non-Uniswap-v3-derivative parts. Will it be one of the commonly used open-sourced licensing? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/eek637",
                    "index": "20",
                    "likes": "0",
                    "time": "27/12/2021-17:43:59",
                    "content": "Hi @simonj  and @artur. Could you elaborate on the plans for the governance structure of Voltz? Will you be using Governor Bravo or something else? Trying to get a feel for the non-financial benefits of this token grant. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/tobyshorin",
                    "index": "21",
                    "likes": "5",
                    "time": "28/12/2021-17:32:00",
                    "content": "Hi Simonj, this is Toby Shorin representing Other Internet. Here’s our Sybil profile. Thanks for the thorough writeup. Overall, we’re interested in moving this proposal forward. We share Avantgarde Finance’s interpretation of the Uniswap V3 blog post. It’s within the scope of governance to determine exemptions to the V3 code license. We have one request for Voltz team. Prior to the temperature check, it would be great if you can host a voice call on the Uniswap Discord bi-weekly community call to discuss the proposal and answer any community questions that come up. Let’s connect you with Boris so we get that put together. One question that was asked on this thread we’d like to follow up on is what governance model you are intending to use with Voltz. Do you have any intentions for Uniswap’s future DAO2DAO relationship and role in Voltz governance? On that topic, we have one suggestion to offer, drawing from our experience with the GitcoinDAO / Akita token situation earlier this year. Should this proposal move forward, it may be advantageous to consider having Uniswap’s future votes in Voltz governance delegated to one specific Uniswap governance member. In our view, qualifications for this would be a delegate who is familiar with the Uniswap V3 codebase and relevant tokenomics. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.791666666666666
                },
                {
                    "author_link": "https://gov.uniswap.org/u/simonj",
                    "index": "22",
                    "likes": "2",
                    "time": "29/12/2021-16:48:56",
                    "content": "Hey @eek637 sorry didn’t mean for your first message to not get replied to! Great to see your support and appreciate the detail on your understanding of the license! On the governance mechanism for VoltzDAO - this hasn’t been finalised yet, but what we do end up implementing will clearly be in the best interest of the community (which, if this proposal is approved, Uniswap governance would then be a part of). It’s worth adding that we take a research-first approach to everything we do. So, until we complete the research, I can’t confirm the exact mechanism we’ll use. It is worth adding that Voltz transition to a DAO will be incremental, meaning Voltz protocol will go through the process of progressive decentralisation. We’ll likely make our research on the governance mechanics open source at the point we start transitioning Voltz to a DAO to ensure we collect sufficient feedback from our community. Appreciate you may have a few Q off the back of this answer? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.839285714285714
                },
                {
                    "author_link": "https://gov.uniswap.org/u/simonj",
                    "index": "23",
                    "likes": "2",
                    "time": "29/12/2021-16:51:32",
                    "content": "Hey @tobyshorin. Great to see your support for the proposal  Will be awesome to host a discussion on the Uniswap Discord community call. Let us know the best way to set this up / intro us to Boris! On the governance point - I’ve just replied to Erin above on how we’ll go about deciding which mechanism we use. However, the delegation point sounds sensible and we’d be more than happy to allow Uniswap Governance to do this should you wish to. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 8.416666666666666
                },
                {
                    "author_link": "https://gov.uniswap.org/u/eek637",
                    "index": "24",
                    "likes": "0",
                    "time": "30/12/2021-15:32:03",
                    "content": "Thanks for this @simonj. The process of decentralization is tricky, and I definitely support a thoughtful, methodical transition. I was going to say that Kain from Synthetix has written extensively about this, but I see he’s a backer so that’s great news. That said, it makes measuring the potential upside of this token grant to the treasury a little more hand-wavy so as predicted, I do have a couple more questions that might help the community understand what we’d be getting. Apologies in advance if this info is out there, and feel free to answer these at whatever level of detail you feel comfortable:   What’s current state? E.g. who owns the Voltz contracts and to whom would this Additional Use Grant be issued?   What’s the intended order of operations once the grant is issued? Interested in hearing about both the product side and the governance side, and how those two might overlap   With the understanding that it’s subject to change based on the way the Voltz governance discussion progresses, what does the high-level token distribution look like? (I’m thinking messari-style pie chart here)   My opinion hasn’t changed on this proposal btw, I think it’s a great use case for the grant. I just think it makes sense, since it’d be a precedent, to get into the nitty-gritty details. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.298611111111111
                },
                {
                    "author_link": "https://gov.uniswap.org/u/tobyshorin",
                    "index": "25",
                    "likes": "0",
                    "time": "30/12/2021-17:49:55",
                    "content": "@BOR4 Boris I’m connecting you to @simonj from the Voltz team — when is the next community call? Let’s take this opportunity to get more discussion on the proposal at that time. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.uniswap.org/u/BOR4",
                    "index": "26",
                    "likes": "0",
                    "time": "03/01/2022-10:19:29",
                    "content": "@simonj let’s move this to Discord. Send me a DM to BOR4#8524 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/tobyshorin",
                    "index": "27",
                    "likes": "0",
                    "time": "03/01/2022-19:33:19",
                    "content": "Shoot an update here when there’s action on this! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://gov.uniswap.org/u/simonj",
                    "index": "28",
                    "likes": "1",
                    "time": "04/01/2022-06:33:00",
                    "content": "hey @BOR4 just DM’d you. Thanks for the intro @tobyshorin! Will post a message in here when there’s an update  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.uniswap.org/u/monet-supply",
                    "index": "29",
                    "likes": "2",
                    "time": "07/01/2022-20:16:47",
                    "content": "I think this proposal is really interesting! A few thoughts:  Is 1% share of token supply appropriate compensation for use of the v3 codebase?  This is a completely new sort of deal, so there’s not a lot of precedent to base the allocation from. It might be helpful for the Uniswap community to have some details about Voltz recent funding round(s) to get an idea of what 1% of token supply cost to your investors, as this would allow Uniswap to put a tentative dollar value on the license grant. This should help UNI holders make an informed opinion on whether 1% of supply is sufficient.  Do you envision any restrictions on further use of the v3 codebase outside of the described rate swap AMM mechanism?  What I’m getting at here is, this deal will only work from Uniswap’s perspective if we can be assured that you won’t launch a competing general purpose concentrated liquidity AMM. Maybe this question should be directed at Uniswap Labs legal team - is it possible to grant a limited purpose exception to the license (just for IRS AMM) without opening up the risk of a full fork of Uniswap v3? Appreciate any color you can give here! Both of the above concerns feel like they should be solvable, and I look forward to seeing how this proposal develops! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.292478354978355
                },
                {
                    "author_link": "https://gov.uniswap.org/u/eek637",
                    "index": "30",
                    "likes": "2",
                    "time": "08/01/2022-14:17:18",
                    "content": "Yeah I was interested in token allocations to investors too, waiting on an answer above. Re the 1% number, in chatting this through with @tobyshorin and bryan from Otherinternet last week, I sort of settled on thinking of the grant in similar terms as what you would pay to non-founding technical employee number 1 at a startup. In my experience and from my research,  0.50% / 3.00% is probably the range so 1% is defensible. I’m not sure if that’s right, but honestly I don’t know that it matters all that much. In my view, the point of the license isn’t to run a seed fund where Uniswap trades permission for token allocations. It’s a forcing function to make sure that the code is used to better the defi ecosystem without diluting the value of Uniswap itself. To that end, your question about further restrictions is definitely important and it would be great to have someone from Labs weigh in about that issue in particular but also this proposal more generally. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.177170868347339
                },
                {
                    "author_link": "https://gov.uniswap.org/u/simonj",
                    "index": "31",
                    "likes": "4",
                    "time": "09/01/2022-20:34:43",
                    "content": "Hey @eek637 @monet-supply, sorry for the delayed reply here and great to see your support of the proposal too @monet-supply! These questions probably make sense to respond to together, though will use your question structure @eek637.  Our understanding is that to ‘action’ the Additional Use Grant, Voltz use case needs to be “listed and defined at v3-core-license-grants.uniswap.eth” [reference]. We believe this could clearly state that the license is being awarded to the VoltzDAO, but whilst the VoltzDAO is being established it will be held on a temporary basis by Voltz Labs. Within this, we also believe it could clearly state that the grant is only being provided to enable the creation of an Interest Rate Swap AMM that does not compete with Uniswap. Happy to agree this language, including ensuring it addresses your concern @monet-supply. However, we’d also appreciate input from the Uniswap Labs team to make sure our interpretation is correct first. Voltz Labs will decentralize the protocol over a period of time. We have a number of tentative initiatives on the product roadmap (e.g. perpetuals, L2 scaling, etc.), along with the launch of governance, which is likely to happen at some point through 2022. Audits of our contracts are already underway and we plan on being on testnet later this quarter, subject to a successful Uniswap Governance vote and successful completion of the audit process. Our current thinking is that token distributions will be broadly equivalent to that of Uniswap’s. This means we’d have c.60% for the community (o/w c.5% may be for a corporate treasury), c.20% for investors and c.20% for the Voltz Labs team. Worth highlighting that this may be subject to change as thinking and requirements develop. For completeness, we were counting the 1% distribution to Uniswap Governance as part of the community allocation.  Finally on your point about valuation @monet-supply. I’d need to check if we can disclose that publicly, but what I can say is that it was high for a seed round (!). This was primarily driven off the fact that interest rate swaps are a core pillar of functioning financial systems (there’s c.$1,000tn of notional exchanged each year in TradFi IRS). So if we’re successful in building out an interest rate swap AMM and helping DeFi displace TradFi, then the Voltz “slice” of that new system has the potential to be one of the largest and most important of all the defi protocols. Or in simpler terms, a good outcome for Voltz could easily be a valuation of c.$100bn. At this point the 1% is really meaningful, before including the non-financial benefits. Let me know if you have additional questions! We’re also going to be on the Uniswap discord community call this Wednesday at 16:00 EST, so can answer follow-up questions there too if you’re able to join! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.221891711229946
                },
                {
                    "author_link": "https://gov.uniswap.org/u/tobyshorin",
                    "index": "32",
                    "likes": "5",
                    "time": "12/01/2022-21:23:59",
                    "content": "Following up on the last conversation, this is Other Internet and Avantgarde Finance’s proposal for how a future Uniswap-Voltz relationship might work. Authors: Toby Shorin (tobyshorin), Bryan Lehrer (bryanlehrer), Erin Koen (eek637) What we’re solving for We’re overall in support of Voltz’s proposal to license Uniswap V3 codebase. However, should the proposal pass, we want to ensure there are proper governance structures in place to ensure the success of the relationship between these two communities. In proposing such a framework, our goal is to ensure that the governance rights that come along with the token grant are 1) in fact used and 2) that their use does not come at a cost to Uniswap’s own governance. Instances of the first concern are obvious and widespread. Voter fatigue and lack of governance participation on important issues is a common criticism of tokenholder voting. When those issues are related to a different protocol altogether, it’s reasonable to expect participation to drop even further, and we’ve seen instances such as Index Coop’s metagovernance where this is the case. They have taken similar steps to what we are proposing here, and have empowered a small group to vote on issues when token holders do not reach a quorum. The second concern is a bit less common but potentially more destructive. We have found that when a significant amount of Project A token and voting power is granted from to Project B, it is costly to use regular tokenholder voting to determine actions taken with those tokens. For example, in May 2021, a significant portion of the AKITA token supply was donated to the brand new GitcoinDAO treasury by Vitalik. Without a plan for how to handle this, the entire Gitcoin steward community got embroiled in discussion over how to handle the tokens, hijacking the governance process and leading to steward churn. We suggest that Voltz and Uniswap will have a more successful relationship if Voltz voting power is delegated to a small committee of Uniswap community members. Proposed delegation committee  Three individuals from the Unsiwap community are selected to represent Uniswap’s interests in Voltz governance votes. Let’s call this the Uniswap Voltz Committee. Committee members are selected through a process that includes 1) an open nomination process, 2) a brief interview to prevent sybil attacks, and 2) a snapshot to elect the three committee members. The total amount of voting power in Voltz governance is delegated equally to each individual. In this format each individual has 1/3 of voting power. (We are opting not to use a multisig for flexibility). The Uniswap Voltz Committee is a paid position, compensated with $1,200 per person, per quarter, denominated in equal parts UNI and Voltz tokens. Members of the committee will hold one-year terms that must be renewed by Uniswap governance annually, beginning on the date of delegation. Full responsibility for voting is delegated from the community to the Committee. To facilitate transparency in representation, a new thread on the Uniswap governance form should be created for the Committee to post updates when it conducts a vote. It may also solicit feedback from the community using that thread at its own discretion.  We believe this proposal will ensure the Uniswap community’s interests in Voltz are represented, while also de-risking the token allocation from Voltz’s perspective to ensure that there is a party responsible for the significant amount of voting power it is offering to Uniswap. Furthermore we believe that this framework can be reused for similar types of partnerships in the future where a licensing deal is struck in exchange for a percentage of the licensee’s governance tokens. Next steps We’d like to get feedback on this proposal in the thread below. Voltz governance is not live yet, so we intend to put together a proper temperature check for this proposal closer to the date of Voltz’s token launch that will incorporate any feedback collected here. Provided we sense support for this proposal, we’ll put forward a new comment or post with self-nomination guidelines for being part of the committee, and start a search process for members. People who are knowledgeable about tokenomics, have a broad understanding of the DeFi landscape and tokenized financial products, and prior governance experience (especially in Uniswap!) will be very well qualified. This will be a first-of-its kind committee, so it will be a great opportunity to gain governance experience and participate in a meaningful community partnership. Looking forward to feedback on this. ",
                    "links": [
                        "https://snapshot.org/#/index-coop.eth/proposal/QmdXkzHzo9NvMBXxX9zFY6rwDv4yVTtfCnNgrxsNFbYzZg",
                        "https://www.akita.network/",
                        "https://gov.uniswap.org/t/rfc-accountability-committee-proposal/20316/13"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.590561868686868
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Naught",
                    "index": "33",
                    "likes": "0",
                    "time": "13/01/2022-03:56:05",
                    "content": "I am in favor of having a framework like the one you have proposed to get the full scope of how this allocation will function beyond just approving it to the treasury, and also making sure that the license is used appropriately. A few questions of clarity on your proposal:   The total amount of voting power in Voltz governance is delegated equally to each individual. In this format each individual has 1/3 of voting power. (We are opting not to use a multisig for flexibility).   Can you expand a bit more on technicals of how this would work? The Voltz tokens would be in the Uniswap treasury; so would the tokens have to be split into three address within the treasury in order for the community to set each delegate to each committee member? The Voltz allocation would not be leaving the treasury to any committee member controlled address correct?   The Uniswap Voltz Committee is a paid position, compensated with $1,200 per person, per quarter, denominated in equal parts UNI and Voltz tokens. Members of the committee will hold one-year terms that must be renewed by Uniswap governance annually, beginning on the date of delegation.   Are the Voltz coming out of the 1% allocated to Uniswap treasury or is this payed by Voltz treasury to the comittee members? Since Uniswap is paying the committee from its treasury, should Voltz also pay this fee outside of the 1% allocation?  Voltz governance is not live yet, so we intend to put together a proper temperature check for this proposal closer to the date of Voltz’s token launch that will incorporate any feedback collected here.  Is this a Proposal Merge? Would this new temperature check be a combination of the “Other Internet and Avantgarde” proposal outline which sets a precident for future license grants and Voltz (i.e. Other Internet/Avantgarde: Voltz V3 Additional Use Grant Proposal)? A merger of two proposals into one to then be put up for an eventual vote? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.36439393939394
                },
                {
                    "author_link": "https://gov.uniswap.org/u/eek637",
                    "index": "34",
                    "likes": "2",
                    "time": "13/01/2022-13:52:05",
                    "content": "Glad to hear you’re in favor! And happy to clarify, though everything is up for discussion:  Presuming that Voltz governance is similar to those systems we’ve seen so far, the tokens would never leave the Uniswap treasury and instead their voting power would be delegated in equal portions to each delegate’s wallet. There’s a lot of precedent for this type of governance delegation (e.g. the University blockchain clubs) Re compensation, tokens would come out of Uniswap treasury, not Voltz No, this is not a proposal merge. Based on the Community Call yesterday, I think the Voltz proposal to license the code will move to a snapshot at some point next week. We’ve posted the above in this thread to provide context, and to help form an answer to a question we were having ourselves.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.089285714285715
                },
                {
                    "author_link": "https://gov.uniswap.org/u/simonj",
                    "index": "35",
                    "likes": "1",
                    "time": "15/01/2022-14:05:20",
                    "content": "Hi @eek637 @tobyshorin, we really like the suggestions here! From a Voltz perspective we’d be supportive of this proposal - we’d be keen to ensure the Uni-Voltz relationship is successful and the Uniswap community has an effective mechanism to vote in Voltz governance decisions. Though we appreciate the mechanism used is ultimately a Uniswap governance decision. We’d also be supportive of this taking place in the build up to the Voltz Token Generation Event - though again appreciate this is a decision for the Uni community. To respond to your comment about the Temperature Check snapshot on our Additional Use Grant proposal. It was great to talk to the Uniswap community on Wednesday - off the back of that conversation we’ll be looking to start the Temperature Check next week. We’ve also reached out to the Uniswap Labs team to clarify their interpretation of the language that will need to be used at v3-core-license-grants.uniswap.eth. In the event there is a successful Temperature Check vote, we (Voltz) will suggest this language to Uniswap governance in advance of the Consensus Check. Any comments or thoughts in the meantime, we’d look forward to responding to. Otherwise, we’re excited to make this happen!  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.099431818181818
                },
                {
                    "author_link": "https://gov.uniswap.org/u/simonj",
                    "index": "36",
                    "likes": "1",
                    "time": "19/01/2022-11:24:10",
                    "content": "We have now kicked off the Temperature Check on Snapshot. We’re excited to see how the community votes. And we’re exciting about the prospect of making this happen & setting a precedent for DeFi! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://gov.uniswap.org/u/dadababa520",
                    "index": "37",
                    "likes": "1",
                    "time": "06/02/2022-15:07:17",
                    "content": "It’s definitely a good proposal ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                }
            ]
        },
        {
            "thread_link": "https://gov.uniswap.org/t/governance-proposal-should-uniswap-provide-voltz-with-v3-additional-use-grant/16276",
            "title": "Governance Proposal - Should Uniswap Provide Voltz with v3 Additional Use Grant ",
            "index": 16276,
            "category": [
                "Proposal Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/simonj",
                    "index": "1",
                    "likes": "5",
                    "time": "23/02/2022-20:38:39",
                    "content": "Dear Uniswap Community, The Voltz Labs team submitted the following proposal, and additional legal language, asking Uniswap Governance for a v3 Additional Use Grant in exchange for 1% of Voltz Future Tokens, alongside a number of non-financial benefits. After the proposal successfully passed both the Temperature Check and Consensus Check, we are now getting ready to initiate the final Governance Proposal vote. As a result, we have outlined below the draft code that will be executed by the Uniswap Timelock if the vote is successful. Through the rest of this week we are testing this code in a simulator: https://github.com/Uniswap/governance-seatbelt. When complete, we’ll post the final code that will be proposed to the Timelock. Should the community have any feedback we’d be excited to receive it. Otherwise, we plan on initiating the final vote on Monday 28th February. We have been humbled and thrilled with the support of the Uniswap community so far! We’re excited about the prospect of making this happen and setting a precedent for future DAO2DAO collaboration! DRAFT code that will be used to initiate simulations Reference: ​​https://github.com/Uniswap/deploy-v3 GovernorBravoDelegator.propose(targets, values, signatures, calldatas, description) where description = ”Voltz Additional Use Grant Proposal” targets = [ENS_REGISTRY_ADDRESS, PUBLIC_ENS_RESOLVER_ADDRESS] signatures = [\"\", “”] (because the function selector is included in the calldata) calldatas = [ “0x5ef2c7f0ec9ec573cf97ad1c270be71ac1de3b382790cb346036130c7d7ff844bf8f497415ff9b5bd7642701a10e5ea8fb29c957ffda4854cd028e9f6218506e6b509af20000000000000000000000001a9c8182c09f50c8318d769245bea52c32be35bc0000000000000000000000004976fb03c32e5b8cfe2b6ccb31c09ba78ebaba410000000000000000000000000000000000000000000000000000000000000000”, “0x10f13a8ca35d592ec6e5289a387cba1d5f82be794f495bd5a361a1fb314687c6aefea1f4000000000000000000000000000000000000000000000000000000000000006000000000000000000000000000000000000000000000000000000000000000c00000000000000000000000000000000000000000000000000000000000000021566f6c747a20556e69207633204164646974696f6e616c20557365204772616e740000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000003b5566f6c747a204c61627320546563686e6f6c6f6779204c696d697465642028e2809c566f6c747ae2809d29206973206772616e74656420616e206164646974696f6e616c20757365206772616e7420746f20616c6c6f772074686520566f6c747a2044414f20746f207573652074686520556e697377617020563320436f726520736f66747761726520636f646520287768696368206973206d61646520617661696c61626c6520746f20566f6c747a207375626a65637420746f206c6963656e736520617661696c61626c652061742068747470733a2f2f6769746875622e636f6d2f556e69737761702f76332d636f72652f626c6f622f6d61696e2f4c4943454e5345202874686520e2809c556e697377617020436f6465e2809d29292e2041732070617274206f662074686973206164646974696f6e616c20757365206772616e742c2074686520566f6c747a2044414f2072656365697665732061206c696d6974656420776f726c6477696465206c6963656e736520746f207573652074686520556e697377617020436f646520666f722074686520707572706f736573206f663a206372656174696e672c206465706c6f79696e6720616e64206d616b696e6720617661696c61626c652061737065637473206f6620616e20696e74657265737420726174652073776170206175746f6d61746564206d61726b6574206d616b6572202874686520e2809c49525320414d4de2809d293b20746f206d6f6469667920616e6420757064617465207468652049525320414d4d206f7665722074696d653b20616e64206465706c6f79207468652049525320414d4d20616e6420706f7274696f6e732074686572656f6620617320736d61727420636f6e747261637473206f6e20626c6f636b636861696e2d6261736564206170706c69636174696f6e7320616e642070726f746f636f6c732e2054686520566f6c747a2044414f206973207065726d697474656420746f2075736520737562636f6e74726163746f727320746f20646f207468697320776f726b2e2054686973206c6963656e736520697320636f6e646974696f6e616c206f6e20566f6c747a20616e642074686520566f6c747a2044414f20636f6d706c79696e67207769746820746865207465726d73206f662074686520427573696e65737320536f75726365204c6963656e736520312e312c206d61646520617661696c61626c652061742068747470733a2f2f6769746875622e636f6d2f556e69737761702f76332d636f72652f626c6f622f6d61696e2f4c4943454e53452e0000000000000000000000”] Note:  calldatas[0] is derived from a call to setSubnodeRecord(bytes32,bytes32,address,address,uint64) With parameters  { “node”:“0xec9ec573cf97ad1c270be71ac1de3b382790cb346036130c7d7ff844bf8f4974” “label”:“0x15ff9b5bd7642701a10e5ea8fb29c957ffda4854cd028e9f6218506e6b509af2” “owner”:“0x1a9c8182c09f50c8318d769245bea52c32be35bc” “resolver”:“0x4976fb03c32e5b8cfe2b6ccb31c09ba78ebaba41” “ttl”:0 } Where node=“0xec9ec573cf97ad1c270be71ac1de3b382790cb346036130c7d7ff844bf8f4974”=namehash(“uniswap.eth”) And label=“0x15ff9b5bd7642701a10e5ea8fb29c957ffda4854cd028e9f6218506e6b509af2”=keccak256(utils.toUtf8Bytes(“v3-core-license-grants”))  calldatas[1] is derived from a call to setText(bytes32,string,string)  With parameters { “node”:“0xa35d592ec6e5289a387cba1d5f82be794f495bd5a361a1fb314687c6aefea1f4”, “key”:“Voltz Uni v3 Additional Use Grant”, “value”:\"Voltz Labs Technology Limited (“Voltz”) is granted an additional use grant to allow the Voltz DAO to use the Uniswap V3 Core software code (which is made available to Voltz subject to license available at https://github.com/Uniswap/v3-core/blob/main/LICENSE (the “Uniswap Code”)). As part of this additional use grant, the Voltz DAO receives a limited worldwide license to use the Uniswap Code for the purposes of: creating, deploying and making available aspects of an interest rate swap automated market maker (the “IRS AMM”); to modify and update the IRS AMM over time; and deploy the IRS AMM and portions thereof as smart contracts on blockchain-based applications and protocols. The Voltz DAO is permitted to use subcontractors to do this work. This license is conditional on Voltz and the Voltz DAO complying with the terms of the Business Source License 1.1, made available at https://github.com/Uniswap/v3-core/blob/main/LICENSE.\" } Where node=“0xa35d592ec6e5289a387cba1d5f82be794f495bd5a361a1fb314687c6aefea1f4”=namehash(“v3-core-license-grants.uniswap.eth”)  Testing We have simulated the two individual transactions in Tenderly, and we get successful transactions generating the following event logs: setSubnodeRecord()  NewOwner: { “Node”:“0xec9ec573cf97ad1c270be71ac1de3b382790cb346036130c7d7ff844bf8f4974” “Label”:“0x15ff9b5bd7642701a10e5ea8fb29c957ffda4854cd028e9f6218506e6b509af2” “owner”:“0x1a9c8182c09f50c8318d769245bea52c32be35bc”  }  NewResolver: { “Node”:“0xa35d592ec6e5289a387cba1d5f82be794f495bd5a361a1fb314687c6aefea1f4” “Resolver”:“0x4976fb03c32e5b8cfe2b6ccb31c09ba78ebaba41” }  setText()  TextChanged: { “Node”: “0xa35d592ec6e5289a387cba1d5f82be794f495bd5a361a1fb314687c6aefea1f4”, “IndexedKey”:“0x2516c29f14a1d89a415d7a3c3e8c3201e2ea4e2d9531ef0821f8c347525af95c”, “Key”: “Voltz Uni v3 Additional Use Grant” }  ",
                    "links": [
                        "https://gov.uniswap.org/t/consensus-check-should-uniswap-provide-voltz-with-v3-additional-use-grant/16012",
                        "https://snapshot.org/#/uniswap/proposal/0x4f42b3215c4028edd947dc69980a9b8ba837ffbe3d0caa60d999406d634c8e79",
                        "https://snapshot.org/#/uniswap/proposal/0xbfeb7f3c4a3f1d4979b59129f9a78ee217183b0656a480612d261233fb3f8c62",
                        "https://etherscan.io/address/0x408ed6354d4973f66138c91495f2f2fcbd8724c3#code",
                        "https://etherscan.io/address/0x00000000000c2e074ec69a0dfb2997ba6c7d2e1e",
                        "https://etherscan.io/address/0x4976fb03c32e5b8cfe2b6ccb31c09ba78ebaba41",
                        "https://tenderly.co/"
                    ],
                    "GPT-summary": "The post is a proposal submitted by Voltz Labs to the Uniswap community, asking for a v3 Additional Use Grant in exchange for 1% of Voltz Future Tokens, alongside non-financial benefits. The author is asking for feedback from the community before initiating the final vote. The post also includes the draft code that will be executed by the Uniswap Timelock if the vote is successful, and the testing results of the proposal.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Smart contract updates",
                        "Community and engagement"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None"
                    ],
                    "Sentiment": 5.5612519201228885
                },
                {
                    "author_link": "https://gov.uniswap.org/u/artur",
                    "index": "2",
                    "likes": "3",
                    "time": "24/02/2022-20:42:19",
                    "content": "Hey everyone! I’m Artur, the CTO and co-founder at Voltz Labs. We have done a full simulation of the proposal in this repo. We want to make sure everything runs smoothly if the vote is successful, hence would love to get feedback on the simulation and its results. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/simonj",
                    "index": "3",
                    "likes": "0",
                    "time": "03/03/2022-10:43:16",
                    "content": "Pleased to announce that voting is now live!! You can vote here: Uniswap Interface Really excited to see how the community votes! And we’re excited about the prospect of setting a precedent for DeFi and DAO2DAO deals!! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "3rd party or author is advertising proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.209694602272727
                }
            ]
        },
        {
            "thread_link": "https://gov.uniswap.org/t/consensus-check-should-uniswap-provide-voltz-with-v3-additional-use-grant/16012",
            "title": "Consensus Check - Should Uniswap Provide Voltz with v3 Additional Use Grant ",
            "index": 16012,
            "category": [
                "Consensus Check"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/simonj",
                    "index": "1",
                    "likes": "5",
                    "time": "31/01/2022-20:10:13",
                    "content": "The other week, the Voltz Labs team submitted a Temperature Check with the Uniswap community on our proposal to provide Voltz with a v3 Additional Use Grant in exchange for 1% of Voltz future tokens, alongside a number of non-financial benefits. We were delighted and humbled by the response from the Uniswap community with over >99% voting in favour of the proposal. The Temperature Check also met the 25k UNI Yes threshold required to pass. Following this successful vote, the Voltz Labs team is now getting ready to initiate the Consensus Check on Snapshot. We’re mindful that within the Temperature Check post there was a request for Voltz Labs to provide clarity on the language that we’re requesting be added to v3-core-license-grants.uniswap.eth in the event the proposal is successful. As a result, we’ve outlined below language that we believe reflects the nature of the request and discussion on the Temperature Check forum. We look forward to any additional comments from the Uniswap Community. If there aren’t any additional comments, we’ll look to initiate the Consensus Check in the coming week. Proposed language to be added to v3-core-license-grants.uniswap.eth if the proposal is successful: Voltz Labs Technology Limited (“Voltz”) is granted an additional use grant to allow the Voltz DAO to use the Uniswap V3 Core software code (which is made available to Voltz subject to license available at https://github.com/Uniswap/v3-core/blob/main/LICENSE (the “Uniswap Code”)). As part of this additional use grant, the Voltz DAO (or until the Voltz DAO is established, Voltz itself) receives a limited worldwide license to use the Uniswap Code for the purposes of: 1. creating, deploying and making available aspects of an interest rate swap automated market maker (the “IRS AMM”); 2. to modify and update the IRS AMM over time; and 3. deploy the IRS AMM and portions thereof as smart contracts on blockchain-based applications and protocols. The Voltz DAO and Voltz are permitted to use subcontractors to do this work. This license is conditional on Voltz and the Voltz DAO complying with the terms of the Business Source License 1.1, made available at https://github.com/Uniswap/v3-core/blob/main/LICENSE ",
                    "links": [
                        "https://gov.uniswap.org/t/governance-proposal-should-uniswap-provide-voltz-with-v3-additional-use-grant/16276"
                    ],
                    "GPT-summary": "The post is an explanation of a proposal by Voltz Labs to receive an additional use grant from Uniswap for the purpose of creating an interest rate swap automated market maker. The post also includes proposed language to be added to the v3-core-license-grants.uniswap.eth if the proposal is successful. The post invites additional comments from the Uniswap community and is open to constructive criticism and questions.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Smart contract updates",
                        "Token economics",
                        "Community and engagement"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.415550595238095
                },
                {
                    "author_link": "https://gov.uniswap.org/u/simonj",
                    "index": "2",
                    "likes": "4",
                    "time": "07/02/2022-10:54:35",
                    "content": "Voting for the consensus check is now live on snapshot! We’re excited to see how the community votes, and excited about setting a precedent for DeFi & DAO2DAO collaboration!! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party or author wants to collaborate on proposal",
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.885653409090909
                }
            ]
        }
    ],
    "group_index": "158"
}