{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/the-creation-of-the-uniswap-risk-dao-delegation-pitch/19585",
            "title": "The Creation Of The Uniswap Risk DAO - Delegation Pitch ",
            "index": 19585,
            "category": [
                "Delegation Pitch"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/RevoGames",
                    "index": "1",
                    "likes": "2",
                    "time": "04/12/2022-18:07:08",
                    "content": "Greetings, Since the launch of the third version of the Uniswap Protocol (“V3” of the “Uniswap Protocol”) in May 5th 2021, the Uniswap ecosystem has seen amazing growth, with ~$3.5 Bllion of total value locked in the protocol, the Community Treasury being valued over ~ $2.2 Billion, over $1 Trillion of total trading volume and the 24 hour trading volume at par with Coinbase as well as more than 300 integrations supported by the Uniswap Protocol. In addition, the Uniswap Protocol is completely run by the community (“Uniswap Community Governance”), with all decisions and changes for the protocol being implemented by Uniswap Community Governance. With so much at stake, assessing risk is critical for the continued success of the Uniswap Protocol. Upgrades, asset additions, and changing market conditions have the potential to impact the protocol and the Safety Module. For that reason, it is critically important for the Uniswap Governance community to have access to all relevant information and thorough analysis to support sound decision making. Risk assessment for the protocol and safety module can require advanced skills (such as a deep understanding of smart contracts and digital assets) as well as significant familiarity with the Uniswap Protocol. With these needs in mind, I’d like to propose the formation of a dedicated Uniswap Risk DAO to help support the community’s stewardship of the Uniswap Protocol. Uniswap Risk DAO Overview Uniswap already has an established risk framework, covering various aspects of the protocol including asset risk, liquidity risk, and technical risk. This Risk DAO will seek to build on this by supporting the Uniswap community in the following ways: Providing information and research for decisions on asset listing, liquidity provision, and other risk related matters Providing feedback and analysis on risk levels of forum and on chain governance proposals. Providing documentation on risks to the Uniswap protocol and related risk factors Providing independent assessment of Governance proposals priory to submission by community members, including technical and general risk analysis At the members’ discretion, submitting posts to the Uniswap Community Forum to discuss and help to address and mitigate risks This will help give Uniswap Community Governance greater information on (1) Technical upgrades that have the potential to increase protocol risk. (2) Engaging with third parties to better understand the Uniswap Protocol’s ecosystem and to gain additional expertise. Through its various members, the Risk DAO will seek to provide coverage of the relevant risk areas in the Uniswap Protocol, including:   Oracle risk   Governance risk   Technical risk   Risks pertaining to real world / off chain assets   Other risk related matters (including legal and regulatory )   Members of the Risk DAO will dedicate 5-10 hours per week for a minimum term of one calendar quarter, with the ability for membership positions to be renewed subject to approval via governance. The team will may also work closely with the Uniswap Foundation Team in taking serious decisions for the betterment of the Uniswap Protocol. Applications are open and can be submitted as set out below.   Given the levels of expertise required, members will receive $500-1000/hr monthly. Payment will be based on success metrics (level of participation, amount of reviews completed, etc). Re-elected members should receive a bonus worth 10% of their previous quarter’s compensation. Initially the starting budget should be roughly $3M per year, which is around a grand total of nearly $30M for 10 years - this covers 5-10 members working ~10-20 hours per week at an average of $500 per hour, along with a small contingency budget for additional expenses. Member compensation will be based on the specific skills provided so individual members may earn more or less than $500 per hour. Participating in the Uniswap Risk DAO Ideally the Risk DAO would be composed of experts from the Uniswap community as well as experts from the Uniswap Foundation (UF) . The members will be selected based on the following criteria :-   The expert’s involvement in the Uniswap ecosystem and in the space more generally?   What skills/experience do they bring?   Can they commit ~5-10 hours a week?   and much more.   A application form will be published via the Uniswap Governance Forum through which qualified and aspiring applicants can apply to become a part of our venture. The applications will be reviewed under supervision of The Uniswap Foundation. I’ll get in touch with the applicants to discuss further, and hope to have an initial team and governance proposal in order in the coming weeks. This endavour of ours has been supported by The Uniswap Foundation Grants Program and we are collectively working with them to make this aspiring idea a reality soon. Considering the size of this grant, We intend to request funding directly from the Uniswap Community Treasury rather than the UNI Grants DAO to ensure the continued funding of other future community priorities. Therefore, We cordially request the members of the Uniswap Community Governance Forum to collectively delegate their respective voting power to the following ERC20 address 0xe213FC862ff8511e74a030919f610212bCc94e69 for us to start the Temperature Check and the Conensus Check to eventually launch the on-chain Governance Proposal. Please feel free to provide any general questions( if any ) or comments about the Risk DAO as well. Let us know your thoughts about this soon. With Best Regards, Swastika Chakraborty The Uniswap Risk DAO Team ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.658730158730158
                },
                {
                    "author_link": "https://gov.uniswap.org/u/d3rwisjnodes",
                    "index": "2",
                    "likes": "1",
                    "time": "05/12/2022-16:43:16",
                    "content": "Welcome @RevoGames to this community! Altough your idea has a good foundation, I do not feel comfortable to set this up for a ten year straight run based on being this your first post in the community.     RevoGames:  $30M for 10 years   But I would love to discuss and build upon those ideas with the rest of the community. Thanks again for joining the community and giving your input, we hope to hear more from you and elaborate on the pitch above. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.931818181818182
                },
                {
                    "author_link": "https://gov.uniswap.org/u/RevoGames",
                    "index": "3",
                    "likes": "1",
                    "time": "05/12/2022-18:15:27",
                    "content": "Thanks for your response and I agree with you that since we am quite new to the Uniswap community although I have been into crypto and interacted with the Uniswap Protocol for more than half a decade since 2017, it is not right to set this up as a 10 year plan but since a Risk Management Entity for such an enormous organization such as Uniswap, we think that is essential to be implemented on a long term basis but we cannot come to the final conclusion to the project as this would require further discussions, suggestions and support from the Uniswap Community. We too would love to discuss further steps regarding the proper implementation and functioning of the project with you. We have taken the help of the Uniswap Foundation in guiding us through the process of establishing the program successfully and thank them for their cooperation. We would be eagerly in wait for more responses, discussions and suggestions such as this both from you and the Uniswap community in the future as that is what keeps us going. With Best Regards, Swastika Chakraborty The Uniswap Risk DAO ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.806709956709957
                },
                {
                    "author_link": "https://gov.uniswap.org/u/RevoGames",
                    "index": "4",
                    "likes": "1",
                    "time": "07/12/2022-16:50:31",
                    "content": "Greetings, There has been a slight error while creating this post. We would like you to revise the above text and clarify that the UF are not currently supporting the initiative or promising support in later stages even if approved by governance as mentioned earlier in the text. \"The team will may also work closely with the Uniswap Foundation Team in taking serious decisions for the betterment of the Uniswap Protocol.” “Ideally the Risk DAO would be composed of experts from the Uniswap community as well as experts from the Uniswap Foundation (UF) “ “This endavour of ours has been supported by The Uniswap Foundation Grants Program and we are collectively working with them to make this aspiring idea a reality soon.” “We have taken the help of the Uniswap Foundation in guiding us through the process of establishing the program successfully and thank them for their cooperation” This is to be completely transparent to the community and let the community asses the merit of our proposal and take important decisions by the communitys will and choice as that is what keeps this organization strong and united. As always, we look forward to the communitys support and suggestions. With Best Regards, Swastika Chakraborty The Uniswap Risk DAO ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.214743589743589
                }
            ]
        },
        {
            "thread_link": "https://gov.uniswap.org/t/the-creation-of-the-uniswap-risk-dao/19586",
            "title": "The Creation Of The Uniswap Risk DAO ",
            "index": 19586,
            "category": [],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/RevoGames",
                    "index": "1",
                    "likes": "1",
                    "time": "04/12/2022-18:11:06",
                    "content": "Greetings, Since the launch of the third version of the Uniswap Protocol (“V3” of the “Uniswap Protocol”) in May 5th 2021, the Uniswap ecosystem has seen amazing growth, with ~$3.5 Bllion of total value locked in the protocol, the Community Treasury being valued over ~ $2.2 Billion, over $1 Trillion of total trading volume and the 24 hour trading volume at par with Coinbase as well as more than 300 integrations supported by the Uniswap Protocol. In addition, the Uniswap Protocol is completely run by the community (“Uniswap Community Governance”), with all decisions and changes for the protocol being implemented by Uniswap Community Governance. With so much at stake, assessing risk is critical for the continued success of the Uniswap Protocol. Upgrades, asset additions, and changing market conditions have the potential to impact the protocol and the Safety Module. For that reason, it is critically important for the Uniswap Governance community to have access to all relevant information and thorough analysis to support sound decision making. Risk assessment for the protocol and safety module can require advanced skills (such as a deep understanding of smart contracts and digital assets) as well as significant familiarity with the Uniswap Protocol. With these needs in mind, I’d like to propose the formation of a dedicated Uniswap Risk DAO to help support the community’s stewardship of the Uniswap Protocol. Uniswap Risk DAO Overview Uniswap already has an established risk framework, covering various aspects of the protocol including asset risk, liquidity risk, and technical risk. This Risk DAO will seek to build on this by supporting the Uniswap community in the following ways: Providing information and research for decisions on asset listing, liquidity provision, and other risk related matters Providing feedback and analysis on risk levels of forum and on chain governance proposals. Providing documentation on risks to the Uniswap protocol and related risk factors Providing independent assessment of Governance proposals priory to submission by community members, including technical and general risk analysis At the members’ discretion, submitting posts to the Uniswap Community Forum to discuss and help to address and mitigate risks This will help give Uniswap Community Governance greater information on (1) Technical upgrades that have the potential to increase protocol risk. (2) Engaging with third parties to better understand the Uniswap Protocol’s ecosystem and to gain additional expertise. Through its various members, the Risk DAO will seek to provide coverage of the relevant risk areas in the Uniswap Protocol, including:  Oracle risk Governance risk Technical risk Risks pertaining to real world / off chain assets Other risk related matters (including legal and regulatory ) Members of the Risk DAO will dedicate 5-10 hours per week for a minimum term of one calendar quarter, with the ability for membership positions to be renewed subject to approval via governance. The team will may also work closely with the Uniswap Foundation Team in taking serious decisions for the betterment of the Uniswap Protocol. Applications are open and can be submitted as set out below.  Given the levels of expertise required, members will receive $500-1000/hr monthly. Payment will be based on success metrics (level of participation, amount of reviews completed, etc). Re-elected members should receive a bonus worth 10% of their previous quarter’s compensation. Initially the starting budget should be roughly $3M per year, which is around a grand total of nearly $30M for 10 years - this covers 5-10 members working ~10-20 hours per week at an average of $500 per hour, along with a small contingency budget for additional expenses. Member compensation will be based on the specific skills provided so individual members may earn more or less than $500 per hour. Participating in the Uniswap Risk DAO Ideally the Risk DAO would be composed of experts from the Uniswap community as well as experts from the Uniswap Foundation (UF) . The members will be selected based on the following criteria :-  The expert’s involvement in the Uniswap ecosystem and in the space more generally? What skills/experience do they bring? Can they commit ~5-10 hours a week? and much more.  A application form will be published via the Uniswap Governance Forum through which qualified and aspiring applicants can apply to become a part of our venture. The applications will be reviewed under supervision of The Uniswap Foundation. I’ll get in touch with the applicants to discuss further, and hope to have an initial team and governance proposal in order in the coming weeks. This endavour of ours has been supported by The Uniswap Foundation Grants Program and we are collectively working with them to make this aspiring idea a reality soon. Considering the size of this grant, We intend to request funding directly from the Uniswap Community Treasury rather than the UNI Grants DAO to ensure the continued funding of other future community priorities. Therefore, We cordially request the members of the Uniswap Community Governance Forum to collectively delegate their respective voting power to the following ERC20 address 0xe213FC862ff8511e74a030919f610212bCc94e69 for us to start the Temperature Check and the Conensus Check to eventually launch the on-chain Governance Proposal. Please feel free to provide any general questions( if any ) or comments about the Risk DAO as well. Let us know your thoughts about this soon. With Best Regards, Swastika Chakraborty The Uniswap Risk DAO Team ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.658730158730158
                }
            ]
        }
    ],
    "group_index": "241"
}