{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/on-strategy-and-tactics-how-we-can-fight-against-vampire-attacks-and-other-daily-threats/9172",
            "title": "On strategy and tactics - How we can fight against vampire attacks and other daily threats ",
            "index": 9172,
            "category": [
                "Temperature Check"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/Figu3",
                    "index": "1",
                    "likes": "11",
                    "time": "08/12/2020-18:31:51",
                    "content": "Hey everyone, Figue here. I’m glad to see the lively discussions on the forums. I’d like to dedicate my first post to the timeline of decision-making - Uniswap’s governance main problem in my opinion - and how the liquidity incentives debates have illustrated this problem. In military warfare, strategy and tactics go hand in hand. While strategy represents long term planning and goal oriented, tactics is more operational and short term. Basically you set up a strategy and create tactics in order to reach the goals set in stone by the strategy. In our case, Sushiswap’s vampire attacks are tactics, so are liquidity incentives. On the other hand, grant programs, acquiring news users, reducing slippage on a pair are all strategies as they help the ecosystem stabilize & grow. This is where I believe we are wrong: current on-chain governance is viable for setting up strategies but isn’t enough flexible to be tactical. Case in point: the current liquidity incentives debacle. So how do other protocols manage short term events if they have on-chain governance? The way I see it, there are two solutions in place :  The team keeps a handle on decision-making to allow some flexibility or plays a very active role in the governance (ie : Aave). The team elects a council that manages day to day operations and decides via a DAO long term goals / decisions. Sushi is an interesting variant as the core team is in charge of tactics and the governance via snapshot decides the rest.   How does Uniswap compare to all of this? Well, not good… yet. The team chose (probably for legal reasons) to step back, letting us to be in charge. But we have no long-term goals truly set in stone, no idea what the team is preparing for v3 and absolutely no tools to fight against short term strategies wielded by competitors. What’s worst is that decision-making is in the hands of 400 votes, with only 4 addresses being able to create a formal proposal. In short: voter apathy, too much concentration and a team that decentralized too fast and too partially. Right now, Uniswap is like a stone colossus. What should we do then? If silence is consent, I think the core team is prepping up for different governance style with v3 release. In the meantime I strongly believe we should elect a council in charge of clearly defined tactical actions (ie : weekly pair incentives, grant budgeting, etc…). We could poll for community consent with a 24h snapshot before each decision in order to avoid deviating from the community’s belief. As always any opinions are welcome; the idea is to create a solution to our incapacity to react on the short term that we can submit as a temperature check. Cheers Full disclosure : I work for constellation.finance, a governance venture opening a UNI delegation soon ",
                    "links": [
                        "https://docs.sushiswap.fi/governance/current-governance-mdoel"
                    ],
                    "GPT-summary": "The author discusses the timeline of decision-making in Uniswap's governance and how the liquidity incentives debates have illustrated the problem. The author proposes that Uniswap should elect a council in charge of clearly defined tactical actions to react on the short term. The post also mentions the author's affiliation with constellation.finance, a governance venture opening a UNI delegation soon.",
                    "GPT-proposal-categories": [
                        "Board composition",
                        "Grants, Funding and resource allocation",
                        "Change to proposal pipeline",
                        "Community and engagement",
                        "Law and regulations"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.470229551150604
                },
                {
                    "author_link": "https://gov.uniswap.org/u/gman211",
                    "index": "2",
                    "likes": "1",
                    "time": "12/12/2020-11:57:58",
                    "content": "I think you have a great idea. I’m in favor of your game plan. How do we go about electing a council that all agree on and are of credibility? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Figu3",
                    "index": "3",
                    "likes": "1",
                    "time": "12/12/2020-21:45:24",
                    "content": "Hey gman, I was thinking it should be done jointly with the current grant proposal (the board should do both). We could just hold an election the same way they did for the Spartan Council. The thing that worries me is the current involvment in the communicty. Barely 20k were voted on the snapshot launched by Jesse, if we want a real council we need more community engagement. That’s the paradox of the current situation, we need a short term solution but can’t react fast enough. The current community sentiment seems to be : v3 is coming, let’s pray it’s soon. Might be true, still risky not to act. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.541666666666667
                },
                {
                    "author_link": "https://gov.uniswap.org/u/gman211",
                    "index": "4",
                    "likes": "1",
                    "time": "13/12/2020-09:06:00",
                    "content": "Well your idea and your wisdom is exactly what uniswap needs. Unfortunately, we need like 100,000 of you! Lol. Maybe a learn and earn type distribution could draw people in while promoting the coin. During that time we can advertise your ideas to anyone of notoriety. Which has the knowledge and experience to create the supply ans demand Uniswap Coin needs. Right. Uni3 I’m interested in what it will be like and the impact it will have. I believe something within it may put our current dilemma on the back burner. Not sure why I think this yet. But a possibility. Who knows. But keep up your innovative ideas and well thought ideas. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.6726190476190474
                },
                {
                    "author_link": "https://gov.uniswap.org/u/sommi",
                    "index": "5",
                    "likes": "0",
                    "time": "14/01/2021-06:37:06",
                    "content": " This whole “Let’s be scared of the government” approach will bite them in the ass. I don’t see the Yearn empire w/ SushiSwap as having any fear, and SUSHI is about close to flipping UNI. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.0
                }
            ]
        }
    ],
    "group_index": "516"
}