{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/governance-proposal-005-defi-education-fund/12963",
            "title": "Governance Proposal 005 - DeFi Education Fund ",
            "index": 12963,
            "category": [
                "Proposal Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/HarvardLawBFI",
                    "index": "1",
                    "likes": "19",
                    "time": "12/06/2021-14:56:26",
                    "content": "(Previously known as: DeFi Political Defense Fund) Past discussion: Temperature Check | Snapshot Consensus Check Thread 1 | Consensus Check Thread 2 | Snapshot  Proposal to allocate one million UNI to create and fund the “DeFi Education Fund,” a 501(c)(4) nonprofit entity based in the United States to provide grants for political, educational, and legal engagement. This proposal has passed the temperature and consensus checks with massive supermajorities and healthy, spirited debate. Since the Temperature Check posted, the need for this fund has become even more apparent. We have incorporated much of the constructive feedback to balance transparency and effectiveness in this entity’s important mission for the community. The 501(c)(4) will fund education and advocacy through both existing advocacy organizations and potentially new ones. The funding will have the goals of 1) challenging misguided regulatory, legal, and political threats to decentralized finance; 2) achieving regulatory clarity for decentralized finance and related activity; 3) advancing laws that support decentralized finance and decentralized governance; and 4) spurring other DeFi protocols’ governance bodies to contribute to the effort (through this entity or their own). The entity will be nonpartisan and global in approach and orientation. The DeFi Education Fund will fund all of the following:  Policy-maker education: we need more people directly educating legislative and regulatory policymakers about DeFi and advocating for policy positions that favor DeFi and its participants; Thought leadership and research: we need more written and video content explaining DeFi and its benefits in a medium that positively impacts the public perception of DeFi; Legal firepower: we need to develop a strong bench of legal advocates in multiple jurisdictions and venues; Messaging: we need to better formulate ideas, prepare spokespeople, and communicate to policymakers and the general public on the benefits and promise of DeFi; Grassroots advocacy: we need to make it easy for individuals who already care about DeFi to voice their opinions to policymakers globally alongside organized efforts; and Best practices: we need more analysis and legal models for all DeFi projects to benefit from collectively.  This entity will not replicate the great work of existing organizations such as Coin Center, Fight for the Future, the Blockchain Association, the Crypto Council for Innovation, the Defi Alliance, Blockchain for Europe, or others. Rather, among other things, it will help to fund these and other organizations to expand their capabilities to more effectively protect and advance DeFi protocols. Further, this entity will extend its monetary impact by conditioning some of its grants with matching by other governance treasuries, crypto foundations, or crowd-matching. Grants administration for advocacy is a subjective process that cannot be easily automated, and thus we propose a grants committee overseen by an accountable entity. This committee will hire a grants-making leader or staff and create an efficient, predictable process for applicants. We propose the following as the initial committee members, with a subset of them serving as the entity’s board of directors. All have expressed their willingness to join the committee:   Larry Sukernik , co-founder, Reverie.  Rebecca Rettig , General Counsel, Aave Companies.  Jake Chervinsky , General Counsel, Compound Labs & Strategic Advisor, Variant Fund.  Marc Boiron , General Counsel, dYdX Trading.  Katie Biber , Chief Legal Officer of Brex, Board of Directors of Anchorage.  Sheila Warren , World Economic Forum, Executive Committee (Cryptocurrency Lead).  Marvin Ammori , Chief Legal Officer, Uniswap Labs.  Due to the dynamic and somewhat unpredictable state of global policy proposals, we believe the grant-making committee should have considerable discretion to allow for flexibility and speed, subject to the necessary disclosure of its activities on a regular basis. We expect many members to serve pro bono and total compensation across the committee to be less than $150,000 annually. The following changes have been incorporated due to community feedback:  The name will focus on education rather than defense–the DeFi Education Fund. The scope is broadened to include the funding of organizations and work promoting best regulatory practices among those in the DeFi ecosystem. Beyond the considerable disclosure required for a 501(c)(4), the entity will publicly post monthly community updates on progress, grant allocation, tactics, etc… These updates will not only ensure trust but will also keep the community informed on when and how they can lend their voice to the policy process. When there are surprises, as there so often have been in the policy space, we will report why and how funds will be reallocated to address them. The 501(c)(4) will promptly hire at least one full-time staffer to manage the day-to-day operations of the organization with oversight from the board of directors and who will serve as the primary point of contact for the governance community. The 501(c)(4) will issue a detailed budget within 90 days of the proposal passing. Budgets, projections, and 5-year plans often must be revised and amended.  Multisig wallet address: 0x1C95930Dfc1139381265ce45B5f480F1EFae09A1  A Word About Trust and the Multisig Wallet: While we are thrilled the Consensus Check passed with strong approval (73% for, 27% against), it’s important to us that we operate this initiative in a way that even those who voted against can get behind. In particular, there was feedback that the proposal asked for a lot of money upfront with little in the way of checks and balances. Below, we detail some of the steps we took to improve the design of the proposal. We won’t claim that it’s a perfect solution, but it is a big upgrade to what was proposed earlier. To safely and transparently hold the funds, a 4/7 multisig consisting of the seven committee members was created at the following address: 0x1C95930Dfc1139381265ce45B5f480F1EFae09A1. To be even more precise, here are the names and addresses of the seven multisig members:  Jake Chervinsky | 0xdC856762b024814F6B5dc28e97e514e001D6820C | o/b/o Defi Education Fund Larry Sukernik | 0x773EE93E36bAaFa7F73B41ccC6800126829d3589 | o/b/o Defi Education Fund Rebecca Rettig | 0xcF8C946C6819dafE62f82803E01eB27Ea232825C | o/b/o Defi Education Fund Marc Boiron | 0x2132bEADc4D7b196249c1A746B8eeA91099bb1cE | o/b/o Defi Education Fund Marvin Ammori | 0xea067C58367D022a1c58354fE544C542c68587ec | o/b/o Defi Education Fund Katie Biber | 0xcB598f253818398f3d91595f22D897096e240Ae3 | o/b/o Defi Education Fund Sheila Warren | 0xbcAD071A51896666c3B48fC5Fd5A872981FB254E | o/b/o Defi Education Fund  While a multisig wallet goes a long way towards trustlessly holding funds, we think Tally’s new open-source product, Failsafe, would do an even better job (fun fact: Failsafe was funded by the Uniswap Grants Program). Simply put, Failsafe is an additional safety mechanism built on top of the multisig wallet that allows Uniswap tokenholders to (i) stop any multisig transaction from taking place, and (ii) request funds sitting in the multisig to be sent back to Uniswap’s treasury. We think this is a powerful product that all multisigs should use in the future. Although we want to use Failsafe as soon as possible, the product is just entering its trial phase with the Uniswap Grants Committee and is in the process of receiving code audits. While that means we can’t use Failsafe from the get-go, the good news is Failsafe can be deployed on top of the multisig wallet after the fact . Once audited, we’d like to integrate it to allow UNI tokenholders to have the ultimate say over the funds. ",
                    "links": [
                        "https://snapshot.org/#/uniswap/proposal/QmVXXEXJJKjFJtwXyy4Xx3gBckhz6TvorZoLgX3yiB7Hki",
                        "https://gov.uniswap.org/t/consensus-check-uni-should-fund-a-political-defense-organization-for-decentralized-finance/12700",
                        "https://gov.uniswap.org/t/consensus-check-uni-should-fund-a-political-defense-organization-for-decentralized-finance-copy/12717",
                        "https://snapshot.org/#/uniswap/proposal/QmaUPBYqkiKnwkaVNVrUDpD6fk5EXXTqJjn71qHNYW4YQn",
                        "https://snapshot.org/#/uniswap/proposal/QmaUPBYqkiKnwkaVNVrUDpD6fk5EXXTqJjn71qHNYW4YQn",
                        "https://gov.uniswap.org/t/consensus-check-uni-should-fund-a-political-defense-organization-for-decentralized-finance/12700/67",
                        "https://gov.uniswap.org/t/temperature-check-merge-the-uniswap-grant-program-into-uniswap-dao-governance/13511"
                    ],
                    "GPT-summary": "The post explains a proposal to create and fund a non-profit organization called the DeFi Education Fund, which will provide grants for political, educational, and legal engagement. The proposal has passed the temperature and consensus checks with massive supermajorities and healthy, spirited debate. The post also includes changes made to the proposal based on community feedback and provides details on the multisig wallet created to hold the funds. The post also mentions the possibility of integrating Tally's Failsafe product to allow UNI tokenholders to have the ultimate say over the funds.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Law and regulations",
                        "Privacy, Security and risk management",
                        "Community and engagement",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.837067610062894
                },
                {
                    "author_link": "https://gov.uniswap.org/u/ErikBjare",
                    "index": "2",
                    "likes": "9",
                    "time": "13/06/2021-09:54:17",
                    "content": "Pleased to see this proposal mature into something I can support. After initially voting NO for previous temperature and consensus checks (in part due to my doubts about the community support), I’ve flipped and voted YES on the final proposal. This due to seeing my concerns addressed, as well as the generally positive sentiment among core Uniswap contributors. I also look forward to seeing Failsafe used in production, and hope the multisig holders will honor the spirit of the proposal to give UNI holders final veto rights over the use of funds. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.228114478114478
                },
                {
                    "author_link": "https://gov.uniswap.org/u/morning",
                    "index": "3",
                    "likes": "0",
                    "time": "13/06/2021-18:01:45",
                    "content": "Previously, I was against this proposal (and still am). The way it stands now, I am going to be cautiously optimistic. I am excited to see where we go from here, as this will no doubt bring about significant changes in DeFi no matter which direction this swings. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party giving entirely negative feedback on proposal"
                    ],
                    "Sentiment": 5.972222222222222
                },
                {
                    "author_link": "https://gov.uniswap.org/u/neverselling",
                    "index": "4",
                    "likes": "3",
                    "time": "13/06/2021-21:34:47",
                    "content": "Vote was removed, where is it. Encouraging everyone to reject this proposal, Ive already stated my reasons. Also, the temp check and snapshot did NOT pass with strong approval as far as I know, yr only votes were from Harvard (10 million) and few other large delegates. I believe you are no where near the required votes. If im wrong please someone let me know. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.014136904761904
                },
                {
                    "author_link": "https://gov.uniswap.org/u/hlspunk",
                    "index": "5",
                    "likes": "8",
                    "time": "14/06/2021-05:03:54",
                    "content": "Actually, I’m back! Why? Because I want to highlight how the changes proposed by HLSBFI address none of the accountability or governance issues raised in the other group and still fail to explain why this group is needed (versus a normal budgeting process used by a normal bank or crypto business). Let’s walk thru this one step at a time:  The name will focus on education rather than defense–the DeFi Education Fund.  There are two key points to see here:   This does nothing to change the fact that 1m Uni will immediately be drained from the treasury   This does not change that the organization has no concrete goals or objectives and that the board has an unfettered ability to use the money to do anything they like.   In fact, changing the purpose just shows how the proposers and board will change the mission to suit their goals - or justify their existence. In case anyone has forgotten, Matt Corva said that public bank disclosures indicate regulatory spends of about $3m/year.  Coin Center’s old budget was about $1m/year. So a 1m Uni budget seems far too high.  Solution?  Expand the mission.  The scope is broadened to include the funding of organizations and work promoting best regulatory practices among those in the DeFi ecosystem.  This one is even more startling. Put simply, what does funding organizations and work promoting best regulatory practices\" have to do with advancing the goals of Uniswap? Read very plainly, it sounds like the new goal is to fund the very organizations that the board members/multisig holders are already part of outside of Uniswap and to hire them or their law firms. For all we know, the board could use this new goal to fund the creation of a “report” which responds to the recent WEF report (that several of the board members helped to draft or review) which:  Is written by organizations the board members are part of for a hefty fee Promotes the board members personal profiles and connections (including through the payment of fees from this new organization) Restricts Uniswap’s ability to operate Leads to Marvin asking for more internal budget and headcount to address concerns raised in the report Leads Uniswap to again hire board members and their firms or lobbying organizations to conduct more work  But what do I know?  I am just a simple country lawyer.  Beyond the considerable disclosure required for a 501(c)(4), the entity will publicly post monthly community updates on progress, grant allocation, tactics, etc… These updates will not only ensure trust but will also keep the community informed on when and how they can lend their voice to the policy process. When there are surprises, as there so often have been in the policy space, we will report why and how funds will be reallocated to address them.  This gives Uniswap’s token holders, board and management no control rights.  So, once the proposal is passed, the Uni are gone.  The 501(c)(4) will promptly hire at least one full-time staffer to manage the day-to-day operations of the organization with oversight from the board of directors and who will serve as the primary point of contact for the governance community.  This person will be paid by the new organization and report to its board.  Why would we expect him or her to be anything but their mouthpiece?  The 501(c)(4) will issue a detailed budget within 90 days of the proposal passing. Budgets, projections, and 5-year plans often must be revised and amended.  This sounds nice, but once the Uni area gone, the Uni are gone. Which brings us to the fundamental question:  Why not just hire a few headcount internally, submit a budget to Hayden each quarter, and keep the group accountable the way almost every other business holds groups accountable? Why spend a lot more money to seed an entirely new organization (DAO) with a separate mission that is not aligned with that of Uniswap? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.574214738749622
                },
                {
                    "author_link": "https://gov.uniswap.org/u/RaFF30",
                    "index": "6",
                    "likes": "0",
                    "time": "17/06/2021-23:31:05",
                    "content": "Educating is always most important things  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.25
                },
                {
                    "author_link": "https://gov.uniswap.org/u/neverselling",
                    "index": "7",
                    "likes": "1",
                    "time": "18/06/2021-22:18:27",
                    "content": "The vote is up today but it isnt there, so what happens. I guess they didnt want to look bad that they didnt have the votes? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 1.5000000000000009
                },
                {
                    "author_link": "https://gov.uniswap.org/u/hlspunk",
                    "index": "8",
                    "likes": "5",
                    "time": "20/06/2021-09:10:39",
                    "content": "Looked like it passed 37m to 17m.  The key differentiators were the votes from:  The proposer, HLSBFI - 10m votes Kenneth Ng, Ethereum support - 10m votes Penn Blockchain - 8m votes UCLA Blockchain - 5m votes  This is interesting because   Half the margin of victory came from the proposer itself   Almost the total margin of victory came from the proposer itself and Penn Blockchain, which is sponsored by A16Z and helped write the WEF report with several of the board members who will now hand out the UNI that left the treasury   Ignoring the large student groups, the vote was rejected 4:1   Score: Lawyers/insiders who can hire themselves, former firms, sponsors and increase the value of their other investments: 1m Uni Uniswap tokenholders: -1m Uni https://snapshot.org/#/uniswap/proposal/QmVXXEXJJKjFJtwXyy4Xx3gBckhz6TvorZoLgX3yiB7Hki ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.234788359788359
                },
                {
                    "author_link": "https://gov.uniswap.org/u/neverselling",
                    "index": "9",
                    "likes": "1",
                    "time": "21/06/2021-03:03:00",
                    "content": "They are 2.5 million votes short of reaching quorum. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/OursPimente",
                    "index": "10",
                    "likes": "2",
                    "time": "21/06/2021-07:41:09",
                    "content": "@HarvardLawBFI  Citation Proposal to allocate one million UNI to create and fund the “DeFi Education Fund,” a 501(c)(4) nonprofit entity based in the United States to provide grants for political, educational, and legal engagement.  Sounds like a great idea  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party is advertising proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.5625
                },
                {
                    "author_link": "https://gov.uniswap.org/u/chrisblec",
                    "index": "11",
                    "likes": "5",
                    "time": "22/06/2021-19:09:49",
                    "content": "I have made attempts to have a public chat with backers of this proposal. All thus far have failed. We need to have a Twitter Space chat before this vote goes live. There are very important questions that are still not answered, including but not limited to:  Have there been talks with regulators re: this proposal? What assurance do UNI holders have that this consortium will put their interests first? Are Uniswap VCs/investors at legal risk if this proposal fails? Why is having a member of the WEF on this committee a non-negotiable point?  The backers of this proposal may feel like they don’t need to answer these questions, since they already have enough votes from just a couple of parties (a16z, etc) to pass this proposal. However, that attitude is as anti-DeFi as it gets. We do need to have this discussion, as uncomfortable as it may be for them. The future of DeFi is happening right before our eyes. If we allow it to happen in darkness and without meaningful conversation, then all is lost and we are just wasting our time here. I want to set this chat up in Twitter Spaces in the next 1-3 days. I’m asking the proposer of this bill, a proposed member of the committee, or a rep from a16z to volunteer to chat with me in this public forum and take questions from other UNI holders. I will watch for your replies. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.118468296409473
                },
                {
                    "author_link": "https://gov.uniswap.org/u/morning",
                    "index": "12",
                    "likes": "4",
                    "time": "22/06/2021-20:50:34",
                    "content": "I’m in total agreement with everything said above by @chrisblec We need a real thorough discussion about this before we go further. Purely message-board chatter will not suffice. This proposal is very significant to Uniswap and the DeFi space in general, so it is better to move slower than faster here. Also, the activity surrounding this proposal, the lack of community engagement, and the handling of the votes have increased suspicion on these University student groups. As it stands, I find myself even more against any effort to lobby or define regulations than I was previously. In the spirit of DeFi and the cypherpunk ethos, Uniswap, in my opinion, should absolutely be focusing on making the protocol unbreakable and untouchable. Those should be our guiding principles, not to bend to the laws of any single country, external governing bodies, or international associations. Our defense is our focus on building an exchange that’s secured from all threats, whether they come from individuals, competing organizations, or governmental authorities. Hence, any proposal suggesting we use treasury funds to lobby at all will immediately be met with my opposition. Here’s to hoping we can move on from this proposal soon!  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.6834608843537415
                },
                {
                    "author_link": "https://gov.uniswap.org/u/chrisblec",
                    "index": "13",
                    "likes": "4",
                    "time": "22/06/2021-21:13:58",
                    "content": "I just sent the following letter to Harvard Law BFI containing outstanding questions about this proposal. I have also shared it publicly on Twitter and with DeFi Watch mailing list. The full letter is available at Inquiry into Uniswap's \"DeFi Defense Fund\" Proposal. I’ll also paste it below for your convenience.  Thomas Hopkins / Mandy Mengyu Li Co-Presidents Harvard Law Blockchain & Fintech Initiative Dear Mr. Hopkins and Ms. Mengyu Li: There remain several unanswered questions surrounding your recent proposal to the Uniswap decentralized governance community known as “DeFi Defense Fund” or “DeFi Education Fund”. These questions, combined with the fact that most of your voting power seems to come from a few people and entities with extremely vested interests in the outcome, have given much of the community pause with consideration to your proposal. Most of us understand at this point that you can get most of the votes that you need to win this vote from less than 10 parties. However, it is our hope that you will still choose to provide clear and transparent responses to these questions before the on-chain vote begins:   We have already established that 99% of your voting power comes from just 4 Ethereum accounts. Do any of these 4 accounts belong to Uniswap investor Andreesen Horowitz (a16z), other notable investors or any Uniswap core team members?   Who, outside of your organization did you discuss this proposal with before bringing it to the public? Were there discussions with or encouragement from past or current Uniswap core team members, investors, proposed committee members, or other influential backers such as Consensys?   Was this proposal drafted in response to any ongoing, suggested or expected government investigation of the Uniswap corporate entity (Universal Navigation, Inc.) or any of its employees or investors that you were made aware of?   To what extent will these funds be used to defend the Uniswap corporate entity (Universal Navigation, Inc.) or educate about regulation that will benefit the corporation directly? How can UNI tokenholders be assured that any conflicts of interest will be settled in their favor and not in the corporate entity’s favor?   What assurances do UNI tokenholders have that these funds will always be used to educate about or pursue regulation, legislation, etc. that puts UNI interests first, even if it means putting those interests ahead of the interests of the greater DeFi community?   Large portions of the World Economic Forum’s stated mission could come into direct conflict with the financial interests of UNI tokenholders. For instance, WEF’s founder has stated: “We need a ‘Great Reset’ of capitalism.” DeFi is built upon the premise of capitalism and free markets. What conversations led to a member of the World Economic Forum being proposed as a committee member, and why should UNI tokenholders feel that a member of the WEF will have their best interests at heart?   The budget for this proposal is currently valued at approximately $16m. It was nearly $40m when first proposed. By comparison, the annual budget for CoinCenter is only $1m. What led you to propose a budget that is so much larger than that of CoinCenter?   The proposal states that “the scope has been broadened to include the funding or organizations and work promoting best regulatory practices…”. Who determines what are “best practices” and what kind of say will the UNI community have in those decisions? How can UNI tokenholders be assured that the committee will not use its free reign to start new spin-off organizations that are no longer beholden to UNI interests?   What assurances do UNI tokenholders have that members of the proposed committee will not pay funds to themselves or to other organizations that they have a vested interest in?   You proposed that the 1m UNI (currently $16m, but could easily rise again) should initially be held in a 4-of-7 multisig wallet. If 4 of the committee members acted maliciously or carelessly, or if they were threatened personally, the security of the funds could fall into jeopardy. This creates a massive trust issue. How can UNI tokenholders be assured that these Ethereum signing wallets were created in a secure environment and that the keys themselves are being secured properly against theft and other forms of compromise? If the funds are compromised, will the committee members take full legal responsibility?   Thank you in advance for agreeing to answer these questions before the on-chain vote begins. Contact me at chrisblec@defiwatch.net to arrange for a public voice chat via Twitter Spaces, or send a written response which I will gladly publish on my website defiwatch.net. Alternately, I suggest publishing a blog post which offers the greater UNI community a transparent response to these very legitimate concerns. With sincere hope for a productive conversation, Chris Blec Founder, DeFi Watch ",
                    "links": [
                        "http://defiwatch.net"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.767064508261691
                },
                {
                    "author_link": "https://gov.uniswap.org/u/HarvardLawBFI",
                    "index": "15",
                    "likes": "1",
                    "time": "22/06/2021-22:37:43",
                    "content": "Thank you for your patience. The technical issues were resolved and the on-chain vote is now back up and operational. Please cast your vote here:  Uniswap Interface ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/chrisblec",
                    "index": "16",
                    "likes": "4",
                    "time": "24/06/2021-22:51:35",
                    "content": "We just had a spirited discussion about this proposal on Twitter Spaces. I encourage the community to listen to it here:   Odysee    Recording of Twitter Space re: transparency around Uniswap \"DeFi Education... Recorded June 24, 2021. Chris Blec hosted a Twitter Space to discuss lack of transparency around the Uniswap \"DeFi Education Fund\" proposal from Harvard Law Blockchain & Fintech Initiative.  For more ...      ",
                    "links": [
                        "https://t.co/pZ5fiTijkO?amp=1"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/experience",
                    "index": "17",
                    "likes": "2",
                    "time": "25/06/2021-07:39:38",
                    "content": "The idea behind this proposal is great, but the amount suggested for such a new project is exaggerated. I have no doubt that this kind of law initiative can get extremely expensive, but this should first be a pilot project, and as such moderately funded. As someone mentioned previously, the discussion is also extremely US centric. The Uniswap community shouldn’t throw 1M UNI directly in a multisig wallet controlled by a US entity in bulk. It would be much more sensible if this was a pilot project, with clearly defined milestones, regularly reporting back to the community of holders. Depending on whether the community likes what they’re seeing, more funds could be unlocked in the future, either for that same entitiy, or new entities falling under other jurisdictions.  Due to the dynamic and somewhat unpredictable state of global policy proposals, we believe the grant-making committee should have considerable discretion to allow for flexibility and speed, subject to the necessary disclosure of its activities on a regular basis.   The 501(c)(4) will issue a detailed budget within 90 days of the proposal passing. Budgets, projections, and 5-year plans often must be revised and amended.  This is quite concerning. A group of people are asking for a significant sum, without having a budget to justify the amount asked first? Furthermore, once the funds are in the multisig, how can the Uniswap community enforce accountability? Everyone understands the urgency of educating regulators about DeFi, but clearly rushing this kind of lackluster proposal is not the way forward. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.399675324675325
                },
                {
                    "author_link": "https://gov.uniswap.org/u/jmo",
                    "index": "18",
                    "likes": "0",
                    "time": "25/06/2021-22:07:24",
                    "content": "Gauntlet will be supporting this proposal. We posted our reasoning in the Consensus Check thread here, but are glad to see the added commitment to use Tally’s Failsafe in the future.  This should help give UNI holders stronger protection in the case something were to go awry. The continued discussion in these threads is great to see - there are a lot of great suggestions here for how the Education Fund can better accomplish its mission to bring regulatory clarity to DeFi. As we mentioned in our Consensus check post, many of the concerns raised are valid. However as no one has brought to the forums any reasonable competing proposal, and it seems like the options are to move forward here and work with the Education Fund to address these concerns, or do nothing at all.  DeFi is truly revolutionary technology that could change countless lives for the better, and a blunt regulatory crackdown could hamper adoption for years, if not longer.  The Education Fund is a real chance to influence better regulation and policy that could help people lead better and more productive financial lives, and we are happy to vote yes on proposal 005. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 7.046875
                },
                {
                    "author_link": "https://gov.uniswap.org/u/experience",
                    "index": "19",
                    "likes": "2",
                    "time": "27/06/2021-09:20:45",
                    "content": "Almost everyone agrees with the argument of funding a political defense organization / education fund, and in particular the Gauntlet arguments on that topic are also sensible. However it seems that you do not address the question of the amount requested. What is the opinion of Gauntlet on the fact that a pilot project is about to be funded with millions without any clear milestone, or any detailed budget? You said the following in a previous thread:  While the sum requested is large, the sum needed is even larger.  This may very well be true eventually, but this needs to be justified a bit more for the first project of its kind. What expenses can we anticipate? How many full time employees will there be? What will be their exact roles? What is expected to be the first deliverable of that project? I reiterate that it seems much more sensible to fund a pilot project with a lower amount, perhaps enough for 1 year of runway (with justifications for that amount), and reassess further funding of the same group after some milestones. In fact, I find it deeply concerning as far as the maturity of the space is concerned that governance seems so willing to unlock funds without any detailed budget. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.021164021164021
                },
                {
                    "author_link": "https://gov.uniswap.org/u/colliepixels",
                    "index": "20",
                    "likes": "1",
                    "time": "04/07/2021-13:12:36",
                    "content": "Yall use .ens domains at all? You should consider it heavily. Surprised these folks don’t know about it being Ethereum professionals & all JakeChervinsky.eth would be way easier than… 0xdC856762b024814F6B5dc28e97e514e001D6820C ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None",
                        "None",
                        "None",
                        "None",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Shreedeepray",
                    "index": "21",
                    "likes": "0",
                    "time": "07/07/2021-12:34:00",
                    "content": "Sounds like a great idea ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/wijuwiju",
                    "index": "22",
                    "likes": "4",
                    "time": "13/07/2021-09:37:53",
                    "content": "hello there , just I quick follow up question regarding this proposal and its execution   Was there any publicly available information (cannot find in any threads) about how the DEFI fund would release UNI tokens to the market. imho this should be a standard for anyone received funding from uniswap, to include an outline of future allocation of funds   what was the reasoning behind using genesis trading to swap 500 000 UNI for USDC, not using the uniswap exchange, from what I see there is $60mil locked in 0.3% USDC/UNI pair, I understand fee slippage is around 4.5% for such big trade, but it could easily be mitigated by swapping smaller amounts over longer period of time, thus avoiding further sell pressure, yeah I also understand and respect that you are not obligated to answer this, since funding has already been issued and it should be non of my concern on how you allocated your funds, but would really appreciate if you could clarify   thank you delegate to wijuwiju.eth ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.4393939393939394
                },
                {
                    "author_link": "https://gov.uniswap.org/u/hlspunk",
                    "index": "23",
                    "likes": "8",
                    "time": "13/07/2021-17:13:04",
                    "content": "@sukernik It’s been called to our attention that you previously worked at Digital Currency Group and Genesis Trading is owned by Digital Currency Group.  Given the lack of transparency, several folks believe it would be helpful to understand the following:   How did  the DeFi education fund select Genesis?   What was the pricing of the trade?   If you solicited other quotes in a competitive bid, what the quotes were (vs that of Genesis)?  If you did not solicit other quotes, why you did not   @lex-node ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.7023809523809526
                },
                {
                    "author_link": "https://gov.uniswap.org/u/burtrico",
                    "index": "24",
                    "likes": "0",
                    "time": "13/07/2021-17:15:20",
                    "content": "To my understanding, OTC trades do not affect market prices. If the 500k UNI trade took place on Uniswap, that would drive the price of UNI down significantly. It would also allow MEV bots to have a go at front running the trade. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.548611111111112
                },
                {
                    "author_link": "https://gov.uniswap.org/u/cobie",
                    "index": "25",
                    "likes": "2",
                    "time": "13/07/2021-22:20:16",
                    "content": "As an immediate first-order impact, no, they are “off market”. But there are a bunch of secondary effects – every buy and sell impacts the market in some way, even those done privately. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 4.25
                },
                {
                    "author_link": "https://gov.uniswap.org/u/burtrico",
                    "index": "26",
                    "likes": "1",
                    "time": "13/07/2021-23:43:46",
                    "content": "It appears that the DeFi education has already started! How to NOT fund a grant through UNI governance proposals. Can the DeFi Education Fund please explain why they needed to sell/trade 500k UNI (about $10m) with such haste? I was surprised that this happened before a budget came out. “The 501(c)(4) will issue a detailed budget within 90 days of the proposal passing. Budgets, projections, and 5-year plans often must be revised and amended.” ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://gov.uniswap.org/u/hlspunk",
                    "index": "27",
                    "likes": "0",
                    "time": "14/07/2021-10:00:16",
                    "content": "That’s right.  Usually an OTC desk will run a “flat book” by either selling tokens short into the market or building a book of buyers ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.059523809523809
                },
                {
                    "author_link": "https://gov.uniswap.org/u/charlie-eth",
                    "index": "28",
                    "likes": "1",
                    "time": "14/07/2021-10:21:32",
                    "content": "What this “Education” Fund is trying to achieve and how it tries to achieve is way too broad. There are no explanations on how $20m will be spent and what the interests of this funds are. We see a lot of large VC interests at play but we fail to see what they stand for or what they seek (besides the obvious which is money). I don’t believe they act in good faith or for DeFi greater good, I believe they will act to defend their own interests which are extremely large stakes in large protocols like Uniswap, Compound and MakerDAO. What is this fund going to be lobbying for exactly? This is a genuine question which hasn’t been clearly answered and I read bullet points about creating educational content but I see a committee full of corporate counsel for large protocols (Compound, Uniswap and AAVE). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.070958646616541
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Jdthefren",
                    "index": "29",
                    "likes": "0",
                    "time": "22/01/2022-04:38:38",
                    "content": "Update 1/22/21 I think a similar project like this could have success. A more clear roadmap, and team with a solid track record can make this work. But after learning more, sounds like this one was a clear failure, doesn’t look good on the school. Original Post 1/21/21 New to this platform and DeFi in general. Curious about the current state of this proposal as well. But here are my thoughts after reading this: Transparency & education is definitely needed in this “new wave”. There’s several fraud cases, scams, misunderstandings etc. in this space which can be discouraging to those venturing into DeFi. Those elements don’t reflect the practical application, and true potential decentralization has in the world of finance. I think this proposal will help create solutions towards that problem; giving people more control over their wallets & funds. It’s also geared towards benefiting UniSwap, the consumers, and governance long-term. I believe similar policies will branch out to influence other DeFi company’s moves in finance & tech. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.730880230880231
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Buckerino",
                    "index": "30",
                    "likes": "1",
                    "time": "22/01/2022-11:08:10",
                    "content": "Since Harvard Law never logged in again, they just did the bidding of the investors to COMPLETELY buldoze the UNI holders and then peaced it. Completely shameless, probs illegal after they stated multiple times they wouldnt dump the UNI, yet they did, but here we are  Nobody gives a flying fuck about the UNI holder…they are here just to fund the stuff. A charity reborn. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party extending to proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 4.3
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Jdthefren",
                    "index": "31",
                    "likes": "0",
                    "time": "22/01/2022-14:54:08",
                    "content": "Really? Go figure. Initially liked the pitch, but sounds like they didn’t deliver. Can’t be too careful nowadays. Harvard pulled the rug.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.166666666666667
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Buckerino",
                    "index": "32",
                    "likes": "1",
                    "time": "22/01/2022-16:09:12",
                    "content": "Well, the idea of the DeFi Fund is a good one and yes, it does exist, but the execution of the proposal was truly a sight to behold. Extreme carnage, disarray, and amateurism ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party giving entirely negative feedback on proposal"
                    ],
                    "Sentiment": 6.4375
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Naught",
                    "index": "33",
                    "likes": "0",
                    "time": "22/01/2022-23:54:41",
                    "content": "DeFi Education Fund was passed. Half of the UNI that was awarded was sold into a multi sig wallet for operating expenses in USDC (sell price around $17-20 according to transaction date):    Ethereum (ETH) Blockchain Explorer    DeFi Education Fund: Multisig | 0x1c95930dfc1139381265ce45b5f480f1efae09a1 The Contract Address 0x1c95930dfc1139381265ce45b5f480f1efae09a1 page allows users to view the source code, transactions, balances, and analytics for the contract address. Users can also interact and make transactions to the contract directly on...      Which was a good decision to do at the time considering the market down turn. It looks like around $1.5 million has been cashed out to centralized exchanges in the last 136 days, I assume for operating expense, and awarding grants out to policy efforts. The twitter for the Defi Education Fund is here (which also has the website for grants, similar to the UGP): https://twitter.com/fund_defi ",
                    "links": [
                        "https://etherscan.io/address/0x1c95930dfc1139381265ce45b5f480f1efae09a1/advanced",
                        "https://twitter.com/fund_defi"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.398148148148149
                },
                {
                    "author_link": "https://gov.uniswap.org/u/JoeyDWhale",
                    "index": "34",
                    "likes": "0",
                    "time": "19/02/2022-08:18:06",
                    "content": "Happy to see the new form of thinktanks emerging for DeFi with more power and support from the community. We have a long way to go in created a DeFi friendly global ecosystem ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.467803030303029
                }
            ]
        }
    ],
    "group_index": "83"
}