{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/small-uni-rewards-for-providity-liquidity-when-needed/7309",
            "title": "Small UNI rewards for providity liquidity when needed ",
            "index": 7309,
            "category": [
                "Proposal Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/neverselling",
                    "index": "1",
                    "likes": "5",
                    "time": "17/10/2020-14:36:55",
                    "content": "Just an idea here. Uniswap benefits from having liquidity, as do the users. We should have UNI rewards for liquidity mining for pairs with low liquidity. Small drops only, a small bonus in UNI every month of continuous liquidity providing. The only problem that I can see currently is that someone could just make a scam token, provide liquidity for it, and reap the rewards. However I think that legit tokens, Uniswap, UNI holders, and users would benefit from higher liquidity. We would need a system to vet tokens as legit projects, seems like UNISWAP already has them in lists ie Kleros, CoinGecko etc. I think the hive mind would do great on accomplishng this. ",
                    "links": [],
                    "GPT-summary": "The author proposes to provide UNI rewards for liquidity mining for pairs with low liquidity. The author acknowledges the potential problem of scam tokens and suggests a system to vet tokens as legit projects. The author believes that higher liquidity would benefit legit tokens, Uniswap, UNI holders, and users. The post also invites feedback and collaboration on the proposal.",
                    "GPT-proposal-categories": [
                        "Token economics",
                        "Grants, Funding and resource allocation",
                        "Community and engagement"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.166666666666667
                },
                {
                    "author_link": "https://gov.uniswap.org/u/TMod_Marco",
                    "index": "2",
                    "likes": "1",
                    "time": "17/10/2020-16:15:59",
                    "content": "Hi there, There are already various open discussions to have other pools rewarded with UNI as well. Please continue the discussion in: [SURVEY] Liquidity mining program: continuation and restructuring. Thank you for the participation!  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 3.671875
                },
                {
                    "author_link": "https://gov.uniswap.org/u/TMod_Marco",
                    "index": "3",
                    "likes": "0",
                    "time": "17/10/2020-16:16:01",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "429"
}