{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/hire-the-team-for-protocol-development-and-auding/5909",
            "title": "Hire the team for protocol development and auding ",
            "index": 5909,
            "category": [
                "Proposal Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/Mr_Po",
                    "index": "1",
                    "likes": "1",
                    "time": "25/09/2020-13:53:21",
                    "content": "From Introducing UNI:  The Uniswap team will continue to have no involvement in v2 protocol development, auditing, and other matters.  Obviously we still need someone to be involved in protocol development, auditing , and other matters. It looks like the most natural way where the interests align the most would be for UNI holders to vote on hiring Uniswap team to do the job to start with. I’m not saying people from Uniswap team are the only ones who should ever do the job, but they seem like good candidates to watch over the protocol while its developers network matures. I think it would be quite good in the long run to have distributed developers network for the protocol - and it should be incentivised by the governance treasury. But we need to start somewhere, and it’s better to start in a safe place. As a bonus maybe it won’t cost us as much to hire Uniswap team given how invested they are into the protocol’s future. Of course, it is possible that Uniswap team members will refuse to be hired by the community, but in this case it’s better to find out sooner rather than later, and start hiring people who will do the job that most definitely needs to be done. And probably hire them in quite a rush, as the engines will start running pretty soon. ",
                    "links": [],
                    "GPT-summary": "The author proposes that the Uniswap team be hired by UNI holders to oversee the development and auditing of the v2 protocol. The author believes that this would be a safe and natural way to start, and that it would be beneficial in the long run to have a distributed developers network for the protocol. The author acknowledges that the Uniswap team may refuse to be hired, and suggests that other candidates be considered if this is the case. The post also invites questions and constructive criticism on the proposal.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Board composition",
                        "Law and regulations",
                        "Smart contract updates",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.1625
                },
                {
                    "author_link": "https://gov.uniswap.org/u/RodAthens",
                    "index": "2",
                    "likes": "0",
                    "time": "25/09/2020-14:51:38",
                    "content": "I don’t think that is obvious. I believe they are working on v3 and we will all benefit from that. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/dcota",
                    "index": "3",
                    "likes": "0",
                    "time": "25/09/2020-15:56:31",
                    "content": "Per the Uniswap token introduction, I believe the team is “vested in” for at least the next 4 years; and as @RodAthens mentioned, they are certainly working on V3. However, past that 4 year mark; the current team could (doesn’t mean they will) just dump and enjoy the fruits of their work. I think is unlikely but who knows. Long term though (5 -10 years from now) is a valid concern.  However, crypto changes so fast! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.725892857142857
                }
            ]
        }
    ],
    "group_index": "386"
}