{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/a-proposal-do-nothing-with-uniswaps-liquidity-incentives/9030",
            "title": "A proposal: Do nothing with Uniswap's liquidity incentives ",
            "index": 9030,
            "category": [
                "Proposal Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/mykha2",
                    "index": "1",
                    "likes": "7",
                    "time": "01/12/2020-18:01:45",
                    "content": "Hey everyone, have followed the discussion on the forums and wanted to pitch in. Appreciate the great work everyone is doing – including regarding the proposal to continue the liquidity mining rewards in some capacity. Put together this piece with counterarguments for why there’s no need for the rewards right now, and hopefully opening up some new ideas about how rewards could be distributed in the future + what the treasury could be spent on. Read the text on The Block here: https://www.theblockcrypto.com/post/86082/uniswap-liquidity-incentives-proposal ",
                    "links": [],
                    "GPT-summary": "The author of the post is explaining their proposal regarding Uniswap's liquidity incentives. They provide counterarguments for why there's no need for the rewards right now and suggest new ideas for how rewards could be distributed in the future. A 3rd party is giving constructive criticism of the proposal and asking questions about it.",
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Token economics",
                        "Grants, Funding and resource allocation",
                        "Community and engagement"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.1220779220779225
                },
                {
                    "author_link": "https://gov.uniswap.org/u/sky",
                    "index": "2",
                    "likes": "1",
                    "time": "02/12/2020-00:38:36",
                    "content": "Just finished reading the block article. It makes a lot of sense and I’ll vote in favor. Any plans/timelines for next steps? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Ezzy",
                    "index": "3",
                    "likes": "0",
                    "time": "02/12/2020-07:34:46",
                    "content": "Quite an exhaustive and comprehensive analysis…bringing analogy to LMP and market-share value/volume…pontificating that the former has little/no much effect on the later(s), hence advocating for a discontinuation of the former. You equally suggested issuing grants/bounty towards building/developing competitive DeFi-based products/applicationns for more advanced Uniswap interaction. Your ideas are intelligent and lofty, but I beg to differ from your opinion that valuation tied to LPM is a “vanity-metric”. I believe for this period LPM still has a subtle role to play as a kind of “stratum-layer”…aside any measure of its correlation to market-share/volume…at least until Uniswap v3 is up and running. LPM reward however can come at a reduced rate and may or may not be in UNI.  Your idea can still be implemented alongside LPM program or whenever possible. One thing is sure LPM program can’t continue endlessly, it’s only for a limited period. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.723412698412699
                }
            ]
        }
    ],
    "group_index": "509"
}