{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/uniswap-news-and-visibility/10347",
            "title": "Uniswap news and visibility ",
            "index": 10347,
            "category": [],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/BenB",
                    "index": "1",
                    "likes": "5",
                    "time": "14/02/2021-19:02:42",
                    "content": "Hello UNI World \\o/, New into UNI since 3 weeks, I am really suprised there is not a lot of articles about our favorite crypto in the Google news. Also, on Twitter, there are only 5 posts since the beginning of the year (?!) And I can’t even find an official Uniswap account on Instagram … A good visibility could help us to grow the UNI holders number, so why hiding ? A lot of crypto competitors use the airdrop in return of the “follow official account on twitter” for exemple. In short, to be seen more could help the UNI community. Have all a nice weekend ! Ben. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.741477272727272
                },
                {
                    "author_link": "https://gov.uniswap.org/u/neverselling",
                    "index": "2",
                    "likes": "1",
                    "time": "15/02/2021-07:42:31",
                    "content": "Idk I think nows not the time, we need to het gas prices under control first. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.uniswap.org/u/BenB",
                    "index": "3",
                    "likes": "2",
                    "time": "15/02/2021-18:34:03",
                    "content": "It’s a part indeed, but if everybody runs away on 1inch with their recent vampire airdrop for uni holders and 75 posts on twitter since the beginning of the year (little exemple) or even sushiswap, that will maybe never solve the gas price issue … ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.53125
                },
                {
                    "author_link": "https://gov.uniswap.org/u/bluehills",
                    "index": "4",
                    "likes": "1",
                    "time": "09/03/2021-21:59:17",
                    "content": "Hey guys! I am with INDEX Coop and writing an intro article to Uniswap as part of the INDEX Investment Committee series for tokens held in the DPI index token fund. I was wondering if any of the Uniswap team would be interested in reading over the paper and giving input. We are on rough draft v2 now and looking for comments for editing or improving the current draft of the document! Who should I contact to see if interested in giving it a review before we publish it to our newsletter? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/bluehills",
                    "index": "5",
                    "likes": "0",
                    "time": "09/03/2021-22:00:39",
                    "content": "Our goal is to give an overview of Uniswap, its history and improvements, what makes it unique within the DeFi ecosystem and future improvements and beyond to expect for the platform in V3 and beyond. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9375
                }
            ]
        }
    ],
    "group_index": "7"
}