{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/suprememe-a-meme-competition/11385",
            "title": "Suprememe - A Meme Competition ",
            "index": 11385,
            "category": [],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/Lsquared",
                    "index": "1",
                    "likes": "1",
                    "time": "07/04/2021-18:38:13",
                    "content": "Uniswap and Compound are holding a joint meme competition to increase education and awareness of their respective protocols. In collaboration with Uniswap grants and Compound grants, we are excited to announce a joint competition — Suprememe . Memes are some of the most effective ways of conveying information and breaking down complex ideas into digestible pieces. Who will create the best meme (image, video, sound, etc) to demonstrate particular aspects of each protocol? The 1st iteration of the competition will go on for 4 weeks. Each week will have a different theme.  1252×334 10 KB  Process (all days end ~Midnight EST)  On Monday the theme will be released Submissions due Friday — Contestants can submit up to one meme per protocol. Details and submission form here  Community voting from Saturday to Tuesday Meanwhile a new theme is released on Monday Prior week’s winners are announced Wednesday.  Prizes  1250×266 9.1 KB  Final Thoughts The goal is to have fun. This IS an experiment, each week we’ll refine the process. If you have any suggestions my twitter DMs are open (@lsquaredleland)(Thoughts on submitting memes as NFTs? — assuming there’s a non gas guzzling way). To keep in the loop, follow @uniswapgrants and @compoundgrants on Twitter for subsequent details and links. ",
                    "links": [
                        "https://docs.google.com/forms/d/e/1FAIpQLSdeKkNkifijEE1KZsH3VZgkdYUFPoZue3rW1DpmB98Gv8jmqQ/viewform?usp=sf_link",
                        "https://global.discourse-cdn.com/business6/uploads/uniswap1/original/2X/c/c15ab79ba528ed3810c1cc310ad290f2b24670d5.png"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.852198455139631
                }
            ]
        }
    ],
    "group_index": "47"
}