{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/proposal-to-allow-only-time-locked-tokens-to-vote/1678",
            "title": "Proposal to allow only time-locked tokens to vote ",
            "index": 1678,
            "category": [],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/leo_eth",
                    "index": "1",
                    "likes": "4",
                    "time": "17/09/2020-20:49:12",
                    "content": "Currently, if my understanding is correct, any UNI token holder can vote. This is very inclusive but it may also be more prone to attack. What can block someone to borrow a lot of UNI to vote and then repay those coins right after? To solve this problem, I propose to only allows time-locked tokens to vote (Approach inspired by the CurveDAO). Tokens have to be locked x week (months?) to have the right to vote. In addition, to incentivize locking, we could give to those tokens more revenue from the trading fee (maybe all). Advantages of such approach is numerous:  No more easy attack on the governance Voters have stronger incentives to have a long-term healthy vision for the protocol. (skin in the game) Less noise Voters take more risks (time-lock) but get more reward from the protocol’ success  Disadvantage are:  Less inclusive  ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.839285714285714
                },
                {
                    "author_link": "https://gov.uniswap.org/u/AutarkXu",
                    "index": "2",
                    "likes": "1",
                    "time": "17/09/2020-20:55:11",
                    "content": "Ah，I agree，locking makes us vote more carefully ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Noah",
                    "index": "3",
                    "likes": "3",
                    "time": "17/09/2020-21:00:16",
                    "content": "appreciate the comment @leo_eth, i’d like to point out 2 facts which largely obviate the concerns you’ve raised.   as in compound governance, uniswap governance proposals can only be voted on with tokens that were possessed as of a historical block – in particular, 1 block before the proposal was made. this has the effect of dramatically limiting the effectiveness of borrow-to-vote schemes.   at any point before the execution of a proposal, if the proposer’s share of voting power drops below the proposal threshold (currently set to 1%), then anyone may immediately cancel the transaction. this effectively forces the proposal to maintain voting power through the entire voting and timelock period, ensuring that incentives are more or less aligned.   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.730158730158729
                },
                {
                    "author_link": "https://gov.uniswap.org/u/neverselling",
                    "index": "4",
                    "likes": "1",
                    "time": "17/09/2020-22:56:11",
                    "content": "Sounds like a good proposal at first glance. What about a weighted score (say 30% of vote weight), and to reach full weight you would have to lock for as you say a month. Too much? Taking a huge loan out for UNI is risky too, there should be a minimum 3 day or 7 day lock or so to prevent governance attack like you said. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.8999999999999995
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Morkle",
                    "index": "5",
                    "likes": "0",
                    "time": "17/09/2020-23:26:19",
                    "content": "I dont think this would be a good idea, market makers have already been established behind the coin and in those 15 days thousands of people would also be included, flooding the market with UNI. I think it would be even less of good idea allowing anyone to signup for the next 3 months, just imagine how much people will try to take advantage of that. I can already imagine all the people that would flood the networks with thousands of transactions calling the UNISWAP contracts to get their addresses added - so not only would you disrupt the tokenomics of UNI but you would leave the ethereum network clogged for another 3 months. This worked because nobody knew about it.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.738095238095237
                }
            ]
        }
    ],
    "group_index": "187"
}