{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/we-need-votes-to-pass-a-second-check-with-an-anti-sybil-mechanism/13822",
            "title": "We need votes to pass a second check with an anti-sybil mechanism ",
            "index": 13822,
            "category": [
                "Proposal Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/neverselling",
                    "index": "1",
                    "likes": "2",
                    "time": "19/08/2021-16:53:26",
                    "content": "Its clear whales have too much power to run governance. Id like to hear some ideas about using something like proof of humanity with a hashed eth address for privacy as a “second house of congress”. ie everyone with 400 votes or so is eligible to sign up for some kind of anti-sybil mechanism. Any votes would have to pass the anti-sybil mechanism once they pass the UNI vote. Not a perfect idea, but we really need to think about hauling in whales power to do whatever they want. This isnt good for optics, nor for UNI price, nor for the future of Defi as a whole. ",
                    "links": [],
                    "GPT-summary": "The author of the post is explaining a proposal to address the issue of whales having too much power in governance. The proposal involves using an anti-sybil mechanism like proof of humanity with a hashed eth address for privacy as a \"second house of congress\". The post also invites ideas and feedback on the proposal. A 3rd party is giving constructive criticism by suggesting that the proposal may not be perfect, and asking questions about how it would work.",
                    "GPT-proposal-categories": [
                        "Governance and Voting",
                        "Privacy, Security and Risk Management",
                        "Token Economics",
                        "Interoperability and Scalability",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.75
                }
            ]
        }
    ],
    "group_index": "119"
}