{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/poll-should-uni-holders-be-rewarded/2849",
            "title": "[POLL] Should UNI Holders Be Rewarded? ",
            "index": 2849,
            "category": [
                "Governance-Meta"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/Zer0dot",
                    "index": "1",
                    "likes": "34",
                    "time": "18/09/2020-17:07:39",
                    "content": "Hey everyone! Hope you guys are well! Just wanted to gauge the community’s thoughts regarding rewarding UNI holders. I created a little poll, please go ahead an give your opinion. Should UNI Holders Be Rewarded?     Yes, UNI holders should be rewarded. Yes, but only if they actively participate in governance/vote. No, UNI holders don’t need additional incentive.     0 voters     Thank you for your input folks! Here’s to a great, decentralized future!  Zer0dot ",
                    "links": [
                        "https://gov.uniswap.org/t/ability-to-toggle-fees-is-next-week-do-we-do-it/10288/26"
                    ],
                    "GPT-summary": "The author of the post is asking for feedback from the community regarding whether UNI holders should be rewarded. The post includes a poll with three options and the author thanks the community for their input. The post may also be considered as advertising the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "3rd party or author is advertising proposal",
                        "None"
                    ],
                    "Sentiment": 4.961309523809524
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Bitcoindoctor",
                    "index": "2",
                    "likes": "6",
                    "time": "18/09/2020-18:16:11",
                    "content": "Inflation should be thought of as Interest and benefit holders. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Zer0dot",
                    "index": "3",
                    "likes": "1",
                    "time": "18/09/2020-20:10:47",
                    "content": "I think that’s a good idea. However, how will UNI’s value be maintained as inflation erodes into the governance power of each individual token. I.e: If 100 tokens exist, and inflation brings it up to 102, the voting power (and thus hypothetically value) should stay the same, isn’t that so? Let me know if that makes sense!     Bitcoindoctor:  Inflation should be thought of as Interest and benefit holders.   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 6.166666666666667
                },
                {
                    "author_link": "https://gov.uniswap.org/u/monet-supply",
                    "index": "4",
                    "likes": "9",
                    "time": "18/09/2020-20:16:41",
                    "content": "    Bitcoindoctor:  Inflation should be thought of as Interest and benefit holders.   IMO the point of having supply inflation is to redistribute value from passive token holders / free-riders to active community members, liquidity providers, integrators, developers, etc. This will increase overall network value in the long run, even for those passive holders who experience gradual dilution. Rewarding holders of UNI seems like a waste of resources to me, when it could be directed to building out the protocol and gaining market share. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.116666666666667
                },
                {
                    "author_link": "https://gov.uniswap.org/u/haydenadams",
                    "index": "5",
                    "likes": "23",
                    "time": "18/09/2020-20:38:32",
                    "content": "The 2% inflation is a cap on maximum UNI that can be minted per year by governance following the end of community treasury vesting. The most efficient way to evenly distribute newly minted UNI to all holders would be to burn it all, in which case why mint in the first place Inflation only really makes sense if its not evenly distributed to all users  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.905303030303031
                },
                {
                    "author_link": "https://gov.uniswap.org/u/mtcarmel1914",
                    "index": "6",
                    "likes": "2",
                    "time": "19/09/2020-02:58:49",
                    "content": "To your point, Consider the droves of new users in bound. Many people are just now hearing about UNI ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.590909090909091
                },
                {
                    "author_link": "https://gov.uniswap.org/u/bilibilihuangyifan",
                    "index": "7",
                    "likes": "2",
                    "time": "19/09/2020-07:12:11",
                    "content": "agree, at least part of inflated UNI should be given to active participates. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.9166666666666665
                },
                {
                    "author_link": "https://gov.uniswap.org/u/skyle",
                    "index": "8",
                    "likes": "0",
                    "time": "19/09/2020-07:38:08",
                    "content": "i disagree because it is unfair to those who did not UNI hodler. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 2.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/TMod_Marco",
                    "index": "9",
                    "likes": "31",
                    "time": "19/09/2020-11:35:35",
                    "content": "Personally, I voted for ‘Yes, but only if they actively participate in governance/vote.’. Reason: $UNI is a governance token. In order for this to work we’ll need people to create proposals and use their UNI to vote. There’s a bunch of UNI allocated to be provided to the community. In my opinion, this should be used wisely in a way that benefits the ecosystem and protocol. Users who vote actively engage with Uniswap and the direction it’s going to, which is much more valuable than people who simply hold onto the token and don’t participate. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.666666666666666
                },
                {
                    "author_link": "https://gov.uniswap.org/u/mak",
                    "index": "10",
                    "likes": "7",
                    "time": "19/09/2020-12:32:32",
                    "content": "There’s no reason to mint the coins if it’s going to be distributed to ALL holders since it’s functionally equivalent as not having minted the new coins at all. In my opinion the best use of the new inflation would be to spend it on development work and outreach or other ventures that help onboard more people to crypto and uniswap. Incentivizing people for participating in governance via inflation tends to be a bad idea in my experience since people tend to make super short term decisions without considering the long term consequences as they are just interested in the rewards and not the proposal itself. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.740530303030304
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Demiserv",
                    "index": "11",
                    "likes": "3",
                    "time": "19/09/2020-14:56:21",
                    "content": "Exactly!  Governance dictates a responsibility imo. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5625
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Bitcoindoctor",
                    "index": "12",
                    "likes": "4",
                    "time": "19/09/2020-18:05:52",
                    "content": "What’s “UNFAIR” to those that did not UNI hodl ? They are by definition … NOT INVOLVED. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Northoak",
                    "index": "13",
                    "likes": "5",
                    "time": "19/09/2020-18:15:50",
                    "content": "DEFINITELY - IF - THEY PARTICPATE IN GOVERNANCE. ARE WE NOT FOUNDERS OF UNISWAP? I created a post about being FOUNDERS and thhey have not made it public yet. We have a HUGE RESPONSIBILITY & MASSIVE UNDERTAKING AHEAD OF US… FROM THE  UNI TOKEN PAGE… Inspired by Ethereum’s vision, we have long committed to the ideals of permissionless access, security, and immutability, all indespensable components for a future where anyone in the world can access financial services without fear of discrimination or counterparty risk. Having proven product-market fit for highly decentralized financial infrastructure with a platform that has thrived independently, Uniswap is now particularly well positioned for community-led growth, development, and self-sustainability. t is crucial that governance is constrained to where it is strictly necessary. With this in mind, the Uniswap governance framework is limited to contributing to both protocol development and usage as well as development of the broader Uniswap ecosystem. After 30 days, governance will reach its vesting cliff and Uniswap governance will control all UNI vested to the Uniswap treasury. At this point, governance can vote to allocate UNI towards grants, strategic partnerships, governance initiatives, additional liquidity mining pools, and other programs. A community-managed treasury opens up a world of infinite possibilities. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.275074404761905
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Zer0dot",
                    "index": "14",
                    "likes": "1",
                    "time": "19/09/2020-20:31:44",
                    "content": "Lots of great answers here! I’m hopeful we’ll make some progress and decisions pretty quick. I do want to point out, however, that rewarding fees to active UNI protocol participants in UNI would require the automated purchase of UNI, disincentivizing UNI liquidity providers due to impermanent loss… Does that make sense? Maybe there’s a long-term creative alternative the community will come up with! Or maybe I have no idea what I’m talking about… Yeah, probably that.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Bitcoindoctor",
                    "index": "15",
                    "likes": "8",
                    "time": "19/09/2020-22:35:45",
                    "content": "@Northoak I believe, as a founder of UNI, that my primary responsibility is ensuring the future value of UNI to liquidity providers and ACTIVE Hodlers. (I will concede the “active” qualification to those “Hodlers” that should benefit) I believe, as an active Hodler, my selfish animal interests are aligned with … A) Long Term continued health of ALL aspects of the UNI ecosystem. Hodlers, Liquidity Providers and of course users of THE BEST DECENTRALIZED EXCHANGE IN THE WORLD. Eventually, Cross-Chain … Hyperledger, Stellar, Stratis, Hedera, Tron, et. al. B) Healthy growth of the “Network”, We want many, many Millions to own and cherish their ownership of UNI. Hoping for “Billions” is unrealistic and “Pollyannish”, excessively optimistic about the impact of Crypto in the Mainstream. C) Profit, “Greed is Good”, as it relates to the future powerful incentive of the dirty question of UNI’s price on the open market. May the price of UNI reach for the stars. I hope we can incorporate, eventually, the concept of a “stock split”. In a mature market where ownership of an asset is coveted, I believe, enabling more and more and more NEW believers to get “in the Game” is absolutely imperative. If the price is TOO high, then we need to anticipate this and be prepared to allow new people to “Buy In” at a lower price point while protecting the “Investment” of existing active hodlers. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.737542087542088
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Northoak",
                    "index": "17",
                    "likes": "6",
                    "time": "20/09/2020-19:39:08",
                    "content": "I think the idea of a Founder’s Governance Pool or Reward may be open for a PROPOSAL of some sort when voting begins.   UNISWAP FINANCIAL SERVICES - they claim to be just so on the UNI TOKEN page.   AND… it says WE sre… \"STEWARDS OF THE TREASURY!\"   26 There is a Hayden Adams YouTube video - 2 or 3 of the same one on YouTube homepage actually - where Hayden states that …  UNISWAP HAS LOTS OF COOL NEW PLANS & IDEAS FOR IT’S PROT0COL. WHAT ARE THOSE P[LANS? WILL WE BE VOTING ON …  A UNISWAP CRYPTO CARD? UNISWAP REAL ESTATE EXCHANGE? ???  From his videol, it sounds like we are going to have… MAJOR RESPONSIBILITY LOTS OF NEW SERVICES, FEATURES & POOLS TO VOTE ON THERE ARE NOW SEVERAL YOUTUBE VIDEOS POPPING UP ALMOST EVERY HOUR FROM EXPERTS / ANALYSTS TALIKING ABOUT… HOW BIGI  UNISWAP IS GOING TO BE! THIS IS ALL VERY EXCITING & SHOULD BE REWARDING AS WELL! THANKS EVERYONE! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.827010489510489
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Tim",
                    "index": "18",
                    "likes": "4",
                    "time": "20/09/2020-19:58:39",
                    "content": "    mak:  he new inflation would be to spend it on development work and outreach or other ventures that help onboard more people to cry   i voted yes. anyone holding should be rewarded. Just for holding and not dumping on the market. Voters should be rewarded extra for participating. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.639204545454546
                },
                {
                    "author_link": "https://gov.uniswap.org/u/LosMontana420",
                    "index": "19",
                    "likes": "0",
                    "time": "20/09/2020-20:01:08",
                    "content": "Where do you go to vote? Because I haven’t seen anything in proposals on Uniswap Interface. Is there a voting mechanism on here? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Tim",
                    "index": "20",
                    "likes": "1",
                    "time": "20/09/2020-20:01:57",
                    "content": "just via uniswap in 28 days ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/LosMontana420",
                    "index": "21",
                    "likes": "1",
                    "time": "20/09/2020-20:03:27",
                    "content": "So nothing official to vote on, your just expressing what your gonna vote when the time comes? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Tim",
                    "index": "22",
                    "likes": "2",
                    "time": "20/09/2020-20:05:11",
                    "content": "People feel this need i think? Rally troops? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/caquinn",
                    "index": "23",
                    "likes": "1",
                    "time": "20/09/2020-20:07:06",
                    "content": "Northoak, I believe many more individuals would not have liquidated their 400 UNI tokens if they were aware of the breath and depth of these future projects you had mentioned. That said, those who  hodle and contribute to the governance of future projects should be rewarded. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.uniswap.org/u/dusundurt",
                    "index": "24",
                    "likes": "2",
                    "time": "21/09/2020-00:25:07",
                    "content": "I think this is totally fair. No hodle no reward… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/RodAthens",
                    "index": "25",
                    "likes": "2",
                    "time": "21/09/2020-00:34:29",
                    "content": "Whats the point of rewarding hoddlers, i fail to see exactly why people support this idea. I think individuals that are involved in the project (providing liquidity in UNI or other tokens, voting, developing, etc…) should be those that get the rewards imo. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.15625
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Tim",
                    "index": "26",
                    "likes": "2",
                    "time": "21/09/2020-06:57:57",
                    "content": "I think that is what is meant by rewarding holders. The active holders that participate will be rewarded extra eg:  by Voting . But passive holders shouldn’t be punished with eg: 2% inflation dilution. At least this should be thought of very carefully. Else this uni liquity miners will dump any farmed uni straight to market and we know how that works outfor token price. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.113888888888889
                },
                {
                    "author_link": "https://gov.uniswap.org/u/severij",
                    "index": "27",
                    "likes": "2",
                    "time": "21/09/2020-14:16:14",
                    "content": "In any case people who vote on proposals should be rewarded in my opinion. I don’t know how much is appropriate but at least a little to compensate some of the Ethereum gas fees. I as well don’t see any point in revarding people who just hold. I think it is a waste of UNI. The reserves should be used sparingly. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.765625
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Native",
                    "index": "28",
                    "likes": "2",
                    "time": "21/09/2020-18:05:55",
                    "content": "    Northoak:  There is a Hayden Adams YouTube video - 2 or 3 of the same one on YouTube homepage actually - where Hayden states that … UNISWAP HAS LOTS OF COOL NEW PLANS & IDEAS FOR IT’S PROT0COL. WHAT ARE THOSE P[LANS? WILL WE BE VOTING ON …  A UNISWAP CRYPTO CARD? UNISWAP REAL ESTATE EXCHANGE?    Can you provide a source for this ? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "3rd party or author is advertising proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.686363636363636
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Dan007",
                    "index": "29",
                    "likes": "1",
                    "time": "22/09/2020-09:27:45",
                    "content": "All the top Blockchains are now encouraging holders by rewarding. Next, we can make it more attractive for UNI investors by making all new projects which will list on Uniswap to contribute a set percentage to the existing UNI holders  in the form of airdrop. The percentage proposal can be decided by community. This will create awairness for the new project at the same time will force the new company to be more creative and in highlighting viable project benefits to its investor. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party or author is advertising proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.685950413223141
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Uniguy772",
                    "index": "30",
                    "likes": "1",
                    "time": "22/09/2020-09:31:54",
                    "content": "Any ERC-20 token can be traded on Uniswap thus why you get the warning going into any token reminding you to be careful of scams so there is no listing as such. Also what is the incentive for a project  to do this would like to know? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Mr_Po",
                    "index": "31",
                    "likes": "0",
                    "time": "24/09/2020-00:44:17",
                    "content": "    mak:  Incentivizing people for participating in governance via inflation tends to be a bad idea in my experience since people tend to make super short term decisions without considering the long term consequences as they are just interested in the rewards and not the proposal itself   It seems to me that delegating votes would solve the problem of unwanted participation for the most part. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.277777777777778
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Mr_Po",
                    "index": "32",
                    "likes": "13",
                    "time": "24/09/2020-01:20:08",
                    "content": "#1 I think is poll is highly non-representative of what UNI token holders think, as it’s sample is heavily skewed towards people who want to actively participate in governance. A very small % of UNI holders finds themselfes in ‘Governance-meta’ subforum. #2 Functionally the closest thing to UNI token from the traditional financial world is shares. You can vote as a shareholder, but you don’t have to vote as a shareholder to receive dividends. When answering the question about rewarding UNI holders an important clarification needs to be made: How should UNI holders be rewarded? I see 2 ways to reward UNI holders:  With supply dilution - from the community treasury fund. This in my opinion is meaningless and achieves nothing, a lot of reasons for that were expressed above.  With the value that the protocol produces.  The second way is quite beneficial and necessary in my opinion, as it brings the value to the token. If part of the fees gained by the platform goes towards UNI holders, it becomes much easier for people to assess the value of their holdings by using metrics from traditional markets analysis. So, when speaking about the 2nd way, I don’t think that much participation should be needed to receive ETH rewards from trading activity on the platform. As @mak already noted, forced participation is not a good thing. If it was up to me, I would distribute ETH rewards for holding the token and UNI rewards for active participation in the network. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 4.8732456140350875
                },
                {
                    "author_link": "https://gov.uniswap.org/u/loveuni",
                    "index": "33",
                    "likes": "3",
                    "time": "24/09/2020-05:17:39",
                    "content": "Definitely a great idea to reward holders for holding UNI ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/darzyx",
                    "index": "34",
                    "likes": "1",
                    "time": "24/09/2020-06:09:48",
                    "content": "I wonder if in this scenario incentives could be aligned such that higher-quality interactions in governance are rewarded more. More UNI means more votes to give, more votes earned means more rewards for the votes earner. Unsure yet if this is desirable, just something to think about. Another idea, someone who is well known (e.g. Vitalik) that might not want the rewards but would earn a lot of them could choose to not earn them or to have them go towards some other purpose. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.696428571428572
                },
                {
                    "author_link": "https://gov.uniswap.org/u/darzyx",
                    "index": "35",
                    "likes": "3",
                    "time": "24/09/2020-06:24:56",
                    "content": "What, if any, are the ways in which passively holding $UNI benefits Uniswap? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/TMod_Marco",
                    "index": "36",
                    "likes": "1",
                    "time": "24/09/2020-08:22:45",
                    "content": "At this point, there are none. Unless more token features get added in the future that’d make ‘holding’ UNI beneficial for the network (and user) other than speculation. Therefore, I shared the above comment ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.46875
                },
                {
                    "author_link": "https://gov.uniswap.org/u/darzyx",
                    "index": "37",
                    "likes": "2",
                    "time": "25/09/2020-02:27:31",
                    "content": "After thinking a bit, two benefits are:  The price of UNI goes up, which benefits everyone in all four allocation pools. Admittedly more abstract, but anyone who holds UNI is likely to talk about it, potentially increasing the number of Uniswap users.  I’m skeptical that rewards for these would create a good ecosystem, but I wanted to throw them out there. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.699999999999999
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Gonzo",
                    "index": "38",
                    "likes": "2",
                    "time": "25/09/2020-15:04:56",
                    "content": "The consequence of inflation is the purpose.  Utility, scarcity, and demand.  They go together like rock, paper, and scissors.  Take any one away from the others and you don’t have a game anymore. That’s why its game over, players.  Somebody won and so everyone lost.  With a wink and a grin and a flick of a pen they’ll do it again if we let them. I think we’re all here because we want a new game. The reward IS the game.  How long can we play? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 3.7386363636363633
                },
                {
                    "author_link": "https://gov.uniswap.org/u/BitSavage0202",
                    "index": "39",
                    "likes": "2",
                    "time": "25/09/2020-17:52:48",
                    "content": "    Mr_Po:  If it was up to me, I would distribute ETH rewards for holding the token and UNI rewards for active participation in the network.   This is a great start! Reward passive hodlers with Dai, ETH, YFI and other tokens in the ecosystem… LPs, voters and other participants should get maximum rewards. Check out gitcoindotco I vote to create a learning hub where new UNI users can come learn how to vote, Be an LP and more! Heck I can even create NFTs as rewards with all the artists I know and using for my own platform! Let grow and more… ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 6.520021645021645
                },
                {
                    "author_link": "https://gov.uniswap.org/u/ETHisFunny",
                    "index": "40",
                    "likes": "5",
                    "time": "26/09/2020-16:55:50",
                    "content": "I think for the overall stability of the protocol you ABSOLUETLY must incentivise governance. I think if you don’t, then short term incentives will supersede the long term. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 4.916666666666666
                },
                {
                    "author_link": "https://gov.uniswap.org/u/ETHisFunny",
                    "index": "41",
                    "likes": "2",
                    "time": "26/09/2020-17:03:15",
                    "content": "    BitSavage0202:  This is a great start! Reward passive hodlers with Dai, ETH, YFI and other tokens in the ecosystem… LPs, voters and other participants should get maximum rewards. Check out gitcoindotco I vote to create a learning hub where new UNI users can come learn how to vote, Be an LP and more! Heck I can even create NFTs as rewards with all the artists I know and using for my own platform! Let grow and more…   I’m going to bounce off this. I think I would like to see ETH rewarded to UNI stakers from transaction fees and UNI rewarded for providing liquidity and participating in protocol governance out of the 2% inflation rate, and perhaps out of the community chest before inflation kicks in. Obviously, the delegates should be rewarded foremost, and then the voters. Finally, I think that the percent of UNI rewards going to governance should be substantially less than the rewards going to liquidity providers. Also, I just wanted to add, I love the idea of creating NFTs as rewards. I’m a bit of an artist myself. That would be really cool. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party or author is advertising proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.338498622589532
                },
                {
                    "author_link": "https://gov.uniswap.org/u/BitSavage0202",
                    "index": "42",
                    "likes": "0",
                    "time": "26/09/2020-17:36:28",
                    "content": "Dope! Where is your art? I would love to see it. I use rarible currently as @OmB I am going to build a platform like $MEME, but for more traditional artists, with UNIV2-LP contract or V3 when it releases ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party or author is advertising proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.uniswap.org/u/ETHisFunny",
                    "index": "43",
                    "likes": "1",
                    "time": "26/09/2020-18:48:27",
                    "content": "I used to do a lot of 2D/3D animation (so nothing traditional) It’s been a good while but I got started again recently. I am working on a 16 bit style, but I don’t have anything I want to showcase just yet. I’d like to see what you build later, and maybe I’ll have something to show by then. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.875
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Timothy",
                    "index": "44",
                    "likes": "0",
                    "time": "26/09/2020-21:23:40",
                    "content": "For what?  Uni airdrop rewarded early adoption and support.  No offense but the greed here is out of control. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/BitSavage0202",
                    "index": "45",
                    "likes": "0",
                    "time": "26/09/2020-22:16:23",
                    "content": "Sure thing. I have some of my paintings on Enjin erc1155 contract. But my main focus has been on rarible: https://app.rarible.com/omb/created have a look ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party is advertising proposal"
                    ],
                    "Sentiment": 6.666666666666666
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Timothy",
                    "index": "46",
                    "likes": "0",
                    "time": "27/09/2020-01:18:30",
                    "content": "the whole point of holding is to vote thats the incentive… why is bitcoin so popular? Do they reward their holders? No at this point ypu guys want this to be another get rich quick pump n dump scheme it makes me sick honestly. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.16170634920635
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Zer0dot",
                    "index": "47",
                    "likes": "3",
                    "time": "27/09/2020-02:05:11",
                    "content": "I believe that voting is the responsibility, the incentive’s role is to get people to perform that responsibility! At least, that’s the way I look at it. I get where you’re coming from though- lots more discussion to come! I replied to your standalone post with more, too.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 6.375
                },
                {
                    "author_link": "https://gov.uniswap.org/u/ageless",
                    "index": "48",
                    "likes": "0",
                    "time": "28/09/2020-15:34:32",
                    "content": "I voted for Yes, but only if they actively participate in governance / vote, but on second thoughts I am fine with rewarding all holders equally. I changed my mind on it because the most efficient way to distribute rewards is probably going to come from treasury funds buying and burning UNI from the supply, in which case it’s not possible to reward UNI holders disproportionately. Suspect from a legal perspective that is what would be advised as well as makerdao have a burn mechanism as oppose to a dividend mechanism probably down to a few factors, but legal concern being one of them. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5532407407407405
                },
                {
                    "author_link": "https://gov.uniswap.org/u/neozaru",
                    "index": "49",
                    "likes": "3",
                    "time": "02/10/2020-13:41:20",
                    "content": "As frustrated by the lack of governance participation as I am, I don’t think governance should be financially incentivized. People who really care about the project (and thus, value accrual of their tokens) will take the initiative if they have the wish, the time or the knowledge to do it. So far, in various projects, it looks like incentivizing governance leads to decisions that are either less thought-about or less long-term - although I am aware that “long-term” in DeFi might have a different definition. People would vote just to be voting. Or they would choose to vote to anything promising an higher yield. Speaking of rewards in general, to me, yes UNI Holders should probably be rewarded (independently of participation). Does that mean that they should be rewarded now ? I am less sure. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.01171875
                },
                {
                    "author_link": "https://gov.uniswap.org/u/zapata34",
                    "index": "51",
                    "likes": "2",
                    "time": "02/10/2020-22:12:36",
                    "content": "I think those who trade in uni should be rewarded The more uni is used in the bottom base, the more valuable it is treated and the more people’s interest in uni ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.875
                },
                {
                    "author_link": "https://gov.uniswap.org/u/RodAthens",
                    "index": "52",
                    "likes": "7",
                    "time": "03/10/2020-00:30:58",
                    "content": "Why should we reward uni transaction volume? In my opinion we need the token in strong hands that are interested in the project, rewarding traders is not the way to go ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None"
                    ],
                    "Sentiment": 6.972222222222221
                },
                {
                    "author_link": "https://gov.uniswap.org/u/zapata34",
                    "index": "53",
                    "likes": "1",
                    "time": "04/10/2020-00:20:01",
                    "content": "Dollars are used in all countries, there is a common currency, everyone has to link small accounts to close the market, large accounts may shift to other exchanges, but smaller accounts will be more numerous and easier to link, and will only be directed to you if you reward them. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.024553571428571
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Uniguy772",
                    "index": "54",
                    "likes": "2",
                    "time": "04/10/2020-00:29:50",
                    "content": "A lot of Europe uses the Euro just like certain other countries use their own currency (e.g. the UK uses the British Pound) not the dollar. The dollar is only used in certain parts of the world e.g America with the US Dollar being predominant, so not really sure what you mean by dollars are used in all countries because that’s just not true?     RodAthens:  In my opinion we need the token in strong hands that are interested in the project, rewarding traders is not the way to go   Still believe strongly in what RodAthens said until convinced otherwise that it’s best to have tokens in strong hands interested in the project than reward traders tbh. None the less I look forward to your response ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.970413165266106
                },
                {
                    "author_link": "https://gov.uniswap.org/u/zenithlight",
                    "index": "55",
                    "likes": "1",
                    "time": "04/10/2020-05:17:25",
                    "content": "A burn rewards strong hands. You only receive the benefit of the buyback as long as you do not sell. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.638888888888889
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Uniguy772",
                    "index": "56",
                    "likes": "2",
                    "time": "04/10/2020-08:21:22",
                    "content": "So does redistributing as redistribution would still be rewarding the strong hands and “Whales”. As I’ve said before in other posts on the topic they are really both much of a muchness with the exception that Burning makes each token more valuable and reduces the circulating supply every time which I personally believe to be a better option. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.380208333333332
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Francis",
                    "index": "57",
                    "likes": "1",
                    "time": "04/10/2020-16:53:41",
                    "content": "Mmm yes very interesting Holders gaining UNI bay just holding it in there wallet, until the max supply hit’s in 4 year. sound’s like a Unicore investment to me. and will attract way more holders. ofc people ho contribute in the ecosystem need to get compensate accordingly (more) (contribute = div, voters, stakers etc) If we implement delegating voting we need to split the reword into a fair chairs, a % fore the token holder and  a % fore the delegate voter. So the holders have intensive to allocate and delegates (voters) to delegate (vote) Further we need to find out if we gone give a APY % to all Holders and voters, how much that gone realistically. Also we need t look at sustainability, can we have nice APY to cover the gas cost on short term? we need to keep in mine we gone get a lot of new people coming into to crypto space the coming years  and we need to provide eazy solutions fore theme, there gone come in and tray stuff out and the next weak thy wanna tray something else. So we need to provide the proper setting fore them. I think this can be that proper setting. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 6.119755244755245
                },
                {
                    "author_link": "https://gov.uniswap.org/u/1337n0m4d",
                    "index": "58",
                    "likes": "1",
                    "time": "05/10/2020-14:44:31",
                    "content": "So far, I have not seen any reward for holding UNI. My investment in UNI as I bought, has tanked 50%. Not happy. Holders should be rewarded with more than the ability to vote in governance. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.333333333333333
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Uniguy772",
                    "index": "59",
                    "likes": "0",
                    "time": "05/10/2020-14:49:04",
                    "content": "There were ways of earning one of which was by adding to liquidity pools I assume you chose not to add to a liquidity pool and this you didnt earn any additional uni. Just giving out uni because someone is holding it in a wallet just doesnt make sense compared to providing uni in the form of a reward to someone contributing by doing something like providing liquidity to one of the elected pairs as seen on app.uniswap.org ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/1337n0m4d",
                    "index": "60",
                    "likes": "0",
                    "time": "05/10/2020-14:51:26",
                    "content": "So I add my UNI to a liquidity pool and then have less UNI when I cash out? Also it is unclear what is the safest Wallet to use ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.166666666666667
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Uniguy772",
                    "index": "61",
                    "likes": "0",
                    "time": "05/10/2020-14:55:07",
                    "content": "By personal preference I would use a hardware wallet especially after the recent Kucoin attack. Most definitely wouldn’t suggest you store your coins on an exchange as they can be the prime target of an attack Would read up on liquidity pools as they can go either way you could receive UNI where someone wanted to exchange UNI for ETH or you could get ETH where someone wanted to exchange ETH to get some UNI and tap into your uni supply. All the eligable pools as of right now can be found here ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.654761904761905
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Uniguy772",
                    "index": "63",
                    "likes": "0",
                    "time": "05/10/2020-15:02:24",
                    "content": "couldn’t say there will always be sell pressure as a lot of tokens were airdropped while there is still evidence to suggest most haven’t sold their airdropped tokens there’s always the risk the day will come that a lot of people could choose to sell in a single day. Again this is all speculative and not really appropriate for this forum so I wont digress any further ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.2232142857142865
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Uniguy772",
                    "index": "65",
                    "likes": "1",
                    "time": "05/10/2020-15:05:40",
                    "content": "its difficult to see losses I can understand that hopefully whatever happens you end up happy and you’ll stick around and maybe choose to govern with your tokens if you see a recommendation you think would benefit the platform and community as a whole ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://gov.uniswap.org/u/1337n0m4d",
                    "index": "66",
                    "likes": "0",
                    "time": "05/10/2020-15:10:36",
                    "content": "I am behind the idea of rewarding UNI holders with a percentage of tx fees. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Approx104",
                    "index": "67",
                    "likes": "1",
                    "time": "05/10/2020-21:33:09",
                    "content": "I think we can make a bounty that will reward $UNI from the community treasury to anyone who can come up with a good bussiness model for the Uniswap Protocol that will incentivize UNI holder to participate in governance and protection of the protocol. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/melveyr",
                    "index": "68",
                    "likes": "1",
                    "time": "06/10/2020-04:53:55",
                    "content": "I think the easiest way to start rewarding uni holders in the short term is with a mining pool. Right now holders of UNI are being inflated away by farmers that farm non-UNI pools, then just dump on the market. This isn’t fair to holders of UNI and I don’t think is causing the intended affect in terms of token distribution. It would be much better if the people farming UNI actually cared about keeping the token. With a mining reward for UNI/ETH, UNI holders could protect themselves from this inflation by participating in the UNI/ETH pool. Right now, UNI holders are bearing all of the protocols inflation with zero offset. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 6.622448979591837
                },
                {
                    "author_link": "https://gov.uniswap.org/u/ageless",
                    "index": "69",
                    "likes": "0",
                    "time": "06/10/2020-08:58:09",
                    "content": "Very much agree. I think we need to significantly reduce the liquidity reward on those pools and make a really high liquidity mining reward on the UNI/ETH pool. Ideally it would be better if we could vest the rewards so only long term holders would eventually receive the inflation. Whatever the reward is I think it needs to be at scale nearly 100% APY to correct for the inflation. The treasury should have no problem making money when the fee switch is turned on so I think the supply of UNI in the treasury should primarily be used to reward long term holders of UNI as oppose to other reasons. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party or author is advertising proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.122727272727273
                },
                {
                    "author_link": "https://gov.uniswap.org/u/mjgla4",
                    "index": "70",
                    "likes": "2",
                    "time": "06/10/2020-09:27:43",
                    "content": "I also voted yes, but I actually agree with active participation. UNI holders should be rewarded, but they also should be active in the network. This can be via voting, potentially promoting or lending or whatever the network needs. However, I do believe the token should try and hold some value and provide incentives to holders beyond governance. I also agree with Po that Uni holders should be rewarded with some of the value from the network opposed to diluting uni supply. Rewarding UNI to UNI holders is pointless, getting value from the network will increase participation in protocol governance and have people more emotionally invested in the success of the platform. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.435185185185185
                },
                {
                    "author_link": "https://gov.uniswap.org/u/thesoulscoder",
                    "index": "72",
                    "likes": "0",
                    "time": "09/10/2020-14:36:10",
                    "content": "where can i go to vote with my tokens ? I bought some ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Dmills",
                    "index": "73",
                    "likes": "2",
                    "time": "12/10/2020-08:00:39",
                    "content": "We should definitely reward people that hold the uni token. BuTT !!! They should be given a reason to hold, long term… We Should make it to were anyone that wants to be rewarded uni tokens for owning/holding uni tokens, should have to hold the tokens for a minimum of a certain amount of time(we choose), we should also add a token earning cap, so we set a number not to high or to to low, this would be the amount of uni tokens any said holder can earn rewards on. This could help prevent whales.  If you hold uni for longer and longer, like 1 year, 2 so on, the percentage your unis are earning should increase. Maybe lastly if your active in governace and voting ideas you get alittle extra, just to say thanks. ( I shortened it for you all, sorry again. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.041341991341991
                },
                {
                    "author_link": "https://gov.uniswap.org/u/mjgla4",
                    "index": "74",
                    "likes": "1",
                    "time": "12/10/2020-09:35:37",
                    "content": "I just saw your other thread dude, you need to chill. When I read your comments, it feels like it boils down to: “make UNI go up, I bought UNI and it’s gone down - make it go up!” However, I agree that UNI holders should be rewarded and perhaps this can be done by their participation in the protocol or like curve have a lock up feature which pays out those that lock up. But I feel like your argument to reward those that bought it opposed to airdrop extremely counterintuitive and essentially impossible to track. A user could just switch to ETH for 1 min then switch back. It also goes against the decentralised nature of the UNI airdrop. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 3.976851851851852
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Dmills",
                    "index": "75",
                    "likes": "1",
                    "time": "12/10/2020-12:09:07",
                    "content": "That’s definitely not what I was saying, airdrop or buy uni, you should earn rewards automatically if you hold the token for a certain amount of time(it could be a month or longer. I thought I explained it pretty well and and everything I was saying would make more people want to own uni, buy it what ever, and for long-term. But thanks I will chill dude. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.470238095238096
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Naught",
                    "index": "76",
                    "likes": "4",
                    "time": "13/10/2020-03:07:57",
                    "content": "A time lock of UNI to receive rewards is a good idea. I would prefer the time lock to be a built in feature of the delegation process, if you self delegate or delegate to another for at least x period of time, then eligibility is gained to receive the reward. Also to feedback on backlash to your comments. You previous comments are long, and have a lot of ideas. Shorter and more concise is better to making your point. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.916666666666667
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Dmills",
                    "index": "77",
                    "likes": "2",
                    "time": "13/10/2020-03:41:55",
                    "content": "I do apologize, to everyone in the space. My comment was long, i was overly excited to share my ideas with you guys. The rewards I explained were pretty complex, but I really thought I had a solid that would help uni stand out from the rest. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.395833333333333
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Nic",
                    "index": "78",
                    "likes": "0",
                    "time": "15/10/2020-03:19:25",
                    "content": "It seems each lawful entity would have to chose between funding their tax burden by selling Uni or paying the taxes and increasing voting power, realized costs, and exposure with every distribution. Tying maintenance of voting power to a tax liability seems like a fraught path. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/HE1-SIM",
                    "index": "79",
                    "likes": "0",
                    "time": "17/10/2020-10:56:06",
                    "content": "Ich möchte und kann das nur mit ja beantworten!!  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/thesoulscoder",
                    "index": "80",
                    "likes": "1",
                    "time": "26/10/2020-02:40:56",
                    "content": "UNI holders should be rewarded with merch, and more UNI. call me crazy xP ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://gov.uniswap.org/u/loveuni",
                    "index": "81",
                    "likes": "1",
                    "time": "30/10/2020-04:54:10",
                    "content": "Yes , I Believe and agree that UNI Holders should be Rewarded for Holding UNI, either by Taking Monthly Screenshots of ERC20 wallets holding UNI, or by Investment and Trade.via UNISWAP. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party is advertising proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Dan007",
                    "index": "82",
                    "likes": "1",
                    "time": "30/10/2020-11:05:20",
                    "content": "For holding UNI you can use trustwallet safely. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/thefool",
                    "index": "83",
                    "likes": "1",
                    "time": "31/10/2020-01:36:29",
                    "content": "I think it makes sense to rewards holders.  I think it’s ok that inflation will erode the governence power, making for a more democratic system where newcomers votes also count, given that they are largely being given out in service of the project. It seems like there’s potentially an emerging representative democracy forming here.   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 6.517857142857143
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Trojan_85",
                    "index": "84",
                    "likes": "0",
                    "time": "14/11/2020-08:54:43",
                    "content": "Thank you for the info  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/uni2",
                    "index": "85",
                    "likes": "2",
                    "time": "14/11/2020-09:17:40",
                    "content": "    Restoring UNI value after LP & airdrop sell-off Temperature Check       In order to involve the community in DAO “governance” by voting, to reward the brave and flex the muscle of “Decentralized Finance”, a sketch of a proposal is outlined below:  Consider that X percentage of the 0.05% TX fee after the switching be distributed to original airdrop wallets as a subsequent airdrop, provided; “the wallets held/hold a balance of 300 UNI during/for some critically defined period of time (to be defined before the vote.)”  The purpose of this is to fix the issue that centr…     Posted since it is a related Temperature Test ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party or author is advertising proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.175000000000001
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Hindel",
                    "index": "86",
                    "likes": "1",
                    "time": "14/11/2020-18:18:35",
                    "content": "Just went through the entire conversation, so far my biggest takeaway is Mr_Po’s comment about the sample to whom the question is asked being highly biased:  #1 I think is poll is highly non-representative of what UNI token holders think, as it’s sample is heavily skewed towards people who want to actively participate in governance. A very small % of UNI holders finds themselfes in ‘Governance-meta’ subforum.  However despite this strong bias, the vote still seems to vastly favor rewards for UNI holders, even without participation in governance. One thing I’m still wondering is whether or not buybacks fall under the definition of “reward” as understood here. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.108333333333333
                },
                {
                    "author_link": "https://gov.uniswap.org/u/keninqiu",
                    "index": "87",
                    "likes": "0",
                    "time": "04/02/2021-04:46:17",
                    "content": "For kline of Uniswap, please check out at flaswap. com ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/sr0x",
                    "index": "88",
                    "likes": "3",
                    "time": "04/02/2021-20:06:56",
                    "content": "From an economic standpoint, yes.  Uniswap holders should be rewarded - in the long term.  And if you believe in DeFi like I do, you need to be thinking long term. In the short term, I think Uniswap should invest in growing the platform and solidifying it’s dominance as a DEX.  In the short term, this may mean the treasury will be better spent incentivizing users and liquidity providers, or hiring developers to accelerate protocol improvements.  Doing this improves the odds of Uniswap being the dominant DEX platform when the market reaches maturity (which could be many years from now). Once the DeFi market matures, I imagine daily DEX volume could be on the order of hundreds of billions dollars.  At that point the protocol fee can be turned on, which would generate billions of dollars daily for the community.  Some portion of those fees could then be used to return money to UNI holders. A little back of the envelope math: $100b daily volume 0.05% protocol fee $50 million daily fees to the UNI community 90% distribution ratio $45 million distributed to UNI holders daily $16.424 billion distributed to UNI holders yearly That’s nearly 3x the current market cap of the token on an annual basis. But the only way returns like that are possible is if we think long term and not get greedy in the short term.  It’ll be a journey, let’s go onward together! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.125
                },
                {
                    "author_link": "https://gov.uniswap.org/u/kaos1478",
                    "index": "89",
                    "likes": "2",
                    "time": "17/02/2021-17:27:49",
                    "content": "I think we need take more people, rewarding holders just make keep the number of investors… Even more with competitors providing a lot of airdrops. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/UniswapFeeSwitch",
                    "index": "90",
                    "likes": "2",
                    "time": "18/02/2021-17:53:57",
                    "content": "If you dont reward people for holding uni, it makes no sense to hold uni unless you are a whale that can swing the allocation of the treasury with great effect. Not rewarding uni holders = exodus to sushiswap and possibly even BSC. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.916666666666667
                },
                {
                    "author_link": "https://gov.uniswap.org/u/tiuni",
                    "index": "91",
                    "likes": "0",
                    "time": "18/02/2021-19:01:32",
                    "content": "Many UNI holders already profit by borrowing against it on Maker, Compound and Aave. Nothing wrong with extra income from fees, of course, unless it triggers LP exodus. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/BerryKing77",
                    "index": "92",
                    "likes": "0",
                    "time": "07/03/2021-08:11:55",
                    "content": "Well said!! Building Money and reputation but your audience that are by you should be regarded and only Uni can make that call! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.uniswap.org/u/ashleigh",
                    "index": "93",
                    "likes": "0",
                    "time": "12/03/2021-17:27:52",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "300"
}