{
    "poll_list": [
        {
            "id": "0xfd3d3807bd2a6eda1327c311b83de235061d39ff1bdfb616c9f9b0d367c3ac2c",
            "title": "Optimism-Uniswap LM Program: Update to LM Managers",
            "discussion": "https://gov.uniswap.org/t/rfc-phase-2-optimism-uniswap-protocol-liquidity-mining-program/19803",
            "body": "This vote is to add an additional LM Manager for users in Phase 2 of the Optimism-Uniswap Liquidity Mining Program. The top choice will be added alongside:\n- Arrakis\n- Gamma Strategies\n- xToken Terminal\n\nFor more information, check out the Uniswap governance forum post:",
            "choices": [
                "add Overnight Finance",
                "add DeFiEdge",
                "add none"
            ],
            "scores": [
                14335.930887314107,
                2710600.235023828,
                3556.089172715455
            ],
            "start": 1673323818,
            "end": 1673585940,
            "snapshot": "16373921",
            "state": "closed",
            "author": "0xA2BF1B0a7E079767B4701b5a1D9D5700eB42D1d1",
            "space": {
                "id": "uniswap",
                "name": "Uniswap"
            }
        },
        {
            "id": "0x8cd74072d4ae997c11fe5351c3a8c3fcd05440091858c1ced911bb2e9043c3bb",
            "title": "Optimism-Uniswap LM Program: Update to Incentivized Pools",
            "discussion": "https://gov.uniswap.org/t/rfc-phase-2-optimism-uniswap-protocol-liquidity-mining-program/19803/10",
            "body": "This is a ranked choice vote to update the Incentivized Pools in Phase 2 of the Optimism-Uniswap Liquidity Mining Program. The top 3 choices will be selected in addition to the existing pools:\n- WETH-DAI 0.3%\n- USDC-DAI 0.01%\n\nFor more information, check out the Uniswap governance forum post:",
            "choices": [
                "add OP-USDC 0.3%",
                "add OP-USDC 0.05%",
                "add wstETH-ETH 0.05%",
                "add OP-WETH-0.3%",
                "update wETH-DAI 0.05% from 0.3% "
            ],
            "scores": [
                13082.5134339128,
                1916.087542903976,
                5708181.431162854,
                964.1847529687436,
                640.6251845894424
            ],
            "start": 1673323553,
            "end": 1673585940,
            "snapshot": "16373898",
            "state": "closed",
            "author": "0xA2BF1B0a7E079767B4701b5a1D9D5700eB42D1d1",
            "space": {
                "id": "uniswap",
                "name": "Uniswap"
            }
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://gov.uniswap.org/t/rfc-phase-2-optimism-uniswap-protocol-liquidity-mining-program/19803",
            "title": "[RFC] Phase 2 - Optimism-Uniswap Protocol Liquidity Mining Program ",
            "index": 19803,
            "category": [
                "Proposal Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.uniswap.org/u/kenneth",
                    "index": "1",
                    "likes": "5",
                    "time": "16/12/2022-19:55:44",
                    "content": "In progressing forward with the Optimism Uniswap Protocol Liquidity Mining Program, we are seeking community input for Phase 2 where 100k $OP will be disbursed over 3 weeks time. Before providing our parameter recommendations to adjust for Phase 2, we wanted to take a step back and highlight some key takeaways from Phase 1. As part of the Phase 1 retrospective, the Uniswap Community Analytics Program (UGPCA) promoted a bounty (Bounty #20 - Optimism Liquidity Mining program) to explore the impact the LM Program had on Optimism, on the Uniswap protocol, and on the community selected pools. The winning analyses below:   @xiz_zelos - https://medium.com/zelos-research/optimism-liquidity-mining-program-analysis-35fe7a105314   @1chioku - https://dune.com/1chioku/0ptimism-liquidity-mining-round-1   @superamscom - https://dune.com/springzhang/uniswap-optimism-liquidity-mining-program-performance   We summarize some key takeaways of the impact of Uniswap on Optimism below:  Many LM-related tokens flowed into Optimism before the start of LM. The number of users interacting with the cross-chain bridge increased significantly before LM started The liquidity of Uniswap on other chains has not been significantly reduced because of OP’s LM The liquidity pattern of Optimism Uniswap LM-related pools shows that there may be liquidity migration between different fee pools. Impact on incentivized liquidity pools:  WETH-DAI 0.30% / DAI-USDC 0.01% - The liquidity of the two pools has increased due to LM WETH/USDC 0.05% liquidity in this pool has not increased significantly Overall, the capital efficiency of the three pools has improved, LM also reduced the transaction slippage on the pools, but this effect is less significant in the WETH/USDC 0.05% pool.Partner projects   LM has increased the liquidity locked in each partner project and the value and the TVL at the end of LM phase 1 is higher than before the start Arrakis attracted the most liquidity, followed by Gamma Strategies and xToken Terminal  Just like for Phase 1, we are seeking the Uniswap community’s input to help determine new parameters for Phase 2 of the Liquidity Mining Program. We are looking for community feedback on the following:  Potential new pools to add Potential new fee tiers to add Additional LM managers  We suggest the following updates:  Replace WETH-USDC 0.05% with WETH-OP 0.05% Add OP-USDC 0.3% Add WETH-WBTC 0.05%  This would expand the LM Program to incentivize 5 pools instead of 3. As a refresher, one point of discussion from Phase 1 was to potentially add longtail assets as a contrast to the major pools. For more information, check out the discussion on Phase 1 ([RFC] The Optimism-Uniswap Protocol Liquidity Mining Program). Additionally, we would love to hear from any new potential Automated LM Managers who would like to be included in Phase 2 and beyond! After community discussion, if multiple updates are proposed around parameter updates, we will create a 3-day Snapshot poll with the most popular options on January 4, 2023. Otherwise, if there is clear consensus, we will move forward with our recommended updates to kick off the program without a vote. ",
                    "links": [
                        "https://twitter.com/xiz_zelos",
                        "https://medium.com/zelos-research/optimism-liquidity-mining-program-analysis-35fe7a105314",
                        "https://twitter.com/1chioku",
                        "https://dune.com/1chioku/0ptimism-liquidity-mining-round-1",
                        "https://twitter.com/superamscom",
                        "https://dune.com/springzhang/uniswap-optimism-liquidity-mining-program-performance",
                        "https://gov.uniswap.org/t/rfc-the-optimism-uniswap-protocol-liquidity-mining-program/17820",
                        "https://gov.uniswap.org/t/governance-weekly-recap/17803/18"
                    ],
                    "GPT-summary": "The author of the post is seeking community input for Phase 2 of the Optimism-Uniswap Protocol Liquidity Mining Program. They provide a summary of the key takeaways from Phase 1 and suggest updates for Phase 2. They are asking for feedback on potential new pools to add, potential new fee tiers to add, and additional LM managers. They also welcome any new potential Automated LM Managers who would like to be included in Phase 2 and beyond. The post includes links to winning analyses from the Uniswap Community Analytics Program and summarizes the impact of Uniswap on Optimism.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Smart contract updates",
                        "Community and engagement",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.684286042240587
                },
                {
                    "author_link": "https://gov.uniswap.org/u/BP333",
                    "index": "2",
                    "likes": "3",
                    "time": "17/12/2022-17:23:15",
                    "content": "Thanks a lot @kenneth for this analysis! I just wanted to give some feedback on the following:     kenneth:  We suggest the following updates:  Replace WETH-USDC 0.05% with WETH-OP 0.05% Add OP-USDC 0.3% Add WETH-WBTC 0.05%    With regards to replacing WETH-USDC 0.05% with WETH-OP 0.05%, both xToken and Gamma Strategies have received 300K OP each to incentivize the WETH-OP 0.3% pair for 6 months.  I think xToken may have a couple more months in their program, and we’re planning to launch our program for the next 6 months soon.  That’s currently the most dominant pair on Optimism at the moment, and it will still get incentivized for quite some time.  I think if we were to make the switch, it would be some time in phase 3 perhaps, but it may not be necessary.  There isn’t much competition for that pair at the moment, but the 0.3% WETH-OP pair will likely be dominant for a while given the current incentives there. I agree with adding OP-USDC 0.3%, and I think that can replace the WETH-USDC 0.05% pool.  image2088×456 73.9 KB  OP-USDC is the 4th highest volume pair, and Velodrome is winning that route at the moment. I think we can be opportunistic there and capture the lead for the OP - USDC route with just a bit more liquidity incentives.  We have around $600K in the pool which is accruing around $500K of volume.  Just a bit more liquidity there, and we’ll most likely have the lead. With regards to WETH-WBTC 0.05%, I don’t see much volume or traction for WBTC on Optimism very much at the moment.  image2094×158 19.1 KB  Despite $2M of liquidity in the pool, the volumes for this pool have been quite poor.  I just don’t think there’s as much demand for WBTC on Optimism.  That could change, however, but Uniswap currently has dominant market share over the WBTC-WETH route despite there not being much volume there. I would suggest adding wstETH-ETH 0.05% on Uniswap.  Given the tight correlation, we can do pretty tight ranges on wstETH/ETH and get higher TVL per incentives.  I will ask the Lido team if they would also be willing to co-incentivize that pair to see if that would make it more amenable for the Uniswap community to approve this pair.  They’re currently co-incentivizing this pair on KyberSwap Elastic, but I think Uniswap’s offering of co-incentives are a lot stronger. I personally think these liquid staked ETH products will see much more volume in the future, especially when the Shanghai update allows for staked ETH withdrawals.  We could start seeing a lot more volume in this pair, and it would be good to have a sustainable source of liquidity here.  At Gamma, we’ve run some profitable simulations on wstETH-ETH even without the incentives, so I think if we were to get some bootstrapped liquidity here, that would be long-term beneficial. ",
                    "links": [
                        "https://global.discourse-cdn.com/business6/uploads/uniswap1/original/2X/d/d9d7a613151b8c6e59932e8b15c3ba087ca318c2.png"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.930952380952381
                },
                {
                    "author_link": "https://gov.uniswap.org/u/mjc716",
                    "index": "3",
                    "likes": "3",
                    "time": "20/12/2022-16:46:10",
                    "content": "Good analysis from the Gamma team across the board. We (xToken) also agree that there’s an opportunity to lean into the ETH liquid staking space on Optimism, bringing in Lido, RocketPool and others. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Maxim",
                    "index": "4",
                    "likes": "3",
                    "time": "22/12/2022-12:48:05",
                    "content": "Thank you for this. Maxim, the founder of Overnight Finance here. We have created delta-neutral strategies based on Arrakis and Gamma - ETS. We were a major liquidity provider to Arrakis’s wETH/USDC vault, expect to be the major provider to both Gamma and Arrakis once the program resumes. I would like to make a proposal about the pairs to be incentivized and offer for Overnight Finance to participate in the liquidity mining program as Uniswap’s partner. First, it could be helpful to have a specific vision of what we are trying to achieve on OP. So far, Polygon is by far the most successful of Uniswap implementations outside of mainnet ( i was not permitted to include the screenshot of the Polygon’s pool analytics page). Pairs leading by volume are ETH/USDC, Matic/USDC and USDT/Matic - all 3 are crypto-to-stable pairs. None of them are 0.3% fee tiers. Obviously, OP and Matic are not the same as OP is not a gas token, ETH is. But if Uniswap is to lead on OP, it should put its efforts in  wETH/USDC -0.05% OP/USDC - 0.05% (not 0.3%) wETH/DAI - 0.05% (not 0.3%)  There is an opinion expressed and supported above that wETH/USDC is fine as is and should not be promoted, and other pairs require incremental rather than a major push. Although, tactically justified, i think this is wrong strategically: Uniswap is not leading on OP in the most important pairs and is at par/behind Woofi and Synthetics (I tried and was not permitted to include 1inch trade routings for 100K USDC trades into OP and ETH - but they show very high percentages for Woofi and Synthetics, often exceeding those of Uniswap) Bottom line, a major push on wETH/USDC and promoting lower fee tiers on OP/USDC and wETH/USDC should be the strategic goals and LM program needs to target to achieve it. Second, I would like to propose to include Overnight’s delta-neutral strategies ( 'ETS\") based on Uniswap V3 on OP into this LM program by compensating underlying volatility rather than a uniform reward distribution improving the APY. I clarify below how that would work and what unique benefits this approach would bring Overnight’s  has been producing delta-neutral strategies based on Uniswap V3 (example on our dApp) and Quickswap V3 (example on our dApp). Essentially, people mint the ETS with USDC (or DAI), which is then used to borrow wETH and farm wETH/USDC on Uni V3 within a [concentrated] liquidity range. The position is then regularly rebalanced using external bots. Profit is calculated daily in USDC and passed over to ETS holders via rebase. The delta-neutral strategy based on Uni V3 is profitable per se, without rewards. But it can have negative days, e.g. recently during FTX collapse or Binance FUD. The not so often daily losses are the major barrier to bringing conservative stablecoin yield maximizers into ETSes - this investor segment is more concerned with not losing rather than maximizing profits; if this çoncern’ is eliminated by Uniswap with rewards, that would channel significant liquidity to underlying Uniswap crypto-to-stable pairs. Thus, we propose for Uniswap to allocate part of the LM program to ‘çompensating ETS negative yield on the days it occurs’ rather than providing the usual rewards increasing APR on average across the board. This can be done by deploying and seeding overnight’s insurance for the respective ETSes (example on our dApp). This approach to LM would provide the following benefits to Uniswap:  stimulate concentrated liquidity where Uniswap excels rather than wide liquidity, where Uniswap is close to par with all the Uni V2 forks bring new liquidity from the ‘stablecoin investor segment’ into crypto-to-stable pairs, the source of liquidity Uniswap has not fully tapped into yet reward efficiency as measured by trading volumes per unit of rewards - by spending rewards only on compensating negative days; also due to underlying profitablity of delta-neutral strategies on Uniswap V3 per se and larger volumes that concentrated liquidity drives  I understand this is unconventional approach and Overnight are not a well known player. We are obviously open to a long DD and backtesting of our ETS technology. However, I suggest to just give it a try and assess the results after Phase 1. Also, tagging @OPuser , the leader of the Optimism’s DeFI committee C, which recently awarded Overnight a grant to promote its products, including ETS. I hope @OPuser could provide a reference. At your disposal to answer questions here and over video if necessary. Merry Christmas everyone! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.32536773989899
                },
                {
                    "author_link": "https://gov.uniswap.org/u/CrazyTurk",
                    "index": "5",
                    "likes": "2",
                    "time": "22/12/2022-18:05:38",
                    "content": "Delta Neutral ETS s are a great way to bring retail users who do not want to deal with the hassle of managing concentrated liquidity manually. (Speaking myself as such a user) I believe it will be a great boost for Uniswap in Optimism if this proposal is implemented. Thank you ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving entirely positive feedback on proposal"
                    ],
                    "Sentiment": 7.666666666666666
                },
                {
                    "author_link": "https://gov.uniswap.org/u/BP333",
                    "index": "6",
                    "likes": "1",
                    "time": "22/12/2022-18:45:39",
                    "content": "On second thought here, I think OP-ETH 0.05% will eventually take over. I’ve also noticed that ETH-DAI 0.05% is now outperforming ETH-DAI 0.3%.     Maxim:  There is an opinion expressed and supported above that wETH/USDC is fine as is and should not be promoted, and other pairs require incremental rather than a major push. Although, tactically justified, i think this is wrong strategically: Uniswap is not leading on OP in the most important pairs and is at par/behind Woofi and Synthetics (I tried and was not permitted to include 1inch trade routings for 100K USDC trades into OP and ETH - but they show very high percentages for Woofi and Synthetics, often exceeding those of Uniswap)   Thanks for bringing this up.  I’ve been lazily just looking at Dexscreener which is not indexing Woofi.  That’s super interesting.  Do you know how they’re getting these volumes on such little TVL?  My guess is they’re somehow centrally aggregating funds for max capital efficiency or maybe something similar to the request-for-quote system that Hashflow and Paraswap pools have? I’ll try to do more digging, but that’s pretty fascinating how much they’re dominating the ETH-USDC route on Optimism.  I feel like this was recent. So yeah, this does change things, and we should probably keep in the ETH-USDC incentives.  We’re also doing something different for Phase 2.  We’re introducing a concept of wide/narrow range management.  Essentially the narrow ranges are for those who take a directional view on volatility, and the wider ranges are for more set-it-and-forget-it types.  But the point is, those who choose to do narrower ranges could help out in the trade execution competition. Would love to also learn more about your delta-neutral strategies!  Will send you a DM ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None"
                    ],
                    "Sentiment": 5.867758620689655
                },
                {
                    "author_link": "https://gov.uniswap.org/u/Maxim",
                    "index": "7",
                    "likes": "1",
                    "time": "22/12/2022-20:39:19",
                    "content": "yes, Woofi are the RFQ model, similar to that of Hashflow. We do trade a lot when we rebalance our delta-neutrals and RFQ-based players are the real, if not only, competition to Uniswap that need to be fought against. And indeed, driving concentrated liquidity would have so much more effect. i must respectfully disagree that wide range positions are for passive investors without a directional view. There is a ton of research, not to mention our humble experience, that passive LPing on Uni V3 does not work. We could not make any decent money on the wide range passive positions (accounted for in USDC) without rewards. it is actually worse, by design, than Uni V2 for the wide passive range. But it does not mean one needs a directional view. Rather, a position cant be managed passively, but can be non-directional - something we are doing with our delta neutrals. Lets continue via DM ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.259548611111111
                },
                {
                    "author_link": "https://gov.uniswap.org/u/BP333",
                    "index": "8",
                    "likes": "1",
                    "time": "23/12/2022-00:17:08",
                    "content": "    Maxim:  yes, Woofi are the RFQ model, similar to that of Hashflow. We do trade a lot when we rebalance our delta-neutrals and RFQ-based players are the real, if not only, competition to Uniswap that need to be fought against.   Oh ok that makes sense.  RFQ definitely does well on the bluechip pairs like ETH-stables. Hashflow and paraswappools have done well on Mainnet, and it looks like Woofi is gaining some steam too.     Maxim:  i must respectfully disagree that wide range positions are for passive investors without a directional view. There is a ton of research, not to mention our humble experience, that passive LPing on Uni V3 does not work. We could not make any decent money on the wide range passive positions (accounted for in USDC) without rewards. it is actually worse, by design, than Uni V2 for the wide passive range.   Which pairs were you testing here?  ETH-stable is very difficult to be profitable on.  Typically you need at least two out of these three attributes to be profitable on Uni v3: (1) high correlation (2) high fees/tvl and (3) incentives. So, ETH-stables are hard to be profitable in the absence of hedging, unless there were some incentives involved.  And we define profitability in terms of HODL-ing the assets vs. LP-ing the assets just to make it apples-to-apples. So we chose a 10% to 1,000% range on ETH-USDC which had the best performance over the past year.  It was around 1% more profitable than holding which isn’t a whole lot, but not horrible either given the volatility. However, if you analyze WBTC-ETH or wstETH-ETH, we ran into a lot more profitable simulations.  Just higher correlation + higher fees/tvl were much better. Borrowing the assets definitely increases the profitability curve a bit since you would have more downside protection on the ETH portion that is borrowed. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.413844086021506
                },
                {
                    "author_link": "https://gov.uniswap.org/u/0xfast",
                    "index": "10",
                    "likes": "11",
                    "time": "28/12/2022-09:24:50",
                    "content": "Hello everyone, we are from DefiEdge.  Introduction We have created a liquidity management layer over Uniswap V3. Our strategies provide a permission less, non-custodial method of aggregated liquidity management over Uniswap V3. DefiEdge makes managing liquidity on Uniswap V3 much easier through various unique tools and features:  Support for multiple ranges Automated Strategy Management Limit Orders on Uniswap V3 using Gelato or Chainlink Keepers Single or dual asset deposits Management and rebalancing through a strategy manager Swaps for rebalancing are executed using 1inch to provide access to deep liquidity and reduce slippage Simple and intuitive UI to assess performance Native support for liquidity-mining rewards  The platform has already attracted significant liquidity on different layers over a short time period: Current Protocol Metrics:  TVL: 892.169k Fees Generated: 4.118k Total Volume: 11.6M  Currently the following are being actively managed via our Platform  Total Strategies created: 225 Active positions: 297   Incentivize Pool We have been managing some liquidity in the OP/WETH (0.3%) Uni V3 pool for over one month OP-WETH DE strategy.   DefiEdge   OP/WETH Strategy Long-range deployment using drift-volatility forecasting.      These are current stats for OP-WETH pool on DefiEdge:  AUM: 984.5$ Fee APR: 19.65%  It shows good returns even without any liquidity-mining incentives. The strategy has generated approximately 20.5% fee (annualized) so far. The returns over forty-days days are approximately 2.4% in USDC and 6.4% in ETH, even though OP has marginally lost value against USD over the same period (0.986-1.01 USD at the time of first deposit). All this analysis can be viewed through our UI and verified on-chain. ** As our platform allows for multiple ranges, liquidity managers are free to allocate capital across different ranges based on different market forecasts.  Rewards Structure Rewards should be distributed based on the fee generated through the strategy to ensure active liquidity and distributed gradually. We propose the OP/wETH (0.3%) pool for the LM program. The rewards are distributed proportionately to the amount OP earned as fees. We will manage 2M USDC of liquidity in each pool for six months and distribute 120k OP. Fees in OP will be roughly equal to the fees earned in the other token in USD (which has been the case in our observation across all UniV3 pools)—given a fee APR of 15%, that would amount to roughly 156k OP tokens fees. With 120k of OP as LM rewards, this would translate to an approximate 40% APR boost in the user’s fee APR. ** There might be mild fluctuations in the numbers with price volatility in the individual tokens’ prices. The numbers reported here are as of 28th December 2022. ",
                    "links": [
                        "https://app.defiedge.io/s/optimism/0xa5c2490a10a41fa1262999d848fa3391523ccee9"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party or author is advertising proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.093088624338624
                },
                {
                    "author_link": "https://gov.uniswap.org/u/kenneth",
                    "index": "11",
                    "likes": "1",
                    "time": "10/01/2023-04:12:43",
                    "content": "Thanks to everyone for providing their input over the last couple weeks! Just to recap, as part of Phase 2 of the Optimism-Uniswap Liquidity Mining Program, 100k $OP will be deployed to incentivize Uniswap LPs on Optimism over 3 weeks. We sought the community’s input to update different parameters for the program to sustain long term LP growth. Based on the input above, we’re moving forward with 2 snapshot votes on the following parameter updates: Make changes to the following pools (ranked choice vote for top 3)  add OP-USDC 0.3% add OP-USDC 0.05% add wstETH-ETH 0.05% add OP-WETH-0.3% update to wETH-DAI 0.05% (from wETH-DAI 0.3%)  Add new LM teams  add Overnight Finance add DeFiEdge do not add anyone  Cast your votes now! Snapshot links below, voting ends on January 12, 11:59PM EST: Update to Pools Add LM Managers ",
                    "links": [
                        "https://snapshot.org/#/uniswap/proposal/0xfd3d3807bd2a6eda1327c311b83de235061d39ff1bdfb616c9f9b0d367c3ac2c"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.455808080808081
                },
                {
                    "author_link": "https://gov.uniswap.org/u/kenneth",
                    "index": "12",
                    "likes": "1",
                    "time": "13/01/2023-23:36:22",
                    "content": "After asking the community to provide their input to update parameters for Phase 2, we now have results from the two Snapshot polls! The results outlined below: Dates  Start: Wednesday, January 18, 2023 End: Monday, February 8, 2023 (3 weeks)  Incentives  100K $OP tokens  Pools  WETH-DAI 0.3% USDC-DAI 0.01% wstETH-ETH 0.05% (newly voted in by community) OP-USDC 0.3% (newly voted in by community) OP-USDC 0.05% (newly voted in by community)  Liquidity Managers  Arrakis Gamma Strategies xToken Terminal DeFiEdge (newly voted in by community)  After the completion of Phase 2, we will conduct a retrospective, similar to that of Phase 1, with key takeaways and learnings to iterate on Phase 3 and the completion of the first Optimism-Uniswap Protocol Liquidity Mining Program. Good luck to all LPs! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.044034090909091
                }
            ]
        }
    ],
    "group_index": "251"
}